{"month": "10", "state": "GA", "station": "WNGH", "content": "Syringe outwards and your GPS we're in a dream station network of Georgia Public broadcasting is limited before ten o'clock I'm ... I'm Glad you've joined us this morning one or your next level\nThat you were an Eighteen station network of Georgia Public broadcasting it submitted before ten o'clock Andre Dawson glad you've joined us this morning one a as max at at eleven o'clock it's on point an G. P. B. S. G. P. B. news dot org\nAnd the next fresh air the crisis had Facebook and the scrutiny it faces as the midterms approach\nWe talk of the Evan us now is a staff writer at the New Yorker and that Facebook's recent massive data breach and about its role and disseminating information as noticed his latest article is titled can Mark Zuckerberg fix Facebook before it breaks democracy China\nRussia or is this afternoon at three on G. P. B. N. G. P. B. news dot org\n[noise] Ninety seven point seven FM double your gp be end WG ... H. D. room portable Georgia Public broadcasting radio network [noise]\n\nThe black lives matter movement has no central leadership but it does have some big names like dream of cats and how does he see his place in the fight for justice\nFrom W. A. M. U. and NPR in Washington this is one egg [noise]\nHey there I'm Joshua Johnson today on one age ... his advocacy goes beyond issues of police brutality and his work goes further than organizing grassroots protest there is no lack of issues to keep him busy but now he's reflecting on his time and activism\nEspecially in the four years since the protests in Ferguson, Missouri how does he face the difficulties of being a full time organizer and what's in his future\nWill get to know dream of casting and explore his new book on the other side of free to\nOur conversation is on tape but we always love to hear from you so comments on our Facebook page or tweet us at one egg [noise]\nLine from NPR News in Washington encore of a Coleman the national Hurricane Center says tropical storm Michael is now over central South Carolina\nIt's top stained Windsor at fifty miles per hour it continues to move east and will strike North Carolina and parts of southern Virginia later this afternoon\nIt will move into the Atlantic ocean later tonight Michael crashed into the Florida Panhandle yesterday as a major hurricane with the wind speeds of one hundred fifty five miles per hour catastrophic damage is feared\nStephanie Brandon is with the red cross staged in\nCain with wind speeds of one hundred and fifty five miles per hour catastrophic damage is feared Stephanie Brandon is with the red cross staged in Tallahassee, Florida\nBelieve mobilize hundreds of volunteers around the country and even in the states that fact it and they're ready to roll up their sleeves and help those affected Eighteen eighties\nAt least two people have been killed in Florida and Georgia\nAnd hundreds of thousands of customers do not have power\nThe Russian space agency has to spend in all flights of its Soyuz rocket program following a dramatic launch failure today an astronaut ... had to make a hard emergency landing Matthew bother reports from Moscow the crew has been safely recovered in remote context on\nThe Russian space agency so that it is investigating the cause of the failure but will hold no press conferences today\nWhat is clear that the ... will not fly again until the cause of the failure is identified a live broadcast or the launch showed that the Russian American crew experienced the sensation of weightlessness and spinning a boost their separation signaling that it serious problem had occurred\nRussia's space program deep in crisis has experienced a series of high profile launch failures over the past decade\nBut never in a twenty year history of the ice that program has a man so he's rocket experienced a problem on launch the failure follows the discovery last month of a mysterious hole in the ... spacecraft currently dogs to the international space station this has raised questions about quality control for NPR News I'm Matthew Bodner in Moscow\nStock markets in Asia plunged today following yesterday's sell off on Wall street Chinese markets plunged by five percent on Japan's Nikkei average was down nearly four percent markets in Europe continue declined NPR's Uri Berliner says there are several reasons for the global sell off\nA among them a technology stocks which are really propped up the market which aboard the market for so long uh they've started to fall\nI'm as well as there are higher interest rates for all kinds of things you'll on treasury bonds are up that could make them more attractive and starts and hanging over all of this or the trade tensions between us and China they're real they're not going away and this could be making the mood in the markets darker and\nPears are in Berlin or in Washington me most stock market seemed to be recovering a little bit today on Wall street the Dow Jones industrial ... forty eight points at twenty five thousand six hundred and forty seven the NASDAQ ease up about fifty points the U.S and the five hundred is up five [laughter] this is NPR\nTwenty five thousand six hundred and forty seven NASDAQ eased up about fifty planes and the five hundred is fine this is NPR [noise]\nLive from the G. P. V. newsroom good morning I'm ... Dawson just ahead on one a a conversation with a young political activist\nAbout his battle strategy is to create change in America but first in GB news over three hundred thousand households in Georgia started the day without electricity this morning Georgia Power says more than one hundred eighty thousand customers were without power and Georgia e mc reported approximately one hundred sixty thousand outages mostly in the southwest\nRon shipment is with Georgia Power\nAlways treat any downed power line as a power line so stay away from it don't do anything don't touch it just notify us and look out for our work crew personnel on the road and mom if you can move over and stay safe out\nThere shipment says estimates on power restoration will become more clear as the company continues to assess the damage was Georgians assess the damage from the hurricane the red cross is prepared to help people displaced from their homes Georgia region communications manager Ashley ... says the agency will likely open multiples shelters today and tomorrow\nWhat location are kind of\nOnline getting ready to go to where the old ed kids will step where they can call us out there I took\nA cruise in southwest in central Georgia are out checking reports of down trees another storm damage officials encouraging residents to stay home during this time we'll have to back to back it's from hurricanes over the last two years coastal Georgia has a ... the worst of Michael\nGlenn county's emergency management agency says the storm left only minor damage in that area and the crews were able to address it quickly from Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter We're at\nGp being news\nThis is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video [noise]\nYour gp be weather forecast for this Thursday mostly cloudy and windy today with periods of rain as the effects of Michael move away from us eyes in the mid to upper eighties clear and cool tonight losing the fifties friday mostly sunny far less humid hides in the mid seventies too low eighties [noise]\nMostly sunny far less humid eyes in the seventies eighties [noise]\n[noise]\nThis is one day I'm Joshua Johnson in Washington [noise]\n\nHappened four years ago\nFerguson police officer Darren Wilson shot and killed an unarmed black\n[laughter]\nA young man Michael Brown late in the street for four hours\nWeeks of protests followed with thousands of demonstrators from ... and beyond\nPolice fired tear gas\nDeployed riot [noise]\n\nArea and they even set up a so called five second rule or anyone who stood still for more than five seconds was arrested [noise]\n\nHow did the ... and go from Minneapolis to Ferguson, Missouri those protests and the police response to them caught my caissons I\nHe was a community organizer from Baltimore working for the Minneapolis public schools he drove from Minnesota to Missouri nine hours each way to protest soon he was making that trip a lot and eventually he quit that job and moved to Missouri to organize full time\nToday for years later activism is just part of my caissons identity he also hosts the podcast pod saved the people he ran unsuccessfully to be the mayor of Baltimore and his new book is called on the other side of freedom the case for hope\nDuring the cast and welcome to one day it's so good to be here tell us about the book's title on the other side of freedom what's the title about what are you trying to stay there\nYou know I used to travel much more around the country talking to young people talking to the older people and what I realized that we have a deep understanding of decided freedom so we know and they found a freedom a third of all the people killed by strangers killed by police officer we know that we're at the more people for marijuana than all\nViolent crimes combined we know so much about this tiny freedom in we have a lot of work to do\nThat I wanted to talk about like how do we get to the other side of freedom what did it look like what does it feel like how do we get there with the strategy in the plane because I Know that when I Do\nAnd we have a lot of work to do that I wanted to talk about like how do we get to the other side of freedom what did it look like what does it feel like how do we get there with the strategy and the plane\nBecause I Know that when I think about what freedom is that its course not only the absence of oppression but the presence of justice enjoy that we can get rid of all the bad things and that doesn't mean that the good things automatically come into the bay area we have to fight for those\nSupport for ... comes from generous listeners like you and Callaway resort and gardens Georgia's authentic outdoor escape Callaway offers twenty five hundred acres of hiking and bike trails lake fishing PGA level golf and more more information at Callaway Gardens dot com\nDoes your busy life keep you from staying informed TPP has you covered you can listen live the TPP news dot org and on your smart home device follow us on Facebook and Twitter at gp be news [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that\nMatter to you on the beach if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but at the top of the page thanks so much for your general supportive G. P. B. and the service we provide every day [noise]\n\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\n[noise] and from the Newseum committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR\nIs one day I'm Joshua Johnson we are speaking to dream of catching the host of the podcast pot it's safe to people and the author of the new book on the other side of freedom the case for hope one by graphical thing I did want to ask\nSend the host of the podcast pod saved the people and the author of the new book on the other side of freedom the case for hope one by graphical thing I did want to ask you briefly you right in the book that teaching was the most important thing you ever did how did teaching helped lay the groundwork for activism [noise]\nUh you know it's funny I don't myself is very old but I taught a decade ago my my students the students are like twenty Twenty one now which is so wild [noise] ah\nYou know teaching was incredible not only because it was urging everyday like every single day I had to show up as adults a scream at every single they had to show up in our math to my students had to be as prepared and I taught sixty nine hundred and twenty minute classes which has a whole lot of math or anybody who's ever there an eleven year old\nUh what I learned there are a couple of things one was like how to take really complex information and break it down into\nPieces that are can be consumed and can be repeated back so my skill was like what I had to learn was not only had to like get kids to understand like when the crazy ones but like I did teach discreet skills like you know into things started sometimes means multiplication rank and like\nHow to take apart these big things to make them bite side and then have students to be able to play with them in a way that they could put them back and rearrange on their on their own\nOr the second was like really understanding what it means to\nLike do work that will have an immediate impact but we'll have a long term impacts so I remember I'll never forget teaching negative numbers they struggle they like they can get in like anything lower than zero there like I don't get it by the end they can fight anybody around like how to solve the most complicated equation and they like deeply understood it\nAnd that was like understanding like the arc of how to build capacity um like I learned that the third thing is I think the best teachers with the ... just walk in the classrooms and they know the gift existed long before they got their ... and then like I work is to help\nStudents understand that they can access the gift long after I'm gone after the teacher's gone with the worst teachers do is walk in the classrooms and make people believe that the gift only exists in their presidents and like that is I think and such a corollary to organizing that when I travel anywhere where I'm In my own community\nThat like what I'm trying to do is help people find the gift that they have because they already have them they might not know they might not believe they might not know how to use them\nAnd that what I can do is help them find them and then use them long after we're gone\nSo let's get some questions about the black lives matter movement Morgan writes black lives matter is purposefully without a central leader so how does he you direct TV with his role was in the movement what has he done to ensure that\nBlack lives matter is purposefully without a central leader so how does he you direct\nTV with his role was in the movement what has he done to ensure that people do the names of the three black women who actually started ... I think Morgan's referring to Patrice ... ... and Alicia Garza who helps propagate the black lives matter ... after the Trayvon Martin shooting through it\nYeah so when we think that the movement the movement is an expansive space and I write about this in the book is that\nI you know for those of us who were industry in Ferguson we're mindful that there was nobody who founded the space there was nobody who started the protests there was no one to three ten people who caught us all to the street who organized everybody wants to beat of about the protests that\nAh it was organic there were a set of people who came out every night thousands who made the protests last and you have to remember\nThat we were there for four hundred days and most people remember as a long weekend which is unfortunate that there's this narrative that if that has come up that is a race so many people that suggested there was like a small group of people who started everything who came in St Louis to organize every body the organizations did that work\nAnd that's just simply not true someone I think about like how I use my platform of how I think about my work\nIs that I'm mindful that I was one of many people in the book a highly so many people who are industry in St Louis who did incredible work for whom without you wouldn't there would be no protests\nAre so that is important to me and then the second part is that I Know that the platform doesn't only exist for me that\nOne of the important things about having the platform and access is that not only do I try to make sure that the truth is president everyone but I also know that I'm not the only person that can bring the truth so you don't know the people who said all the protesters every night or the\nThe people who got people out of jail or the people who helped organize some of the biggest actions that people just sprayed across the country like you've never heard those names are in the book I Try and write about those people too that I Know them because I was there we were in the middle of the street together\nBut this narrative that there's I guess most of the people who like started every thing in the movement or that there's a small set of organizations who like\nWhat a catalyst for the protest is just not a true narrative\nThere's always this tension with movements that have certain\nPeople certain leaders to become more prominent\nWith the concerned about but who profits off the cause I mean there are some who would critique the book and the podcast is a way to profit off of black lives matter how do you respond to that and I also wonder if there is any plan to use any of the proceeds from the book\nTo profit off of black lives matter how do you respond to that and I also wonder if there is any plan to use any of the proceeds from the book to help the cause\nIt's it's interesting I think I'm always ... you know I feel like I live a pretty public life and I'm always shocked um by some of the the way the question gets asked so like it's public that\nOr a portion of all the proceeds went to the end of ... a portion of all the pre order sales went to the N. double ACP legal Defense Fund that was\nPublic I did it 'cause it was important and it was my way of saying that like I Want you to buy the book but the book also like I Want the process of buying the book to also do more work than just buying the book raised to like that's I think about the book specifically\nBut in general this basic I'm mindful of this and when we started camping zero which is like our our biggest project starting twenty Fifteen a we actually didn't participate in the nonprofit funding like the nonprofit sort of wreaths for funding specifically because of the question that you asked\nSo over the past three years we raised a about a hundred and sixty thousand dollars per year which is not a lot of money and the grand scheme of non profit to me did it so that\nWe could just raise enough money to do the work that we that was important right so we created the first I was a database of police shooting contracts at first it public database of use of force policies continue to do a lot of data work that hasn't been done before continue to support organizes around the country and really disagree projects [noise]\nNo I I Know paid staff I'm not paying salary from this stuff so we try to do it is like it\nWould just the bare necessities so that it's not just a question of like profit uh\nAnd with the cash you know like I could have the packets could have just been my voice but I don't think that makes sense so I invited Brittany than Clinton being part of it they get paid as a part of the broadcast because I think that that makes sense um\nAnd it's not like some you know huge moneymaker but it does allow us to like be able to be in a place where we don't have to rely on a nonprofit a\nComplex to like fund our work to do this really well\nAnd you know it's a guy at\nThe way that I exist in the world right now is like not necessarily a sustainable way I'm not by state allows me to like\nOh no no I mean like I don't have you know it's like I Know that not and that's what I have a salary but um you know when I quit it was really rough it was like you know I didn't have health insurance like you know I'd defaulted on my student loans like he was a really rough um it was rough [laughter] only it's only a couple of months ago and the first time and I'm actually lived alone since the protests\nOn like he was a really rough um it was rough [laughter] only it's only a couple of months ago and the first time I've actually lived alone since the protests I've ever since you've been saying in the basement of a like my second parents after the past three years right so\nYou know so that's not a ... you know wants to get married in the in the basement of their second parents that's not the same time but it's like it's the right way that I Want to be in the work right now right that like\nThere are these narratives and like oh I made it gets ... and it's like well now you see me on the news you came in a pod cast you like the me out of an event that means a lot to you and like that automatically means of wealth to some people and that's just not\nThe case that I've had high incomes before you know that they their income and wealth is pretty significant though um some people have been like really confused by that\nLet's talk a little more about policing one of the members of the one eight text club writes police hold a significant position of power in the legal system they should be held to a higher standard than those without power but instead they are held to a lower standard and given special treatment and a free pass in our courts and society\nGood a G. P. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\nSupport for G. P. V. programs comes from our listeners\nAnd regions thing helping businesses secure the capital needed through lending practices with financial and business schools firmly in mind from bankers with helpful advice and guidance information available or regions dot com slash lending\nAnd Georgia State parks as things get shorter and temperatures start dropping there's no better time to huddled around a campfire at Georgia State parks information and rates available at the G A state parks dot org [noise]\nI'm making a took her body coming up with an excellent point conservative Max Boot was one of the biggest supporters of the Iraq War a former editorial page writer for the wall Street Journal but he left the Republican Party sees the Iraq War is a mistake and now says the only way to give rise to a true center right Republicanism is to vote against the modern age ...\nHe'll explain that's coming up and then at some point from NPR News this morning at a weapon on G. P. B. Angie Be news dot org\nSupport for NPR comes from this station\nAnd on G. P. B. Angie BBC News dot org\n\nSupport for NPR comes from the station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom clothes and rates are available online learned more progressive dot com or one eight hundred progressive now that's progressive\nFrom capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere capital one what's in your wallet capital one in a [noise] and from listeners like you who donate to this NPR station\nBack now to our conversation was during the cats in his new memoir is called on the other side of freedom the case for hope let's talk about some of the more personal aspects of your life that you describe in the book there's a short section in the book like page and a half\nWere you talk frankly about your mom leaving the family when you were a toddler and the fact that you never have asked her why she left a leader in the chapter you write code\nI'm mindful that we remember pain and trauma differently than we remembered joy and triumphs\nWhen we remember pain we are trying to protect ourselves and cope with trying to order the memories in ways that will allow us to make it to tomorrow and it's the day after tomorrow unquote\nTalk about how those kinds of traumatic or difficult experiences as a kid kind of helped to shape you as an adult particularly an adult who would gravitate toward activists\nYou know it's interesting ah this is the first time saying this because it just happened is that my mother read the book um and she texted me recently and it was like hey to re read the book we talk and I just haven't had a Kevin I'm with right back it so hopefully I write facts to\nIs one of the reasons why I wrote this chapter in the ... I can remember and now with that and it's one of the reasons that I wrote the chapter was that I Know that we walk into every room bringing much more than we name\nHim one of the things that I bring into every room is what does it mean to be worthy that if she could leave than it feels like anybody could leave and I like that is something I've had that sort of work within and grow with as an adult to make sure that that doesn't hurt me or other people and like that's important as we think about what it means to organize is that like\nWe're all walking into rooms and meeting people where they are part of meeting people where they are that we know where we are and like I think that that has to be like a\nCore part of it uh the the part that you read about like how we remember pain\nWhere where they are part of meeting people where they are that we know where we are and like I think that that has to be like a\nCore part of it that the part that you read about like how we remember pain and I remember joy\nIs that for so many people you think about like the constraints would a million people who grow up in marginalized communities where there's poverty rates\nThat or any other aspect of their identity they they learn the constraints really well I Know I knew how much money we had the family and I knew would pass what not to ask why new like when we didn't have toys how to make fun outside or you know a lot of people talk about growing up poor but I said\nOne of the hard part is like when we grow up and it's sometimes we still only see a world of constraints semi constraints becomes so great and the way that we learn how to survive that we can start to imagine things beyond it and if we're ever going to win like it'll be like a deep imagination that gets us to the other side\nAnd my eating by the diversity in the right and the left is at the right has always re packaging old narratives for a new time the left we're always engaged in the most intense make believe that like we're always trying to tell a story about a world that nobody's ever seen before but we know it's possible you've never seen health care for all but like you believe it you've never seen a world where every woman has a right to choose we believe that that's real\nAnd like telling no stories actually really hard and there's no way to to be really good storyteller about a future that you've never seen a few aren't able to tell stories about the world that you live and how you entered the world\n[noise] you also share fairly late in the book the fact that you are a survivor of sexual assault something that you write happen to you numerous times at a rather young age\nAnd you connect that was what you call the client quiet about the assault but also quiet about your own identity and your sexuality you've been out for some time in the book you write in part quote\nI think about the quiet instead of the closet because I've never eaten any part of myself from myself or others you go on to write quote but I grew up quieter about the parts of myself that I didn't think anyone would love\nThe parts that I had never seen loved in others unquote how does that interact with the person you became\nHere you know one of the reasons are important for me to be out very very um [noise] I mean amount for a long time but to be publicly out in a in a very sort of overt way when the protests began with like I didn't want any kid growing up who was also gay to think that the only way\nTo do this where it publicly with to to be in the closet and ah you know that chapter started from this tweet that I wrote a long time ago that was like just because you didn't know doesn't mean it wasn't real like I was in the quiet and the closet\nAnd ah you know I I Walk in\nAnd they treat that I wrote a long time ago that was like just because you didn't know doesn't mean it wasn't real like I was in the quiet and not the closet\nAnd ah you know I I Walk into every room as a gay black man I'm like that is real to me it's important though there was no way for me to write a book about the work that we've done the work to all of us have collective with social justice or the work that we need to do without talking about a mile an identity\nThat I wrote about the the sexual assault because it was re oh it's one of the things that I haven't really talked much about I mean it's in the book now so it's not just you know it's not something that only I Know\nUm [noise] but it was like sort of\nIt with ... in some ways to finally just they and like not have to tiptoe around and not be ashamed but if they did this happen in and it was real and it was awful and you know when I told when I when I finally told a couple of years later and they realize that he'd actually been\nSexually abusing like a whole set of kids who are even younger than me um\nTo like you know speaking up actually made a difference in other people's lives and like that was important um ... had to like you know I write about in the book is that like my own relationship to my body I had to learn that I had to learn what it meant to\nBe in relation with other people and like it'd be one where we were ... years and we both have the same amount of power because that wasn't the first experience with my body right as I wanted to just give language to that\nHow far do you think that that outlook is actually goes I mean I I'm Out I've been out from most of my own career if not all of my career\nBut I Know that there's you know there's this aspect of what I Believe is referred to as an implied attribute where it's kind of known but not experience so there's a difference between me saying Oh yes I'm active with the national lesbian and gay journalist association\nAs opposed to me showing up you know a picture of me at a bar with my shirt off making out with a guy in the corner like it's a whole different kind of being out because people are OK knowing it in the abstract but they don't want to know that you're actually like a gay person who does good things and that changes the conception\nDo you find that there was a line in terms of identity versus full identification like okay you know let's not say anything more about this let's not make them think any more about my identity and they have to be\nI think we have to complicate this idea of like what it means to show up and gave the bike and there's not one way right that they're not two ways to be gate and like\nThe pride parade is really really all that like yeah so like sometimes it is the way rainbow shoes right and sometimes it is just like going on a date and like that it and like those are both valid way to jump in and the identity that I Am right\nThat is the way rainbow shoes right and sometimes it is just like going on a date and like that and like those are both valid ways to jump in and the identity that I Am right uh so\nSo yeah there definitely people who are frustrated me who feel like I'm not gay enough in like\nThat I don't talk about gay issues is publicly as possible and like\nYou know it's one of the things too that it's like well how much of my life dry leaves like other people can feel like it's real re so like I Know that you know we're working with the research right now they're trying to think about HIV testing that like one of the things that some new research suggests that\nIt's not that people when people don't get tested it's not they don't care about their health or that they're necessarily afraid of their results but that or did they actually nervous about showing up at a facility and in cities that are that function as small towns and they're nervous about seeing somebody they went to high school with seeing like somebody's cousin friend re like that they actually are nervous about like what privacy really be private right\nAnd like how do you actually or how do you set up a testing mechanism that gets around that that to me it's fascinating and like so we don't quite work around that but like I have I don't feel like I Need to talk about every two seconds for people to be like they're actually cares about being gay right\nSo the other thing I think that there's some people who I can really homophobic but like me and that's not helpful but I don't want to be like a safe spot for your eight\nYou also talk very frankly in the book about your bed for mayor of Baltimore your willingness to meet with President Obama and with the presidential candidates Hillary Clinton and Bernie Sanders you write that because of your willingness to engage quote\nThere were calls from within the protest community and from without accusing me of political grandstanding and labeling me a sellout unquote I Wonder how you are finding your way\nForward in these new endeavors whether it's politics hosting a podcast so in a way you are part of a media so to speak and reconciling with tons of the social justice activism word that you're still ... involved in is that challenging to kind of have a foot in both worlds as it works", "show_name": "1A Plus", "year": "2018", "city": "Chatsworth", "day": "11"}