{"month": "10", "state": "GA", "station": "WAOK", "content": "And at least now there's what's called a national appetite to consume this information that was a time when if you said quite people treat black people like there's nobody in the national beer Warner to even have that conversation go now there is a national appetite\nFor that conversation so what happens in the media the media would not feed you these stories because there is a appetite that's an appetite for the story that's not a bad thing for zero point not to to seven zero three that gives you the compensation for zero for\nEight not due to seven zero three you get rid of the main radio news and talk Thirteen eighty W. A. okay\n[noise] [noise]\nOn her with those students too much truth that we can now do you ... dot com ... who's the talk of the gene\nW E okay new voice the community [noise]\n\nUser chance to win a thousand dollars you might know where's mom\nIn the national contests and she said\nLadies and gentlemen you know what time it is you're not seen it before another opportunity for your when one thousand dollars and W. I. okay we do this because\nWe're we're kind [noise] grab your cell phone if you don't have a cell phone yeah so well I Can't help you have a cell phone picks the key word\nWeekend W. E. E. K. E. N. D. to seven to eight one weekend a seven to eight one two when your thousand dollars another opportunity is right here near the top Thirteen eighty W. A. okay\nFor use sports with\nWas so good news for a long distance on Thursday\nNewsroom doctor do you\nMean the news radio finally ... first lady Melania Trump to save after her plane made an emergency landing this morning\nSmokeless detective or the air force jet a few minutes after take off from joint base Andrews in Maryland prompting return to the military airport no injuries were reported\nThe first lady was headed to an event in Philadelphia to promote her be best campaign the mystery surrounding the disappearance of Washington Post columnist Jim ... remains today secretary of state Mike Pompeo has now left turkey after meeting with Turkey's president or to one today to talk about the missing journalist ... traveled to Turkey's capital\nAfter meetings other doesn't parents with Saudi Arabia's leaders in Riyadh\nThe body of missing her Jamal ... have still not being fined and the Turks still to make public the evidence they say they have\nAgainst the Saudis remember the response blood between these two countries they are both he went and saw live [noise] I mean you must know literally shuttling between the two trying to get answers for at least trying to get some agreed story\nNBC News correspondent bill Neely 'cause she'll be hasn't been seen since the end of the Saudi consulate in is temple earlier this month Bloomberg is reporting special counsel Robert Mueller is ready to deliver the key findings that his investigation into Russian interference in the twenty sixteen election\nTo unnamed U.S officials said Mohler we'll divulge what he's found shortly after the November midterm elections as he faces growing pressure to produce more indictments or shut down his investigation\n... focus on the to keep playing to the investigation whether the Trump campaign colluded with Russia and whether Trump himself to any actions that constitute obstruction of justice Mueller's findings won't necessarily be made public it'd be doesn't secure unsealed indictments and you can present his findings only to his boss deputy attorney general Rod Rosenstein\nMike by our reporting and the red Sox are two went away from a trip to the world series they beat the Astros eight to two in game three of the A. L. C. S. in Houston you're listening to the latest I\nRemember thinking mom had ice in the back of her head like or a superpower was spot in trouble before it happened well now it's on us to protect our home and family and spotting troubles weight tougher\nThat's my parents' trust blink blink video cameras are motion activated so placing them around your home because like having ice everywhere\nCameras or why are free set up and minutes and run on to W. batteries last up to two years bringing technology\nPut a blink camera on your front porch to spot package sleeves and wonder alerts you for strangers working around your yard\nAnd parents love blinks live feed auction the electric checking from anywhere using your blink smartphone app\nSo you'll know when your kids get home from school\nBlink camera systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent off all security cameras visit blink protected dot com slash radio over offer details that's blink project dot com slash radio like as an Amazon limited time offered terms and conditions applied\nAnd you know an ad from um [noise] I Know how an auto with\nProgressive and have on your car insurance [noise] excuse me maybe we should add an award money so they know that they're seeing and money and then in K\n... how how just now to me\nOK well he's got enough funds to pushing their progressive cats review from becoming your parents but we can save your money when you go home and all across the country insurance company for other insurers just coming off a little stricter situation\nWhich is building a better bank looked like\nIt starts with building capital one cafes warm inviting place that feel nothing like a typical bank\nThe all new radio jak combat is available now it's a totally new experiences which listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list here in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nAnywhere\nI'm Joe Adams I'm a pharmacist I'm also a parrot that knows the pain of losing their child to an opioid overdose\nWe lose sixty four thousand lives a year due to this epidemic no one is immune from yes I attain\nWhat I viewed as the highest level that I could reach within my profession and yes it happened to my family your pharmacist has a huge impact on you as a provider of\nHealthcare promotion it's important to have an open line of communication with your pharmacist about safe medication usage including opioids the members of the national association of boards of pharmacy focused on ensuring that\nPharmacies and pharmacists are providing safe medications a patient services for you and your family I Will never see my son again if you think that can't happen to your family like again learn how to keep you and your loved one's safe at ... dot pharmacy\nLoses talks Thirteen eighty W. A. okay\n[noise] all of them\n\nLaw but let me\n[noise]\nWhat's that going back in the way it's always good to be with your you still get a break the rules ban on the radio\nThe A. C. L. U. of Georgia chicks all smart justice Georgia campaign we're going to talk about that\nIn the studio I have Andrea young executive director a C. L. U. of Georgia in the building how are you it's great to be here how are you I'm Glad to have you here are also uh I got to mention our big ... Elvis who's the political director of the ACLU of Georgia a remarkable\nTransition transformation story he has yeah [noise]\nAnd going to talk about that story or an hour that next\nWeek [noise] good stuff yeah let's discuss what you guys are doing with this campaign\nYeah so you know this is a early voting has started I Hope everyone has their plan to vote a and we want people to understand what they're voting for and so smart justice is on the ballot if you believe that our criminal justice system is broken\nThen you have an opportunity to vote for people who are going to help continue to change our criminal justice system to make it more fair to end mass incarceration and to end the racial disparity that is affecting so many of our people in our community\nAnd so we've got a um we have a smart just as campaign we've got a website that tells you where all the incumbents stand on criminal justice reform a and also where the people at the top of the tickets Dana nuts uh I'm smart justice Ga dot org\nYou guys are not a partisan organization\nYou know we are not partisan we are on the issues\nYour background to the ACLU or specifically the ACLU of George right\nWell so the ACLU of Georgia has been here since Nineteen sixties one of the things we first started to do was to enforce what was then the new voting rights act\nUm and so uh when my uh dad Andrew Young first ran for Congress\nOr there was an attempt to again do some funny business and dry him out of the ... congressional district the ACLU or defended him and I had those lines are redrawn so we have always had to focus on voting rights the enforcement\nYou can protect clean water in our community by joining the clean water challenge to get involved visit our W. L. A. dot O. R. G. that's I W. L. A. dot ORG\nAnd now a page from the diary of low\nSkewed angry that goes to this house is protected to progress at the ... the hockey how would you explain that radiator like clanking sound for the moon colored light in the hallway that's gone by morning and he became never bundled home in auto and he's due to suffer and attorney\nIn an average of Seventy percent on car insurance when you want to comment on it\nThe all new radio jak combat is available now it's a totally new experiences with listening at your fingertips we made it easier than ever to access the radio stations you love now will save your favorite stations and\nOthers to you based on your list here in the news and information you rely on even when you are near radio you can take this station when you're on the go\nDownload the all new radio dot com apple on your smartphone\nFor any way [noise]\nDo some talks Thirteen eighty W. A. okay actually we\nGot to see an ad in that I could say oh this is talk Thirteen eighty do you feel\nThat way [noise]\n[noise]\n[noise] what's happened\nWalking back and say hey C. L. U. of Georgia kicks off smart and justice George campaign\n[noise] this is in concert with area and Davis\nThat are airing in a really exciting ... I joined the smart justice campaign\nUm you know she wants to put her her influence yeah a behind a you know ending mass incarceration and racial injustice in our can will justice system\nUm she's going to be um you know hosting a hosting are that she's also doing a Facebook app for us so um we're just we're really pleased to have her involved in this in getting this effort to the younger people because we've got to get younger people to understand that voting matters and that they can make a difference with their boats\nAnd she needs ... returned my phone call [laughter] so I don't know what's been happening maybe maybe I got one of the day just wrong or something I'll be ... next week yeah let's also talk about the the people you highlight a we know about Burrell was yeah and his remarkable story and now he's a political director of the ACLU of Georgia\nAre you also have um adored the Adams African American woman in her early seventies\nWho stole a six dollar in Ninety nine cents a can of peanuts yes that was locked up for Fifteen days in these horrific conditions yes because she was unable to pay yeah a thousand bucks bond\nAnd so we want and and she got out because of a black mountains bail out by song so we want to highlight you know what's being done in the name of Georgia voters right that these things are being done in our name these folks these judges these prosecutors\nSheriff's they represent us and so we don't want this kind of injustice happening in our community so we're we want to educate people what the what the system looks like on the inside so that people will come out and vote for change\nI'm such a supporter\nOf ending mass incarceration also these ... these very low level crimes people getting locked up losing their livelihood over it yeah for the last three years this was before the city of Atlanta ended the cash bond symbol basically probably to jail\nI Would call ... ... and I will go down and and I've done this I did this three years straight and usually we would do it around Christmas or around fathers their Mother's Day\nAnd I would tell the jeep listen I Want to list of everybody who is locked up in jail on a fine and I'm going to come to ... everybody's fine and\nThere for Jay walking to something else you know they were literally in there for under one hundred bucks yeah for Jay walking and absolutely no of a charge\nAnd it's costing the county more this house ... to do this yeah and you know and it's actually an unconstitutional thing to give people find that they are unable to pay\n'em and so this is one of the the the laws we will be testing it just was passed in the last criminal justice reform that people are able to get those sentences readjusted um but it is a waste of resources and these are resources that could be used on education or recreation and on healthcare things are communities need\nLet's talk about eight hours pronounce it last night ... ... ... ... ... and we've had paid on the program mhm and Katie and I met a sheet of white female or painted on that\nAbout two or three years ago when our moderated a panel of criminal justice reform and she had this really great story about excuse me how she transitioned in her own thinking because of her son and now she has this strong advocate shadows everywhere everywhere so talk to us about K yeah\nSo ... is you know we're a Republican suburban white young whose son got caught up in the drug war\nAnd and she became an advocate uh for ending massive crush wrong to advocate wrong advocate Oregon and organizing mothers and telling the story you know that when your child goes to jail the whole family goes the mother goes with them\nAnd so this is of course something that resonates in our communities\nAnd she's really been an advocate were really glad to be working with her\nOB because we've got we're also going to be working on a multi faith initiative we've got to get a moral voice in our community around ending mass incarceration redirecting those resources to things that are communities need to be strong and healthy and vibrant\nAnd so we're we're really this is going to be at the Georgia State law school\nOr on Wednesday October twenty fours a at six thirty\nAnd uh we we want the community to come out of that sort of a an evening of early voting mobilization an action a and also you can go to the smart justice Ga website and find out where all your candidates stand on criminal justice reform and civil liberties\nWhat made you get involved and there's a lot of work do you ... I mean it was kind of the family business yeah there'll be a civil rights leader what what made you say you know what I Want to do it at this level\nYes well you know I feel like for me this is sort of a combination of of my career I mean I'm I'm Georgia born ... ah I Am one of the people who you know even though I was a kid did walk with Martin Luther king in Selma yeah [laughter]\nAnd so this has just been you know my mission has always been to to to actually make Dr King's dream or reality not just in America but globally because Dr King had a global vision\nThat every person's life matters that every child should have the same opportunity to fulfill their potential no matter where they're born\nAh we're fortunate in Atlanta and we have to be leaders we have to be moral leaders on these issues\nAre and I'm very grateful to be representing the ACLU in Georgia we have a wonderful tradition where the home of two Nobel Prize winners\nAnd we've got to make our state reflective of the values of Jimmy Carter Martin Luther king and the many other leaders who Benjamin Mays or who have been standard bearer as bearers for human rights around the\nWorld in your opinion what is the greatest threat to our freedom and democracy\nWell right now it's apathy and people not getting out to vote because we do have a democracy but it is a ... ... ...\nNow it's apathy and people not getting out to vote because we do have a democracy\nBut it is a ... ... participatory sport you cannot sit on the sidelines in a democracy if you are not at the table you will be on the menu and so we have got people have got to get off the sidelines and understand that their vote counts their vote matters and they can make the difference believe\nWe did so much more I aunts are my parents' generation did so much more with less\nYou know we have money I mean ... you know is I mean TI is speaking out we have people who can get national attention\nAh we have so many more resources we can make a difference we can transform the state and make it a place where everyone is welcome and included everywhere\nThere are people who call Marshall sometimes and they say were shot I don't vote I don't vote because my vote doesn't count over because the system is corrupt and I explained Everytime systems are simply people that's it you changed the people you change the system is voting did not matter they would not try so hard to keep you from doing\nThat is correct that is correct look at how we we feel that we're almost in hand to hand combat at this point\nI'm every single but we have to fight for every single vote\n'em and so everyone who everyone has got to get out and participate in this uh lashed election we cannot say how critical it is whether you care about immigration whether you care about algae beauty rides whether you care about women's rights whether you\nCare about racial justice whether you care about criminal justice reform what ever it whether you care about the environment\nOr what ever you care about you got to get out and make your voice heard in this election early voting has already started it out there and do it\nHow can people connect with the George ACLU\nWe uh you can follow us on Twitter um ACLU of Ga a we're on Instagram we're on Facebook and we have a website ah ACLU a Ga dot org and we also have are smart justice website smart justice Ga dot org\nFrom coming into the building of getting to the elevator um no I Would I Would tell you this we have a son parking spaces are building and I have come home on a number of cases that found people in my spot now have ... friends with people about that because that's obstructed me prevented me from going home\nBut as far as coming into the building she was completely on the line and ah I think he handled it\nVery well he was ... way a lot more calmer than I Would have been because I might have snapped and you know set a few choice words but he handled it wonderfully I was very pleased with uh and I think that's one of the reasons why viral because he was so calm but you know when we're in those positions resort we can't react like they want us to\nRead yeah but I Can't so let me tell you this round the state of with you man if something like that happened to me you are going to see the reaction of a man who was offended who's ... who's who's frankly tired of you being in my way\nYes absolutely I I I Would have understood if\nHe right reacted they've got to understand the other side to that a big ups to him for the way he he composed himself that would not have been me but I'm thankful that God did not choose for me to be in that kind of situation yeah\nI I think you're right and again kudos to him a let me just say is in regards to buy a he ought to be boycotted just for introducing the world to uh that white chick I forget\n[laughter] so bad why are you talking about I think ... is that in a U.S that's reason enough to have some have bankers man you're listening or I guess they must be straight up ... I don't know she wrote a rap there was a lot of controversy about her writing wraps or not but that white woman had some head bang he could\nPossibly be if not the worst right up there recording\nB and C is bad enough that see I'm On my way to be as bad or she is one of I got to let you go so she's one of the worst thing in our economy is not up there are right on either one of the\nGreatest female entertainers\nOn the mainland mainly in one of the greatest female strippers I might\nGive her that her that may be true to she's talented\nHey listen you know you'd be careful getting on that elevator\n[laughter] Mario tell your brother [laughter] for the real point now too to\nSeven zero three now you would call my show and talking about a lot of people don't talk about my ...\nAnd that's my baby in the spirit\nShe won a lot of awards and the beauty awards I'm big ... big ticket was there\nYou know four zero for it\n... big was there you know\nFord we're all for it not to to seven zero three\nHow dare that men talk of my car to be in such a way\n\nTo go to Nicole and that led to the colder than well\n... thank you for taking my call banks were called to say I I really get tired of situations happening like this and people trivialize it to some type of sex appeal effort many people\nSay she wanted him she was trying to come up and they came out that she's in the process of the divorce from an African American man they're like oh yeah she just wanted a brother she's mad about missing the egg plant all of that I'm this is serious here\nPeople this is serious happening here and she's still call the police so she was flirting let's not forget that she's still call the police\nSo whatever she was doing is dangerous he could have been killed he could have been locked up anything could have happened to him so why do we always trivial as black men to sex and that sort of things like to me like that's all black me the gloves off she\nWent and almost big you are also when people say that the triple lives being hurt too\n[laughter] it's like it's always go down that oh she won't that she was\nThere with Nicole it wouldn't you agree that it's not\nIf a person believes that that this was a woman a white woman who went out of her way to flirt with this black male that it is trivialize in her to six more so than him\nYeah but I just think it always it just seems to be that's an excuse as always give all and it comes to a black man\nEverybody off the deep for a black man but that's why this happened and I think black Middle Way more than ... against Israel minutes for me of the back in the day that that that was here but we've heard about it how black men were used in that way it was thought I'm only in that way even black women and it just it just I just think that we need to think about that ...\nYeah well now that you know here's the thing from I don't want him to the from the black may do you go so what Nicole I've been a sex symbol for years though I'm sure that they're called opera church called do what they are putting their\nCustom to it so you know second nature at this point\nFour zero for eight nine to two seven zero three the digital conversation today was the real for it not to do seven zero three uh what do you what are your thoughts on the road for a not due to seven zero three you get rid of the mantle radio news adult Thirteen W. A. okay [noise]\n\n[noise]\nI mean it's an issue that much time I listened to we'll talk with the shot of Baileys man on TALK radio Thirteen eighty eight okay [noise]\n\nTo\nGo on New Year's eve we\nWouldn't even want to spot that burglar when he's facing your home or after easy and Sean who's blink camera alerted him a burglars trying to break in while he and his family were home or Shannon who's blink cameras\nWendy what a spot that burglar when he's case in your home or after his head asked John who's blink camera alerted him a burglar tried to break in while he and his family were home or Shannon who's blink camera caught a thief stealing packages both times blink video clips were sent to police to help convict the crux\nBlink motion activated indoor and outdoor cameras are wire free set up and minutes and run on to double aid batteries that last up to two years\nAnd the live feed option let your check in from anywhere using blink smartphone app so you know when your kids get home from school they'll contracts know subscriptions totally affordable and blink works with Alexa\nBlinks cameras systems are back in stock and right now they're Fifteen Percent off that's right Fifteen Percent of all security cameras\nVisit blink protected dot com slash radio for offer details that's blink protected dot com slash radio link is an Amazon company limited time offered terms and conditions applied\nThis flu season one long green sleeves I can make a world of difference so you can protect yourself and so you're close talking co workers helping\nDiving neighbors two month old niece that's my ... specially trained pharmacist said it provided over sixty million shots in two thousand than mine for your flu shot today with a zero dollar co pay with most\nInsurance because protecting the world starts with protecting yours ... justice is nice you know one that's being subject to availability said Asian health related restrictions may play\nA firefighter wrapped up oriented firehouse subs introducing new firehouse pub steaks up with a savory steak crispy fried onions in our rich Belgian beer cheese sauce on top for limited time more than yours firehouse subs dot com and remember a portion of every ... by helps provide lifesaving equipment first response\nSubs joined more subs save more lives limited time only pushback from dissipating location by herself to donate a minimum of one million dollars in two thousand they seem to find some public safety foundation donations went when the person every person who\nMetro PCS is now metro buy T Mobile\nNow you get new plants with unlimited high speed data months long all under the mobile network check out the new metro by the mobile today and discovered the smarter way to get unlimited metro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty bucks for a month later this reduced immature customers men do just re speeds versus on the mobile customers to the extreme to forty percent of able in some areas the store for details in terms and conditions\nWere the reason we invented things like same day delivery and PBS Jay in the same jar weight loss convenience which is what makes Kaiser Permanente so special we offer health care in coverage together rather than having your doctor over here and your insurer there we provide quality healthcare coverage under one roof and\nBring you up for other important tasks like making a quicksand watch Kaiser Permanente together we thrive Katie dot org slash integrated customers and hopefully that will enable it to predict when a when he's ... he's a reply to\nFire fighter wrap up oriented firehouse subs introducing new firehouse pub steaks up with savory steak crispy fried onions in our rich Belgian beers cheese sauce on top for limited time more than yours firehouse subs dot com and remember fortunate every sub you buy helps provide lifesaving equipment first response\nAwesome joy more subs save more lives somebody time only put aside from dissipating location by herself with only minimum one million dollars to done anything by some public safety foundation donations went when the person every ...\nDo some talks Thirteen eighty W. A. okay\nCome back to\nThe heart of Chicago She jealousy and adding that\nI could send a nuisance Thirteen eighty W\nIt sounds ... Thirteen eighty W [noise]\nNot a lot of times I don't know enough never let up on", "show_name": "1A Plus", "year": "2018", "city": "Atlanta", "day": "17"}