{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n[noise]\n[noise]\n\nThe cocaine overture by L. guy that was the Baltimore Symphony orchestra\nEthical is your home for the great American song ... each week old she'll be the best to local jazz in popular song Nineteen\nThirties today from Frank Billy an ally to looks like curtailing Dianne Reeves and Gregory border my mortgage elect spend time with after low Sunday that shapes and BP music radio\n\n\nStations have been Bebe music radio R. W. M. A. H. Biloxi debate you may ... W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be stuck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen on the line at him be beyond ...\nOr gee\n[noise]\n\nSo what makes me ... ... ... ... ... ... ... ... ...\n... ... ...\nCalls\nTo reach but she's the one thing\nI\n... I mean ... ...\nNo no no no me ... ...\n... ... ... or\nSomething like that is true\nThat it's going well\nThe well to\nBreak\nMore the more I think the only\nMedication that I Am\nAnd I'm just name is\n\n[noise]\n[noise] [noise] [noise] [noise]\nWho\nWho\n\n... Mm and need to do\nThat and not eating\n[noise]\n\n\n[noise]\nUp and\n\n\nWho do group boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom\nBoom boom who do\nWho ... who do groups who were coming from the food we need the money\nBuilding boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom\nBoom boom\nSee for the last Thirty years we've got something from Trump for their key on Harold as well as some old go from Miles Davis and from Charles Earl in\nRight now that music that I promised you from the grant Stewart trio Phil stewardess on drums in Paul's views on this is the title track from an album that very much in frogs Sonny Rollins trio the Nineteen fifties and sixties it's called the role\n...\n... ...\nMm Mm\nMm Mm Mm Mm\n\nMm Mm\nMm Mm Mm\nMm ...\n\nNa na na ...\n... ... ... ...\n... ...\n... ...\n\n\n\n\n\n\n\nUh\nNo no no\n\nI'm\nA\n\n\n\nThat's right and that's a very fine album that Gerald Clinton put out in two thousand Seventeen it's called tributary tails and did a featured himself Joe Clinton on all the keyboards as far as I can tell he's the only one listed so he play piano and electric piano\nAnd Oregon and what sounded like a show less in there as well with Logan Richardson on out during that window on tenor saxophone and Justin Brown on drums\nWe started that set out with the tenor saxophonist grant Stewart and a trio featuring his brother still Stewart on drums long pause to keep the base\nThe title track from the album role on and in the middle of the\nMusic from Miles Davis on Blue Note records from Nineteen fifty two ... included Jay Jay Johnson on trombone and Jackie McQueen on Alto saxophone the album is called volume one those things here on jazz Neal hamburger\nWhere we have music from Charles Earl in coming up in just a couple of minutes that Miles Davis recording by the way is something of an anomaly on on a couple of cats or the ... are also featured I should mention Gail Collins on piano and ask prepared for it on base and Kenny clock on drums\nThat was not unusual Miles Davis had worked with those guys I'm fifty second street\nBut what what what was a little anomalous which is easy for me to say is uh eight that this album was on the blue note label Miles Davis you know arguably the most famous jazz musician in history perhaps\nRecorded for a few different ... record labels in the Nineteen fifties recorded for prestige records he later moved to Columbia eventually he recorded for Warner Brothers at the end of his career\nBut oddly enough he never recorded regularly for Blue Note records which was\nIn all intents and purposes the Miles Davis of jazz labels the most famous jazz labels in the world the other anomaly here is that the tomb we heard it listed as Donna and those have you ever listen to Miles Davis is this guy graffiti in catalog\nWill have recognized that tune as in fact Miles Davis a song dig which he had written and record it about a year before the recording that we're so why is it called Donna here and more to the point why is it attributed to Jackie make leap\nWho was the facts opponents on the album Miles Davis was not known for giving up his compositions the for other\nPeople would take the credit in fact just the opposite Miles Davis often took credit for songs that he had not written I'm thinking of a specifically the songs to know and for both of which originally appearing under Miles Davis signature but which has been shown to have been written by any clean had Vincent another saxophonist\nOf the time so without being conspiratorial about it why why why did he owed Jackie McQueen given this dude and let them take credit for\n\nNext up another classic jazz tune of more recent vintage although you may not have heard this version before the song is red clay was written by Freddie Hubbard and he does play trumpet on this version along with Joe Anderson on tenor saxophone there's some wailing guitar from a guy named Greg rocket\nThey're all under the direction of Oregon is than just decides wrist and keyboard is", "year": "2018", "show_name": "PRI's The World", "city": "Jackson", "day": "20"}