{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise] [noise]\n\n\n\n\n\n\n\n\n\n\nThat's the London philharmonic orchestra and ... in ... the conductor was composed by comb Reince on paper the oriental overture I'm Scott Blankenship band if you visit your classical dot org right now you can get some harvest music like front Schubert to download for free\nMusic fans have been around now that there's always more new interesting music if you know where to look at\nThe discovery never stops and young fans which scientists nobody's going to be a secret [noise] but I Do some connection between generations cultures\nRoute we bump pot means\nNo one's together\nHow bitter Sunday night at seven\nOn MTV music radio stations have been Bebe music radio R. W. M. A. H. Biloxi there'll be you may ... ... you may you view\nThere'll be MP in Jackson W. M. A. W. Meridian that'd be it may be struck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online\nWell gee\nIn\n\n\n\n\nFinger popping with the Horace Silver quintet that's the name of the album the tune come on home here at the same to the same solo sung by elaborate Hendrickson raw\nThey all\nLive in a long haul name never run you away\nI knew that\nYou brought that up when\nYou got to be solid jak\nI forgot he was really John\nMy\nSon\nWho was supposed to be\nAnd you need a\nI Know\nI Know your wages I Know\nWould argue I'm going\nI'm all day every day\nThat\nGoes on in love with you\nSo we do over again\nAround\nMeanwhile you're home you're going to\nWoman in me that you would never\nPlenty of women would you like have you been to not\nBigger then soon as you say that are on a junior in a\nOr my Logan\nI don't know they\nDon't have any above me not\nMaybe joining me now\nSay\nMaybe go ... Hendricks and Ross as in David Lambert Jon Hendricks than any Ross\nSinging the solos that Horace Silver\nAnd ritual the trumpeter and junior cook the tenor saxophonist originally recorded on that same to the song is come on home\nThe Lambert Hendrickson Ross version appeared on an album originally titled high flying with the ... trio and the Horace Silver version as I mentioned was on the album finger pop and with the Horace Silver when ... and before that we started to set up with the latest album from ... man Vincent Herring\nRecording it includes the rest of them alone guitars the tour a on trombone along with Cyrus chest not at the piano on a tune called hard work from the album entitled part time right here on jazz with me Neal tester\nWhere we have music with string\nFrom a trio of vogue with all of them pay tribute to other vocalist that's a lot to think about all coming up with a couple of months [noise]\nBefore the singers though the aerial so I'll just extra bonus pool that's been [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\nWell I went\nOh I Do want to do\nNa na na\nNa\n\nWas tall they one\nThree\n\n\n\n... oh [noise]\nMonsoon along\nIn a\nRow\n\n\n\nThat is Loren cannon from her latest album capping off the set of three tunes on which nobody vocalist pay tribute to know the book was to inspire them\nWe started to set up with Dianne Reeves the album entitled the calling was subtitled celebrating Sarah Vaughan when it came out around two thousand and one\nFeature that lovely version of one of the most gorgeous tunes I think in the jazz cannon screw called key Largo there was written by the extraordinary Benny Carter and their song by Dianne Reeves\nIs in the middle of a sudden we heard a fairly new album from Greg reporter his latest recording is called Nat King Cole and me so you can figure out who he is honoring on this album which features arrangements by Vince Mendoza your keys keys keys or\nWhich was a hit for Nat King Cole means maybe maybe maybe\nAnd then we just finished as I said listening to Laura Kennan and diversion of never will I married which is certainly Sprite when future back ten men on base encourage Jensen on trumpet along with Jared strongly on drums\nThis is from the album Loren cannon released in two thousand Seventeen\nOn which she takes all the songs that were done by cannonball laterally and Nancy Wilson on their famous album of the early Nineteen sixties and I'm that was a tremendous boost for both of their careers and on this recording a Loren cannon\nWho is best known for her work with the New York voices is taking all those tunes and recorded them in the order they appeared on the album but in strikingly different interpretations so it's a tribute to Nancy Wilson and cannonball out early but also a completely ah Lauren ... project\nThe album is called a sweeping be obese here's one more for your body the latest album from Tom Harold called moving pictures reaches a rhythm section headed up by Danny grits at at the piano and this competition which is entitled G. H. B. O.\n", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "13"}