{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\nWow\nWell uh\nOh oh\nThe\nThe for freshmen with a marvelous arrangement to Bobby troops their hearts are full of spring that arrangement was very influential to and later recorded nearly note for note by the very young Beach Boys\nAre closed off this tribute to songwriter Bobby troop with one more song performed by the man himself\nThis one comes from his Nineteen fifty eight album hears to my lady recorded with Ross Garcia and his orchestra that lady in question was unquestionably troops soon to be white singer Julie London\nAnd this original song by troop closest off the album this is Bobby troop with his\nSong Julie is her neck [noise]\nWho has gone on a ... just made two big is\nA is to set the homeless or my [noise]\nDisarming show [noise]\n\nHas gone place and so warm and so sweet\nWhich the Mona Lisa Monaco [noise]\nShe has gone through marriage\nThe line that ideal is to home let's talk about\nUm [noise]\nIt's been very they're kind of\nThe crime that shows\nNow you know what are the captured one\nI'm\nUm\nNow you know what a God should one Mm\nNews\nChewed [noise]\nAnd\n\nBobby troop with Julie is her name a song dedicated to his wife Julie London and thanks are tuning into this tribute to Bobby troop on after glow\n\nAfter glow as part of the educational mission of Indiana University in produced by WSBIU public radio in beautiful Bloomington, Indiana the executive producer is John Bailey\nProduction support for after ... comes from Selma coffee house and juice bar specializing in juices espressos and fair trade organic coffee\nServing from downtown at Kirk wouldn't grant and on the corner of third and Jordan on line at I hearts Selma dot com playlists for this and other after low programs are available on our Web site that's at Indiana Public media dot org slash after glow\nMy Margaret chill up and joined me next week for our mix of vocal jazz in popular song from the great American song here\n\nAttention all educators NPT has partnered with the secretary of state's office to host\nThis year's promote the voter initiative healthier students learn important lessons about civic engagement wow having fun in the classroom this opportunity is for K. through twelve students across Mississippi get them engaged with the ... election plus are an essay contest for more information about promoting the vote for\nOr just sign up your class or school visit\nMTV on line ...\nStations have been ... music radio R. W. M. A. H. Biloxi W MA boondoggle W. M. A. U. Butte\nThere'll be MP in Jackson W. M. A. W. Meridian W. M. A. B. structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nO. right it's\nThe currents I'm Greg liquor welcome rich rich with music curator at the right place Tracy Chapman's the kinks but we must remember Don Ritchie or\nYou think when you present the\n\nDream dream direction the writer now\nAbout the humanitarian ground\nWhat bothers you want to try\nMan lost in China\nYou could\nTournaments awesome thing to\n... for a\nJob still can\n\nRemembering David Bowie with where are we now from nothing has changed that's got to be telling us with Apache before that from jeeze like LA rubber mirror ball with skin walkers moon and it was ... nobody left to correct\nThe subconscious works and funny ways when you're a teacher you know I was just thinking about Richie Havens the other day on\n\nThe plane to him in a while oh how about this one and all the data and listen to it on the big speakers in my living room\nAnd sure enough there was a person there about running election so something in the back of my mind was thank God I play the song 'cause we've got to vote\nThat's right\nSo in there somewhere Julian code underway and right now let's check out this new went from about ... Muscle Shoals small town big sound excuse my fear is in the blind boys about what about\nAnd it didn't touch it then\nMoved to you and if it's the same thing you\nA bottle of champagne\nYou're in a way that the channel to do this day\nAnd\nYou look for a gym there but thank you\nThank you thank\nYou just read today I\nWould say\nProspect know na\nNa na na\n\n\n[laughter] [noise]\nDa da\nThe day to day oh no no\nNo no no would you change\nNo no no but\nThe me too\nI'm In a um a three\nA chain reaction when a that any man\nThey ... they may\nGiven a good\nBe a no no\nThe wrong words Jay\nBe too much Jay\nWhat Jane reaction when they need\nMake ...\nMake ...\nMakes you say\nDo we\nYou think you know\nMay have been up\nLive in the\n\n[noise] [noise]\n'cause you know\n\n\nOh\n\nNo no I just got to know [noise]\nWhy\n\nWhy don't you settle\nNo\nNo no no no\n\n\nI don't know [noise]\nAll your years [noise] you couldn't really show\n\nA a a\n... yeah\nSay a\n...\nUh\n\n\nUh\nWell uh\n\nUh\nThe the\nThe for freshmen with a marvelous arrangement of Bobby troops their hearts are full of spring that arrangement was very influential to and later recorded nearly note for note by the very young Beach Boys\nAre closed off this tribute to songwriter Bobby troop with one more song performed by the man himself\nThis one comes from his Nineteen fifty eight album hears to my lady recorded with Ross Garcia and his orchestra that lady in question was unquestionably troops soon to be white singer Julie London\nAnd this original song by troop closest off the album this is Bobby true with his song Julie during the\nWho has gotten a ... just made to be ...\nEyes to set the homeless or swine [noise]\nDisarming ... [noise]\n\nHas gone space and so more than ... suite in\nWhich the Mona Lisa Monaco\nShe has gone through marriage\nOn\nThe line that ideal is to home let's talk about\nUm [noise]\nIt's been very very kind to\nThe kind that shows\nNo you know what are the captured one\nUm\nI'm\n... now you know what the GOP should one Mm\nWho's\nChewed one [noise]\nAnd\n\nBobby troop with Julie is her name a song dedicated to his wife Julie London and things are turning into this tribute to Bobby troop on after ...\n\n... is part of the educational mission of Indiana University in produced by WSBIU public radio in beautiful Bloomington, Indiana\nThe executive producer is John Bailey\nProduction support for after ... comes from Selma coffeehouse in juice bar specializing in juices is ... and fair trade organic coffee\nServing from downtown at Kirk wouldn't grant and on the corner of third and Jordan online at ... dot com playlists for this and other after low programs are available on our Web site that's at Indiana Public media dot org slash after ...\nMy Margaret chill up and joined me next week for our mix of vocal giants in popular song from the great American song here\n\n[noise] attention all educators MPP has partnered with the secretary of state's office to host this year's promote the voter initiative to help your students learn important lessons about civic engagement wow having fun and", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "11"}