{"month": "10", "state": "MS", "station": "WMPN", "content": "I once saw Bobby McFerrin as a guest conductor lead just sat movements and a performance except for the musicians didn't know they were going to be playing it that night it was a fun little surprise that was Simon Rattle and that recording with the you gotta fill harmonic the second movement from Beethoven ... symphony number knowing\nCoral\nYet you're MBP car tag anytime it doesn't even have to be up for renewal simply go to your county office to sign up when you get an NBC car tag fortunate to be helped impede continue to educate informed and entertainment\nFor detail does it end he be online dot org slash car cat\nWe'll see you on the ...\nThe stations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. you view\nThere'll be MP in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood\nCheck out what's happening on MTV music radio and listen on line at him be be online dot org gee su drinks\n\n\nMm Mm no\n\n\n[noise] Jackson State university would like to thank the following bomb threats for their support and students scholarships and the inauguration of its eleventh president Dr William be binding gym near and without your continued dedication and\nThis would not be possible our goals moms are are not new energy you know the housing alternative L L C Dr Roosevelt and visit us injury Mr Jean Martin Dale ... and John rated general contractor who needs to be demeaning our\nOver sponsors art ... L L P Dallas printing Yolanda R. O. J. F. U. N. A. a president in two thousand\nAnd fourteen or two thousand and maintain can be held in them and Dr John and this is Mary people demeaning construction in the bigger surfaces video Vicksburg\nMr John I'm Jacqueline read New Horizons church regions and Maurice ... Jackson State University Thank you [noise] [noise]\n\n\n\n\n\n\nUm [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\nNow\n[noise]\n[noise]\n\n\nWere double digit she comes from the Mississippi link each week the lake has connected integrated make an urban rule and community news from around the globe to people of Mississippi and beyond and now is what provides the\nDaily news events and the Mississippi link dot net welcome to your work [noise]\n[noise] ...\n\n[noise]\nMm\n\n\n[noise]\n\n[noise] [laughter] [noise] [noise]\n\n\n[noise]\n\n\nCool and courage W J I guess you could impede the music radio [noise]\nMm\n\nOr ... ... ... ... ...\n... ... ...\nThat they have ... ...\n... Mm\nMm Mm\nMm\nMm\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]", "year": "2018", "show_name": "PRI's The World", "city": "Jackson", "day": "05"}