{"month": "10", "state": "MS", "station": "WMPN", "content": "Well uh oh\nOh\nThe\nThe for freshmen with a marvelous arrangement of Bobby troops their hearts are full of spring that arrangement was very influential to and later recorded nearly note for note by the very young Beach Boys\nAre close off this tribute to songwriter Bobby troop with one more song performed by the man himself\nThis one comes from his Nineteen fifty eight album hears to my lady recorded with rust Garcia and his orchestra that lady in question was unquestionably troops soon to be white singer Julie London\nAnd this original song by troop closest off the album this is Bobby troop with his song Julie is her neck [noise]\nWho has gotten a Justin made two big is\nA is to set the homeless or my [noise]\nDisarming choice [noise]\n\nHas gone thanks so warm and so sweet\nWhich the Mona Lisa my [noise]\nShe has gone through marriage\nOn\nLine that ideal is to home let's talk about ...\n[noise]\nIt's been very they're kind of\nThe crime that shows\nNow you know what are the captured one\n\nUm\nNow you know what the GOP should one Mm\n\nTrue [noise]\nAnd\n\n\nBobby troop with Julie is her name a song dedicated to his wife Julie London and thanks for tuning into this tribute to Bobby troop on after ...\n\n... is part of the educational mission of Indiana University in produced by WSBIU public radio in beautiful Bloomington, Indiana the executive producer is John Bailey production support for after ... comes from Selma coffeehouse in juice bar specializing in juices espressos and fair trade organic coffee\nServing from downtown at Kirk within grant and on the corner up third in Jordan on line at I hearts Selma dot com played lists for this and other after low programs are available on our Web site that's at Indiana Public media dot org slash after glow\nBy mark ... and joined me next week for our mix of vocal jazz and popular song from the great American song here\n\nAttention all educators NPT has partnered with the secretary of state's office who is this year's promote the voter initiative and help your students learn important lessons\nAbout civic engagement wow having fun in the classroom this opportunity is for K. through twelve students across Mississippi get them engaged with the ... election plus are an essay contest for more information about promote the boat\nOr just sign up your class or school visit NPD on line ...\nStations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online duck or gee\n\nAlright it's undercurrents I'm Greg make liquor welcome ready but some music okay you're on the right place Tracy Chapman's I had the kinks David but we\nAnd let's remember Don Ritchie\nThings can you prevent Sherman's\nWhen you're\nDream dream directions or writing now\nAbout it and you have to drive\nOne politician running some time\nMaking money doing\nMan loves to China\nNew code\nTurned it's awesome to\nFingers are from\nJustin ...\n\nRemember David Bowie with where are we now\nFrom nothing has changed that's got to be telling us with Apache before that from like LA rubber mirror ball with skin walkers moon\nAnd it was ... nobody left to correct the subconscious works and funny ways when you're a DJ you know I was just thinking about Richie Havens the other day on\n\nThe pay him in a while oh how about this one and pulled it out and listen to it on the big speakers in my living room\nAnd sure enough it was a person there about voting elections so something in the back of my mind was think I don't play the sun 'cause we've got to vote that's right\nSo in there somewhere Julian coat on the way and right now let's check out this new went from about ... Muscle Shoals small town big salad says Mike Farah and the blind boys about what about\nAnd it didn't touch it then\nMoved to your lane Pan Am I supposed to be in the bank\nA bottle then\nWill you know in a way that the channel do\nYou look at the gym but thank you\nThank you thank\nYou don't read today yeah [noise] [noise] they say\nProspect yo\nNa\nNa na na na na na na na na\n\nYeah it is\n\n\nThey do a\nThe day to day no no\nNo no no would you change\nYou can ...\nI'm In a um a treaty agreed\nWith chain reaction when a that any man\nMaybe ...\nGood and a good\nBe a no no\nThe wrong words Jane\nTo find a job to bring\nBe too much Jay\nWhat Jay ... when they need\nMake you\nMake ... may\nMakes you say\nTo be\nYou say you know\nBeen over a\n\n[noise] [noise]\nCan you say\n\n\nWe\n\nNo no I just got to know [noise]\nWhy should a row\n\nWhy don't you settle\nThe\nNo no no no\n\nI don't know [noise]\nJob ... years [noise] you couldn't show\nA a a\n... yeah\nThey say a\nGrow\nUh", "year": "2018", "show_name": "PRI's The World", "city": "Jackson", "day": "10"}