{"month": "11", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n\n\nThe Dakota in the minor buying genius bar played there by working ... Fox she had to shoot the he\nKnew that he'd written something quite spooky with that piece of interesting ...\nMusic has been around you know that there's always more new interesting music if you know where to look for the discovery never stops and young fan fiction no musical to be under some conditions between generations cultures\nRoute to run your own means\nGetting the whole lives together ...\nSunday night at seven\nOn MTV music radio stations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle\nYou may you view W. M. P. in Jackson W. M. A. W. already W and may be struck W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online duck or gee\nYes huge Jackson evening welcome to the evening jazz here on Hulu and current as an eighty eight point five W. J. N. here in the emeritus Michele thanks for tuning in on MTV music radio\nOnline at double EJ at your dad or it gets kind of corn on the FM dial an eighty eight point five [noise] we're going to start out there that seven o'clock hour with the trash man kind of like the clients room for Florida is the latest release from the ... like in the orchestra\nEnjoy this election and\nFor [noise]\n[laughter]\n[laughter]\n\n\n[laughter]\n[laughter]\nOh [laughter]\n\n[noise]\nWhat would\nYou know too much\n\n\n\nMm [noise]\n[noise] [noise]\n\n\nDrag you as an in ski and gator tail\nYeah jazz is the album yeah band excuse me is the album before that\nThe stand kittens legacy orchestra on the trash men come it got to teach so um the way is they contemporaries that that begins with lawn up next\nTabs on W. J. asked you are underwritten by English ship building in Pascagoula limit for tripping\nEnglish is an equal opportunity employer hiring in the trees and machine that ship hitters pipe fitter Lynn ... positions are union representing the information at eight eight eight nine three five one by both say one or the English website at Huntington angles dot com slash career [noise]\n\nKnow\n\n\n\n\nWhole\nThing was the only one\n\n[noise]\n[noise]\n\n\n\n\n\n\nIs yummy Kendrick uh own three by five wrapping up our contemporary set with its selections from the album lying\nJust before that we enjoy the Rob Dixon trio on your show oh about a little back action now from Mr he's been person\nBelieves allergy is this election you'll enjoy it right after a quick break keep it said\n\n\n\n\n\n\n[noise]\n\n\nCool and courage WG ASU on MTV music radio\nDidn't get the love and because I don't know no no no real time\nDid it can't be love I get to know\nMy knowledge and and you know hearing me\nI'm not going\nBut in", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "01"}