{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] ... concerto and he fled major my phone just heightened point there by the U.S chamber orchestra Jeffrey ... and the trigger only Edward ... some reformers\n[noise] we have some a curated the classical music playlist on you to do we feel better after the stresses of the day including our latest collection of peaceful piano music\nYou'll find that you have a link or your classical dot org and that's added to a new twenty four seven street called peaceful piano what you'll find the right there you're classical dot org\nAgreed orchestrating full flight is the most amazing thing and simply can't let you experienced that thrill every week Hi this is Brian new house we touchdown and terrific orchestra towns Boston to San Francisco and get the best of Europe and Asia\nAll captured my encounter sympathy from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA ... ... you may you view W. M. P. in Jackson\nW. M. A. W. Meridian W and may be stuck W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at MVP on line or juice\nAs few drinks and\nWe're getting there\nFor one of them the evening yes you're on Google and current new Italy when by the New Jersey earlier\nAre we are in the shallow river\nA very good when the ... that the gaming everybody's like yeah right right but that was a seven o'clock hour no about starting it up with bleach back from the always forward album and Marty ... guilt trip you double the ... ...\n[noise]\n[noise]\nOh\n\n[noise]\n\n[noise]\n... look look look\nA\n\nHey I Want to remind you that W Jae su has awesome programming throughout the week that you can check out something new for every evening at six PM Monday's its twelfth street jump on Tuesdays dream farm radio\nWith your host Julie lavender mark she was after glow on Wednesday Thursdays it's jazz night in America\nWith Mr Christian McBride and on Fridays Johnny meisters blue dimensions\nSo that each and every week night at six P. M. the Bob James trio on the way this is new music from the espresso CD\nMr magic believe it or not after the break it starts our contemporary set well\nSeventy two percent of our murder suicide and Bob domestic violence from an intimate partner Ninety four percent of those victims are female physical mental sexual reproductive health issues have been linked to domestic violence\nIt's okay if you've been victimized leaned on remain a victim in you or someone you know is involved in a domestic violence situation don't head and say the national domestic violence had in mind is available at one eight hundred\nSeven nine nine Satan again that when a hundred maybe nine nine seven two or three during don't remain of [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nDo\n\nOf people that are\nAnd\n\nIn\nThe [noise]\n\n\n\n[noise]\n\nThe non [noise]\n[noise] I Would love\nAll due to come to confirm to to keep the minimum number one number for them to do on the computer\n\n\n\nA\nDe\nDe\n\nNot black crow from Deborah man from her release full circle\nThe music of Joni Mitchell before that good by my friends from the jazz Latin release one from bill O'Connell we started the SAT with about James trio Mr magic started that's often now\nSome of the wing borrowed it sounds going blue gotta love creativity\nFrom the relief hey I Know this dog I've got the David work hard big band that's up next on the evening yeah\nI I Am a pianist and composer at least they held for thank you for listening to your\n... current Oregon are great jazz data point five on your that dial W J ... dot org\nThis hour of jazz don't W. J. F. you it's underwritten by eight A. R. P. of Mississippi beat the different vote\n\nTo\n\n\nHave\n\nAnd\n\n\n\nAnd courage WG I guess you would impede the music radio\n[laughter]\nOh\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "18"}