{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] Mm\nThat is the flu concerto my theory feeling tell among played by ... am I knew what was the Berlin ... COO smile conduct\nOr classical music supported by gumbo a meal prep service delivering fresh gourmet dinner kits that are ... writing in Fifteen minutes with just one pen doubled over the prep work so you spend less time shopping and more time with family were more than doubled dot com slash classical\nShallow I'm young I'm Indian Ocean hosted sounds Jewish every Sunday on presenting might be entertaining our Jewish music and usually comedy the chance from New York Times from Israel\nWhen he dances from Europe ... Jewish son American South\nWestern\nI Hope you'll join me I'm sounds Jewish Sundays at three PM on MTV music radio beyond wind\nStations have been ... music radio R. W. M. A. H. Biloxi debate you may ... ... you may you view\nW. M. P. in Jackson W. M. A. W. Meridian W and it may be struck W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ...\nBe be online duck or gee if you drink some\n\nGood evening welcome the cooling tower in\nIn in maybe a quick Byman W Jay a few inches evening Dan\nOn MTV music radio I'm Meredith Michelle\nVery good thing here we're going to kick it off with a new election tonight music from CNN and says there are releasing titled new year\nTeachers several great art is to\nTalk about them a little bit but for now let's go ahead and get it started\n\n\n\n\n[noise]\n\n\n\nCool and courage W J I guess on MTV music radio\n\n\nYeah that's nice of\nYou know wow that is\nChange him\nIn a lie is a shame of ...\nThat live in Nashville with\nMe\nBecause I remember I\nHa and baggage by\nThe way the bomb\nUm Shaq I'm ...\nNow that I have seen\nOn June ... D O D you ah yeah that's nice\nMm\nMm no\nYeah we na\nNa na\nNa na na\nWe've got\nJob again we\nThat that have you never see\n\nTo me\n[noise] [noise]\n\n\nThe ... the on air replaceable but music from her daydream album before that was green genes from Durbin\nPatterson and pictures or the selection that started assault from and says Barrow\nA on the release pictures from her new year album or onto their saxophone guest artist Mr Bob Let's go on ... on the way stick around this contemporaries that begins with the blue uptick\nNo one has you cover like we do here on the box to press rope your whole Donald where each week as we talk a lot about atrazine football\nWe'll also talk with some of the top sports figure ads for it with some of the entertainers in the ... that's one of the press by the press rose each week here George ... little you drink a few\nPets from the boxer pressure on friday ... occurred to retrieve\nThis hour of jazz on W. J. F. you it's underwritten by eight A. R. P. of Mississippi beat the different vote\n... [noise] [noise] [noise]\n\n[noise]\nOwn the mountains and the him\nAnd he don't need an airplane or something and in in\nAny ... [noise]\nUh you know it's meaning this question you ask if this does read or write\nTo\nThe most interest is\nThe blame game when you know I have\n\n\n[noise]\nFrom the tiki collect business news album featuring on vocals have there's a la carte built Brazil before that I think all\nThe John stats trio with Black Sea fleet here is the one song sent from the fabled state L. but up next on the evening yeah\nTrap W. J. U. R. underwritten by he was a ship building impact global Mississippi\nAngles an equal opportunity employer hiring electricians machinist ship hitters pipe fitter than type welders positions are union representative information at eight eight eight nine three five one by both say for the eagles website at Huntington angles dot com slash career [noise]\n\n... ...\n... ... ...\n\n\nOooh oooh\nOooh\nMm\nMm\nMm Mm\n\n\n\n\n[noise] Mm\n\n[laughter]\n[noise] oh [noise]\nNo [noise]\n\n\n\n[noise]\n[noise]\n", "year": "2018", "show_name": "PRI's The World", "city": "Jackson", "day": "17"}