{"month": "10", "state": "MS", "station": "WMPN", "content": "\nOr\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\nThat's called dance by Oliver Davis Paul Bateman conducting the London symphony orchestra currents a peacock violin you watch ... playing the piano once he ... he was sitting around with a couple of other men all of them had fancier high powered jobs and they get around to succeed and they said well what do you do\nHe says well I'm a ...\nAnd then he left that meeting top well now we have to start writing you should not but he invented the form and you can get subsidies should not be the number one for free downloaded it your classical dot org\nOn October twenty third joined in BP and the Mississippi department of archives in history as we were\nGreeted by America's first with a preview screen no they never marry the risk to impede the TV\nHere from Dr Ronny that's Richard Choctaw Jay Wesley they talk about America's first people this exclusive screening begins to pick him up to ... at the museum of Mississippi history for more information does it in\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA visible Wu may you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line\nOr G. as few drinks\nAnd her and I find that\nWe are at the top of the seven o'clock hour ready to keep it all with the McGuire twin\nEarly bird gets the short end of the day\n[laughter]\n\n\n[noise]\n[noise]\n...\nWho\n\nUm [noise]\n\nMm Mm\n\nMm\nMm Mm Mm\n\nOne more cup of coffee from Charlie balance the that's the one from the album liked his brief the music of Bob Dylan among the Washington before that we can you hear him George steep and Don ... not the way three card Molly is up next [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\nFor\nThe whole school\nThe\n\nTerm for\nAnd\nOkay\n\n\n[laughter]\n[noise] ... [laughter]\nShould they\nShould Shane Shane Shane [laughter]\n[noise]\n\n\nCool and courage W genius on MP be music radio\n", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "19"}