{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\nNa ...\n...\n[noise]\n\n[noise] [noise]\n\n\n\nWell\n... my son saw one of the classic Halloween oriented pieces certainly Halloween associated pieces when we were at a few more times before the market's up the Cincinnati pops conducted by Eric consul\nA great orchestra in full flight is the most amazing thing except for the cat lets you experience that thrill every week Hi this is Brian new house we touchdown and terrific orchestra towns from Boston to San Francisco and get the best of Europe and Asia all captured lied encounter sympathy cash\nFrom American public media Sunday Morning at ten on MTV music radio\nStations have been ... music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at impede the on line\nOr gee you gee a few drinks and\nMrs evening down here on cool and parents and maybe a couple of\nOwning TB music radio I'm married to the show\nAnd they started off\nThey might see is is selection\nAnd kick it off with one from the Larry McDonald cortex\nIs his new jazz from the album entitled Alice in stone him and other\nGroups to electric adventure activities that I Would not make that up\nIt starts off our seven o'clock hour two percent this is cool and current FM eighty eight on MTV music radio\n\n\n\n...\n...\n... Mm\n...\n\n\n\n\n\n\n\n...\n\n...\nCool and current FM any eight point five W. J. as you at first that wrapping up with daily life just then from Michael brothers unavailable cars will and Kodak taken from the album three times to\nBefore it late march the is from the Larry McDonald quartet our contemporary set of features some new music from Helen song Israel as well as rich what so\nHowever will pick it up with a Richard hello coming of age that selection right after the break you keep it set\nTo this program in part by which at the financial services hoping Jacksonian with their retirement and line plan as well as critical chronic and terminal illness protection ribbons financial services is available at eight hundred three six one sixty five forty two or group is financial services dot\nFor consultation today the more taboo in at your fingertips [noise]\nTired of hearing something and you're listening who even during the ... were five F. and they said in your life\nAll in a\nWay ...\n[noise] ...\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\nDid not\nKnow\nSteve I\nHit the road I one I Love the show\n\n\nLocal is that Jean Baylor appearing on this album from ... song some with words is the album that election in particular\nWas pity the beautiful it taste of hunting just before that from rich ... group and hire an album entitled rock in it\n\nPaul ... got on the way turn of phrase is this election back on into a traditional set up next\nThe anti\nAnti B\nC's g's goldie ... she\nHe\nSees she\nSees in him\nHe sees she changed it to\nMe\nShe\nHe\nShe she\n\nShe she\n\n\nHas\nFor me to\nBrought up in arms about\nThrough ... and what I mean do we prefer eating in\nThose who\nThe ballot\nA\n...\nLand\nShe she\nOr ...\n[noise] um [noise] he\nHe\n\nShe\nShe\nHe he\nHe he he he [noise]\n\nCool and courage WG I guess you could impede the music radio oh\n\n\nOh\nOh\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[laughter] [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "04"}