{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise] [noise]\n\n\n\nThe dance seven veil was from the opera summer may sit by research drought cause ... conducted the performance by the orchestra data ... I'm ...\nHi this is Chris daily invited you to join me right here every Saturday for a prairie home companion we'll be joined by the best musicians Samuel Doe and others you might not know yet but we'll\nPlus a bit of comedy I knew some of the week ... given instant soccer questions and if you were surprised as well All right here each week on the prairie home companion Saturday spy on MP be music radio\n\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA visible W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at ...\nYou're on line or gee a few drinks\n\nHello there at all in the evening\nYou're on cruel and it\nMay be a point five and seven o'clock and we're ready to get this evening jazz and dirty about Sunday easily joining us out here is the title track from the latest release when they get the Miller warn you that I met\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\nOh oh oh oh oh oh\n\nThat's a Joey Alexander on fourteen featuring Mr Joshua Redmond before that Sunday evening from the kitten Miller quartet\nHow about Grace Kelly now this contemporary sad from sex opponents the Grace Kelly count on me is this election from her album go time Brooklyn\nLunar harder so I'll jazz and blues rhythms a little over a lot of his time a sort of tried to shut us when we're not teaching history and we're related personal experience we believed it provides a Russian loan to serve the music heard on other radio stations inspiration\nWaiting for one thing to another ... why are we going to remember loan\nI saw jazz and blues Sunday is three to five beat him on W. J. as huge actually cool and current\nInvited to dinner or drinks and jazz were for every ... every Tuesday from six to nine PM Edgar Allan males downtown Jackson metros as early night out to dinner or drinks and jazz with revenue along like\nBruce I'm On the jobs on and on Tuesday a six to nine ma'am and have heroin my ocean\nMore info and six one nine for even zero eight months for Helen male ... double your drink as you\n\n\nMhm mhm Mm Mm\n\n\nMm Mm\n\nMm\n\n\n\n\n[noise]\n\n[noise] Mm\n[noise]\n\n[noise]\n\n\nOr\nEntrepreneurship in small business management and management in marketing\nThe college also offers to masters in one PHD program for more information on your credit the College of business six of one Ninety seven\nNinety two for one one rejection State University [noise]\n\n[laughter]\n[noise] [noise]\n\nMm [laughter] Mm\n[noise]\n[noise]\nMm\n\n\n\n\n\n\nThat's true to do with\nBeen [noise]\nTo ... to\n\n\n[noise]\nGet people\n\n\n\n[noise]\n\n\nCool and courage W J I guess you could impede the music radio [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n", "show_name": "PRI's The World", "year": "2018", "city": "Jackson", "day": "31"}