{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\nJust the end of the violin concerto indeed by Beethoven played by Italian violinist ...\nShallow me off I'm Andy notion hosted sounds Jewish every Sunday are present in my ... been entertaining our Jewish music and usually comedy the jazz from New York from Israel\nWedding dances from Europe devotional Jewish song American South\nYes sir\nI Hope you'll join me on shelves Jewish Sundays at three PM on MTV music radio and TV on line\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and maybe structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at impede the online dot org G\nA few drinks and\nThey're very good Wednesday evening to you welcome to cool and current FBI many point five W. J. ask you this evening jazz emeritus Michelle\nThank you for joining me on the MTV music radio as well on WGN the dot org gonna kick off to seven o'clock hour with had the cat is have got him make Helen featuring Mr Ron Carter just started down\n\n[laughter]\n\n[noise]\n\nAre unable huge ASU on MTV music radio that was ... pyramid it may go and featuring Ron Carter before that with hot speak Haddish got the Tito on the way the selection of lawns this is new music from the rainbow gravity album and it begins Oregon Tipperary that up next\nWe're not double digits he comes from the Mississippi link each week the link has connected integrated make an urban rule and community news from around the globe to people of Mississippi and beyond and now it's what provides the\nDaily news events at least ... it'd be like dot net to welcome to your work\n\nJackson State university's College of business sense choice to produce the ethical and take a logical you eventually global leaders to college in business delivered academic programs for department accounting economics and finance and your own business entrepreneurship and small business management and management and market and\nThe college also offers to masters in one PHD program for more information on your credit the College of business so one nine seven\nNine two for one one rejection State University [noise]\nOur\nDaughter oh\n\n\n\n... ...\n\n\n\n...\n[laughter] [laughter]\n[noise]\n[laughter]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [laughter] [noise] [laughter] the\nTV [laughter] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\nThat is that better than that\nDo\n\nNot have\nTo\nDo\nDa\nDa da da da da da da da\nDa da da\nDa\nDi di di di di di\nDi\n\n\n\nThe beep\n\n\nTo\n\n[noise] [laughter]\n\n\nWho are willing\nTo\n\n\nAnd look for in the middle of\n\n\n\n\n\n\n\n[noise]\n\n", "year": "2018", "show_name": "PRI's The World", "city": "Jackson", "day": "03"}