{"month": "10", "state": "ID", "station": "KRFA", "content": "Christopher hug with on the podium they're leaving his Academy of ancient music here at northwest public broadcasting where we have in store for you a major work by pizza oven in the hour just ahead\nThere's always a lot going on at N. W. P. B. get the skinny and our monthly e newsletter you'll find out about upcoming programs and what's happening behind the scenes at northwest public broadcasting sign up for your free copy at N. W. P. B. dot org look for the link to sign up for our monthly newsletter\nNorthwest public broadcasting\nToday are of a Ninety One point seven Moscow Pullman tray and W. B. B. point five clerks in Lewiston until you W O maybe point one cotton wood Greenville NPR on classical music community service of the Edward our world College of communication at Washington state university\n[noise]\n\n\n\n\n\n\n[noise]\n\nOoh [noise]\n[noise]\n[noise]\n\n[noise]\n\nNo\nNo\n\n\nNo\n[noise] [noise]\n\n\n\nReally\n[noise]\n\n\n\n\nThing of the Latin text ... for Hail Mary my own leash tenure\nThe Swedish poets and music teacher and composer and important composer of children's films in Sweden\nIn the late Nineteen the first half of the twentieth century is in fact her likeness her photograph was still appearing on Swedish postage stamps as recently as ... fourteen ... tenure unimportant Swedish composer in ...\nFor sending it'd be awfully Maria performed for you today by the Netherlands youth choir under Eric Eric films direction eleven over for a friday morning October twenty ninth ... northwest public ...\nMusical for a will there's national attention on Washington's fifth congressional district where a Democrat Lisa Brown\nRecently raised more money than seven term incumbent Cathy McMorris Rodgers the candidates are going to be in debate\nNext Wednesday evening in Walla Walla and you can watch or hear it live on northwest Public Broadcasting's radio and TV stations also would end up all your P. B. dot org that's next Wednesday evening from six to seven on all the stations so northwest public broadcasting\nNo that major work that we have for you in this hour courtesy of Beethoven his string quartet number five in a major from his very first published set of such a piece of this recording made by the Emerson string quartet\n[noise]\n\nWhat do\nMm [noise]\n\n...\n[noise]\nThe new\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nEra northwest public broadcasting\nNorthwest public broadcasting received program support from WFSU undergraduate education hosting authors Kelly and Zach winter Smith at the end you will come and reading invited lecture on Monday October twenty second seven PM and the cubs senior ballroom the couple will sign copies of their common reading book soon ... following the lecture which is open to the public\nThis northwest public broadcasting\nK. R. S. A. Ninety One point seven Moscow to N. double you'll be Ninety point five clerks than and K. and do you own Ninety point one cutting wood also heard on translators K. two Seventy four B. K. one or two point seven coming to ski and K. two Seventy two ... two point three or a female\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nThat was the music bucks a delicate miniature for smaller cars drove by the Russian on a tool of\nWrote it in Eighteen Ninety three Eric hammers done on the podium their\nDiscreetly leading members of the London prominent orchestra and discord against into a friday afternoon together exactly twelve over three as we come to you\nHere at northwest public broadcasting an N. W. P. B. don't or get having just heard the serenade for strings by Peter ward look we're going to bring you a different kind of serenade courtesy of the finish master ... billion and we'll get to that within the next twenty minutes\nBut right now some German music from the seventeenth century mind noted brass player back in the day you'll hug Christoph ... this is a combination sonata ... meaning it's a little piece with variations shouldn't be fought made sure members to boost the ... cologne\nDirected hereby Reinhardt capital\n[noise]\n\n\n\n\n\n\n\nThis nineteenth day of October I'm Steve breeder\nCathy McMorris Rodgers is the highest ranking Republican woman in the U.S house of representatives\nDemocrat Lisa Brown is hoping to unseat her next month the candidates are going to debate each other next Wednesday evening in Walla Walla\nAnd you may watch or hear it live on northwest Public Broadcasting's radio and TV stations also appearing on N. W. P. B. dot org and on the app Cathy McMorris Rodgers debating Lisa Brown life next Wednesday evening from six to seven on all the stations ... northwest public broadcasting\n\nSchneider for early music now\nJoined me for an exploration of medieval ideal life to the sons of truly doors to there had been is that\nTime on early music now [noise]\nThe latest edition to our classical music agenda for you here early music no you can hear it tonight at eight and orange Sunday afternoon at two here on the NPR and classical music service to N. W. P. B.\nWith Julian Rockland as the soloist no work by the finished ... here writing for his own instrument as a matter of fact his terminate number two in the minor\nOh\n\n\n\n\n\n\n\n\nMm [noise]\n\n... ...\n\n\n\n\n\n\n\n\n\n\n\nMm\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\nJulian Rockland was the soloist and Lauren ... was the conductor of the Pittsburgh symphony in that serenade number two when she ... the finish master their writing for his own principal instrument\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\nSold on good touche performing the keyboards another number twenty in before I made sure by use of heightened\nHere at northwest public broadcasting herded N. W. P. B. dot org ... very good afternoon to you\nAs we round out another tunnel week together it's been a very pleasant one and mostly sunny across the northwest and those conditions will persist right into and through the weekend but we have lots of great music coming your way including the New York philharmonic in concert [noise]\nThis is Alex on our neck [noise] New York philharmonic [noise] we'll hear works by bears and you're not as conduct three\nOf the office just former music directors please join me as pm last Dimitri metropolis and Leonard Bernstein conduct\nThe New York this week [noise]\nWith that ... for good measure the New York philharmonic I'm sure way every Saturday afternoon it five here on the NPR and classical music service to N. W. P. B.\nI Know some music by short speech say the composer of the opera Carmen and the composer of the incidental music for the play luckily\nYou're conducted by Douglas black ...\n\n\nMm\n[noise]\nMm\n\n\n... [noise] ...\n\n\n\n[noise]\n", "year": "2018", "show_name": "Science Friday", "city": "Moscow", "day": "19"}