{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\nThe tone ... ... ... ... your ... going by based off from quite the dramatic reading thereby conductor Charlotte I mean she led the members of the Boston symphony orchestra eleven o'clock on a friday morning thank you so much for joining us making a support of your day\nAnd you were we curate northwest public broadcasting and again we're just ahead you can look forward to arguably the best known and best loved work ... race Vaughan Williams\nWith their first time donations on super Thursday thanks so much\nYour dollars are hard at work bringing stories the substance and inspiring music now if you're meant to give but got just a little bit too busy or distracted on Thursday we understand\nYou can still make a difference pledge right now at N. W. P. B. dot org again thank you so much for all that you do to make public radio possible\nIf you contribute to northwest public broadcasting you have something in common with hundreds of businesses and organizations such as written in medical center and the mosque a food co-op\nTogether with them and the community of generous listeners you're bringing meaningful programs to your northwest neighbors every day thank you\nNorthwest public broadcasting today are F a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five coached in Lewiston until you W O maybe point one cotton wood Greenville NPR on classical music or community service of the Edward our moral College of communication at Washington state university\n[noise]\n[noise] and\nHeartfelt music from the pound of ... foreshock\nFrom his songs cycle become a sequence of string quartet piece is known as the ... the one titled my dearest one\nLoose Cyprus string quartet pleaded for you today here at northwest public broadcasting bill McLaughlin returns this evening at seven exploring music for you than completing a week devoted to box to beat too but then how we got there will to knock you go to hear some heights\nTo all things considered from NPR to search for you know on a friday morning this set of funds cooked within ... species but we'll start with ... the sports the right to ...\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\nFend taste you know on a theme by Thomas tell us\nComposed and introduced to the world in Nineteen ten by race Vaughan Williams he conducted the first performance in that year in England glossed to concede ruled appropriate because Vaughan Williams himself was a native of Gloucester sure born on this date October twelfth an Eighteen Seventy two\nWill take you to do with the ... ...\n... ...\n...\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\nMm\nMm [noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nTo really get out of the ... in the number\n\n\nNorthwest public broadcasting has a mission of enriching that community through programs which engage enlighten and to entertain it's possible thanks to the financial support from left me it's like you and businesses like Pullman regional hospital and each side marketplace is huge here when it's the point is public station does it end up at ... dot org\nThis northwest public broadcasting K. R. S. A. and I'd be one point seven Moscow to an WB Ninety point five clerks then until you and do you own Ninety point one cutting what also heard on translators K. two Seventy four B. K. one or two point seven coming to ski and K. two Seventy two\n[noise]\n\n\n\n\nQuite blended Lee done and to find a way to begin our friday afternoon in terms of classical music here at northwest public broadcasting the march titled folk songs from Somerset\nIncluded by refund Williams didn't use English folk song suite of Nineteen twenty three the University of Texas windows stumble has conducted there by Dr Jerry junk and even the latter part of this hour the other famous tastes\nTwenty eight Eighteen forty six he's one hundred forty six ... ... Williams born on this date in Eighteen Seventy two\nBut for the moment let's take you back in time to the Eighteenth century in ... for this trio Saddam to Indy major ... but the ... de la ... from ... leading beyond stumble here was northwest public broadcasting [noise]\n\n\n\n[noise]\n\n[noise]\nThe opera prince ... or by Alexander ... dean of the same opera which includes the pull ups and downs is a work whose story is based upon an ancient Russian ethic and indeed a stage work in production of a big scope\nThe overtures to ... to prince eagle or we ... you know from the podium they're leading the Russian national orchestra twelve twenty seven now on a friday afternoon the twelfth day of October sunshine across pretty much all of the great Pacific Northwest was some very pleasant mid autumn weather\nComing your way and mine over the course of the next several days looking forward to all of the sunshine and a lot of glorious music to accent it right here right N. W. P. B.\nNow if you're among the more than fourteen hundred listeners who so generously donated on super Thursday just yesterday thank you very much\nYour gift will help to bring another year of the programming that you value now if you're meant to pledge but didn't quite get around to it no worries you can still give that N. W. P. B. dot org that's an W. P. B. dot org thank you for doing your part\nNorthwest public broadcasting is joined by cascade auto center and its mission of bringing distinctive programs to the northwest every day\nAnd then W. P. B. dot org under support\nAnd extended stretch of mostly sunny weather ahead with the blue skies today size and the sixties wins gun sting to twenty five miles per hour into the evening pulling sixty two sixty nine in Lewiston\nMostly clear overnight loose in the thirties widespread frost on Saturday morning sunny tomorrow afternoon hives in the mid fifties low sixties\nMixed up on this Friday afternoon the women of the road we could trio\nAnd this early work by the Danish German composer organist and composer so much admired by Boston others back in the day Detroit ... books to who to this early to nothing in ... on northwest public broadcasting [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\nMore from our approach to compose respond Williams his son to see all the old English on green sleep which he created for his next\n... little little pieces by Vaughan Williams leader orchestrated and published his charger hosts weeks the English northern fill her money up with David Lloyd Jones conducting\n\n[noise]\n[noise]", "show_name": "Science Friday", "year": "2018", "city": "Moscow", "day": "12"}