{"month": "10", "state": "ID", "station": "KRFA", "content": "There we had the Frenchman boiled shoe shutting array of brightness to kind of musical sunshine on your day hope you enjoy that performance that masterful ... by ... a young boy ... year\nDuring the course of our next door together on the fifth day of October where we're going to pay a visit to Venice in Vienna you're also going to hear the classical symphony by pro coffee of\nNorthwest public broadcasting has a mission of enriching that community through programs which engage enlighten and entertain it's possible thanks to the financial support from left me it's like you and businesses like Pullman regional hospital and each side marketplace\nIs huge here when it's the point is public station does it end up ... dot org\nNorthwest public broadcasting K. R. S. A. Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks than Louis them until you W O Ninety point one cotton wood Greenville NPR on classical music community service\n\nMm\n[noise]\n\nYou'd be be playing music by Frederick ... he's ... number eight in a flat but no the French ... shown but these are ...\nThe future trumpeter you're\n...\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\nMm\nMm Mm\nMm\nMm\n[noise]\nMm Mm\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nMm [noise]\n\n\n\n\n[noise]\n\nMm\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nThey're emulating the composer if he's still much idolized and to whom he dedicated that score\nBut kind of folk which he almost anti climactic conclusion the string quartet number of fourteen and she made sure by Mozart the first of the sixty dedicated to use the heightened the father of that particular musical form a recording there with the members of the sink a quartet\nFrom one ... to heighten to another just ahead a symphony by pro coffee of\nThanks so much for joining us today here at N. W. P. be a very Happy Friday to you on this October fifth I'm Steve leader hosting the classical music until ... to rival it one this afternoon northwest public broadcasting serving Detroit cities Walla Walla in Pendleton with classical music daily on eighty nine point one\nIn Washington inventing designing and building systems to protect power grids around the world on line at S. E. L. I. N. C. dot com\nNorthwest public broadcasting is supported by listeners and community organizations such a festival dance in residence at the University of Idaho and the ... curls society sponsorships from organizations and donations from listeners liking you bring you music news and all the programs you love\nFind out more at N. W. P. B. dad Oregon or support\nIncreasingly cloudy today highest from the mid fifties low sixties pulling in Moscow fifty six sixty one in Lewiston\nWith the cloud cover numerous rain showers overnight lows in the mid thirties to low forties here Saturday looks to be mostly cloudy scattered rain showers by tomorrow afternoon highest back in the mid fifties low sixties\nOn now to the young gay ... coffee of who's so much idolized heightened and water to capture both the spirit and some of the form of heightened in this particular on march\n... for the number one in ... by pro coffee of nicknamed or subtitled by the composer himself classical Michael children's homeless on the podium here to lead the London symphony orchestra\n\n... ...\nAnd down the UP be broadcast for more than two dozen locations all over the Pacific northwest so wherever you travel you can still listen to your favorite programs math said all our frequencies alright ... W. P. P. dot org click on about us to see the coverage maps again that end W. P. B. dot org\nThis northwest public broadcasting\nK. R. S. A. and I'd be one point seven Moscow K n double you'll be Ninety point five ... and ... and do you own Ninety point one cutting wood also heard on translators K. two Seventy four B. K. one or two point seven coming to ski and K. two Seventy two D O one or two points three or a female [noise]\n\nA ... so a little dance for you to begin to our friday afternoon together it comes from that very important collection called ... name for the ancient Greek mused aloud to dance and first published in Germany in sixteen twelve ... tour used responsible for the music\nAnd for that performance Philip tickets and his New London come sort of very different and much later coming to dance music no\nLet's hope for you if you're the second set of English done such\nProduced by Baltimore dulled in Nineteen fifty five this recording has London philharmonic orchestra under brightened Thompson structure\n[noise]\n\n\n\n\n\n\n\n...\n[noise]\n\nMm\n\nMm\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[laughter] right\nRight\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nAnd\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n... ... ...\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n... ...\n... ...\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n...\n[noise]\n[noise] [noise] [noise]\nAnd [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]", "year": "2018", "show_name": "Science Friday", "city": "Moscow", "day": "05"}