{"month": "10", "state": "TX", "station": "KUT", "content": "Effect until tonight take advantage now become our newest member at K. U. T.\nDot org we'd love to hear from you at K. U. T. dot org or also you can give us a call if I went to for once for seven one six to nine one and if you want to check out the new T shirts that we have available\nYou can do that on line ed K. U. T. dot O. R. G. all of our thank you gifts are available there for your ...\nAnd you can get them with your donation that's K. U. T. dot O. R. G. and things\nWhat does that robot really believe the main deep inside\nMarketplace morning report is supported by carbon night offering data protection solutions for businesses including automatic back up or servers and point protection high availability and disaster recovery and data migration\nLearn more carbon nine dot com hand by his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more more his Cox dot com or from an agent Hitchcock's insurance encourage courage\nI'm David Brancaccio in New York the creator of the all important psycho credit score has some big changes in store for consumers the fair Isaac corporation is going to add a new way to do with psycho calculations as could make it easier to qualify for credit marketplace was Nancy Marshall guns or has the to\nThe new psycho scoring system will look at more information data from your checking in savings accounts how long you've had a bank account whether you saved it could be a game changer had ... with credit cards dot com\nBecause this is really geared towards people who have sub par credit or people who don't have credit at all\nPrecedent says lenders are eager for new borrowers including people who may not have high scores but still pay their bills on time with interest rates on the rise banks are taking a second look at consumers with subprime scores but\nWhen you go into something with the goal being to get more people approved some of these people maybe shouldn't have been approved in the first place\nI spent says these borrowers maybe find in the current healthy economy but when there's another economic downturn they may not be able to pay on time racking up big fees on Nancy Marshall cancer for marketplace\nChecking markets the Dow is down just four point yes it'll be five hundred down four tenths of a percent mess deck and positives up to transfer said it was the biggest one day rise for stocks treated in Shanghai with the key index up more than four percent after Chinese official said China's doing fine despite the\nTrade war with us a disappointing profit support from the toymaker has wrote this morning the stock is down five percent now with toys are us now out of business has revenues down twelve percent of the year we're not as say go has more on other companies trying to fill the toys are us void\nParty cities openings fifty pop up stores called toys city target and Walmart or making room on their shelves for exclusive toys and\nKohl's is bringing in New brands like FAO Schwarz and lego\nJackie buyers editorial director of the toy insider she says with Toys R us gone retailers are trying to grab a bigger slice of the twenty seven billion dollar pie\nConsumers have more options and opportunity than ever before for where to buy their toys this holiday season\nThe strong economy will help retailers raking cash on toys according to Richard Gottlieb who runs the research group global toy experts he expects retailers that step into the void will focus on surefire hits why won't take risks on new toys the way that Toys R us did\nNot good for your company\nAnd then there's Amazon it's got skin in the toy game to this year the company is releasing an old fashioned toy catalog printed on paper\nI'm Out of say go for marketplace\nThe marketplace morning report is supported by your life path more than two thousand organizations use robotic process automation from you I'm a path to deploy software robots you I've had this dedicated to making work inspiring by freeing workers from tedious and repetitive tasks morning path dot com slash marketplace ...\n... private delivering audit tax consulting an advisory services tailored to the needs of growing privately held companies\nDelight dot com slash us slash crime it\nIt is nine fifty five and this is Austin's NPR station K. U. T. N. K. U. T. H. D. one us than we are online at K. U. T.\nDot org support comes from Louis shanks furniture with a vast selection of home furnishings custom designed center and experience designers we live to help you love where you live on Anderson lane or Louis shanks furniture dot com\nMostly cloudy skies today thirty percent chance of rain high near sixty five degrees it is fifty eight in Austin at camp ...\nShe would like to thank for following business also euro muscular so magic posts along this thing hands homes Dr Eric white specializing in family practice medicine best of Austin living with color Williams real\nCapital hers is Texas keeper side Dr Lauren Crawford with for some plastic surgery and Swedish filled bakery cafe [noise]\nYou could become ... new it's business circle member\nIt was business that supports the news and information programming here on K. U. T. it will not take long to set that up you can do that at K. U. T. dot org or call\nBy one to four seven one six to nine one I'm Jennifer state and I've been joined on this Monday morning by K. U. T. talk maybe ... is our phone membership Dr continues but not for a whole lot longer hawk\nNo uh we are trying to keep this a very very short we've got it down to five days it'll be the shortest membership drive in probably six or seven years um and we need your help to do that a big thank you to lead Sherman realtor Sherman in comedy the newest business circle member thank us\nOr we also heard from Cheryl Turner and Jesse Proctor they\nSay they've been listening for over Thirty years they're already sustaining members but decided to up their monthly donation which is something you can do without you ... you\nCan do that very quickly and easily a K. U. T. dot org that's a great idea\nYes thank you very much to Sherrilyn Jesse also we heard from\nLisa ... who says I liked your both sides of discussions and to get facts rather than opinions [noise] this is the only source of news I trust my car radio was only ever tuned to UT anytime day or night I Love it thank you very much Lisa\nJust some of the folks who are making a difference this morning as we continue to work to bring you news coverage that gives you a comprehensive view of the world we connect you locally with Eugene news team a regionally with the Texas standard which is coming up next nationally and globally with\nUh the great resources of NPR and also the folks at the BBC we treat all of the news with an independent and unbiased land so that we can bring you the story behind the issues not just the issues themselves\nBut we give you some context in perspective so that you can make up your mind especially at a time when we have a mid term election coming up and just Fifteen days early voting starting today\nAnd you can find information all about early voting can find that at K. U. T. dot org also at K. U. T. dot org become our newest sustaining member and if you take care of that today at the ten dollars a month level or above we will say thank you and the special deal this early bird special will say thank you\nThe ... public radio nerd T shirt and two of our cool new plastic pine glasses so\nBoth of those thank you give ... to you but today is the last chance for this special early bird offers so don't wait you can find the details and also you can make your donation now you can do that quickly and securely at K. U. T. dot\nOrg big thank you to coordinate coddle who called in this morning we also heard from Debbie Los ... said that Katie is like a beacon ... in a store\nI can count on my public radio station to remain committed to the truth\nAnd that is vitally important to all of us thank you very much to Debbie and to coordinate are just some of the folks that are making a difference this morning with their investment in fact based journalism here at K U T Ninety point five we would love to hear from you this morning\nFirst day of the fall membership drive only five days five fold days this time and we're already through the first morning or don't way go on line K. U. T. dot O. R. G.\nBecome our newest sustaining member you choose that monthly amount that fits your budget it might be that ten dollar a month level maybe it's twenty thirty fifty or a hundred the great thing with public radio you get to decide where just asking you to support the programming at UT dot org and thanks\nFor early voting is underway across the Lone Star state more Texans in ever a registered but are they actually voting early big today but access to [noise]\n\n\nTo production of Haiti often K. E. R. A. Houston Public radio in\nThe port Moran software delivery desk [noise]\nI have a drought we'll check in on how early voting is going to actually begin casting ballots in the midterms flush up for him or on early voting should you plan to cast your ballot is also a Texas filmmaker revisits Molly and asked\nWhat do the most famous political restless Texans could see Josh about how to do politics today\nAnd what impact could Patricia fair have on Texas energy called atoms and some day on the Texas [noise]\nOh yes absolutely I think if you come out here most election days you'll see lines going all the way around the building on but it it is a pretty quiet morning here today but I'm sure that we'll see it pick up kind of as the early voting a continued on and especially as we get closer to election\nIt's just a just a sense of that you mentioned that you're on the campus of the University of Texas\nAre we talking about is this a ... a polling place that seems to cater to younger voters primarily or not so much\nWell I'd say we're seeing a pretty diverse crowd here today on the first day of early voting and I think that um you definitely see large numbers of students voting here but\nThey're also several UT professors and plenty of folks that work on campus in different capacities actually just spoke with Louis Waldman who is an art history professor here at UT and uh you know this was a really convenient place for him to walk just across the street and cast his ballot on the very first day of early voting\nAnd we should point out that we're talking about convenience hear anyone can vote at these polling centers in Travis County in Harris County has similar a polling centers set up site or Hassan is covering this first day of balloting early voting in Texas she's a reporter at K. U. T. Austin or home stations either thanks so much\nThanks David alright let's imagine you are set to cast your ballot what exactly do you need to do and what do you need to have\nJoining us now professor Sherry Greenberg clinical professor at UT Austin Lyndon Johnson school of public affairs professor Greenberg welcome to Texas standard thank you happy to be here everyone please that well at first things first where do people need to cast their ballot I mean do they have to be in their precinct\nIt depend where you live in the state of Texas there are some counties such as Travis County or Harris County that has voting centers that allow you to vote anywhere in your county an F ... go to your polling place for your precinct\nSo just to be clear if you are say a a resident of El Paso and you happen to be traveling to Harris County where they do have these voting centers you can't cast your ballot there at one of those voting centers that's just for residents of Harris County correct\nCorrect that is just for residents have Harris County\nSo where do you find out where your polling places are\nYou find out what your polling places are by going to your county at specifically to your county clerk who handles elections in your account to to uh to the website is the easiest\nYou could also go to the secretary of state or potentially a tea or city there may be something posted on your city so I\nKnow in Texas there has been quite a battle over what sort of documentation you need to prove that in fact you are who you say you are what sort of documents must you have\nMust you show to that person who is a a checking you in there at at the polling place [noise]\nYes we have a voter id law in Texas and it's very specific you must have the Texas driver's license or Texas election id certificate or Texas personal identification card or a Texas handgun license\nA U.S citizen ship certificate with your photo or a U.S military ID card with your phone or a U.S passport\nAnd okay so those were seven documents and they're very specific about that the the documentation\nA let's say though that you're a driver's license doesn't match what the registration list says you're you're addresses then what what do you what do you do if you find that there's something wrong with the way that your registration is coming up\nIf you find there is a discrepancy is something wrong then you may be able to cast what's called a provisional ballot and you should ask\nA professor a lot of people have said that they haven't voted in the past because uh they didn't have time during the day to to get away from work and by the time you know four or five rolls around there are huge lines outside or many of these early voting centers\nSo what does the law say about what employers have to do when it comes to giving people time to to devote\nA Texas law and this is the Texas election ... requires employers to provide employee with time out to vote it during their regularly scheduled our favorite not have much time but I Would recommend that um people check with their employers\nOkay yeah absolutely and we're seeing a lot of new registering ths this year a record Fifteen point six million people in Texas registered to vote and I think that's up by more than one and a half million if I'm not mistaken over the last midterm\nWhat does that mean for early voting if anything and and what is what does that tell you\nCertainly it tells me that there's a lot of\nEnthusiasm at least at this point as far as registering to vote of course we have to say that actually means more people that are not just register but come to the polls that clearly you would expect to see\nAn uptick and we have been saying I'm over time more and more people choosing to vote early uh because of the convenient so uh\nTypically you see a a burst at the beginning and then a lot of people towards the end of early voting you know getting that last chance to vote early and sing lines that\nSure Greenberg clinical professor AT T's LBJ school of public affairs will have this up at our website Texas standard dot ORG professor Greenberg thanks for your time thank you have a good day [laughter]\n[noise] [noise]\nWell some of our social media editor I mentioned that you been seeing I've been seeing some pictures on social media own lines in the Houston\nArea really interesting stuff you know one of our listeners\nNicole ... she sent us a link to an incredible video on Facebook drawing the line just before\nDoors opened in central Houston at the metropolitan multi services center rich of\nHundreds of people stretching out from the front door and sneaking around the entirety of the parking lot is one of those at a time lapse sped up videos but it still goes on for about a solid forty seconds it's really really walk up for a no no no [laughter] we've retweeted her message that she's into us on her own account Nicole ask\nPeople camped out overnight\nYou can't tell me something isn't happening in taxes and shifting gears from Houston to North taxes via Twitter\nLindsey Wilson a gallon tweeted that at eight am the grapevine Texas early voting location\nOpen to lines with a forty five sixty minute wait while every minute yeah grapevine a northern suburb of Dallas right yeah no grey bunny yeah that's a very interesting uh also hearing from our friends and listeners um who were in the thick of it right now on Facebook Jim ... says that he's in line right now in San Antonio and there's probably about\nA hundred people in line with him\nYou know and it came in case you haven't gone to the polls yet or you're still sort of suffering all that stuff out I should get a quick plug in here\nFor a voter guide that we're apart we partnered with the league of women voters in ah bringing our listeners a nonpartisan voter guide basically laying out who the candidates are you can type in your address and get a personalized ballot with all that information and more\nYou can visit Texas decides dot org Texas decides\nThat words you for that awesome voting that's uh that's that's really useful Texas to charge dot O. R. G. huge project that Texas Public radio stations are putting together and you need to take advantage of that we are\nA gusher we're asking for you to tweet us right now but uh so how things going in your neck of the ... to be back in thirty five is more the standards just to\nSupport for Texas senator custom TCU or horn frogs strive\nTo be ethical leaders level of fish is like my flattery to empower students to save the world's remaining rhinos more ... lead on dot C. C. U. dot edu TCU lead on\nSupport comes from Austin gastro ... thirty eight physicians sharing the common goals of improving patients digestive health by offering advance GI and liver procedures and progressive treatment options since the Nineteen eighties Austin gastro dot com support\nComes from the American Cancer Society and often everyday cancer patients struggled to find transportation to treatment the American Cancer Society needs volunteers now to help drive patients to their medical appointments learn more at cancer dot org backslash Dr\nLots going on in Austin today and always in the news but now it's the time to do your part to support all of the coverage that you depend on every day by going online during our phone membership campaign to KU teeth out of work making a contribution to make sure that you are always tough today\nTo goings on in central Texas around our states nationally and internationally that's K. U. T. dot org and thanks\nStates Texas standard on David Brown for nearly six decades the Wyler aerial tram way in El Paso has been the only sky tram in Texas\nIt was originally built for private business but open to the public about Twenty years or so ago and became a rather popular attractions gone to lose traveling on twenty four hundred feet of the cable hope people to the top of the Franklin mountains\nThat is until last month\nTexas parks and wildlife department is closed the tram weight indefinitely Natalie crabs reports engineers discovered it needs expensive upgrades and repairs and now the tram ways future hangs in limbo\nMustard colored ... aerial tram might sway in the wind on the keyboard I mean some of the top of the mountain\nJust weeks ago they used to take people on a five minute ride over cacti rock formations and a giant canyon the tram white and had an observation deck on ranger ...\nYou can see it bustle do what is\nGathered in downtown Dallas park the protesters said greyhound has the right to refuse border patrol agents from boarding or buses without a warrant or probable cause the campaign called transportation deportation accuses customs and border patrol agents of violating passengers constitutional rights\nBy asking that they prove their US citizenship\nIn a speech to the crowd Texas Democrat walking ... says practices happening in heavily Hispanic areas and be on a border checkpoint\nDoing something that they don't have\nThey're subject to any of their past they're subjecting the warrantless search [noise]\nRacial profiling after a series of speeches to groups ... several blocks to greyhound headquarters carrying boxes sign petitions Tricia Martinez senior vice president for greyhound legal department read a statement from CEO date leach\nCBP officers do not ask\nTo put our drivers safety are passengers at red lights and stuff\nProtests are planned in the coming weeks Stella dot is Kate uranium is\nA Mexican journalist seeking asylum in the United states appears before an immigration judge in El Paso this morning\nEmilio ... case gay national attention after federal officers in West Texas detained him and his son during a routine immigration check and he was held for months before being free from detention that summer\n... has been seeking asylum in the United states for about a decade after facing death threats in Mexico for reporting on government corruption\nThat's will get news from across the state I'm Becky ... for the Texas standard\nSupport for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls Morehead vote Texas ... or eight hundred to five to about\nThirty three minutes pass you our Texas standard time I'm David Brown ... have you with us on this Monday\nLast week this time a piece of news broke that would have seemed impossible a century ago see here's one of America's most dominant retailers filed for chapter ... bankruptcy thanks to declining revenue in massive debt\nSears, Roebuck catalog once upon a time was a staple of American coffee tables there wasn't much you couldn't get from it\nIncluding something that may well survive Sears itself once very own home Michael Marks reports\nThere are certain items you expect to find in the mail order catalogue sewing machines for example watches are bath towels you don't expect to find a house\nThat didn't stop Richard worn Sears and Elvis robe\nCo founders Sears and Roebuck company\nThen is this the\nBeen sitting here a summons to hear about\nThe only reason that she got into this because he knew it was a way to sell more stuff in his one hundred thousand item fourteen hundred page catalogue it actually would put dotted lines within floor plan shown in the catalog and say days for Davenport space for ...\nThat's ... married Thornton she's an expert and Sears kit houses Sears sold them from Nineteen oh eight Nineteen forty they recalled kit houses because they came with all the bumper hardware you'd need to assemble them\nPlus instructions on how to put it all together like a giant lego set each year's catalog offered dozens of different models all the way from Dina toner a simple free room model for one hundred Ninety One dollars to the magnolia\n[noise] five thousand eight hundred and forty nine dollars had twenty nine hundred square feet four bedrooms two and a half ... plus servants quarters\nTo find out if your home is a serious kids the best way these days is to consult one of the many websites and Facebook groups devoted to them it's unknown exactly how many kids were sold or how many are still standing there's no official list\nThe mid west has a real hotbed for them but certainly found a handful in Texas and there are surely many more that remain undiscovered so to speak\nGet homes are like roaches if you find too you know there's another twenty hiding somewhere\nThe main benefit was price there weren't cheap per se but certainly less expensive than a pre built home and remember this was the early twentieth century if you were someone who might have trouble buying a house the conventional means the kid home was a viable alternative\nOverwhelmingly was single women men and women of color and immigrants fresh the country\nMiners would look at the demographics of neighborhood if you were a certain height you are not going to get a mortgage period\nBut it didn't last the business started losing money in the thirties and indoor plumbing and electricity made home building more complicated\nBy Nineteen forty Sears was out of the kid house business but certain things that most of the Sears homes that were built are still around the reason is a cliche but it's one that applies here they just don't make them like they used to\nThe quality of building materials and cheers homes far surpasses most of the stuff even of the day and certainly the things that are built today\nThat quality is evident and we'll and petty Moore's house in Georgetown just north of Austin they live in an Avondale model built in Nineteen fourteen to green one story bungalow with a shady porch next to a big day window out front they originally bought it but the intent to flip it\nBut the house she grew on them as they fixed it up they decided to move in and said\nIn our vernacular the word kids denotes you know they're not very well not very solid thing or you know something was a kid and that can't be applied to seniors kit homes\nWhen you step inside the house has a wide open feel to it was windows everywhere in the living room dining room separated by dark wood columns\nGone through some changes over the years like many interior codes of paint wall to wall shaggy carpeting and the addition of another bathroom in a laundry room but the mores have made sure that from the curb it looks like it did back in Nineteen fourteen they even got the seal of approval from some of the homes former attendance\nThere was a guy born in the house and the ... in two thousand and six when we bought the house he was still alive and he came to visit\nIt was you know it was pretty emotional for and we were sitting at the table over there and then we did walk through his sister came in China\nShe kind of gave her blessing and\nThere are little signs of the houses history all over once when will was doing some work on the back of the house had the pulse and siding off of an outside wall\nWhen we took the siding or we found two signatures from Nineteen forty than we determined that they were probably the people that built the house\nAfter they found those signatures petty decided to make her mark too\nOn the woods behind the sheet rock in the laundry room she wrote her name and said that this is where she did her ironing for them to think about the future owners who might find it\nWe are the current caregivers is is what it amounts to\nThe house is the mainstay we're just trained sheets\nSo petty signature will sit on a tight dense board kneeled over a century ago just waiting to be found\nIt may even be there long after Sears itself\nWould detect the standard on Michael marked\nReport for ... Texas oncology whether reminder that October as breast cancer awareness month to eight early detection all women over the age of forty should undergo routine screening like yearly mammogram\nMore at Texas oncology dot com\n\nYou are listening to the Texas standard on K U T Ninety five and ten thirty nine\nWill support comes from rock and roll rental keeping Austin in gear for Thirty years two locations on Bernard at second on old tour mum are\nRock and roll rentals dot com\nThey would like to thank for following business ... negates a Yeh started up accelerated Westminster see new living community [noise] thirties were better therapists uncensored often based podcast six where polices blocks cultural district [noise]\nWeighed Russell board certified criminal defense attorney\nRob albertson realtor at real T. Austin\nPaused veterinarian and Brophy Edmondson sheltered NYSPI L L C\nAnd it just takes a few minutes to address named to that list of business supporters of K U T go on line to K. U. T. Don work now and thanks\n... ... ... ... ... ... ... ... in a non profit coffee shop in the evening news and\n... ... ... ...\nThis year we actually started a program of our own it's called brain than have and brave and have all the twenty two week coronary training program very survivor and try\nAgain ... ...\nThat ... training part of it with a combination of teaching and then also in the kitchen training and sell it out of our brightest then came never having had an email from scratch that far and added they all at the end of it there's terrorists have had and how\nThey all have an air all able to actually go get jobs in the end and you're in", "year": "2018", "show_name": "Texas Standard", "city": "Austin", "day": "22"}