{"month": "10", "state": "TX", "station": "KUT", "content": "There've been many books written about the Emmett Till case especially recently but a new book by historian Eliot ... reminds us of the effort it to to keep tells case before the public book critic Marine Corps again has a review\nThe people see what they did to my boy\nThose were the words spoken by Emmett Till's mother made me till Mobley after reviewing the brutalized body of her son\nDuring his night of torture near the delta town of money Mississippi fourteen year old Emmett Till's right I had been dislodged from it socket his tongue choked out of his mouth the back of his skull crushed and his head penetrated by a bullet\nAt the insistence of his family Till's body was shipped back home for burial in Chicago and Mimi till Mobley specifically called for an open casket\nDay and night over Labor Day weekend in Nineteen fifty five over one hundred thousand mourners almost all of them African American filed past that open casket which lay in state in the south side church\nBefore the funeral service a staff photographer from jet magazine was permitted to photograph Emmett Till's body and those images were disseminated to other African American magazines and newspapers including the Chicago Defender\nBut as a historian Eliot jade Gordon tells us in his new book on the Emmett Till case the mainstream press didn't reprint those photographs and of course they were considered too graphic for television\nYears later ... says many white Americans remembered falsely remembered the epiphany of pills ruined face in Nineteen fifty five\nBut few white people saw the photos until Thirty years later when the documentary eyes on the prize opened with the Emmett Till story\nOnly then did his mother's words let the people see what they did to my boy begin to be fully realized\n... book is called let the people see like Timothy ... Tyson's twenty Seventeen book the blood of Emmett Till it\nBuilds on new evidence discovered by the FBI in two thousand and five to present a detailed reconstruction of pills kidnapping and killing in Mississippi in retaliation for allegedly having whistled at a white woman named Carolyn Bryant\nGore and also dives deep into a legal analysis of the transcripts of the trial and the town of ... or Mississippi in which Bryant's husband and his half brother were tried for Till's murder\nBoth men were quickly acquitted by an all white all male jewelry\nBut what's most interesting about ... book is his final section called memory in which he traces how ... story which seems so well known today came very close to passing into oblivion\nGordon points out that in the two years following Till's murder more than three thousand articles about him were published\nThen the whole of the Nineteen sixties brought only three hundred articles in the Nineteen seventies fewer than fifty stories appeared\nJustice disturbing is the fact that some of those stories including one written in Nineteen fifty six by William Faulkner for Harper's Magazine relied on a paid interview with the two alleged killers that had been published in look magazine\nThat look story characterized Emmett Till as a defiant sexual aggressor going forward corn says the tenth and twenty fifth anniversary of Till's murder mostly past I'm observed even in the black press\nIt was the rise of African American studies that helped to recover Emmett Till's story along with the widespread popularity of the Nineteen Seventy seven t._v. serial route which proved there was a mainstream market for black history\nIn Nineteen eighty five Chicago reporter named rich Samuels produced a half hour documentary on the till case segments of which were later broadcast on NBC's Today show\nFor the first time in mainstream media corn says white saw the photograph of Emmett Till in his coffin\nAs the image appeared on the screen viewers heard the voice of writer James Baldwin who said\nIt was myself in that cough and it was my brother's in that coffin I Can't describe it so precisely because it had been so mutilated it had been so violated it was\nAnd but it was all of us\nLet people see is it timely book about the fragility of collective memory\nAnd did that the courage and persistence of journalists particularly black journalists some of whom risk their lives in Nineteen fifty five to get the facts of the ... story before the public\nMost of all though let the people see is a vivid reminder of just how easy it is for people not to see things they'd rather not see\nThey're encouraging teaches literature at Georgetown University she review that let the people see like Eliot Jay going\nTomorrow and fresh air we'll talk about how the Supreme Court became so politicized\nAnd have a court looks now with Trump appointees and chief justice who's considered the most likely swing vote and I guess we'll be David a cap and author of the most dangerous branch he was the legal affairs editor at Newsweek I Hope you'll join us ...\n... ... ... ...\nFresh as executive producing is Danny Miller I interviewed some reviews are produced in edited a nice salad ... mom to recent Madden\n... challenger and Seth Kelly I'm Terry Gross\nAnd I'm ... and you're listening to pressure Iran Austin's NPR station K. U. T. now you point five and K. U. T. dot O. R. G. thanks for spending some time with us\nSupport comes from domain north side Sunday is the great state benefitting Austin angels streets will be closed for our glow in the dark skating party with family activities and and if parents by Texas roller girls details that domain north side dot com [noise]\nSupport for NPR comes from the station and from west and hotels and resorts western has committed to the wellbeing of travelers with offerings like heavenly beds a super foods are X. men you and gear lending for one workout gears left behind at home west and let's ride [noise] learn more at West in dot com\nAnd from love me in makers of go to needing a collaboration meeting platform that comes equipped with features to help people stay focused to get work done\n[noise] learn more it go to meeting dot com\nElection day is November six but the midterms are already here with control of the U.S house and Senate hanging in the valley [noise] early voting is going on right now and it continues through friday November second\nTexas standard in public radio stations across the Lone Star state are trying to make\nSense of the mid term elections through our Texas decides prior\nNine days around from the Texas standards you can visit our interactive voter guy right now at Texas decides\nDot ORG from the K U T public media studios you're tuned into K. U. T. N. K. U. T. H. D. one Austin we argue or central Texas home for NPR and the BBC and we are community supported public radio so thanks for being here I'm Jerry ... it's seven fifty nine hope you had a great Tuesday\n[noise]\nSupport comes from bill tickets in southwest key featuring the condense a premium Sudan and came nine hundred flank ships sedan with smart cruise control autonomous breaking and you vote smartphone integration to location south whiskey adopt a more\nOften Center for grief and loss is hosting a family\nMovie night for the other lives and whether those featuring the film Gulf though this Friday at six PM attendees are encouraged to bring a photo of their loved one as well as a favorite food or treat for the altar details at Austin grief dot ORG this is Austin's NPR station K U T Ninety point five [noise]\nStacey would like to thank for following business doctor or not I Patel central Texas brain and spine Michael ... the guilt agency presidential real estate ... associate tax law for [noise]\nBody art form [noise] stuck on on audio visual post production\nViolins et cetera\nRiver maps allow see [noise]\nBaxter planning systems and similar Flora's law\nTwenty two miles ready twenty two miles of conscience you know why which is the\nSort of circular a razor wire you see on top of detention centers are ... ...\nUm and they had about another hundred if I'm not a hundred and thirty miles ready for deployment wherever they needed it on the border so yeah this is this could be just a makeshift barrier wherever they decided they\nNeeded a these helicopter companies they can deploy CBP officers within minutes noticed wherever they are you're going to see you already do CBP helicopters hovering over the border with a lot more frequency\nSo this is going to be definitely going to be a show\nLet's focus on that a caravan that began in Honduras still hundreds of miles away from the border uh with the U.S and Mexico\nAh my assumption is that it could take weeks for them to arrive but maybe I'm off there what what is the latest and how many people are we talking about where early reports it said seven thousand\nExactly right it could take several weeks depending on\nWhat the Mexican Government offers them depending on the situations they encounter along the way depending on you know some of these folks might just be out of money and have no resources left turn around and go back or stay in Mexico and initially you're correct it started with more than seven thousand Central American migrants mainly from Honduras\nAnd as far as reports Monday it's this it's about half of that now again some folks are giving up and turning around some folks are realizing that Mexico's a better place\nTo stay\nAnd some folks are just you know still trying to figure out their next move and it's also unclear obviously in Texas we know that the river valley as the entry point and has been since ... Thirteen twenty four team\nFor a lot of these folks coming up from Central America but we also have to remember that the previous caravan a few months back that they mainly went with the one that we also have the courts here in New Mexico\nEl Paso so we're it's really really uncertain where they're going to end ... can based on history we can assume that a good chunk of going to come the Rio Grande valley but again that's still something that's up in the air and how many will there be\nThere they're going to be fewer migrants coming up than there are going to be soldiers on the border at this full deployment but\nWho's going to get our reports on politics in the border for the Texas Tribune William ... thank you so much [noise]\n\nAttorney general taxed and a Republican from McKinney holds a twelve point lead in his reelection race that in the latest poll from the University of Texas in the Texas Tribune and his wife angel is a heavy favorite to win a seat in the state Senate still Democrat Justin Nelson is trying to keep the spotlight on the fact that there are three\nIndictments against the current attorney general Nelson says he wants to change the rules about corruption K. U. T. Austin Ashley Lopez looks into what he means and whether he can't\nEarlier these non ... get outside when it's ... ... I have in downtown ask\nIndeed aid and nothing had the big placard with ... face on it and huge letter spelling the word indicted science him\nAnd regardless of party\nHas let's be honest corruption knows no party\nNow saying a law professor at UT Austin has focused a lot of his\nCampaign around the idea to his election would clean up corruption and serious legal issues that have plagued packed in time in office and then they started less than a year into accidents first term when this happened\nWe begin tonight with a political bombshell\nThis is a report from NBC five in Dallas Fort Worth\nTwo sources now tell NBC five at the top law enforcement official attacks as attorney general Ken Paxton is now and accused criminal he has been indicted by a grand jury and colon county\nNothing contends that Pakistan's ethical lapses didn't end there he argues that since that indictment Pakistan has taken advantage of certain loopholes namely Nelson said he's\nTaken advantage of the pre existing relationship loophole for individual contributions it's allowed anyone who has a personal or professional or business relationship with someone like Pakistan to contribute unlimited gifts to them\nNow send told reporters that loophole is a problem\nThat is what Mr passed and use [noise]\nWhen he accepted a hundred thousand dollar\nTo his legal Defense Fund [noise]\nDrop health care fraud investigation for pennies on the dollar that is wrong [noise]\nThe people of Texas deserve better\nNow than presented a plan that would limit that loophole to immediate family only it's also promised to complete contribution banned from any registered lobbyist or attorney to had a legal matter before the AG now saying also says he wants to create more transparency and disclose any meeting he takes if elected he also won statewide elected\nOfficials to be banned from lobbying for five years after\nRegardless of what the legislature does [noise]\nThrough on her and follow the guidelines on my birthday and\nAccess campaign did not respond to multiple requests for comment again Clancy a former chairman of the Texas ethics commission says he sees some issues with that plan\nThe biggest thing that a jihad discretion with out eat sushi or in the business of it but I don't I don't see anything that\nHe says what we're talking about here are the state's bribery statutes Clancy says it will take change in the laws to really make a dent in dealing with that\nNot up to the attorney general or or the candidate for attorney general Jake allegedly they would have changed\nClancy says it's important to understand that the way Texas laws are set up around contribution is that there are no limits but everything needs to be disclosed but even the underlying laws don't change now since that he wants to change the culture of the ages office in Austin I'm Ashley Lopez to detect the standard\nIs just a quick reminder early voting ends friday and election day of course is next Tuesday wherever you happen to be in Texas you can get a personalized ballot that shows owned the races that she'll be voting on just go to Texas decides dot ORG\nAnd type in that address is is a joint project to public radio stations across the Lone Star state\n[noise]\nAnd we know what that single means right social media editor wells done bars back in the house what's to talk of Texas on the student\nDavid ... you were just discussing moments ago in the military operation drunk thousands of troops will focus on hardening of the U.S Mexico border as it's been described as a another ... uh aspect of what you just mentioned that includes running hundreds of miles of razor sharp barbed wire on links of the border lots of reaction to this story on line\nOn our Facebook page is Janice Hitchcock has an interesting perspective she asked so the president of the United states is sending troops to take the land on taxes input fencing up around it\nFunny that the folks who spent months freaking out about military exercise are perfectly OK with this reference there to ah jade tell them I Believe a military exercise right around all the conspiracy theorists on the far right\nMeanwhile Brian Keenan says this about the troops to be sent out take active duty guys away from their families for the holidays no Thanksgiving maybe no Christmas for you just send again the desert bored just a couple of the reactions were sitting on her Facebook page both in response to this and the other days big news that you mentioned earlier David that\nA announcement from President Trump that he wishes to end the birthright citizenship and trying to there and the fourteenth amendment to the constitution came out in an interview I Believe with X. us right yeah I use outlet\nWhere we we're all used for a little later in the broadcast you're going to stick around for that you know an interesting thing who early on was telling me he was saying what do you do about folks who crossed daily into places like El Paso in Brownsville you know how do you deal with that and will the military\nOr impact that we would love to hear from you Texas sweetest at Texas David Wells back in thirty bucks\nFor a tax to stand it comes down to Texas tuition promise sun and the Texas College savings plans administered by the state of Texas offering a pair of plants that can help families saved ... college trains more safe now for college down or [noise]\nYou're listening to the Texas standard encore on key U T Ninety point five support comes from ground or usa congratulating longhorn football this week's game against West Virginia will be ready for viewing with one hundred craft beers on tap siders and wind grammar usa on west twenty nine a few blocks west of wide loop it\nSupport comes from the ... center and Zach senator hosting a screening in conversation with playwright parents McNally November eleventh hour two pm on the UT campus items from the now these are kind of an more on new RSVP HR C. dot U. Texas dot edu\nThe association of American Medical colleges host the minority student medical career fair Saturday visit with college representative learn about the medical school admissions process and talked to current medical students more at eight A. M. C. dot O. R. G. under the students tab\nSupport comes from gripping school or college preparatory high school focused on academic rigor and creativity with interactive\nClasses and the supportive school community tours every Thursday nine AM details at Griffin schools dot org\nHappy Tuesday Texas is the standard I'm David Brown there have been reports during early voting in the Lone Star state that some voting machines in the largest counties are switching voter's ballot\nChoices [noise] so what exactly seems to be going on well Texas Public Radio's Ryan poppy reports that the company that made the machines as well as the Texas secretary of state or both pointing to user era\nThe ... the secretary of state's office has received fewer than twenty complaints from voters were tempted to vote straight ticket ballot they say that the U.S Senate choices where you are de selected or changed spokesman Sam Taylor says the complaints come from voters using the heart inter civic east late voting machine\nVoters click the button too quickly or started spinning the wheel before the screen had finished ran during that it could be select or a change one of the choices of one of the candidates on the ballot depending on how quickly that were spinning the wheel\nFor us as a whole anti Semitic incidents rose nearly sixty percent over the same period\nIn Houston I'm Andrew Schneider\nOne million dollars to install solar panels and batteries at people's homes to meet energy demands Georgetown is one of nine cities in the country and the only one in Texas doing the Bloomberg Philanthropies us mayors challenge\nThe year long competition encourages local leaders to come up with solutions to some of the toughest problems facing cities such as homelessness the opioid crisis in climate change\nJak daily is the assistant to the Georgetown city manager he explains that will Georgetown is growing rapidly it's exciting to see it when alongside larger American cities\nTo use a a boxing metaphor where we're above our weight class a little bit because we're with the likes of uh Los Angeles and in Denver and Philadelphia So we're really excited\nGeorgetown it's already the first city in Texas to get all of its electricity from renewable sources daily says they expect to start in selling the solar panels and competing batteries next year tomorrow it's Halloween but one Austin couple got a jumpstart on the festivities\nFor their party this past weekend Nicole Jensen in Sherry Horner turn their home and do a lotta wean restaurant\nModeled after what else why burger ABC affiliate K T R K reports that water burger even lend a helping hand giving Jensen and order some signage to make sure it wasn't authentic experience\nThat's get news from across the state I'm Becky ... for the Texas standard\nSupport for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more at the Texas ... guys or eight hundred teeth five to ...\nThirty three minutes past the hour Texas standard time I'm David Brown drive along the highway in Texas is oil country and you've probably seen them\nFlares burning off extra natural gas and oil fields or Saudis are supposed to be keeping tabs on this since flaring does have an impact on the environment and of course on policy decisions like promoting alternatives to oil but how much do we really know what about the scale of flaring in Texas\nMay be less than we think from the energy capital of the world Travis ... reports on energy and the environment from our partner station Houston Public media Travis welcome back to the standard hey good beer so flaring generally speaking is up any way as you've reported why is that\nBasically there are not enough ah pipelines in the ground in West Texas enough space on those pipelines to move all the gas that is coming up a\nWind drillers are out there pulling oil out of the ground they get a lot of what's called associated gas this is natural gas that just comes up with it and it's basically a by product it's not really worth anything they're certainly not drilling for the gas drilling for oil that's what they care about and so all this gas comes up they don't have enough infrastructure out there to move it all\nA cause the area's just booming so much and so they wind up a burning it off into the air which is\nOf course environmentally speaking not grapes it's a waste of you know a products to but it is a better approach than just releasing it into the air which is known as venting a that's a lot more dangerous to the atmosphere\nInteresting okay so I was a I I saw an article that Ehsan the global market intelligence had published and raised in an intriguing question are some shale producers under a hoarding gas flaring what's the theory here\nSo this is Ehsan ... analysis of some ... satellite data that they looked at said to be clear this is not my own analysis of this data factor other basically they looked at you know real time satellite data of flaring that no it does\nAnd they found that from twenty ... twenty Seventeen oil companies might in Texas might have flared off twice as much gases they wound up\nReporting to the states which then gave some reports to the feds the federal energy information administration\nBasically what's going on here is that essence he asserts that\nThere was this multi layered reporting system where oil and gas companies report to state regulators who then report to the federal energy information administration got it and they say in that chain of reporting you know some of these numbers might be getting lost or skewed too low and they know that this could be happening\nIntentionally or not but that it looks like it's happening\nOkay so let's assume the worst let's assume that there is intentional under reporting just for the sake of argument so we can understand what's at stake here why would oil companies have an interest in under reporting the number of uh uh sites where there are flares well there\nAre limits on swearing in Texas I mean the Texas railroad commission regulates the stuff or you have to get a permit to where\nThe river commission particularly in this boom times doing a lot of extending those permits and and allowing producers to flare which they've been criticized before but they've said that's just what's going on now and it's necessary to keep the oil flowing\nAnd you know there's just this possibility that uh companies are trying to make sure that they don't have to shut down their wells I mean you know wearing got too high the river commission might eventually say OK Our patients is run out you've got to shut down these wells\nAnd their possible yeah some of that that's going on currently but you know across the landscape this seeming under reporting\nIt's intentional would be you know designed to keep the oil flowing basically because that's the valuable commodity it's not this excess and gas\nOr doesn't that have a a legal if not criminal implications\n[noise] I mean yeah there are finds you know for violating permits and violating state regulations on this kind of stuff I mean I I\nSaid yes and the analysis to the Texas railroad commission ... spokesperson got back and said\nUh you know didn't really answer whether or not they're looking into this further but said you know our highest priority is protection of public safety in the environment in that you know Texas oil and gas companies have to be in compliance with the rules but again no sign whether the ... mission is going to look at this analysis in death anymore in particular\nIs it safe to using to to assume that there's more flaring than report it\nI don't know if it's safe to assume that I mean I I think that part of this as and the analysis of saying that you know this this multi layered reporting thing could be losing some of the numbers so that seems plausible but\nI don't know if it's as high I mean this is they're proprietary analysis that they've done a it's certainly something that environmental groups are concerned about I mean I can tell you just anecdotally that\nThere are things that happened in the oil field that um are accidents you know there are false see flares that are there ... when you go out there that are supposed to be burning off this gas\nBut are just kind of like your oven at home the pilot light went out sometimes the players go out and you know it can be awhile before somebody gets down the road and gets out there to relate it so I mean you know accidents happen and and things are um things happen in the oil that you don't always expect but I don't know if it's\nTo this degree obviously is something that folks are keeping an eye on including Travis move in a coup reports on energy in the environment for a partner station Houston Public media Travis thanks so much for your time You're welcome [noise]\nWe are coming up on thirty nine minutes past the hour in Texas standard time don't forget sweetest and let us know what's making news in your party ...\nTexas oncology whether reminder that October and his brand new cancer awareness month\n... early detection all women in the age of forty should undergo routine screening\nLike anything that like I had more at Texas oncology dot com\nSupport comes from the Austin chamber music center nostril via features the Russian string orchestras in an all Russian program including shots the cove which is quartet number eight November second and third details at Austin chamber music died or\nSupport comes from sales force essential that customer relationship management solution designed to help small businesses with sales and customer service Milton ... help users get on the road to success faster Lawrence sales force dot com slash radio\nYou are tuned into K U T Ninety point five in K. U. T. dot ORG\nSupport comes from St David foundation proudly investing in a healthy community for more information St David foundation dot org good health returns great benefits support\nComes from ... Donnelly certified Arbor is that they might be monkeys dedicated to maintaining and preserving Austin's trees in urban forest now located at the old oak hill fire station more at they might be monkeys dot com\n[noise]\nMy name's John Taylor Friedman I'm a tourist gripe from Canada\nTo tourists gold is a very important thing in the Jewish community the Torah is the same to the Christian school to enter the fist fights with the Bible [noise] Jewish community is right the ... out in a big girl\nAnd we read from it every week several times\nAnd like any other object with enough using enough people loving it at the time\nEvery few decades the cleanest she will commission and the girl\nTourist girls are written like people\nTo consider it to pass on the tradition to the Jewish people\nTraditionally that's been restricted to men [noise]\nSome congregations have decided to open up to leadership is a community to people who on men [noise]", "show_name": "Texas Standard", "year": "2018", "city": "Austin", "day": "31"}