{"month": "10", "state": "TX", "station": "KUT", "content": "A way that people have a right to be influenced by the people who they they take in as they're going through their formative years it was it hard to to acknowledge that influence and the same and at the same time figure out who you were\nAs a singer and songwriter\n[noise] you know I'm I'm triggered a tense that in two ways some of the first is to look at it statistically you know I'm\nStatistically I think his humanity\nUm you know Napoleon son I'm Frank Sinatra's son uh you know it's very very difficult to capture people's imaginations in the same way as one would be your name was Joe Smith you know and you had no Providence\nI'm statistically the errors of people who do great things can often not do great things as as as remarkably\nAnd in in such a beloved way\n... there's that and then there's the idea that uh you know that I grew up perhaps under this tyrannical shadow um the suppressive tyrannical shadow [laughter] it's quite the contrary I mean this was one of the most generous attentive nourishing characters I'd ever met he encouraged me up\nTo the upper upper Sonny's branches of the family tree\nAnd as I say you know I I really do believe my story is far more of a success story not just the instruction I got from a master not just having his attention and encouragement um and the example of his own life and work\nBut the great privilege\nOf being invited again you know\nHaving started in the mail room of the family business the great privilege that it was to end up in the at the penthouse in making boardroom decisions with my boss\nUsed to have a little bit about how other people might see you as a matter of constant but you haven't talked about yourself about your own process of development as a songwriter and finding finding your own voice\nUm\nBut it's just something comic about you know this incredible folk you know this this um I I see him as exceptional as a as miraculous in almost a in a way and you know to be talking about my little ... next to his offering just seems comic to\nTalk about yourself and apologizing unimportant you have the right to talk about it and the right to talk about yourself and claim your own test taking\nAs a you know it reminds me of one of my favorite lines from my dad he says I Will not be held liquid drunk crude under the cold tap of facts [laughter] so these are your facts ma'am\n[laughter] All right All right so with all that said I Want to play a sign of yours\nI'm given how I'm\nCareful you are about ... things I Want to ask you to choose the south [laughter] I Know this is I'm forcing it is against your will probably be rather not play anything but consider yourself forced to choose a song of yours for us to buy\nWell given the context um I think we should play a song that my old men always loved um was a song called what other guy\nOkay here's Adam ...\n[noise] no she lives in a\n... or some\nDrawl you my clothes in the news and then on the radio and know how many\nFrench news even ... even ...\nI Know it really is you can go in low when\nI Know\nWhere you go you\nKnow\nWhich is the last thing when\n\nNo issue\nThat's Adam Cohen singing his own time let other guy and Adam Cohn wrote the introduction to a new collection of his father his late father Leonard comes final um homes lyrics notebook entries and drawings it's called the fine thank you for letting [laughter]\nPlay that [laughter]\nDo you have to be a real ...\nWell for you yeah kind of kind of and I'm calling I really appreciate you doing this I Know you you're not not very comfortable having about your father or even talking about yourself in this kind of setting so thank you so much\nThank you so much most gracious and patients have you thank you\nAdam Cohen wrote the forward to the flame the new collection of his father Leonard ...\nPreviously unpublished lyrics ... entries and drawing tomorrow in ...\nLet's talk about had terrorists governments political campaigns even street gangs\nHave weaponized social media with real world consequences I guess we'll be P W singer and Emerson Brookings authors of the book like more\n... were closed today with Leonard Cohen you want\nFew claw\n\nYou're listening to your central Texas home for NPR the b._b._c. and fresh air K U T Ninety point five to\nFuel\nFor NPR comes from the station and from capital lunch committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet or capital one and [noise]\nAnd from tire Iraq it's more than five hundred tire models for twenty two manufacturers and an online tools for signing tires based on vehicle meets budget and brand\nTire rock dot com helping drivers find deliver install\nK. U. T. thumb membership dried is coming right have you don't have\nTo wait to make your contribution and not waiting makes a lot of sense\nWith our early very special and make your contribution at ten dollars a month or more ... day and you can get the new ... the public radio nerd the third and two of our world plastic ... three great thank you for one generation donations\nTo the new new to him down from ... the basic K. U. T. not\nOr right now and take a look at the new T shirt in Lansing Lang landed and check out it's fabulous offer make your investment in K. U. T. today at ten dollars a month or more to take advantage of this early bird special\nSupport comes from pure action hosting a panel of scientists took a third annual yoga research conference this October on the University of Texas campus scheduled speakers and more accurate auction dot org yoga is medicine\nThe healthier Texas somebody's coming to the ... conference center on the UT campus at the end of this month there'll be more than thirty five sessions over two days at this health and wellness conference aimed at creating a healthier Texas details and registration at its time Texas dot O. R. G.\nSupport comes from St Davis foundation working closely with more than sixty nonprofit partners in central Texas to invest in a healthy community more information at St David foundation\nDot org the Texas inmate families association provide support and resources for the families of incarcerated person and meetings are held the second Monday of every month at seven PM at the age Center for more information visit T. I. F. A. dot O. R. G.\nSupport comes from reverse Krieger ideology pollen Janet provide hearing from patients and physicians and listening or something like including custom fit monitors and hearing protection now with the second medication in West like\nMore and here in Austin\nFrom the below Center for new media at the University of Texas this is your central Texas home for NPR and the BBC K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T. dot O. R. G. I'm Jerry piano it's eight o'clock [noise]\n\n\nAre so far Ninety One percent of already registered what does that tell you\nWell now tells me you know that there's a lot of folks who are you know we're getting into registering to vote and also speak for the mobilization effort I'm going on there and Travis County because um you know registering to vote is not the simplest of things you know when I woke up my students on voter registration or those forms can be very challenging for for people who\nYou have to do the residential address mailing address it it's a step in the process so kudos to the folks that are in Travis County and the registration efforts\nWell let's talk about other parts of Texas I mean the mckell and monitor was recently writing about voter turnout in the valley is being consistently low during past elections\nAnd in fact that's led some candidates for statewide office dot to visit the area you think that this year could be any different given the I Will how we've seen Democrats energized and we know that a good part of south Texas is a majority democratic\n[noise] um yeah I saw that and I I'm In my own county to county or Corpus Christi is located turnout um registration is also\nOne thing I Wonder about some other research I've been doing in Texas politics as their shoulders harshly some real demographic shifts and and the electric you know we're having\nUm a is a huge cohort of younger voters coming on on this could be there for a selection of him so you know there could be some of the house and they're um what the campaigns with what's going on and a lot of registration efforts going on the ... election\nYou know this is something interesting and I wonder if either of you've seen this story more than two thousand applications to register to vote in Texas submitted through an online service\nAre invalid according to the secretary of state's office a Texas doesn't allow online registration but apparently a Web site run by a California based based nonprofit called vote dot ORG\nDaughter did found a loophole by allowing voters to fill out an online application and attach a photo of their signature which they did in fact and mailed to election administrators\nBut now the state saying no that's not going to be valid have you have you seen this story\nI've seen it yeah this is what a lot of Republicans worry about right the California station of taxes right I think that that is definitely the case that\nThat these groups are interested in finding a way to get more Texans registered to vote there are as many of these organizations as like seats in the ... so that's one thing and Carlos mentioned this to that is really helpful and getting more registered voters out there in fact the number registered voters has been going up since about the Nineteen nineties and so\nYou can find now these are available there's these notes devote anywhere you can get libraries and taco stands in every other restaurant you know up and down the you know Congress Avenue in Austin so\nThere are good things about this but the problem is getting people\nThen go register to vote and problems like this pop up their problems and also in Harris County the popped up with respect to some of the people who were otherwise eligible had been kicked off the rolls or a kind of a fluke and so this is something which the state needs to address and if they can't then there's always going to be kind of a lag in terms of\nWell you know something we should point out too is that the secretary of state's office maintains its position that uh these are not valid a there are some counties some officials in some counties who say their position is they're going to go ahead and accept these ah registration attempts until someone with authority tells him not to\nSo this could wind up being another post election day mess but of course will it will have to wait and see I think something that we've been sort of hinting at but I think we should address directly\nIs the fact that registration obviously is one thing showing up to the polls is another does any of this activity signaled anything about the midterms per se\nYou're voting in the United states a tougher than it is the most nations and most of the boxes on the world you're automatically the rest of the vote so we've got to pick a different steps and so people are so in that kind of enthusiasm terrific to vote pretty those of you know it has to be at least thirty is for the election to me that is an indication that there is a higher level of interest in selection\nAnd of course we have to devote to vote so you know I'm not expecting it to you know shattered you know sixty percent voted for anything like that but I Would expect that you know my expectation is this going to be higher than it's been said in the was the last ... and we had um a twenty um fourteen fourteen minutes from it'll be hard on that one I Would expect random\n[noise] I think so and like like Carlos says you know we've seen this lag and it's been pretty consistent I'd probably the reason is because the state has been dominated by one party or the other for the better part of last hundred plus years so that was Republican dominated and Democrats feel like their voice doesn't matter\nUm we also live at the fact that Latino turnout is lower than it is and other states um the number of eligible Latinos to vote is about forty four percent and that's in contrast to about eighty percent for the Anglo population the states also young I got that Carlos pointed to some really good for six figures but she just that you know a young state is not likely to turn out\nVoters who have more money mortgages and marriages are more likely to turn out and younger voters don't always have that so it's difficult to get people to\nGo from the stop of being registered to being mobilized by a group by a party or by candidate\nRented rotting houses political science professor at the University of Houston ... political science professor at Texas a and M. Corpus Christi gentlemen thank you both for being with us on the Texas standard have a great week but You're welcome [laughter]\n[noise]\nJoining us once again in the Texas standards newsroom is our social media editor wells Dunbar\nMinimum wage to ... to you as well you know these are polarizing times and with Brett Kavanaugh swearing in to the Supreme Court this weekend people both on the right and the left are fired up to vote in the mid term elections in here in Texas if you're not registered to vote tomorrow is\nYour last chance ... Texans can fill out an application in person that they're county voter registrars office and most post offices libraries and high schools also provide the necessary\nApplications needed Texans can also pronounce that application online but as we learned a few moments ago it must be mailed in with a signature Texas does not allow any form you need on the line Morris ration any ... of October night as well as the data and yes\nAnd this is pretty interesting you're not sure if you're registered to vote you can confirmed that you can do that on line by checking your registration Stan is on the Texas secretary of state's website before we've shared the link on our Facebook and Twitter pages are folks can really just even Google him I registered to vote in Texas\nAnd I should take you there we're hearing from pokes folks people ready to vote on her face but we are yes Carolyn ... says that her entire household is registered including her Eighteen year old who will vote in his first election\nIn November and Robert flood flood excuse me they're just registering to vote and then voting or the most patriotic act any American and Texan\nCan do and another quick plug you go David Texas Public radio reporters want our listeners questions about the election as part of our Texas besides theories I Know one story in the pipeline has to do with the yard signs what's permissible in ... and whatnot as interesting question\nYeah how do you turn up the ex decides if you're on Twitter orange back at the top ten after slipping past Oklahoma and the Texans beat the cowboys wells back in thirty five\nSo hard to protect the standard ... providing Nestle certainly don't tend to find more software as Thomas dot com forward to stand at the Texas tuition promise signed an exodus college savings plans administered\nBy the state of Texas offering a pair of plants that can help families saved ... college dreams more safe now for college dot org\nSometimes the news can feel far off from your day to day on all things considered recovery national story on a local level to listen to all things considered to hear the bigger picture every afternoon\nYou can hear all things considered live tomorrow at four pm right here on K U T Ninety point five [noise]\nSupport comes from Barton Springs nursery on became wrote in Westlake specializing in native taxes and adapted plant since Nineteen eighty six details at Barton Springs nursery dot net [noise]\n[noise] support\nComes from camp contemporary October twenty in transforming the moon and Laurie ... into the creative can for adults are making campfires camp inspired fair cocktails\nMusic including locker Lukens and more tickets at the contemporary often dot org slash camp\nPage Texas standard I'm David Brown the military calls an active duty but with about eighty thousand women who are mothers that turns into double duty or more that's for sure many of those new mothers and the armed forces often choose to breastfeed after returning from maternity leave but sticking to their plans of action can be challenging to say the least\nTexas Public radio Carson frame reports\nJessica King return to Lackland Air force base last year after giving birth to a baby girl she wanted to continue breastfeeding after coming back to duty\nKing a basic training instructor had seen other women in her position weaned early but she was determined\nAs much as I Love this child and what we do this job wasn't going to be the reason why I didn't provide the best to make it\nBack among the trainees she found herself without a dedicated place to pump her leadership gave her leeway to find empty rooms in an office building the king spent most of her days outside guiding new recruits their exercise\nAs I was using our training hold over and and that's where we play like six Chinese like when they're quarantine from their flight so it it's not the most high Jenike room\nElder was born in El Paso but how deep roots and Valentine, Texas in a ... interview he told market public radio that as a kid he always looked forward to visiting the small town\nJust didn't uh didn't have the the outdoors other near my horses and dogs and I just didn't have the landscaping services which you have your\nThe circumstances of elders deaths are unclear at this time the Dallas Mavericks longtime team photographer hasn't been fired that's according to reports from the Dallas Morning news is sports blog sports day\nSources said that Danny volunteer was fired on friday less than a day after the paper reported on sexual harassment allegations made by multiple women against the photographer\nFemale employees told the Dallas Morning news that bond you had a history of proposition ... female coworkers as well as making inappropriate sexual comments in the workplace the organization opened an investigation into volunteer several weeks ago on the heels of another investigation into sexual harassment within the organizations business office\nVolunteer was not named in that initial report even though two women who spoke to the Dallas Morning news that they had discussed volunteers behavior with investigators\n... year old had worked for the teams marketing department for nearly Twenty years that the look at news from across the state I'm Alexandra heart for the Texas standard support\nFor these types of standard headlines ... Baron Adler cliff an auto handling eminent domain and condemnation cases throughout access protecting private property rights for over Thirty years Baron Adler dot com\nDirty three minutes ... our Texas standard time I'm David Brown over the past many months it seems we've learned from one politically charged outrage do another with real world implications that are hard to fathom lest we forget our summer started it was a crisis on the border remember\nBest estimates are that some too strong what is it twenty six hundred\nMigrant children who migrated here with their families without documentation were separated from their parents with the border but there are other children who weren't included in that jumped because they'd already been released from government custody by the time a judge ordered reunification and now in October what\nIs the state of the reunion from K. R. W. gee just over the border in last crucial ... reports\nIn some ways ... story is like so many others she fled Guatemala with her eleven year old daughter a shy studious kid who wants to be either a ballerina or an English teacher ... says local gang members were threatening her daughter's life\nThey got to the U. S. Clara was detained and her daughter was taken away\nIt took several weeks to track her down at a shelter in Chicago but here's the critical difference ... daughter was released from that shelter fairly quickly by the time a judge ordered the government to reunify families she was already living with her uncle and aunt chorus brother and sister in law\n\nThat Claire speaks on an echo your phone line summer west Texas detention center where using a pseudonym to protect her identity there were other mountains in that detention center but after the court injunction they started to get out choir says she asked unofficial why she wasn't being reunified with her child\nOn me\nAnd he told me your daughter has already been reunified with a relative ... says\nThe government is alleging that a reunification has already taken place\nLinda ... is an immigration attorney in El Paso who's representing ... and three other parents in similar positions\nWhere St that cannot be too we have not restored a parent and child together\nWhen the court order came down in late June about twenty six hundred children were in government custody most with all our our the office of refugee resettlement but there were also kids like chorus daughter who'd already been released to sponsors\nThe government has taken the position that children who were released from custody before the injunction was assured are not part of the cage and a lot of title to reunify with their families\nLegal aren't as an attorney with the ACLU which sued the government over family separation it's not clear how many children fall into this category the government hasn't released those numbers and the department of health and Human Services declined an interview request\nWhatever the number ... says these children have the right to be reunified with their parents\nWe don't think there should be an artificial deadline when a child is titled weird discussion\n... has another concern we believe some families find a way of their children to live with sponsors\nNot understanding that they didn't have to do that and that they had a right to reunify with their child\nCynthia canal is is an immigration attorney in El Paso and she says she's representing one mother who did exactly that\nHer daughter was desperate to get out of a government shelter and she had no idea out there was a court case in the works so she signed her child over to our relatives this was before canal is got involved with the case\nAt the time she made what she thought was the best decision the reality is has she know that they were gonna start reuniting she probably would have chosen to be reunited\nLegal aren't with the ACLU wants to make something clear even if the government reverse its course and decides these parents are eligible for reunification\nThat doesn't necessarily mean they'll get released from detention the government could release them or it could give them a choice to reunify with their children and family detention or have their children stay with sponsors still ... says it's important for parents to have that choice\nIn many cases the child is not know the sponsor for a little connection to the sponsor and so if a parent wants to child back they need to be given the child back\n... says the ACLU may bring some of these issues to court but for now parents like Clara just have to wait in detention\nThis child\nClara says she doesn't speak to her daughter very often\n\nI can only ask how she's doing because she starts to cry immediately and can't walk anymore ... says\nAt that point choirs sister in law usually gets on the line she says she and her husband are giving the girl lots of affection and she's doing well in school that she's sad and doesn't understand her mom can't do that and\nThen\nWhen they speak ... sister in law pleads your daughter needs you for the Texas standard I'm Mallory phone in El Paso and\nWe're approaching thirty nine minutes actually our Texas ... then\nThere's a lot more of the standard just ahead so don't talk to their child\nSupport for Texas standard comes from the scene you wear horn frogs strive to be ethical leaders in global systems like Dr Jonathan Oliver who's researching solutions to reduce concussion damage among athletes TCU lead on\nThis is the Texas centered on ... on K U T Ninety point five and K. U. T. dot O. R. G. thanks for being here [noise]\nMy wife and I were going to a damn toes when it was down here on the grid\nAnd um we went to rubies barbecue next door and we were sitting rubies eating and ... percent walked in with another man him sit down and start eating and\nI didn't know too young to me but I read you know look to him and\nTell us when we're through here are driven toward him here Doug from Floyd joined us said okay so we went over to a man's home on the table him so evening [noise] found flirted with my word\nI thought it was kinda funny and then on the one moment he leaned over close to me it's time for them and I'm working on a divorce and I said oh you are I didn't even though you were married no work does your divorce\nBugged me\nMy name is ... you are listening to tell you to the hospital\nHuge detects a standard on a Monday I'm David Brown great to have you with us what you got there in your hands cell phone maybe\nYeah our cell phones with us or closer to ready speakers that not only project sound but listen to his talking of course there's the possibility of the country's first robot brothel in Houston I suppose you put all that stuff together and it's probably fair to say that we the people that reached\nA complicated period in our relationship with a machine now there's an art exhibit exploring the dawn of that relationship and how we think of ourselves\nSuit Canterbury is the curator of the Dallas museum of art presentation of cult of the machine precision isn't at American art sue of them is actually standard\nThank you tell us a little bit about why you chose a cult of the machine I mean is that does sound fairly dark here\nWell it's a two edge sword in a sense well the cult of the machine or there was really this obsession between the two world wars\nOr right now and take a look at the new T shirt em laughing laying landed and check out this fabulous offer make your investment and K. U. T. today\nAt ten dollars a month or more to take advantage of this early bird special\n\nWhere does your day to go after the pull the plug\nMarketplace morning report is supported by exact\nScience is offering color guard for average risk adults over fifty color guard is a non invasive colon cancer screening tests that can be used at home available by prescription only information that Colin ...\nHand by constant contact with hundreds of customize of all emailed template for small businesses can reach customers where they are everyday they're inbox learn more in constant contact dot com\nI'm David Brancaccio in New York the private information of as many as half a million\nGoogle users was found to be hanging out there for potential hackers to see until the whole was plugged\nThis spring the wall Street Journal has details of how Google did not disclose the security flaw when it was discovered in part because they didn't want to further riled regulators software problem was related to the Google Plus social networking unsuccessful rival to Facebook\nGoogle Now says it's getting rid of Google Plus but what happens to your data when a platform unraveled marketplaces Jed Kim reports Google\nPlus was the mega tech giants answered Facebook did was above St Peter's wire researches privacy and cyber security at Georgia Tech he says products that dwindle away don't attract the company's top talent that attention\nWhen companies have out there that are no longer a central to model there's a general concern will open a higher standard and that may have happened here\nIt's not clear what security Google is giving the project the company did not give an interview but says it's not evident any user data was misused still there are concerns about the ways companies handle personal data first systems they no longer support will be the light and as a security analyst at Gartner she says I T clean up\nIts not China diligently as putting these on line and it it doesn't have the same level of attention\nNews of the security loopholes which exposed information like names jobs email addresses led the company to finally pulled the plug on the consumer version of chicken for marketplace\nPresident Trump will head to Iowa today after announcing he's lifting a ban on sales of high ethanol fuel during the summer the president is trying to appeal to corn farmers but his marketplaces Nancy Marshall ... reports this may not help\nThem much most of the gas you buy the punk contains ten percent ethanol which is made from corn\nBut some station so gasoline that's Fifteen Percent ethanol called ... Fifteen they can't sell a Fifteen during the summer though because it can create smog Josh price hike capital markets says lifting the summer ban is mostly a political move for President Trump\nIs generated weeks of headlines talking about he says teen and voters in Iowa the news headlines and though it's probably helps them already\nPrice says only about Fifteen hundred gas stations across the country sell e Fifteen so there won't be a huge jump in demand plus the environmental protection agency will have to write a rule lifting the ban then there's a comment period Tom close up oil price information service says oh that may not be done by next summer\nThere's a lot of stuff could happen in the polls for these things quicker looks pretty\nPlus closest says they're short if the court challenges in Washington I'm Nancy Marshall cancer free marketplace let me check the live market screens\nHere Doug Jones industrial average user\nDown Twenty one point to tend to ... percent the U.S and the five hundred is up ... percent than as a composite index of fifty four point seven\nTen percent interest rates have been trending higher in recent weeks today they're down the ten year treasury yields is below three point to two percent\nMarketplace morning report is supported by allowing private helping privately held companies address risk and find opportunity in today's complex business environment you can learn more is to Lloyd dot com slash us slash cried it\nCan buy for X. dot com committed to empowering and helping traders seize opportunities and currency markets since Nineteen Ninety nine for X. dot com it's your World Trade it for extracting involves significant risk of loss\nAnd by legal assume offering a network of independent attorneys who can provide the advice your business needs more legal assume dot com slash marketplace\nYou can gym in your ear buds you can try to wall yourself and under your desk with bankers boxes but how are you really supposed to handle it when people want to talk politics at work especially in these divided days\nWhen we work with Alison green who writes the popular ask a manager blog where you can write to her or to us with your thorny workplace or management issues thanks for weighing in here\nHi David thanks for having me we talked to some people before the last presidential election who had lost clients because politics came up and they did not see eye to eye and people fired them\nIt's still going on we have a very polarized America give us some advice here I mean what do you do if politics comes up at the office and you're the person who don't want to talk about it\nYeah it really is okay to set boundaries if you don't want to talk politics at work you can be directed at that you can say you know we look at these issues pretty differently and I'd rather keep politics out of our work relationship and other people may actually be relieved that someone is setting that boundary but\nThe presumption or your answer is that it can be acceptable\nTo talk politics in some offices in certain situations\nIf everyone involved is consenting to the conversation that's fine I Would say you want to be aware of trapped bystanders he might not appreciate the conversation as well that's a good way to drive your coworkers Matt or just make it hard for them to concentrate so you've got to be respectful of that that\nIs also at some levels of diversity issue because if you have a model culture you hire only people who agree with the boss politically that's going to cut out some talent\nI think that's a problem that I care about ... is that they're working in an office where their political views are very different from most people around them that people are assuming that they agree and they're drying them into conversations sort of [laughter] making them feel complicit in the planes that they find pretty harmful or offensive\nLarge these days to pull this off in recent days the Supreme Court nomination hearings I've been going on and even if someone is\nResolved I'm not going to talk about this at work regardless of what side of that particular issue one is you can imagine someone looking at the TV and saying oh you know one way or another and it's a little hard to suppress\nAll of one's reactions\nI think it can be useful to to think about it from the other side if your coworker we're talking about a candidate all the time who you found frankly harmful or had a big sign in their office promoting them\nAt night impact the way that you thought of that person may impact the relationship in subtle ways and there's no reason that you need to inject into your workplace there are a lot of other times and places to use your life in the political process but work generally should not be one of them\nAsk a manager Alison green is a work advice columnist Alison thank you thank you\nYou heard there is not just speech I asked her about red make America great again hats\nOr my body my choice shirts and now since ... was not at work\nWe'll sit above and beyond flick coming economically or whatever the policy is\nOur producers are Michael looking Katie long and Daniel ... and I'm David Brancaccio marketplace morning report from eight PM American public media\nSupport comes from the American Cancer Society and often everyday cancer patients struggled to find transportation to treatment the American Cancer Society needs volunteers now to help drive patients to their medical appointments learn more had cancer dot org backslash dried\nThis is Austin's NPR station K. U. T. N. K. U. T. H. D. one off than we are online at K. U. T. dot org I'm Jennifer state and hope you're Tuesday is going well so far thanks for tuning in to K. U. T.\nA little bit of sun tried this morning but mostly cloudy skies ahead Seventy percent chance of showers and the thunderstorms\nSome of this could be severe high near eighty five degrees today was the one let you know the lower Colorado River authority is opening floodgates\nUpstream from lake Travis that's because of very heavy rainfall and he'll country on Sunday and Monday and like Travis has already reason a couple of feet as that floodwater moved downstream this is K. U. T. it's ten o'clock\nAfter Gavin all the next battle royale on Capitol Hill was Texas at the center of the conversation a big push for the border wall today on the Texas down [noise]\n\n[laughter]\nAnd I have to pay our a decent public radio incentive\nSupport from ran for software delivered his comment [laughter]\nI'm David Brown But Kevin confirmation may have had an unexpected consequences delaying a fight over the border wall until after the mid term it looks like this one could get ugly will have the latest also\nA border battle of a different sort of bend off biological ... how the department of homeland security is teaming up with Texas ... had the last day for voters to register in Texas how touch pads and London are\nGetting involved in the biggest state wide range all that and more today on the Texas then [laughter]\nIt's my understanding that the president wants five billion dollars for the border wall and twenty Nineteen Democrats have only agreed to I guess less than two billion dollars of bad did did Speaker Ryan give any sense of how this by going to go to ... be resolved\nNo and for all the discussion of this I'm In the past few months about\nTrying to convince the president to postpone the fight until after the election which they succeeded in doing there has never been a clear strategy laid out by anyone publicly and I don't know that it exists about how to get to that five billion number\nA Ryan again asked about this yesterday and said that it remains to be saying they'll work it out in December but it's not clear how they will do that they need democratic votes and the Senate\nAnd you know we'll see what happens in the mid term but for now at least Democrats are in no mood to go along with that higher number\nWould briefly is there still this talk about there being a solid border wall or has that been ditched in lieu of something that's much more sort of a piecemeal\nWell in reality as you and your listeners know it's not possible to build a solid border wall along the entire report or a and\nLeading Republicans like John Cornyn will acknowledge that ah when you talk to them but ... ... rhetorically from the president he often still makes it sound like what he wants is a big solid border wall and there are some kind of a\nConservatives in the house Freedom Caucus types and others like Steve King of Iowa\nWho insist that what they actually want is a physical\nBorder wall along the entire border\nBut that's just not the reality that's not going to happen and even Trump has occasionally use words like fence says uh to describe what he wants\nWe've been talking with Eric runners she reports for the Washington Post and we'll link to her latest of Texas standard auto ... so you can check it out Erica thanks so much for speaking with us on the standard we should appreciate thanks for having me\nMost you missed it uh today's the last day to register to vote in Texas you if you want to cast her ballot in November you know we mentioned the Senate\nRace between incumbent Ted Cruz and representative Beto O'Rourke noxious dominating headlines in Texas but even get the attention of the writers it's Saturday Night live who did a reform Mary attempt by Ted Cruz to get out\nThe youth vote if you missed it it's all over YouTube and beyond it's also making news overseas to not the SNL clip but the actual race\nThe b._b._c. wanted to find out how this contest is playing out writing their own backyard which is to say to London where there's a sizable number of what you might call text pets\nYou know I actually didn't legitimate within so we really appreciate your health and don't\nLearn to register to vote in this year's midterms is closing and here in the Democrats Abroad campaign office in London there's a frenzy of activity in a windowless room in a basement around a dozen volunteerism making pools in the evening after they finished book campaign office manager David lessening in charge\nSo we're following orders and some of them are just American Motors here in the u._k. and have given us their details of the words into warm call to jump a reminder original question grabs this\nNext to a flag in the ... is a white ... so what are you pointing at him\nOr warning or chart when registration deadlines or for instance Florida Georgia Kentucky Ohio survey near nine out of the registration environment\nIn the u._k. there is some casual stereotypes about Texas cowboy hats on a slump tools conservative politics\nWith every ... a little bit of truth in in some of those people I grew up with or are people with big hats and people who who carry guns\nAnother David originally from ... Texas has been living in the u._k. for Eighteen years some of them are actually\nReally the most interested in and and the worst campaign and another congressional anyway we're\nThe prospect of Ted Cruz potentially losing his Senate seat has grabbed the attention of some Texans living here in the u._k.\nAnd the races in Texas or super excited they are war I think he's on fire right now\nRebecca lived in Austin before she moved to London she too says this election feels different\nExcited and slightly nauseous I think it's really I don't know I feel like this is the first time since Trump was elected but people have a lot of reasons really helpful because\nIt's not just the Democrats active here in the u._k. and it would ... I met Sarah\nMy name is Sarah Palin and I'm chair of Republicans Overseas he's K\n... to make sure that the ...\nLiving here in the u._k. are aware of that right to vote\nTied to educate our members um and also keep them on damage to the hot races and where they matters of course that the idea is to make sure they understand the absentee voting is simple and easy and we helped in the process of\nMuch of the coverage of the midterms in the U.S has focused on the energy on the side of the Democrats I also at it from Republicans Overseas is that dynamic was playing out here in the u._k.\nIt hasn't gas has been a good twelve point spread between Democrats and Republicans and Democrats seem very tired but I think that's changing as as the last to leave\nThe Senate confirmation hearing for justice Brett Kavanaugh was carried live here on the u._k. television most policies say that issue is energizing the votes as just a few weeks from election day\n... and getting fired up about it and again it's uniting the party whereas in town and they really divisive party this is an area where we are like man this is a really good guy who's been tied unjustly\nProtects the standard in London on ... at the BBC\n[noise]\nJoining us here in the studio social media editor was done by it's October night for the last day to register to vote in the twenty Eighteen midterms as many are noting on social media if you've registered to vote in previous elections and haven't moved or nothing's changed you're all set\nIf you need to check if you're registered can confirmed that on line by checking your status at the Texas secretary of state's website we've shared that link on our Facebook and Twitter pages where you can just search on line they're not registered to vote in Texas\nNeither registered Texans can fill out an application in a person that they're county voter registrars office you can also find most registrations of post offices libraries and such but there must be signed and post marked tonight\nOn our Facebook page Julie Lucas says we're ready to vote my daughter turned Eighteen in March registered to vote and is excited to participate in this right of passage and Karen L thorough says I unfortunately can't vote yet because of my immigration status but I Am so pumped to see the results\nAnd the turnout for this election just one story folks are talking about what's going on Nikki Haley's\nResignation at the United nations arm she's a that's being contrary yes yes I just met with the president earlier and it was all over the television so yeah I'm seeing a someone else might be meeting with the president later this week Kanye West apparently headed to the White House you know maybe he'll\nUn cos throw his hat into the ... coming up on Ninety minutes past the hour Texas standard time a whole lot more head stay with us\nSupport for tax the standard cancer ... providing ... more have software asked promise jackass [noise]\n\nSupport comes from central market please Cinderella pumpkins plight pumpkins and locally grounds clashes and gory central market is here to help decorate and celebrate this fall more central market dot com\nSupport comes from live oak Brewing Company on the European style loggers nails and the black forest and German inspired Texan made ... hours menu and catering and group border details at black forest H. T. X. dot com\nHere after Harvey wind scene and meet to New York is enacting the country's strictest workplace sexual harassment laws\nThey wouldn't have trading that goes well beyond sexual harassment you want it to cover discrimination and harassment based upon any protective category not just sexual harassment\nThat story but justice Brett Kavanaugh ... first day on the Supreme Court this afternoon on all things considered from NPR News [noise]\nJoin us for all things considered live every day for hearing K U T Ninety five\nVisits and your money on their standard on David Brown is the situation that might sound like a good one to have so much energy you don't know what to do with it all went on the west Texas oil field companies have so much natural gas on tap they're increasingly burning it off into the air flaring as it's called is recently hit record high levels\nThat's Lauren critics concerned about local pollution to say nothing of the effect on dark skies out west itself valued resource companies say there's not a whole lot they can do about it at the moment though they're trying they say\nIs Houston Public media's Travis ... tells us the future of the issue largely hangs on how aggressively the industry decides to act\n[noise] a couple of years ago Jim and Suzanne Franklin's quiet country life\nOutside the Taliban re was a lot different\nThan that used to this was so dark you had the most beautiful view of the Milky Way\nYou start hearing you just start counting one too\nTo protect the student has taken certain star tests before starting high school that's created a problem no state assessments left to test them with\n... with the Texas education agency says the every student succeeds act requires that students to be tested in math and English at least once during high school as a result about one hundred and nine thousand students will have to take either the SAT or the ACT this year\nSo any student who is currently enrolled in high school and took the algebra one and or both English language art and of course exams prior to high school will need to take one of these tests\nOrder to uh meet the requirements for federal law\nThe additional tests are expected to cost around five point four million dollar statewide and the TAs now reviewing public comments after proposing the price tag be covered by school districts in the letter to the T.\nAustin ... said these tests would across the district at least one hundred thousand dollars for current students and called for a legislative appropriation request to cover the cost\nJerry ... K U G news\nRaining major league baseball chance the Houston Astros are returning to the American league championship series for the second year in a row they clinched the spot Monday after sweeping the Cleveland Indians and three games asteroids infielder Alex pregnant shared his thoughts after yesterday's eleven three when over Cleveland\nWe're excited we're we're looking forward to the next day I'm getting ready to start off course against whatever to move on us\nThat could be either the Boston Red Sox or the New York Yankees whoever wins that division series will face off against the Houston Astros starting Saturday That's will get news from across the state I'm Becky ... they'll go for the\nTexas standard support for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more at vote Texas ... or eight hundred to five to about\nThirty three minutes past the hour Texas standard time I'm David Brown right have you with us for months Florida's beaches had been plagued by red tide it's kind of algae bloom that can kill marine life and harm humans if they're exposed to it\nThe most recent blooms lasted for months and few beaches along the sunshine state for western coast of been untouched which has created major problems both of those oceanside ecosystems and\nCertainly for tourism\nA situation that some Texans are watching with increased interest since our Gulf Coast is no stranger to red tide either Tony rushing or use coastal in marine resources extension agent was Texas a and M. agar life extension service\nTexas sea grant at Texas a and M. university and Cameron County Tony a weapon which actually standard\nThank you David First what do we know about what causes red tide and what makes it pop up when it does\nWell we don't really know exactly what causes that we know it's always out there a Texas a and M. did some research few years ago and found out that the bay of ... ... is a source of our Texas Red tide blooms\nBeckham paycheck border but it's not a map there because I I Want to make sure that our listeners understand where we're talking about\nIt's the southern part of the Gulf of Mexico off of Mexico between the you cut down and say Tom only as the state of Tamaulipas which is just south of us here in Texas\nTony what was the last time Texas experienced or red tide bloom\nIt was in September when we had a red tide bloom occurred here in Texas up a device called a site or bought in the uh in Iran's is a Puerto ... picked up a elevated numbers themselves I think it was like\nThirty cells in six millimeters and that's a little bit of elevated more than background and so Texas a and M. give gave us a a a heads up\nBut it didn't last long and move more north than we only found background down here all south Padre Island but so we're lucky we dodged the bullet\nWhat was it what is it that people living along the coast actually fear what what what is the danger that this red tide brings\nIt it's more dangerous for people that that have asthma or or a respiratory problems because the self contained say neuro toxin called ... toxin\nAnd when you breathe that it irritates your respiratory system so we report we warn people with asthma to pretty much stay away from it or stay inside air conditioning and\nWhen you do have a heavy bloom the cells are called an armored diner flatulent and they break\nEasily in the waves in the surf mhm an aerosol eyes is and so the air assault is blown onshore usually if the wind is on shore and people breathe that not that results in in the irritation of the respiratory system\nBut there is no red tide in Texas right now I must say that whenever people here red tide they they think that we're having a blue but we are not in Texas\nSo how did how we become relatively lucky compared with our friends in Florida\nWe were lucky um you could probably attribute it to several several things um could be the wins the currents um we did have a cold water up well in the summer and red tide like hot\nCalm water and we we did see the the coastal area I guess around corpus down here\nIn the surf the temperature cools down significantly and that could have inhibited any bloom that we could have had\nIt's not just the uh harmed that this can do to people who suffer from asthma but we're also talking about massive fish killed at least in the past year in Texas right\nYes we've had been the worst one we ever had was Nineteen eighty six and we lost twenty two million fish and the blooms spread throughout the whole state of Texas\nAnd um it was it was significant but not only do we lose fish mammals are susceptible we've seen a dogs die from a from inhaling week we suspect phone that's on the beach and we've seen a Mexican ground squirrels die\nA pelicans um are we seeing lots of animals affected by it too\nWell so I Wonder as we look at the situation in Florida whether there might be some lessons that we can take away and apply to Texas or is there any way that we can preempt a red tide you are in in the future\nI don't think so it's pretty much a naturally occurring event um it is occurring more frequently lately um I think we've seen over a dozen\nSince the Nineteen eighty six bloom and doesn't blooms in Texas um but before Nineteen eighty six there were only three reported blooms in the state that we know of\nTony Rock singer is a coastal and Marines resources extension agent Texas a and M. agra life extension service also Texas sea grant at Texas A M university\nUsing cameras county Tony thanks so much for taking a few minutes to talk with us on the Texas fan [noise] your wealth [noise]\nYou know it may be hard for a lot of folks would appreciate today but not that long ago in parts of some of our major cities across the Lone Star state people were living in shacks dirt floors all that changed\nAnd will tell you how as the standard continue [laughter]\nThe standard ... Texas advocating for his face and positive teacher for all the children in a child protection [laughter] commentary information and become a cop that data where every child\n\nSupport comes from the contemporary Austin presenting enigmatic expeditions by ... Jessica Stockholder and Robert Davidson after John center on Congress Avenue and new outdoor sculptures that Laguna Gloria the contemporary Austin dot org support\nComes from Joni and Greg Greece and collect take home featuring a curated collection of furniture lighting and gift ideas made in the U.S and around the world on ... road enrolling lead and collect take home dot com [noise]\nAmerican short fiction presents that third annual stars at night fundraiser that's this Thursday at mercury home featuring readings by this year's honor ...\nMore at Vandenberg and Fernando ... plus music from the tank got tickets at American short fiction dot org you're listening to the Texas standard on K U T ... point five to ten forty\n\nOn the planes we don't have grand wider and the ... ... if you don't have a lot of rain and said ... cable under the ground and steam engine to come and go Fifteen miles before they had to stop and take on loaded wider so it took a lie to\nLeave me up to keep the ... field for the trains to help settle the planes\nBetween Eighteen fifty in Nineteen twenty over seven hundred companies manufacturing when males and was real real electrification when people were going can ... the Panthers\nWhen tempers so some companies down to business some diversified\nStayed in business doing anything\nTo how does raise some farm and got my drinking one from ... to basically ... mental laid [noise] we didn't have a drink in life you can never win now he's gotten into him growing up and we never learned to play on the power he got when you get some ladder someone how", "show_name": "Texas Standard", "year": "2018", "city": "Austin", "day": "09"}