{"month": "10", "state": "TX", "station": "KUT", "content": "Fertile period that also produced his Brandenburg can share those his or Castro\nSweets and the six and not as in partied is for solo violin it was a long time before the sweets caught on to this concert pieces\nPerhaps the greatest cellist whoever lived ... began studying them when he was Thirteen but it wasn't until Nineteen thirty six when he was nearly sixty that he began making the very first recordings of the complete set\nYo yo ma started learning the show's sweets when he was for\nAs a teenager 'cause songs became his musical hero\nMom made his first recording of the sweets in Nineteen eighty five when he was approaching thirty and won a Grammy as best instrumental soloist\nIn his forties he recorded them again this time to accompany a series of videos called inspired by by\nOne of the videos was with the champion ice dancers cordial and dean and included my himself playing the cello in times square the most inspired video was mosque collaboration with choreographer mark Morris\nWho turned the popular sweet number three into a dance called falling down stairs\nWhich begins with the dancers racing down a flight of steps to the descending run of the opening prelude\n\n\nAnd and\n\nNow the yo yo ma is in his early sixties he has recorded box cello sweets\nAgain and promises that this will be the last time the new album is called six evolution is\nLike the civil the violin partied is the cello sweets each consist of six dance movements alternating joy and celebrity\nSix sweets six movements each new neurologist can have a field day by indicated no temple markings so the speed of each movement is left completely up to the performer\nMy has always conveyed the music ... song fullness more than ... ferocity\nBut in this latest evolution ... cello has more speaking quality than his previous versions he presents box as a wise and quietly spellbinding storyteller Mm\n\nMm Mm\n[noise]\nMm\n\nMm Mm\nMm Mm\nMm [noise]\nMm\n[noise]\nMm\nMm\nYo yo ma gives each week a tidal\nNature at play\nJourney to light celebration building\nStruggle for hope\nAnd finally a Tiffany\nThese titles underlined the way each suite tells its own story how each one finds its own way to balance dancing and limitation\nBut then each one becomes a chapter in a bigger story how old is leads taken together in larger and larger patterns of light in darkness gather all of us up the composer the performer and even the listener\nToo of vast process of soul searching and discovery\nLarge forces the Frederick ask Troy professor of English at the University of Massachusetts Boston is most recent book of poems it's called little kisses he reviewed ... new recording of box six cello sweets called six evolution Mm\n... and I guess will be the nest egg Laurie ... author of blurred lines rethinking sex power and consent on campus\nAbout ... holidays are dealing with the issue of sexual assault how to define it and how to decide who to believe when accusations ... I Hope I'm feeling or\nFresh air is executive producer is any Miller I Can't remember the revenue and engineers of events and associate producer for digital media as ... show ... and ...\nAnd I'm ... and you're listening to fresh air here on community supported public radio from UT Austin K U T Ninety point five and K. U. T. dot O. R. G.\nTonight clears with ... and the upper fifties which is the norm for this time of the year tomorrow mostly sunny in the morning and then becoming partly cloudy ice in the mid seventies\n[noise]\n\n... well\nThe board for NPR comes from this station and from Amazon Prime them with their own minimum a new series from the creator if not then\nStarring Diane Lane Aaron Eckhart Christina Hendrickson Isabel he premiering October twelve lung prime video\nAnd from tire Iraq with more than five hundred tire models from twenty to manufacturers and an online tool for finding tires based on vehicle needs budget and\nBrand tire rock dot com helping drivers find deliver install\nSupport comes from Jenny in Greece and at collecting home featuring a curated collection of furniture lighting and gift ideas you made in the U.S and around the world on ... road enrolling lending and it collecting home dot com\nSupport comes from St David foundation investing in healthy smiles through its mobile dental program which provides a dental care more than ten thousand students each year more information at St David foundation dot org\nFrom the below Center for new media at the University of Texas you are listening to K. U. T. N. K. U. T. H. D. one Austin we are online at K. U. T. dot O. R. G.\nThe midterm elections are coming right up and down the books like you the gay UT vehicle donation program is doing its part to help pay for the news and information you need to make up your mind about who to vote for a November donate their old car tracker bumped to us we turned it into ... K. U. T. election coverage for everyone\nAnd possible tax deduction for you will even come pick it up for free and get the details right now by calling eight seven seven ... we're going to the support\nSection of K. U. T. data y G Texas state librarian archives commission presents setting the Texas table and exhibit on the history of Texas food culture and nobody reception takes place tomorrow featuring Texas food and drink and pumpkin decorating details that T. S. L. dot Texas ... G. O. V.\nSupport comes from challenger school inspiring children to embrace challenging find joy and southward through achievement enrollment is accepted year round and all three north often locations Laurie challenges schools dot com\nSupport comes from one ... the editor of the Broadway musical that explores the power of music to connect us off with wide musicians onstage and an Irish pub in the lobby playing through October twenty eight tickets exact theater die to work [noise]\nAs a category ... hurricane bearing down on the Florida Panhandle parts of Texas hill country try to recover from flash flooding the latest on both fronts today on the Texas down [noise]\n\n[laughter] accent I have to pay our age [laughter] radio incentive [laughter]\nHorse ranch halfway to protest [laughter]\nI've been around it was actually standard newsroom after family separations at the border a new concern rows and ate the investigation finds deported parents in danger of losing kids to us adoption also do student athletes have a fundamental right to be protected from concussions closely watched civil rights lawsuit filed by parents\nHave been injured player and a claim from the campaign trail is marijuana really legal in most states politifact jak there's more to stay on the Texas standards [noise]\nYeah I Would say just the bones of caution um you know the Gulf of Mexico being what it is very shallow body of water you get a big storm like Michael you know in in the Gulf and the eastern Gulf\nAnd er during high tide you tend to get a lot of sort of nuisance flooding I Believe some parts of the boulevard slower but maybe a foot of water yesterday some roads may have been closed they're also saw some reports of some a water into some garages there and some houses I Believe that in\nJamaica beach there on the west side of Houston so um but that's about that's ... that's pretty much confined to high title\nRicher Murphy does keeping an eye on things as climate program manager National Weather service Fort Worth Victor thanks so much for spending a few minutes with us from the Texas standards take you to it [noise]\nThere's so many unknowns about the fate of children separated from their families at the border\nBut a recent investigation by the Associated Press discover loopholes that could lead to situations in which deported parents could lose their kids to adoption in the U.S for more on that we're joined by one of the reporters on the story grants Burt welcome to the Texas standards\nThanks for having me your story opens with the saga of a mother daughter pair from El Salvador Harris Ellie and Alexa where is your story begin [noise]\nSo they began back in November\nTwo thousand and says team when they made the arduous journey from El Salvador or to the U.S Mexico border um are ... mother was hoping to claim asylum\nTo build a new life for herself and her toddler but then things went wrong when they were separated by U.S officials she says and the mother was deported back to El Salvador but her two year old was placed in the U.S federal foster care system and so\nAlexa that little girl ended up in suburban Grand Rapids Michigan I'm In a long term foster care home\nAnd now now one of the players in this case is as an organization called Bethany Christian services who are they and how did they factor into all of this\nSemester Christian services is when the foster agencies\nThat um does work for the office of refugee resettlement the federal government right I'm placing migrant children with foster parents when I'm you know that the government teams that's the best option for them\nSo she was placed with a family was she in fact adopted by the family know she was\nStopped it but that's foster family based on their experiences with elects I became concerned that she had been abused prior to getting to their um and um we're worried that she would be abused if she were reunited with her mother and so they went ahead and tried to\nGain a full guardianship of relax at in Michigan State court now I'm the federal government ultimately weighed in on that case and said that they had violated\nFederal law in doing so because elects I Would never open for\nAny kinds of guardianship her custody proceedings\nNow but still you can see how these sorts of situations might become long\nTerm if not permanent separations has that sort of thing happened in which children have been in fact adopted away from their birth parents\nWere one of the things we wanted to do with the story is pointing out\nThese holes in the system that essentially allows state court judges to grant custody of migrant children to American families sometimes without notifying their parents um so basically that the children who were under the care\nOf the office of refugee resettlement or part of this slide piecemeal system where they could end up ultimately being\nAdopted by us families um sometimes that is the wish of the children and sometimes that is because\nThey have asked to be adopted by their foster parents or they were trafficking victims for instance um but through talking with Bethany uh we did learn that nine of the five hundred migrant children that particular agency has had\nAssigned to foster program have been adopted by American families since around ...\nThis is hard though not to to talk about this and talk about the recent wave of family separations on the border that obviously made national indeed international headlines what happened after those separations did we see an uptick in the numbers of these kinds of cases or is it too soon to know exactly\nHow they have been or will be resolved\nWell it's important to know that none of this happens overnight\nUm kids don't end up in long term foster care into um the government has had trouble finding\nA sponsor for them to be released you or in the case of the zero tolerance separation some kids are ending up in long term foster care because the government has decided they're not eligible to be reunified with their parents but um you know I think one of the other things we wanted to point out is that\nExperts told there's the risk is really growing for these kinds\nOf hearings to come before state court judges who just may not\nBe entirely up to speed on\nHow federal custody of migrant children work so it's you know essentially something to watch over time as we learn more about the infants and children and teens who were taken from their families at the border under zero tolerance earlier this year and who remain in the United states\nTo remarkable story told by grants Burke a reporter for the Associated Press thanks so much for sharing some time with this on the Texas standards thank you\n[noise] Wilson\nBar social media editor here at the standard would of Texans talking about David\nClearing conditions across swabs the taxes but folks are still talking about the weather after heavy rains saturated much of the Lone Star state on our Facebook page of bread him and says rains are stressful for renters because they have to constantly monitor fence lines and act as soon as possible one ones animals in\nMy folks owner read out between often in San Angelo that's flooded three times in the past two months\nMeanwhile Carla herring and boys been uses Corpus Christi is hot and muggy with rip currents high tides and be just closed to traffic\nMeanwhile Claudia Claudia Javier ... calls it a nice cool morning but she says the rains and flooding did cause some damage to her city in ... so a real range of reactions out there and lots of folks as well David monitoring hurricane Michael on social media saying a lot of chatter about that obviously\nHas seen a lot of pictures as well scary stuff or we're going to keep you posted you want to keep the right here for the very latest on what's going on with hurricane Michael and the rest of the day's news let us hear from you at Texas standard well ... back in thirty five [noise]\nSupport for I'd have to stand it comes from the Texas tuition promise sun and the Texas College savings plans to administer by the state of Texas offering a pair of plastic and how families saved ... college dreams more safe now for college dot org\nBanks are spending some time with Austin ... NPR station K U T Ninety point five five\nThis week on MORNING edition in the wake of bitter political battle Brett Kavanaugh is a Supreme Court justice the Supreme\nCourt as a team of nine and I will always be a seemed why are on the team of not\nHow will the new court handle some of the country's most divisive issues listening to MORNING EDITION every weekday from NPR News\nStarted today with MORNING EDITION tomorrow beginning at five AM right here on K U T Ninety point five support comes from seminary of the south last puffing a master's degree in counseling with evening and weekend classes for working professional open houses on October\nEighteenth and November fifteenth more information and registration as W. dot edu support comes from the rate of home to the trivia show featuring\nHouses by Austin's custom home builders workshops and industry tips October Nineteen through November fourth tickets and details at parade of homes Austin dot com\nIt's protection standard I'm David Brown yet another Texas school district has announced it's dealing with an extreme money crisis including possible layoffs Houston Chronicle reporting the Crosby independent school district northeast of Houston voted Monday to declaring official financial emergency they need to cut at least five point five million dollars to stay afloat\nThis is the sixteenth Texas school district to declare financial emergency since twenty twelve\nAnd it allows the district to begin implementing mid year layoffs to so far superintendent Scott Davis hasn't said how many people could potentially lose their jobs but the chronicle reports\nThat among those who could or teachers across all grade levels special education specialist librarians and the director of transportation among others more on the money gap in Texas education and just a few minutes you're on the Texas standards\nSupport for coverage of business on Texas ... Texas mutual insurance company a worker's comp provider ensuring compassionate care for injuries of every size at businesses big and small learn more at work safe to access dot com\nTAs also asking the state legislature for more than fifty million dollars to improve school safety primarily through increased access to trauma informed counseling which Texas City is home to say the best barbeque or breakfast tacos has launched many fight over social media\nBut while it took a stab at raking the best overall foodie cities in the United states and of course a bunch from the Lone Star state made the cut\nJill ... is with a personal finance site so we looked at not only did the city that keep her foodie scenes\nOver all that we looked at a variety of things including affordability and then diversity accessibility and quality of food\nOkay so freeze yourselves based on their criteria three Texas cities made the top twenty five Austin rank the highest among Texas cities that tent that followed by Houston at Eighteen in San Antonio at twenty first Gonzales points out that it's especially affordable to be a foodie and the Alamo city\nThe average restaurant meal costs us is just for one and three course meal and around thirty five dollars that was there it cheap at any country Houston is fifty four dollars often like sixty dollars so huge playing just within the state\nBecause all those ads that twenty Fifteen marks the first time Americans that more money on eating out than on groceries that we get news from across the state I'm Becky Vogel for the Texas\nStandard support for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more at the Texas ... or eight hundred five to about\nThirty three minutes past she our Texas standard time I'm David Brown over the Texas Tribune Ross Ramsey has been doing a deep dive on public education funding in Texas in discovering something a lot of Texans might've missed\nThese days more than half of the money to pay for public education is coming directly from local property tax payers as the state spends less on schools\nBill ... you're a in North Texas reports this has led to an increase in what are called T. R. E. tax ratification elections that school district scrambled to bridge widening gap\nAs the Texas population keeps growing the state is prospering that combination used to help school district financially but not so much anymore says joy Baskin she's legal services director of the Texas Association of school boards\nOver the last several years they share of funding that dedicated to public education has decreased and the reliance on local property tax they has increased\nSchool funds come from both the state and from local property taxes they've been rising yep those extra property tax dollars aren't staying in districts according to wane peers he runs the children's advocacy project in Austin secretary center that's a school finance organization\nThe state has not increased the basic a lot in the last four years that's the foundation part of school funding state stagnant values go up taxpayer know that so whenever the ... elections increase all that means is that state funding decreases equivalent leave school district don't have any more money\nThat leaves districts like Dallas scrambling for cash superintendent Michaeline a host ... says the tea or read the trust these are putting before voters this November will fund pricey but proven programs like early childhood education\nChoice schools like recently open single sex science and technology campuses which also says have help attract families back to the district\nCosts more millions he told the recent Dallas regional chamber lunch crowd there's more\nOr can we do the kind of initiative that causes the million dollars a year [noise] years were road just lost\nYou know hostess says the AIDS program for accelerating campus excellence which has put more millions into struggling schools has improved every sailing campus where it's been used but he says it's so expensive he's had to cut part of the program\nHe laid out plans for attacks ratification election in November that would at a hundred twenty six million dollars to the budget because he figures he'll get no funding help from lawmakers\nHow's that worked out for me more\nDallas is not alone this November Richardson and 'frisco are also calling GREs in Dallas that would cost the median price homeowners two hundred and forty dollars a year in Richardson the annual hike would cost an average homeowner three hundred and five dollars\n'frisco design it's T. R. E. so taxes will not go up if voters approve at\nThe rate would actually drop GREs are increasingly popular since two thousand six more than five hundred Texas districts have called them with dozens of proved in North Texas not all past two years ago 'frisco voters rejected one so 'frisco biased used trying again last month\nCedar hill voters said no to a T Ari joy Baskin again with the Texas Association of school boards\nSays when TR resale voters probably didn't want to raise their own taxes\nYou know voting in their own self interest not to pay more in taxes in part because they've not been persuaded that the community will receive adequate value for the increase in taxation\nBaskin has also seen tax ratification elections fail from voter fatigue\nThere are numerous taxing and he's in any given location and that that'll district and the water district and everybody else has added money over the recent time that voters may just be disinclined to re ...\nFive years ago Plano voters approved a T Ari but now superintendent Sarah ... says she needs more money for new challenges not expecting any from the state she may have to cut some programs Garland die as the hasn't called the tea Ari but superintendent Ricardo Lopez says he needs more dollars just to stay competitive when\nWe look at the amount of money that they just putting into each and every child could talk about we gotta remember we have more kids in the system than we did ten years ago we have over five million and that is only going up and we need to have the funds and the vision support those upper\nDistricts in North Texas say they have the vision to improve education for their students they just lack the resources\nFrom ... north Texas [noise] I'm Bill Zeeble for the Texas standards [noise]\n\nYesterday was deadline and Texas and drove other states for folks registering to vote in the twenty eight to mid term secretary of state's office says one day earlier we hit a new voter registration record\nWas the Tuesday surges factored in final numbers expected to be well beyond the Fifteen point two million Texans registered to vote in the march primaries back there thinking it might get up to Fifteen point seven million wait and see\nThe new site we report some confusion out there is some newly registered voters still can't find their names and the Texas on line voter database some students have prairie view a and M. university outside Houston worried their applications might have been rejected not so officials say just taking time to\nAll the paperwork they promised that everything we processed in time for the main event on November six\n[noise] support for Texas that it comes down to Texas oncology whether reminder that October as breast cancer awareness month to eight early detection all women over the age of forty should undergo routine screening like yearly mammogram more at Texas oncology dot com\nYou're tuned into Austin's NPR station K U T Ninety point five\nOr ten term central markets ... celebration Italian wine toxic your knee cheat on them oil and more\n... Seventeen through thirty detail that central market dot com\nSupport comes from the rate of home to the trivia so between houses by Austin custom home builders workshops and industry tips October Nineteen through November fourth tickets in details of homes honest and dodge [noise]\n[noise]\nThis is the Texas standards David Brown we don't often think of this time of year is cap and gown season then again what we're about to explore isn't your typical graduation though it may be the most important complication of many lives here\nBear county ... county is folks say is designed a program for people with felony convictions related to substance use disorders in Texas Public radio spotted petri met some of its newest graduate\nThey marched down the aisle to pomp and circumstance beaming with pride they weren't tennis school but in the central jury room at the courthouse downtown the thirty two people ranging in age from Twenty one Seventy\nTrees are graduating compare county founder of course\nAttorney Glenn led the ceremony\nThe right to vote\nLeave their really work hard\nClinton loves being a drug court judge he says it's extremely fulfilling to work so closely with people who in many cases have unsuccessfully sought addiction for most of their lives and the students in this class alone have a combined total of two hundred and Eighteen arrest to bear county that Clinton says this is a good alternative for non violent addict\nAs far as actually barter probation and\nUm maybe locked up [noise] or going through a long hair in three different though it is they're just coming out in back into the community rejected or does or a lot of of a program in which case manager probation officer treatment providers and just\nJohn Arthur Martinez and more benefiting use music education organizations\nDetails at marvel falls dot org slash M. F. M. F. that's marble falls dot org slash\nM. F. M. S. [noise]\nThis is key you T Ninety point five community supported public radio it's nine fifty one\nInflation appears under control marketplace morning report is supported by dared providing global financial resources and market expertise to clients the world over our W. dot com has more information\nThan by constant contact automatically delivery males or a series of emails campaigns to your customers with constant contact new automation feature learn more in constant contact dot com\nThe New York I'm Rebecca shore in for David Brancaccio investors are not thrilled that the fed is probably going to keep increasing rates because that makes borrowing and the economy more expensive and could curb economic growth\nBut the fed isn't raising rates for fun it's trying to keep inflation under control well after yesterday's sell off we got new inflation numbers this morning and they were lower than expected so what does the fed do now marketplaces Nancy Marshall guns or reports\nThe consumer price index or CPI was up just a tenth of a percent last month the CPI tells us what prices consumers are paying it was lower than economists like Alan ... if you'd be as expected that my sister says the CPI was down\nAnd largely due to a three percent drop and used car\nPrices but ... says month to month numbers like this are volatile long term he says today's CPI numbers show inflation troubling along at roughly the Fed's target of ... percent that my ... says that's because unemployment is very low this\nTends to cause a increases in demand increases in wages which leads to more demand for goods\nPushing up the price of those good now the fed does pay attention to the CPI but this is just data from one month and the fed plays favorites when it comes to inflation gauges it loves another index which measures what businesses are selling and that won't be out until later this month in Washington I'm\nNancy Marshall insert for marketplace\nLet's take a look at the numbers [noise] the Dow Jones industrial average is down a hundred and sixty point that a victim of a percent of the other than the five hundred is down two tenths of a percent the ... or ... or ... percent of\nThe ten year treasury old is it three point one eight percent hurricane Michael is now a tropical storm ended his makeover South Carolina and moving into North Carolina areas which are still not done recovering from September Hurricane Florence marketplaces Andy ... in Jacksonville North Carolina\nHi Andy hey slippery so what are you seeing right now\nWhat I'm seeing around here lots\nOf fallen trees lots of ... still on roofs and lots of people I've spoken with are clearing to brief from Florence ... and having to put renovations and repairs on hold right now as they expect another four to six inches of rain from tropical storm Michael\nYou were down there coincidentally to take a look at rebuilding efforts after Hurricane Florence from last month of both Congress in North Carolina's legislature responded pretty quickly voted funds to the state for that how's that going\nYeah these municipal and community folks are tasked with dealing with a lot of money right a lot of money is going to be coming into these communities the tendency is to spend money on rebuilding right back where the damage occurred originally and not really develop a plan for these things in the future\nI spoke with Kevin Smith the University of North Carolina he's director of the coastal resilience Center for excellence up there\nHe doesn't think we can simply think about a hundred or even five hundred year flood anymore\nWell in an era of climate change in weather storms and more intense rainfall we ought to be thinking bigger we ought to be thinking about um regulating and incentivizing and purchasing a an relocating properties in the hundreds of what planned but perhaps areas outside the hundred year flood point\nHe says incorporating mitigation into the way we rebuild in the long run it's going to save taxpayer money and it could still promote gross or in the region\nMarketplaces and dealer in Jacksonville North Carolina [noise]\n... thanks very\nMarketplace morning report is supported by for X. dot com for X. dot com is committed to empowering and helping traders seize opportunities in the foreign exchange markets learn more foreign dot com\nFor X. dot com it's your World Trade it for its trading involve significant risk of la ... exact science is offering ... over fifty color guard as a non invasive colon cancer screening test that can be used at home and they although my prescription only information at ... and buy you might have\nProvided organizations robotic process automation you might path is dedicated to making work inspiring by free workers from tedious task Moran you wipe half dot com slash marketplace\nMore than ten million people ages Fifteen older are at risk of going hungry in the United states that's with a A R P estimate that's bad enough but in Florida that problem is made worse by a lack of public transportation it's hard to get to grocery stores let alone food banks\nSo some organizations that provide food are now holding events\nIn neighborhoods where seniors live Daniel Danielle prior with the marketplace Hubbard W. M. F. E. in Orlando has that story\nDon Roddenberry is in her sixties\nToday she is locked the block from our house sitter cart to the church of God invest slow it provides free food to seniors she carefully choose it her food for the week she's in coming to these events since they started in twenty Fifteen back then the organization only held three here now it's up to\nAnd the more you know more you get to know and the people here they outlawed people's cars\nHave to live that tore it then Ruthie leave who runs the program the community has grown up around these events that because they provide more than twenty thousand pounds of food to seven hundred people while encouraging them to take care of themselves poor as his notice that\nWe see them and I wouldn't make up you see because they see Ruth make them but I have to say that my makeup\nUniversity of central Florida as Amy Donnelly says relationships between local service providers and seniors\nAre crucial how many seniors do we not know about because they aren't socializing with others are not connected um in the community or with their neighbors\nDonnelly surveyed more than a hundred and Ninety ... over the phone she found one third of seniors in this state don't have family nearby and half are not sure where they could get help is needed Dave crap they'll have second harvest food bank of central Florida\nSays communities need to do more to find these seniors\nSo many times you know neighbors aren't talking to neighbors and in the ideal world would be great just to start from the boardwalk level for people to to realize who's next door down the block the needs help\nThe national nonprofit Feeding America anticipate the number of seniors who rely on food assistance will increase by fifty percent\nAnd in twenty twenty five in Orlando I'm Danielle prior for marketing\nAnd in New York I'm ... or with the marketplace morning\n... pm American public media support comes from duty Center for professional at offering the project management certificate program on line or on campus online in\nPhysician Tuesday October sixteenth registration and program details had professional ed Dunn you Texas dot edu\nThis is Austin's NPR station K. U. T. N. K. U. T. H. D. one Austin and we're on line at K. U. T. dot org I'm Jennifer stating that if you're\nA Thursday it's going well so far things for spending part of your day with us here on K. U. T. expect partly to mostly sunny skies today and a high near Seventy six degrees sixty four in Maine are\nComing up the cactus cafe tonight it's a classical cactus night\nWith the U.S in classical guitar society Joseph Palmer and the nice Mariano duo will perform doors at seven thirty show at\nEight details in tickets at a cactus cafe dot org that's cactus cafe dot org\n[noise] made a national for accountability and after years of silence Texas clergy now say they will name names of priests accused child sex abuse the story today on this than [noise]\n\nThan production Katie often [noise] K. A. R. A. north Houston Public media at Texas Public radio and ...\nWith support from around software to liberate Estrada next\nRound the announcement from the Fifteen diocese in Texas seen as an attempt to rebuild trust with estates eight point five million Catholics but questions linger over the process with their justice can be served also the Florida Panhandle assesses damage in the wake of hurricane Michael s Texas researchers explore the long term implications of what many regard as the worst industrial\nCatastrophes ever to hit the Gulf bust surprise findings in a survey on political polarization all that and more day on the Texas then [noise]\nThey that they can't participate any longer because this feels like it's still not resolved and they don't want to support an institution that that hasn't had a full reckoning with the sex abuse um well\nNo no let me ask about the nature of this investigation because it seems like this is being done internally by the Catholic Church but if we're talking about sexual abuse where is the Texas attorney general here we are or the prosecutors are where does this go from here\nYeah this gets complicated I think certainly ... depending on the allegation on the story ah that that they're investigating the statute of limitations may have expired\nSome survivors groups are saying we want attorneys general in every state should be doing their own investigation of the church but for these really old cases a lotta times difference just don't see that kind of justice served\nEileen when below has reported on religion and she's currently a lecturer at the University of Texas school of journalism professor thanks so much for being with us from Texas well thank you so much for having me it was a pleasure [noise]\n\nWhen it would be on the Texas Senate race which incumbent Ted Cruz up by nine points are better and more rather page breaking down the numbers by race\nHave shown support among black voters at Ninety seven percent for the Democratic congressman O'Rourke to UT Austin is actually Lopez reports on what might be behind that remarkable number\nThere's this video of Beto O'Rourke that Ted Cruz tweeted not too long ago it shows over ... standing in front of a crowd of African Americans in a church in Dallas the crowd was on their feet cheering as a rock talked about what happened and blow them John a black man who had been fatally shot in his own home by white Dallas police officer [laughter]\nWell over ... condemned the shooting and Senate pointed to a larger problem that faces black people in America Cruz has said he's weary of jumping to conclusions about what happened in his suite sharing the video cruise wrote in federal marks own words as if ... made this huge misstep\nBut if you talk to black voters this wasn't a misstep it was a breath of fresh air I think that he's speaking to issues then hit at the core of issues that are facing blind people at the trees ... she's the executive director and founder of the ... center which works of people who had been incarcerated\nShe's not surprised at all to hear that our work is doing very well among black voters took says O'Rourke is talking about police violence and race which are the kinds of things politicians typically tread carefully around people are afraid\nTo talk about what's going on right now people are a little bit more cautious about people's feelings are there in especially when it comes to this because it is so much attention right now\nLike the debate over professional football players kneeling during the national anthem in protest of police violence when\nAsked about this issue during a campaign event oh rocks at this\nAnd I can think of nothing more American than [noise]\nWhen he said that I was like yes although yeah like I jumped out of I guess\nThat's grant level if he's a student and black activist in Austin he's actually appreciates that'll work has acknowledged that life is a harder for black people in America than it is for privileged white Americans\nBecause they have to jump hurdles to go in trenches water just to get where we want to whereas other people would you have to walk along and say oh well my dad's the c._e._o. I got the job\nAnd that's when institutional power does come in\nIn fact during his debate with Ted Cruz federal rock was asked about a D. W. I. arrest when he was young all rock said he made a mistake and was grateful to have been afforded a second chance in life\nWhat I Do know is that as a white man in this country there is a privilege that I enjoy the African American men and women do not\nLive trees Cooke thinks the way ... is talking about these issues is resonating with black voters like her she says she thinks ... knows he's probably upsetting some white voters but she's glad he's taking that risk\nI think that one of the things that we failed to do just as a society is talk about it and talk about things in real time and talk about it in a way that is not edited or where you're using cautionary language\nBut Gabrielle ... with Austin justice coalition which works on issues of racial justice says it would be a bigger deal if ... didn't talk about this she says it's twenty Eighteen and race is that the core of political divisions I think it would have\nBeen a huge misstep and just the huge let down if this hadn't been part of the narrative at all\nFor chard says as a black woman she agrees that O'Rourke is saying all the right things but she also wants to see details and a plan to address these issues and he said people need to also hold Iraq accountable if he doesn't do or say the right thing there's kind of this whole\nThat's how will say that everything but we also have to hold these people accountable says they say something that you're not quite on board with making sure you call them out\nBut so far the campaign hasn't gotten pushback from black voters instead pose you're only showing increasing support for mark\nPacked Yung professor with Austin community college and a longtime democratic strategist says it is not surprising black voters are supporting over in large numbers he says there are the backbone of the Democratic party in fact he thinks he's more surprised that the party has a whole isn't reaching out to black voters as consistently as are\nThe problem is is a lot of the leadership around him and other parts of the state are still a part of this we're going home to swing ... well when fifty to sixty percent of the voters vote brand\nWhich is straight ticket voting your first job is to find those people and be sure they're motivated on your side\nBut you're right campaign says this is an important part of his effort to make sure communities feel heard and understood the campaign is purposely not shying away from these issues because they believe it's what people care about in Austin and actually in the past and attacks to standard\n[noise] [noise]\nHe's back social media editor wells Dunbar Hi David sticking with a better ... Ted Cruz race a moment longer as you noted earlier a new poll out today from can Quinnipiac\nShows incumbent Republican cruise up by nine points every democratic challenger O'Rourke among likely voters here's what's imprisoned listeners are saying about that on Facebook Helen trash says I saw a poll where they called Thirteen thousand people recently and they barely reached two hundred to get their opinion\nShe says pulling in this age is worthless I think she may be referring to that real or time or not they weren't they learned about there but they are and they also said it wasn't science yeah [laughter]\n... notes that these types of polls showed Hillary winning by a landslide get out and vote don't let any findings discourage you well here's another political story getting shared on social media a Texan running for the house of representatives as a campaign field director was arrested while delivering a letter to the county judge\nAfter identifying himself as a Democrat more on this\nStory out of the prairie view area and later on the show very interesting we've been hearing a lot of interesting stories out of rough prairie view also in that Quinnipiac University poll our Governor Greg Abbott has a lead over a loop Valdez fifty eight to thirty eight percent let us know what you think we should Texas standards\nSeveral attacked the static can send the Texas tuition promise sun and the Texas College savings plans administered by the state of offering a pair of plants that can help families ... college trains more faith now for college Donald [noise]\nGreat to have you with us this morning this K U T Ninety point five support comes from the twenty thirty annual Texas ... October twenty seven twenty eight in and around the state capital with three hundred authors children's activities book signings local food and more information at Texas book festival dot org\nThe mid term elections or I mean right up and thanks to books like you the gay you T vehicle donation program is doing its part to help pay for the news and information you need to make up your mind about who to vote for November donated car tracker bumped to us we turn it into ... to UT election coverage for\nEveryone and I'm ... tax deduction for you will even come pick it up for free and get the details right now by calling eight seven seven ... we're going to the ... section of K. U. T. dot ORG\nSupport comes from the border tax presenting Salvador Dali naked feast a performance installation cocktail party with food music body painting and are everywhere one night only October ... into it more tax rat dot org the time is ten twenty\nHappy Thursday to you and yours you got attuned to the Texas standard Exxon Mobil is putting one million dollars toward a plan to create a U.S carbon tax to reduce greenhouse gas emissions the news is getting the Texas based oil giant some thumbs up from environmentalists but it's K. U. T. Austin is most boo shell tells us\nThe plant Exxon Mobil supports is not without benefits to the company itself\nUnder the plan companies pay a tax on C. O. two they put into the atmosphere that money then goes into a fund that compensates consumers to defray the higher cost of fossil fuels brought by the tax the whole thing we've Scott Edwards co director of the environmental group food and water justice with a question\nIf it cost me twenty dollars more a week to put gas in my tank and I'm getting a check at the end of the month for a hundred bucks then then why not just keep putting gas in my tank\nIn fact some environmentalists worry the system would increase reliance on fossil fuels as consumers get used to receiving those carbon dividend checks are the reasons they don't like the plan\nThe shooting at Santa Fe high school prompted Governor Greg Abbott and state lawmakers to examine some ways to improve school safety leading up to the twenty Nineteen legislative session and environmental group is preparing to fight the Trump Administration over a plan to have dozens of laws to close gaps in the border wall in Texas Texas Public radio is Bonnie petri has more the department\nOf homeland security has announced plans to install eleven gates any existing border wall in Cameron County to close gaps their day just secretary ... says the gaps make the area a magnet for illegal cross border activity\nSo she's like more than two dozen laws under the endangered species and clean water act helped loop the projects along but Lincoln short all at the center for biological diversity says shoring up the wall won't stop illegal immigration\nBut as ineffective at the wall are stopping people they have very real devastating impact on wildlife\nHis group sued the Trump Administration twice to stop new border wall construction and says it is willing to do it again in these cases in San Antonio and Bonnie petri\nDallas made history Wednesday as the first city in Texas to get state recognition for its algae ... neighborhood\nLast night the Texas historical commission unveiled an official marker in front of Jay ours bar and grill in Oakland ... is president of the Dallas way a group that works to preserve the city's el ... history and which requested the designation\n... we started out talking about that down is not known for being with Akeley progressive and yet it has become one of the key places in the United states that actually is well I mean and had a neighborhood\nFor gays lesbians transgendered bisexual unclear\nThere are more than sixteen thousand state historical markers in Texas that will get news from across the state I'm Becky ... for the access standard\nThree minutes bashing Howard Texas standard time I'm David Brown great have you with us every fall the big tech players were talking apple Microsoft Sam song and well you know the rest of the gang they all come out releasing new phones in gadgets hoping you'll send some holiday gift buying dollars their way or more likely perhaps be unable to resist buying a new toy for yourself\nWith Google's hardware announcements this week I suppose you could say the fall unveiling season is almost a rap so what are we looking at here\nThis year the big news isn't just a better camera or a bigger screen it's\nPrice tech expert Omar guy August says buyers are due for a bit of sticker shock or last say they're Omar David let's begin with watch\nActually knew this fall Google's got a new ... pixel three phone which I guess was the worst kept secret in tech right\nNow we're we're getting to a point where there's really no surprises that these big tech conferences ... everything leaks everything comes out beforehand\nBut what what's interesting about Google's new phones of pixel three and the pixel three exiled a larger one is just price increases and it was seen as across the board with apple with a Samson or Google Now just you would think these gadgets would get cheaper over time and they are actually getting more expensive especially in the smartphone area\nWhy do you think that is is it just they realize we're addicted because as you I mean you're right I mean the the the standard law of technology is smaller cheaper faster and cheaper and not so much\nYeah I mean we talked about this when the iPhone or the new iPhones came out is that a lot of it it's at the the the wireless carrier subsidies are going away so much more people are buying the phone outright right and when you do that you know if you give me a lot for that phone app but\nAlso a lot of it especially with apple and Google in Tampa is that they can you know people are willing now to spend more than a thousand dollars for a top of the line new flagship\nWell you know they can but not without getting sometimes a black guy I mean you remember when apple released its one thousand dollar phone the iPhone ... yeah and so I I mean it seems like a despite all that negative press as sort of doubled down on that this\nYear yeah there was a lot of ... probably for me because when I came out about a thousand dollar phone uh but people still bought it that's the thing is that apple can continue to get away with this and ... and people will still buy them\nAnd what apple doing now with people there's kind of a two things one is that some people are keeping their phones a lot longer you still have people walking around with iPhone five and iPhone sixes and then there's people like me who need to buy the new one every year or are run an upgrade plans so you have that split in the market\nOr an apple is trying to find ways to set make more money from each bone rather than selling more phones\nYou know I I get that when it comes to the high end their appreciable difference is but if you're not talking about the high end and you know you're not talking about that thousand dollar latest thing from from apple for example a ... he's a really an appreciable difference between some of the like the H. T. C. phones or some of these other\nBrands are generally that the improvements that we're seeing like like with these new Google phones is generally going to be with the camera they're going to take you know have new camera features or they might have more memory if you're you know you're getting cramped in space on your phone you know that's a good reason to upgrade\nBut generally know we've kind of plot to it on the big blockbuster features so now a lot of it is very kind of minor incremental changes like\nYou know say you you might have an older person that doesn't do wireless charging or you might have found that doesn't have to camera lenses on the back of these are kind of the changes that were seen 'em but you know they're\nAll also offering you know last year's model or like a cheaper version like apple with the IPhone X art which is going to be like a cheaper version of these new ...\nWell yeah maybe that's a a an option if you were a don't want to uh spring for the for the expensive versions a Microsoft came out with a bunch of surface devices and I think that's surprised a lot of folks it almost seemed like they had ever given up on the surface but no\nI Know Microsoft still sounds very well especially with apple kind of lagging behind a little on its laptops and and you know it hasn't really given a lot of love to it's hard to it's computer line and the way it does with this phone and tablets\nBut or the other thing is I'm Microsoft is also kind of charging a lot of money for some of these devices they have a studio to computer a desktop computer they came out with that starts at thirty five hundred dollars winds up to forty eight hundred dollars that sounds like apple pricing yeah and when when you read the reviews it's like this is an amazing you know any designer would love to have this computer but you can't afford it\nBut you can't afford it right so ah I Do consumers need to spend all this kind of money I mean are they are not a reasonably priced alternatives out there\nNo absolutely not I mean there are they big resale market I mean there are sites like dissolve itself you know they use phones and the use tablets and computers [noise] ah it's been really the strategy is to by last year's model that's really you know to get the most bang for your buck you're going to want to not by the the latest and greatest but maybe last year's version that is almost as good but maybe half the cost we're\nAlmost at a time but I have to ask you about another gadget that's getting a lot of attention this week Facebook Portal\nYeah everybody's trying to get into this market that Amazon has sort of pioneered with Alexa and with their Amazon Echo show which is sort of like Alexa but with the screen\nSo now Facebook has this message or chatting device that sits on your on your counter that that has a screen a Google Home hub is the kind of the same thing but without the camera so really they are trying to do this kind of voice command thing but visually where you actually have a spring\nTo back it up yeah some people are a little freaked out by that screen but you know do you want to Facebook camera in your house I don't know there's that question you can find tech expert Omar guy guy at tech minute Texas dot com or get to see again we'll talk to you again next week thanks for having me David coming up on thirty nine ...\nSupport for Texas static kept him TCU horn frogs strive to be the leaders\nOur students to save the world turned ...\nMore ... lead on dot TCU dot edu TCU me\nTen thirty nine at all since NPR station K U T Ninety point five reminding you to watch out for a new accidents southbound mo packets between forty fifth and thirty fifth street exits\nSupport and trying to play that goes wrong the classic mystery with a twist murder ... hats and mad cat maniac timber twenty to twenty eight part is Lexis Bradley and often presented by Texas performing arts tickets at Broadway in Austin dot com\nK. U. T. ball membership Dr officially starts in less than two weeks but you don't have to wait to support the news and information programming you count on go to K. U. T. dot org right now when contributed to a ten dollar a month or more level\nAnd we'll say thanks with a K. U. T. public radio nerd T shirt and two of our cool new plastic pipe glasses donate today K. U. T. dot org\nSupport comes from H E solar local ... Panasonic eternity solar panels for about high efficiency solar panels and how to request a local estimate from the Hofmann brothers by Googling ha solar or at H. E. solar L. L. C. dot com\nHey it's Texas standard I'm David Brown you might be familiar with the named Charlie done is the title of a jury Jeff Walker\nSo I mean if you're listening to the lyrics she'll know Charlie was a famous ... maker in Austin He died in the early nineties but his boot making\nLegacy lives on the subject of today's episode appeal to toe with which Texans tell us about their relationship with their boots\nSo cowboys care about their horse and their hat and their cowboy boots that's where we come in [noise]\nMy name is Lee Miller I make cowboy boots in Austin, Texas harsh office called Texas traditions and that was the original name from when it first opened in Nineteen Seventy seven and I was one of the young apprentices for Charlie done the job done\n", "show_name": "Texas Standard", "year": "2018", "city": "Austin", "day": "11"}