{"month": "10", "state": "TX", "station": "KUT", "content": "That capacity gets put the test and bodyguard a new BBC series treated by jihad mercurial who's known for his compelling shows about the dark side of public institutions\nUnfolding over six episodes buddy guard is decidedly not a remake of that old Kevin Costner Whitney Houston movie and you will reconvene to hear someone built out and I will always love you too\nThis is a high powered state of the art thriller about terrorism political chicanery and the perils of acting in good faith this year we stars Richard met the handsome Scottish actor best known as Rob started one game of Thrones\nIs actually far better here playing surgeon David bud and Afghanistan war vet with T TST in a broken marriage who now works for the London Police as a bodyguard from visiting dignitaries when we first meet this tightly wound lunar he's just learn to terrorists plans to bomb the tree and he's writing\nTense twenty minute opening denounces the show's intention to keep us permanently on the edge of our seats\nSo ching but handled the situation so definitely but his boss gives you ... it looks like a plum assignment he sent you protect Julie monitored you played by ... cause the home secretary in the conservative government who beneath her good looks\nBecause this is the spine of the purists after I'd steal the ruthless Julie intends to supplement your party's prime minister by whipping up fear of Islamic terrorism\nIt's an approach the bodyguard despises here to talk after she's done a TV interview pushing national security and defending the wars in Iraq and Afghanistan\nTo do that until they did you mean what you said\nI don't and you say what people want to hear\nDoing the right thing making the hard choices\nIs saying is David ... I didn't need you said that for me and he said was happening\nWhat's required who's extremely tricky because someone really is trying to kill Julia monitored you\nBut who could it be Islamic militants renegade elements of the security apparatus her conservative party enemies before you even settled into the job search your buddies dodging assassins bullets being ordered to spy on the woman whose protecting and discovering he finds the home secretary\nKind of well hot when\nBodyguard aired in the u._k. a couple of months ago and became a national obsession not only does it show offer more shocking twist than a tank full of electric eels but she really is in many ways the meals version of homelands charismatic carry Matheson\nA devoted but psychologically freeing officer who susceptible to the ... and manipulations of those you should know better than to get entangled with\nHe must find his way through a minefield of unreliable characters is ex soldier power who's hell bent on vengeance the head of the London Police forces anti terrorist squad who's at war with him I five\nAnd the conservative party is nasty chief whip\nWell all of his makes the series gripping it doesn't make a serious\nLike homeland scandal house of cards in their spiritual godfather twenty four buddy guard taps into big issues like terrorism and government snooping but only to keep us guessing more concerned with being a good ride than exploring character politics the show was awash in a timely cynicism\nThe paranoid stewards of the sixties and seventies seventies in may or three days of the ... or we're all the President's Men were made for an audience that assumed a stable law abiding political system\nSuch thrillers took their sting from the cautionary suggestion that we didn't know what's really going on if the system was being threatened by conspirators wrote generals wrote spies even real presidents these days and both Britain and America countless millions on both left and right\nBelieve that the state itself has gone rogue homeless conspiracy has come to seem so normal that seventies paranoia now seems almost innocent\nWithout the barest of a stable world to keep the action angered anything becomes possible and today shows Kevin Spacey shoving a reporter in front of a train in house of cards\nA sleeper so marine murdering the vice president in his own office in homeland and so it is with bodyguard finely tuned series because the leaders in probabilities review of themselves like clockwork\nThe show doesn't seek to alert us to the dangers of terrorism and government malfeasance\nBut no we've had all the warnings we need instead buddy guard reduces the things that scare us to shamelessly white Nichols entertainment was indeed resolution don't worry it suggests it's just another thriller\nPowers writes about film and TV for vogue and vote dot com he reviewed the BBC series bodyguard which drops on Netflix Wednesday tomorrow on fresh air let's talk about voting rights and voting restrictions like gasoline\nIn a less Ari Berman author of give us the ballot has twenty four states have implemented new restrictions disproportionately affecting minorities ranging from requiring voter id to closing polling places\nAlso tell us about the seven states were efforts are being made to expand voting rights I Hope you'll join us ... shares executive producers ... technical director and engineers that'd be banned from our producer for digital media as Molly saving nesting Roberta ... directs the shell and carry around [noise]\nAnd I'm Jerry piano and you're listening to fresh air here on community supported public radio K U T Ninety point five [laughter]\n[noise]\nSupport comes from ... modern offering the holiday card which supports the American Cancer Society and provide holders with benefits it over Ninety Austin retailers available at national modern located on south Congress\nSupport comes from Capitol Hill fitness locally owned since two thousand two now the second location Capitol Hill three sixty featuring a pool and childcare ... classes available Capitol Hill three sixty and that and put village next ... [noise]\nRate NPR comes from the station and from tire Iraq offering a tire decision guy to help customers find tires that fit their car and driving conditions\nWith a network of more than seven thousand independent installers tire rock dot com is helping drivers find deliver installed [noise]\nI'm from silver featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru was Subaru learn more Subaru dot com\nSupport comes from ... dot net crafting don't make me think user experiences for every divide from simple of websites the complex custom Web native ... developments\nOn line that he I P. I. T. dot net\nSupport comes from the American Cancer Society and often everyday cancer patients struggled to find transportation\nThe American Cancer Society needs volunteers now to help drive\nPatients to their medical appointments learned more cancer dot org backslash drive\nFrom the below Center for new media at University of Texas this is K. U. T. N. K. U. T. H. D. one Austin\n[noise]\nEarly voting gets under way across the Lone Star state more Texans in ever registered but are they actually voting early big today on the Texas down [noise]\n\nThe\nProduction and often K. R. A. [laughter] radio incentive\nFor Moran soft weighed them whenever desk comics [laughter]\nI'm David round we'll check in on how early voting is going to actually begin casting ballots in the midterms plus a premiere on early voting should you plan to cast your ballot also a Texas filmmaker revisits Molly and ask\nWhat two of the most famous political restless Texans could see Josh about how to do politics\nToday and what impact because the ... affair have on Texas energy Paul ... and then some day on the Texas damn [laughter]\nIn trying to tore the ladies were pretending to be nuns dressed up as nuns and we were on there is two lines non swing stairs and I and in the corner of my I saw this one lady who was holding a\nCandle it was just a a women under ... can do that would help with mountains underneath and the ... candle drive down the stairs she was she was very very gently ... fire but he noticed that it happened and she saved the day is a\n\nFriend right here listening to Haiti\nNow have you seen this polling station in the past I mean I can recall there being rather long lines for a elections that have been far less of a I don't want to say far less contested but certainly there hasn't been nearly as much attention paid to to those previous elections\n[laughter] Oh yes absolutely I think if you come out here most selection is you'll see lines going all the way around the building on but it it is a pretty quiet morning here today but I'm sure that will pick up kind of as early voting I continue on and especially as we get closer to election\nIt's just a just a sense of the you mentioned that you're on the campus of the University of Texas\nAre we talking about is this a ... a\nPolling place that seems to cater to younger voters primarily or not so much\nWell I'd say we're seeing a pretty diverse crowd here today on the first day of early voting and I think that um you definitely see large numbers of students voting here but\nThey're also several U. T. professors and plenty of folks that work on campus in different capacities actually just spoke with Louis Waldman who is an art history professor here at UT and that you know this was a really convenient place for him to walk just across the street and cast his ballot on the very first day of early voting\nAnd we should point out that we are talking about convenience hear anyone can vote at these polling centers in Travis County in Harris County has similar a polling centers set up ... Hassan is covering this first day of balloting early voting in Texas she's a reporter at K. U. T. Austin or home station say thanks so much\nThings have been All right let's imagine you are set to cast your ballot what exactly do you need to do and what do you need\nTo have joining us now professor Sherry Greenberg clinical professor at UT Austin\nLyndon Johnson school of public affairs professor Greenberg welcome to Texas standard\nThank you happy to be here every one place that well at first things first where do people need to cast their ballot I mean do they have to be in their precinct\nIt depends where you live in the state of Texas there are some counties such as Travis County or Harris County that has voting centers that allow you to vote anywhere in your county an F ... go to your polling place for your precinct\nSo just to be clear if you are say a a resident of El Paso and you happen to be traveling to Harris County where they do have these voting centers you can't cast your ballot there at one of those voting centers that's just for residents of Harris County correct\nCorrect that is just for residents have Harris County so where do you find out where your polling places are\nYou find out what your polling places are by going to your county at the ... county clerk handled elections in your account to uh to the website is the easiest or you could also go to the secretary of state or potentially a tea or city there may be something posted on your city right now in ...\nSo is there has been quite a battle over what sort of documentation you need to prove that in fact you are who you say you are what sort of documents must you have a much to show to that person who is a\nA checking you in there at at a polling place [noise]\nYes we have a voter id law in Texas and it's very specific he must have the Texas driver's license or Texas election id certificate or Texas personal identification card or Texas handgun license\nA U.S citizen ship certificate with your photo or a U.S military ID card with your photo or a U.S passport\nOkay so those were seven documents and they're very specific about the documentation a let's say though that you're a driver's license\nDoesn't match what the registration list says you're you're addresses then what what are you what do you do if you find that there's something wrong with the way that your registration is coming up\nIf you find there is a discrepancy or something wrong then you may be able to care for it called a provisional ballot and you should ask\nA professor a lot of people have said that they haven't voted in the past because uh they didn't have time during the day to to get away from work and by the time you know four or five rolls around their huge lines or outside or many of these early voting centers so\nWhat does the law say about what employers have to do when it comes to giving people time to to devote\nA Texas law and this is the Texas election Kurt requires an employer employee with time out to vote yes during their regularly scheduled our favorite not have much time but I Would recommend that um people check with their employers\nOkay yeah absolutely and we're seeing a lot of new registering ths this year a record Fifteen point six million people in Texas registered to vote and I think that's up by more than one and a half million if I'm not mistaken over the last midterm\nWhat does that mean for early voting if anything and and what is what does that tell you\nWell certainly it tells me that there's a lot of\nEnthusiasm at least at this point as far as registering to that of course we have to see that actually means more people but not just register but come to the polls that clearly you would expect to see\nAn uptick and we have been saying I'm over time more and more people choosing to vote early because of the convenient though um\nTypically you see a a burst at the beginning and then a lot of people towards the end of early voting you know getting that last chance to vote early and sing lines that\nSure Greenberg clinical professor at UT use LBJ school of public affairs will have this up at our website Texas standard dot O. R. G. professor Greenberg thanks for your time thank you have a good day\n[noise] [noise]\nWell some of our social media editor I mentioned that you been seeing I've been seeing some pictures on social media on the lines in the Houston\nArea really interesting stuff you know one of our listeners\nNicole ... she sent us a link to an incredible video on Facebook drawing the line just before\nDoors opened in central Houston at the metropolitan multi services center just\nHundreds of people stretching out from the front door and sneaking around the entirety of the parking lot is one of those at a time lapse sped up videos and it still goes on for about a solid forty seconds it's really radical really walk up very known hours [laughter] we've retweeted her message\nThat she's into us on her own account Nicole ads that people camped out overnight you\nCan't tell me something isn't happening in taxes and shifting gears from Houston to North taxes via Twitter\nLindsey Wilson a gallon at tweeted that at eight AMD grapevine Texas early voting location opened aligns with a forty five to sixty minute wait a minute yeah grapevine a northern suburb of Dallas yeah right yeah no grey bunny yeah that's a very interesting uh also hearing from our friends and listeners\nUh who were in the thick of it right now on Facebook Jim ... lives that he's in line right now in San Antonio and there's probably about\nA hundred people in line with him\nYou know and it came in case you haven't gone to the polls yet or you're still sort of suffering all that stuff out and I should get a quick plug in here for a voter guide that we're apart we partnered with the league of women voters\nAnd are bringing our listeners a nonpartisan voter guide basically laying out who the candidates already can type in your address and get a personalized ballot with all that information and more\nYou can visit Texas decides dot org Texas decides that ... for that awesome voting that's uh that's\nThat's really useful Texas decides dot O. R. G. huge project that Texas Public radio stations are putting together and you need to take advantage of that we are [noise]\nAh gosh we're asking for you to tweet us right now so how ... going in your neck of the ... can be back in thirty five has more of the standards just to\nSupport the standard Kasim T the new horned frog strive to be leaders and level like my flattery so empowered to save the world's remaining right has more ... the the new dot edu TCU lead\nOn support comes from Louis shanks furniture whether that selection of home furnishing custom designed centers and experience designers\nWe live to help you love where you live on Anderson lane for Louis shanks furniture dot com support comes from St David foundation roundly investing in a healthy community for more information St David foundation dot org good health returns great benefits\nThe league of women voters Austin area remind listeners that election day is November ... and early voting started today the leaks free nonpartisan voter's guide is available at public libraries in Travis and William some counties ended vote for one one dot O. R. G. that's votes for one one dot O. R. G. if\nThis is a huge T Ninety point five\nSupport comes from ... in school or college preparatory high school focused on academic rigor\nAnd creativity with interactive classes and supportive school community tours every Thursday nine AM details at Griffin school dot org states\nTexas standard on David Brown for nearly six decades the Wyler aerial tram way El Paso has been the only sky tram in Texas\nIt was originally built for private business but open to the public about Twenty years or so ago and became a rather popular attraction gone to lose traveling on twenty four hundred feet of the cable hope people to the top of the Franklin mountains\nThat is until last month Texas parks and wildlife department is closed the tram weight indefinitely Natalie crabs reports engineers discovered it needs expensive upgrades and repairs and now the tram ways future\nHangs in limbo\nMustard colored ... aerial tram might sway in the way in on the keep all that means some top of the mountains\nGathered in downtown Dallas park the protesters said greyhound has the right to refuse for the ... agents from boarding pass this without a warrant\nProbable cause the campaign called transportation not deportation accuses customs and border patrol agents of violating passengers constitutional rights they asking that they prove their US citizenship\nIn a speech to the crowd Texas Democrat ... says practices happening in heavily Hispanic areas and be on border checkpoint\nGreyhound is doing something that they don't have\nThey're subject to many of their pastors\nThey're subjecting the warrantless searches\nRacial profiling\nAfter a series of speeches to groups ... several blocks to greyhound headquarters carrying boxes and sign petitions Tricia Martinez senior vice president for greyhound legal department read a statement from C. E. O. date bleach\nCBP officers do not ask\nProtests are planned in the coming weeks Stella dot is Kate uranium is a\nMexican journalist seeking asylum in the United states appears before an immigration judge in El Paso this morning\nEmilio ... case gay national attention after federal officers in West Texas\nDetained him and his son during a routine immigration check it and he was held for months before being free from detention that summer ... has been seeking asylum in the United states for about a decade after facing death threats in Mexico for reporting on government corruption that will get news from across the state I'm Becky ... for the Texas standard\nSupport for these types of standard headlines comes from the Texas secretary of state providing voters details on required identification for voting in person at the polls more at vote Texas ... or eight hundred to five to about\nThirty three minutes past year our Texas standard time I'm big brown right to have you with us on this Monday\nLast week this time a piece of news broke that would have seemed impossible a century ago see here's one of America's most dominant retailers filed for chapter eleven bankruptcy thanks to declining revenue in massive debt\nSears, Roebuck catalog once upon a time was a staple of American coffee tables there wasn't much you couldn't get from it\nIncluding something that may well survive Sears itself once very own home Michael Marks reports\nThere are certain items you expect to find in the mail order catalogue sewing machines for example watches for bath towels you don't expect to find a house but that didn't stop Richard worn Sears and Elvis robe\nCo founders zero Roebuck company\nThen is this day\nI've been sitting here a summons to hear about\nThe only reason that the earth was he knew it was a way to sell more stuff in his one hundred thousand item fourteen hundred page catalogue it actually would dotted lines within ... in the catalog and say space for Davenport space for ...\nThat serves Mary Thornton she's an expert and Sears kit houses Sears sold them from Nineteen oh eight Nineteen forty they recalled kit houses because they came with all the lumber and hardware you'd need to assemble them plus instructions on how to put it all together\nLike a giant lego set each here's catalog offered dozens of different models all the way from the ... a simple free room model for one hundred Ninety One dollars to the magnolia\n[noise] five thousand eight hundred and forty nine dollars had twenty nine hundred square feet four bedrooms two and a half bats servants quarters\nTo find out if your home is a Sears kids the best way these days is to consult one of the many websites and Facebook groups devoted to them it's unknown exactly how many kids were sold or how many are still standing there's no official list\nThe mid west has a real hotbed for them but certainly found a handful in Texas and there are surely many more that remain undiscovered so to speak\nAnd homes are like roaches if you find too you know there's another twenty hiding somewhere\nThe main benefit was price there weren't cheap per se but certainly less expensive than a pre built home and remember this is the early twentieth century if you were someone who might have trouble buying a house through conventional means a kit home was a viable alternative\nOverwhelmingly it was a lemon men and women of color and immigrants fresh country\nMiners would look at the demographics in the neighborhood if you were a certain height you are not going to get a mortgage period\nBut it didn't last the business started losing money in the thirties and indoor plumbing and electricity made home building more complicated\nBy Nineteen forty Sears was out of the kid house business but certain things that most of the Sears homes that were built are still around the reason is a cliche but it's one that applies here they just don't make them like they used to\nThe quality of building materials in Sears homes far surpasses nicer stuff even of the day and certainly the things that are built today\nThat quality is evident in wheel and petty Moore's house in Georgetown just north of Austin they live in an Avondale model built in Nineteen fourteen to green one story bungalow with a shady porch next to a big day window out front they originally bought it but the intent to flip it\nBut the house she grew on them as they fixed it up they decided to move in and said\nIn our vernacular the word kids denotes you know they're not very well and not very solid thing or you know something was a kid and that can't be applied to seniors can't homes\nWhen you step inside the house has a wide open feel to it with windows everywhere in the living room dining room separated by dark wood columns\nIt's gone through some changes over the years like many interior codes of paint wall to wall shed carpeting and the addition of another bathroom in a laundry room but the mores have made sure that from the curb it looks like it did back in Nineteen fourteen they even got the seal of approval from some of the homes former tenants\nThere was a guy born in the house and that for a crew in two thousand six when we bought the house he used to it and he came to visit\nIt was it was pretty emotional for and we were sitting at the table over there and then we did walk through but she's sister came in China\nShe kind of gave her blessing and\nThere are little signs of the houses history all over once when will was doing some work on the back of the house had to pull some siding off of an outside wall\nWhen we took the shot angles we found two signatures from Nineteen forty than we've determined that they were probably the people that built the house\nAfter they found those signatures petty decided to make her march to\nThe woods behind the sheet rock in the laundry room she wrote her name and said that this is where she did her ironing for them to think about the future owners who might find it\nWe are the current caregivers is is what it amounts to\nThe house is the mainstay we're just trained sheets\nSo petty signature will sit on a tight dense board ... over a century ago just waiting to be found\nLong after Sears itself\nFor the Texas standards\nOn Michael marked for ... Texas oncology whether reminder that October as breast cancer awareness month to eight early detection all women over the age of forty should undergo routine screening like yearly mammogram\nMore at Texas oncology dot com\nSupport comes from the sixteen Daniel ... trial featuring the show it artist studios and homes and the ... neighborhood fine arts clay photography and more November third and fourth eleven AM to fight the and details at Travis heights aren't trail dot com\nK. U. T. ball membership Dr has officially started but you can still take advantage of the early bird special if you want to support the news and information programs you depend on ... or gene contribute at the ten dollars a month or above level and we'll say thank you what the K U T public radio no T shirt and ... new plastic buying glasses\nToday is your last chance for the special offers should do not wait and do not miss out you can find details and donate now at K. U. T. dot O. R. G. this okay you T Ninety point five\nSupport comes from the public museum presenting ... track killer and evening of Halloween fun for the whole family with activities in live music from Cape paused us this Friday at five\nI'm open to the public details that the story of Texas dot com\n... ... ... ... ... ... my cat and a non profit ... and ... and\n... ... ... ...\nHere we actually started down and ... Raman have 'em and brave and have I have a a week training I Am very very fattening\nFoods\nThat hauling airing training at that plant that combination of shame and then a ... in the kitchen training and how have arthritis and can never having had and the other hand if you got that far and add it all at the end of it had their hair fake have and how they all have\nAnd without people supporting the shortened membership drives we\nWill have to stretch them again and we certainly don't want to do that do your part right now at five one to four seven one six to nine one or join us right now\nAt K. U. T. dot O. R. G.\nWe're watching profit worries way down the stock market\nMarketplace morning report is supported by constant contact who's email marketing tools help small businesses nonprofits connect with our customers learn more in constant contact\nDot com and by carbon night offering data protection solutions for businesses including automatic back up for servers and point protection high visibility and disaster recovery and data migration learn more carbon I dot com\nAnd David Brancaccio in New York quarterly reports that disappointed from two big industrial companies are knocking down stock prices more widely this morning\nHeavy equipment maker caterpillar made profits that beat expectations but it warm prices will go up this year due to terrorists the trade war caterpillar stock is down almost ten percent now three I'm stuck down seven percent\nAfter it lowered its profit forecast for the year given the high dollar and slower sales market participants are selling mood\nThe Dow is down nearly four hundred points one point six percent yes it'd be five hundred down sixty two points two and a quarter percent the NASDAQ as down one hundred Ninety three points to point six percent the VIX index of market\nVolatility is surging of past twenty three when it's down near ten on a quieter day crude oil is down to point six percent of New York\nThere's news ... the Trump Administration is rolling out new rules designed to a lot more consumers to buy health insurance that don't meet Obamacare requirements meaning some well not cover pre existing conditions marketplaces Nancy Marshall cancer has more\nOne of the new regulations with lead employers give workers money to buy health insurance on the Obamacare exchanges the Obama administration didn't allow that because of fears that employers would push their sickest workers on to the exchanges another\nNew rule allows states to offer cheaper insurance plans that skirt some Affordable Care act requirements with fewer protections for people with preexisting conditions\nThese plants could appeal to younger healthier consumers but that could leave more older sicker people than the more comprehensive plan that you meet Affordable Care act requirements like coverage of pre existing conditions\nMarketplaces Nancy Marshall guns are in Washington it was the famous conservative economists Milton Friedman is original formulation about economic stimulus throw money out of a helicopter so that individuals get a directly metaphorically speaking\nWell it turns out there are a lot of twenty and thirty some things in America who might like to get one of those money leading helicopter's to fix education\nUniversity of Chicago political science professor Cathy Cohen is founder of gender forward a regular scientific survey the pay\nSpecial attention to the race and gender of respondents professor Hi hello David\n... get used to do a comedian who had the ... discuss some problem any problem and then ask what's my point more money for education you would say is the answer to every single problem that's in a sense what you found when the question is education\nI think that's true clearly millennials have have seen his routine when we ask young people any number of questions about the best way to improve public education they always circled back to increasing funding for public education so they want to pay teachers more they want to invest in neighborhood schools\nAnd overall they want to give more funding to public education\nAnd one of the features you surveys that you do gleaned data based on the race of the respond and in the gender what what did you find in Missouri a difference depending on who was answering\nIn this case it doesn't seem to matter very much overwhelming a young people I don't want to say independent of race and ethnicity but with their races and ethnicities support this idea of increasing funding for education on any number of dimensions\nSo uh this is a pretty consistent finding that seems to kind of extent across race and ethnicity\nAnd how would your respondents use the money if there were more money for education\n[noise] well they do a number of different things right there is a clear sense and the findings that young people believe that the most effective way to impact public education\nIs to really those kinds of relationships in the classroom that if given a priority with a limited amount of money they want to give it to teachers they want to support teachers they want to strengthen teachers' unions\nWhat about views of if it's not exactly public school I'm Talking about private school but also talking about the charter school movement\nYeah it's complicated I guess I Would say in the sense that young people are looking to improve education so they're supporting any number of strategies\nThey are supportive of increasing the number of charter schools\nThey are supportive of providing vouchers using government funds for in particular low income students but I Want to go back and say when given a list that says here are a number of options for improving public education they choose investing in public education at the local level\nAlways good to talk about the latest results from this agenda forward surveys or its founder is University of Chicago political science professor Cathy Cohen\nCathy thank you thank you [noise] marketplace morning report is supported by his costs insurance providing customized insurance\nFor small and medium businesses so they can do more in the more you learn more at H. I. S. C. O. X. dot com or from an agent his insurance encourage encourage\nAnti for X. dot com committed to empowering and helping traders seize opportunities and currency markets since Nineteen Ninety nine points dot com is your World Trade it\nFor X trading involves significant risk of loss\nIt is nine fifty seven and this is ... NPR station K. U. T. N. K. U. T. H. D. one us and we're on line at K. U. T. dot org\nSupport comes from ... the Birkenstock store now hiring nice people who want to learn about feet and we're comfortable shoes consistent flexible hours and respectful culture applications on line or in person in step Austin dot com\nComing out better Nick ... is that the cactus cafe this evening and sex it's all you need to know about the mid term Hi I'm Rebecca ... joined guest has Katie's ... along with political analyst nasty down Texas Tribune editor in chief Emily ranch shah and Katie senior reporter Audrey ... to talk about the border wall\nPublic school funding affordable housing and much more using bruises free and open to the public we have to see you tonight at six at the cactus find more details that cactus cafe data work\nShe would like to thank for following business [noise] the laws are so Sam beach business measurements that assurance gypsy color dot com and online home decor store Vicki good when with good wasn't good when real estate [noise] women's rolling ...\nElizabeth Christian public relations crystal clear pools and his fault [noise]\nLot of ruin companies have ruined beer garden Robert Butler MD Austin ear nose and throat winter and West Bank flower market\nAnd our two new is business members Dr Victoria shackled Ford's family counseling and capital\nCity plumbing and drain thank you very much we thank you empire oh boy you know who says I'd rather get my news here than from Facebook or social media someone on the air mentioned that we pay for a Hulu and Netflix subscription monthly and\nTo UT is also something I listened to daily so why would I not donate\n... yeah she said a virus as it really made me think and decide to finally donate so thank you very much him borrow\nA it's a it's folks like that that really make a difference here had can you do a U T during these membership drives we'd love to hear from you this morning just ahead is the Texas standard on K. U. T. Austin another one of the great programs that keeps you up to date on what is happening\nOnly here in Austin but in Texas around the world we've got it all your K U T Ninety point five make your contribution right now at K. U. T. dot ORG\nYou can also give us a call five one to four seven one six to nine one one eight eight eight for seven one six to nine one this\nShortened shorter than usual ... members had driver will be wrapping up on friday so today would be a great day became K U T the newest member support the news and information programming you depend on K. U. T. dot org and we thank you very much\n[noise] setting records statewide as early voting is underway across Texas meanwhile President Trump turns up the volume on immigration those stories today on the Texas down [noise]\n\n\nProduction is Katie Katie are a health and exercise radio incentive\nFor Moran software delivery desk comment\nBy David routed a rally in Houston the president ratcheted up the rhetoric as a migrant caravan from Central America makes its way through Mexico to the U.S border [noise]\nWatch what you wear before you head out to the bones why that favorite shirt or kept good land you in trouble with the local stabbed blurry also tornado alley winding its way you used the word climate experts\nTracker surprising long term weather pattern all those stories in a whole lot more on this Tuesday edition of the Texas [noise]\nOr the southern border which has a maid in the focus of a critics saying that he might be following a the Trump administration's instruction on the other hand they have to follow the legal procedure or a cording to the uh current them Mexican loss\nWe're almost out of time but President Trump is threatened to call up the U.S military if this caravan actually reaches the U.S Mexico border is this election season bluster how ugly could this get\n[noise] no I it's interesting because I actually talked to um some activists fear in Mexico city and part of a concerned that they have is that the carbon might arrived to the border to with the United states and they might face a very similar situation that the other other immigrant groups are facing\nSpecifically we can think of the Haitians they get their request for a refugee status in the United states denied but they apply to that same status in Mexico what happens is that they ended up staying in border towns in Mexico\nAnd this is increasing the population in this area we're talking about thousands of people that might just like suddenly arrived to this border towns and there is no specific plan yet from the Mexican authorities on what they're going to do [noise]\nRodrigo Cervantes is based in Mexico city as bureau chief for public radio station K Jay Z easy out of Phoenix Rodrigo thanks so much for the update and thank you very much for having oh\n\nThose are not among the teeming throng casting ballots when the first day of early voting any questions before you had the polls\n... standard in public radio stations across the Lone Star state have been working together to help you make sense of the midterm through our Texas decides project inviting listeners to send in their questions and all this week we're answering them Bonnie petri of Texas Public radio in San Antonio takes it from your\nQuestion NASCAR is patchy call her CPA\nBut I'm also an artist which are not two things usually go to get [noise]\nI live in ... and I'm born and bred in death and Patty's wandering about\nLaw and order [noise]\nQuestion is is is fairly easy in that we elect our judges I had an offhand anywhere that I can find the stations on the judges that are running this year oh okay\nSo they shouldn't be too hard on her partner and I have to go [laughter] there are more than three thousand elected judges in Texas Texas is one of just six states that pick members of the Supreme Court to sway\nHuh one of ... ... ... court justices this way and one of nine states that lets voters picked district court judges why do we do this [noise]\nWell it goes back in history this system was set up\nBefore the civil war and then reintroduced after the civil war that has not been modified ... Eighteen Ninety One show to an extent or steel and harsh and buggy days\nSaint Mary school of law professor ... says this system was fine in horse and buggy days when most people lived in small towns and everyone knew everyone\nThen when you voted for a judge who you're voting for what you're getting [noise] as they become an urbanized society that's changed is more difficult now to know who you're voting for running for what shop [noise]\nHow much have judges feel about this whole set up I guess I'll have to ask one hell about judge Sandy Marian\nI currently served as chief justice a day for the court of appeals in San Antonio Texas\nShe's been a judge for twenty six year since she's had to run for this office several times\nFor myself it was very difficult to campaign for office because you'd have to raise money\nYou have to really help yourself\nAnd I remember feeling very uncomfortable dealing does thing\nAnd you have to pick a party\nBut once you get elected you really have to take that political hat off\nAnd it's it's not always easy for everyone today\nWhen judge Marianne run she knows it's difficult to voters to learn about her\nSay you have to get the word out to\nCommercial I with nail outs are good inappropriate but again that's just your side in this story right\nSo she says you can't only rely on a candidate promotional material or\n... if you're voting simply because he saw that fine or you saw that one candidate had more science and the other that is absolutely no indication of the qualifications and that individual for the\nFor years are questionnaire Patsy had been getting in talent candidates for judge took her to grapevine would ask people who I knew then the ...\nFashion who's written a man and one of our experts agree is a great way to learn about candidates for judge\nGone a lawyer or you're a lawyer and asking them to tell you about a judge\nLawyers know who is a good job or who is a good candidate from Chad [noise]\nSo there's really no easy short cut here you have to do the work to learn about the judge's he'll be voting for and judge Marion hope she will\nPick such an important role that the judiciary place in our system and I just hope that voters will take the time to learn about um educating yourself at the most important thing that you can do to ensure that we have\nA strong position [noise]\nFor the Texas standards petri in San Antonio\nAnd if you do want to get started researching the judges that will be on your ballot you can check out our interactive voter guided Texas decides dot ORG\n[noise]\nThat signal means our social media editor wells Dunbar who's back to the house oh what a Texas talking about in the studio\nWell I've got to say early voting still front and center on social media\nFolks have their minds on the terms in the midterms on their minds as evidenced by the tweets we are receiving Chris panic\nSays it's the second day of early voting and there's still a line before the polls open here in Fort Worth send a photo along as well love to get pictures all this stuff for a monolithic ... tweets is that the voting line in South Austin is long yesterday\nAs it was at the same as long today is was at the same time yesterday and our ... kj tweets is that they thought it was just first excitement well apparently not\nI mean you know David I just doubled down on what you said as for those folks who have not voted yet uh-huh we do have that handy dandy nonpartisan voting God personalized down to your district\nIf they're available at Texas decides that orgy we've also got a link to it up and our own website Texas standard dot org reeking of holiday you know David or some reaction out there to the Trump rally in Houston I bet last night as well there are a little bit of assume wind or from the president there certainly\nWas I mean Ted Cruz gave one of them about what is rousing speeches I think I've ever heard a rousing course for the Republican faithful\nWe'd love to know what you think if you happen to tune in or down there at the Toyota cetera watching it first to employers won't you act Texas standards wells Dunbar is looking for you he'll be back in thirty five more than ...\nSupport comes from Texas children's hospital focused on outcomes and care and providing treatment to kids and a Lone Star state and be on for more than sixty years Texas children's hospital personalized care for every child more at Texas children's dot org [noise]\nSupport comes from glowed in an artisan box subscription and handmade and ethically sourced goods from around the world helping you work in income to autism from struggling countries items for kitchen home in lifestyle learn more at ... dot com\nSupport comes from seat and a part of the ascension no central Texans can schedule care for themselves and their Family Online anytime without breaking away from their day details on care and scheduling options can be found at gets eaten care dot com\nThey would like to thank supposedly business just works of law tapestry foundation Bob architecture spike Gillespie most of the wedding of ... and funeral Sullivan versus really blew rock artist ranch in Studio\n... yoga Texas northwest counseling and wellness center med savers pharmacy\nThe purple fig you go cleaning company the lair repeal company and hearty law\n\nHappy Tuesday to you it's a Texas standard and David Brown Dallas County schools not to be confused with Dallas ISD\nWas or rather obscure public agency there provided bus service to school districts around the region will now defunct school bus agencies in the crosshairs of a federal corruption investigation one which has taken down a fifth public official\nThat's still a job as a kid your a north Texas tells us this time it's a guilty plea on tax evasion charges federal officials\nSay Larry Duncan accepted nearly a quarter of a million dollars in campaign contributions over several years\nThe money came from a company called force multiplier solutions the tech company with doing business with Dallas County schools putting cameras on school buses Aaron nearly talks us attorney for the northern district of Texas says Duncan wasn't using the contributions for campaign expenses\nMr Duncan admit to use the money for personal gain essentially treating his campaign account like his own personal bank account\nA Mexican journalist will learn whether he will be granted asylum in the United states or early next year he's been seeking it for a decade\nEmilio ... so to appear before an immigration judge in El Paso Monday his case gained national attention after federal officers in West Texas detained him and his son for month\nAfter a routine immigration check and they were released this past July I caught up with good he added that he stood outside of an El Paso court house he says he can never return to Mexico where he faces death threats for his reporting on government corruption\n... maybe you could also in good ... you wonder if these actions would put him in more danger the actions of the people surrendering him to Mexican authorities or the actions\nOf those people waiting for him in Mexico good yet it is currently a recipient of the prestigious night while his journalism fellowship at the University of Michigan he traveled from Ann Arbor to Texas for yesterday's hearing another fellow Luis today is also made the trip and supportive ...\nToday is works for the NPR podcast radio ...\nWhat can I say you're seeing him and we want him you're only one in the\nCatholic highly is with the national press club journalism Institute which has long been advocating for ... she also traveled to El Paso and says she's concerned about how long the legal process is taking\nAnd the fact that these strange things keep happening to delay justice for Emilio\nOnly makes it harder for me to get out of my mind that suspicion that he is being used as a victim Pratchett prejudice against Mexican and prejudice against journalists\nThe judge hearing the case previously denied ... asylum but it's been forced to re hear it by the board of immigration appeals part of the U.S Justice Department that will get news from across the state and that he will go for the Texas standard\nSupported by these types of standard headlines ... Ben Adler ... handling eminent domain and condemnation cases throughout access protecting\nPrivate property rights for over Thirty years Baron Adler dot com\n\nThis is a Texas standard I'm David Brown if you grew up in Texas you we're likely taught at a young age about tornado alley but could\nTexas and the great plains for that matter no longer be the epicenter of the country's tornadic activity this is a question some climate scientists are studying\nAs they see an increase in that tornadic activity in the eastern us Victor ... is one of those scientists she's a professor at northern Illinois university who specializes in extreme weather and\nClimate change professor Jens Seaney thanks so much for spending a few minutes with us on the Texas standard no problem thanks for having me so I understand you were a one of the brains behind this\nPublished in the latest Journal of climate and atmosphere at science suggesting a shift in were tornadoes are happening in the U.S [noise] yeah\nThat's exactly right and to be honest we were a little surprised when we started digging through these tornado records\nOr as you mentioned at the start there are many states people think of is tornado alley right Texas Oklahoma and Kansas among those and they still are the epicenter of tornado activity the frequencies of tornadoes wrestle highest in those states what we've noticed over the last four years there's been a downward trend\nIn Texas Oklahoma and Kansas in in terms of the number of tornadoes that have occurred in a in a very sharp increasing trend in places like Alabama Mississippi tendency in portions of the Midwest\nNow it's not uncommon if you live in Alabama or Georgia or any place a little further east of Texas to to have a season of tornadoes especially in the spring and early summer uh I grew up in Georgia and we used to have our share of those when we talk about an increase in that area how big of an increase [noise]\nYou're really only talking maybe three to four tornadoes per decade so it's not like a big increase in any one of these small little boxes that we examined in our study but even\nThree to four tornadoes you know in a say a hundred kilometer by hundred kilometer box is still a pretty significant sharp increase when you look at the grand scheme of things\nSo it equates really to about twenty to twenty five percent increase in any given region\nWow date wow that that that does sound a significant so how was your team been tracking just\n[noise] well they're kinda too with the first way is to track where tornadoes occur and that's fairly straightforward and I said fairly straightforward because if you go back through the historical record one tornadoes cause damage right new studies occur and when you have a newspaper reports and so on you can go back and you can get pretty good idea of the activity [noise]\nBut what we've seen really over the last Twenty years or so that more tornadoes are being recorded more people have cell phones there's a lot more storm chase him better technology like rock radar and so very rare for any of these trade has to go and reported nowadays\nSo we use reports right with that kind of ... that we knew that there is some increasing trend but then we also examine what are called tornado environment or this this parameter in the paper we called significant tornado parameter\nAnd you can sort of think of that has a tornado watch so when the conditions are favorable portrays we capture that outside of the model we bring that in and analyze how those environment changing as well\nMhm now you have a working model of risk theory as to why this shift may be happening\n[noise] well that's a great question and we kind of leave that in the paper is sort of open science something that needs to be examined further\nWe kind of uh postulate to potential thing so number one would be natural variability in other words this is just kind of a quiet forty thirty four year period that we're moving into or Great Plains and it'll come back the second would be um this is a significant shift that's been induced by human through anthropogenic climate change in other words\nPortions of Texas and Oklahoma are kind of trying out and that's very consistent with what we would see some of the climate model projections of what would happen in the next thirty forty years if we\nContinue on the the uh what's called basically the business as usual admission scenario in regards to carbon dioxide so that would occur and\nOr higher temperatures in the southern plains and more drying out than we would definitely you know ... than this this eastward shoved in tornado alley\nSince we're already seeing that used word ship\n'em in regard to a changing climate we think that there is probably a climate change scenario a component play out here but we're simply not able to say definitively one way or the other whether what this is that we're seeing\nSo those would be living in tornado alley don't stand down just yet a that's a sign of living index\nOr Oklahoma you could still every year plan for your you know tornado season quote unquote but even then I don't really like saying he's in because we know tornadoes happen any time of the year in fact there are quite common place in places like Texas and Oklahoma and the month of November through February yeah so we can never really let our guard down just because we're seeing trends on a very large climate scale\nRichard ... is a professor in the department of geographic an atmosphere at sciences at northern Illinois University He's been studying in\nGrowing shifted tornadic activity shifting toward the eastern us professor didn't see any thanks again\nThe undiscovered something interesting the other day back before there were proper weather radios picking up the national weather service that sort of like they used to be this radio there was manufactured in the Alamo city I think it's called the Alamo city radio and and\nAnd and what he did was he picked up or whether a year from just the radio waves that might indicate that there was a tornado in the area to incredible thing I'll have to talk\nOf locally support comes from Texas children's hospital focused on outcomes and care and providing\nTreatment to kids and ... and beyond for more than sixteen years Texas children's hospital personalized care for every child more at Texas children's dot org\nSupport comes from Louis shanks furniture with a vast selection of home furnishings custom designed center and experience designers we live to help you love where you live on Anderson lane or Louis shanks furniture dot com\nSupport comes from St David foundation investing in healthy smiles through its mobile dental program which provides a dental care to more than ten thousand students each year more information at St David foundation dot org\n... twenty thirty annual Texas festival October twenty seven twenty eight in and around the state capital with three hundred authors of the year's best book friend that is available for headlining author sessions information at Texas book festival dot org\nSupport comes from lighten up Brewing Company and the European style loggers nails and the black forest and German inspired taxing made him track\nPowers menu in catering and great border details at black forest a T. X. dot com\n\nThey it's sexual standard on David Brown next week kids will Don makeup and masks and make the rounds in their neighborhoods with buckets in bags open wide\nIn an era when neighbors don't often get to know what another one byproduct of Halloween is an opportunity to get out and meet the folks who live next door and around the corner and that's the context for today's edition of our he'll to toe project in which Texan share stories about their boots\nMy name is Paula Lester I live in Houston a I'm a retired banker and lawyer and my boots story dates back to my growing up years in Austin in the late Nineteen forties\nWe had a neighbor whose grandfather turned out was a well known cowboy boot make her\nMission was about [noise]\nIn the late Nineteen forties a father of my\nOlder sister and me trick or treating it was my first time out on that mission", "show_name": "Texas Standard", "year": "2018", "city": "Austin", "day": "23"}