{"month": "10", "state": "AL", "station": "WAPR", "content": "These were to stick around the Cleveland Orchestra starts up at eight o'clock we are Alabama public radio [noise]\nThis is Alabama public radio service of the University of Alabama there'll be\nRadio [noise]\nThis is Alabama public radio service at the University of Alabama W. H. P. R.\nCute the I like those shows\nW. H. I. L. D. W. A. L. S. in Tuscaloosa\n... three easy test to Lisa\nCase though we are we are we are we we are Alabama public radio [noise]\n[noise]\nThey ... road has nine symphonies across the span of twenty five years from Seventeen Ninety nine to Eighteen twenty four\nHe worked on several simultaneously almost as pairs that fits in the six in the seventh and the eight others were written one after another several our precursors of later works in fact the first has clear foreshadowing\nOr the fifth just as the second can be interpreted as an early study of the kind of musical ideas that blossomed Twenty years later in the ninth since [noise]\nIn between those nine cents for these and during the same period\nBeethoven created a half\nDozen overtures alongside his only offers a daily you as well as writing the five piano concerto in several sets of string quartets\nAfter the ninth symphony went on to create the daring complex late string quartets\nAnd on this Cleveland Orchestra on the radio we have a taste of the Beethoven late string quartets with friends well sir most arrangement other grocer food go for a string orchestras\nAnd as a ringing finale to this Cleveland Orchestra severance halls centennial season the symphony number nine the corals symphony I'm Robert ... and this is the Cleveland Orchestra on the radio\nBroadcast of the Cleveland Orchestra originate with WC Elvie classical one for nine ideas stream\nSandra made possible in part by the endowed fund for radio broadcasting and with support from Dr ... gas and Brazil across [noise]\n\nSo what about Rosa food on the ground few which Beethoven road in Eighteen twenty\nFive as the final movement of his sixth movement court Jed envy flat major [noise]\nThis was eventually published\nFew which Beethoven road in Eighteen twenty five as the final movement of is six movement court jet envy flat major [noise]\nThis was eventually published his opus one thirty one of the five late quartets that he composed and the final two years of his life even more importantly what do we learn from the fact that the gross to go so bewildering the few who heard during Beethoven's lifetime and that he actually wrote\nA different final four that force at the grocery food stamp on it so [noise] looking towards the future and to the past fall half the same time\nIn this performance Beethoven's original scoring for a string quartet has been enlarged in augmented for string orchestras by friends relatives are most including doubling of sections of the baseline than by double bases\n\nBronze votes or most viewed Beethoven symphonies around the ideal of the ... the un heroic sitting here he is\nComing on stage now to conduct members of the Cleveland Orchestra in the ... children in filter most adaptation string orchestras [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\nMm\n[noise]\n\nMembers of the Cleveland Orchestra scream sections on the bitter on her music director from strokes were most reforming mystery bills for most own arrangements for string orchestras on the Beethoven\nGrocer fruit [noise] friends votes or most his view Beethoven symphony is as philosophical messengers [noise] let me do laundry go from you\n[noise] friends votes or most is viewed Beethoven symphony is as philosophical messenger there is a logical for me the is there to help humanity by stealing fire\nFrom the God to spark civilization injustice and good news forward Beethoven wanted a better world and advocated it through his music\nOf course it should be noted that Beethoven's personal life did not always meet is aspirations in fact the off in like the idea of a shared humanity\nAnd Brotherhood more than the reality of dealing with a particular individual\nHis life is filled with stormy and disagreeable relationships with friends and acquaintances you compromise his own ideals because he was human\nArguing and treating friends badly or visiting prostitutes and then being wracked with guilt but for each of us are we want to live our lives is a constant struggle against the needs and the subsidies of everyday living\nInformation about the Cleveland Orchestra and its programs and activities can be found at the Cleveland Orchestra website Cleveland Orchestra one word dot com\nYou can also revisit selected in Cleveland Orchestra broadcasts that the W. seal the Cleveland Orchestra on demand website page then URL is W A L v dot org typically are given concert is posted for two weeks\nUpcoming the Beethoven symphony number nine the corral symphony\nI'm Robert Conrad a severance hauled one of the great concert halls of the world located in Cleveland's university circle\nThis is the Cleveland Orchestra radio network now in that six decade\n\nWelcome back to severance hall\nThe soloist performing on this broadcast or the Beethoven symphony number nine are soprano Aaron wall\nMet so Jennifer Johnston Turner Norman urged and bass baritone gushing burden\nThe Cleveland Orchestra chorus was prepared by its newly appointed chorus director Lee so wrong\nMusic director friends belts are most has written the following for the sufferings hall program but can we quote\nBut like any great work of art to be fully understood the symphony number nine has to be viewed as a product of its time\nThe ideas that Beethoven embodied\nBe fully understood the symphony number nine has to be viewed as a product of its time\nThe ideas that Beethoven embodied in the ninth symphony grew out of the philosophy of the enlightenment and the political divisions of the French Revolution\nBoth of which made it a profound impact on him as a young man\nThe work is also a reflection on religion\nA humane form of Christianity in the revolutionary ideal of fraternity reconciled with the image of Christ as quote the brother\nThe enlightenment placed humans in the center of all thinking believing that reason and human thought could understand God's universe whereas previously God Almighty\nHad been alone at the center of understanding\nThe ninth also shows influences from pre masonry as well as parallels with the philosophy of Emmanuel current\nContemporary or Beethoven\nIn the way intellectual and religious ideas um separate origins are United in combined with one another\nThis is an unquote from Brownsville or most\n\nThis performance of the Beethoven ninth who's being recorded for eventual commercial release previously the symphony has been recorded by the orchestra with conductors George cell Lauren ... and ... those are most [noise]\nWe'll continue with this broadcast from server and tall\nAnd the Beethoven symphony number nine\n\nYou're listening to the Cleveland Orchestra on Alabama public radio a service at the University of Alabama good evening on Bob ... support provided in part by five horizons health services formerly west Alabama age outreach a nonprofit organization serving west Alabama with preventive in general medical care\nAlso providing prevention education supportive services research and advocacy more five horizons dot ORG\nOr to zero five seven five nine four seven zero\n\nAlabama public radio has there been at the University of Alabama W. H. P. R. Selma and you can't pay our muscles shells at your age you\nKnow the W A L F them just a little ... the Tuscaloosa W kicks\nYeah no the W. A. L. S. W. A. T. two three beat the Tuscaloosa W to six\nOr eight I mean we are Alabama public radio [noise]\nFollowing this concert in Cleveland the orchestra centennial George Will take them to Vienna in Tokyo\nTo perform all from the Beethoven symphonies in each venture here are the solar was followed by music director from Spencer most will have the symphony number nine the coral symphony how big\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\nMm\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\nNo no no no no na\n\n\nOh\n\nAnd I'm\nAlone and um\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nOr are\n\nThey just\nWant\nTo\nKnow what\nSo what what does that mean that I don't\nKnow how much money\nNow [laughter]\n\n[noise]\n\n\n\nAll\nI I mean there\nAre different and I thought\nOh whoa whoa whoa\nWhoa\nWhoa whoa [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nAnd\n[noise]\n[noise]\n[noise]\n[noise]\nWell", "year": "2018", "show_name": "San Francisco Symphony", "city": "Selma", "day": "25"}