{"month": "10", "state": "AL", "station": "WAPR", "content": "These were stick around orchestra concerts starts up at eight o'clock\nWe are Alabama public radio [noise]\nThis is Alabama public radio in service of the University of Alabama there'll be\nAlabama public radio there'll be at the University of Alabama W. H. P. R.\nFound any of those shows W. H. I. L. no deal W. A. L. S. and Tuscaloosa ... being the testimony that\nWe are we are we are we we are Alabama public radio [noise]\n\n\nThe music director of the Cleveland Orchestra ... says in an interview with the music critic of the Cleveland Plain dealer Zachary Louis\nThat tree stunned and these older relies more heavily than most operas on the orchestra to express the mental states of the character's this is a philosophical symphonic poem was singers he says it is an opera that the Cleveland Orchestra was born to play\nThe psychology of the entire piece is in the orchestra and so the more transparent you can get the more layers of psycho drama you'll understand he says I have always felt that this orchestra which has such a high musical intelligence really has to play [noise]\nUnquote friends filter most the orchestras music director\nOn this Cleveland Orchestra on the radio representing over a period of three broadcast a continued story a tree stunned and his older with X. wanting to err on the two previous broadcast and on this third broadcast we present act three although each of these acts are lengthy each over Seventy eight minutes\nIs too short for a two hour broadcast so we have fleshed out each program with Wagner performances from previous Cleveland Orchestra builds through most concerts on this airing selections from to gather Denver are\nGone and sick bridge Ryan journey Andrew inhaled his immolation Christine Brewer is the Sopranos [noise]\n\nBroadcasts of the Cleveland Orchestra originate with WC Elvie classical one oh four nine Idea Stream and they're made possible in part by the endowed fun for radio broadcasting and with support from Dr Frederic gas and Brazil across\nThe cast of this\nCasting and with support from Dr Frederic gas and Brazil across\n\nThe cast of this severance ... concert performances Wagner is ... and his older include soprano needed a semi as these older gender Gary Hart single as ...\n... as brand gainer based on anger as king mark and baritone Sean Mitchell plum as millet\nCenter Matthew Franck is the shepherd\nHere's the story of the actor three of trees done and these older\n... has brought ... home to his castle in Britain a\nShepherd pipes mourned full tune an ass of trust on his awake\nDriven all replies that only as old as arrival can save trust on\nJust on does are waking laments his faith to be in the false realm of daylight once more into delivery a state of yearning\nJust on his overjoyed when ... tells him that his older is on her way exhausted however priest on collapses and then his oldest ship docks and as colonel rushes to meet her three stunned excited lead tears the bandages from his wounds\nAs he's older arrives that Tristan\nSide he dies whispering her name he's older collapses besides trust John just as another ship arrives\nCurb analyses it's a lot to mark and Bram ... he thinks they have come to kill Tristan\nAnd he attacks my lot mark fails to stop the fight in both ... and ... are killed\nMark and brand gave him finally reached ... and his older\nMark pills that brand gay now has revealed the secret of the love potion\nAnd he has come to unite Kristen and his older\nHe's older purest awake and with her faith interest on does to the music of the lead bestowed the love death I'm Robert Conrad and this is the Cleveland Orchestra on the radio\n\nThe soloist incidentally or on an elevated platform at the rear of the orchestra with the walkway that extends back bargain off [noise] we'll have X. three of free stunned and his older fire regarding partner\nI regard partner Mm\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nDon't know who they must be close to where we came from a\nMan that\nSeems to me it was really\nFun to\nHave\n\n\nA\n... no no\nNo no no I was you\nLa la la\nLa la la\nLa la la la la la\n\n[noise]\n\n\nYou know\nMm Mm\n\n\n\n\nMm\nMm Mm\nMm\n\n\nA a\nA\nA\n\nLike ... and it's awesome online is going to a new one on what's going\n\nOn you know ... ...\n\n\n... ... and\nSo on and you're a baby [noise] usually good\nLaws and the dogs on and on\nAnd on a as a as a as a a a\nR T H and all\nOf\n\nProject and a\n\n\nLot to do so\nI mean a\nLittle off the Sunni da da da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da\nDa da\nDa\nTo me you\nKnow the oil\nThe ...\n... what\nWas going to look\n\nAt my\n\nSon\n\nTo\nSomebody they\n\nWhat about the man\nWho will vote on it will be\nUp on it\n\n\nMy son was not that old\nSaying you know or\n\nThe ...\nThe man\n\nWho\nWill\nBe on\n\n\nIs\n\nTo know what you're\nSaying\nThat's what it what was most reasonable\nThe last two years\nWon\nThe uh\n[noise]\nOn\n\nA\nA plane loads of comedy in General Sanchez talked me into the school\nMy thoughts on this is the bottom\nLine in\nLong run\nIt seems to be in an office in\nSt Louis laws\nOn\n\n\n\n\nThe bullet\nHoles yeah no\nNo no no no no no\nDidn't get a phone call\nOr two\nMove on to the phones on\n\nOne thing I\nKnow\nA bullet one must be like me who\n\nMaybe he\nWas a and a lot\n\nSingle person making the rounds to\nSomeone who\nBe a\nMan you know to be able to put me on my way around that time I\n\nWas\n\nYup you're\nThe news [noise]\n\nFriends and I\n\n\nThe man he\n\nWas [noise]\n\n\nBy the\n\nWhich I mean it's\n[noise]\n[noise]\nWhat was\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[noise] yeah\nI don't know whether\n\n\nAnd\nThe second one was on the on the ah [noise]\n\nShe\n\n\n\nWants to\nMarry [noise]\n\n\nMhm\n\n\n\n[noise]\nMhm mhm well\n\n\n[noise] [noise]\n\nNo no no\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\nOh ...\nWhat would it be\nYou know just to pick up\nThe number one thing\nWhat do we think about it\n[laughter]\n[noise] [noise]\n\nWell\n\n\n[noise]\n\n[noise] oh man\n\nThe man\nOn the other one [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\nI don't know\nYou know we need\nMake\nMoney\n\nOn it can\n\n\nBe anywhere\nYou want\nTo a new\n\nOne on one of them do\nWhat they\nAmong\nPeople need\nBe\nWorried\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRight [noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n", "year": "2018", "show_name": "San Francisco Symphony", "city": "Selma", "day": "18"}