{"month": "10", "state": "NY", "station": "WRUR", "content": "And ... blue ribbon whatever\nYou know not like they make fun of her life to get to do any early to Guyana\n[noise] whatever\nThat may be other people that lived to be winning the Israel where you're at now live in New Jersey ... will you will lose\nTheir workers who go\nTo any breakthroughs believe me that she was\nLiving in the in the world [noise]\n\nAnd my twenty joy is to try to look that way when you try to let you on a new yet man\nFor the New York well\n\nYou know but I didn't mean it could not get a ... engine gun on her\n\nReal name in the meantime the be all end up with shrapnel lying or do you do too liberal who ...\nWho knows what will the new\nThe new ... Murphy was okay for them and we knew from a movie\nOr a\n\nTrain ride to catch you if you will do that and they bring your heart ...\n...\nGoing to turn on\nThe menu Hi you're on the line Ron\nCalling around\nSaying\nAnd Don\nMuch money\nAnd run and to me by\nSide\nAnd\nAnd\n\nThat\nWas\n\nTrump going to reveal\n\nThat you can run and to me\nAnd\nI came to my\nMother and father's\nDay\nComment\nOn Ron ... and\n\n... and\nIt's W. are you are different radio\nMm\nAnd how are\nMan that's long some ...\nUm\nBad up\n\nAbout you are listening to eighty eight point five W are you are ... Iraq just you're a broadcast partnership at the University of Rochester at W. S. X. either the broadcasting also one night at W. R. U. R. dot org\n... ... ... ... ... ... ...\n... ... ... ... ... ... ... ... ... ...\nYeah I heard about the party run in the high either got a houseful account for the photograph\nHe's got the cat usually when he's been this\nWay to buy the boys things aren't revert back then the day and there are dressed up in a long sleep labs that I Know a little window ... but how do you wear something retro Luke Luke\nWith to be\nTo you know getting on that do support the gay bars let me turn the bell Gina ... looking in the corner of the biggest known about the board\nJersey is\nDown thinking\nWho knows\nYou knew that you hear on your local jak ... shows\nYeah my dad used to please go loaded down with the base and back then the song from both love the mystery of well the low given by the people that they used to work for the girl\nAt work for the money for the honey you know broken on the ... the gay bars ... both junior whiskey\nBurden on her singing songs about the board\nIn Jersey but\nBrooklyn man\n[noise]\nMm\n\n[noise] Mm\nLet me know that there were a gay bar I'm about ... broken in the barn going or do something about the ...\nMountains in Jersey is is\nDi di di\n\nDa\nYou you just heard a Rican beach by her aid for the riff raff and before that was I don't we spoke again by death cab for cutie and a Pearl by Mickey all intents song and now\nI'm going to probably lame things up a little bit and the British Band called everything everything that's long been one of my favorites they released people dream last year and this is run the numbers\nDon't\n\nTalk about\nOh\n\n\n\n\n[noise]\n\n[laughter]\n[laughter]\n[noise]\n[noise] [noise] [noise] Mm [noise] your your\nWould\nDrew\n\nLot of research on the ...\nOf the Bolshoi\n... your ...\nYou know larger than the\n... the\nJersey\nWith me all the sheer luck\nYou and your ...\n\nMuch to\n\n\n\n\n\nWell well well what do you want to be more than ... ... ... ... ...\n... well\n\nWe're\nWe're we're\nWe're\nWe're ...\nWe're ... ... ... well\nReal world road la la la\nJust don't\nGet any\nMoney and\nDo you mean oh\nMy\nGod oh\n\nMy God [noise] [noise] [noise]\n\n\n[laughter]\n\nMm\nMm Mm\nMm Mm Mm Mm Mm Mm\nMm Mm Mm Mm\nMm Mm\n[noise]\nWell [noise]\nYou know\nA guy named\n... would you do\nNeed to be a\n... oh no no no like you know they're done do you see the good news [laughter] no\n\nNo\nNo no\nRon right now I'm\nNot sure that you know when\nThey show you the best they can do right where are you saying\nThat this many times by age\n\nOr ... they're saying that the next\nYou know men\nDidn't\nKnow\nIn any there I didn't have\nTo do a big thing\nIn the sand\nOr standing there must be able to do the\nVery very young man in Manhattan yeah\nMan there must be\nWell ... to ...\nAnd the oh\n\nMy God I always forget just like how good that song is a that was first present funny well for the phone but for Seventy by Sunni gas\nAnd before that was doesn't matter by Christine and the queen and Roger Stone by the Irish fans by I feel like so much like I feel like I just keep like laying these really intense song so I'm gonna keep taking things down a notch\nUm and this is an example of that this is the ... the war and I played we last week she still has the best sports in the universe so I wouldn't sit for yourself\n[noise] [noise] [noise] [noise] [noise]\nLet you behind me\nOn the\nI shouldn't be\n... hey you\nI should just go\nMature\nMm Mm\nMm\n... big enough", "year": "2018", "show_name": "Two Sets of Headphones", "city": "Rochester", "day": "12"}