{"month": "10", "state": "AZ", "station": "KPUB", "content": "We\nWe we\n\nNext M. K. and they knew the midnight special northern Arizona university this Arizona Public radio NPR News in classical music on cayenne a you idiot point seven Flagstaff ... Ninety One point seven like that\nCan a Nike point seven shallow hey any deep Ninety One line Stephanie cage thing in a\nGene Ninety three Grand Canyon and cayenne a cue eighty nine points repressed\n... or ... ...\nYou know\nAbout it from\nYour mom around\nEight eight Ninety seven shallow pay in eighty nine to run like second cage when you're in a gene Ninety three Grand Canyon and pay any ... any ...\nOr ...\nYou know\n... games on\nAnd then she ran around and you know\nI mean ...\nThe man and you may not\nKnow\nMay not be\nKnown am in them and not on I mean when you get the welcome\nAboard our midnight special folk music and fires show to satire madness and escape I'm rich warn\nThe midnight special is under written in part by deliciousness dot com information at age seven to two six seven to one six seven or the militias this dot com D. E. L. I. C. I. U. S. N. E. S. S. dot com\nLet's begin with Woody Guthrie singing his best known song with all of its versus followed by the song that inspired him to ride it Mm Mm\nMm Mm\nLand is your land this land is my land from California to the New York guy land in the red woods foreigners\nLet's begin with Woody Guthrie singing his best known song with all of its versus followed by the song that inspired to write it Mm\nMm Mm\nThis land is your land and this land is my land from California from the New York guy land and the red woods far as\nThe gulfstream waters\nThis land was made for you and me\nAnd I went to wall being that ribbon of highway and I saw of me that endless skyway Mm\nI saw ... me that golden ... this land willingly you and me Mm\nOur own ... book steps\nOf the sparkling slam or or diamond desert\nAll around me and ... being ...\nThis land was made for you and me\nA big high Waller and tried to stop me\nSign was painted\nPrivate property\nBut all in the back ... to ... saying nothing\nOur own ... ... steps\nSparkling slam or or diamond desert\nAll around me a voice was rounding\nThis land a little late for you and me\nThere was a big high Waller and try to stop me\nSign was painted\nA private property\nBut all in the bag da da da\nDa da da da and ...\nWhen the sun comes ... names and I was rolling in wheat fields away me in the last well rolling\nLaws was jak ending the fall was living being\nThis land was made for you and me Mm\nThis land is your ... them and this land is my land California for the New York Carlin\nRedwood bar in the Gulf Stream waters\nLand was made ...\nNa na\nNa na na na na na na na na\nNa na na na\nNa na na na na na na na na na na na na na na\n\n\nNa na we talk about\nGod I'm like oh\nMy God\nOh\nMy God I Know I read it on a lie well I'm I'm a I'm\nA I'm a\n\nI'm\nNot ball\nYeah\n\nNo\n\n\nNo I'm\nNot a ball\n\n\n\n\nBall ma\n\n\nMa\n\n\n...\nThere was ... to remember the day ... me and my sister went to watch the ... rate wasn't very big win this way\n\n\nIt was ... chill lying to remember that day me and my sister went to watch the PR rate\nWasn't very being sued when they didn't wait three times around our little town\nThe ... middle school marching band ... she went missing by the ...\nFiring speech by\nHad ... stay in the ... we had dogs and two ... marching in the rain\nAnd the guy from the building and the boy\nScout formation central veterans put to a\nWe were just young and talented ... different ...\nAnd boy did we are\nRewrite Ali all said listen to me all the ...\n...\n\nIt's an old ... to live\nWe were just young ...\nAnd boy did we are\nHere right now do we all said listen mostly all the ...\n... health Mm\nDay\nDo you tell me the battle draws me your name so darn many\nOnly show well ...\nAre deserted shows now when I wrote Sunday the drew a lot of\nLittle ah\n\n\n\nYou know I'm a\n\n\n\nSay or do you do\n\nThe\n\nYou know no no no no you\nThe ...\nThe ... and ... and ah you\nA lot of changes\n\nThe washing cars millions\n\nThe train to all the\n...\nThe washing cars millions\n\nThe train who are the\nLargest\nOr when\nThe body to\nAre\n\n... and ...\nYou know you\nDon't have a job a good ...\nYou don't have to go get no uh\n\nWell I Know a lot of fun and\nYou a hunter but I'm just was\nIn\nWas from now who\n\nI Am in bomb not then bundled up all\n\nRather than a dog will\n\nIn New York\nWas some you know who's\n\nI Am in bomb not been ...\n\nNothing to do with\nAgain back\nOn my training\nMhm Mm well\n...\n\nThe\n\n...\n[noise] oh\n\nYeah they have lied black\n...\nLand a highway as they get the\n... we're driving\nI Do not go\nWherever\nThey are\nGoing back down by\nWay I carry\nJob\n\nAnd they hand on the last\nSet me up\nAnd highways and on and get the money\nThat we're driving\nToo much going on\nWhether times are changing\nA harrowing\nBack down\nWell they came from\nMissouri and just as I was doing when\nWe're driving you know one of the time and change the\nGod what were some other way maybe you know we could be ...\n\nBut no one ever\nUp and I have\nTo\nHave the billboards riding number ... shadows other non\nShould move away and we're driving ...\nTo one of the time on a shame\n\n\n\nAnd we're driving ... do\nWell in China shame\n\n\n\nA new\nThing\nFor me\nThe name\nYou know there\nAre no one\nMan ever another de Vito one law day may not bring it back you\nKnow all the time I'm\nJust a matter of ...\nFrom the waiting room\nTo the crowded trains\nYou can hear the ... right\nOne of the time and the journey the\n\nJob and she was a man\nDriving\nSure the crowded trains [noise]\nYou can hear the bell who's up three or rain\nWhere the time and the Chinese\n\nHave been calling from St Bernard and\nDriving tests to\nTheir job and you\nTo young rather than just getting\nNa\nDriving\nYou know\nAnd we're driving me to read you know\nRather than you know you can say\nHey\nMan\n[noise]\nRandall brambles recorded at the ... folk festival in two thousand Seventeen driving to Montgomery is songs from ... to ... thousand seventeenth festival sampler before Randall rambling Steve Young\nWho died just a couple of years ago Montgomery and the rain from his album solo live and we begin with body Kobach angel from Montgomery by John pride from her rediscovered CD older songs that she recorded in the past\nRamble it recorded at the curb ... folk festival in two thousand Seventeen driving to Montgomery is song from ... to thousands Seventeen festival sampler before Randall ramble it Steve Young\nWho died just a couple of years ago Montgomery and the rain from his album solo live\nAnd we begin with Bonnie Kobach angel from Montgomery by John Prine from her rediscovered CD of older songs that she recorded in the past that have finally been released on CD and Bonnie and John Prine came of age and the Chicago folk scene together and she learned a lot of songs from him and that was one of them\nIf you'd like more information about what we play on the midnight special how to find the artists learn more about them et cetera you can visit our website at midnight special dot org\nWhere you can find this play list number forty two posted the Monday evening after you hear the program and on the opening screen there's a link to contact me just says contact rich little envelope at midnight special dot org\nThe midnight special is under written in part by the ... dot com providing foods and snacks for a variety of dietary lifestyles such as gluten free began allergen friendly and dairy free\nAll delivered direct to you anywhere in the United states deliciousness dot com brands include mosaics organic pop chips handfuls nuts snacks and veggie copious single serve alums in depth\nInformation available at the ... dot com or it eight seven to two six seven to one six seven\nFree began allergen friendly and very free all delivered direct to you anywhere in the United states deliciousness dot com brands include mosaics organic pop chips handfuls nuts snacks and veggie copious single serve columns in depth\nInformation available at the mission snus dot com or eight seven to two six seven to one six seven\nThat picture on your show fun you'll love the children's on you know the\nBig around your mom is ...\nGet a check to empty it ... me when he is a little jaded leader of\nThe day in the lower than the\n... and then she can get it to me he said\nHe thought they were in the me and my dad he\nMhm\nHe fought back then\nThe box in the\nThe thought that the the thought in a bank\nAnd he bought them or\nYeah that may be ...\nOr ... ...\nIf you know young men mom\nYou know I have no\n... no ... on them I'm a\nBig showdown abject dollar\nA dog and get more women\nThan offended and can fall [noise]\nOr\nI'm gonna buy me a tip a\nLong that done a lot of them don't buy me a pin\nDoes it need dome on them I'm a\nBig showdown after your dog or\nA dog can get more women\nThan up that they can call\nIn order\nI'm going to buy me up to a\nJets and long that I'm a lot of them don't buy me a been a\nAnd I'm ...\nI'm Don soon for now I'm\nGet the job and Bob\n\nI'm Wondering why\nDrink bacteria ... sang a boy\nAnd da da da da da da da da da\nDa da da da da da\nDe la di\n\nDi\n... long shine and bass [noise]\nGone up by near St John John and what I've read long shot back\nI'm Donna he's not around\nNo no way\n\nTo buy me a shot John\n... was a long shot and backed\nUp by their shot John and what I read a long shot back\nI'm Donna that around\nNo no wait a minute I\n\nThat in mind and want\nLeave a\nRather money well spent a lot no\nLand the land a lack of a dog\nOr cat oh maybe\nHe\nWas the man now\nLeads to me mom mom\nI'm going back and they actually live on the phone you use it", "year": "2018", "show_name": "Midnight Special", "city": "Flagstaff", "day": "14"}