{"month": "10", "state": "TX", "station": "KUT", "content": "So it comes back to your question of what is one term items at one term my colony or is it one individual insect yeah\nYeah and that's still is kind of a puzzle um I think the other thing that came out was one of the robot is is actually build a a a machine that could track or a a bunch of software that could actually track individual termites in petri dishes and\nPreviously when they looked in the petri dishes they they ... they would put a bunch of termites in a petri dish and then they put a camera on them for\nTen minutes Fifteen minutes and they hope to see what they would do 'em\nAnd they they had the feeling that they weren't doing very much or um that everybody was every time I was basically following the same program that they were in some way they could be\nThink of that they weren't they knew they weren't robots but they could think of them as if they were robots\nUm what happened was they didn't actually get very much good data from that stuff and so she that this one researcher Pearson Peterson um designed a tracking system for them and once she was actually able to track them which is an incredibly laborious practice by hand\nUh and could not there's an track just back up there's ways to track ants in a petri dish and um because you can put some paint on an aunt but the termites are constantly grooming each other so you put some paint on a tour might and they all clean it right off [laughter] like then you have to start paying them again [laughter] so\nUm so they had never like really followed what individual termites we're up to so once she\nFigured out this whole tracking system and kind of trained at and refined it so that the tracking system really worked well\nShe discovered that first of all eighty percent of the termites or just screwing around there like running around\nTheir ... standing completely still they just like run back and forth sniffing things and twenty percent of the termites or working like nuts huh um but some of them are actually leaders and some of them are followers and then\nUm they were digging up if if one of these leaders is like digging up dirt balls and running them over and putting them down in a certain spot\nOr other ones will follow\n'em and so it turned out that then there were individual termites or they're not robots and there are leaders and their followers and there are then you know these eighty percent that I I don't know philosophers Bill Murray characters whatever they are they're just sort of hanging out and and um [noise] and\nIt just showed that there was a lot that we didn't know about them and we needed to sort of broaden our conception of how these guys are building their complex systems and and what would it would mean you know when we think of building\nA some sort of ... machine based cognitive system we're thinking with robots we're thinking everybody should be the same every every robot she'd be the same to build this kind of swarm system\nUm but what here ... after she looked at this was ... what if I started building societies of robots where they had different abilities what would that be like and that you know of course is a whole other can of worms here listening to\nThink I'm Chris Boyd let's go back to the phones I'm Caitlin is on the line in Austin Hi Caitlin\nIowa I'm highly fibrous um first of all I Want to say\nThis is a very interesting and I really look forward to getting the new book out here for example um but of course I haven't read it but I always found off them with writing on my college really interesting I was curious\nIf one if you had a chance to read some of that stuff and uh she found it a couple of things I did and to fall on oil in the brain of curious if you had any plan whatsoever through give us another gift like well in the brain\nThanks very well wow [laughter] um oil in the brain as a long time ago um so I have read some of Paul Simon says stuff\nYou know I Love that stuff but I don't really quite know what to make of it um [noise] and uh my ... excuse me for interrupting my college has a study of fungus is that right fungus yes see and he's a fungus guy and his I think his covers have him like\nWith a he's like in a tuxedo wearing the cover of his books have him like in tuxedo maybe like holding a French\nHorn or something [laughter] around about ... mushrooms I mean ... it's kind of really fabulous stuff and I always love talking to them you know the mushroom people whenever there's a chance to talk to mushroom people\nI talk to them um but I don't I don't really know what to make of all that and uh as far as oil and the brain you know this was a I think\nFollowing termites into a thinking about the future was kind of a way it was my follow up to oil and the brain because\nOnce I got really into termites\nI started thinking about what is it in ... as we try to move towards being lighter on the earth to dealing with climate change you know who who are we going to become and what what sorts of technology are we going to adopt and how well does affect us I mean I think one of the things that really struck me studying oil was oil really\nA influences how our country's organized how we as people are organized how we think about ourselves how we connect to our relatives you know I'm\nA ... how we fly around and do work at every ... oil oil as in everything and so once we start changing that technology say into biofuels or\nOr more swarming or just um growing growing some of our chemistry and tanks how's that going to change us and and what sorts of possibilities is that going to open up and close off I guess I'm so I'm not sure whether\nWell under bug was my attempt to kind of take that off and chew on it for a while well with very little data to go on\nYou ended up um by reminding us that insects as a whole appear to be exceptionally endangered by the conditions that humans have created on earth can we find ways to protect them even if most people can't get over the ... factor and don't fully appreciate what it is they do for us\n[noise] well I think we need to find out what's happening with them we only have these sort of little sense is that the numbers of insects and the diversity of insects maybe dropping kind of dramatically one of the things that entomologist talk about is sort of the windshield\nFactor which is that you know Twenty years ago when you went driving on a warm night\nYou're in your windshield would be so covered by insects that you'd have to go to a gas station like scrub for a while right with the squeegee and that is not the case anymore so it might be that the windshield been redesigned a bit um [noise] but it also does seem to reflect something that's going on with insects are but we have very little data on that\nUh I think the other thing that we don't have much data on is how dependent are we on tiny microbes that we don't know anything about 'em some of the microbes that we ah rely on that that keep nitrogen flowing in the ocean for example we just sort of learned about a few years ago\nThe new book by journalist Lisa market Nellie is called under bug an obsessive tale of termites and technology we ... this is an absolutely a delight thank you for sending me our with thank thank you so much\nYou can follow us on Twitter at K. E. R. A. thank my Twitter handle is ... ... thank please use any pod cast out that you are familiar with to become a subscriber to the think hot cast\nAnd check out what we have planned for upcoming shows I think that ... are a dot org once again I'm Chris Boyd thanks for listening have a great day\n... [noise]\nSupport comes from barking Greek farmers market with local farmers in artisans pastured meat prepared foods live music for the kids in this Saturday petting zoo\nFrom nine to one on the backside of bark and Greek mall overlooking Austin skyline\nSupport comes from Austin community college and the art has heart foundation presenting a boots and bats gala scholarship fund raiser live music celebrity art and more on November tend to get that often C. C. dot edu slash boots and bats\n[noise] and ...\nAnd a moment grocery among [noise] every lower\nMember zoom [noise] um\n[noise]\nYou're listening to the U.S [noise]\nThe caravan continues north today on the world\nTrump and rally last night we're focusing on just one item from that and it's not comments about\nThe idea that it's not really accurate it's more like an ... now is that people traveling to the Mexico Guatemala what are\nThey in Mexico or Bush on to the U.S the choices facing thousands of people walking north from Honduras that and much more today on the world\n\nYou know well it's both impressive their numbers and their movement and also ominous reporter Emily Green speaking with us from just south of Mexican\nBorder in Guatemala up all over the caravan in her car Emily thanks very much [noise]\nThank you so much\nGretchen corners in Mexico city she heads up an NGO called the Institute for women in migration and has worked with migrants for years\nA lot of shouting back and forth between Donald Trump Mexican officials people working with the migrants like yourself corruption that's where the Mexican government has it taken an official position on this so called caravan of migrants\nWhen the care of and started out Mexico started out by saying that no wonder if you let in unless they had at least and then as the caravan started you know getting closer and closer to Mexico I think that the officials realized that they needed help and so just in the last couple of days\nThey started talking about the right to apply for asylum that it's an individual case by case analysis\nAnd they also realize that they're not going to be able to do that if there are thousands of people who watch requested by themselves in the last couple of days\nThey made unofficially class to the U. N. H. G. R. for support and also the national human rights commission of Mexico called in and went down to the border yesterday and I think that I saw this morning there are some marine\nRight so those would be Mexican Marines and with the Margaret's be then applying for asylum in Mexico\nMexican law says that anybody who rides to the border has the right to request asylum and refugee convention\nThat what's interesting with Mexico is that Mexico has also signed the convention on torture so anybody who's at the border who expresses\nThat they're you know they have some kind of violence if they go back to their country of origin then they can be accepted in and they can apply for asylum but also Mexico has something called complimentary protection\nSo actually the Mexican legislation and favorable families humanitarian chew immigrants in general the problem here is that the Mexican government is under so much pressure\nSo most of these migrants want across the U.S Mexico border and get into the U.S will Mexico let these migrants travel north through Mexico or will they try and stop them\nWell it depends if you've applied for asylum in Mexico you have a pending claim of you have a humanitarian V. fat\nThen you can have some sort of mobility with documentation to those people are gonna have to make a decision on whether they stay and wait for the final claim or whether they travel within the country there is you know very severe\nSystem of checks throughout the whole entire country and some people who are undocumented who are traveling on that train or\nA highway system will he stopped and chat many times throughout their ... and so if they're traveling with a document they will probably be detained at the ...\nI mean you've seen thousands of migrants in Mexico not just now but but over the years realistically do they make it through to the U.S or do they end up kind of in limbo in a way in Mexico\nWell it's interesting because you know the care of them have been organizing for over ten years\nAnd as long as there was not so much attention but on the care of and people can usually cross the border without any problem and travel in a regular undocumented farm within Mexico and reach the United states that that's what they're right yet this is\nDifferent now because there's been so much media attention to this care than in particular\nAnd outside of the attention that Donald Trump has been giving to this caravan and so I think that places more pressure on the Mexican government to take action at the border\nBut generally people crossing the watermelon Mexican border and get in without any problem with their undocumented or not and the real detention and deportation occurs within Mexico\n... heads the Institute for women in migration an NGO base in Mexico city thank you very much for being with us Gretchen thank you\nNext week we'll be focusing on immigrants already in the U.S trying to get the education and the skills the American economy needs the big obstacles though when they tried to enter the American workforce what these immigrants face and what they could offer our series brain game next week on the world ...\nLoco I Want you to listen to something a ... it's the world's Patrick costs and when you asked me to listen to something usually there is a little test not far behind\nThis one's not really a ... I just want to listen to this tell me how much of it you understand and here's the context it's the British Parliament this week one member of parliament is also getting another question\nFrom the middle of grief and I wondered what could be done to make sure we would I Would like to hear um gosh\nI heard the word colleagues or access and northern states I think I maybe go fifty percent of the worst that's\nHis name is David Linden he is a member of the Scottish nationalists policy what\nSurprised to hear he's also from gloves go which is that part of Scotland well I think it's most difficult to make out the action because they speak very far and the MP he was addressing his famous pulled Barris but he's British although he grew up in New Zealand a long way away here is first was response\nSorry must be something to do with my background could reach the question because I didn't follow it\nIt's so he was referring to uh the right honorable gentlemen thick Scottish accent\nAnd the love that you heard in the background there was other employees who I think they were laughing because they could make out what was said even if this guy with the activity and background as he put it couldn't so as a request that Lyndon repeated the question\nObviously the opposite I Would be if I get it should be coming soon enough to find out what what can be done to me she lives with a disability a feely places I [noise]\nThese crappy job very slowly\nMostly I\nMean you get all kinds of people and all kinds of accents in the parliament how often does this happen but you know you get somebody with a thick Scottish accent who was misunderstood by somebody with a more kind of steady accent you know I've never heard it before maybe it's happened but this is made quite a few words\nIt's also reminded people of the problems with not just people from New Zealand but robots have\nUnderstanding Scottish accent Siri Alexa Google Voice they all had trouble understanding the Scottish Jackson\nSpeech recognition software has just not kept up with certain ways in which the English language is spoken that's that Google Voice or has done quite a lot of outrage and this and I think generally wins the speech recognition contest\nYeah well census rarely happens ah I'm I'm sure they'll sort it all out and parliament when they start wearing headphones to understand each other that's when we got to pay attention\nOver I like the un some exactly there was Patrick Cox thanks for this You're welcome ...\n... well not to ... to come there\nIsn't any little\nEarlier on the last ... this caller i._d. panky oh\nThere's money I'm Bonnie lies in the\n... a little money I'm asleep so and I think\nThe flu at all and I'm always in ... oh\nCome to the banking mighty will come\n...\nCame back and again I have talked last head Leonardo di di\nIt's but oh it's about how I got most of that coming up the tally cause of climate change for the military that still ahead on the world\nThe world is supported by as low business banking redesigned by entrepreneur is for entrepreneurs with digital tools to run your business including built in in voicing mobile deposits and online account set up learn more it as low\nA. C. L. O. dot com and by babble a European made language learning program babble teaches practical conversation in Spanish French German and other languages available in the app store or online at babble B a B B. E. L. dot com\nSupport comes from darn authentic Moroccan in Mediterranean cuisine specializing in ... and other delicacies in a Moroccan setting located in ... west eleven with plenty of available parking after six PM and B. Y. O. B.\n\nK. U. T. some membership drive is coming right hand man you don't have\nTo wait to make your contribution and not waiting makes a lot of sense with our early very bad shown make your contribution\nAt ten dollars a month or more ... day and you can get the new ... the public radio nerd T shirt and two of our will last day my glasses three great thank you for one generous donation to\nThe new new depend on from Katie basic K. U. T. not or right now and take a look at the new T shirt em laughing ... landed and check out this fabulous offer\nMake your investment in K. U. T. today at ten dollars a month or more to take advantage of this early bird special\nThe U.S is charged a Russian woman was conspiring to interfere with its political system the Justice Department said he again has he ever played a key financial room in a criminal backed plan to wage what it described as information warfare against America including an attempt to influence next month congressional elections\nBut he ... her opponent governing law and Justice Party says the party with appeal against an order by the European Court of justice to suspend a law that lowers the retirement age for Supreme Court judges ... described the decision that was preliminary the court also or does it mean statement to the judge has forced to retire [noise]\nThe German company ... has been ordered to recall nearly a hundred times because it's suspected of fitting the cars with software which allows them to cheat emissions tests ... denies all allegations\nUnited States and South Korea have suspended another joint military exercises to try to encourage the diplomatic process is North Korea the Pentagon said the need for further exercises would continue to be evaluated\nAnd twenty men who formed a gang raped and sexually abused girls in the north an English town of hunters field of being sentenced to prison and then most of British Pakistani heritage groom the girls some as young as a lesson in order\nTo have sex BBC News\nReport for the world comes from babble a European made language learning program babble teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at babble B. A. B. B. E. L. dot com\nAnd from Clark university's international development community environment department where students innovate solutions to global challenges like climate change hunger inequity and injustice and turn research into action learn more at Clark you dot edu slash id CD\nI'm ... and you're with the world we're co production of the b._b._c. World Service B. R. I. N. W. GBH here in Boston with all the political drama here and there may be easy to forget that us troops are still in Afghanistan\nThe top American commander their general Austin Miller himself had a very narrow escape yesterday shooting broke out during a high level meeting in the southern city of Kandahar others in the meeting were not so lucky the provincial governor was wounded his intelligence chief was killed so it was ... police chief Abdul rustic\nSearches new ... well from a decade she spent living in Kandahar\nJay's around nonprofit groups and then became an advisor to the U.S military\nI actually got to know before the fall of the Taliban in fact he was part of the gang that the U.S had designated as one of its proxies on the ground and so when I crossed the border from Pakistan into Afghanistan you know we're talking it's number nine or something like that two thousand and one I stopped\nOff in direct you know to say Hi and he\nAnd his crowd he wasn't my closest friend in that group but he and his\nCrowd gave me a bodyguard and couple of guns or with which I then drove in Kandahar\nSo what kind of men was the I mean what did you see 'em a time that you spent with Abdul Resnick\nWell as I say he wasn't my best friend and I said a bit away from him I like\nA colleague of his tribesmen and colleague of his who told me in those very early days basically what are warlords like me doing in the police we wanted\nA government after the fall of the Taliban that would be a government of rule of law I shouldn't even be in the police whereas Resnick was exactly the type of warlord who exploited his relationship with the United states\nTo carry out some pretty abusive practices and\nThere was a significant tribal rivalry on the border there there's\nA ton of commerce\nOn all kinds that cross that border and he set to work consolidating his position because of his American backing quite brutally quite abusive Lee and consolidating personal wealth and and as I say he's sort of political and military position on the border not a popular guy\nYeah I mean you're touching on ... actions that sound like a abuses of human rights\nNo kidding and even that is pretty than a pie language you're talking about a guy who would take people out into the desert and have a shot\nA when he was first brought in from the border to kind of hard to sort of take command of a big surge a general portraying hide him\nPlay this role in two thousand nine I mean it was math a suite of the countryside indiscriminate rounding up people shooting up people and then when he became chief of police I mean it was a reign of terror in the heart and so this was a guy who would have\nStayed by much of the city and in fact I communicated with general betray that there are some legal issues with the United states partnering with this guy there's a law called the lady act\nWhich prevent the United states military peculiar from partnering with military unit that are known to have committed\nSignificant abuses of human rights and it was just it was an open secret everybody knew it\nWas this one you were advising US military\nAnd I've got sent back so we're talking now two thousand nine some some eight years after I first met rustic\nI mean the the us commander general Austin Miller had a real praise for residents he said he was a patriot he said the good he did for Afghanistan will never fade away so I I mean how big a compromise was the U.S making and partnering with Resnick\nA gigantic compromise and what's so I mean I get it when someone's been killed you can't exactly you know he shame on him but um it's very distressing to me that\nIn all of the years in this conflict U.S officials and officers have not understood the basic an equation that when somebody is brutal and tested by\nBy the population that you're trying to wage the war on behalf of um\nYou know he might kill a couple of insurgents or even many insurgents but he'd be hate your is creating I don't know how many more for everyone he kills this is\nWhy we're still in the conflict in Afghanistan Seventeen years later because we haven't quite understood the basic concept that African don't like to be treated brutally in abuse\nBy government officials that are enjoying American back\nSarah Chayes lived and worked in Kandahar for ten years she's also the author of the use of state thanks very much Sara\nThanks for having me work on [noise]\nOn one side of the school cafeteria the local kids eating their lunch on the other immigrant kids forced to go home for lunch or eating nothing for two weeks that's been the situation in ... in northern Italy\nThe mayor passed a resolution the forces many children of immigrants to pay more for school lunches and Italian children same for writing the school bus\nThe resolution was supported by Italy's far right interior minister Matteo ... but he was forced to backtrack after outrage from activists and politicians on the left\n[noise] Lorenzo ... as a reporter with the guardian has been following the story so tell us more about this resolution how did it work and how much was that costs for immigrant kids\nThe council resolution signed by the mayor and all the ... parents to declare their assets in equally and their country's silver each in in order to qualify for the star the cost of meals now this is a very difficult if not impossible requests for migrants\nYou know we are dealing with refugees so often you know they come from Syria to come from Afghanistan to come from Eddie ... and they left\nEverything there I mean it's kind of\nCruel asking them their assets since they have seriously nothing and selling to provide Hassett details meant they had to pay the highest rate five here as a day or child called the school meals\nFamilies would also required to pay two hundred and ten ... child each quarter for the school bus and then you obviously could not afford to do so but talking about ... sometimes don't have a job how can afford two hundred and ten years\n[noise] so what does this mean for immigrant kids like what were the eating at lunch and how do they go to school and how do they get home\n[noise] the thing is that before signing a low the first being opposed ... she's trying to figure out the consequence of that risk of this shit and convinced they were totally aware my grandchildren will duck being forced to be separately from their classmates\nThat was his older load that prevent skied from bringing their own food from home inside that class obviously was a problem for the parents because they were forced to take their kids to school in the morning\nThan some of them were taking their kids back home for lunch and then sending them back\nSo they had to do that come forward from the house to school like three or four times a day to provide their key some food\nHow have Italians been reacting to this\nThere was a reporter for ... for many Audi MTV program for first report that the case and they went to low income from some of the seats in slow the asking them what do you think of the ...\nAnd you know while they were pretty happy with it because they proceed migrants actually invaders but things were different you know after a few days when the news got huge and ... and as I say there's so many sports that there is a dish should", "year": "2018", "show_name": "PRI's The World", "city": "Austin", "day": "19"}