{"month": "10", "state": "TX", "station": "KUT", "content": "Are taking steps forward to try to have a truthful accounting of the past uh to say on a potted unapologetically a that racial violence in state sanctioned violence is wrong and to include the names of the politicians are they called for violence and and and so\nIt it's not an easy thing to do but it's necessary um and you know there's also been a long history effort to suppress any sort of civil rights history to be taught in public schools so I remember growing up in South Texas\nAnd having you know no access to the history for civil rights I'm that took place in Texas you know I didn't learn about the civil rights movement in Texas until I went to school\nIn Providence Rhode Island two thousand miles away and and so you know what we lose when we don't teach this history is not just a an opportunity to learn from the deadly consequences of racial profiling of the criminalization of racial and ethnic minorities but we also lose an opportunity to learn\nA histories of social justice and efforts for for social justice people like ... who was a journalist and a teacher who's now receiving some public attention for her leadership and in trying to correct and end this kind of violence but also she was an advocate for\nWomen's suffrage I'm an end to labor exploitation and she wanted Mexican children American citizens have access to good public schooling\nUm and so you know I agree with the caller that these histories should be taught\nNot just the troubling parts of history but also the parts of history that can be really inspiring and I think that and as people are organizing around and police brutality today or to end the abuse of immigrants\nAnd in immigration today or we need to know the histories of people who contested this violence a hundred years ago and also said that we can expose the roots and so we talked about Hudspeth earlier\nYou know he was a U.S congressman that supported the Nineteen twenty four integration act and that that made sure that there was funds to to develop the U.S border patrol\nSo if we remember that he called for brutal policing and that he helped to to spread fear\nOf Mexicans you know a profile them is and it and beads and rapists\nAnd you know the the the the root not just of policing in Texas but also federal border policing um has deep roots in this area of violence and said that's one of the vital reasons why we need to learn from this history this think I'm Chris Boyd\nSupport comes from Griffin school or college preparatory high school focused on academic rigor and creativity with interactive classes and supportive school community tours every Thursday at nine AM details at Griffin school dot org\nSupport comes from central markets ... celebration Italian wine pasta cured meat cheese olive oil and more now through October thirty details at Central market dot com\nSupport comes from five high marketing and Austin based from providing social media and online reputation management with strategies tailored to the specific needs of small to medium sized businesses details on line at five high marketing dot com\nAnd you are listening to think on K U T Ninety point five in the middle of day one\nOf the shortest membership membership Dr ever in the history of K. U. T. and you can help us make it even shorter all you have to do is go to K. U. T. dot org\nClick the donate button and help us provide you with the broad rich culturally interesting a historical perspectives that only come on this station through programs like fake with Chris boy\nI'm joined by trade shower afternoon producer for all things considered here on K. U. T. and frequent host you've heard his voice before good afternoon tree good afternoon\nJimmy it's uh it'd be back a there is some news to produce today as you may have heard and we'll be getting back to that straight away but not before reminding you that\nThis is a good time to show your support for what we're doing on duty and if you get in on it on the first day then you can get back to the rest of the membership driving knowing that you've done your apart and you can do it by going into ... D dot org\nI'm prescribed and lived in Austin since Nineteen Ninety four\nSo I'm almost in Idaho I grew up in Long Beach and Los Angeles\nAnd I listen to NPR while I was their first thing I did and when I moved to Austin back in Ninety four was try and find the NPR station and I discovered Katie it's been\nPretty much all I listen to you know I've got two or three other stations on my car and I never never go there because if I Do switch over its commercial and I go right back to ... so this is this is what I was all day long\nYou don't know what it is I'm In advertising and I hate radio commercials and I write rated commercial I produced radio commercials but I don't want to listen to somebody else's so [laughter] when I listen to the radio it's gotta be Katie because\nYou come to Katie and it just continues can't get anywhere else it's fantastic I mean I learned so much about the universe by listening to radio [noise] so they they told me I shouldn't do a hard sell but I'm an advertising ...\nYou're listening to the station because it's probably the best stuff you've ever listened to and you're you're learning you're having fun you're enjoying it and you're catching what's going on in Austin so support for you to get so it's the best investment you can make [noise]\nAnd you can be like Chris and go to K. U. T. dot org and become our newest member on the first day of the shortest Dr ever today all you have to do is go to K. U. T. dot org and click donate and uh you know he raises a valid point this is the one\nTime we do it every six months or so and\nWe will take as long in to do one ... one membership a period like one announcement this is what I'm doing right now will take this period of time this is as long as commercial stations take every twenty minutes for their commercial breaks so\nYou're not losing out by um you know by listening to us for I Know membership drives are not necessarily like listener friendly to what you normally used to but I think about it other commercial stations they do this all the time to you\nYeah it's a little different from what you hear every day uh here on K U G but it's necessary and uh we want to make the point that we can't do it without listener support such as what we get from Linda trend news says she's an avid NPR\nK. U. T. self professed junkie and greatly appreciate what we do here and that's why she's showing her support and we asked you to do the same by going to do that on\nYour love of knowledge and discoveries why we worked so hard to give you facts and insightful clear\nAh hopefully creative way and that's why we bring you different different shows are coming up on the world here to a one and we try to do things a little differently here than you will get elsewhere give us a tell us how much that's worth to you go to K. U. T. dot org today\nThe corporation for public broadcasting was formed almost two years ago as a part of the public broadcasting active Nineteen sixty seven today it provides seed money with strings attached\nOr the fourteen hundred public radio and television stations across the country the PBA dollars must be spent on local and national programming and community outrage this fiscal year KU Timor Sea of about five percent of its funding from the CPB there's always a certain amount of political discussion on ...\nThey're not to continue federal funding for public broadcasting but what it really comes down to has been the most dependable and double source of funding for Katie is now and always will be from people just like you to keep public media in central Texas strong it's important\nThat listeners who depend on K. U. T. contribute your investments today is the best way to ensure the future for the kinds of smart journalism you depend on\nEvery day from KU team and NPR\nMake the decision right now to invest in fact based news and information you give safely and securely and K. U. T. dot org [noise]\nOr call five one to four seven one six to\nNine one and I know as much as we thank you man as\nMuch as we appreciate the support from all the listeners like you we don't want it just to be the listeners like you we want support from you who's listening right now we couldn't do it without the large numbers of small contributions\nAnd are we really appreciate those sustaining memberships you'd I mentioned or you can make your pledge now in ... that the rest of the drive us a standing member you could\nDo that all year long considered becoming\nOur newest sustaining member by going to UT dot\nORG and if you do so at ten dollars a month or more\nYou will send you one of our uh early bird special packages which will include a T shirt of your choice and to not one but two of our brand new plastic tumblers that you can pour the beverage of choice in when you receive them and you'll receive them\nUnbroken because they are plastic so uh we will not be dealing with that are all you have to do go to K. U. T. dot or become a new member today on the first day of our short us Dr ever just a reminder Austin water is issued a citywide boil boil water notice for all customers as the utility works to stabilize\nWater treatment system customers are asked to boil water for drinking cooking ice or water for pets to a vigorous boil for three minutes before\nCan sue me we do have a slight chance of rain today otherwise grey skies through the rest of the afternoon to all one\nAnd Emily your plans for covering this march in the coming days staying on the road up to the U.S border [noise]\nI think that I'm going to go home at some point I mean I was on the road yesterday and the ... sign and\nAnd you have to imagine I'm thirty five I'm In shape and it was too much for me I really felt fate\nAnd it was so impressive and astonishing to me I mean these kids were moving forward putting one foot in front of the other that to say they are a lot younger than I Am and I think I'm going to go home and rest and meet up with him again a little later on\nThat really puts things in perspective Emily Green on the ground and Mexico with this very long line of marchers coming up from Honduras and Guatemala to the U.S border Emily thanks so much again [noise]\nNo problem thank you\nAnd before we move on one quick note about the language being used to describe the thousands of people making that trip north from Central America over the weekend the Associated Press published a tweet that called the group an army\nThe ac was called up for using that word\nCritics argued at mischaracterized migrants and played into the hands of people who use certain words to stoke fears about immigrants the AP apologized saying the word was poorly chosen and has been removed from its coverage of the caravan which leads me to that other word used to describe this extraordinary tracked north\nBut as many as seven thousand people President Trump among many others has repeatedly used caravans this past weekend with other marches north\nOver the years though the word caravan has taken on a tinge of the exotic\nMaybe because of its use in popular culture throughout the twentieth century [noise]\nYou know [noise]\n[noise] [noise]\nTake gypsy woman by the impressions or Duke Ellington soon caravans some nearby Ella Fitzgerald\nAnd he\nHas a cat\nSo how appropriate is using the word caravan to describe migrants hoping to reach the U. S. we turn to one dictionary which informs us that caravan comes from fifteenth century Persian the principal definition according to Merriam Webster's is a company of travelers journey in together through desert or hostile regions\nWhich does come pretty close to describing what that group of thousands of people from Central America is trying to do right now\nAnd it's where the midterms coming up in a couple of weeks the Republicans control fifty won seats in the Senate there are several close races that could kill power to Democrats question how much of President Trump's terrorists swing voters this year we asked the world's Jason Margolis to see how this is playing out\nIn tendencies Senate race Tennessee voters haven't Senate Democrat to the Senate since they reelected Al Gore back in Nineteen Ninety [noise]\nIn two thousand and sixteen Donald Trump carried the state by twenty six percentage points but this fall the tendency Senate race is very tight Republican Senator Bob Corker is stepping down the Democrat looking to grab his seat is a popular former governor Phil Bredesen\nIn this campaign spot Bredesen is speaking from inside a tendency whiskey distilleries\nPresident Trump's opposes something good for Tennessee with um [noise] that's why I'm fine with us and British North Korea trying\nBut if he proposes something the fantasy element motion and these new tariffs will earning may hurt our auto industry\nAre farmers Tennessee one gang name in Mexico\nChina Canada and the European Union all imposed tariffs on us whiskey exports in retaliation for President Trump's steel and aluminum tariffs that's gotta be painful but whiskey distillers but when I reached out to the whiskey folks they said they didn't want to speak about tariffs\nSeveral small businesses that filed complaints with US government about President Trump's tariffs also politely declined interview requests frankly I was a bit surprised Steven Livingston wasn't he's the associate director of the business and economic Research Center at middle Tennessee State University\nWell I I'm actually encounter the same thing when I first started um I Would call these companies up and uh I got some response so you did\nAnd as far as I can tell it's just they're worried about the competition learning something about them\nOr maybe tariffs just aren't that important to Tennessee voters for consumers the impacts from tariffs haven't really been felt yet the latest round of tit for tat tariffs with China just took effect in late September\nJust think it's too early\nAnd I'm a lot smarter retailers bought like crazy in anticipation of it so I don't think the average person um has felt much yet because a lot of businesses haven't really had to raise prices yet and so right now I think it's mostly a symbolic things\nA lot of voters but not for everyone Tennessee farms that export to China and businesses that rely on steel and aluminum imports are being squeezed right now\nWe are as scoring on with the Washington newsletter inside elections has looked into the impact of tariffs on voters she says a lot of farmers and small businesses in rural red states are concerned but they're heating the president's advice for opening up markets\nJust be a little patience from what we're hearing that kind of trust that on the negotiations from these tariffs will end up\nHelping the people who supported Trump so I think that there's a level of trust in the president from his supporters from these kind of helping them get over some of their skepticism about these cats\nAnd ... adds a terrorist or just one of many issues voters are considering and frankly not the big one she says Democrats across the country are running on protecting healthcare and Republicans\nRepublicans think it's at the idea that Nancy Pelosi and Chuck Schumer could be leaders and Republicans keep pushing and that a voters could end up ...\nHad a recent debate in Tennessee that's pretty much what the Republican Senate candidate Marsha Blackburn said over and over about her opponent\nChuck Schumer has bought and paid for his campaign he wouldn't take does tax cuts away learning\nCurrent congresswoman from Tennessee and a familiar face on Fox News the two candidates Blackburn and British inspired to pretty much everything during the debate except this point\nThe tariffs we're right now I'm hurting Tennessee badly of their job killing Jackson, Tennessee I Hope\nWe get these terrorists over and done with the ... they are not good for tendency\nSo if you were a soybean or hog farmer watching the debate\nThere's not going to be a big difference ... farmers think in terms of both of their responses on the same so\nSets Lee Maddox with the Tennessee Farm Bureau federation says make no mistake restoring open trade is vital for tendency farmers but he doesn't see things changing if the state sent a Democrat or Republican to the center\nSo I think the message or especially on trade is uh to the administration on both sides of the ... let's get something done you know are farmers\nStill even if one senator from Tennessee camp and the trade war a vote for a Democrat in deep red Tennessee would be a strong symbolic rejection of President Trump's overall agenda [noise]\nIn Tennessee recently President Trump said a vote for Marsha Blackburn is really a vote for me and everything we stand for for the world I'm Jason mobile [noise]\n[noise]\n[noise]\nThe world is supported by as low dedicated to helping\nEntrepreneurs and freelancers by offering business banking that is designed to be accessible and straightforward with built in in voicing\nMobile deposits and online account set up learn more as a C. L. O. dot com as like babble European made language learning program travel teaches practical conversation in Spanish French German and other languages available in the app store or online that's Apple's\nB a B B. L. dot com [noise]\nSupport comes from Potter Potter way of all seven Harry Potter books in Seventy comedy pacman\nA performances with a live matches November through Eighteen the paramount\nIn theater died or\nSupport comes from sales for their forces central because of the Ahram to build more small businesses and start to learn more about sales force essential sales force dot com slash essential [noise]\nYou're listening to the world on king Eugene Ninety point five it as being one of\nMembership Dr ever and if you would like to take part we're\nHaving the next twelve hundred dollars matched\nPatricia Monti and she'll be matching the next twelve hundred dollars in donations all the money raised during the membership drives those directly toward paying for the program [noise]\nDo you love and enjoy\nThe ... member go to Katie\nSo if you go now to Katie dot org your ten dollars becomes twenty dollars a month and\nIf you get ten dollars if you pledge ten dollars or more a month you can take part in our early bird special\n... membership drive is under way so you only have a few hours last name to grab our early birds national\nMake your contribution of ten dollars a month or more than ...\nMidnight and you can get the news came to the public radio nurturing Jean shirt and ... plastic my\nWeek rate thank you give\nOne generous donations for the market news you depend on for gay you visit Kay Eugene data orange right now take a look at the new T shirt and plastic find slash and check out this fabulous on your investment in K. U. T. by midnight tonight\nTen dollars a month or more did take advantage of our early bird special [noise]\nYou can become our newest member on the first day of the shore to strive ever even our announcements or even shorter we're trying to give you more of the news and information you love during the membership drives so\nHelp us out by going to K. U. T. dot org while we're not asking you and ah get your dollar matched dollar for dollar so ten dollars becomes Twenty one hundred becomes two hundred and whatever level you feel like giving that even if it's two dollars any little bit helps go to K. U. T. dot ORG and click donate today as always thanks\nFor the world comes from babble like European made language learning program babble teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nMark a woman and you're with the world we're co production of the b._b._c. World Service P. R. I. N. W. GBH in Boston when it big storm like Florence or Michael hits the U. S. we hear about it we hear about places like the southeast and Puerto Rico we hear how many of our big coastal cities are vulnerable to the growing impacts of climate change\nBut when a big storm hits a tiny American town like ... Alaska quite often their silence\n... is a speck of a place in a part of the country most of us rarely think about but what happens in ... as climate change warms up the Arctic is a window into our future and it's also a glimpse into how the U.S is responding right now and the challenges of climate change\nOn the world we're taking a close look at communities confronting the effects of climate change all around the Arctic is part of our partnership with the podcast and radio program threshold today threshold\nHosting creator Amy Martin brings us to the shores of the bearing straight in northwestern Alaska\n[noise]\nIt's a summer night in ... Alaska and the kids are on the loose [noise]\nAre you on the bag how's your day there [laughter]\nWhat are you guys are paying her eye around this is Walter night\nHe's eight years old [noise]\nAs much\nAs ... as a small town on a barrier island just shy of the Arctic Circle about six hundred people live here there's a church school to stores and around a hundred and fifty houses\nThis island is tiny in kids here are pretty free to roam tonight they seemed to have fun hideously gathered in a wide spot between some houses to chase each other around in the sand\nWhat's your favorite thing about living in Israel it's fun why is it fun\nA lot of kids and you know yeah\nPromoters point of view ... as a kind of paradise but the paradox of this place is that it might be one of the safest and one of the most dangerous places to live in America today because this small community is ground zero for climate change in the Arctic [noise]\nJust north of just north of the bearing straight it's the only town on Sarah chef island and everywhere you go you can see the waves\nAnd hear the constant roar of the ocean island is only about a quarter mile wide and it's getting smaller it's changed a lot this is Kate Koch young she grew up in ...\nAnd now teaches kindergarten here she says in decades past the C I served as a kind of buffer for the island and protecting it from the wind and waves when winter storms flew in\nIt was always frozen like the end of October it no longer is\nThese days the ISIS forming later and later in ways that used to break far away from shore now slam directly in an island not the same time the permafrost is fine weakening the foundation beneath the town the combined effect is it quickly receding coastline\nWe did lose a lot of land like where's the seawall is now that's where we used to have our playground so all of that has gone\nKate has lots of memories of places that are now under water\nWell if you go down like that way that's where like ten to Fifteen houses were and like the last house it's there now there is a house next to it a road and then another house if you actually like visual life that you can see how much land was lost their\n... lost a lot of land in a storm in Nineteen Ninety seven and then again in two thousand five people gathered in the windy darkness to get the residents out and save as many of their belongings as possible after that two thousand five stormed the U.S Army Corps of engineers built a new stronger seawall\nYeah and if it wasn't for the seawall probably more would have been taken away and had they not move the houses they probably would just fallen and\nBut the seawall it's just a small in temporary fix without the barrier of the ice eventually the ocean is going to wash this island a way\nThat people have ... no they're not safe here and two years ago they voted to move the village to the mainland\nIn fact the community has actually voted to relocate three times in twenty sixteen in two thousand two and way back in Nineteen Seventy three people in ... we're worried about erosion even then but at that time no one knew how much climate change would accelerate the erosion process\nAccording to one study between two thousand three and two thousand fourteen Sarah chef island lost an average of seven and a half feet of land to erosion each year\nAnd when major storms though in the residents have nowhere to run ... is not connected to any road and in a raging storm planes or boats would have a very hard time getting here as the island shrinks and the sea ice recedes the risks steadily rise\nAny one of these monsters storms could come spinning off the ... and ... and over wash her village\nThis is Joel climate he's a scientist and policy analyst who used to work at the U.S department of the interior\nThey don't have any way to get out of harm's way right now so they're and they're in a tough spot in the fall when the storm season storm season is expanding I'm at the top level thing I worry about\nClimate was one of the people leading the federal government's effort to help shift rough and other coastal Alaskan communities under the Obama administration when he was hired and twenty ten the federal government had already issued two reports describing the threat to these villages in no uncertain terms\nAnd uh that said you know these thirty plus villages are in trouble and are going to need some of the judge and\nThese reports said the communities were in quote imminent danger and ... was one of the places on the top of the list\nNow at this point you might be asking yourself why ... in such a precarious spot to begin with\nI heard something to the fact of these dumb Eskimos why did they why did they build their community hung on barrier art and this is Kelly ending walk the factors matter because the church and the fear of a new they're very school\nIs bill ... heads the ... circuit polar council and Alaska based in Anchorage she grew up in ... and she says until a hundred years or so ago there was no permanent village on Sarah chef island her ancestors lived all along this part of the coast and they use the island frequently but they didn't live here year round\nAnd that's the thing that they were kind of semi nomadic um we didn't have permanent settlements and that sort of thing\nBut all of that changed in the early Nineteen hundreds when the U.S government and the Lutheran Church came to coastal Alaska and build churches and schools it was an extension of the colonization process that had already swept through the lower forty eight states\nAlaska Native people were told they had to send their kids to the new schools or risk having them taken away over time the population of this part of the coast concentrated on Sarah chap island\nSo this thing called development committed these people to a spot which turns out to be directly in harm's way\nWorse case scenario of course is a storm comes at it and forces them off that land um this year\nThat's still climate again at the Interior Department he set out to get federal agencies to help protect people in coastal Alaska from the threats of rapid climate change\n... and other towns were already engaged in planning your own solutions but the sticking point was money moving a whole town is a complicated inexpensive affair one federal study pay the cost of living ... a hundred and Seventy nine million dollars\nAnd ... doesn't have that kind of money they don't have any kind of money actually forty percent of people live below the poverty line many homes don't have running water but Congress was not supportive of helping them make the move many members weren't and still aren't willing to accept that human caused climate change is even real", "year": "2018", "show_name": "PRI's The World", "city": "Austin", "day": "22"}