{"month": "10", "state": "GA", "station": "WTKS", "content": "Is ... director for the upcoming a G. S. s\nS. match which is going to be hold of the highways Seventeen cells run and gun club in Richmond Hill really in November the actual match dates has been expanded from two days just three days that will be November ninth tenth eleventh which I Believe is or friday\nSaturday and Sunday mhm it is it is you know ... yeah any good to have you with us bad to be here All right\nSo what what is this what does this all about any tell us about this event and who can qualify and that sort of thing\nSo this is the glock sport shooting foundation pistol match it say\nPublic match open to anybody put on by a glock it's for a glock pistols only of course a great beginner match for people to come out and test their skills are with speed and accuracy with their pistols\nIt's perfect for amateurs and procedures like uh all skill ranges are representing and the great thing is we give away a lot of guns in cash at this well\nNow you're talking yeah I Do go yeah you can uh you can wind guns or ...\nPerformance or random drawing ... ... probably twenty to twenty five percent of the participants ah come away with something\nI've got a surprising blocks the only one that does this well it doesn't surprise me they've been very shrewd says there in the ... and ... on their marketing program ah initially when they first started showing up would have been in the uh\nWhat are both ... go\nRound the mid eighties they marketed pretty much just loosely the Warren force in figuring that if they could get the law enforcement markets civilians would want to carry what law enforcement regarded as the ... site on our ... and for Thirty years frankly has been Gluck\nMhm uh just itchy awesomely reliable weapons when our number one solar since I open the store twelve years ago\nAnd a simplicity is the name of the game with them\nThey also blue she leaves to reliability Gluck so I Do behind the pistol was that the department armor\nAnd a law enforcement agency would be able to repair\nMaintain and keep their gun clean and you wouldn't need to have a gun Smith are working on it or to to hand sit parts the is apart or wrote\nAnd that's what happens to two tools over the years apart so we're wrote from use them just throw the part of the way and popping another part in and you'd ... again ...\nYou know it's interesting a decade even even think of the some of those military services finally get washed up on some of their equipment\nYou know they used to have specialized ... stuff to repair radios or whatever then they started designing them so that you could buy that stuff right out of the stores open ship goes into dock and they can go there could have gone with radio shack at the time but they could go somewhere some electronic store and get the part that they would at least work until they got the real\nBarley absolutely yeah or the kiss principle you know simple yep absolutely we liked that Andy was struck a boat um how these matches or shut up because they're on different\nDivisions in different different categories you do a a journal mansion tree and then you pick the divisions that you want to shoot in and there's a fee I think for each division yeah not block for shooting foundation membership is brokers it to a shooting in the match correct the membership to the\nGlock sport shooting foundation is thirty five dollars annually\nUm they've got discounted rates for buying multi year memberships as well as what the multi year memberships and then after you get your renewal you can actually as a civilian get one certificate from blue label a military law enforcement discounted rate glock each year low so that's about a hundred dollar savings off of normal sticker price\nStill pretty much I actually if they're showing you know it was going to them as our be looking almost two hundred dollar savings right\nIt's a good deal the divisions each division as a thirty dollar entry fee at the different divisions depend on what model of gun you have so there's a division for every block model made\nNo matter what you own there someplace to shoot at the\nDo you want to run through the leader of um let's\nRun through the Lucille the first there's a amateur guardian and amateur civilians if you're in law enforcement or the military\nMilitary or other public service firefighters qualify for guardian as well for first responders yes\nThat would be amateur guardian and then you also with amateur civilian and in both of those categories you are essentially required to shoot pretty much a stock glock pistol very limited uh upgrades or customizing can be done to them\nThat is correct the only models that are not going to be legal in that division or you're single stacked models and then your competition models like you're thirty four thirty five and Seventeen out to any other glock model qualifies\nAs you mentioned they do need to be stock\nThere are some permissible modifications allowed you can put any\nAfter market site on as long as it's a standard notch in post type site things I could go to string site or optical sites and not legal in that division um you cannot make any modifications permanent modification to the frame such a sibling but you can use grip tapered gripped sleeves\nThen ... year old\nOkay then we'd come to a master stocks or if you have been categorized as a master class shooter and then the other shooting discipline or if you've won you were a lot of ... as if matches you know shoot in a master stock category\nThat is correct and the same rules apply and the same guns are legal in that division as\nThe amateur divisions it's just made for the masters but amateurs can still enter a master vision but a master cannot enter an amateur division\nYou know I Do in fact when I was back in the old for and I started shooting the glock batches in an attempt to get master class status which I finally did um I Would shoot as an amateur and master class just to be able to be competitive in that a course of fire and get more experience shooting\nAbsolutely and it's also another opportunity to win a free pistol\nUp if you have a little a against the campus at up he'll ... Andy met you use the term some ... that are the public may not be aware of is that you you could not use a gun that's got to do that you can't use the ...\nYou know that definitely that's when you actually do a process that melts the frame but puts a texture on it they don't answer your grip okay\nAll right I I have a feeling that's what it was but I don't want to make sure people are they are and that is still playing S. T. I. P. P. L. I. N.\nG. O. we've got a local ah the gun Smith ... remain\nNameless that seems to think is stumbling as T. I. M. P. L. I. N. G. as it is to play okay good um let's go to the other categories there's heavy metal category\nYes heavy metal category is for all ah ten millimeter and forty five caliber models think size full size or you can use the sub compact you just cannot use the single stacked version [noise] okay um sub compact subcontractors all your\nYour pocket and guns are not pocket ... your ... locks on twenty twenty six twenty seven\nEight seven and then we have a major sub compact\nSo the major sub compact division was based around the clock model thirty six when it came out it was a single stacked forty five because a round count of it being the narrower magazine\nIt can't compete in the other division so they can create a separate division for it but then they allow you to shoot the model twenty nine thirty in it as well just downloaded to the seven round magazine capacity\nThere we go and we then have competition division\nThe competition division has any\nDouble stack gun basically anything but the single stacks you can use your lungs slide Seventeen al or you're thirty four competition ready guns those are all legal in division you are also allowed to run the like the seventeenth the model the compensated want as long as it's the factory compensated barrel not an after market\nOkay and then we come to the U.S PSA fans favorite the unlimited category where just about any kind of a race gun goes\nAbsolutely this is where you see the guys spend way too much money on a gun that sometimes works and sometimes does [laughter] I mean I Know I've dumped a lot of money in the mind [laughter]\nI remember a match years ago um that ah at the old ah so these and firearms in range\nAh we're a I won't mention the fellow who was running the match\n'em but he went out and spend close to five thousand dollars on a race gone [noise] and I bought a sixteen a ... tricky trigger\nA pressure on it and uh he was going to start to match off on the first days be the first shooter draws a pistol and before you even go to the forty five degrees away from his feet the gun when\nBang [laughter] and put a bullet hole between is too big toes now matched disqualification going home already\nYeah that was embarrassing to say the least and we have a couple a limited uh uh divisions there's a park and walk on the glove girls the vision\nYeah so the pocket clock division is made for the model forty to forty three single stacks three eighty nine millimeter", "year": "2018", "show_name": "AM Savannah", "city": "Savannah", "day": "27"}