{"month": "10", "state": "NY", "station": "WAMC", "content": "Weekends through October twenty eight that despite little theaters Saratoga state park\nHomemade theater data work and from the lake George Land conservancy button lending New York celebrating Thirty years of protecting the land that protects the lake offering more than thirty five miles of trails for hiking burning and outdoor exploration L. O. G. L. C. dot org [noise]\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany double your UNH the ... point nine Kingston double your storage de Ninety One seven middle John WGLA Judy Ninety One nine Plattsburgh WC again a Ninety three three kinda G Harry WAMC HD one of those ... WAMC ...\nFive one grade Barrington WWE S. H. D. eighty eight nine mount Kisco W. A. N. D. H. D. one Stanford W a an art idiot\nFive Brewster WAMC um fourteen hundred Albany [noise]\n\n\n\n[noise]\n\nWe\n\nSupport the Grateful Dead our come to this week from the Capitol theater in Port Chester New York jets though let out orders for musical blows up all the cap on Saturday November third [laughter]\nGet the let out as a group of passionate professional musicians or capture the essence of Zeppelin and of course every Wednesday is grateful that night uh Garcia's events information and ticketing up to Capitol theater dot com [noise]\nThe cap is also announced a second show by popular demand with ... friends on Thursday December twenty seven with Melvin Seals Eric ... John capitalistic Jay laying Jennifer ... and ... hotel in friends with the cap December twenty\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog horn is it that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nEric his top ten chocolate tears by pastry arts and design slowly builds award winning creations include the eighty percent dark star bars Seventy percent rambling rows and more made by heads for heads L. I. L. L. I. E. B. E. L. L. E. farms ... [noise]\n[noise]\n\nRight to be blind you don't go on\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope poll dog her name is that do to make it easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com\nThat they're trying to live in a long time\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com really\nGoing on my nerves right in\nYour mouth\nStreaming support for WAMC comes from my dog hardest dot com or no joke no pope dog hornets invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com oh\nThe boys ...\nNo\nWe're not\nGoing to do the ...\nYou know we're all going\nIt there on the lower [noise]\nStreaming support for WAMC comes from my dog hardest dot com no joke no pope dog hornets invented to make walks easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog with love thousands of reviews at my dog Curtis dot com oh no no\nStreaming support for WAMC comes from my dog hardest dot com no joke nope poll dog hornets invented to make walked easier for both dogs and their humid crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog Curtis dot com\nOut side\nThey will\nTo call you sold and really no\nHe's not\n\nStreaming support for WAMC comes from my dog hardest dot com no joke nope who don't harden it did to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog Curtis dot com right\nTime to do\nSaw the\n\nGod oh\nMan you know a little\nStreaming support for WAMC comes from my dog hardest dot com I no joke nope dog hard it is that just to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to talk walk your dog would love that is the reviews at my dog ... dot com\nAnd I mean [noise]", "show_name": "Grateful Dead Hour", "year": "2018", "city": "Albany", "day": "22"}