{"month": "11", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on kj Da Nang point five ... Ninety point one K. J. D. K Ninety quaint salmon king went\nTo sign up to these issues come too late to start a new kind of got an afternoon about two thirty\nJoined ... Saturdays or to the DMV following very barbed Prescott ballot\nSupport for the Arizona community radio network is provided by\nChoice hotels when traveling on interstate forty Jews quality in Flagstaff particularly built it off for it merge right or does that go up the driveway on the hill to quality encumbered at ... I forget I Seventeen you're in a new reservations at seven seven for eight seven seven one\nDinner you're reliable source for local news and sports Ninety One point three FM Flagstaff months park\n[noise]\nComes from the ancient festival\nThe beginning of the Celtic new year on the first to November\n... believes the spirits of\nThe dead wood go wandering on the eve of the new year\nWhen the gap between the worlds in the living in the dead was added\nIn Ireland on the eve of the new year all the home fires were extinguished and then ... with flames Kendall by drew it John a sacred hill\nThe ancient Celtic would put a candle in the school of the the edited enemy but fortunately this practice was replaced eventually by a candle in a whole load I'll turn up set in the window to light the way for the recently departed spirits of family members\nIn the new world people Celtic dissent discovered the pumpkins weren't even better\nAnd us we have Jack o' lanterns\nA term first used in Eighteen thirty seven and associated with Halloween and the U.S since Eighteen sixty six of course the way we got the bunk and still carries the suggestion up a school in Europe the Catholic Church took over the pagan holiday in the year nine Ninety eight\nMaking November second the festival of all sold\nNovember first all Hallows day\nAnd the night of October thirty first all Hallows eve which has been Jordan over the years to Halloween\nThis week's program is selling celebration with music ranging from children's songs to more serious ballads about fairies and ghostly operations and some downright spooky instrumental\nThe opening finger is David ... from Northern Ireland with two traditional Irish children's songs my aunt Jane and fair Rosa\nMay and June and she took me in the early and I know each new top three of them said don't release shop but nobody ... top three of them said the release John\nKnow my son and I did they learn the bill or might not do\nIsn't the the ...\nNa\nNa was\nA child or a really high end up there on a one\nNa na na\nNa na na na na\nNa na na na\nNa na na na\nNa na hey\nAnd all around I Am\nThan ... than a white\nWhite on white crime\nKnow and I have my\nNa na na na\nNo\nWas only ...\nGang bringing their mom or\nAny thing do you make a wrong one might be there\nUm he goes down and you\nAnd me and my mind you\nYou may help here well\nWe hope they will\nFor a long time yeah there was no no no we didn't know K ...\nWorry any good thing to make mine for bomb the Ryan\nI'm now lane Mary Kay nice young\nThey might as\nWell I'm getting\nMe and said you\nKnow you can't you can't you know\n\nKnow take me hey\nSharing things you know when right when you were well ray Martin hum\nSo uh\nUh\nThat you know the\n\nLabor law would\nRule as we\nCall\n\nThe\n...\nHe was put together\nDe early in the last\n... ...\nWould choose\nThey\nIn a\nNew look\n\n\nA\nLot more able to\n\n\nI live in\n\nInformation about this week the knees and they'll be ... with the end of our website and I don't think connections radio dot O. R. G. jumping connections is produced by double us how you have to have a broadcasting service southern Illinois university at Carbondale\nYour to the radio thirty twenty eight year in Yuma and border radio easy daughter we also broadcast on the hour we're going to community radio network\nThis is killed their connection I'm Brian Kosovo grow with a salad and celebration here's a twenty eight the recording of child ballot number two the open night so I'm here by normal Waterston and her daughter Eliza ... oh\n\nDo the long run\nHe in a way I\nI'm not in in St Louis ... by\n... by any other way and then the\nYou know and I remember the needle on\nBy the way\nTo me and I'm trying\nBuy a away and\n\nYou don't\nThen I may I mean\nKnow nothing\nNa na\nNa\nNa\nNa na na na na\nWhen I\nWhen\nRight\nNow man I\nKnow na\nNa na na I\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\nOh\nNo no\nWell\nI\nKnow how\n\nLong\nHow long did you\nSee my no ...\nGod\n\nNa\nThe\n\n\n[noise]\nNa na\n\n\n\n\nNa\n\nNa na\nNa na\n\n\nNa\nNa\n\nNa na\nNa na na\nNa\n\nNa\n\nNa na\n\nNa na\nNa\nNa na\n\nNa\n\n\n\n\n[noise]\n\nMary Black with a Nineteen eighty four recording of she moved through the fair taken from a poem by Patrick Kavanaugh piper was Peter Brown and the sitar player which I read through all\n\n", "year": "2018", "show_name": "Celtic Connections", "city": "Kingman", "day": "01"}