{"month": "10", "state": "SC", "station": "WLTR", "content": "Monday morning at nine\nOut a little flavor she'll watch our which the Madison soundscape South Carolina Public Radio's lied and locally produced classical music program weekdays at eleven\nYou're listening to South Carolina public radio W S C I F ... Charleston in eighty nine point three and H. one B. E. T. R. green tea\nOh you are listening to South Carolina public radio W S C I F F Charleston in eighty nine point three an HD one don't even eat PR Greenville in Ninety One and WNPR Columbia at Ninety One point three [noise]\nTime once again for Caroline alive feature in classical music performance is recorded at concerts settings across the Carolinas on this program we hear from one of the gems of the north Carolina foothills\nThe western Piedmont symphony based in Hickory North Carolina the orchestra returns to Carolina live with an all Beethoven concert titled look big van is the man you'll hear the master composers overture to the creatures of for me the U.S the symphony number four and B flat major\nAnd the violin concerto in the major with guest violent is Marjorie badly you'll hear clearly what Beethoven is indeed the man\nI'm Lauren Rico and the chairman of the creatures of ... the U.S is one of those pieces from a larger work that has become a standalone favorite on its own\nThe creatures of ... is a ballet composed and Eighteen oh one by Beethoven it premiered in March of that year in Vienna and was given twenty eight performances it's the only full length ballet by Beethoven according to music colleges Lewis lock\nWould Beethoven's music for the family is easier and lighter than music for the concert hall it shows Beethoven exploiting instruments and colorful or cash from affects that was never hear of his symphonies are serious dramatic overtures [noise] there's the overture with respect to music director and conductor John\nGordon Ross leading the western ...\nFacts that we never hear in his symphonies are serious dramatic overtures here's the overture with respect to music director and conductor John ... runs leading the western Piedmont symphony on Caroline alive [noise]\n\n\n\nThe\n\nWhat what what\nDo\nRight\n[noise]\nOpening it all Beethoven concert titled lose big band is the man that was the overture to the creatures from John Gordon Bronx with the conductor\nAnd that provided a strong beginning to the February two thousand Seventeen event at P. E. Monroe auditorium on the campus of ... college in Hickory North Carolina\nNext we have one of the great symphonic creations from the master of the symphony demand lewd vague van ... symphony number four B flat major too often overlooked the fourth symphonies frequently overshadowed by Beethoven's more dynamic third and fifth symphonies\nFollowing the monumental Rosa and chronology but not in style the fourth was deemed closer to the more classical first to symphonies in the estimation of contemporaries\nBeethoven wrote the piece during the late summer a stay at the palace of ... ... to them to work with the eventually dedicated\nThe word premiered at a private concert at the luck of its palace in Vienna along with the first performance of the fourth piano concerto\nNo not much was written about peace after its premier contemporaries celebrated it the relative neglect of the work however began in Beethoven's own time\nBeethoven's fourth is the least known and performed of all of his symphonies of course one of the nine has to be and would probably turn up even less were it not for the sake of its presence on recordings and in performances such as the western Piedmont symphony now provide to [noise]\n\nMm\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\nWell\nUh\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nMy name is Dr John Gordon Ross Beethoven symphony number four and be flattening chair and you hear the same thing in performance it's often difficult to understand why it has been the parents to clean this like you know [noise] but it certainly sounded flight excise the evening if it sounds really\nWell take a short time now like Caroline alive but we'll be back with another major work by Beethoven stay right here\nLive as a production of double duty a classical Public Radio's services Davidson College in Davidson North Carolina\nAnd South Carolina public radio W. E. P. R. and I point one in Greenville WNPR Ninety One forty three and Colombia and W. sci eighty nine point three in Charleston the executive producers are cherry Hutchinson for South Carolina Public radio and Frank demeaned guys for WD Avi\nTemperatures and manages the capital any live Web sites and we'd get valuable production help from John ... South Carolina public radio if you'd like to use the program again or missed part of it the audio is archivist\nBut you will production help for John ... South Carolina public radio if you'd like to the program again or missed part of the audio is archived at our website classical public radio dot org I might because the programs producer\nCaroline alive as presented by North Carolina with orthopedic offices throughout the region\nFeaturing comprehensive orthopedic care in the area is a foot and shoulder elbow and spy as well as sports medicine and pediatrics additional services include physical therapy MRI and post surgical support\nYou improved information or South Carolina dot com Caroline alive is also made possible by gifts to the W ... future campaign contributors including the Jane cook brand music education fund and the state of Sandra Mick peak Patricia Cain\nReverend and Mrs Jones emails and your brain I'm Lauren Rico thanks for listening to Carolina line from public radio [noise]\n\n\n\nETV commission meets regularly inspections open to the public for information on schedule meetings go to the amount of data but as the ETV dumped or in print ETV\nBut you to be commissioned ... open to the public for information on schedule meetings ... but she TV dot org and British ETV commission\nOn cruise the host of live from here are sometimes raucous sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags truck full of music and comedy for a long time favorites to new discoveries you didn't even know what you were looking for I Hope you'll join me this weekend for killer show with comedians talk Barry ... Diana Gordon and the one the only Jeff Tweedy turn on tune in and ... [noise]\nThis morning at ten\n[noise]\nMm [noise] you're listening to South Carolina public radio W S C I F em Charleston at eighty nine point three an HD one W E PR Greenville at Ninety One and WNPR Columbia at Ninety One point three [noise]\n\nBack as we began the second part of this week's Carolina live from classical public radio and South Carolina public radio on Lauren Rico we're about to hear music that wrapped up the western Piedmont seventies all Beethoven concert titled lewd big van is the man it's the violin concerto in the\nBeethoven composed at an Eighteen oh six and its first performance by virtue also friends Clements was unsuccessful for decades the work languished in obscurity until revived in Eighteen forty four by us if your team\nSince then it has become one of the best known of all a violin concerto this\nBeethoven wrote the concerto for his colleague Clements a leading violinist of the day who had earlier given him helpful advice on his opera Fidel into the work was premiered in December Eighteen oh six in Vienna the occasion being a benefit concert for climate", "show_name": "Living on Earth (PRI)", "year": "2018", "city": "Columbia", "day": "28"}