{"month": "10", "state": "GA", "station": "WSBB", "content": "And pain are having problems with your joints are back learned about the advancements in stem cell therapy an application Dr Ambrose accuses to levy eight pain and increase activity I'm blown away by the success stories and incredible results we're seeing in this field\nBy the nation's leading expert in stem cell therapy now if you're interested in learning more and consulting with Dr Ambrose ... visit the website Dr Rick dot C. oh that is letter D R Rick dot ...\nWell you asked me about ... or ... media group station [noise] the one who is twenty four hour news weather man from\nFive AM seven fifty\nWant to\nKnow the I guess to say to walk on several Castro live and the W. must be twenty four hour news center with WSBIU top story this hour at a rally in North Carolina a short time ago President Trump spoke out against the acts of male bonding suspect Caesar sad\nViolence was never ever\nBe allowed in America and I will do everything in my power to\nStop the suspicious packages mailed out targeted outspoken Trump critics ABC's Martha ... in Florida where the arrest place Cesar\n... may have been arrested here outside an auto zone in South Florida but he will stand trial twelve hundred miles away in New York the case will be handled by U.S attorneys in the southern district of New York three of the fourteen devices were found in Manhattan but\nBefore say our heads north he will make his first court appearance here in federal court in Miami that will take place on Monday afternoon mark ... of ABC News plantation Florida\nForty seven degrees on peach tree street Atlanta's most accurate and dependable forecast is coming\nUp on the cars the mid term elections in Georgia and across the nation there are now\nCalling for an FBI investigation into allegations of vote flipping in Georgia where voters trying to select one candidate that the balloting machine selects the other\nCounty voter grime so she tried several times to cast her ballot for Democrats Stacey Abrams in the race for Georgia Governor Bush says the voting machine and her booth kept marking her ballot for Republican candidate Brian Kemp who is secretary of state is in charge of the machines and\nI wasn't able to clear it it ... the attorney general Grimes tells me so far this has happened eight times in six different George's County we've\nAlready contacted the FBI to launch an independent investigation\nKim spokesperson Kansas roast is quoted as saying this is human error on a part of voters peak combs ws be\nFirst first this is double you ask me twenty four hour continuing\nUh students here is exclusive cell phone video with channel to action news of the moments after her teacher was stand it when it counting middle school\n\nClassmates scream it then stabbed the teacher inside the classroom ... middle school\nI went over to my teacher and she was like a record if I can show some way and then I recorded it\nThat students Maurice Smith a Thirteen year old was arrested the teacher was conscious when she was hospitalized you were just fans jamming into Jacksonville ahead of tomorrow's huge game with rival Florida\nI've been to football games everywhere and then the other ones like this one and that scene outside the stadium will carry over inside tomorrow\nIs just another game got kind of put that in your head but I Can't allow it was it costs me at first the first time I saw\nThat's running back a larger Holyfield is is the first on both teams have been in the top ten at the same time in a decade winter stays in personally as he sees the losing basically knocked out our tailgate you'll start to eleven thirty tomorrow kickoff return a T I Am a big stadium in Jacksonville Jay likeable do us until you\nMust be news time now eight of three\n[laughter] hand when you ask me when there was breaking firsthand accurate than from the voices you've tossed twenty four hours five five Pan Am seven fifty W. B.\nSometimes you know you're right but it's always good to get some validation Erich von ... here to say congratulations to my friends at simply roofing\nPhilly roofing has just been named residential roofing contractor of the year that's right the roofing company that I trust and recommend as one the biggest national award for the entire roofing industry\nThat means they're the number one room in America for customer satisfaction and quality work been shipped that's why I recommend Findlay roof it\nSimply roofing sets the standard for roofing excellence locally owned and operated nobody replaces a repairs more Atlanta area roots that's why they're Atlanta's most trusted and recommended roofer\nWhen it comes to your roof and keeping water out of your home don't settle insist on the very best schedule your simply roof free roof analysis today at a roof roof dot com\nYour local ram delivers committed to giving you a great deal and right now during rammed power days well qualified to cordless use of competitive vehicles get a ... some of the all new twenty Nineteen ram Fifteen hundred big one group got four by two or three Seventy nine a month for thirty six months\n... for by two or three Seventy nine bucks for thirty six months with three Seventy nine to assigning tax cut elections extra ...\nCome to find your local ran dealer and get great deals on trucks worthy of your reputation and right now well qualified ... he's a competitive vehicles get a little ... on the all new twenty Nineteen ram Fifteen hundred be going through kept for about two or three Seventy nine a month for thirty six months with three Seventy nine to assigning tax cut a license extra\nGeorge dedication goes beyond what's expected and when you have the power of ram trucks you're pretty much unstoppable\nSee your local ram dealer and hurry and for Rahm power days\nCoal mining seven Seventy five something to do pretty tales requires the other countries in the least across the capital excludes all the rest of your vehicles twenty bucks in charge for each other for thirty thousand residency restrictions apply delivery by ten thirty one ran as a registered trademark of FDR us hello see why\nLet's see this time now like eight of them by now launching coverage of trafficking whether let's get the latest with Mike shields in the deli left me twenty four hour traffic\nCenter ... the ws be jammed came crash still working eighty five north down at Cleveland avenue extra Seventy six a right wing bloc there that's why you're seeing delays as you make your way up to the downtown conductor crash reported in Douglas County Fort road north bound that at ... road that's causing delays in the area\nAnd also still watching the zoning Henry county from Hudson bridge roads Seventy five south donated to twenty four down to highway twenty eighty one just weekends all you're still in there that keeping you tap into breaks a Mike shields W. S. B.\nI'm satisfied with ... with the most accurate and dependable by the forecast graduate drying\nTrend is we had to do this evening Saturday morning starts fifty will be mostly cloudy with a high of sixty tomorrow but no rain expected\nRight now forty seven degrees in Atlanta with news on the hour the happened when it breaks I'm Sheryl Castro news Ninety five five and a and seven fifty W once they\n... now where I was ... when I told him to recite all the metro in\nSevere weather traffic\nBreaking the reviews immediately accurate ws be twenty four hour breaking news or do you see them do their\nHead and you're listening to the mark show\nFriday they should of them are here of show mark ... us\nThey air the program heard Monday through friday seven to nine pm on who's Ninety five five and seven fifty ws me\nThanks to you or Kevin butler ... J black Neal Honda Williamson for that great bulldog coverage again or the bulldogs in the gators tomorrow our coverage starts here on your home with the dogs at eleven thirty AM kick off at three thirty PM number seven Georgia against number nine\nFlorida um the ... world's largest outdoor ... McCain said anymore but you know what I'm saying and one of the greatest times I've ever had in my life Chris Burns a joins me in Studio\nOr have you ever been down to be a Georgia Florida game I have and I hear your job or in a number of times but never Georgia Florida short are so you know I was the I I grew up in ... Connecticut didn't really pay that much attention to college you're balding really have a a favorite team adopted Georgia when I moved down here\nAnd I I went to uh my first Georgia Florida game and back when my weekend shows a sports talk show right we broadcast live down there\nAnd I was blown away\nThe football games great the atmosphere is great sure the talent down there was ... believable I have never seen a more attractive group of women in my life it was to the point I'm ... I'm doing a live broadcast down there and it was the point where\nAn average looking woman got your attention she was like oh look at that she's ...\nIt's it's insane but anyway that I was back in my younger partying days yeah I wouldn't go now yeah no no yeah and you don't have just bad luck every time I went down Georgia with ... and so and when I don't go down Georgia when so hopefully Georgia when\nA tomorrow hopefully my heart will be okay because the last couple of weeks um have been a chaotic in the market ... chaotic in my four one K. academy in my a mutual funds\nWhat has been going on with the markets by the way a Christ is from a more than money my life is more dot com or financial guru um and the guy I go to when I when I Need some help on stuff what's been going on with the hours five weeks\nThat's blocking a right lane and still seeing delays of a crash reported in Douglas County Thornton road at Oak Ridge road delays building in that area this report back to bite mothers against drunk driving drunk driving is one hundred percent preventable one hundred percent of the time\nHelp them create a future no more victims at ... dot org that's it\nThen create a future no more victims at ... dot org that's MADD dot O. R. G. uh Mike shields ws be\nOne of like golf at a public horse that has the feel of a luxurious private club hand held toys for talks while you blame\nHey an athlete and that is horrible\nJumped joined us a bears best It's MORNING\nProceeds benefiting toys for\n... find a link to registration\nPay WNYC radio dot com under a than CNN [noise]\nGeorgia carcass diversity of receive up to seven hundred and fifty dollar rebate for switching to a high efficiency heat bumper by traditional natural gas burners and it could help you reduce your annual energy bill by up to thirty percent they heat and cool your whole learn more at Georgia Power dot com slash heat pump\nUp the Jews adventure day's event you'll find great deals like the great outdoors or never out of reach especially with charities impressive fuel efficiency I'm thirty one MPG highway at right now the local Jeter wants you to take your freedom even further by offering more thousand total casual out what's on the twenty ninth to charity when financial\nMassive vehicles and and now with charities available for you to touch screen you can stay connected no matter how you want to go to cheat dot com and buying local jeep brand new to discover more great deals on the legendary G ... including four thousand ... Kaushal I went to the twenty Nineteen charity when finances because owners editor vehicles\nDon't sacrifice all whether capability fuel efficiency\nFrom low price ever again and you can have it all now during the chief adventure days of the estimated thirty one aging highway actual ... good luck to front wheel\nOn as a surprise for capital not all but I said well if I told her as the president seems to supply offerings tend to remind you as a registered trademark of\nHow they'll see now this is the time of the year to get your new hot spring spa from the George ... a ... truck load sales going on through the thirty first shape six thousand make thirty nine on six and seven percent salt water hot tubs they're normally over Fifteen thousand dollars\nYou also get a free coverage steps water ... delivery and set up a Seventeen hundred dollar value Georgia spark company for doctors Kennesaw Alpharetta now in Augusta, Georgia Spock company dot com\nIf you love chip and Joanna you haven't seen anything yet check out the tables stores in Woodstock and Roswell both stores are packed with floor to ceiling treasures handmade and custom farmhouse dining tables and a variety of finishes styles and sizes starting it just three Ninety nine\nChairs gift antiques and accessories all at the guaranteed lowest price at\nThe table stores open seven days a week on ... and Roswell and on highway Ninety two in Woodstock\nI Know what it's like to be a burglary victim and I'm not alone I'm Monica Kaufman Pearson for loud security and the statistics are frightening and it doesn't matter what neighborhood you live in every home as a target listen to this resident of east cop\nYou'd never think it can happen to you we live in a safe community wrong one night out or an afternoon at work is all it takes\nEverything a value is gone jewelry electronics I let my family down and that feeling of violation\nIt never really goes away my husband is retired assistant police chief and we've been loud security customers for ten years having a top notch security company protect our home with a necessity John Loud president allowed security says it best\nIt's better to activate your security system thirty days too early instead of one day too late\nCall now at six seven eight get loud and get a free total connect camera a two hundred dollar value and you'll have the peace of mind knowing your family had twenty four hour monitoring of burglary and fire\nLab security is a Honeywell authorized security and fire alarm dealer juice discount\nSpin that by email that\nWe work hard to be healthier when we really need is better quality sleep the news we've number three sixty market is not a bad no it's a revolution and sleep it intelligently senses your movements automatically adjusts your cupboard and support on both sides your sleep numbers that are\nProven quality sleep and that means all those other things we're doing to be healthy and happy work better to the news we number three sixty smart nine Ninety nine only to remember store near you didn't remember dot com for details\nGet a shared a certain comfort heating cooling and plumbing forty nine dollar Paul given up plus the pre safety impacts and offer end soon detailed at a certain comfort dot com guaranteed\nService on time done ride across dry I'm Jerry Hall and I assure it my carry\nOn the um [noise] [noise]\nHi welcome back friday edition of the market and show thanks to my buddy Christian Burns a yeah the market what are you gonna do what are you going to do I'm I'll tell\nYou what you are going to do you're going to send your name and mailing address you can email it to a low key Chuck E. W. S. B. radio dot com\nThat is if you want a marketing so Christmas card this year\nThat is if you want a marketing so Christmas card this year you ever do the Christmas card again I think it's our fifth year doing it\nOr we're doing three hundred and fifty of them so the first year injured and fifty people that request a mark M. show Christmas card will get it in the mail before Christmas it's a great looking card a pictures of me and all the bananas on front says merry Christmas you put on your fridge and a right to your friends that you know all of us but ah well in order to get one you have to uh send an email\nTo low T Chuck that's L O W T. C. H. U. C. K. at W. S. B. radio dot com put your full name and full mailing address there and make sure you get a a Christmas card sent out to you or this Christmas it's good stuff we like doing it but again we only have three hundred and fifty\nSo uh if you missed the boat that's it because I pay for them and um\nThey're injured fifty cars photo cards is expensive so that's a that's what we're doing this year last year we did three hundred and they went quickly\nSo are you guys have been so nicely she'll do another fifty a but if you want the Christmas card again mail email your full Maine and mailing address low T Chuck at W. S. re dot com and you'll get the marketing show Christmas card I Will continue the conversation or on Twitter and Instagram\nAnd Facebook mark M. W. S. B. I'm all through the weekend I'll be out socially active if you want to hit me up on a social media again Twitter and Instagram it's ask mark M. A. R. K. A. R. when and Facebook it's mark M. W. S. B. news weather and traffic next to this is the ... show [noise]\nYeah well you asked me mark arrow Trimble team Trump big every morning and entertaining talk every evening I'm In ... for so many years harem dug a local daily talk show Lawrence\nHas this ... way of making everybody feel like you're like here's your money just for the first time mark\n... is plugged in every day seven PM she'll know Sonny ... am Seventy simply don't when you asked me\nHe was not by five AM's seven fifty I well you asked me this is Chris Burns from more than money changes coming in taxes health care the markets make sure your prepared to go to my life is more dot com bless them for Chris Byrne tend to more than money out of date weekday afternoon at five thirty five on don't you asked me\nGuns young gone it's gone showed jai ... big large vote gonna nice show on sale this weekend up what our county fairgrounds by cell drain thousands of new and used rifle shot guns handguns nice host and managing\nThe whole ... reloaded supplies on so much more bringing your own you're on a large chunk of cash fires paying up to ten thousand dollars more aware\nOf draw on ships don't jump is a big large no gun show this weekend up like what our county fairgrounds moral by sugar partway sounded a nine to five on Sunday gender boy [noise]\nThe regular Chevrolet him to lose your getting Lana Chevy Truck headquarters shut the vessel actually lose a lot of trucks and enjoy unbelievable discuss new roads today for shop online at ... ...\nYou know our Jimmy Johnson nine grain wheat some as the perfect amount of grain for it yeah it does any lead you to be green lacking anymore to be obnoxious nine green [noise] it's just so confident I mean it says um high quality I'm substantial flavorful but I don't have to prove myself to anyone\nThis mind green leads not as practically an inspirational poster I Want to possess the character adept at this ... are you guys thought he might think that nine great we set up again try our new nine green we don't give me ... ... yeah\nI used to post a job or send me tons of resumes\nJust to find a few people who are right from my job that'll process was not smart then I went to a zipper technology Afghans that the dorms or find the right people actively invite them to a plot so I get qualified candidates that smart\nThe way different groups written number one by employees in the U.S try now for ... dot com slash free that different groups dot com slash free ... to ... to hire except for the rating of ... I remember when I was ... years\nFor Georgia\nThe thirty five to thirty forty five\nYet\nGone down the cameras will be hot in Jacksonville on Saturday pre game coverage began eleven thirty three thirty here all the action here long used by five fans am stepping up the double you asked me\nIce cream sundae yeah yes even though you don't do dairy dairy I Would do it with coconut ice cream of course okay I'm going to go to our I'm an ice cream yes they are not on a Monday morning when you actually know flavors that Dr Joe takes the fun out of an ice cream sundae no point there I Would have guessed milk shake too 'cause I thought that would be easier for is a\nFragile told me to digest but apparently not All right and you can take the lead here Dr Joe I asked him beach house or mountain cabin what did he say\nMountain cabin doctor\nWhat did he say [noise] mountain cabin Dr Jones beach house or mountain cabin that each house no doubt I Love the beach love the beach love the ocean of sound and when you around water it creates negative ions negative ion neutralized toxic chemicals in your body and that's why you feel\nBeach I'll let you go\nBack to my favorite ... no point for granted that sorry we're tied one to one or you can take the lead here bar but I asked Dr Joe spring or fall spring or fall what did he say\n[noise] or a spring\nDr Joseph ... spring or fall spring spring chicken I'm spring chicken I Love getting warmer I don't like getting caught [laughter] enough Dr Joe you got the point Barbara alright uh ana I asked Dr Joe convertible or S. U. V. what did he say [noise]\nUm convertible\nDr Joseph convertible or SUV SUV like a bigger I like the bigger car like being a place to be a truck driver in New York City oh like Cain up high above the traffic's actually absolutely fine our second verbal to ... doctor drill is like a guy that would be rolling down the tree and a convertible and you know what I'm saying to him\nI feel like he'd be up higher because there's less pollution to get the free radical to free radicals me ions and all that stuff I Know point for in a bar Europe or is this is one that's going to be tough one um ins or cash Jews ... Jews all as you say almonds Dr Joe ... or cash shoes\nCash use only because I like to play by their better failure yeah they're better flavor you always have ... so I figure I thought you might set off but I catch is if I had to pick one yet but it takes taste that er which is better for you to be honest we better for it yeah yeah more out of Washington system [laughter]\nHe chose cash use and it's weird because um I don't know if he does this do you guys but every time Dr Joe comes in the studio he liked throws bags and bombings at me like you just like out of nowhere just ... yeah so I I Would have picked almonds there too All right uh that was\nSeen how it catch you grow another delicious nice there are so delicious I that was a that was barge pick right so now it's ... [noise] yeah Anna stay awake with stay with us here dogs or cats Dr Joe dogs or cats [noise]\nDogs Dr Joe dogs or cats dogs your dog ... absolutely I I'm not a good person either but I'm not something you don't have any do you have any pets no pets right now I Would say cats if there's ever a cat dude\nI Would say it will be Dr Joe so I Would I Would have lost that went into but you got the point where tied to to to go back to food a bar but I asked Dr Joe Snickers or Milky Way what he choose\n[noise] checkers\nDr Joseph Snickers or Milky Way Lew Snickers yeah I'd have to go to a Snickers you have to add a flashback to Thirty years ago when I had was life I got a candy bar thirty thirty thirty five years ago how can you give me like ...\nChocolate have chocolate and stuff and once you once you lose the ... heavy sweets human craving anymore gotcha\nHow you get the point Snickers that's a good call by the way I go Snickers every day what he said to you don't know that stuff anyway what do you think bar sneakers or Milky Way what do you prefer\nThe recycler for accents or sick or yeah and what about you [noise] ... yeah who eats Milky way's\nI don't know I don't know you have you ever ... yes there is a guy that sent the ... ... ... who is that that was Barbara alright uh Europe now Anna here back to food onion rings or French fries [noise] ... that's a tough one doctor Joe onion rings or French fries\nI Love onion rings one of my favorite foods in the world and you can still eat them you know I think it would be a good ones yet but I mean they're not good for you yeah I agree with you on that\nMe get worse than death about eating yeah but what the hell's of economic entering aren't all on earrings Reagan\nI guess if you fry it and certain things that might not be big and\nI don't know oh that's right yeah I don't know what you got the point in your good I here's one a bar this is very telling Erich von ... or ... what a doctor do say\n[noise] all he's going to take care of\nDr Joe ... a ... [laughter] to live by interviewing me a job\nYeah I put the pressure on them right there he's always on the ... that's why he really he likes on ... you know he likes on ... ... it gives a von ... tasty cash shoes and it gives me it\nWas um it that's how I Know I uh you can try this up and the last question of or would you rather this or that with Dr\nJoel rather um I asked Dr Joe drum sticks or flat talking about chicken wings here drum sticks or flat footed Dr Joe say [noise] okay I'm going to go with that doctor Joe\nDrum sticks or flats while the drums better choice because we ended up a fat and skin and hair and everything I'd rather [laughter] you've hats and wings in Herat and wings inherent who how I bet you make a good way you'll take the drum sticks every I I Know ... this is a nail biter Barbie you have one now\nNo ... this is a nail biter Barbie you have one now and it only costs you an hour of your life a it's an eye on the on the air show this or that Dr Joe or Deb green what did a lovely Barbara win tonight\nFor tickets he gave me in concert in ... Atlanta company how how 'bout that\nWhy am I\nThe exactly Anna thanks for playing I Wish I had a party for you but I don't tonight\nUh well I Love listening to you still have a good night\nThank you and I appreciate it our barb uh you got to stay on hold catfish is going to get some questions or get some stuff from the OK okay thank you so I don't know how to put people on hold there you go what did they win again\nTake it to the Disney and it landed in any um yeah ... okay goodbye or do we have we're going to do back to back Dennis Miller right now is that ... All right Dennis Miller joining us live in the air and show Dennis Miller you hear the ... minute every night on the program a living on the west coast now is that I'm assuming you're a dodger's fan Dennis\nWell you know I can understand Clinton crochet seems like the nicest guy to me and it seems like such a great talent\nAnd I'm watching him last night he's gone to nine and nine in the postseason on them trying to figure out I don't want to be a ... about him but something's amiss and the policies I wouldn't be a simplistic say\nSome people that he gags literary chokes whether something is different because I've watched them over a decade be the greatest pitch\nOn the planet earth and to be five hundred\nIn the postseason something's amiss but don't quite know what it is\nBut it also looks like the book the Bo Sox year I mean jeez they're pressing on your twenty four seven it's like ... Richardson when he coached Arkansas six yeah forty minutes oh they're just on you all day long so I think it probably have to go with both socks but obviously I live about an ear open the Dodgers pull up to\nDo do you think it's just the pressure of the big stage I mean a Wednesday night game against Milwaukee in July not as much pressure as as October baseball against the rights I Can't\nQuite figure it he's so a commanding in the regular season but I just cannot quite figure what happens to him I was trying to look last night and then my\nObviously have a complete the civilian but it seemed to me that when he goes up to his chest so there's me that most still looks cool but there are times I watch him during the regular season and he'll come down and do that it shouldn't as ... like a you know wealth maggio and the\nKid and he will stand\nThere for a second it says less but he was sort of blowing through the ... but I always wonder if she was just rushing it a little but anyway it's a you know I'm sure it bugs him infinitely more than a bugs me but mine mine and the post season is not something you build a legacy for the ages of\nHow tough a ticket is it a World Series Dodgers games I imagine anyone that's anyone wants to be there and be seen kind of like the the Lakers Showtime era\nYou that you know if I can I tell you this I live up in Santa Barbara and I am not kidding when I when I tell you the traffic is so bad down there if I left Santa Barbara to go to a game at Dodger Stadium between the traffic going up on the hill you ever been to a game\nIn LA oh yeah yeah yeah well you know we're Dodger Stadium sits between living here I'd have to leave four and a half hours before I Would have as much he's\nGetting into a game at Fenway tonight\nLeaving my house right now it's like to go to Dodger Stadium so I don't go down that frequently when I've been there it's just amazing park when you look at it the civilians in right field and you think that will start Joel put two\nOut of that stadium an absolutely blows your mind that truly is a lesion fields but the simple fact is when you got a high def television well here practically there anyway and you don't even have to pay for parking very infrequently do I need to be said that there\nYeah I that's a game changer I live five miles from Central Park or where the Braves play and I didn't go to a single game last year it because you know I'm at home I've got a bathroom I've got the kitchen I've got the the high def TV um\nAnd I actually hire local kid that is a hotdog a bit at a you know the real feeling he just comes to my house\nAustralia has made a red hot Dennis Miller every night the Miller minute on the market for thanks for your time sir [noise] All right let's say a prayer for the world's troubled right now it's been a rough day thanks it's great I Will do we'll be right back [noise]\nForty nine courage carrier double you asked me twenty four hour traffic staying here since you're still working around Fulton County north bound Cleveland avenue in Seventy six of right wing bloc causing some delays downtown in the connector Seventy five eighty five south down watching a brand new ... who you ask me GM camp\nFlavorful but I don't have to prove myself to anyone this nine green weed scientists practically an inspirational poster I Want to possess the character adapted as non green weeds are\nYou guys thought he might think that ninth grade we set up again\nTry our new nine green we Jimmy ... we get free gas\nUsed a postal job or some ... tons of resumes just to find a few people who are right for my job that'll process was not smart then I went to a zipper\nTechnology scans forms to find the right people actively invites them to a plot so I get qualified candidates\nSmart ways every group written number one by employees in the U.S right now for ... dot com slash free that different groups dot com slash free zip recruiter ... way to hire the central celebrating hiring side to the radio\n[noise] and when you ask me about ... er Cox media group stations\n[noise] twenty four hour news weather man from five AM\nMe want to\nKnow the thing is cynical time shuttle Castro alive and the ws be twenty four hour news center with W must be tough story this hour\nSuspected male or a fourteen\nPackage bombs to prominent Democrats and other critics of President Trump that CNN in New York She's our say are fifty six years old arrested this morning north of Miami ABC's Aaron ... is a history\nAlong criminal history including at least eight arrests in Florida we've also found a recipe and other jurisdictions including Minnesota He also for a time appeared to work as an amateur body builder and as a traveling road manager for a male review show the authorities say that\nSure for a male review show the authorities say that he had been living in a band that ban was covered in stickers with incendiary political messages covered with a blue tarp and carted off on a flatbed truck sales vehicles been sees his ABCs DeVos insomnia\nWindows of the white van police say he had parked outside recovered with potential evidence the hard to miss political messages supporting the president and demonizing his critics including Hillary Clinton and CNN choked secrets in ABC News\nRight now forty eight degrees a drier weekend to head of lettuce most accurate and dependable forecast is coming up\nWhen you ask the covers the mid term elections in Georgia and across the nation\nThere are no ... investigation into allegations of vote flipping in Georgia where voters trying to select one candidate but the balloting machine selects the\nOther county voter ... crime so she tried several times to cast her ballot for Democrats Stacey Abrams in the race for torture governor but she says the voting machine and her booth kept marking her ballot for Republican candidate Brian Kemp who was secretary of state is in charge of the machines and\nI wasn't able to clear it ended up ... the attorney general Grimes tells me so far this has happened eight times in six different George accounting\nAlready contacted the FBI to launch an independent investigation\nKim spokesperson Kansas rose is quoted as saying this is human error on a part of voters ... I'm Still with us be\nFirst first this is W s me twenty four hour continuing new man\nWithout a non lethal hit on his wife now he and the people he hired are facing hard prison time he'll take\nRuns that was angry that his ex wife had a new boyfriend so from prison he planted with his buddy ... Ramirez to rate cut burn and disfigured her\nWant her to look and such a way that she would never want to leave your house\nWould that county assistant district attorney Matt ...\nEnded up recruiting ... the year and they brought her girlfriend her ... marker or violent double date\nThey toss scalding water on her then Francisco plenty a right to write their toddler quite on the bed fingerprint on the pot led police to suspects who admitted they'd agreed to take five hundred dollars plus whatever they could steal but if it's your job bronco waters WSBIU\nWhen we're hearing from the family if a woman who was shot and killed a ... a parking lot in life don't you just two weeks after her way\nTo get to everybody she has three beautiful killers and then she leaves behind [noise] um and my heart just hurts for them\nAt least you can Steven sister Theresa deal tells channel to watch the news at least your hand her husband were in the wrong place at the wrong time the husband now hospitalized with several gunshot wounds police have identified a Nineteen year old Carlos Rodriguez as the men WSBIU time ten of three\nAnd kept Stacey Abrams Georgia's future is in your hand followed Georgia's race for governor every day with guns played Erick Erickson and the ... largest news team nobody covers Georgia's elections like new Ninety five pound am seven fifty do when you asked me up and on it are you scared\nOf the the one just before your lights go out who knows how long you'll be sitting there and the dark fit automatic backup generator kicked saying as soon as your power crashes but you need a frozen design your system generators or not one size fits\nAll so get your free system design and has meant when you called ... box electrical and I'm David Baker might experts who never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time called black box electrical and don't fear\n... constant brand new your whole billion billion colonies below the ground and ... and you discover the damage was that a seasonal my protection using the ... system your home is protected and\nBy one of the best and going to use or the other string I'll guarantee includes coverage Marie ... and\nAny new damage that's messy services with the ... system expect more\nGetting I'm Tom Shane we see a lot of customers coming to Shane Company to buy gifts for all kinds of occasions your anniversary or birthday celebrating a new baby\nIf you're not sure what to get her remember there are many essential pieces that every woman needs in her jewelry wardrobe that she can wear with everything you can't go wrong with our fourteen karat gold hoop earrings from Seventy five dollars to three Seventy five\nA diamond tennis bracelets like classic gift and ours begin around a thousand dollars might go to gift as a strand of coach or pearls and we have them in every price range\nAt Shane Company we have the largest selection of jewelry essentials at the best value in town you'll find better designed better quality and better craftsmanship than anywhere else what ever the occasion she's worth the drive\nNow you have a friend in the jewelry business Shane Company in shank dot com\nRent is they put in your home for rent not for sale and because there were always render but not always fires friends have said is foolproof recession proof and retirement plans off of\nThat [laughter]\nI Am off of the rent is they do the free market renters warehouse because lawyers\nAre going\nIn a\nTraffic actually get it right we\nAs long as I think it's time ten of six new sponsored by ... and the W. must be twenty four hour traffic center show the good news is there is not\nA lot of roadwork or construction going on around metro Atlanta so that's making for pretty good right she said something Fulton County just seeing a Tampa to break periodically Georgia four hundred north bound pass the Glenn Ridge\nConnector as they're doing some uh will work they've got to laugh lanes blocks do I to eighty five and then to eighty five east bound the exit ramps to Georgia four hundred north bound that is closed down\nFor roadwork what they're doing is they're going to take you off at Georgia four hundred sound down and then you get on the Glenn rich connector and you get to go but no major delays anywhere around metro Atlanta at this moment I'm online ... W S P [noise]\nJust watching the job just spreading it with a lot of his most accurate and dependable by the forecast graduate drying trend is we had to do this evening Saturday morning starts fifty will be mostly cloudy with a high of sixty to Bob and no rain expected\nForty eight degrees right now in peach tree street I'm Sheryl Castro news Ninety five five and a and seven fifty to all the less they depend on it [noise]\nIt's my pleasure\nTo welcome you to the Clark Howard show where its value learning ways to\nKeep more of what you make and just a few minutes and today's car courageous moment yet another government overreach on what\nYou choose to eat and coming up later what is the key determinant of whether your kids are going to live better than you\nHave or worse I'm going to tell you I Want to talk right now about something you were going to see when you're out and about shopping\nAnd it is a change that you may\nOffered to you at the register as you're doing your Christmas shopping and beyond a lot of small and mid sized businesses use this square app and square service to accept credit cards\nAnd so when you go into a store that except square and you're doing a larger purchase you may be offered an option of instead of using the credit card you were going to use\nBorrowing for that purchase through square\nAnd the purchases that will be eligible will be purchases of two hundred and fifty dollars to ten thousand dollars if in fact a merchant online or in a physical store is offering you in store financing is is referred to\nNow the interesting twist with is is that if you're doing a larger purchase you don't want to put it on one of your regular credit cards you may be offered a zero percent right or you could be offered a rate all the way up to the mid twenties\nHas a service that evaluates existing life insurance policies\nOr they'll be able to tell you with the exact precision if you should keep this policy dump it converted borrow against it cash it out what would be the right move for you and\nIt's pretty involved what they do so it costs a hundred and twenty five dollars for them to do\nThat evaluation but compared to the money you have a stake that's laughing\nAgree I agree\nSo I'm going to give you a website you can go to that is a dedicated Web site to this from the consumer federation of America where you can see exactly what documentation you've got to get together for them to run the full analysis for you\nVery good\nThe website is a value weight life insurance dot org\nOkay\nAnd they're basically only charging you with their time costs is to do it because this is a non profit\nOn the story sound investment\nYou'll know exactly what you should do and it's not even gray\nWith the scenario like you played out but for you and me you know this isn't what we do for a living so it's something we would not be able to properly assess an answer whether you keep it dump it or something else\nRight right [laughter] well that's certainly a great ... I Do appreciate it I really enjoy your show and I appreciate what you're very\nThank you very much and I hope you have a great day you're listening to that\nAnd I hope you have a great day you're listening to the Clark Howard show [noise]\nTen Twenty one Kuwait carrier W. S. B. twenty four hour traffic Center for your ... in Fulton County heads up for some roadwork I to eighty five eastbound exit ramp to Georgia four hundred north bound that is closed for some repairs you're going to be de towards the Georgia four hundred\nSouth down and then you'll get back on the Glenn rich connector also George Bernard north down past the language can after\nTwo left lanes knocked out because they're doing some roadwork there that's exit three\nYou may expect some delays in that area I'm a traffic brought to you by marathon wherever the American ... marathon can make the trip better with ideas for road trips andme or go to miles have meaning dot com to find out how marathon fueling the American spirit I'm only ... W s be\nDo you hear voices those nagging little voices in your head the voice that remind you every day of all the things you need to do\nMaybe you've been skipping your twice yearly maintenance on your friend is an air conditioner not good\nIt's time to get that done right now and get back on track\nSo cool re a super seizing the wrong famous no breakdown guarantee called cool right for your winter safety jak in furnace maintenance you'll get a credit up to two hundred and fifty dollars towards any repair of your furnace break down this winter\nJust called cool right just called cobra your factory authorized terrier dealer sign up for a three you're cool All right cool care maintenance agreement and get a two hundred and fifty dollar credit with no service called fees anytime until march thirty first twenty Nineteen\nI'm Dave Baker the experts you here on my home fix a Joe or the ones you want keeping your heating and cooling system running right\nCalled cool right they get you faster and often the best warrant teasing guarantees I have seen in Atlanta they also help get rid of all those voices in your head Korean carrier turned to the experts\nRpm Atlanta is expanding\nVery excited and pleased to announce that are a brand new show room ... new vehicle and commercial ban sales are hoping now with more room to serve you you'll continue to receive the same great service and see the same friendly patients visit our new show Roma Seventy two hundred Roswell road in the heart of Sandy Springs\nProud to be your Mercedes Benz connection since Nineteen sixty four\nOnline that R B\nIt appears which saves them live there's a lot of pain aggravation and money consumer investigator Dale card well here\nEarlier this year I started warning you about a relatively new gimmick in Georgia companies wanting you to leave your home heating and air conditioning unit their pitch claims everything's free and you'll never have to buy another system for a small monthly fee they'll take care of everything here's what they don't say\nYour payments may go on for ever and be prepared to pay huge residual buyouts if you want out of your lease see my full report it trust they'll dot com slash ...\nCompanies in business Twenty years aren't doing it right superior approach terriers does everything exterior is right and have\nBeen for Twenty years Twenty years equals trust quality value and seamless customer experience Hi this is David Baker congratulations to my friend Irwin whites and his team on Twenty years or so Perrier craftsmanship\nRight now registered to win a free complete exterior paying job click on the twentieth anniversary logo is superior pro dot com barrier pro exterior your total exterior solution\nAre you scared of the ones just before your lights go out who knows how long you'll be sitting there in the dark it's automatic backup generator kicked in as soon as your power crashes but you need a frozen design your system generators or not one size fits\nAll we'll get your free system designing has meant when you called ... box electrical and I'm David Baker now my ex virtue never leave me in the dark right box electrical get up to one thousand dollars off and two years maintenance for a limited time called black box electrical don't fear\nWhen the need for senior characterizes there's no place like home your loved one should never had to give up living at home\nVisiting angels will provide home care for your mom or dad at home I'm twenty four hours per day including personal care and meals and light housework you'll selective professional caregiver with visiting angel look up visiting angel dot com or call eight seven seven three seven four and then\nThey need seven seven three seven foreign lands franchises are available visiting angel America's Choice and senior home care\nDiabetes high blood pressure high anxiety meds everyone's on them if you're a fifty year old male maybe it would be for your even with type two diabetes a million dollars of term insurance my only cost you about two hundred bucks a month\nOf ... life insurance is out there called term provider and speak with big Lu at eight hundred for a one fourteen\nFifty eight eight hundred for a one fourteen fifty eight or is it big lewd dot com remember big lose IQ he's on meds to\n[noise] and I have an information to make more foods [laughter] I'm not a fan of the\nTelling me what I can and can't do\nOur men telling me what I can and can't do [noise]\n[laughter]\n... just a moment [noise]\nI Hope against all hope that this terrible idea from England doesn't cross the Atlantic to any pizza parlor you would go to so the government is banning\nPizzas of certain calorie counts the pizzas have to either shrinking in size or removing gradients to stay under the government tap on what a pizza can have\nSo the public health service in England says they got to do something drastic because of obesity\nWell I Believe that our laws requiring posting of calories that that is the right thing because\nIt makes you make the choice and that's exactly where it should be now I Know that once calories were posted calories consumed\nOnly dropped eight percent but a lot of people even with the information they ignore it or didn't change them I'm One of the people that calorie counts really change what I order\nBut the question is is just like with New York try and the soda ban you know the soft drink ban of any soft drink bigger than a certain number of Allen says\nYou and I have to take personal responsibility and given the knowledge we make the decisions we do\nWe in the United states and I think it was seven states\nIn the Nineteen thirties band cigarettes let me tell you that didn't work\nOn the other hand I'm a big fan of what a number of countries do where they put graphic photos on cigarette packs showing the health consequences of just about the most deadly thing we can do as Americans which you smoke cigarettes\nAnd just hit you're right in the face with it you should have the right if you want to smoke\nBut you should also know clearly the consequences food in my book same thing don't tell me I Can't order the pizza don't tell me I Can't have an overpriced super premium ice cream\nThe national debt is now over twenty million dollars what happens next rising inflation drops from the dollars by some experts say another crashes coming you can fight this note with stocks or bonds but with gold and silver coins and an IRA from Augusta precious metals\nCoal eight five five eight five eight five eight oh seven and learn how an IRA backed by physical gold and silver can hedge against inflation calling us too precious metals right now at eight five five eight five eight five eight oh seven and get a free gold Ira guy call eight five five eight five eight five eight oh seven\nBut what was clear looking around the country and I just gave two examples there the dividing line was absolutely education\nThat in areas of the country where there's a big emphasis on education kids do significantly better\nThan their parents have done economically\nIn areas of the U.S and the southeast more than most anywhere else\nEducation is not valued as much and going to college not nearly as valued and college participation rates in a number of southern states or some of the lowest in the United states\nKids do not have the economic mobility or economic success of their parents\nCollege is not for everybody and it's not even necessarily about college but it's about going on to technical school state supported technical school trade school where you learned skills that are in demand in the marketplace\nBut in an economy that now demands more and more knowledge and skill\nKids not getting the education\nIs what creates what's known by a condom is\nBy the awkward and terrible phrase downward mobility I don't want that phrase they have to be used I Want your kids to have upward mobility that is what you want them to have and so I encourage you to encourage your kids wherever you live in the country\nTo understand the importance of education and training\nTo get into a career and education and training threw out there working lifetime so they have more economic mobility and more economic success\nDiane is with us on the Clark Howard show hello Diana how are you doing I'm well thank you for\nHow are you doing\nI'm well thank you for taking my call\nCertainly you have a question for me about getting to the theater and not having your wallet emptied as a result is that right\n[laughter] Oh yes my husband and I guess ... Connecticut and we're really close to New York city and I'm really looking for a kid going she from Broadway show and I wonder if you can help me out like I'm getting cheap ticket\nFirst of all if you're in Connecticut now you have to refer to yourself as being in the tri state area you'll hear that from over and over again now that you're there\nOkay you haven't heard that yet I have heard that yeah\nYeah you'll see it on the TV ads and radio ads no all across the tri state area so for you if you want to see a lot of shows taken a lot of Broadway an off Broadway\nThere's a great opportunity for you joining the theater development find I don't know if you've seen this they're the people that run\nThose ticket booths and Manhattan and there may be one now in Brooklyn that are for the tourists coming to New York and they want to go see a show and they stand in line to buy tickets when your local\nYou can join the theater development fund\nAnd then it gives you access to take it offers that are deals without you having to go stand in line with the tourists\nGray so that's one thing I Would do also because you're in the tri state area this are also work for somebody who's in New York and you know wants to buy a same day ticket and hope for a good deal\nThere's a website called today ticks T. I. X. ... it's not just for New York I think it's a number\nOf markets around the world where there's big theater scenes oh yeah yeah all around the country and um and also in London\nAnd with them or you each day you see a list of shows available and what deals they have available for those shows\nOkay and I got one other one is well that is the one that I've talked about for a few years called Broadway box uh-huh have you seen that one I have not so\nBroadway box dot com and if there's a particular show you think hey I really want to go see this particular thing\nIf you're a member of the uh theater development find and you have the deals available through them and you look at today ticks and all that you can always compare those to Broadway box wherever a particular show you want to see in a performance you want to go to is the cheapest you just buy up there\nOkay great thank you very much\nAll right I Hope you enjoy being able to take and all that theater at is with us on the\nClark Howard show hello ed hello car how're you doing excellent yourself\nGood thank you you have something that it's getting really old in your life a home equity line right\nOr right down to zero for quite a while and it's coming from time to either get a new one or just by the end of life answer the question I have is from a credit score standpoint\nIf you're going to help me or hurt me to go hand in let's say and get another two hundred thousand dollar home equity loan but never use\nNow is it a loan or a line 'cause the distinction where the difference is a line you can drawing basically with like a check yeah it's a line\nIn line and the interest rate floats so let's step away from the credit aspect for a second let me ask you this do you find that has been a useful financial tool for you to know that that's available in a financial emergency of some kind\nIt is although I doubt that I ever need to use it except for maybe a light and use it to make some other investments that pay a whole lot higher interest rate so that would be the only reason I might want to use it\n'cause I liked the idea of home equity lines of credit is stand by in lieu of keeping money and things like simple savings accounts or anything like that if you have assets and you keep them invested and if you had a sudden the financial emergency\nHaving to sell investments could be at a bad time and that's where a home equity line of credit I think can be very useful for people who carry very little or no debt in their lives a home equity line of credit can be a wonderful tool\nAs far as how it would affect your credit how long have you staying in the house here in\nUh we've been there twenty eight years and we've got another victim\nOkay so you're not looking\nWe got another victim\nOkay so you're not looking to get a new mortgage or anything like that I think having a home equity line of credit is a good idea as a strategic thing then in terms of your credit the history of the home equity line you have will benefit you for years to come the fact that it's been there\nThe issue potentially is available credit and ratios in terms of use of available credit and that would put the argument towards you taking out\nA new ... new home equity line of credit but what will it cost you to originate that he lock it would replace it the one that's done\nThey set a secular costs they won't cost you anything I'd do it okay that's what I was thinking All right we'll best to you at ... thanks cart thanks\nRebecca joins us on the Clark Howard show Rebecca how are you doing\nClark I'm fine thank you Rebecca you're looking for new wheels\nWell I'm kind of ah warm I bought myself a luxury model car\nIt's a chick often Thirteen guy got it in September of two thousand twelve and we need to keep it for five years\nBut kind of come and gone pretty quickly and I always get the urge for a new car I like the new bells and less falls on a ... percent of the couch it hurts them [noise] and I start thinking and we pay our callers that shot and um it's just a\nLot of money to be cutting down on a car and once we write that check come on and check for the car you know we have the car back I'm thinking I'm leasing might be an option for me\nSo when you bought that car back\nIn twenty twelve am I hearing you right you just wrote a check for it you didn't take out alone\nNow we didn't work out on\nSo it's a lifestyle choice if you're in a position that you don't need a loan for a car and you light new wheels routinely\nThat's a circumstance particularly with luxury vehicles that it may make sense for you to lease instead of by because we'd do luxury makes they don't like to out now discount the vehicles because they're trying to maintain a cache of brand worth\nSo with all often do is they'll ... factory subsidize the lease and where you get the deal on the luxury vehicle is in a lease usually for three years they want to turn you into another vehicle in a three year window\nRight and so a book cause for you is not a dollars and cents question it's more of lifestyle question we sing on many luxury makes would be the right decision\nPage publishing we'll get your book into bookstores and for sale on line at Amazon apple I do in other outlets they handle all aspects of the publishing process for you\nPrinting ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now for your free author sufficient get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred by zero one thirty six eighty nine\nThat when you asked me ... er Cox media group station [noise]\nTwenty four hour news weather and five and am seven fifty\nAsked me to\nIf eleven o'clock I'm Charlie O'Brien love and the U.S twenty four hour news ... story this hour recipes top national story more details on the rise of bombs symptom politicians ABC's Brian Clark has the updates [noise]\nWe're learning more about how it's already took the man suspected of sending bombs through the mail to democratic politicians and critics of President Trump into custody ABC's ... details\nSeats to say I was taken into custody friday morning outside an auto zone stored plantation Florida we're told he made no statements upon his arrest in gave authorities no information about how many more packages may be out there\nAuthorities identified him through a fingerprint lifted from one of the packages and through DNA found on some of the wires used to construct the IDs once they had an identity investigators track down say through his cell phone\nFBI Director Christopher Wray was asked why none of the fourteen devices he allegedly sent detonated\nThey did contain energetic material or which if subjected to the right combination of heat for shock of friction I could be dangerous to the public and the public should treat any device like that\nOf course he said that's part of their ongoing investigation Brian Clark ABC News\nYour recipe news time you live on one channel to meteorologist bread Mitch calling for ... now and the cloudy due tomorrow Atlanta's most accurate and dependable forecast is straight ahead\nThe Georgia Supreme Court rules Griffin superior court judgment Crawford can stay on the bench friday's release demise of judicial qualifications commission recommendations they've Crawford be suspended during an ethics complaint him Corey Hughes accused of stealing Fifteen thousand six hundred Seventy five dollars\nHe's accused of stealing Fifteen thousand six hundred Seventy five dollars from a pike county court\nFirst first this is double you ask me twenty four hour continuing serving\nVideo records the moments after ... middle school students accused up stabbing his teacher details from WBEZ bees journal Castro\nA students here the exclusive cell phone video with channel to watch the news from inside her language arts class a trick a middle school\nYou go out on the Smith\nSays she watched her classmates ... their teacher\nI went over to my teacher and she was like a recorded so I can show some way and then I recorded it\nA Thirteen year old was arrested the teacher was conscious when she was hospitalized Cheryl Castro ws be\nTo go when I've county teams agreed to rape and just figure a woman for cash from a man who was in prison the ... county da says\nJoshua Ramirez Audi Laura pled guilty to the fact last week the trial found a second team Francisco Portland so you're guilty Thursday Jose current Castro pled guilty last week to ordering the attack\nDouble us exports coming up tomorrow bulldogs in gators on WSBIU radio regained my eleven thirty in the morning kick off three thirty pm on WBEZ's B. W. ... curry\nDishes whether\nBy by at AMC hand on your iPhone and Android that don't have the radio W. B. upend on it [noise] [noise]\n[noise] I recently learned that the average person spend twenty four hours a week on life as a small business owner without a website that in the Senate Kathleen none of those hours I added ... and ...\nI've ever go out and I got that they can they named ... hundreds of nodding design credit for all kinds of business at restaurants to real estate in another time I connected my social profiles\nTo my site and you can find higher enveloping Google searches and get that I should have said any time even from\nWhich I guess I only fight in under an hour and when I needed help there\nWeren't winning twenty four seven support but at the ready to make the idea of real\nGuide it and make your own way start her free at go daddy dot com fall to show them how do you need to feed on line\n[noise]\nThe brain is your control center with millions in working part\nIf one part isn't working right [noise]\nOffering the most innovative treatment epilepsy stroke and other brain disorders\nThe state's first deep brain stimulation\nProgram improving your brain health and quality of life what could be more important experiencing Emily different\nVisit Emory Healthcare dot org slash bring health to learn more\nIs like your play like you never know what's coming next what do you need a check on\nMedicine or something more you know what a God\nUrgent care center in the metro Atlanta and be on your hands [noise] specially trained doctors and nurses cousin no matter what\nMore and my health care that much money\n\nThey say you become aware you hang out with hang out with that um it just go and meet each ... each week Sunday that six PM right here in W. S. B. and get your market knowledge\nPlayed ws being news weather in traffic in a flash ruined his skills and your Amazon a lesson and search tell us the radio and unable to last breezy news not by by and am seven fifty WSBIU depend on someone\nAsked me and it was done ... not on the coverage of driving and whether it starts with a double dip as be twenty four hour traffic center and a chart with my wife and eight gosh how they\nWere checking for some trouble in the ... the way it is I twenty uh westbound it looks like right after Fulton industrial boulevard or let you know about that but in the meantime heads up for roadwork Fulton County I treaty five east on the exit ramp the Georgia four hundred north balance\nThat has shut down traffic's being did toward off at Brooklyn rich connector and then George Bernard north bound right past that clean ridge and after a couple of ... to block that the exit three through I to eighty five and on the ... by two eighty five east bound\nAt Georgia four hundred there's All right lane to block all the way through Ashford done what he rode exit twenty nine no major to let it go lays as of now I'm a ... W. S. B.\nI'm ... major I'll just spreading it with the land is most accurate and dependable weather forecast temperatures are going to Harvard\nAnd his most accurate and dependable weather forecast temperatures hovered near the fifty degree march through the overnight and early morning hours of Saturday a mostly cloudy skies through the day with a high of sixty it'll be bit\nBreezy in the afternoon west wins Fifteen to twenty miles an hour on Sunday mostly sunny actually start at forty eight will tap out near sixty eight and then on Monday continued mostly sunny low fifty high sixties that\nGovernor that's based on drug or radar shows though sprinkle here and there for a metro Atlanta forty nine degrees I'm ... I'm Charlie O'Brien used Ninety five five and seven fifty double job is to depend on it\n[noise] [noise]\nI'm so glad you whether you're on the Clark Howard show where it's about your empowerment with knowledge keep more of what you make\nAnd that is my goal\nIs to serve you in every way I can with concise information that will empower you to take more control of your life\nAre there are times of the advice I give you feel it's inaccurate it's wrong it's bogus whatever it is where I did not deliver I Need that feedback from you because\nWithout it I Can't improve myself and I'm someone who is a big believer in continuous improvement in my own life so if you go to Clark dot com\nWe have a place called ... stings\nWhere you can go let me know where I have not delivered to you and the others others can read what you've said they can comment on it\nAnd see what others are saying as well where I have failed them in their opinion and then we call your producer Christ or goes through your posts on cork stinks and shares highlights with you here on the air [noise]\nSort of never thought it was just always think I'm pretty says well maybe maybe I'm wrong or right and you know [noise]\n\nI'm ready\nTo ... start\nWith this one enough with the advertisements you don't think Clark but the advertising has minutes on your ... cats do enough is enough I listen to your pie cast for information not annoying advertisements that come on in the beginning and in the middle\nWell one of the things we do is everything we make available we make available for free newsletters\nWebsites podcast radio show it's all free and it's all as support it and that's a decision that we made because I Want to reach the widest possible audience I can and the second you start charging\nWhat if he were to do Clark stinks only once a month the first or last friday of the month for example and did a bit of a roundtable discussion in more detail about the topics in discussion I listen to your podcast everyday and greatly enjoy it after several years I'm ready to hear Clark stinks only once a month David and Cyprus Texas\nDavid thank you for that many people tell me that Clark stinks is their favorites segment and would be extremely upset if they didn't get to hear it every week and it is something where it's really a for more than for me to respond although I Do do you have a response to most pose\nThe point is for people to have their say and let me know where I my perspective may be only\nPartial partial view or the my facts or information may need to be rethought on my part and so I appreciate people taking the time to post and that's why this is an important pay off requests to read these on the air you're listening to the Clark Howard show [noise]\nEleven twenty Kuwait carrier WFDD twenty four hour traffic center we tracked down that trouble on the west freeway it's tied twenty west down at Six Flags parkway exit forty nine multi vehicle wreck they're watching on the ws knee jam camp to left lanes are blocked definitely seeing delays if you're coming the downtown Atlanta\nGood news no delays in either direction speed limit rides a millennia time the whole us be\nHi this is Wes boss host of money matters when I'm not here W. S. B. radio I met my Sandy Springs office with capital investment advisors or if the only financial advisory firm and we work with folks just like you to help them find happiness in retirement if you'd like to focus on what makes you happy\nNot the ups and downs of the stock market reach out to my team and schedule of free review for your retirement plan you can find is that your wealth dot com that's why oh you are wealth dot com\nThere's something so unique about a business built on family and his nurturing the level of care dedication and respect that sets it apart Hi I'm Monica ... appears that for almost forty years I worked for a family owned business WFDD TV [noise]\nAnd that's what I found when I walked into Woodstock furniture mattress outlet a family owned and operated business that started out Thirty years ago as a small variety store and the heart of Georgia they pride themselves on selling better quality furniture at lower prices\nBut what I discovered is that the heart there\nWhere prices but what I discovered is that the heart of their business is the desire to serve you the\nCustomer the air and family provides a friendly laid back atmosphere with hands on customer service it's one of a kind shopping experience with great deals on everything you can eat for your home Woodstock furniture a naturalist outlet found that secret to success it for you the customer\nStep by one of their seven convenient location sedative experience what difference\nDoes it Woodstock outlet dot com for location near St you\nDo hear nagging little voices in your head telling you all the things you need to do\nThis is Dave Baker get your fall furnace tune up to North Korea factory authorized carrier dealer\nKorea super seizing their know breakdown guarantee with a credit up to two hundred and fifty dollars toward any repair if you're a furnished breaks down after your safety check in tune up this winter\nJust sign up for a cooler a cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also helped get rid of all those voices in your head Korean carrier turned to the experts\nIf you're struggling to find a job related how for your child the disability county now the center it's helped train thousands of people with disabilities find meaningful employment locally people likely since I'm\nCounting than our game I signed the training I mean very confident needed any kind of independent I don't worry about him being able to support himself thanks coming at us and our teacher looks bright\nHow the ... center continue to impact families in our community by donating cars are a monetary gas now ...\nGuns guns and gun show died on bad some big Lawrenceville gonna nice show on sale this weekend I think what our county fairgrounds by cell thousands of new and used wisely shot guns handguns nice wholesome ammunition\nHolster we supplied them so much more ring and you're only until I was a cash higher spending of the sounds of dollars more wherever\nShift so self is a large vote show this weekend like what our county fairs around twenty four oh five she'll bark way Saturday nine to five on Sunday gender for [noise]\nUm J. foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called ... and here's how it works with Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down you get the lower rate with ratio we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've\nAlso ranked is highest in the nation for mortgage servicing rate shield\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to the records racial upheaval only about I'm thirty three year project has actually called for confirmation conditions equal housing Leonard licensing office he said I don't want them or thirty thirty additional conditions or loses may apply\nNicky with us on the Clark Howard show Hi Nikki how you doing All right how are you\nGreat thanks so your dad's done something for you that you're trying to figure out if it's nicer not\nYeah yeah so what do you mean the background I was going to check on my credit score during the annual credit report and\nI thought I was in the credit card in order to boost my credit score on the report it seems like they're the the credit card those under ... county was counting on my credit score so I wasn't sure if that meant\nI should get another credit card like for my cells to boost scores that one counted as my second one\nOkay great questions so you're are you an authorized user or a\nCo owner of that account with your dad leave I Am an authorized user\nRight so it depends on the scoring model and our our credit card company would report whether that authorized users status would be a particular note for you I assume your dad's a great player and that's just good stuff for you on the report or neutral one or the other\nBut yeah yeah but you're working you're out there doing your own thing now yeah mhm I Would much rather you get your own card another card yeah and then I close the authorized users status with the card you've had with your debt\nProblem for me is a saline in Bay or\nYes if if you are an authorized user and somebody doesn't pay it reflects negatively on you you don't have obligations of the debt but but the credit Ryan fouls up your credit and I don't want you paying it in your credit report any more for your credit score\nOkay instead I'd like you to sign up for an account credit karma or credit sesame or both of them\nKarma or credit sesame or both of them\nAnd you'll be able whenever you want to see what's going on with your credit to see a reasonable representation of your credit score every seven days for free if you want your able really to monitor\nWhat's going on with your credit okay yeah so that they might ask me credit sesame and credit karma All right and a lot of people do both completely free for both of them excellent\nSo and then once you figure out what your next card is going to be are you the kind of person who pays your balance and fall every month\nOh yes I I wouldn't I wouldn't want to keep\nAll right then I Would like you to get a reward card if some kind\nEither are there any uh any you use ... suggests\nYeah so if you are how much do you think you charge in a month\nOr hours oh I'm On a thousand are now\nAre out there and I know the card this city dabble cash city double cash will pay you two percent cash back on everything you do and the other alternative is if you're a customer fidelity investments get there two percent cash back card\nYeah city double cash oh look into that\nAll right and then once you get approved for that that's when you get yourself removed from the account with your dad\nMake sure you get that card first\nBattle to you and I'm I'm Glad that your dad's a good pair you're listening to the Clark Howard show [noise]\nThis is John Green and if your teeth or steamed some coffee tea or smoking Harris swabs is the answer in five minutes you'll see to shape wider teeth and in seven days six shapes even better there is no messy strips are trays that you have to leave in your mouth for an hour just wipe your teeth for five minutes and you're done to try and power swabs call one eight hundred six seven\nEight nine ... nine six night your bright white smile will have your friends talking about how great you look try at risk free\nOne eight hundred six seven nine o nine six night that's one eight hundred six seven eight nine ... nine six nine\nThat they were wrong and that under further examination the minimum wage increase did not destroy employment and in fact it did lead to net fat or pay checks for people because\nI had always held that the theory\nThat you would reduce hours that people would be scheduled for work and you will reduce the total amount of employment\nAt lower end jobs and on both scores it turns out I'm wrong at least according to this is deep dive research done at University of Washington normally when you have\nResearch that points a different direction than prior research it's the methodology and it's people who have an agenda\nIn this case it's the same exact people coming up with a different result\nSo\nYou know one of the things in life is you have to be willing to have an open mind and recognize when what your beliefs have been and what they'd been said at that those beliefs can be wrong and on this one\nAt least looking at one of the largest metro areas in the country the Seattle metro area\nI'm wrong and we'll see over time if in fact you do displace employment is wages move up and up you know we've had this big push around the country for which for it to the living wage which is a Fifteen dollar an hour minimum wage\nAnd I I have been someone who has felt that if you want to improve people's earning power\nYou get more skills you get the more training and you create a better position for them and the work marketplace\nBut it may be that it is about re allocating the pie in a way that I have never looked at and never respected as possible working at the pie as being a fix size I've never seen that perspective and now I say with all humility\nThat maybe there is some validity to the minimum wage\nTo you that may not be a big rally revelation but it's been held opinion of mine for as far back as I can remember\nJosh joins us on the Clark Howard show hello Josh\nHi Mr Clark how are you great thank you just plain old Clark is fine [laughter] yes say what's going on Josh\nOr so back in ... and Thirteen um I played for a university football um they had me under full scholarships\nFootball um they had me under full scholarship and during that first year or I received a back injury and\nOh I'm Sorry did it end you're playing career\nI was able to play for about two more years and then eventually had that surgery and and it did and so yes there\nYuk what position did you play it off as a guard the toughest you can be because people are coming for ... every single down\nYes there but it's all worth it [laughter]\nSo I'll let you know and I'm near high when I decided I didn't like getting hit that was the same position I played I paid it laid right off and serve guard\nI played on the left side so\nYeah were you obviously were much better than I was that you played through high school and three years of college\nI tried my hardest so that was a sheer\nWell or so from that I'm gathering something looking back five years is a hassle now\nYes sir Yes sir I'm\nHearing recently in two thousand Eighteen um I went to go and check my credit score on experience and before I even got to see their credit score I saw to charges that were\nUnfamiliar forming a again our feet I was on her full scholarship um have letters stating that I\nShould've been covered for tuition books the whole bill\nFor the university should have been responsible for these medical charges that are from long ago\nYes sir okay\nYes it and so now I have called the ah credit corporation to see what steps I can take\nA ban so long ago are now the university has a whole new stuff so that makes it a a quite difficult to communicate with them um and it seems to me that they of course kind of drug defeat a little\nAnd what I gathered from the credit corporation is that um is even if I go ahead and just have this myself\nI'm it will mark the mark as painful for the next month but the damage to our credit score will ask for six years and eleven months so\nAnd you're getting close to the end of that yes it is\nSo um as far as you paying a bill that was never your legal responsibility I Would recommend that you not pay\nOkay\nAnd not have any further contact with the collection agency odds are in almost every state in the country you're outside what some of the statute of limitations and that you can't be sued against that\nThose unpaid medical bills and but it is an obligation university had and even with the turnover in personnel I Would suggest that you make a call to the head of the alumni association or and or the head of the booster club for the football team\nOkay you know 'cause the ones that are involved with the booster clubs they are intense\nAnd they are very influential on a college campus and where others are are avoiding responsibility for a bill that belong to the university people in the booster clubs may be able to get the university to do what they should have done originally and should have hot too once notified by you\nResting okay\nBut otherwise if the university just blows you off it means that when they try to hit you up for alumni contributions\nOr they don't get those for you right but\nIs as far as the bill let the clock run cars so little time is left\nOkay All right so a question just just follow up the\nThe actual money that is owed even after that term is up and it goes away from my credit score does that money stay on my head\nNo so remember as far as being on your head if you will once the time period is passed to be able to sue against the debt basically it's just a reputational thing which is what it is now and then that reputational thing ends at the they said six years eleven months\nAnd I've never heard that is the exact time usually out here six years nine or seven but anyway it goes away\nIt doesn't mean that at some point or was it was a scavenger collector may ten Twenty years from now contact you about it but you have no obligation in any way shape or form or fashion and it can not be used in any way to harm your credit wants to seven years his run\nInterests than okay\nSo you can rest pretty easy about this because the clock doesn't have much to run\nOkay but if you want to try to get the bill paid hit the pressure points that unit\nBill paid hit the pressure points at the university okay and best to you as one fellow offensive guard to another one who was good at the game and one who was not namely me\nDon's with us on the car to our show Hi dawn hey they're gone you have a question for me about credit let's see if I can be of help\nOkay so um I've got a good credit rating but I'm ... and not paid off my credit card so I'm feeling great about that\nBut I've got one more credit card that's got a pretty large balance on it and I'm\nTrying to find a maybe a credit card company that I can transfer that get from the higher one she may be one with a zero eight PR for twelve to Eighteen months and giving me time to pay it off the interest charges are astronomical\nSo there are fewer of those offers right now than there were a year ago and the reason is is that interest rates have risen\nAnd its costs and credit card companies more money if they extend zero percent to you\nSo what you may find here or there is zero percent transfer but they act they often will ... interest in it within up front usually four percent of the of the balance you're transferring that they didn't give you the twelve or Eighteen months interest free\nRight yeah I've seen that and I'm willing to do that said that I can transfer the balance do you think that that's just not a good idea\nTo no no that's a fine idea if you think you can kill off the balance in a year and a half if that's the offer then yes go for it because right now you're looking at an interest rate mid teens yeah\nYeah so if you take something from somewhere in the mid teens and you take it down to you pay up front I so I don't know what the actual when Putin interest rate would be but obviously a lot less than paying Fifteen Seventeen Eighteen percent\nBill that has now we're ... trillion dollars what happens next rising inflation drops in the dollars have some experts say another crashes coming you can fight this not with stocks or bonds but with gold and silver coins an IRA from Augusta precious metals\nCoal eight five five eight five eight five eight oh seven and learn how an IRA backed by physical gold and silver can hedge against inflation calling us too precious metals right now at eight five five eight five eight five eight oh seven and get a free gold Irish guy call eight five five eight five eight five eight oh seven\n... media group station [noise] twenty four hour news weather and traffic\nFive five and am settled it\nAsked me to his name\nIt's twelve midnight on Charlie ... twenty four hour news center top story this hour ... top national story the feds have a man under arrest and that's scary series of mail bombs mailed to prominent Democrats\nI'm Jeanie do pre in Washington\nWe have arrested sees are say a with a suspect now in police custody these are not hoax devices FBI Director\nChris Wray said if things are ... from a bomb sent to congresswoman Maxine Waters gate investigators their break\nWe have confirmed this fingerprint is that the seas are saying I re warn\nThe public to be vigilant saying other bombs could still be in the postal system and not yet delivered\nDouble your best be news time twelve o on channel two meteorologists bread Mitt calling for Patsy fog right now over ...\nCloudy day coming up and live as most accurate and dependable forecasts straight ahead the steel thirty eight thousand dollars worth of guns and charity care is that a gun group raised at a gun range in Roswell October twenty they smashed vehicle windows well group members were at a restaurant later\nPolice say the you've got away with Eighteen guns from three cars and the charity money that was to fight breast cancer they included and they are Fifteen\nFirst first this is double you asked me twenty four hour continuing new President Trump\nHas lecturing the media he's accusing reporters\nOf trying to quote used as soon as their actions of one individual to score political points against him his remarks coming hours after police apprehended a Trump supporter\nIn connection with the mail bomb scare targeting Democrats and CNN [noise] it's a Georgia Bulldogs football Saturday on W. S. B. today's is the biggest gave her the season for number seven Georgia against number nine Florida several us bees Jay block is in Jacksonville\nThere's been plenty of fun to me had this week in the shadow of the stadium maybe ... and they're a lot of New Hampshire but now it's time to play ball with a dog is a major recoveries made it you kind of neat things like that sometimes to kind of humbly defensive lineman Jonathan led better the last two weeks ago put UGA in a tie with Florida and Kentucky for first in the division\nSo the winter today stays in the heart but he has he can't be in the game the loser does not don't make it too big a deal is going to be a physical to war as coach curvy smart or tailgate feels north and eleven thirty kickoff return in Jacksonville type like all of us in\nThe neighborhood once part of Atlanta is now in the city of Sao Fulton the Georgia court of appeals ruled Wednesday that the lock Lohmann neighborhood was annexed into Atlanta improperly in twenty sixteen\nWalk Lohmann stays in the city of Sao Fulton because it limited not a ... before south Fulton said its boundaries WSBIU sports the bulldogs him gators doubled us be pre game eleven thirty this morning kick off three thirty PM WSBIU news time twelve o three\nBrian Kemp Stacey Abrams Georgia's future is in your hand followed George's race for governor every day we got played Erick Erickson and the ... largest news team nobody covers the jury selection like new Ninety five five Pan Am seven fifty now when you asked me penned on\nIt hey although Halloween is a holiday for the scares in surprises choosing where you buy your next vehicle shouldn't be\nThat's why I gladly river all my friends and family to a gym now the Chevrolet why because they always go above and beyond to exceed my expectations kind of like those houses to get a full sized candy bars and Halloween and the savings well they're hard to beat especially this time of year\nRight now Jim Ellis Chevrolet you could say twelve thousand dollars often is our pee on all twenty eight teams Chevrolet tacos in suburban ... number T. A. H. one to seven\nIt's in Mississippi is fifty three thousand nine Seventy one after rebate to the gym now the Chevy discount you're paying just forty one thousand nine Seventy one just added ... states the ticket for me by your next vehicle doesn't have to be a fight field experience especially when you could shop by and trade your way a gym now the Chevrolet\nFor more details visit Jim Ellis Chevy dot com or stop buying Peachtree industrial just inside the perimeter\nTell them Scott slate sent you to find new roads this fall to Janelle the Chevrolet okay now bee Jay's members urine\nOK non bee Jay's members you're invited to check out the reinvented BJ and enjoy lose the member saving BJ's now offers digital services like same day delivery grocery shopping dot com and picking up in clubs and downloadable coupons welcome one and all through November ...\nYou're going to\nElse maybe it was done promo for an outlawed dream coverage of traffic and wherever it starts with a couple of ... and Richard With Malone and currently are\nWatching a travel advisory in ... county it's on the west freeway I twenty westbound past riverside park way exit forty six\nOverturned vehicle possibly looks like all linked to block the traffic is getting by on the left shoulder you are seeing delays and we'll let you know if this turns into a red alert downtown on the connector they\nCleared that rats Seventy five eighty five south down at I. eighty five no delays traffic ... by Jasper jeep Jasper jeep dodge Chrysler ram\nBrings you jeep adventure days and all new vehicles no dealings sees no back and forth negotiating just great deals Jasper ... dot com I'm On ... W S P\nSatisfaction is meteorologist spreading it with them as most accurate and dependable weather forecast temperatures hovered near the fifty degree march through the overnight and early morning hours of Saturday a mostly cloudy skies through the day with a high of sixty it'll be bit breezy in the afternoon\nWest Wing Fifteen to twenty miles an hour on Sunday mostly sunny actually started at forty eight will tap out near sixty eight and then on Monday continued mostly sunny low fifty sixty six\n... clear fifty degrees from Peachtree treated\nProvo six aren't Germany O'Brien amusing five five and seven fifty WBEZ to depend on it for\nLove Fox News radio studios in New York City you opinions and back with bonds that overrode Brian kill me\nThanks so much and welcome to the latest edition of the ... it's going to be a big our doctor Larry shadow the bottom of the hour when you talk about them in terms of your watch you in the stream or see George Papadopoulos in Studio for the longest time we saw the former foreign policy advisor\nTo the president then candidate Donald Trump\nWe saw some video and we heard about that he had a plea deal as all revolves around the Russia investigation you're about to hear from George himself after going behind closed doors with Congress yesterday to tell his side of the story and if they are starting the Russia investigation and the ... probe because of what George Papadopoulos said\nIt said it stands on a a on a very a week for\nAnd George is about to expand on that\nSo before we do that as well as follows a nother discovery of a package and they would be bomb that just happened in New York City is the eleventh package before we talk about that let's get started now with\nThe stories you need to know Brian's big three numbers sorry\nIf he testifies publicly based on what we just heard today or I think the American people would would side with George Papadopoulos uh uh regardless of party or when you hear it\nA dad is Mark Meadows after going behind closed doors with his congressional colleagues and hearing George Papadopoulos his side of the story and why he took the plea deal the ... how does it start\nWhat did he get what does he have well it all started with George and he joins us now they'll I'll talk to him and just a moment what I Believe we'll find out and concluded we're beginning to look good that this whole thing was set up a set up a Donald Trump\nNumber ... we're worried about that does make it very clear caravan cannot commentary and I'd say they will not be allowed in and will not be allowed to stay\nA dad is a crucial a Christian ... Nielsen she's homeland security secretary she was on the story last night at the border the caravan of between four and eight thousand men and some women eighty five percent are men it seems are going to be stopped by the ... the United states are they getting the message\nNumber one and it is fair to blame some sense the president's rhetoric and our president cannot escape special scrutiny\nToxic mix up to hear that embracing dictator the tone and coming from the top and now than it has become a target\nYeah there you go a suspected explosive devices after multiple packages found with bomb making material authorities are getting closer to arrest him a suspect well we know is our as targets are all Trump attackers does it make it does it make it right to blame the president\nStruck his the disgrace FBI official in charge of counter terror that had the affair with Lisa Page let's rent it foolishly use government phones to text messages his hatred for Donald Trump and a plot and plenty\nFor Donald Trump and a plot and plan emergency plan to take him down should he when he won is this the plant it it it certainly\nLooks like it and uh you know there was another really interesting piece of information that came out from these exact text messages or you just referenced or the day I mean Joseph ... in Rome Peters truck has touched thing Lisa Page about their overseas contact now talking\nNow unless it's just so crazy coincidence that on the same exact day that I may Joseph ...\nPeters truck is texting Lisa Page about an overseas contact of theirs was now talking I don't know what to think about this\nThey could be you more with George Papadopoulos or the day after his testimony behind closed doors this is the brand kill meet ya\n[noise] giving you everything you need to know is Brian Gilmore [noise]\n\nCake one atom of nitrogen bonded with one atom of oxygen boom you just created nitric oxide miracle mile ... your own body makes that fuels your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generate more natural nitric oxide super beach by human has harness the power nutrient rich beach and created a super food\nThat helps your body make more nitric oxide on its own the core possibly of human is to develop heart healthy products for your body one teaspoon of super beach daily support your cardiovascular health and blood pressure levels giving you\nNatural energy without the need of a quick caffeine kick or sugar high we're talking real\nHealthy natural energy so called eight hundred five point one twenty five sixteen to go to Brian speech dot com and find out how you can get a thirty day supply of super beach and free shipping with your first purchase\nField but one plus one equals boom effective super beach called eight hundred five for one twenty five sixteen we'll go to Brian speech dot com today\nIndividuals and businesses with tax problems listen carefully\nDo you feel like you're losing control over your finances\nIf you over ten thousand dollars in back taxes or ever an file tax\nReturns we can help you take back control the IRS is the largest and most aggressive collection agency in the world and they can seize your bank account garnish your paycheck close your business and filed criminal charges take control of your tax problems now by calling the experts that tax mediation services and take advantage of the fresh start program and\nNew laws that may allow us to negotiate a settlement for the lowest amount possible our team of tax attorneys and enrolled agents getting stuck elections and get you protected\nSo you can take control of your financial future tracks mediation service is accredited by the better Business Bureau call now for a free case review and a price protection guarantee quote\nCall tax mediation services now at eight hundred three one six four nine three five that's eight hundred three one six four nine three five eight hundred three one six four nine three five\nA DUI conviction could get you fired get your license suspended and increase your insurance rates hey it's Eric fun has slur I recommend you talk to my friend George side the DUI lawyer go to George Stein dot com\nYou as the housing market [noise]\nSomething happen quietly in the housing industry right now no one's willing to\nTalk about it's not a great time to buy a house in metro Atlanta ...\nDon't tell anyone that might get me in trouble 'cause people in our industry housing that is they don't like the truth the truth is I had a seller call me in Roswell, Georgia this week which caused me to spend about Ninety minutes running data hurting it to a specific price range and I call that the bread and butter\nOf the housing prices in Roswell almost seven months worth of inventory on the market right now that's not good that indicates by the model of what we call housing absorption rate\nThat we'll see depreciation in that segment of the market if two to five percent over the next six months that's that's kind of alarming\nWe're seeing this in other parts of the market first Gainesville then coming now we're starting to see slow sales in other parts of the market is it a bad market no we're simply adjusting for an eleven to Fifteen Percent downward pressure on pricing because of rising interest rates on top of that people bought homes this spring and early summer\nIn anticipation of rising interest rates in the number of buyers on the market now for that reason are much lower so what do you do if you need to sell a home you don't do what everybody else is doing rent it through the winter\nKeep it for a while and wait till the spring makes everything better no it's not gonna happen prices will fall slightly this winter in metro Atlanta\nWe've already seen the median or average sales price in metro Atlanta according to MLS come down from a high of about two hundred sixty thousand\nTo the low to forty if you need help selling a house you need an agent who knows how to do it the right way and that agent is on our team the real estate experts dot com get a free housing valuation right now at no obligation house hunting online\nHousing valuation right now at no obligation house hunting online dot com how was your home value holding up a free instant valuation on line now house hunting online dot com Brian Crabtree on WSBIU\nMy wife and two daughters use a lot of hot water but overnight tank with water heater never runs out even if I'm the last\nOne to shower Hi I'm Daniel J for reliable with a board about tank less water heaters\nEnjoyed the nation's number one selling tank with water heater without spending thousands let my team and stole overnight tankers water heater for just forty four dollars a month that's right forty four bucks a month no upfront costs lifetime or parents services including simple enjoy endless hot water color checks seven seven five nine four Ninety nine sixty nine forbidden reliable layer dot\nCom and he was Ninety five five and a um seven fifty\nListen I have if he testifies publicly based on what we just heard today or I think the American people would would side with George Papadopoulos a regardless of party or when you hear it and and yet I don't I don't see a public hearing happening just to be Frank\nSo you basically and that is Mark Meadows and you said you George Papadopoulos here in Studio he said I Want to go public and they said was who you do better behind closed doors in retrospect was he right\nUm I don't know about doing better or not but maybe the things I was talking about we're very sensitive and perhaps that's why it was better to do it behind the scenes you have three countries\nComing at you Britain Australia and the U.S have in the United states FBI [noise]\nThat's right and to this day I don't understand why I had this particular ... target on me considering the we have the most sophisticated intelligence agencies in the world working here at home and what the UK and Australia they of course knew I had no rush of contacts I mean you could just simply do a background check\nSo obviously I wasn't targeted for that I was targeted for some other reason and it's not my job to figure it out of the jobs of you and the other reporters and probably Congress to figure out why Papadopoulos was the target\nAnd George of so lawmakers they read the transcript of your conversation with ambassador down or said my biggest mystery is why would George ever take a plea and make guilt from lying to the FBI after reading this is what am I ... he asked me what am I missing I don't know what why did you take a plea\nI'm ... [noise] well\nThere's a reason I have a new council now and I'm looking at all options to fight this and are really as I said on a TV earlier with you I just want to make sure that what happened to me never again happens to any American and if I'm going to fight this is not just for myself it's for any American citizen who might be targeted lawfully are lawfully by our government\nSo you're looking to possibly overturned that play up to take it back absolutely a that's a risk with\nThere's a risk but you know what it's a it's a it's a worthy of risk because um my reputations on the line I think the integrity of this entire investigations on the line and sometimes you have to think of the greater good and not just yourself who's your interaction with the mother probe like um I I really can't get into too many details about my exact interactions with them but um as I said I'm looking to fight this right now so\nUh the the ... going to come out with a whole bunch of indictments evidently after the midterm elections if it's based on George Papadopoulos and they build from there what's your message to the ... um I have\nAbsolutely no idea who they are looking at or what they might be doing all I can do speak for myself and the um if ... as I stated earlier I was targeted by western intelligence there was absolutely no reason I should have been prosecuted here is a Mark Meadows cut thirty for\nWhat's troubling for me is today a there is even a greater confirmation in my mind that there was inappropriate behavior on behalf\nOf the FBI and the J as they initiated this investigation as they continued with the investigation and as they continue tonight and give information to or whether it's Mr ... council or the American people are Congress\nBecause you have to put this together and you're you're not giving you information about you a ...\nLook if it wasn't for the great work of a certain reporters I to this day I don't think anyone in this country let alone me or any council of mine would have known that there was this exculpatory evidence\nAnd you see it very interesting that this myth said at the helper a down or the one thing in common they don't like President Trump and from Memphis it missed it worked it seems with Christopher Steele to on earth to corruption with the world cup\nAnd that's how that's how Christopher Steele got the trust of the FBI and now they're working together to get you and Donald Trump\nYeah but I mean you have to I think you start with the Senate because that has always been the Republicans talk goal that if they lost the house they had to keep the Senate and they have made progress there I think it's you know a long shot and now the Democrats would would win the Senate\nOr the house um you know what you said is absolutely true although really you're taking it from somebody else you're just borrow that there was an original\nI'd I'd like to do but there is there is is palpable fear out there on Democrats\nThey keep having these flashbacks to election night\nThey keep having these flashbacks to election night twenty sixteen and maybe they should but I'm just saying I'm it's somewhat irrational every election as\nDifferent or you're not going to have the same factors at work but they they were stunned really in shock for for weeks after the twenty sixteen election and they're worried that it's all going to happen again well maybe it will maybe it won't there's no sense worrying about it as one of those things in life you can't control\nSo the GDP it when it was it four point to last quarter and a half three point five to two very good numbers but\nNow you have the tax cuts and the original premise was hey are Republicans running the tax cuts and new one is we could this caravan and ... immigration and this is what we're talking about and it's not a ... it's not a what is it is it's happening or the Republicans running on the right thing\n[noise] well look this election is all about Donald Trump just like a Michael Steele was suggesting\nMaybe not the way he was interpreting it but Trump has placed himself at the center of this election he was going to be the center anyway Democrats would have made in the center of it if he had made in the center of it\nAnd most votes are going to be cast in reference to him that's not to say that issues don't play a big part they do for Republicans\nOr immigration has been at the top of the list for three years and that's why the caravan you know what I hear people say that Democrats funded the care of it I have to laugh it should be Republicans funded the care of that 'cause it's helping candidates it's putting immigration front\nAnd center right at the critical moment of the campaign the final days of a campaign\nSo Kavanaugh the caravan a and Trump himself that is that's what's driving the Republican side apt to some degree the Democratic side\nWhich drew down on this is what Democrats have been saying some current trouble exist in the majority of non white districts were Democrats worry about turning out the Hispanic vote they have or just given up hope of an seeding will hurt you know who goes against the president on the wall and other things in these uh CIA guy remarkably competent and diverse\nBut and and and another uh now I Know you're over also in California so what's going on for your numbers tell you about the Hispanic vote in America\nWell there's great concern I Know on the Democratic side about getting a good turnout because they didn't get it and twenty six team I mean it was Hispanics African Americans and millennials\nWho did not turn out it anywhere close to the rate they were expected to and of course that made the difference\nSo they've detected relatively low interest among Hispanics in the mid term election and and normally frankly\nUh minorities and millennials don't participate in mid term so that's kind of a built in structural advantage for the Republicans [noise] uh so you've always got access as you mentioned will heard what parties need to do and they have done to a certain degree is to allow the district to dictate the nominee\nAnd in the case of will hurt that's a moderate district relatively speaking yet close competitive modern district and will hurt has played that correctly he's he has used the issues that help him in avoided the issues that hurt him and that's why he's the favorite\nDoes that make sense and by the way we need people like this who are going to have the lucrative security careers I got a chance to norm little bit when they go back in the service where it's pay okay but you go into two places on a regular basis\nYou're not you it's truly service and for Republicans to criticize will hurt him thinking to myself what do you want in a candidate they all can't be speaking from the same him she then you're not serving the country don't you agree Dr ... well\nYeah and also you can actually get a majority if you insist on that you can't have everybody looking and sounding exactly alike this is a very diverse country\nAnd so you have to adjust the nominee to the district and and really vice versa during gerrymandering but and you're right what people think that Congress Miller very well off and so and it's all of them are some of them are very wealthy before they come in\nBut for relatively average people of modest means and they're quite a few of them in Congress it's a struggle to run a household in DC and another household at home because frankly Brian not everybody makes you kind of money\nRight uh exactly you know except not even close not even close friends you know how did he gets goes you know handling yeah well\nWe're not he's probably doing just a little bit better so he owes you\nRight now yes and put it this way my helicopter is not a new when he gets a new helicopter he leases them mine I I bought an old one and refurbish\nAt all like for me I insist on a new jet every year to contract\nAll right so having said that when we leave transportation for just a second and again I blame you for getting us off track and tape that I'm a hundred percent correct\nYes Peter promised means go cut that part of who is ever have a record of who is Peter I got to meet him he's ... he's one of your uh\nI got to meet him he's ... he's one of your of hundreds of the system the exact they're running some machine Tom\n... runs the DNC tell me if he's playing a game or is he really worried\nWe will look at their reaction was going to be close I don't use the term ... I I always talk about the name for the blocking and tackling\nI Know a lot of people talk about this new wave and all that so I don't believe I happen to think of a lecture night you're going to find a very very\nClose situation and and maybe a handful of votes determining whether Democrats or gain control of the house\nAnd so are they just plain down expectations Bernie Sanders and ... just a pushing aside the blue wave trying to motivate people\nAnd well it's both really I mean basically they're saying ah I'm having flashbacks twenty sixteen I'm afraid\nThe other half of it is a they have to insist that the election is very very close to get there are people out because many Democrats aren't used to participating in midterms so it's it's a bit of both uh in the middle of the night there having the twenty sixteen flashbacks\nDuring the day they're trying to motivate the Democratic party constituencies\nIt's hard to comment on breaking news but we found another package on this one to James Clapper in New York City when I started the show walking upstairs they found they looked like another package was heading to Cory Booker\nI Do hear that they're close to an arrest but so far that hasn't stopped the packages that were seemed to have been put in a put in place some point this week when you look at this and we hope no one's heard and they seem to be a bomb making material but no there's no one nighter there and know blasting cap thankfully\nOr having said that who does this play more for the the Democrats who say that the president's language is causing this or the Republicans are who are security a party\nI wanted to see who it is and maybe it's a person maybe as persons that you gave me some good news I hadn't realized they were close to an arrest I'm thrilled to hear that\nBecause this is intolerable it I God Knows I Hope that one hundred percent or maybe Ninety nine percent knowing knowing our country as we do Ninety nine percent would agree this is absolutely unacceptable\nThis goes way beyond the bounds of of anybody's definition of a discourse in politics so let's find out who did it let's find out what the motives were\nThen we can assess the damage if there is any maybe there won't be any effect at all politically but we have to know who it is and what the motives were\nSo how can a president and I asked this question yesterday without creating a great answer so all the pressures on you a president who's had three uh three hit books on uh from ... to Michael Wolff to Bob\nWoodward he had an anonymous staffer write an editorial talking about how we incompetent tea is he's had multiple people like Tillerson and reportedly Kelly basically comb an idiot\nBut yet he is now at forty seven percent of the wall Street Journal NBC and forty four percent of going to CNN approval that's just about just above President Obama\nHow did that and now he's ... and now he's trying to nationalize this election and making about himself I Know we have to rewrite and rethink everything and the Donald Trump era but can you make sense of that\nSure he made a connection with his people the people the forty six percent who voted for him that has endured of course you also have to say he made a connection with the people who didn't vote for and then there's also endured\nPeople made up their minds about Donald Trump a long time ago this additional information you just mentioned yet much of it it makes no difference if you're for him you're really for him if you're against him you're really against him I've yet to meet anybody in the middle\nYou do meet him you polled them I mean independence or undecideds you'd motivator to say\nNo but they're they've already made up their minds about Donald Trump they may not have made up their minds about who they're going to vote for in this midterm election because after all while Donald Trump is is center stage there are other people on the stage I mean the candidates matter their issues matter the ah the states in districts matter so\nAh you once again you're over generalizing Brian and I guess this is leading back to another discussion in another plug for your book\nRather be in and I'd better for it and it just makes me appreciate rags daily eating Aaron plumbing and carry or even more um Iraq deal maintenance customer now so I Know if there's ever a problem with my heating and air system there'll be there quickly with amazing service and know how to get my furnace up and running in no time with no scary trip to the basement\nI recommend ... eating an air to all my friends or family because they get it right I trust ... name you know you can trust ... a factory authorized carrier dealer ... carrier turned to the experts\nThat when you ask me about ... er Cox media group station\nTwenty four hour news weather and\nFive and a um seven fifty\nMe too\nIt's one o'clock on Charlie Oprah and live it up and give us twenty four hour news center story this hour definitely give us his top national one it would be terrorist is behind bars this morning ABC's they'd Schreiber as the update\nFederal officials have captured a Florida Man with the criminal history and the fervor for President Trump accused him of tend to get at least eleven mail bombs two prominent Democrats Justice Department officials have announced by federal charges against ... say Iraq\nFifty six of adventure of Florida critics have suggested that President Trump's antagonistic tone toward Democrats could have contributed to the hostility behind the actions it'd be she says she'll your bagel broach the subject with President Trump\nDown down you ought to know that I could really do that because as you know the media's been extremely unfair to me and the Republican Party with all of that they said we're winning I liked that\nABC Cecilia Vegas interviewing President Trump former vice president Biden says the U.S has to come together ocean concerned with partisan division date Schreiber ABC News\nW ... time one oh one channel to meteorologist Brad mid going forward patchy fog overnight a cloudy day on the way it is most accurate and dependable forecasted straight ahead\nSuperbowl fifty three and a lot of will feature Grammy Award winning germane to pre producing the music for a Super Bowl live it's a week a free music events leading up to the game February third in Mercedes Benz stadium you'll produce the music acts and evening concert at San Antonio Olympic Park\nFirst tourists there says he is W s me twenty four hour continuing new newly\nWed DeKalb County woman is dead and her husband in intensive care after a man sprayed the car with bullets Monday Night that killed thirty five year old leashes Stevens and put her husband in intensive care Stevens' sister to refill details channel to actually use\nSeven then shot room and he had one close to ... temple got one under his tongues well above plus I Can't really top\nPolice have arrested Nineteen year old Carlos Rodriguez for the murder\nAfter the incident at a Popeye's restaurant in life ... today is the last Saturday for early voting before the midterm elections November sick all already rosy ends friday November second\nSome George's County is also offer early voting this Sunday People can only vote in the county in which they are registered WSBIU sports the dogs in gators on WSBIU Radio Free game eleven thirty this morning kick off at three thirty W. S. B. news down one of\nThree twenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way we can we do pre and the southeast largest news team news not eat by five and am seven fifty don't you ask me\nWhy conviction is life changing with serious ramifications both personally and professionally it could cost you your career and threatened your way of life\nIt can turn your world upside down\nHey it's has bought ... with all this on the line trust only the very best George Stein the DUI lawyer he literally wrote the book on DUI defense in Georgia you got a thirty day deadline to save your license got a DUI problem be smart get George died the DUI lawyer George Stein dot com\nThree years ago my mom nicely hiring who had type two diabetes out of high\nSchool we didn't know that if you have diabetes you're a two to four times more likely to develop cardiovascular and what's truly shocking to me and\nMillions of people living data aren't aware of the increased risk of heart disease or what will it take ...\n... if you have type ... diabetes a new ... new your risk of heart you know you're in\nBlame now when you're in the dining room no matter how you have to\nYou know your heart disease\nThem more time\nFor your sweetheart ...\n...\nGet WSBIU news weather and traffic flash briefing on your Amazon device on your Amazon a less apt to go into skills and search telling us the radio now you can enable your flash briefing to deliver news Ninety five five and am seven fifty W s the nominal\nRecipe and it was done one over ... team coverage of trafficking whether it starts with a double your best to be twenty four hour traffic center\nFor your starts with a double your both be twenty four hour drive ... and ... with my mom and you can earn\nWorking Iraq in ... county on the west freeway I twenty westbound cats a riverside\nPark way delays have diminished and stay open up most lanes just the right lane block their exit forty six looks like there could be some new trouble on bad outer loop in Fulton County ... five\nSouth down between camp creek parkway right before a camp creek parkway we're following that for you and if you're coming through downtown Atlanta you got to go speed limit both directions traffic ... by compassion international food water education and more is what you'll give a child in poverty\nRelease a child from poverty compassion dot com slash radio ... W. S. B.\nSatisfaction as major I'll just spreading it with them as most accurate and dependable weather forecast temperatures are going to hover near the fifty degree march through the overnight and early morning hours of Saturday a mostly cloudy skies through the day with a high of sixty it'll be bit\nBreezy in the afternoon west wins Fifteen to twenty miles an hour on Sunday mostly sunny actually start at forty eight will tap out near sixty eight and then on Monday continued mostly sunny low fifty sixty ...\nGovernments pretty storm drug are ready to our roots clear fifty degrees I'm Peachtree greeted one oh six I'm Charlie O'Brien amused Ninety five and a um seven fifty WBEZ pretty depend on\nLive from the Fox news radio studios in New York City fresh off the set of Fox in France sees America's receptive boy\nRyan kill me\nEverybody thanks so much for listening we got her author of air and shouting bring this hour also remember you can get the gas to add a brain kill me Joe dot com first hour is free and I got to tell you today I'm going to be in St Louis were almost sold out a reformed your tickets so I don't\nDo want everything sold out so go ahead and do it a Ninety seven one fans I cannot wait to meet you in person I'll be speaking dealing with a talking with the morning superstorm er Cox and also be able to take your questions in sign Andrew Jackson America New Orleans now at a paperback\nWith a brand new afterword a lot of breaking news to go over including and a couple of packages found one for judge James Clapper and won a targeted for Cory Booker these are explosive devices but there was no explosive material or blasting cap or gun powder on the inside but it's still concerning\nAnd jokes that looks like investigators zeroing in on Florida victory\nNow with the biggest things you need to know who the power of three Brian's big story the numbers hurry\nIf he testifies publicly based on what we just heard today or I think the American people would would side with George Papadopoulos a regardless of party or when you hear it\nOr George Papadopoulos who's just in studio is clearly been a cutout Apache a it is unbelievable with this guy has been through simply because he was an unpaid adviser to Donald Trump\nWe unwound just story I'll bring more of it to light that he can but he finally had his day to tell his side and it looks as though the Mueller probe is built on a house of cards the number of\nWhat we're worried about that and make it very clear caravan cannot town of ... and I say they will not be allowed and not be allowed to say\nGod that is true accused in the U.S in the homeland security secretary\nMade it clear with Martha ... at the border that these thousands and thousands of who are still on this caravan caravan up from Honduras will be stopped eight hundred soldiers and executive order as I'm going to the border [noise] number one they\nFair to blame and hung up on the president's rhetoric our president's cannot escape special scrutiny\nOf toxic mix up through years of embracing dictator the tone is coming from the top and now CNN has become a target\nYeah was Annette nice suspected of ... suspected explosive devices after multiple packages found with bomb making material authorities are getting closer to arresting the suspect\n[noise] I have not talked to the president in a almost four weeks\nOkay I I Do believe in according to reports say he's really enjoying it may be for the first time\nAt well he certainly was having a good time when I talked to a he's a you know I think a lot\nHas to do with his tapping now I think he's finally gotten to a place where ah you know first of all you as the competition between John Kelly and and uh uh John Bolton the typing is healthy healthy ah tension and you know he's got a our own ah does shine one of the most brilliant media executives on earth\nNow uh you know I at his uh it is right or his right shoulder they're backing him up by I think the weeding out slowly or the deep state types who want to sabotage him a and I I think he also senses are with the economy and with his uh his\nHis poll numbers are getting rosier a you know picking up a that he may really have a shot at being a a very good if not a great\nHe is Geraldo Rivera her all the best of luck watch all weekend\nA very good if not a great person he is Geraldo Rivera Geraldo best of luck watch your weekend\nThey spread it on in the mid west you got people out\nThere that you are at her other of air as opposed to follow me ... got to be your calls wanting to fix for all eight seven six six died and if you want to know where all being hopefully it's near you go to Brian kill me dot com just click on tours\nAndrew Jackson milk of New Orleans now at a paperback with a brand new afterword this is a bright kill me Joe Bryan kill made [noise]\n\nIf you're like most of us you have a balance on your credit card in higher interest rate than you would like why not turn those balances into one monthly payment at a lower fixed interest rate and start saving money\nLife's dream offers credit card consolidation loans from six point one four percent a PR with auto pay you going to get a loan for I don't know five thousand to a hundred thousand dollars you can even get your fund as soon as today you apply white dream was really cool to police that people with good credit deserve a great interest rate would know fees can you imagine that\nMy listeners out conceive even more with an additional interest rate discount on top of ice creams already low rates\nThe only way to get this discount is to go to light stream dot com slash kill me ...\nThat light stream L. I. G. H. T. S. T. R. E. A. M. dot com slash kill me subject to credit approval rate includes zero point five zero percent auto pay discount terms and conditions apply it offers a subject to change without notice does it live stream dot com slash kill me for more information\nHere's a special message for those who owe the IRS at least ten thousand or more in back taxes the IRS has special programs in place that could eliminate or reduce your tax dead by\nThousands of dollars a call the federal tax management help line that has been set up for you eight hundred to three three eighty five forty stopped the wage garnishment celebrities and tax liens now\nOnce you've qualified and enroll the IRS will stop all the collection activities against you these unique programs have been allocated to help the economy and significantly reduce or eliminate your tax burden the IRS is currently accepting reduced settlements and other favorable programs\nYou may qualify for substantial savings so get the help you need if you owe more than ten thousand in taxes call for free information and to see if you qualify take down the number now for the federal tax management hotline\nEight hundred to three three eighty five forty that's eight hundred to three three eighty five forty eight hundred to three three eighty five forty [laughter]\nI don't expect a USB sponsors listen all next week to the mark Arab joke for your chance to win tickets to seat Jeff lens E. L. O. friday July fifth at state bar marina known for their ethic\nLive shows and a distinct styled it blends rock pop and classical music the yellow had more than twenty top forty hits across the U.S and the u._k. tickets go on sale Monday at ten am ad live nation dot com thank you thank you for supporting the sponsors were not probably five or seven fifty oh you asked me\nAre you scared of the one just before your lights go out who knows how long you'll be sitting there and the dark it's automatic backup generator kicked saying as soon as your power crashes but you need to produce a design your system generators or not one size fits all\nSo get your free system designing has met when you called ... box electrical I'm Dave ... might experts who never leave me in the dark right box electrical get up to one thousand dollars off and two years maintenance for a limited time come right back to electrical and don't fear\nHi I'm duck to marry an author of elder care made easier did you know long term care is truly a woman's issue on average women live longer than men\nBecause of the longevity raped women act as the primary caregiver in our society and often use their own assets\nTo pay for others long term care needs as well as their own\nI encourage old women to get started today to protect what they have worked so hard for\nWhether you're married single or divorced separated or we'd have you should consider your long term care options to help protect your future [noise]\nIt is a simple solution that makes sense and can better your standard of living and care [laughter] you or a loved one become ill or disabled\n[noise] get more information and three and four need more dot com [noise] but the number three I N number more need more dotcom\nLike golf at a public worse that has the feel of a luxurious private club handheld toys for talks while you play hey\nAn athlete and\nJoined us a bears best to ...\nProceeds benefiting toys for\n... registration apple\nFind a link to\nPay the rent yeah not calm under\nAfter movie we\nBack everyone just finish up this half hour one eight six six eight seven six six nine when al up to twelve packages sent out the various Trump critics across the country are well known weight is being James Clapper and Cory Booker\nSo they're all define and they got to stand up and we don't know who this person is and I hear and I've got pretty good source that are they're very close to to getting at least one of the guys so let's hope this happens within our show\nAs you know we're streaming as well as on local stations and I hope to see everybody in St Louis tonight is probably one of our most successful station certainly the greatest people with an unbelievable lineup so it'll be great to be in St Louis or the Kennedy library but\nWe're also seeing a streaming and I also do the Facebook Live some part during ah during Fox in France So a lot of people comment on that ... maybe you can get some comments up but let's go out to Scott and listening on Facebook or watching it on Facebook ... got\nA Brian how you doing good what's your name on ...\n... I Am a a Desert Storm warmth that I Am black\nAm a conservative and I'm a national is just like President Trump cause I Believe in American merchants first and I don't understand why the Democrats don't they say why they're there to serve the public that there are served this country\nBut yet they create chaos confusion in the fight they fight general manager of President Trump could have done if he does at their support or anything\nI I agree I mean all this I'm going to\nBe just to push back a little bit I Love when the president brought those cameras in and go shaded on camera especially when it came to guns and we came to immigration\nAnd I would not have minded and a lot of people going to be mad at me but I Would not have minded if the president got his twenty five billion for the wall and exchange for giving the DACA uh the DACA kids now young adults a ten year path to citizenship\nI Would not have minded that because then you go back and you realize the chain and lottery\nOr something even Democrats aren't very they aren't necessarily against ... to the beginning of possibly a cascade of deals now I'm being optimistic but they said the Democrats they feared he was going to start with infrastructure why\nBecause that would have made them play ball\nInstead it was his fourth or fifth thing and they said well you know what we we just we don't like what he's doing you know with this tax plan and everything else so we're not going to participate Scott if he could hold the house and Senate I think they're going to get stuff done I think they're going to get stuff done if they could hold the house and Senate by any margin\nI think so too I think so too I mean this the first time since\nI guess since Reagan that I'd been optimistic about America and the benefits are how America is that like you know I feel that President truckers do these amazing that that in there were just took desire to do right and he put\nA lot when I say he is\nThe secret garden ... said that you do this and what\nPeople being able to come in their own special interest heat and you only want to be about what he's doing we built this\nAnd try and I'm In reverse since these crimes actually occur in from the time these packages were males and placed in the mail saying they have to figure out what happened in between and where the packages were and try and pay all this together you know the the things we talked about before finding cameras plenty of potential witnesses right in the mail saying that had all these devices\nAre so that she was doing it and that's where we sent and I hear there's a there's a lot of activity in Florida right now we know Debbie Wasserman Schultz was on the return address for just about every one what do you think it means a Shannon and we're glad about this that these are bomb it looks like a bomb but there's no detonation ability with these\nRight I mean you know somebody that I talked to off the record who is also very deep into these kinds of investigations not this one in particular said you didn't have to really look at this if you're you know the people who are damaged the bomb techs and the specialists through the FBI\nThey know almost immediately whether something is a viable device or not unless and the authorities in New York have said these are not hoaxes these are potentially viable devices um but not one has gone off\nAnd apparently none of the packaging the way that normally they would expect something like this to be done if they actually want to hurt or killed people is that the packages booby trapped to go off when you open it they said that\nWhen you open it they said that wasn't part of it either so\nHe's adjust to strictly in the work quote terrorizing me to instill terror and people to frighten people\nOr is it actually about harming people I mean these are two very very different objectives and I think they know a lot more about that then they're saying at this\nPoint you're talking to shatter Bremer by the way is also an attorney handles or legal stuff here not my personal stuff you will notarized anything and that bothers me\nMore than he won't tell me I'm not er expanse aren't free\nDon't you feel bad uh charging as a notary\nI don't I don't know that I Need that four dollars and it makes a difference for me not want your document I'm going to need the four dollar\nThat's fun so a lot of people are saying the president should have taken a more conciliatory tone on his stump speech when he said he's fighting back and he's saying listen maybe if you weren't ripping mean Ninety two percent of the time of going just at CNN and MSNBC you wouldn't create so much hate usual Rush Limbaugh said cups of tea\nBecause they're not they are trying to pass responsibility of this off the Donald Trump and trying to get us to shut up in response and in opposition to we're supposed to sit here and said oh don't really know until we know the facts we can't comment while they comment left and right at the start rag among Trump\nFor his supporters or what have your while we're supposed to sit here and be polite and have good manners and not say anything about it\nAnd the that for the most part I Am stunned I thought on the Sunday show to get a lot of opinion and talking about President Trump's tone and Maxine Waters and the horrible comments Eric Holder said we're going to kick 'em and the next thing you know this was happening hours after the packages were found Shannon\nMhm so you're going to get worse until we find guy\nIt's interesting because guide Benson a vote apiece in town hall yesterday and he pointed to some um [noise] video of Nancy Pelosi after the shooting that nearly killed these ...\nAnd she was in a press conference and it it must have been within a day or two after this had happened the shooting it happened and she asked about those who are trying to link is to potentially someone on the left or somebody who was upset by the Democrats which we now know exactly\nHow that played out and her comments where this is outrageous how dare dare you go there it's disgusting this is a terrible event how dare you make any links between political ideology or try to blame this on anyone\nBut for the president for the White House they feel like that's exactly what's happening to them by now I mean we had a guest on last night um who was the deputy chair of the DNC or vice chair and Michael I'm Blake and he started immediately saying with the president bear some responsibility to that and I said wait a minute\nWhat exactly are you saying I mean the person who put these devices together and mailed them and put them into the stream to try it frightened people or wherever the objective was\nThat's the person who's responsible for this and he wanted to have it both ways that they don't put words in my mouth I'm not saying the president actually did this I think that what you're saying is the president's bears some responsibility for this and you have to be very clear about that because\nYou know and those conversations in the weeks a after Steve squeezed was almost killed there were a lot of folks who are objecting and saying it's not fair to tie to to a particular party and the truth as it is the individual who pulled the trigger or makes device that is ultimately the person that is very troubled and has a problem and they're the ones\nUh left or right or center or if they're just disturbed in some way they're the ones who made who have made this decision to um put things in a place he\n... the a ... that's a big topic or the other topic of course the midterms and the care of and but I Want to bring into the Robert ... because on radio and TV we had George Papadopoulos remembers the twenty eight now thirty one year old who was a unpaid foreign policy advisor who pled guilty to lying to the FBI\nNow he's starting to put his whole the series of events together and he believes the D. O. J. and the FBI along with three separate countries combined to set him up\nBecause they didn't want to be president only did become president they wanted to hurt him and he uses evidence\nOf actor John ... his uh uh uh his original contact\nThose original contact in England it was a mall is a professor and now we find out a working for British Intelligence\nAnd then we find out to the ambassador down or Evans says Clinton ties also supposed to be linked to Australian and British Intelligence\nAnd now we also find out this step and help or an American who worked for the FBI all targeted him while he sat in house arrest in Chicago apartment watching all this money go out the window he wants to know over a overturn\nA overturn his conviction and his plea here's what Mark Meadows said after going after hearing what do you have to say behind closed doors yesterday and the committee hearing cut thirty two\nI can tell you that I Am very trouble that his Fourth Amendment rights may have been violated and that the way that this was conducted was certainly inappropriate and not what we would believe to be standard protocol for the FBI\nDidn't like it and he went on cut thirty three\nKnow listen I have if he testifies publicly based on what we just heard today or\nIt's heard today or I think the American people would would side with George Papadopoulos a regardless of party or when you hear it and and yet I don't I don't see a public hearing happening just to be Frank\nNot happening but he was pretty moved by what he heard behind closed doors what are you hearing 'cause he's starting to realize that all these people were setting them up\nI think it's really interesting your interview this morning I'm which of course I was on wait to see it but I've read the transcripts or he lays out a very interesting set of\nEvents and circumstances in people and timing that raises a lot of questions I think for anybody who had a real desire to know exactly what was happening with it that's the case and how it got started\nUm who the players or what the aim was I mean what he lays out he makes a good case for himself and for the you know his theory that he was being set up in an effort to um to then be able to go after the Trump campaign in some way or the president himself should he win\nI'm I think people should listen to what he has to say and and make a judgment about it but you know he's drawing some links and connecting the dots or in a way that I think raised a lot of very very serious question\nAnd I'll paraphrase show and he said that one of the tweets that Peter Struck had\nWas a that he goes we are beginning to what our source or or or Russian source or or source in England where in Britain is beginning to talk about Russia connections there was the same day that invested or downer a it was the day after he met with the ... down\nAnd he ended up being a tape conversation to somehow Peter ... get that he does not believe that was a coincidence faces on the Russian source there is no suicide know rushing connections to mix it came up to me and approach me and asked me if I if they told me that Hillary Clinton's emails were about to be released so\nThen he gets an information unsolicited and then these asset by donor who turns out he's a British asset who gave millions of dollars to the Clinton Foundation and Australian of more than just an ambassador\nSo he chose you not and he says will data was even nice she goes he was he was very aggressive towards me told me as you walk away from Trump these horrible person that we've never going to get elected so\nI'm listening to all this they're all connected together and all that something else to this cruise to re steel made his name by investigating the world cup and exposing corruption right\nGuess who was a member of the world cup community ...\nYears who do not get charged mix it and he's one of the few not to get charged so there's a relationship there before Donald Trump was even running for president so yeah it's a it's a drama that you can't believe that that actually probably took place\nRight if it was scripted as a movie [laughter] I might say like this is just too fantastical I mean it's just\nAll of the different links and all of the different connection and you think about this guy twenty eight years old at the time I mean thought he was doing a good thing by um you know helping out at a campaign and the candidate that he's very much believed in it sounds like he's still very much does still believe in\nUm the at but feeling that now that he was a pawn in this situation and that's that's highly possible I mean when you think about\nThe level of sophistication of the people that he was interacting with and their connections to each other um it just raises so many questions along the way I'm sure you've thought\nAs many Americans have thought I'm with things that have been uncovered you think about what would these people thinking at the time some of these key players and it's only can be that they just assume like most people did there was no way that Hillary Clinton wouldn't become president\nDon't worry girls the generators speaking on right now Hi this is Daniel J per reliable\nAnd I want every homeowner to feel safe when bad weather hits a whole home backup generators only eighty four Ninety nine a month zero down\nNo payments for Ninety Days and free repairing service for life keep that fridge running and those lights on no matter what color text us at seven seven oh five nine four Ninety nine sixty nine or visit reliable air dot com\nAnd when you asked me about ... er Cox media group station [noise]\nTwenty four hour news weather and traffic five and am sent\nMe to\nKnow [noise] it's\nTwo o'clock on Charlie ... group has to be twenty four hour news center top story this hour ... top national story the fed and several managerial this weekend were mailing a series of pipe bombs to twelve Democrats and see I'm In several us maybe political Bible is built crane I\nPersonally don't see much moving the needle if you think back when we had a steep skull east the congressman shot at a baseball game with Republican Congress people being the victims and the people who were shot at there was sympathy towards the party but it didn't move the needle in terms of looking at a ballot\nFifty six year old ... faces five federal charges after DNA fingerprint on ... ... you must be news on two on\nChannel two meteorologist bread Mitt calling for ... now and are crowded one cup I Know it was the most accurate and dependable forecast justice\nAnd while most accurate and dependable forecast just to do good I've county teams agreed to raping disfigure a woman for cash\nFrom around them in prison the Glenn ... de da says Joshua Ramirez I'd give our pled guilty to the attack last week a trial and found a second team Francisco Clemente guilty Thursday Jose car runs a Castro pled guilty last week to ordering that attack\nFirst first this is double you ask me twenty four hour continuing new life\nOnly a middle school student beaten by an older student in much of it captured on phone video channels to actually use Magic Johnson reports the students mother says he came home marked up and still has trouble sleeping\nIt's tough to watch this Fifteen year old eighth grade students hunch and kick at twelve year old seven ... who's covering his head the victim's mother wants people to see the cell phone video of the assault that happened at life owning a middle school\n... ... security you know anything could happen to him and nobody was there to help\nThe twelve year old mother says the older students first hit him from behind I contacted DeKalb County schools and a spokesperson wrote quote acts of violence will never be tolerated in our school\nHappened right after the school let out last Wednesday the district says they followed the student code of conduct after the incident the students mother says her trial is not going back to that school several thousand Central American migrants have voted to push on the Mexico\nThey're rejecting president Enrique Pena Nieto NBA does proposal to give them temporary benefits if they apply for refugee status and stay in the countries to southern most states\nNumber seven Georgia faces number nine Florida Today with first place on the line that the FCC\nW. S. B. J. block is in Jacksonville but\nKiefer Georgia today are not too complicated in a little cliche when the turnover battle because the gators retired for fourth of the nation and take away run the ball better and stop the run the winter in this category has won the last twelve in the series and given the backfield UGA deepest ranking lasted a yeah see the inside and tackles parole officer\nWBEZ the tailgate show starts at eleven thirty kick off three thirty here on their home all the dogs George's number one health care system is extending its reach in metro Atlanta Emory Healthcare welcome ... family September first several USB news done two or three\nFor your vote this November could determine whether Washington under stores for undermines the cabbage into\nOf the mid term elections every step of\nWithout power inexperienced news not five five Pan Am ... when you asked me where\nKnowing what's really going on multiply the Atlanta Journal constitution watching your elected official investigate\nInbox subscribe today at AJC dot com slash worth knowing\nDo you hear voices those nagging little voices in your head the voice that remind you every day of all the things you need to do\nMaybe you've been skipping your twice yearly maintenance on your front is an air conditioner not good\nIt's time to get that done right now and get back on track\nSo cool ray is super seizing that wrong famous no breakdown guarantee called cool right for your winter safety jak in British maintenance you'll get a credit up to two hundred and fifty dollars charge any repair of your furnished breaks down this winter\nJust called cool right just called cool right your factory authorized carrier dealer sign up for a three year cool All right cool care maintenance agreement and get a two hundred and fifty dollar credit with no service copies anytime until march thirty first twenty Nineteen\nI'm Dave Baker the experts you here on my home fix the Joe are the ones you want keeping your heating and cooling system running right\nCool right they get you faster and often the best warranties and guarantees I have seen in Atlanta they also help get rid of all those voices in your head Korean carrier turned to the experts\nFrom selling brothers is tapping into our wholesale routes where the Geron Solomon here to tell you about the Solomon valid special right now you will find anyone care around billion diamond engagement ring or just twenty nine Ninety five or agreed to it drew Carey diamond for only maybe nine Ninety five maybe you want the best quality for\nPrice and visit me and my family today I saw my brother's in mind jewelry seventeenth floor of our bite them look at it on line and older brothers or on Instagram adding Dollman brothers\nGoing anywhere\nIn a\nTraffic actually get it right we\nDon't give us maybe it was time to six\nSome news down to ... to him coverage of primary or wherever it starts with a ... truck with mummy ... travel\nAdvisories lifted Fulton County for up to eighty five south bound the wreckage Washington wrote exit one that has cleared you may see some lingering delays DeKalb County they just play a direct to eighty five westbound be in a loop before Boulder Chris exit fifty one all leans are now open in Cobb County they're dealing with a\nVehicle fires to eighty five north bound the loop exit ramp to south ... tried to his team that ramp is shut down traffic sponsored by compassion international food water education and more is what you'll give to a child in poverty\nRelease a child from poverty at compassion dot com slash radio ... W S P\nSatisfaction is meteorologist spreading it with them as most accurate and dependable weather forecast temperatures are going to hover near the fifty degree march through the overnight and early morning hours of Saturday a mostly cloudy skies through the day with a high of sixty it'll be bit breezy afternoon\nWest Wing Fifteen to twenty miles an hour on Sunday mostly sunny until they start at forty eight will tap out near sixty eight and then on Monday continued mostly sunny low fifty sixty ...\nGovernments pretty darn ... clear fifty degrees on the cruise treated to seven I'm Charlie O'Brien amusing\nEvery Friday followed him seven fifty WBEZ depend on\nLove bon news radio studios in New York City for you on fruit you\nBrian kill made\nEverybody thanks so much frozen sobriety kill me Joe uh we have a lot of breaking news report that this hour we're going to be joined by I think I have a little fun we're going to be joined by a rich little outstanding comedian one of the legends and ... one\nOf the nation's premier story engine decorated a military veteran boroughs are going to be joined by a generally is who's standing bar but we do have some breaking news Alison right\nYes the law enforcement source confirms the Fox that a person has been arrested in Florida in connection with the suspicious package and explicit license\nSo we got twelve packages total and they already have an arrest in connection they didn't necessarily say that the guy but\nI had heard last night that they have a guy and cops I did not get during box and friends are the first hours of this show but now with a twelve pack has these last two of come one went to James Clapper and one went to Cory Booker both located and stopped in New York\nWould be right now is I'm a generally Jenna what's your reaction to this what's it like in Texas now\nWell I mean this has been a story for everyone at first so many different reasons as I'm sure you've just got spray and of course scary to think about any suspicious packages showing up anywhere but there's been so many layers story eight an instant blame on rhetoric and politics and not having a lot of facts in something that\nAt least people are talking about in this neck of the way you know we we really have no information about the ... are they they should we\nOnly know that the target so hearing that had my is really promising to me as a journalist\nBecause I really want more information who is this person I Would think that we really looked at\nIt or is it going back and looked at well who else has sent suspicious packages over the last year and I'm sure you're aware of that person back in March that show that that you that doesn't packages out you know one of them to to the White House in two different political figures and it turns\nThe ...\nWith each other which is nice yeah that's true so so we'll see we're at I don't think there's always going to change and maybe after the midterms there'll be a push for that I wouldn't mind the president trying to do a reset and like he did before he took office that didn't work\nIn an interesting look at even the last\nWeek and all the stories that each covered you know from immigration heated rhetoric too suspicious packages you know we still have more than ten days in\nThe near term and everyone's trying to get ahead it that well what is going to be that you know what's going to be the one issue that defines election how is that the tone for the next two years of the White House the next two years in Congress and the truth is I think one of the things that ...\nI come away from this week is you know I wasn't expecting suspicious packages to get political you never know what's\nGoing to happen there's always an unknown element and that I Know an element and cause a lot of division but sometimes it can cause unity so we don't know what's happened over the next ten days and I think we have to be open to a lot of different ...\nAnd I'm just watching now in plantation Florida WFL war is showing video of a blue tarp going over a wide ban why would you put a tarp over of than\nI Am not sure they don't want the media to see it that's our speculation so uh that towards activity this is great news if we can get to the bottom of this maybe we can stop this\nBecause CNN been hit twice already significant officials had been threatened most of the these packages have stopped before they got to places like Robert De Niro restaurant or um or a John Brennan's desk\nSo listen for smarter news about generally add some other news on Twitter\nAn ad generally usa a few you can't follow her literally but you can follow her virtually\n[laughter] something I reminded you about all the time how's your how her um that is not\nHow's your how that is that true I'd be too intimidated by your husband to follow you and your husband's book which he co authored a how is it still right\nThat the that dichotomy of leadership yet that dichotomy of leadership and extreme initiate the cheapest and they had been in business partner jak wrote about leadership could not be more appropriate for his time and place\nThat book is that right or I go get him Jenna thanks Ryan you got one eight six six eight seven six six died uh be back in just a moment\nNow it's your turn give Brian call an eight six six for all eight seven six six nine our goals are the best care really smart smart in the house and then\nIf Brian kill me Joe\n\nAnd Andrew Smith we hit\nA hundred and ten miles an hour\nWe're not moving at that speed our colleagues will fly right by\nOur job is still a tape smart conversation so that the people who are watching as can better understand what's happening in the world\nTo go to find a different way that other people are not asking that the real challenge to get it straight fatter dead like it or not deliver the Fox news channel real news real honest opinion\nAttention business owners and independent contractors this is a money saving mess with Trump's tax mediation services if your business I was twenty thousand dollars or more in taxes we can help you today right now\nListen dealing with the IRS is no picnic it's an intimidating and extremely stressful process and you don't want to go it alone our attorneys know every law every tax break and every possible opportunity to help you resolve and reduce your tax dead\nAnd if you owe more than twenty thousand dollars you may be the top of their hit list so don't take your tax dead lightly because it will not go away on its own the IRS can seize your bank account\nYour home and even shuts down your business call our tax experts today at one eight hundred three one eight six nine three four and let us deal with the IRS while you focus on your business\nThat's what eight hundred three one eight six nine three four again that's eight hundred three one eight six nine three four\nGirls and marketing and noise and yelling and our role is to take three steps back and just from what really matters and\nHanded me the most important thing that we do we are looking out for the ... men and women in this country luring\nThey're going to get a straight shooter no holds barred I'm not going to cut people slash Fox is the one place for a while we have voices we won't be\nControls my voice nobody on the news channel\nReal news real honest opinion [noise]\nNeon ... flashing light special effects\nToday's world put out some\nLuckily there are places he can go to refocus attention on National Wildlife refuge is it's a wonder how much you'll see when all the distractions stayed away [noise] the ... masters snow capped mountains\nOr great horned down perched do a quick\nFrench [laughter] me see the face of the curious freak cooking had started to see [noise]\nAncient rocks shaped by century when\nWhen you see these things you're seeing the world the way we found was over five hundred messages across America you don't have to go far to make a special connection with nature [noise] learn more\nAnd ask WN stun guns flash messages that\nW. N. dot com slash refuges\nWhen you asked me mark arrow Trimble team traffic every morning and entertaining talk every evening\nCurrent stuff but not any political way Iran does the local daily talk show Martin\nYeah they're really good job of making it more lay the whole\nMark ... is plugged in every day seven PM she'll nine Ninety five five and am Seventy simply don't when you asked me\nWhere I Am camp Stacey Abrams Georgia's future is in your hand followed George ... race for governor every day which got played Erick Erickson and the ... largest news team nobody covers Georgia's elections like news Ninety five pound am seven fifty do what you asked me up and all that\nHe was Ninety five five at a um seven fifty don't you have seen\nThe president and bears some responsibility for the tone that allowed it sure sure he does and that's part of the reason why I never endorse them and I've never been personally critical of him about yeah he does bear responsibility\nPersonally critical of him about yeah he does bear responsibility for the divisions are as the biggest megaphone\nOdd that is a governor case now former governor case of Ohio soon to be who might just make themselves or a presidential candidate but says the president's actually good leadership\nUh I actually had no problem with the president's leadership and this morning though tweeting at three in the morning he went up to CNN who spend about nine hours she was critical of him\nIncluding their crawl they said the president doesn't recognize his contribution to the would be packages and would be bombs have been sent down now the numbers up to twelve let me up to eighty per second before I get to the calls WFL our our ... to ... billion over and plantation Florida is providing video from above I assume it's a drone or it's a chopper\nThey chose a white band full size than being covered by a blue tarp up comes a flatbed truck to going to be taking it away we do understand there's one man a bombing suspect arrested in Florida now these aren't bombs that bomb making material in it know ignite or not that that matters\nThirteen different people were targeted I imagine more will be well one thing in common these are enemies or President Trump which is a false flag operation just one guy who's maligned nuts uh we'll see\nWe're about to find out finally Anna listening on serious in Ocala, Florida Anna\nAre taken by first I Want to say that that I read your book ... and the primary Hi Rich thanks and I can't count lightly ate it read it because they sound exactly like you talk\nTo kids hey I Do have to add up before you talk\nWe're getting more information the suspect in Florida is a Florida resident I former New Yorker white male in his fifties told fifty six\nWho is in uh Ventura Florida north of Miami Beach prior arrests for terrorists threats so he was known to law enforcement that according to her own ... eleventh all go ahead and what's your point you worried about the cat oh\nYeah yeah and I'm worried about the ... when this cat and get to the border uh-huh um I in my own mind I have my own little areas cow and it could be that they could be spiers a down the border crossing illegally and another one is that uh\nThey'll just rushed the border and water our troops ... they're not allowed to contain anybody I can stand aside and let them watch right on by\nAnd I asked you know going to get to keep in mind that they're able to catch a thousand a day now\nSo we'll see what happens you know they they have ways of thinning out crowds before they become bigger crowd that happens all the time maybe they use some of that but you're concerned about it and but we do have a couple of weeks before they get here Jeff in North Carolina Jeff\n... first of all I'm I'm Glad they finally got somebody hopefully everybody has been speculating what and I think that just adds fuel to the fire or whatever reason um I just believe we should deal with the facts um yeah well ... when people speculate for whatever reasons whatever\nJust admitting that\nConstruction of just the sheer okay\nSo did I get\nNothing matters absolutely nothing\nHere and agenda and you hear out pulled and do a good job\nYeah yeah it's pretty good you know he's doing kind of be quiet or a Donald Trump you know talked a few more like this you know when he talks\nUm it's pretty good I I think he looks a lot like money gets to make up on it you know and that that helps if he's looked like somebody you're doing and that helps the voice and um\nYou know so he um he you know it's a it's an impression that it you know it's on track and that is good and the next second it isn't just sense not\nAs easy voice to do\nI Know I I Know one person that you thrived on a on a regular basis was ah was Richard Nixon and Ronald Reagan so for Nixon and you can you still hear Nixon's voice\nOh sure oh sure yeah I'm I'm I I still do next and then my act I don't do much of them but I I Do I'm a little bit\nBecause I was down to viable with him at back in the seventies but but my favorite politicians were shell was Ronald Reagan and uh when I met Ronald Reagan for the first time he said\nTo me you don't know which I think you do make better or worse than I Do [laughter] matter of fact new to me so well that I was thinking when I pass away they should barrier that\nIs a great did he actually give you that line\nYeah yeah that's why it didn't go to the funeral [laughter]\nWell I mean what about Reagan or at a press conference with you a little different as opposed to the unscripted situation\nWhile he always had that little twinkle in his eye you know he lost a lot of comedy\nThat little twinkle and there's a you know he lost a lot of comedy\nAnd he he loved it when he was funny and what's funny a lot to get a good sense of humor you know um I I just adore them because um he he liked my impression so much and are invited major as White House I'll walk\nAnd so I got to know he and Nancy quite well it it was pretty good friendship and um I I treasure about ready to do\nAnd I heard that you one time he let you take over a press conference\nYeah he did he um he saw me and the crowd and said rich ... crashed how much time going for a sham much and then you split and then I was talking to the press and stuff they were still talking too I'm sure the pressure that you know\nAnd and\nOne of the reporters yelled out what all the unrest in the middle east by surprise I don't think you'll be sending jets to Israel and I should know absolutely not what the hell what they do with a bunch of football player\n[laughter] that's fantastic and I\nBoth breaking up totally broke them up he was listening at the door\nThat yeah he loves it he loved it I I Believe he was a great guy and he was\nSo rich you did you decide to stay active and keep at it and ... and by the way your your since you you're thriving personalities are in the news you got to keep up with it you'll be performing the laugh factory the Tropicana hotel casino in Vegas every Sunday through Thursday so make sure you stop and if you were in Vegas but\nWhat is it like for you seeing how polarized we are right now does that make you want to back out of it or dive into it\nOh no no I I I'm I'm you know the my audience as an older audience of course all a lot of young people have no idea of John Wayne or ... or ... you know Ronald Reagan is so you know I'm I'm appealing to a mostly older people although I Do get some\nSome young people occasionally in the audience I had it can't last night in the audience just Fifteen Years old\nAnd have us laughing like hell during my show and I couldn't figure it out\nAnd I said though on the show is over I knew what I was doing and he said well yeah you're very funny maestro that old but I was confused I said boy audio confused about he said I was just wondering why you kept changing your voice\n[laughter] okay okay that's a little confusing so I have a theory rich I\nWhen I watch Jay Leno does this thing when he promote to show on CNBC goes on with Jimmy Fallon and they have a good relationship and basically Jimmy Fallon fakes an injury and Jay Leno takes over and let it goes back to do he was doing when he was hosting the show in equal opportunity offenders using the example from just a five months ago cut for\nA lot of really talented and really accomplish actor when it comes to sexual harassment also Stevens ago\nI thought about this yesterday was my driver Kevin Spacey that's\n\nIt's not just the actors Matthew wiener that created the hit show Mad Men he's been into [noise] let me tell you I'm what came when your last name was wiener\nIntroducing yourself to people\nThere you go a budget detainees any hit a trumpet the end does that show you can still work that's\nThat's funny funny stuff yeah that's that's it's a it's a little closer to the line but it's it's pretty funny\nYeah I just like the fact that he could still go out there and insult both sides you get to everybody relax and stop being political hey rich best ... yeah that's\nWhat that's what I Do that's what I Do I take the audience knows show my political affiliations at all and I think that's the way it should be\nAbsolutely will pick that up with all that back to the Tropicana hotel casino in Vegas every Sunday through Thursday rich still making everybody left honor to talk to you rich little\nThanks for calling Brian kill made [noise]\n\nYou know what's not smart job sites that overwhelm you with tons of the wrong resumes but you know what is smart zip recruiter dot com slash Brian ... dot com slash B. R. I. A. N. unlike other jobs ... doesn't wait for candidates defying you\nZip recruiter find them for you\nIs powerful matching technologies scanned thousands of resumes identify people with the right skills education and experience for your job and actively invites them\nTo apply so you can get qualified candidates fast no more sorting through wrong resumes no more waiting for the Kennedys to apply it's no wonder the ship recruiters rated number one by employers in the U.S this rating comes from hiring sites on trust pilot with over a thousand reviews and right now\nSo I started trust pilot with over a thousand reviews and right now my ... for free at this exclusive Web address ... dot com slash Bryan that zip Richard dot com slash B. R. I. A. N. dot com slash Brian zip recruited the smartest way to hire\nIndividuals and businesses with tax problems listen carefully do you feel like you're losing control over your finances if you over ten thousand dollars in back taxes arrive on file tax returns we can help you take back control\nThe IRS is the largest and most aggressive collection agency in the world and they can seize your bank account garnish your paycheck close your business and filed criminal charges take control of your tax problems now by calling the experts that tax mediation services and take advantage of the fresh start program and\nNew laws that may allow us to negotiate a settlement for the lowest amount possible\nOur team of tax attorneys on the road agents getting stuck elections and get you protected so you can take control of your financial future drugs mediation services is accredited by the better Business Bureau coal now for a free case review end up rice production guaranteed quote\nCalled tax mediation services now at eight hundred three one six four nine three by that's eight hundred three one six four nine three five eight hundred three one six four nine three five\nAnd designed fake I presented by platinum kitchens and design and Leslie carbon owner platinum kitchens hosting a large holiday meal can be a logistical challenge to have all that the hot and ready at the same time try low setting for slow cooker and utilize your outdoor gas grill to keep your side dishes warmed let that turkey rats for thirty minutes before carving\nAnd use that time to read last minute items like size and role let\nUs help you maximize your home investment and take your kitchen experience to a whole new level more kitchen design the grid that patent kitchens dot com\nI Michael car I Believe the kitchen is the new family room it's where you live in um kitchens delivers a better kitchen renovation experience with our exclusive platinum process that starts in your home our first visit include the kitchen designer at no charge next you're presented with a free customize design layout with clear and realistic pricing all at no cost to you\nAnd find them kitchens are processed includes our promise to help you create and realize your dream kitchen that you and your family will living for years to come\nTo your free kitten designed kinds of Haitian kicking dot com\nAnd now we can make it better now come on can we do\nWithout rolled\n[noise] cutting out [noise]\n\nWill come along they pay they go out and hang out with them for an hour and then walk planned for helping me moving a little and even that can help make you and your child how\nWhether [laughter]\nOn Ninety five five AM's hand on your iPhone and Android that way you have the radio W. B. panned out it\nPlayed ws being news weather and traffic in a flash going his skills and your Amazon a lesson and search tells us the radio and unable to last spring the local news Ninety five five AM seven fifty WSBIU nominal\nThat when you asked me about ... er Cox media group station [noise]\nTwenty four hour news weather and\nFive and am sent\nMe\nIt's three o'clock on Charlie O'Brien I'm a bit of a double your last may twenty four hour news summer top story this hour Beverly ... top marginal story a former males strippers under arrest for serving over a dozen pipe bombs they're prominent Democrats and CNN more from ABC's taught in\nThe six year olds Caesar say Iraq was arrested friday in connection with the package bombs set across the country to prominent Democrats\nABC's ... has more on the explosives\nThe FBI made clear these were no hoax devices in fact what the right amount of kinetic energy and heat FBI Director Christopher Wray says\nThese things could have exploded why they didn't is now a focus for investigators who have been studying the ... detonated devices wasn't intentional in other words where they built\nNot to go off or was safe to say I be accused bombers simply bad at making bombs\nFifty six year old set of Evan ... Florida faces five federal charges on friday night President Trump said the reporting by the media of his efforts have been deeply unfair\nMedia is try to attack the incredible Americans do support our movement to give power back to the papal\nDoes the Trump in Charlotte caught in the NBC News stumbling your best be news time three or one channel to me to Robert just spread Mitch calling for ... known a cloudy day coming up\nIt was most accurate and dependable forecasts straight ahead to firefighters are recovering today after breathing too much smoke fighting a fire friday or murder station it was just before new friday Marta is better\nAnd it was just before new friday at martyrs battery make much civil beach in North east of Atlanta no word on when the firefighters will be back to one hundred percent\n... first first this is double you ask me twenty four hour continuing news shows that\nThe Hanford nuclear waste treatment site in central Washington state\nOrdered employees to take cover friday that's after release of steam from a building the facilities website said radiological surveys show there is no contamination associated with the dominant or building where the steam released\nA newly wed DeKalb County woman who is dead and her husband in intensive care after a man sprayed their car with bullets Monday Night that killed thirty five year old ... Stevens and put her husband in intensive care Stevens' sister to reach the details channel to actually amused\nSeven then chat room and he had one close to ... temple got one under his tongue is well above ... that's why I Can't really call\nPolice arrested a Nineteen year old Carlos Rodriguez for the murder after the incident Popeye's restaurant in like only today is the last Saturday for early voting before the midterm elections in November So all early voting ends on friday November second\nSome George's County is also offer early voting this Sunday People can only vote in the county which they are registered WSBIU sports the dogs the gators several USB radio pre game eleven thirty this morning kick off three thirty PM WSBIU news time ...\nFor your vote this November could determine whether Washington under stores or undermine the cabbage into all\nOf the mid term elections every step of\nWent up power inexperienced a new study by five Pan Am seven fifty you asked me\nAbout the threat goes for a good response [noise]\n\nCancer higher than that\nWe can save lives would you take if you were forced to flee your home your phone your passport photo album get closer look at refugee experiencing at from home a free\nInteractive exhibition about the global refugee crisis presented by Doctors Without borders witnessing story of ordinary people and the challenges they face to\nVirtual reality and three things the video and other ... I kept my Twenty one twenty eight at West side that park next door to a world Congress center learn more at forced from home dot com\nBoom here in the supermarket to witness Mariette would waking up frozen\nHeading to the ... brutal file [noise]\nLike Eddie I should've rich while\nFrozen fruits and veggies because they're easy\nLose his handwriting one hundred percent you learn more fruits and veggies ... for better HOW Foundation has\nAfter last week's show lean\nYou're about to be news time three o five not about game coverage of driving and whether it starts with a double give us be twenty four hour drive a center and we'll check right in with my mom econ\nProbably no major delays around metro Atlanta just had that for some roadwork first stop in Fulton County Sandy Springs area four hundred north bound past that Glenn Ridge connector\nExit number three you've got to left lane to block the interstate to eighty five if you're coming south from Gwen county Lawrenceville swan ... will exit an eighty five southbound they've got a HOV lane black bear and rounded ... Forsyth county\nGeorgia for hundreds count down to wait linked to block to make far inland traffic ... by ... dot org a girl and can you drink to becoming a doctor an elder in Guatemala trained to being part of a community reach out in changing the world it will change your own I'm Down dot org ... W. S. B.\nI'm ... major I'll just spreading it with the most accurate and dependable weather forecast temperatures hovered near the fifty degree march through the overnight in early morning hours of Saturday on mostly cloudy skies through the day with a high up sixty it'll be bit breezy in the afternoon\nWest Wing Fifteen to twenty miles an hour on Sunday mostly sunny in Chile start at forty eight will tap out near sixty eight and then on Monday continued mostly sunny low fifty sixty ...\nStorm drug or radar real clear fifty degrees on Peachtree greeted three oh six\nFifty degrees from Beirut Scrooge treated real surge orange earlier ... used to be voted for him so improved the double ... burn burn\n[noise]\nDoing the show [noise] honestly I just love listening to your show makes me feel so that's what I'm Talking\nAbout freedom is variable\nFree no chaser limited government care of yourself that everybody else's life it stays out of your life enjoy the reserve your labor for love you got a really bad for you\n[laughter]\nHere's your for just a patient trophy would do the show [laughter]\nSo this I'm welcome back to the ... election Twitter official than a latch on Facebook we're following this developing story these bombs seven different locations\nUm CNN's apparently now the word is coming officially that it was hand delivered the one that was that was sent to see and it was such a John Brennan at CNN which is weird because John Brennan has and MSNBC contributors to this bomb person is a total more on\n'em and more than one way so I um\nAnd and ... watching\nOr just watching all of this bringing all the all of the latest developments the president is getting ready to make remarks on this we're going to take that\nLive when he comes out which should be any moment\nHe is expected to come out at any moment and when he does we will take that live now law enforcement sources have told it's a ... that are according to a couple of different reporters with a CNN including Katie hadn't been who's one of the executive producers there say law enforcement sources say the package sent to CNN was delivered by courier\nNot mailed and so that is I think\nI think that there's a lot that's going to be um I think that's a ... if it was a courier then obviously that's going to be I think that would be relatively easy to track down who paid for the courier because I I was wondering if you\nHave this if you have all of the if you have several different seven different locations\nAnd you have the it was sent to the sorting facility that handles Clinton's mail which it imagined as a new is in New York um it was sent to the Obamas were in D.C it was sent this to Brennan uh CNN or in New York the Clintons mail a sorting place in New York\nI always had of the range with\nPre loaded max but it's amazing how fast you can go through all those rounds there's nothing more aggravating and having to stop and reload everything when you get into a good rhythm you know when you find your focus in your concentration and you're\nYou're just really on top of acquiring your target and you want to get right back into it instead of having to stop and reload ... administrative work is what I call it\nTake a look at your old speed letters and be honest about it they will claim compared to the ... this was literally the fast this letter in the world and if you doubt me for even a second you got to go to love max fast dot com and see the video for yourself for thirty bucks it's the best money you can spend\nOn the range and I'm telling you from personal experience once you have this each he has loader you're never going to load the same way again load on the whole mag in less than three seconds\nGood luck max fast dot com that's low ... dot com and use promote Dana for free shipping load max fast dot com\nGuns and gun show John Doe base of big Lawrenceville gonna nice show on sale this weekend I think what our county fairgrounds by show off with some new and used wonderful shot guns handguns\nOn so I mean the whole truth why so much more ring and you're also like to watch for cash fires but you also just off of dollars for where\nIt's all on ship so self is a very large vote show this weekend like what are the only way for all five she'll go up on one side of a nine to five on Sunday [noise]\nDo you hear voices those nagging little voices in your head the voice that remind you every day of all the things you need to do\nMaybe you've been skipping your twice yearly maintenance on your furnace generic conditioner not good\nIt's time to get that done right now and get back on track\nSo cool ray is super seizing the wrong famous no breakdown guarantee called cool right for your winter safety checking furnace maintenance you'll get a credit up to two hundred and fifty dollars towards any repair of your furniture breaks down this winter\nJust called cool right just called cobra your factory authorized terrier dealer sign up for three you're cool very cool care maintenance agreement and get a two hundred and fifty dollar credit with no service coffees anytime until march thirty first twenty Nineteen\nI'm Dave Baker the experts you here on my own fix the Joe are the ones you aren't keeping your heating and cooling system running right\nCool cool right they get you faster and offer the best warranties and guarantees I have seen in Atlanta they also get rid of all those voices in your head Korean carrier turned to the experts\nAttention all men have biography I was let you down if you suffer from any type of erectile dysfunction overall these disease regardless of your age your medical history the doctors in Atlanta health clinic and help you now be\nBut during the doctors in Atlanta help when it can help you now\nBe a lot of health clinic has the U.S patented device to help you get your sex life back\nOthers may claim a patented program but they still use this ... technology you can trust the doctors at Atlanta help when we have the new its revolutionary treatment\nFrom Europe utilizing advanced acoustic wave technology we're delivering unprecedented result using our US patent it and the FDA cleared medical device met regenerate blood vessels in a reptile tissue was short in office sessions and it's all done with no pain\nNo needles no surgery and no medication golf ... consultation today gulp oral for eight nine one six nine nine zero best for all for eight nine ... nine nine zero called the trusted leader in Atlanta today and get your sex life back\nWhen did lead a health clinic called Bora Bora eight nine one six nine nine zero or visit our website it did lead a health clinic dot com\nThe midterm elections\nGo in the stakes are high in Georgia harsh about\nVoter suppression does absolutely not\nTrue and across the nation gets him as a battle working full\nFor the president would you be continue to dominate what would a Democrat seeds people\nA November ... could be a very very long night stay informed throughout the day which got played there as one half worse than you do three and ... on your mid term election coverage headquarters double\nBe depend on it\nThe it was Ninety five five thirty I'm seven fifty don't you as being the dean do show we're\nGoing to join the a press conference the president jak now at the Mike he's signing opioid bell as well as they're making remarks on the suspicious packages let's take this life\n[noise]\nI Want to thank you very much want to know how hard you work on this and that's just one of many languages that you know so it's just amazing the way you can do and thank you very much John appreciate it [noise] also I Want to thank missions pants for being here\nYou have been just so terrific working alongside of our ... president then thank you very much really appreciate [noise]\nDo you like\nTo begin today's remarks by providing an update on the suspicious packages and devices mail to current and former high ranking government officials the safety of the American people is my highest and absolute priority\nI've just concluded a briefing with the FBI department of Justice Department of homeland security and the U.S Secret Service as we speak the packages are being inspected by top explosive experts in a major federal investigation is now underway\nTo full weight of our government is being deployed to conduct just investigation and bring those responsible for these despicable acts to justice we will spare no resources are expense in this effort\nAnd I just wanted to tell you that in these times we have to unify we have to come together and send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America\n[noise]\n\nIt's a very bipartisan statement I can tell you from both sides we both agree on that\nDisagree just conduct is abhorrent to everything we hold dear and sacred as Americans my administration will provide additional loved age as they become available and I just want to thank everybody for their understanding [noise]\nWe're extremely angry upset unhappy about what we would this this morning and we will get to the bottom of it [noise]\nWe're gathered together today to address America's drug an opioid crisis in a crisis it is which now claims Seventy thousand lives a year\nOne year ago I addressed the nation in this very room and declared the opioid crisis a National Public health emergency and that's illegal statement that's a legal term\nToday we are here to update the American people on the historic action we have taken ...\nPeople on the historic action we have taken you sign when President Trump and the ... of the um\nWhy do we uh are going to we're going to very much a follow the story as it goes into\nA as we get further developments on the latest pat if there are any more packages or said I Do have this window because earlier it was reported that Andrew Cuomo had also received a package now there's an update he has not it was just an informational brochure\nOr so he said there's not seven their sex he had said that he had a device sent to his office in Manhattan but it wasn't a device it was um an informational brochure\nSo that's kind of different uh so that's what well anyway uh\nIt was just literature that is what am I ... I said I'm Cuomo said on air that his office had received a quote device NYPD said it was just it was just an informational pressure so we will have all of the latest developments or as a\nAs ... as we get them and um additionally we're going to talk to my good friend Johnny Georgia chose a bomb experts bomb tech expert he's a\nHe's a veteran and um he is this is his wheel house and I want to ask him about\nJust some of the just about what's going on about the devices and how it's wired and he was the one who actually told me that you could determine kind of the training someone had received in where according to the materials and how something was wires to we're going to talk to him coming up next our ... [noise]\n[noise]\n[noise] let's talk about your business for a minute\nI think about all the things you're doing to attract the best talent between the networking event in ... you're probably spending plenty of time and money to find the right people know what if it was your office that attracted employees [noise] today's workforce is noble and active and they want an office designed around the way they weren't\nImperative makes it easy [noise] married standing desk solution help you create an active\nWorkspace were employees can stand and move to they're happier healthier and more productive\nOur phone line of active office products are constructed with commercials rated materials and requiring real simply said they're easy to set up an named companies if any size can happen very desk asking for space ordering his simple shipping is free and are thirty they guarantee you if you don't mind they will pick it up for free [noise]\nOr what have we seen since twenty sixteen antifa and others blowing up buildings um assaulting people are being violent stopping traffic consulting people who dared\nDrive on the road I mean all this stuff is the left never condemns as a matter of fact they've actually said most recently that all that's different than what the violence on the right as theirs is justified because they're\nThey're against you know Nazis and white support or whatever they decide as the justification so they've literally been violent all the way up to this point and now here we are less than two weeks out from midterms and all of a sudden the right\nDecides to be violent there's no there's no logical sense for me on this nobody from the right is going to be doing this any way as a matter of fact of the bombings that we know most recently how many of them were you know right leaning\nIn thought anyway so\nI just don't buy it and I know that what we're doing here on the show today is just chasing facts and and that's exactly what we're supposed to be doing but I I just can't I'm not I don't buy it yet I'm Still convinced that this is this was a coordinated effort\nOn the political left along with the media because again CNN really\nYeah everyone knows what the ratings are no one cares about CNN but this is you know again I guess what CNN is getting a ton of clicks today I Wonder what you know right right you know it's just so there's so much for me on those are speculating level\nTo see that this isn't this isn't\nThe violin crazy you know what I mean what I'm thinking is that this was a coordinated thing and although I don't have any proof you know again I'm stupid for speculating but\nI'd say it's hard and I just think I'm don't have enough there\nI've just right there isn't enough there but this is what at this moment I Believe\nOkay become really that them yeah yeah you can believe it [noise] ah [noise]\nBut I still think that we don't know enough I we don't ... other than it's at although there was um what was it the um\nOne lock them or cave art Bussey had noted that\nThis was it there was like a flag that was on at an ISIS flag on that was the one that was centered Brennan I have seen a million people say that it looks like\nIt but it looks like everybody want to err on their own looks almost like it's like you want to verify\nBecause we're not frogs okay we like we want to verify [noise] but you know\nTo see my speculation slips little frogs are good ... or you say my speculation as a little lick frogs are getting a little bit\nSpeculation has a little frogs are good ... a little bit\nSo no I'm not saying I just think it's too early I just think it's too early\nI just think it's really convenient timing I just think it's really widespread so that the size of it is in question or the motive is in question do you know what I mean I just think there's a lot of this ah because we don't know\nWhich was you know that leads to the reason why I Believe what I Believe I'm of a less they have something out there because again the ratio violent left views\nUm Mm it's much larger we all know this is just prove these effects even though the media doesn't want that to be the message because books were less than two weeks off from it or if you have to understand how the game was played we've seen this long enough and that's why I Believe what I Believe\n... well you can run with that that's going well and and I I we just we just don't know enough about it we just don't know enough and I am struck a\nA very fascinated and hearing\n... more about the other devices that were sent to other people's offices whether it was Wasserman Schultz whether it was a you know all of these others I I Am very interested in hearing\nMore about because I Want to know if they match what was sent to these other offices I Want to know if it matches if Obama's of Clinton's if Wasserman Schultz if if the one that if it matches what we saw was Brennan\nThat's what I'd like to say so this is a you know that I mean it is what it is but um I was um\n[noise] I'm I'm [noise] because there's been I've seen some bomb disposal bomb disposal bomb disposal experts who were saying that it was almost ... it was almost fabricated to purposely like look like a Bob but not really be one\nNow I'm not saying I ... I Know nothing about making bombs nothing so I Am just\nSo I I Know nothing about it I'm just reading what I see a lot of veterans and a lot of these bomb just hear that a little extra yeah speculation but they say that I'm trying to find actually I'm trying to find the some of what I've seen let me give me a moment and ... there's just a lot here okay so so for instance Tom sour\nWho is a bomb disposal bomb disposal officer former bomb disposal officer says ... proper pipe bombs don't have wires connected to both ends that's dumb it says you can find timers and remote control receivers way smaller than whatever that white boxes a proper time or would best be stored inside the pie making it fully and calculated that thing is just silly looking\nHost of ISIS he says are far more common than real ones in which case we should ask ourselves what are the motives of the bomber and and and the who benefits\nHe says think people in critically a whoever made that wanted it to be painfully obvious to anyone and everyone that it is a bomb this is nearly the same as a bundle of road flares wrapped together with an old tiny alarm clock ticking away\nSo interesting\n\nI mean that's that's and I I still I'm curious as to whether the other ones look like that one that's why I'm asking I'm ... I'm very curious as to whether\nThey does does look like the ones from Brennan et cetera because\nThen I think you can determine whether or not\nYou know this is somebody who's an expert at what they're doing is it is it how many different people I mean do you think it's more than one person I kinda wonder\nIt's ... ... I mean it could be I mean good grief Ted Kaczynski was one guy it could be and I I also want to caution everyone else to who immediately wants to camp ... run to speculation I heard but I don't know I don't know what you're talking about [noise]\nThe remember back when there was the um there were all these bomb threats to Jewish ... after the election and it was this disturbed teenager in Israel and then in twenty fourteen uh you had a scorned spouse trying to find their husband who was sending\nWhat looked like rice and to the White House and to the mayor's office back in two thousand and fourteen and so it may not necessarily be you know you're there it could be ... something entirely bizarre or it could be outcomes razor or it could not be I mean I'm just there's a lot there to consider\nSo there are a lot of questions to ask I think my biggest concern with all of this right now is whether or not again I don't know anything about making bombs which is why I'm I'm curious\nKnow how expert lead this\nExpert laid this looks and how expertly this is going to how I mean if this was slick construction I mean we have one bomb disposal tech who says no because you want to know if you're working with someone who is skilled who knows what they're doing a\nAnd or whether or not this is just some dumb idiot who\nEither try to act heart or trying to I don't know I mean every I think everything can be on the table right now but you want to basically know whether or not other people are in danger so there you go\nSo far without the nation's doesn't appear to be and it seems like there's a lot of people a lot of authorities involved so looks like we're going to whatever may be still out there which Cuomo floated that earlier when he was out there talking about it I'm I'm sure we'll be caught up in this drug methods now\nA centrally out there people are hyper aware at this moment my\nRight well same way we have more to come uh uh as well [noise] and ah we'll ... we'll bring you any other developments and we get hopefully we have a lot of other show for you but ah ... we'll see if we can get to that or not but we'll have the latest in the meantime a gotta get moving on\nAs if we're critter is a great resource to have\nA for any business of any size really a because when it comes to hiring their job sites that send you tons of the wrong resumes to sort through and that isn't smart and it's not smart to use relatives to fill in at work while you look for staff\nAnd when it comes to life it's not smart to make the lottery the centerpiece of your retirement plan\nBut what a smart is going to a zipper critter dot com slash standard to hire the right person zipper critter doesn't depend on candidates finding you find them for you\nIt's powerful matching technology scans thousands of resumes identifies the people with the right skills education and experience for your job\nAnd actively invites them to apply so you get qualified candidates fast that's why is it for a quarter is rated number one by employers in the u._s. you walk and tries to broker for free by visiting zipper critter dot com slash Dana that zip recruiter dot com slash Dana ... dot com slash Dana ... the smartest way to hire\nHe we Martin I'm the one hundred first Airborne Division speak about the life threatening condition he had to endure during World War two and the amazement from doctors when he survived\n[noise] we had so little food that we're not enough energy and we ... I mean here in bad shape and doctors couldn't understand how we survive\nThe American veterans center protect the legacy an honor to sacrifice of American better and to hear more like something [noise]\nAnd when you ask me about ... media group station\nHas twenty four hour news weather and traffic five and am\nAsked me to his name\nAt four o'clock I'm Charlie O'Brien and they don't really give us may twenty four hour news center not sorry this hour several us bases top national story the feds have a man under arrest in that scary series of mail bombs mail to prominent Democrats\nI'm Jeanie decree in Washington describing the mail bombs his ICD roughly six inches of PVC pipe FBI Director Chris Wray said they were not say that we're still analyzing the devices\nThese are not hoax devices race had the break came from the things are praying we have confirmed this fingerprint is that the seas are saying as the feds warned other packages could still be in the postal system\nThe fifty six year old has a history of financial problems and extensive arrest record say I was charged friday in connection with the mail bombs\nWBEZ me it is time for one channel do meteorologists Brad ... says foggy now at a partly cloudy day on the way it land as most accurate and dependable forecast is straight ahead\nThe Georgia Supreme Court rules Griffin superior court judge Mac Crawford can stay on the bench\nFriday's were linked denies a judicial qualifications commission recommendation they've Crawford be suspended during an ethics complaint inquiry he's accused of stealing Fifteen thousand six hundred Seventy five dollars from above pike county court\nFirst first this is double you ask me twenty four hour continuing new curbing\nVideo records the moments after I go in that county middle school student is accused of stabbing his teacher details now from several best bees Cheryl Castro\nWe're getting a glimpse of cell phone video recorded by student moments after her teacher was stabbed by classmate inside a classroom ... middle school\n[laughter] [noise] ...\nChannel to actually news her teacher had asked her to record the footage\n... pilot over and I told him to ...\nA Thirteen year old student has been taken into custody the teacher was conscious and talking when taken to the hospital several Castro ...\nMoney's stolen from the savings accounts of about one hundred customers that are bank in Lawrenceville future Yolanda Richardson tells channel to actually use so you'll find it hard to trust each state federal credit union after using an ATM\nThat probably I think people are bad I don't know that their parents had thing happened nine and Amy can now\nShe says the bank didn't tell her somebody used her personal information to steal nearly eight hundred dollars from her savings account the bag says there's been no id fat but there is an uptick in disputed ATM transactions Richardson set of bank employee told her she was a victim of fraud\nNumber seven Georgia plays nevermind Florida this afternoon in Jacksonville the dogs look dominating and feel that was you whipped up thirty six sixty two weeks ago the number crunchers at odds shark pig Georgia by a touchdown\nComplication Georgia by week just to about it was you in Florida is on a five game winning streak\nWSBIU sports bulldogs in gators WSBIU radio ... eleven thirty this morning and kick off at three thirty three yeah definitely give us it was time for all three\nTwenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way with Jamie do pre and the southeast largest news team news Ninety five five Pan Am seven fifty don't you ask me\nLent its mark on the safe house October is gun safe mud in Georgia the safe house is having its grand opening\nEdits new ... location we have over five hundred safe in stock and unbeatable deals on all of our in stock and close out model save save hundreds of dollars on a new gun our home said don't let your God you know the ... go unprotected cover our grand opening at our new Atlanta safe house in ...\nWe had the largest selection of gun safe and home safe in Georgia go to Atlanta safe house dot com\nThat didn't land to safe house dot com\nWhile living in ... a gallon I always use snail deal heating Erin Plame whether you want\nOh what he's huge meal meal heating air and plumbing whether it was for installation repair or maintenance that's what those people do what made snowmobile heating air and plumbing our first choice when we moved there was there a history of having served metro Atlanta since Nineteen eighty eight our\nWhole family does now snail mail heating and air inside crushed bales certify business and that meant a lot to ... to ... insured affordable reliable and consistent plush being a dream pro partner meant they start with good equipment\nIn grain or Atlanta be at residential or commercial when you're eating air or plumbing need servicing repair or simple check think on Schnell veal heating and air they're just good folks and perform a good service snowmobile heating air in plumbing find me ... dot com\n... double you have to be twenty four hour traffic center temporary red alert in ... county ... find downtown Atlanta painted say reload all lanes temporarily blocked\nAs they try to relocate some rapid vehicles expect delays traffic ... by compassion international you can't change the world but you can change the world for a child in poverty choose your child now compassion dot com slash radio ... double us be [noise]\nNews meteorologist spreading it will stay cloudy still with some spots of light drizzle as we had through this evening but generally drying this evening and\nSo\nI Am more fishing in housing or anything of the great outdoors O'Neill Williams is your guy let's go outside with only\nAnd they vote jangle studio out in the mountains of north Georgia is real free radio and O'Neill outside for a very special\nDay Saturday morning\nYesterday there was a wonderful we've got a great opening day you might get when you're running\nAnd we have the air today and I'll tell you they are just trying to kill mash trees or state beer biologist\nAnd Mitchell crop is all important offshore department natural resources\nAnd we'll be talking with them over the next couple of hours and we lived in to entertain your calls for all for eight seven to zero seven fifty in the Atlanta Georgia area and across the nation from Sacramento to Little Rock to Columbus\nTo Pittsburgh Philadelphia Houston and Dallas it's eight hundred nine seven to eight to five five so if you have questions about their biology and law enforcement and I'll be passionate all\nThose questions to our gas this morning so we welcome your participation\nIn the program has brought you in this is necessary self promotion rocketed Hayes auto dealership CVA most loaders real tree strictly G. quality deer management association tough said Pennington ... brown southern grind knives\nThurgood boost the governor's gun ... horsed around Cherokee county Toyota and snail mail heating and air and we'd go all over the country and all over the world is televised\nSo uh let's see let me get to something here before in self promotion you can watch O'Neill outside today on Fox Sports southeast\nFox Sports ... son Fox Sports Arizona's pursuit channel ... channel and just about everywhere is on every day it's sickening really but you can watch O'Neill outside there or at O'Neill outside a calm and own you two\nAnd a YouTube channel before I go to the first break I Would encourage you to go to kneel outside dot com and there you can find the southern Zach Brown's southern grind guest book\nAnd if you all for a gesture\nOr an observation and we use that owned a television show and then ... brown will send you a black in tan jak all night\nA nice this is the kind of nice and keep forever so\nLook for all of those things is is O'Neill we'll go to the first right we'll come back we'll talk outdoors do hours this is oatmeal outside we're\nReal tree radio and we'll be back\nThis week twenty four hour traffic center that rhetoric ... down paper today we actually have an Eighteen on the outer Pauline currently blocked there with a multi\nVehicle rack expect some delays I'm a line economy W. S. B.\nGood boots are made for real working people who understand that quality is simply stated ditch proven manufacturing moves in Wisconsin since Eighteen Ninety two foreign goods iconic style quality materials and your ability is reflected in the kind of person who wears them\nWatch so why is the violation by the deer hunter that as a surprise to him in other words you get him you get you apprehend then you start asking questions and he says I didn't know that\nBiggest violation we deal with that they don't know about his license violations they go\nIsn't licensed violations they go and attempt to buy what they think they need and really don't know and end up with something they don't eat or you know they don't know not enough so\nThat that's the biggest surprise that ... that is the biggest\nSurprise ... and and that\nDoesn't necessarily mean for you you're going to slap 'em with a fine and a citation and everything [noise] if they are sincerely oh they have sincerely try to do the right thing\nIf we feel like that they are you know making an effort and trying to not obey the law than we generally you know issue a warning or even a system where you can now go in our trucks with the computer system and help them obtain a license they need so you know\nUh it it just tickles me sometimes I Am surprises me uh it's like oh there's a game or and I say great there's the game or [laughter]\nWell we're not out there to really I mean don't get me wrong outright a ticket if it's needed but uh I Would prefer to help you get a license or help you understand that I Would just write you a ticket yeah\nWell we have more uh more questions for our gas so this is right down the addict you guys had it for the which they let me tell you the telephone numbers are for all for eight seven to zero seven fifty\nEight hundred nine seven to eight to five five outlier outside Atlanta calling area if you have questions about law enforcement uh the deer population whatever whatever state in which you live\nA the whitetail don't know where they lived through that I Know [laughter]\nAnd we can entertain those question this is O'Neill with O'Neill outside present to you every Saturday morning real tree radio and we'll be back\nSeveral you asked me mark ... every morning and entertaining talk every evening and then he ... for so many years harem does the local daily talk show Lawrence\nHas this amazing way everybody feel like your has your money just for the first time mark\n... is plugged in every day seven PM till nine Seventy five five and am seven when you asked me\nWell Gail and I have had our tough she it for a while now and I really don't know how we got along without\nIt's ... and that didn't take long they all got most of the space which is not surprised she really loves I have a bunch of tackling too from one wall and some space in a corner\nI doubt I'll get more what Mitt most to me is that the tough shape boats milk it so it looks like it belongs here was cedar signing an agreement roof so it seems you've right with the ... hour or two if she is is saw it as a rock\nHas to Shay almost all around the walls all off a big billboard door on the side so I can drive my more informed we're inside\nInstead of leaving the amount of trees Steve you need a place to store your stuff where he's safe\nAnd you can get ... get a ... you can find down just what you want shapes sizes colors porches all designed just for you ... ... dot com that's tough shed not calm look them up and get your own ...\nHey although Halloween is a holiday full of scares in surprises choosing where you buy your next vehicle shouldn't be\nThat's why I gladly river all my friends and family to a gym Alice Chevrolet why because they always go above and beyond to exceed my expectations kind of like those houses to get a full sized candy bars Halloween and the savings well they're hard to beat especially this time of the year\nRight now Jim Ellis Chevrolet you could say twelve thousand dollars often is our pee on all twenty Eighteen Chevrolet tacos in suburban St ... number T. A. H. one to seven\nIt's ... fifty three thousand nine Seventy one after rebate to the gym ... you're paying just forty one thousand nine Seventy one just and the ... states the tickets for me by your next vehicle doesn't have to be probably felt experience especially when you could shop by and trade your way a gym now the Chevrolet\nFor more details visit Jim Ellis Chevy dot com or stop buying Peachtree industrial just inside the perimeter tell them Scott slate sent you to find new roads ...\nAre you scared of the ones just before your lights go out who knows how long you'll be sitting there in the dark his automatic backup generator kicked saying as soon as your power crashes but you need to produce a design your system generators or not one size fits\nAll so get your free system design and has met when you called ... box electrical I'm Dave Baker might experts who never leaving the dark right box electrical get up to one thousand dollars off and two years maintenance for a limited time come right back to electrical and don't fear\nWell welcome back twenty five after the hour and before we get to them or something with a conversation with Michel and with Charlie let's entertain a question which have some applications with Donna is calling own O'Neill outside and real tree radio good morning Donald\nGood morning again we hit spoken before yes we have that wants to get rid of coyote yeah a lot harder to report\nOn debt is the yesterday that\nA gentleman called in and said he'd cuts for kind of Roswell so whoever it is it called you some weeks back and said he killed four hundred up in the mountains I Wish you'd call and leave your producer his number organize at ... ... the prospect of I talk to your your\nExperts well I Can't get farmers to have cages to catch coyotes are traps they're not interested in that on their property [noise] they just want them killed yeah I have a hunter I ... I just can't get anybody interested that got horses in cattle in lives to lead into\nThe ground and I can understand that Donna less uh less ask Charlie kill master for a little bit of a direction that if you'll listen maybe my darling I'd\nAlso add one more thing okay and the women you said one time you were telling me this story about it's a wonderful life the filming ... Christmas and I want to hear that's\nOkay All right then we'll get to that story Charlie what about the Saudis um first of all hot Donna how are you good morning I'm fine thanks\nUm there's a couple of suggestions I have for you if you go to our website or Georgia wildlife dot com you can find a list a nuisance trap or is that you can hire to come ... he's now on her way to mention you wanted some hunters to come in and ... calling\nI'm at the best avenue that I was just for that is to go and do a search for the Georgia outdoor news forum and create a yourself I use the name or you can ... with the people on that forum there is a predator hunting forum on there and that will lose you and direct contact with a lot of people that\nAre recreationally hot I'm not only comedies but foxes and bobcats uh that are going to be um experience then there should be some hunters and the air if you have a place for them to hunt 'em you could you could go there and and see if you can find somebody to come out and help you with the problem\nAnd what would be destination again Charlie Georgia outdoor news forum okay George ... magazine right\nThey have a magazine but they've also got a Web for them and it's got a um I Would say a ... a hot percentage of the hunters and Georgia a actively participate in up for America\nLand on a thank you sir I'll Try and try to get ... and good luck ...\nThere's a diner has coyote problem we all do why charley\nWell uh we we uh years ago we got rid of our uh our native kind of the red wolf a it was the the major uh when I pitched predators that that dominated the eastern or they used in the United states and uh when we did that we we love to make a logical niche and a\nAcademies naturally expanded eastward and filled that niche there are highly adaptable animals are there were also some uh some limited uh introductions I'm back and uh I don't know fifty to Seventy five years ago I people brought 'em in for a Fox hunting and uh that\nThat are kinda got um established in South Georgia but then the major front was that eastward expansion from from the western United States\nThey're smart critters aren't that they are they are incredibly smart they eat a a very wide range of food sources which makes them highly adaptable um we've got a vibrant population of cavities in downtown Atlanta face basically a night for you to read me\nWell or not necessarily they they are they tend to be more active at night but I'm In areas where there are accustomed to humans it's not uncommon to see them or at any point during the day\nI I have seen him multiple times I Know there's a story or it's repeated story but I a friend of a friend who was a farm or ranch manager North Carolina North Carolina it's farm if it were in Texas it'd be a ranch okay\nI Michael ... I Believe the kitchen is a new family room it's where you live in kitchens delivers a better\nKitchen renovation experience with our exclusive platinum process that starts in your home or first says it includes a kitchen designer at no charge next you're presented with a free customize design layout with\nClear and realistic pricey all at no cost you apply them kitchens are processed includes our promise to help you create and realize their dream kitchen that you and your family will living for years to come\nTo your free kitchen designed kinds of Haitian orphans dot com get breaking news weather and traffic\nI'm from ... get breaking news weather and traffic updates all weekend um W. S. B. and then it must be radio apps then Monday morning news or the latest developments the tight race for Georgia governor's comedy cool days you might be more casual\nGas today are Michel ... and Charlie kill mastery and we're talking about outdoors deer hunting blowing ... alone and first of all that well here's a question we want to entertain calling from ... gland is calling from Jasper, Georgia\nOwn real tree radio morning my aunt\nAnd everybody else are doing really good there is a very informative don't you think Yes sir Yes sir certainly is okay what's your question\nWell I've been on the national forests and north Tulsa county ... county for Twenty years\nUh mainly used to I used to walk right there are what color frosting mild okay a rupture in your backyard over here in the whole new way over to member will Baptist church and uh and the\nNational forest used debate Blue Ridge wildlife management area a tea or ... years ago apple of Blue Ridge WMA was cut in half turn back to just national forest okay what all that being said the past two weeks I hiked\nUh ... and ...\n[noise] watershed areas the old clothes all white Springer Mountain oh boy and they are the hog population and those critics have completely devastated that Harry\nAnd I'm Wondering why this stay on the beat at all as title out individual trap or to go in there and set\nA sub top of hog traps the Prado Monday This Charles everyone knows you know there are direct are there any ... in direct competition with a beer bearing the turkey and I'm Wondering how is this going to ever be a drug test\nOkay who wants to jump in there\nI can I can now hosts are like ... all that well you know we do a lot of trapping ourselves and we have a we moved to the uh all the new whole Sandra trapping but it's we've got\nA quite a few of the ... more buster corral traps are that are that are are a lot more effective than the old style traps um we have certainly entertain the idea of of allowing a some members of the public bop bop permit and uh I think we have flexibility to do that I'm\nWithin ... on a permitted basis in a case by case basis um with ... with that area of being on the national forest that's going to be a a trickier prospect and they would have to be something that you would work to the forest service to do\nAh we are a lot more limited in our uh our management activities on the national forest even in the W. amazing the national forest than we are ... on a state owned or state police WMA\nSo um there's just the forest service has a lot more rules that they are subject to that uh that we wouldn't have to deal with and uh otherwise so I'm ...\nYou know we've we've got a ... problem all over the state and um it's it's a a really tough nut to crack and we are we're making progress but uh but it's slow progress guys that you got some input I Would\nSay that there are several small tracts of private land in that area and several of those homeowners to actively tried trapping pursue and have hunters in to help the situation but that being far service the state really can't do much about it\nOkay that Forest Service keeps popping up here in this question then yes Well Lynn I gotta tell ya I I'm not surprised that you're seeing so much sign [noise] um yeah it's\nTerrible back there I mean I I quit the frosty mountain area because there's more held his will bear there than there are there and I moved out there and move back to my old stomping grounds over the last ... or ... or ... than I Do here or there\nWith ... without some kind of a curtail ... hogs run rampant yes and that was\nWondering you know jeers you're saying about the cat don't use a few minutes ago about them being a either what I forget the trauma knowledge that you used to I was there they were single or\nResident transient\nYeah what's what's that what's that\nSaying theory applies to the hogs\nNo hogs are ah we consider hogs to be generally nomadic\nUm they do establish a home rains but um you know it's it they move with the food source um so uh generally females travel in sound waves with what their offspring and they're all springs offspring uh\nWhat their offspring and they're all springs all spring a bores tend to be a little bit more loan or you know when they're younger they roam the south so um they're just uh they're they're difficult to deal with\nAnd you know you mentioned bears you know you get to ... a year and I encourage you to use them [laughter] that's right\nThat that we've got an awful lot of the day or Glenn I appreciate the call sir but you have to get by you bet there we go and I mean you do that right there okay to manage this forty five after the our ah [noise] [noise]\nIs there any connection to the sighting of a coyote while you're deer hunting today or through the season and the sighting of hogs in the area that you pull the trigger on either one [noise]\nUh and you know the effect you are you you're you're sitting under their stance mhm you're sitting on the ground by sitting here saying oh my goodness there's a hog yup there's two or three yeah let's say there's a whole sound or out in front of you right oh yeah there's a there's a mama and six or eight okay what do you start shooting\nA say no I say if you got the ability to do so you make a mental note of where that is you come back and you start ... new set a trap and you walk them all out\nUh-huh okay [noise] uh I I think so too we can not hot enough to control the hog population I don't care if it's Alabama Georgia the Carolinas tend to say no matter what right\nWay of saying the hulk population grow despite no clothes season and the bag limits yep hunting is not an effective means of control hunting alone is not an effective means of control of pigs when\nWe don't spend enough time in the woods with a rifle in our hands and we don't want a foul up our deer hunt\nYou know you're talking about a an animal that has\nA you know ten\nTimes the rate productive capacity a beer and we know the deer can get out of control if we don't shoot enough up\nUh-huh so what's the ... I Know this doesn't work but I've had this discussion with wildlife guys but this was kind of impressive [noise] a a from a mated pair\nFirst round reproduction and they all live which is not likely but they all live and then the second round of reproduction\nAnd the third round of reproduction if they all live in Fifteen months we will go from two to a hundred night yep astronaut Adam that's not too wild uh\nNo I'm not I'm a hall skimmed breed a a ... as I can sort of reproducing six months of age is out of a a young south\n... and um they can um\nThat can breed or two times a year off and really that can squeeze the third time in there if you're if you stretch that year out to you know Thirteen fourteen month yeah though it's a it's insane and ah on top of that they have you know five to seven young maybe up to nine and some rare circumstances but\nWhat what you have here is an animal that was domesticated for several thousand years\nAnd and bread to have exceedingly higher reproductive rights higher reproductive rights than any other ... in the world of that size and then\nCast back out on the landscape and living in the wild wild\nOr any age see anything and everything that image definitely they will destroy a food crop that it is or is the proper terminology for that and actually easy an omnivore\nI Believe those yet eats anything and everything anything and everything at you what did what a [noise] it's so surprising to me is heats down a foot deep he root stand in each the roots\nYeah and a lot of cases it looks like you've come through in just taken a turn and play on turn the whole landscape over much light bears and that's the reason hogs and bears have done so well up in the mountains as I can exploit resources that things like a deer camp because I can dig\nThat can break up stumps like him are that can get a ... um all kinds of stuff out of the ground they can get roots and tumors and they can exploit these resources that are not available to a lot of other animals and that's why\nDon't let Mother Nature beat up on your home visit rhino shield G. A. dot com or call six seven eight to zero five forty five hundred call today to receive your twenty five percent off and how about for our listeners thirty percent off for you Eric anything what he was supposed to know you're telling me [laughter]\nSounds fine go right\nIn your house\nThis is Richard Misha on our frugal kitchens are slogan as life happens here and we mean\nOctober as an emotional reminder for those who have been affected by breast cancer my wife Vicky is battling this awful disease and I pray every day for here we're something pink into any of the ... and we will take two hundred fifty dollars off your kitchen then donate two hundred fifty dollars to breast cancer research plus you get free granite countertops Google for kitchens and thank you for your support [noise]\nWFDD FM Dorothy\nLove is breaking news weather man from five AM level\n\nCan use now Saturday morning it's eleven o'clock I'm Sheryl ... twenty four hour new center on top story this hour it is breaking news an active shooter investigation happening right now with a synagogue in Pittsburgh [noise] being a news reports police and other\nEmergency services are responding to the tree of life congregation synagogue\nThe gunman reportedly open fire on officers reports on a number of casualties now no confirmed numbers just yet\nFox News is reporting for people killed witnesses who call police say a man walked into the synagogue an open fire officers working to evacuate those in the building we are being told the gunmen may still be inside everybody's being told to shelter in place the squirrel hill neighborhood\nNear that synagogue again this is the tree of life congregation synagogue\nIn Pittsburgh stay with us right here at W. S. B. for updates on this developing story sixty degrees right now and peach tree street Atlanta's most accurate and dependable forecast is coming up continuing coverage now with the capture of a Florida Man suspected of sending at least fourteen mail bombs to prominence\nThe man suspected of sending at least fourteen mail bombs two prominent Democrats he's due in court Monday facing five federal charges more now from ABC News\nRest for allegedly mailing those more than a dozen pipe bombs to prominent Democrats and critics of President Trump ABC's mark ... is in South Florida or sees herself was picked up on friday\nVictor why we worked with say at a nightclub and knew him from a gym he says they aren't was very political\nIt was very dissatisfied with the liberal direction because I think that was back when Brock a bomb was president so obviously he had an axe to grind with that\nA van that say I was living out of at the time of his arrest was covered in stickers praising President Trump and vice president Mike Pence there were also stickers that showed Hillary Clinton and former President Obama with rifle scopes over their faces\nMark rental art ABC News Miami say aka former stripper and an amateur bodybuilder who is believed to have lived in that van\nFaces at least five federal charges in connection with the suspected package bombs those at the Justice Department are crediting DNA fingerprint matches misspellings as their key breaks in the case Sherry press and ABC News\nAnd we are getting a a news conference from Pittsburgh P. D. and they're telling us that there are several injured and that active shooter situation near the synagogue in Pittsburgh\n[noise] CNN reports buffalo police are investigating a suspicious device outside of post offices confirmed it will be the fifteenth century mailed bombing incidence World Series game three with one for the record books Dodgers beat the red Sox three to to an Eighteen innings lasting seven hours twenty minutes Boston now with two games to one game for begins at eight or nine tonight\nIt's the biggest game of the season today for the seventh ranked UGA\nA bulldogs WSBIU sport's director Jay Black is in Jacksonville where there is a lot on the line against number nine of Florida\nAnd coming up we'll have to pre game show right here on WSBIU at eleven thirty got an extra two bucks to spare well the cost of a chance to win tonight's Powerball jackpot estimated at seven hundred and fifty million bucks could be the fourth largest in us history us lottery history and the games third largest jackpot WSBIU eleven o three\nSuffice for your vote this November determine whether Washington under stores for undermines the college into all\nOf a mid term elections every step of\nWay for the power of experience from ... am seven fifty you asked me for\nAll about the fish and say these days let's face it we all have the same twenty four hours in and day in order to maximize our term that's\nWhy we use social media tax and emails instead of mailing letters or use mobile banking apps instead of driving to the bank or even ordering things out from Amazon to going shopping just gives you ... your life to be efficient what about your home\nHey this is Rick ... from attic innovations we know all about making your home more energy efficient and saving money on your energy bill\nA poorly insulated addict allows air to leak out of your home causing icy unit to run more often\nAt addict innovations one hundred percent lifetime guarantee on all of our etiquette invasion products\nA lifetime guarantee and some of our customers experience energy bill savings about ... thirty percent\nDon't let your addict cause your home to be inefficient call us at etiquette innovations today seven seven three eight three Fifteen fifty or visit addict innovations Ga dot com\nAddict innovations G. A. dot com\nI've got a four letter word that will make you squeal bugs home fix that shows David Baker and we're talking ugly four letter word today with my bugging critter guy Matt break from Britain a pest management\nThat four letter word can cause a lot of issues and many families days but it ... we'd been your bugging critter expert since Nineteen Seventy five okay\n... so what can I Do is a homeowner to prevent bugs\nSo much of what we do today for pest control is education but that's why we believe in treating the inside and outside of the home just treating the outside of the home it's a convenience for the company but not use a homeowner\nSo don't fall for the outside only pest control trip if that's what your company does just pay 'em half the money because that's all they're doing is half the job at brain we want to stop the bugs on the outside and inside so you have a book free home\nBurn it handles both bugs me critters and I should know because they've been to my house go online right now in schedule your appointment that brain a pest dot com that's B. R. E. D. a pest dot com\n[noise] the all depends on what are us be perfect aim during your daily commute giving yourself one more line of defense against major traffic problems in the u._s. be triple can traffic alerts on your fault\nI Want to get the kind of get stuck coming down the city of all the time for automatic that when you asked me ... and another to do what do you ask for your marriage do what you asked me for ...\nAnd we went in his time in Lebanon six wanting to update our top ... developing and breaking story that is about the active shooter situation at a synagogue and Pittsburgh Pittsburgh Police\nAre just held a news conference saying that that active situation is ongoing that they have multiple\nActive situation is ongoing that they have multiple injuries and telling people in the area to shelter in place multiple casualties we don't have any confirmed numbers just yet Fox News is reporting at least eight people were shot including two police officers let's go now lie for him in and the W. must be twenty four hour traffic center\nWill get heavy delays on Seventy five north dealt with roadwork between I twenty five and the south one twenty theloop otherwise we'll look and go to the rest of the metro roadways\nBut we do see a few delays ... county approaching Pleasant Hill road with only wasn't hill and three sixteen we've got some camera work there and they've got the H O T y and blocked and the ... or left wing bloc oh so that's causing just some minor delays there I'm for Doberman ws\nYour child to read and it was accurate and kind of a weather forecast\nMostly cloudy and cool as we had the day temperatures will tap out near sixty degrees a little bit breezy through the afternoon to twenty miles an hour at times drier air comes in for Sunday will have sunshine low forty six I near sixty eight on Monday mostly sunny low fifty to Seventy\nOne right now where it's fifty one degrees I'm Sheryl Castro news Ninety five five and a and seven fifty W ... depend on it now more from David Baker and the home takes that shell sixteen\nSixteen is always a good number\nSixteen as far as\nFor your Powerball I shouldn't be telling you decided to give me a tip Sierra did what inside information don't tell anybody a little office pool I don't know if you heard about it you might want an Robin Hood [laughter]\nAll right well you just you won't be coming up to the office with us no verification that she she had other just sweat pants but they're cute I got to stick up for\nWork or you know she went to the door to door [laughter] yeah All right I have to work\nThat's going to be your attitude home fix that show a new study five five and seven fifty W. S. B. you know you've had a ton of rain here in the last couple of days you know that does the trees\nGround around when it gets soggy and then you get a little bit of wind up all over they fall over and when they fall over whether they often do that is right to take out power lines and if your power line goes out your without electricity right\nSome people can't stand the log on lecture see some people to work from home some people have medical equipment a machine lifts beds yeah your basic services like a kitchen stuff your laundry or light security you can't be without that\nPeople can't survive without some of that literally can't live without some of it but you don't want to be inconvenience I Can't get your garage door open\nYou ever try and lift your garage door some of them are very heavy very heavy unless you've got to lift her but the liquor won't work and there's no electricity so here's what you do you go to a bright box electrical experts to design your system of uh\nAnd fifty four really shines on the day of installation they move your furniture all the way your old flooring clean up\nAnd leave and now through the end of the month he'll get free installation er no carpet hardwood laminate and vinyl mentioned promo co WSBIU receive an extra hundred dollars off fifty floor is the place to shop at your pets are doing well well what pets do in the house coal eight seven seven fifty four I go on line to fifty four dot com bust schedule your free in home consultation\nSo stop worrying about what your vets might do in your home and just love what they bring your life call and\nWe'll be knocking ...\nHave you heard people talking about they're remodeling nightmares you know contractors leading them high and dry after paying up front having the price double or even triple wants to work it started because they didn't quote it right or having to pay for mistakes or even accidents because the contractor was not insured\nHi this is Candace from explanations and sadly we hear stories like this every day if you're even thinking about siding ripping windows decks or any other home exterior project please don't take a chance on the price that seems too good to be true\nSure you might get lucky that the odds are against you and I'd get a quote from the team he's proven remodeling can be done on time on budget and without all that stress that you usually hear about in construction\nDiscover what stress free remodeling looks like and schedule your frequent today at ... dot com that's easy access to the A. T. I. O. N. S. dot com\nWhile it's been quite a year up and down temperatures heavy rain and wind and even hail storms and they're predicting another cold and wet winter to Erich von ... here and I got to let you know that I was worried about Mother Nature beating up my house my paint was fading have you been cracking that's why I called Jeff in rock Senate rhino shield\nShield looks like paint goes on like paint but unlike paint it will protect your home from Mother Nature for twenty five years and it's backed by are transferable warranty\nThat means no re painting or costly maintenance for twenty five years and yes we carry your wife's favorite color\nDon't let Mother Nature beat up on your home visit rhino shield G. A.\nDot com or call six seven eight to zero five forty five hundred call today to receive your twenty five percent off saying how about for our listeners thirty percent off for you Eric anything\nHe wasn't supposed to know you're telling me or [laughter]\nSounds fine bone\nIn your house\nThis scotch late for the latest wanting news or W. S. B. R. twenty four hour news centers here all weekend with updates four times in our depend on it and we're here Monday morning for thirty for mine but breaking news and traffic and whether every six minutes he was Ninety five five ... years a banker and more home fix it invites [noise]\nThat I didn't think it would catch on and sorry doing\nSeven twenty two and a half to listen to news Ninety five five and seven fifty W see the weather Roger my family roofing\nFor free roof analysis and if your roof is over ten Fifteen Years old you need a roof analysis you might as well get one free for Finley go to a roof roof dot\nCom schedule one they're the best or more can I say they are the weather is going to be in the sixties today ... only fifty one right now be Seventy five by Wednesday though like you know the chance of rain\nOr if there is one hour long it's going to last coming up later this afternoon\nWe are the home and the dog's Georgia programming starts eleven thirty with the pre game shows twelve thirty tailgate show with John Doe or desire Scott Howard three thirty kicked off but know\nThat our newsroom is fully staffed with news weather and traffic folk and if anything happens if any news breaks out or traffic or we have bad weather we will cut in immediately to keep you up to date so you won't miss a beat and listening to W. S. B.\nI wasn't give the phone number I dare but that's kind of map bridges north us brand a pest management need to get a hold of them you can go to braid a pest dot com that's B. R. E. D. a pest dot com or you can give them a call\nIf it's a real important seven seven oh for six six sixty seven hundred and like I didn't get that Britain now it's just that was ready to jump in okay\nWe can take a phone call but we have we we are under a little times scrutiny here so if I rush you excuse me ... you're on the Olympics that show\n[noise] I got stuck in my calls morning said we've got to be quick\nHey listen I've got a a mobile food service company and from time to time I have problems with bees coming around me and in fact I had a problem that at Stanford Stadium a couple of weeks ago um I Need to know what I can do to to get rid of those days without using something that's Harlem older human beings\nGood news is by the time we get back to Sanford here and a couple of weeks will be cold enough to where I don't think you'll have to be worried about the bees but worried about yellow jackets of them too\nI've been down there for several years this will just first time I've ever had a problem down there\nWell um\nWhat I Would suggest is this is not knowing what's your stand looks like but maybe on the back side of it having they have those yellow jacket traps and just like the color in a like you know Diane\nWith the sticky trap for the bees as well just because when we're in Sanford being back in September you know we're Ninety Ninety five degrees there going after sugars anything that ferment I mean that's what they're going after so it's just how can we prevent that strong of a flying pass from hovering around\nOr like I said that's the only thing I could come up with this on the backside is having some of those yellow jacket traps just to maybe lower them to the back side of it\nUm because that's a tough one that's a tough one\nOf those they don't seem to work I don't know I've been told that may be peppermint oil might keep them away\nI mean you can try different repellents a you know I Can't comment on that just 'cause I don't have one way or the other just as I have no research on it but um you can try certain you could try it I mean obviously but it's that's a tough one being the time of year early in the year you're gonna have much greater success as we get into colder temperatures obviously\nIf he's talking bees and he's got like for bees and he and people are going to kill me from this but if he kills those for bees or they're going to be more busy talking is no how many bees you there is just one little gang of bees that are harassing him\nYeah I mean it does it's just the time of year when we start football it's just you're kind of a ... yellow jacket season I'm not talking you know the the L jackets they really all the other day all jackets\nYour kind in peak season right then and they're they're just looking for anything sugary I mean that's the time of year and and we fight that inside Sanford Stadium you know sometimes to just because you know the drinks are flowing\nHedges right there too I'm sure I'm Sorry I don't think\nWe have no she said OK here's mayor eleven twenty six to sign up for us to ... to Georgia Florida Saturday beginning in about three and a half minutes\nThanks for listening thanks for calling thank you met writer for stopping by the day was a good information like you to even go dogs do listen to news Ninety five five and am seven fifty ws me your home with his eyes\nWere the new wave 'em where your online who I'm In\nWell where are your on line who by other men in the monetary relief and when they knew when they get on your neighbor heading ... you pick your own a day\nOr even really locally referring to offer him had gotten home and your basic information about your home and the next day when they do a great number three and there's no obligation we want to buy your home\nThat we're glad you're operate today off her bed really figure out last winter was a that was so cold in the ... or\n... I Believe we need new windows debt and Jonathan Europe north Georgia replacement windows elements out keep the comfort in and said big on your energy bill ... year round with infinity from Marvin fiber glass windows built for life said last a lifetime huge savings this month\nLimited time all for it in gee windows dot com\nThey pray and then when\nThe bulldog it represents the diversity string determination and it's a mascot symbol of dog nation the ram it also represents determination action leadership and as a matter of ...\nThe drug in America so it's no surprise but both skipped the long run they save money on a\nLaughing and yet they're big city deal from their hometown dealer Avon dot Chrysler jeep ramp right now which Trump Doberman major deal that all round modeled no holding back some of your vice good appetite dodge out deals every once and you also get the added ... low price promise what's your flu shot\nDollar trade casual it's super low financing so whether you're ready to buy a new ramp trucks go to the dealer determined to deliver like the dog out the Dodd Frank ... brown they've got the good to get you that big city deal with our own down the hill go visit them at forty one forty five Atlanta highway or apathy C. J. R. dot com ...\nOnly ... hour day\nWFDD FM Dorothy [laughter]\nBreaking news whether Trump\nPan Am\nOne of those\nContinues now Cheryl how through\nWith breaking news into the deli what's the new center active shooter update in Pittsburgh CNN affiliates Katie KIA now reports the gunmen had surrendered this happened near the tree of life congregation synagogue Katie K. A. L. to reporting at least seven killed three police officers shot at Jessica Morton works at a nearby restaurant in\nLive coverage of\nPeople you depend on the radio ads download it out on the outdoors and Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and James brain when it's warm than we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on ms ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nYeah my job to bring back here on the road a ... hour\nBe breaking weather and traffic you'd have banned on now\nDo you ever do you ask me radio waves until the latest WSBIU more traffic on on demand way\nAlive continuing coverage of the people you depend\nOn the radio I downloaded\nNobody us be broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming\nContinues here at a later our as\nNormal and on it [noise]\n\n[noise]\n\n\n[noise] morning workout\nI'm busy I hate it when I this white and James brain when it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news and traffic on demand is always severe weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now or do you have the radio ads downloaded out in the store\n[noise]\nThat what you asked me a broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com field and and I hard here the game as bulldog talk on these ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our normal and on it [noise]\n\n\n\nYeah I'm a junkie here on the road on ... hour\nThat can be breaking weather and traffic you'd have an aunt now on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on on demand way\nLive coverage on the people you depend on\nThe radio I downloaded out the door\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss late and Jamie brain when it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now or do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the when you asked me radio up north to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on ms ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the program and continues here at a later our normal depend on it [noise]\n\n\n\nYeah my job to bring back the on the road on ... hour\nCan be breaking weather and traffic you demand on now on your W. W. F. B. radio until the latest WSBIU lord traffic on demand and wait\nIn line came in coverage of people you depend on\nThe radio I downloaded out the door\nNobody USB abroad camping University of Georgia board or not he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on\nThese ... them on your radio and on AM seven fifty U. S. B. W. at the\nProgramming continues here at a later our\nNormal that can do that [noise]\n\n[noise]\n\n\nBusy I hate it when I miss late and James brain when it's warm than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece all their their latest news and traffic on demand is always the beer weather coverage about when something happens breaking news station\nOn your time and the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board or not\nHe bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com to an end I hard here the game as bulldog talk on music ... about them on your radio and on AM seven fifty U. S. B.\nW. F. B. program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nYeah I'm a junkie briefing on the road a ... hour\nBe breaking weather and traffic you've and on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage on the news people you depend on the radio I downloaded out the door\nAlive continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nMorning workout\nBusy I hate it when I miss late and James brain storms and we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their\nTheir latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth through double USB radio dot com tune in and I hard here the game at bulldog talk on these ... by them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\n... hour\nCan be breaking weather and traffic you'd have and on now\nDo you ever do you ask the radio I listen to the latest WSBIU more traffic on on demand where\nLive continuing coverage from people you depend on the radio ads downloaded out the door\nNobody you asked me if rod camping University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the ws the radio off\nBritain's we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. F. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n\nI'm busy I hate it when I this white and Jamie brain when they stormed and we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse pizza all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio and download it out in the store\n[noise]\nNow when you asked me a broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions\nWe cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com to an end I hard here the game and bulldog talk on these ... by them on your radio and on AMC seven fifty don't you ask me do when you ask the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road a ... hour\nYou know breaking weather and traffic you've and on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand where\nLive coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie free and when they stormed and Willie power\nWould be like a guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab he's all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and get into play [noise]\nNow what do you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up through the USB radio dot com tune in and I hard here the game as bulldog talk on these ... by them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nPower\nYou know breaking news weather and traffic you've and on now on W. W. F. B. radio I listen to the latest WSBIU more traffic on on demand way\nAlive [noise] continuing coverage on the news people you depend on the radio I downloaded\nYou ask me is broadcast the University of Georgia sports on ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on me\nHard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. F. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nMorning workout\nA busy I hate it when I miss late and James and brain when it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W s be real advocates all their their latest news in traffic on demand it always severe weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now or do you have the radio ads downloaded out in the store and it'll play [noise]\nNow when you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through ws be radio dot com tune in and I hard here the game and\nBulldog talk on ms ... by them on your radio and on a um seven fifty you ask me\nDo when you ask the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road on ... hour\nCan you know breaking news\nWeather and traffic you've and on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand for\nLive coverage on the people you depend on the radio I downloaded out in the outdoors\nI'm busy I hate it when I miss white and James rain storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do what are you at the radio ads downloaded out in the dark and Google Play [noise]\nWSBIU broadcasting University of Georgia board somebody\nBought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the nobody USB radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. program and continues here at a later our normal that can do that [noise]\n\n\n\n... power\nBe breaking weather and traffic either on on your\nDoor you had to do you have the radio waves until the latest WSBIU more traffic onto their hands when\nLive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on\nNot by by ... am seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on ms ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n[noise]\n\n\n\nA busy I hate it when I miss white and Jamie brain when a storm did we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always severe weather coverage what about when somebody has breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now that don't you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nA ... hour\nYou know breaking weather and traffic you demand on now on your\nDoor you had to do you ask the radio I listen to the latest WSBIU more traffic on demand where\nLive coverage on the people you depend on the radio I downloaded\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and Jamie brain\nWhen it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their\nTheir latest news and traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the store and don't play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road ... ... is our\nBe breaking news weather and traffic you've and on on your door you had to do when you ask me radio waves until the latest WSBIU more traffic on on demand way\nLive continuing coverage of the people you depend on the radio out downloaded out in the outdoors\nThat what you ask me is broadcasting University of Georgia sports on not by by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com tune in and I hard here the game a\nBulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n[noise]\n\n\n\nA busy I hate it when I miss white and Jamie brain when storms and we live our what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their\nTheir latest news in traffic on demand is always the weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading data right now to do what do you have the radio ads downloaded out in the store and go play [noise]\nNow when you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on music ... by them on your radio and on a um seven fifty W. S. B.\nW. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road and ... how\nYou know breaking news weather and traffic you've ever been on on your\nDoor you had to do when you ask the radio waves until later WSBIU more traffic on on demand where\nAlive and came up with people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss white and Jamie brain when it's warm than we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out of the dark\n[noise]\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north drew W. S. B. radio dot com tune in and I hard here the game as bulldog talk on ms ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\n... how\nThat can be breaking\nWeather and traffic you've and on now\nDo you do when you asked me radio women to the latest WSBIU more traffic on on demand way\nAlive [noise] continuing coverage of people you depend on the radio I downloaded out the door\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie breed and when they stormed ... power\nThen when I miss white and Jamie brain\nStorms and we lose power what the guy you know you can listen to W. S. B. anytime anywhere with a W s be real advocates all their\nTheir latest news in traffic on demand it always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now or do you have the radio and download it out in the store\n[noise]\nThat what you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through ws be radio dot com tune in and I hard here the game and bulldog talk on\nMs ... by them on your radio and on a um seven fifty you asked me WFDD programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\n[noise] yeah my job to be on the road on ... hour\nYou know breaking weather and traffic you've been going on now on your\nDoor you had to do when you ask the radio waves until later WSBIU more traffic on on demand where\nLive coverage on the people you depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this late in gym to train\nWhen it's warm than we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their\nTheir latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty billion broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... him on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour one that can be\nBringing weather and traffic you'd have and on now\nDo you ever do you have the radio I listen to the latest WSBIU more traffic on on demand with\nLive continuing coverage of people you depend on the radio out downloaded out the door\nNoble USB is broadcasting University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I miss white and Jamie breed and when they stormed than we lose power when\nGuy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all there\nBe anytime anywhere with a W it'd be real advocate the all their their latest news and traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow when you asked me a broadcasting University of Georgia sports on\nThe part by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on that when you asked me radio up or through double USB radio dot com tune in and I hard here the game at\nBulldog talk on music ... about them on your radio and on AMC seven fifty W. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n... and we live our\nCan be bringing weather and traffic you demand on now on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand with\nLive coverage on the news people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie free\nAnd when they stormed and we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time", "show_name": "no_show", "year": "2018", "city": "Doraville", "day": "27"}