{"month": "10", "state": "GA", "station": "WSBB", "content": "\n\n\nI'm a junkie here on the road ... power\nBe bringing weather and traffic either end on now\nDo you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage from people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia\nNow when you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nA busy I hate it when I this white and Jamie breed\nWhen a storm didn't release power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out in the store and they don't play [noise]\nNow when you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com Chilean and I hard here the game as bulldog talk on ms ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nMy job to prevent the on the road ... power\nBe bringing weather and traffic either end on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand for\nLive coverage of people you depend on the radio I downloaded out in the outdoors and Google Play [laughter]\n\nI'm busy I hate it when I miss white and Jamie brain when it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand it always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now to do what are you at the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... him on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n... hour\nHear breaking news weather and traffic either end\nNow on\nW. W. F. B. radio waves until the latest WSBIU or traffic on demand and\nLive coverage on the news people you depend on the radio ads downloaded\nWhat are you asking me as broadcasting University of Georgia sports on TV by by them at a um seven fifty broadcast restrictions we cannot operate the UGA exports presentation\nThe broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on ms ... them on your radio and on a um seven fifty W. S. B. W. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nMorning workout\nA busy I hate it when I this late and James and brain\nWhen storms and we'll just power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W s the relapse pizza all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store and get it or play [noise]\nThat what you asked me a broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... by them on your radio and on AM seven fifty W. S. B.\nW. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road a ... hour\nYou know breaking weather and traffic you demand on on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on on demand where\nLive coverage on the people you depend on the radio out download it out on the outdoors and Google Play [laughter]\nMorning workout\nA busy I hate it when I miss white and Jamie breed when they stormed than we leave our what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the weather coverage what about when something happens breaking news yeah your station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... pi by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nBulldog talk on mute ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the program and continues here at a later our normal and on it [noise]\n\n\n... power\nBe bringing weather and traffic you demand on on your\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand and\nLive coverage on the people you depend on\nThe radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on ... about them on your radio and\nOn AM seven fifty you ask the W F the programming continues here at a later our normal tend on it [noise]\nThey're our as normal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this white and Jamie breed when they stormed the Willis Tower would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a double USB relapse piece of all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty new to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour\nCan be breaking news weather and traffic you demand on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand where\nLive [noise] continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd go play [laughter] morning workout\nI'm busy I hate it when I miss white and James brain\nStorms and relief power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia by ...\nBy ... am seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on mute ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie grew back here on the road a ... hour\nYou know breaking weather and traffic you know on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on demand way\nLive continuing coverage from people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on not by by them I Am seven fifty broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n[noise]\n\n\n\nBusy I hate it when I this latest James debris and when it's warm than we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a double USB real advocates all their their latest news in traffic on demand is always have your weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and they'll play [noise]\nNow what do you ask me is broadcasting University of Georgia board not buy buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north readable USB radio dot com to an end I hard here the game at\nBulldog talk on ms ... by them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nA ... hour\nBe bringing weather and traffic either end on no harm us go\nDo you ever do you have the radio I listen to the latest WSBIU more traffic on on demand way\nAlive continuing coverage of people you depend on\nThe radio I downloaded out the door and Google Play [laughter] morning workout\nBusy I hate it when I miss late and James brain\nStorms and release power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on not buy buy them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the menu at the radio up north to W. S. B. radio dot com student and I hard here the game as\nBulldog talk on mute ... them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nYou know breaking news weather and traffic you demand on on your door you had to do you ask me radio waves until the latest WSBIU more traffic on demand way\nLive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by ... am seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com CNN and I hard here the game a bulldog talk on music ... them on your radio and on a um seven fifty U. S. B.\nW. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n\n\nBusy I hate it when I miss white and Jamie brain when storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P real advocate all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and they'll play [noise]\nNow when you asked me a broadcasting University of Georgia board or not\nHe bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and eh by hard here the game at bulldog talk on\nThese ... by them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] yeah I'm a junkie here on the road a ... hour\nBe bringing weather and traffic either on on your\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand and\nAlive continuing coverage on the news people you depend on the radio I downloaded out the door\nMorning workout\nBusy I hate it when I this white and James brain\nStorms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the store and\n[noise]\nNow what do you ask me is broadcasting University of Georgia ... pi by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and buy hard\nHere the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nThat can be bringing weather and traffic you've and on now on\nW. W. F. B. radio waves him to the latest WSBIU more traffic on on demand way\nLive coverage on the new people you depend on the radio I downloaded\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nI'm busy I hate it when I this white and Jamie brain when it's warm than we live\nI'm busy I hate it when I this white and Jamie the brain when it's warm than we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB Rio apathy is all their\nTheir latest news in traffic on demand is always severe weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading not happen right now do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you asked me a broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA exports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... about them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nHear breaking weather and traffic either end on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic onto their hand when\nLive coverage on the people you depend on the radio I downloaded out on the door\nAnd go go play [laughter] morning workout\nA busy I hate it when I this white and Jamie breed\nWhen it formed and we lose our ...\nTo ... you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their\nTheir latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out on the app store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nCan be breaking weather and traffic you've ever end on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand and\nAlso important for the lowest possible levels of leadership to be very supportive and helping their members get the help that they need\nWhen I went to get help I had more help then I asked for my entire command if sometimes challenging to come to a senior staff members senior officer in the unit with a problem there's not a commanding officer out there or a leadership staff out there that doesn't while\nAsk learn more by sitting WWW jak real warriors dot net are calling one eight six six nine six six one zero to zero\nWhen you ask me about\n... er Cox media group station\n[noise] twenty four hour news whether an from\nFive and am sent\nMe a lot to me\nIt's three o'clock on Charlie O'Brien law of your best me twenty four hour news center top story this hour definitely give us be top national storage reactions are coming in from all over the shift after a deadly mass shooting at a synagogue in Pittsburgh Saturday ABC's Taliban as the leader of\nThe Anti Defamation league sat in a statement the attack in Pittsburgh and it was believed to be the deadliest on the Jewish community in us history eleven people killed at a synagogue Saturday morning and the squirrel hill section of Pittsburgh\nPeople wounded included for police officers six total forty six year old Robert ... hours from the suburb of Baldwin face was twenty nine federal charges including federal hate crimes ABC's chief justice correspond up your Thomas on why they hate crime charges were added\n... statue there is one that is taking quite seriously because it involves an act of violence based on race or ethnic background religion is the kind of climate which don't lose kills simply for who they are\nReports also shows bars was making anti Semitic posts on social media Bowers was armed with an A R style assault rifle and three handguns a vigil was held near the synagogue Saturday evening President Trump has ordered flags at all federal buildings to be flown at half staff hot anti B senior\nPretty news Tom three oh on channel two meteorologist bread Mitch calling for ... for now I'm a sunny day coming up headlines\nFor ... for now and it's sunny day coming up\nHeadlines most accurate and dependable forecast just ahead Georgia's strict laws lead to a large percentage of voters and critics say that puts voters at risk for disenfranchised went five hundred thousand purged in twenty seven female alone\nElection law experts call it the largest mass disenfranchisement in us history Georgia has an act of some of the nation's toughest voting laws over the past two decades\nBritain First first this is double you asked me twenty four hour continuing news and I were\nGun shop owner is cleaning up after a botched robbery about four o'clock Saturday morning security video shows the would be seat smashed car into the front of Ashworth guns but he likes all you're left empty handed owner Lutheran la Croix pills channel to attribute you locks up all these guns that money you every\nNow and I hate these with a passion cause they showed it on her but I Do absolutely nuts and then they'll come in and steal from people who work in our in what they did\nLa Croix says it's divorce break him as his gun shop in Cobb County California attorney general Javier but Sarah agreed friday to put this state and the neutron above the law on hold he's waiting for a federal appeals court to decide if any big that do travel if he is legal\nSeveral your MySpace sports Georgia beat Florida thirty six Seventeen several USB news time three go to\nThe twenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way we gave me do pre hand the southeast largest news team news Ninety five five Pan Am ... don't you ask me wondering\nHow does her unborn baby drinking alcohol during pregnancy can cause low birth weight birth back and range\nI'm lifelong disorder known as me don't alcohol in order to deal with these disorders may have difficulty paying attention poor coordination developmental delays typical facial features\nMore than just in nine or ... views and the nature of their problem is not recognized as a ... entering the\nCriminal justice can end up job when they're struggling with addiction children and adults with him at a ... you can think of the appropriate strategies in an intervention there is no man's face time didn't drink during pregnancy fancy there one hundred percent of all is a woman does\nNot trained carrying ...\nYou are pregnant for trying to get pregnant and cannot stop drinking\nPlease don't train [noise]\nAre a ton of social networking Web sites but one stands apart for a very special reason this one saves lives each matching donors dot com matching donors dot com links organ donors with people in need of kidney and other transplants in the U.S Nineteen people die each day waiting\nFor an organ transplant most of them for kidney if you've ever considered becoming a living\nOrgan donor or if you're someone in need of an organ transplant visit matching donors dot com home of the greatest gift of all the gift of life matching donors dot com what I\nSomeone that's being used on three oh pi not object coverage of traffic and whether it starts with a guy who has to be twenty four hour traffic center and interact with Mike Segal\nEgg good news allied the ws speech and camp crash just cleared all linked now open ... more lent avenue access sixty a and B travel advisory continues think when that county highway twenty hillside drive all linked to block their\nDue to crash you can use highway one twenty four at an alternate and construction soda construction is out of step in that county eighty five north down\nAt Hamilton middle road actually won twenty a right lane block their this report rushed by ... dot org a girl and can you dream of becoming a doctor an elder in Guatemala dreams of being part of a community reach out and change their world now changed your owed on down dot org I'm Mike shields ws\n... dollar just spreading it\nWith the most accurate and dependable weather forecast chili falling into the forties overnight without clearing sky will bottom out near forty six to start the day that mostly sunny and highest Seventy one for Sunday afternoon on Monday we'll stay sunny cool in the morning at fifty back to Ohio Seventy and then on Tuesday sunny low forty eight Seventy three\nWSBIU storm track or radar is clear forty two degrees on Peachtree Street at three oh six I'm Charlie O'Brian used Ninety five five and seven fifty WBEZ they depend on it\nIt's just rerun boys and girls don't bother to call there's no one here to answer besides scale an hour and here we are all playing just listen and enjoy\nSo Neal outside five five and am Seventy Seventy oh you asked me for fishing in housing or anything of the great outdoors\nTo me more fishing and hunting or anything and the great outdoors O'Neill Williams is your guy went outside with O'Neill\nGood morning washing our own sun blacken our headquarters\nIn both Django Ohio north Georgia this is Neil Nye resenting the\nReal dream Radio Welcome to a brand new one huge Saturday morning [noise]\nYes indeed glad you're joining us going to skip all the self promotion as warning we're way behind known to cause I'm going going going to get a candidate and he's calling from Dallas to Georgia go more than Kevin\n... are you doing I'm trial off Japan [noise] ... yeah\n... or ... or\nUm and then they were there in Dallas as well and this is is on the on top of amateur I consider myself to at least but I'm the heat a lot of people have been talking about the heat the sheer do you think of the heat affects our deer season and not only that ah the gentleman was talking about Alabama and how their season\nStarts later and it was later I Believe that that's due to ... pattern and for instance of 'em I've actually had the best season that I've had this year I've actually shot three or should we harvest it three deer and this this hot Georgia eight with a boat this year\nBut um I Believe that it's all about um I Believe is all about the ... better and you know ... and ... or ... usually starts a little bit later but in Alabama there start similar than ours\nAnd a jam or if it's been hot but it's still it's still doable in my opinion absolutely just a if it's warm and wet then all that means is the food plots continue to grow perhaps a dozen affected there at all\nYeah but\nYeah I'm just curious about that and I mean another thing to think about this with the the debate in laws or whether you agree with it or not but that's that's another thing that that is this happening the athlete going on in the last Georgia as well to do a little bit of an does I've never had it there but\nBut I don't know a lot of people have been you know the heat heat it's too hot hub of\nFleas mosquitoes and whatnot but I've uh I've I've been pretty happy with with my seasonally\nThey I Know I I actually purchased a muzzle or that you were one of the people that China are always talking about why purchase my first one this morning and I'm hoping next week on a level of season opens I'll be able to go do something\nWhether you go man yeah well they last about earlier this you'll you'll enjoy the muzzle loading yeah really well I gotta go legit called Yes sir I see you soon this is O'Neill back to miss my first right when I didn't which proper coaching we'll be back\nWhere you will send over later my breath matter of fact thanks for calling them back\nYes or if I have a great weekend on the water in the field and joy\nYou ban there you go hey uh [noise] let's see let's\nTalk to a gym he's calling from Monroe, Georgia go more to Jim what do you say\nGood morning ma'am I just wanted to say thank you very much professor oatmeal without them for what you do for ... how are you a certain kind of you will be up one morning when I was going from place to stay at home or\nBack side on the couch and you should get out there and when the\n... this will be going on my six year and for the last five years what you said was very true\nAll and now I've sort of crazy ideas now look to the windy days and even even study them more than I Do the other days but I still hunt pretty much about two eighty percent of the the hunting time and gun season so I just want to let people know that you really and truly\nHill Bush doesn't cost is the thing if we listen and pay attention that's all we got to do well thank\nYou very much that's a that's a confirmation coming from you that I value highly because as I say at ad nauseam the more you know the more you understand the more successful you can be in the outdoors\nIs or it makes it a whole lot more pleasurable sometimes just sit there watch unfold what you've already told us but to actually see it in action just is is is like a missed implication\nWell well thank you very much I if if if not all that often that I'll get a call ... or someone will say something of that nature which is very supportive of of what we try to do I know on the television show uh I'm I'm increasingly spending more time with\nWhat to do when did do it how to do it\nAnd what the results probably is and why it turned out that way\nYeah certainly and comes across [noise] excuse me in it comes across and you certainly certainly helped a lot of the uh\nI'm sure there's others then helped out there they just you know played tied up and sometimes they can't call and tell you but uh you know like you had a um unfortunately experiences before some people just last year because they don't agree with your your\nViewpoints but you know everybody has a viewpoint is lucky they onion they don't ...\n[laughter] hide nothing a gym I gotta go ... I I hate to cut off somebody with\nI Know it's like a gym I gotta go pile I I hate to cut off somebody with such a complementary call but I've got to this is only a we'll be back\nWhat happened to\nUs the sponsors listen all next week to the mark Arab joke for your chance to win tickets to seat Jeff lens E. L. O. friday July bets at state bar marina known for their ethic\nLive shows and a distinct styled it blends rock pop and classical music the yellow has more than twenty top forty hits across the U.S and the u._k. tickets go on sale Monday at ten am ad live nation dot com\nThank you thank you for supporting the sponsors ... am seven fifty or would you ask me\nYou know the type of driver as soon as you get stuck behind one\nThe driver who wait too long to go after the light turns green or drives too slow for the traffic flow\nThe driver who isn't paying attention because they are talking on the phone\nThey're not only a nuisance they're downright dangerous driving while using a cell phone can lead to crashes because talking on the phone reduces your reaction time\nHands free devices are no safer\nYour hands me be on the wheel but your mind is on the phone conversation\nIt's easy to see cell phone distracted driving and others and but we don't often see in our selves\nThe national safety council estimates that one in four car crashes involve someone using a cell phone\nAnd phone use now joins alcohol and speeding as a leading cause of car crashes no call or text messages worth of life remember when you're on the road stay off the phone learn more at ... dot org a public service from the national safety council\nPanther is the second leading cause of death that America for African Americans the diseases even more deadly but Dr David ... Moffitt Cancer Center in Tampa, Florida says it doesn't have to be a death\nSentence [noise] most people are very uh scared about that whole condition about screening people like to talk about\nThe thing about colon cancer they would hand emphasizing a pet is a ... percent of all and care for putting\nPeople on average risk for the disease should start getting screened at age ... and get cold enough to be every ten years and every\nThings you can do to lower your risk for colon cancer\nMinimize nothing reading process for example being a\nFresh vegetables and fruit high fiber hand in hand with that also goes they should exercise\nEmbraced a healthy lifestyle and get going to find out more inside Moffett dot com\nOne eight eight eight six six three three for a\nWhile you asked me mark ... every morning and entertaining talk every evening when I'm In ... for so many years harem does the local daily talk show Lawrence\nHas this amazing way of making everybody feel like you're his money he's your body just means you for the first time mark\n... is plugged in every day seven PM till nine Ninety five five and am seven fifty you know when you asked me\n[noise] um now it's time for the running theme silent hero foundation award\nTwenty five after the hours time my right so a fire\nRight silent hero recognition let me read it to you this is interesting now you've got to get this big journey October the ... two thousand Seventeen Monroe County fire department received a nine one one call about two young men at high falls park along the river and they had been wash down\nThe waterfall that this is considerable I Wish I could show you a picture of this waterfall this is not a little trickle wedding and this is a water law\nThey were age is twelve and seven T.\nV. aviation unit took off with Greg mercy here and a firefighter by the name of ... brown\nBrown\nStrapped himself to the ... of about a hundred feet and went down into the waters with the helicopters hovering above him\nNow he could not use a quotation device\nBecause it made him so bulky would washing downstream now this young man is about to drown so Rushdie took off he went down into the water without rotation device strapped to rope do helicopter\nHe got washed downstream was violent current got tangled in the ropes popped a rap the rope around himself and the victim\nAnd the helicopter pull them out\nAs you can see in my description he didn't just save himself he was upside down with the rope around his\nThemselves the was upside down with a rope around his neck but his objective was the victim at the bottom of the falls\nA truce Ireland hero when he popped out of the water he had the victim in hand and the helicopter raise them out of the current\nThe Ronnie James foundation silent hero recognition for October the thirteenth and always real proud to be able to talk about it [noise] twenty seven after the hour right now\nFor all for eight seven to zero seven fifty eight hundred nine seven to eight to five five I'm a refresh my screen here and see if I have any calls there we go [noise] so\nAre you planning to go fishing today was windy high pressure area why would it change your fishing ... remember most of the things that I tell you most of the things that I've learned I've learned about reading am spending a lot of time on the on the water\nThis week I finished it Cajun vista lodge and it was a terrific demonstration of the following principle when you're fishing unfamiliar waters\nOr whether it's the light stream\nSalt water deep water no matter what this is a a principal if you're not tuned into the fish specifically that will help you get more bites and what is that\n\nUses small bite and light line house so what does how does that help\nAnd I have a ...\nSmall bite and light line allows you to feel the bait and you'll get more by\nHow many more by ... I don't know its cage invest the lodge before nine thirty in the morning you've got fifty bites\nDoes it matter if you get fifty five instead of fifty it does to me\nAnd it will to you whether you're a spotted bass large bath stripers redfish drought whatever the case might be you'll get more by with a smaller by then you and light line then you will with a heavier land but here's the kicker to that\nIt is a simple solution that makes sense and can better your standard of living and care should you or a loved one become ill or disabled\nYou get more information and three and war need more dot com that's the number three I N number more need more dot com\nHonor courage and strength of character and these qualities are embodied by the recipients of the medal of honor\nNow let's recognize this week's medal of honor recipient on O'Neill outside\nOkay time for the medal of honor this week\nThomas Kim's when\nPrivacy merged Miami\nArmy Vietnam February Nineteen sixty a\nKennedy was serving on a reconnaissance in force mission and asked his company came under intense rocket automatic weapons in small arms fire from a bank Viet Cong for\nThe company began\nImmediately beach and began assaulting the enemy bunker complex\nAs they were moving through the heavy enemy fire a enemy through a grenade into the group [noise] Kansas when threw himself on the grenade\nAnd block the explosion with his body\nAs a result of is courageous actions he received severe head and ...\nThrough his courage complete disregard for his personal safety and concern for his fellow soldiers ... loss of life in Egypt the seven other men in his element he live\nIs extraordinary heroism at the risk of his life above and beyond the call of duty\nOr in keeping with the highest traditions of the military service [noise] and I picked him because he\nDied recently ... last year two thousand Seventeen the medal of honor tribute five forty one it is now let's talk to Andy he's calling own O'Neill outside\nMore than Andy you're on the radio but hey what's going on with you talked to me\nI was just a question on how you talk about the ... ... a lot of man you got me make reservations\nOh yeah you should ever have you ever had the pleasure of going down that electrical ...\nOh as a latch yes I've fished in Appalachia many many times I've never faced with a guide and Appalachia which\nWas my my great all\nYou ... what about me and my brother we used to go down the Appalachian oh probably once a year and the and I tell you what it is just like you were saying see hook in all you got your limit and about an hour\nIt's hard to say as soon as you drop a hook and the ... you got your limit and about an hour and ... they would you know they're calling your fish in your ... your ... your name on it so at dinnertime do cook your fish for in a way you want it oh boy that\nThat it was it was often but I'm going to have to check out the cage invest the laws that song called like when I'm Out here to work and stuff but uh that's how old are you to vote for\nA good deal glad you called good luck to you and let me know if you've ever make it down there oh yeah absolutely you bet I love love for you to go I'm sure you'll enjoy yourself now Rick is calling from uh Rick is calling from Roswell good morning Rick\nLet's say let me to this thing in the year there your list talked Rick calling from Roswell good morning Rick\nHi Hi Neal how are you good um so I have four quick things I wanted to talk with you about okay first of all I ordered the double pack of fire rate and got the cap good that you're right that cap is really nice cap\nLast year for a long time\nYeah it looks nice to it it it fits me while I I like it a lot but the question I have is\nA there's the fiery have a shelf life to it\nA minimum is five years okay and we had last longer than that but the they they allow it for five years\nOkay now the other the other three things although I'm not a hunter I listen to your program on a regular basis and I'm not a hunter but I'm a calculus in physics a tutor for high school students okay and what I wanted to mention do you ... are you aware that in calculus we do a um\nA fishing problem and in physics we do a hunting problem among the ones that we do\nI did not I love this I'd love to to be able to see the substance of both problems\nSo I'll give you the scenario for the calculus problem okay so you're sitting in a boat\nOr you've looked at fish and uh you know how high above the water the tip of your fishing rod is ... and you know how fast you're really in the fish um we can figure out using differential calculus in some ... or the ... the er um\nWe can figure out how fast the angle is changing between your line in the water and we can also figure out how fast that fish is coming toward the boat I\nUh using calculus and either um ... al ... or the and the ...\nOr ... river ... [laughter] I Can't even say it and I tutor battery on the narrow ms so that you have a narrow it down to the ... the some of the squares of the two opposite side equals the some of the square of the ... yeah or something like that does\nSo it it applies to a rice triangle and it's a it's a as you said the some of the squares of the two legs has the equal the square of the pot and right\nThere you are and so hey listen Rick it's been a long long time\n[laughter] so so anyway you got to write try and go with the tip of your ... a fishing rod coming down to the water and then going out to the fish and then your line forms the hype hot news and you can do all kinds of a mathematical calculations based on that right triangle\nUm so that's the scenario with calculus for physics it's a hunting scenario\nSuppose that your target is like\nOh I don't know three hundred yards away although Isaac's we used as a metric we'd say three hundred meters away right and I'm\nSupposed to be sure you're fired your weapon on a level level with the ground and um suppose that um\nHow how do you have to aim above your target if you know your muscle velocity of the a rifle how far above your target do you have to aim so that when the bullet arrives it hits where you want it to hit okay that's a ... and you use Newton's I'm\nA traditional um equations of of motion to solve that is a fairly simple problem to do\nForeign let me ask you a question of question Rick\n[noise] if you fired\nA bullet in perfectly level\nAnd you fired a bullet in a way to a hundred grams alright okay\nAnd you win that bullet exited the barrel and the the the ground in front of us perfectly flat when that bullet exits the barrel if you dropped to boom it\nFrom that position it exactly the same time both bone it will hit the ground at the same time\nYou've had some physics how 'bout that you've had some physics training because that's one of the things that they teach you in physics has said exactly what you said\nI'm impressed with myself yeah\nWell I'm impressed with myself yeah\nI'm impressed with you too that I I'm not a lot of people know that\n[laughter] yeah velocity does that change gravity\nRight gravity that that that the two are forced vectors if you will are independent\nOf each other you've got the the vector of of its horizontal velocity and you have the vector\nOf as a vertical velocity which initially is zero coming out of the barrel but then gravity starts acting on it as soon as that exits the barrel ... and it starts coming down and gravity doesn't care whether the bullets moving or not if you know it's going to act on the bullet\nOr regardless and so it's just as you said\n...\nWrote here's the question I got though or I Know that physics question does that was ... I wanted to ask you a question do you happen to know what\nThe muzzle velocity of your muscle loader is\nNot offhand because it would change according to the power that ... a barrel\nYeah yeah that makes sense\nBecause you can use anywhere from ... grains to a hundred and fifty grains whether it's a maximum\nOf ... a muzzle older they can handle a maximum load so you have the ability to change how much powder is uh is is behind the bullet\nYes in a Muslim over you do yes and I do write about changes in how much power when you get in it pardon me say again Rick I'm Sorry\nA highly ... how do you make the decision as to how much a powder to put in it\nWell it's the size of the animal the anticipated distance to the shot or and what you're used to and all that is solved on the range\nAnd you do this on the fly is your as your hunting\nNo you do that prior okay no one\nOnce you're in the woods once you are loaded once you are in this than whether it's ... or hogs are dear muti or a or whatever there is no mystery there is no decision to be made\nSo let me ask this question is and on\nSo let's let's say you're in the stand or have you already decided when you're in this than what you're going after or do you have like a fifty different bullets all the different\nOh and take a kid along you're entirely ... ... [noise]\nAnd when you ask me continue to give you end up coverage of the mid term election Georgia and nationally and the chance to hear the candidates for governor\nScott played from Atlanta It's MORNING news you heard Brian ... must be now Stacey Abrams joins there's Tuesday Morning eight eight thirty in debt for the candidates\nFor governor in depth coverage and analysis on why this process and he was five five and a um ... W asked me what you ask me about ... media group station\n[noise] twenty four hour news weather and five and am settled it\nAsked me to his name\nNow [noise] just four o'clock\nOn Charlie O'Brian ended up all of us may twenty four hour news center not story this hour definitely go ... top national story another mass shooting Saturday this time at a synagogue in Pittsburgh details now from ABC's taught in\nFederal prosecutors announced Saturday Night that the suspected gunman in the Pittsburgh synagogue massacre that killed eleven people will face twenty nine charges including using a firearm to commit murder and eleven count of obstruction of exercise of religious beliefs resulting in death\nOf federal investigators say Robert ... targeted worshipers because of their face but likely acted alone this latest act abolish may change how law enforcement treats these acts of homegrown terrorism the Gomez the former special FBI agent ABC News consult\nThe fact is there are a lot of indicators that we are seeing involving this guy powers a lot of these indicators this extremist activity extremist behavior postings and most of all\nAn indicator of hate that these people are espousing\nDozens of people jammed an intersection for a vigil Saturday evening for the victims near the synagogue a vote vote vote chat broke out during the emotional gathering taught and ABC News\nThat will give us be news time for one channel to me to Rob of just Brad Mitt sees patchy for now and it's sunny day coming up as long as most accurate and dependable forecasts straight ahead\nMetro Atlanta synagogues are tightened security after Saturday's mass shooting at the tree of life synagogue in Pittsburgh several did several more wounded but metro Atlanta officials say they are not aware of any local Fritz security has been a concern for years AT Metro synagogue has\nFirst first this is double you ask me twenty four hour continuing new number seven\nGeorgia pools away and the second half or a huge thirty six Seventeen victory over rival Florida in Jacksonville coach Kirby Smart tells us to be talking\nAbout earning victory they would not be ... or just out we would not get it just kept we had to earn it and redo\nUGA now gets ready for Kentucky with the women are advancing to the SEC championship game the WSBIU tailgate show starts at eleven thirty Saturday with kick off at three thirty\nRight here on WSBIU radio a firefighter in training likely will not be hired after a strange theft arresting Clayton County\nDetails now from several US cities journal Castro look\nOut for is still in Clinton County EMS ambulance has been cancelled it was recorded still in from the Clinton County fire station near ... regional hospital\nHere ... found the ambulance in a parking lot of South Lake ... near the food court\nGet these watch just mad with the Clinton County fire jackets stepped out of the ambulance deputies say after a brief case Larry ... identified himself as a fireman and training he's now in police custody an unlikely to be considered for position by the fire case she'll Castro deli recipe\nAnd overnight Marta emergency exercise sector and about thirty minutes a go at the dome station the emergency readiness exercise featured explosions smoke can actors all to hell Marta get ready for a Super Bowl fifty three February third in Mercedes Benz stadium\nThat will give us be sports coastal Caroline it'd be Georgia State thirty seven thirty four Kennesaw state beat Charles than solving thirty eight ten and the ... with the hawks Ninety seven eighty five definitely give us the news time for all three\nFor your vote this November could determine whether Washington underscores tour undermines the tumbling tend to\nThe mid term elections every step of\nWent up power index various news not five five hand am seven fifty you asked me what happened to us the sponsors\nListen all next week to the mark Arabs shell for your chance to win tickets to seat Jeff lens E. L. O. friday delight bet\nAt State Farm arena no they're ethnic live shows and a distinct style than blades rocket pop and classical music below has more than twenty top forty hits across the U.S in the u._k. tickets go on sale Monday at ten am ad live nation dot com\nThank you thank you for supporting the sponsors for news not five five AM seven fifty or what do you ask me\nPanic than when I in a line when it brings back a nightmare to nearly eight ...\nHad to endure\nI had to endure where\nWe were constantly creative report predatory kind of [noise]\n... part of my life is finally over I Hope no one will ever have to experience when I when\nI was thinking as the world's second most profitable illegal business Ninety percent of victims are females and the average age of\nA prostitute in the U.S is twelve to fourteen helping these victims is easier than you think wellspring treasures are upscale retail stores selling clothing housewares and furniture to fund treatment education and advocacy programs for sexually abused when\nYou can help today my donating were shopping in one of our four locations in Duluth Kennesaw highlands and Peachtree city wellspring\nLetting fighting sexual abuse Mac and boy patient ... thousand one while spring letting dot org for more information\nPlay W. H. B. news weather and traffic in a flash going his skills and your Amazon a lesson and search WSBIU radio and unable to last bring the news not by by and am seven fifty W. S. B. to nominate\nFour oh five in the gory carrier W. B. twenty four hour ... can live in ws became came right wing blog I twenty east bailed at Turner Hill road exit Seventy five just adapting to break through the area travel advisory continues in Cobb County\nReward Seventy five north down from ... to sixty up to north beer to park wakes up to sixty five only two left lanes getting by in Utah we forty one at an alternate\nAnd checking the Dell Dell connector Seventy five eighty five north and south battle between seventeenth street twenty running speed limit rides this report rush to buy a belt dot org a girl and can your dreams of becoming a doctor an elder in Guatemala dreams being part of the community retail and change their world you know change your owed a bell dot org I'm Mike shields ws be\nThere all just reading it sunshine today and high up Seventy one will stay sunny tomorrow low fifty high Seventy\n[noise]\nDina show [noise] honestly I just love listening to your show makes me feel so in fact that's what I'm Talking about if it's going on in the news ... views on it made him his barebones straight no chaser limiting\nYourself that everybody else's life to save your life enjoy the fruits of your labor unions for what you got to deal with it you can use of the day's seriously but not much else\nI hear your patients ... the Daily Show [laughter]\nThese are set in FBI cuss the\nCharge with five federal crimes interstate transportation of an explosive illegal mailing of explosives threats versus former presidents and certain others threatening interstate communications and assaulting current and former federal officers that's five federal crimes right now facing up to fifty eight years in prison your\nDepartment of justice press conference going on right now Christopher Wray FBI Director answering questions\nI think yesterday um we were starting to receive information over the course of the last twenty four thirty six hours it was known\nYesterday that fault are yes a question\n... and the pressure you describe your reaction to what\nThat also could you give us a wad\nFor\nFor\nSoul of the first part of my reaction to hearing that we had a possible match or\nJust validated my unbelievable faith and confidence in the mental image of law enforcement and in particular of the FBI lab there's a reason why the FBI's lab is known as one of the very best in the world and the folks who worked there are extraordinary and once I knew that they had a print\nI was pretty confident that we'd be able to find the right person as far as the the devices themselves a it's important to say as as is in the complaint\nOr that even the devices and we're still trying to determine whether or not uh they were functional as they say is what we're doing all kinds of analysis on that to make a definitive determination but they did contain energetic material\nOr which if subjected to the right combination of heat or shocker friction or could be dangerous to the public and the public should treat any device like that of course\nYes how could you tell us plainly why was he targeting Democrats [noise] I don't\nKnow and then uh what you might uh normally expect a a mayor met apart it appears to be a partisan but that would be a determined by the facts as the case\nThey're constantly on the shop floor and they'd been bugging me at home to support the union but I just don't think we need a union around here now that you mentioned that I heard about a similar union drivers that factory down the road union officials actually agreed to block a pay raise in order to get the company to help them\nRead the block a pay raise in order to get the company to help to recruit new members\nI fought our state's right to work law walk the union officials from require enough to join for pay dues to a union\nAnyway that's true but union officials can still keep us from ... new climate terms if the unions voted in\nI just feel like we should be the ones that get to choose whether to unionize not the company for union officials what can we do\nThe national right to work legal defense foundation can help to learn about your rights or ask for free legal aid contact the foundation toll free at one eight hundred three three sixty three six zero zero or go on line to W. W. W. dot bike to work dot ORG\nParalyzed veterans of America national service officers\nWere seen war they're going to need more ... than the advocates paralyzed veterans of America is here to how we're going to make sure that the Veterans Affairs gives them everything that they're entitled to\nGet all the health care they need making a person's house adaptable for them to go back home and rent education benefits and less focused on getting them a job and if something happens to the veterans and you know where the spouses advocate we help our veterans for free the way that paralyzed veterans of America does that\nNational service officer down located throughout the United states\nWork is important because people depend on us\nAnd they know when they come to paralyze residence America they going to get the right answer and they know that we're there for them twenty four so because we are\nChanging lives building futures that's paralyzed veterans of America to learn more visit PVA got or [noise] or a public service message from paralyzed veterans of America and of\nCourse it gets right against the Haiti gator thought\nThat was really neat and\nNow the dogs are one went away from an F. E. V. E. title we brought in Seattle do us be is the soundtrack of Georgia football with the voice of the dogs got our own we recovered and exclusive analysis from UGA all American Eric dire\nThat's why you come to Georgia they have opportunities and shop like this is Georgia Kentucky Saturday tailgate show eleven thirty kick off three thirty in the home of the dogs don't you asked me\nSteven this this music might be provocative and insightful\nI think we need to how the kids say slow the rule\nAnd when you to minors yes\nMy name's Nate showman Boise idaho filling in for Dana you're on the Daily Show and it occurred to me that\nSome of you who may be listening to this program the on the edge\nI Do not want the words that come out of my mouth nor the callers mouth to incite you violence in any way so\nWe are now going to be just like the\nWorld events and does that go on around us is they want us to change the way we speak to maybe we should have been trying\nFor only for one segment aid for for three or four day and I have four four three or four four thirty to sixty two [noise]\nLet's go to John in Indiana John you're on the during the show go ahead you\nCan actually make great show as always God Bless you and you're\nJust a job again John ... no I\nBetween twenty four hour traffic center ... during the great barrier WMA twenty four hour traffic dinner red alert begged him Cherokee\nCounty Seventy five door down at highway Ninety to look at a lively W ESP James Campbell looks like a vehicle fire and the fire's been put out now it's on the right shoulder all danger block right now seeing heavy delays stack up you say wait forty one as an alternate once again all they shut down red alert in effect\nIn Cherokee county Seventy five north down at highway Ninety two acted to Seventy seven all linked to block tried to Utah we forty one as an alternate Mike shields W. S. B.\nRight Nate we can we can change things I don't believe we can stop it's just crazy but you know a lot of this change starts in our whole teaching our children our grandchildren what is an insult except to all the other thing that I think we should really work on changing AS number one\nIs the way these things like this are handled something like this should be locked up for a long time but the biggest thing that could really bring about a whole lot of change completely changes country around\nWell a lot of change completely changes country around as bring back that good old fashioned concept of personal responsibility\nAnd that's just much his grandmother and I'm going to go back and try to chill out a little bit more [laughter]\nI ... I also must say that I don't know if you're meant to do this or or not but it's a shame somebody who to talk\nAbout what goes on in the home when we're talking about a fifty six year old would just been kicked out of his home by his parents not too long ago who's is what\nDoes he really been living in a van down by the river has been living in a damn van that\nSorry I didn't\nMean to me but he's been living in a van\nEven his own family thought he may have been a little guano crazy interesting [noise] so maybe maybe John maybe we should take pity on these people maybe again maybe we should reserve ourselves for the sake of those who may be\nOn the edge who may be mentally\nOn the edge I have time off from Michael in Indiana Michael your on the Danish show Michael again please only there and there's only five percent and again that's way too much energy Michael I'm going to need you to dial that back your other ten I Need to take you to about it to Michael can you can you do that for me\nI I guess so I can also\nReckon okay well we'll go with it go ahead go ahead Mike I ... I Can't do it I didn't even I tried to get the what I tried to make it four minutes that I make it far out of it are they\nFree basically inquire you lose on NPR what are they doing I don't do that for hours on end I Would lose my mind people are going to be driving into ditches listening to talk like Michael is the man I I I I I I travel\nAll over your phone call can you hold on for me you can you hold on just a little bit but I don't want to rush you All right cool I got to do a quick five year\nIt's time for data is quick five [noise] and you know what Mike what five is going to be pretty simple it's the five federal charges [noise] that [noise]\nCaesar say it was being charged with interstate transportation explosive illegal mailing of explosives threats versus former presidents uncertain others threatening interstate communications and assaulting current\nAnd former federal officers those five federal crimes Jesus air [noise]\nGood face up to fifty eight years in prison [noise]\nNice charge the has been found guilty [noise]\nHis van that was taken into custody he's apparently been living in that van [noise]\nFor a period of time because his own family apparently didn't want 'em around [noise]\nMaybe they saw something [noise] maybe they knew something he has a history about him this isn't the first time his name an explosive device of ever been used in fact it's part of his history he also has a drug charges as well [noise]\nBorn in New York a resident of Florida which means I I have a feeling we'll be talking more about Caesar when it comes to Florida Man will try to find them funny dumb people but there's nothing funny about this guy at all [noise]\nAnd during the FBI press coverage during the department of justice press conference people want to blame the rhetoric for pushing this guy over the edge when it sounds like he was crazy to begin with\nSo why is this my fault why is the president's fault why is this the media's fault this isn't even your fault folks\nThis guy if he did it this guy\nNeeds to be held responsible we need to read this and other people like this guy out [noise]\nWe'd we'd amount otherwise we need to read them out of a left [noise] my name's they sell in Philly Dana on the Daily Show\nHave you ever taken your car in for an oil change your mechanic find something wrong and surprise your hit with a huge repair belt and what happens when you're not covered by the manufacturers warranty you're paying out of your own pocket to fix that\nThis is why I recommend extended vehicle protection from car shield if your car has five thousand to one hundred and fifty thousand miles ... can save you from paying for high repair bills\nReplacing your engine or even a simple sensor can cost thousands when you're protected by car shield you can have your favorite mechanic or the dealership fix your car it's your choice car shield also provides twenty four seven roadside assistance in a rental car wild yours is being fixed for free\n... years what usually I yeah if they would just agree with Trump no Michael I'm going to tell you what you if they were just agree with Trump people wouldn't be crazy like this guy which I'm\nNot I'm not saying that I'm just saying if they get on the same\nThat you just said\nYeah well I mean with a with everything that's going on I mean I Know everybody's going to be going to the point of you know not everybody's going to agree on everything but I mean\nThat's why I left and the right should be\nOn everything but I mean that's why I left and the right should be should be getting a law there for everybody else out there that they represent me\nNo no no my my goal I disagree with you I respectfully glove brother I Love you disagree with you and here's why I'll tell you I appreciate the call or you don't get along just to pacify the masses\n\nBecause then you're hypersensitive to every stupid threat that's out there and we don't bow to every stupid threat that's out there\nWell if if we don't do this that people are going to be angry and we don't want the people angry so I guess we should provide everything to everyone because they might get angry we don't want them to be angry that's how government got to the size of a God\nBecause they keep providing to everybody because they don't want to make them angry they want to make them feel good\n\nThat's how we got to where we are don't get along argue debate\n\nAnd they'll say well the left did you know the life would just agree with jumped they wouldn't have a guy out there that have left\nWing people and wants to send them ...\nNo\n\nWe shouldn't change the\nDemocrats in Congress if they want to call people to harass somebody ah I I guess if I have to compare the two I'd rather that I'd rather than Maxine Waters of the world do that because I don't hear anybody saying you know we ought to do we ought to send people explosive\nThings in the mail and just and then and damage them physically\nNo well absolutely nobody is saying that\n\nAid for for three four four Dana aid for for three four four thirty to sixty two Jeff Indiana you're on the Danish she'll go ahead\n[noise] why they're using my best and your ... year\nOld oh you're you're you're going a little base with the job I did I you you might be you might be just a little bit I think even if you called NPR with that amazing baritone voice you probably scare everybody at ... this guy well it was going on there's got to be by business\nThe water's deep Jeff go ahead [laughter]\nAnyway to get to the discussion today number long I don't remember the media outraged flavor public that's we're receiving rice and all of that actually put people in the hospital\nAnd you know we did have a guy that's\nYou know why do outrageously no fear yes yeah there was an outrage but there was fear I remember where\nWhy do you remember everybody blaming uh\nWhoever was president at the time\nFrom what was going on [noise] okay see and that's the whole thing with a faint stream media they're such a joke I mean it's just ridiculous and the thing is this guy has to be the worst bomb maker in the world I don't agree with what you get paid off by it they didn't go off\nBecause that would have just given given more anti nation but still it's gotten out of hand on both sides it really have if I were just talking about Maxine Waters yeah OK rather have them do that but people have been physically attacked in the street\nNot just run out of a restaurant but somebody some pro life on the other day was actually attacked physically attacked salt\nSo it's just it's getting outrageous on both sides and I agree if you got a difference with somebody you need to provide an argument that's going to\nWin the case ... start getting violet or encourage violence or encourage anybody to be told that they they're not want it if they don't fall\nThis go upsets me back to substance but beep beep passionate passionate Jeff do not lose your passion at all ... all about me away and already and here's the thing\nIs is Alison define us this is even the majority rule is an even one percent of the population\nWell this is this is the smallest version of who we are as a country because most most everybody else they they're they're asking each other hey who you're picking Red Sox are Dodgers\nHey wow well yeah well you know they're they're they're watching they're watching football there there is there is is ah is the price of gas going down what's that that's it that's where most everybody is yeah you're here\nThat John anyway on here like I said I don't know what to do that that\nIs ridiculous the media's plate is I haven't seen anything else\nThis is ridiculous media is what it is I haven't seen anything else all the news for days there act like nothing else is what you're saying but they have no other life and it just made them if they can this all the pros\nSo it's really neat to act like this was something what this guy\nAnd he's he's got his rhetoric so a little extreme about it but he says what do you think about it\nAnd people are that are used all efficient way at all the answers so everybody happy he's just saying that what you're always thought they were term limits for all these people booed at Maxine Waters\nAs far as I Know I don't think she lives in a district that represents California and she lives in ... million dollar ...\nI mean come on how are these people getting this rich or a hundred and Seventy a hundred and eighty thousand dollar salary\nYeah but am I going to blame or am I going to blame the people that keep voting Rebecca and and and the thing is as much as ... as much as I Would love to control what everybody else does I I Am a very good argument against term limits okay here's the thing is is we want to tell everybody else who they can and can't elect\nRight because we don't want to go you know there are people you know no no no ... well I I thought oh I'll I'll go I'll go I'll do just as far here\nAnd I I have other things\nI Want to do in my Dave until somebody else who they should and should not vote for in a district where I don't live\nThat that's all that's all I don't live there if they want to elect a moron going on like the more of a I I Wonder if the bunny ranch guy is going to win this off Nevada you might know him from the HBO thing he did he might actually won the election\nSo I'd love to tell people who they can to get the thing is is I don't want to be a king man I I don't I got other things to do your Halloween parties this weekend I I don't want to play on a kingdom\nSo if you want to look the same person Thirty years in a row that cell phone my name's Nate showman I got one more one more thing of recalls aid for for three four four Dana filling it out of Boise idaho this is the Danish show\nI'm a huge fan of my pillow not only has this product change how good I sleep ... during a time when some companies are running away from conservative radio my pillow is putting their support alongside programs like this one\nBut the big plus is that they're my pillow is truly the only pillow that I Will ever use again slipping on my pillow has alleviated any sort of upper back\nIssues in the neck issues and I sleep better than I ever had before there is not a better product on the market and right now you can get your very on my pillows buy one get one free all eight hundred nine for for for nine seven five\nOr visit my pillow dot com and use personal code Dana to get to my pillows for the price of one get a better night's rest with the world's most comfortable pillow that's my pillow dot com promote Dana were called eight hundred\nNine for for for nine seven five my pillow is changing the way people sleep\nFor ever called eight hundred nine for for for nine seven five eight hundred nine for for for nine seven five or visit my pillow dot com and used promoted Dana\nOutdoor limited as your one spot stop for all your ammunition needs outdoor limited dot com has one of the largest stocking inventory selections of the best run fire hand gun am rifle ammunition every item listed in stock on their website is on hand at their warehouse no third party drop shipping and no back worse\nFeaturing great brands from federal ammunition like federal premium ... an American eagle outdoor limited as a family\nOwned business this husband and wife team started the company in their garage four\nYears ago and they believe in selling good products at a fair price they carry not just ana but also kids ... such as magazines cleaning supplies and targets outdoor limited is my personal go to for all of my ammunition and shooting needs great prices\nFast shipping visit outdoor limited dot com right now receive five dollars off your first purchase of one hundred dollars or more with code Dana\nCheck out their great prices that outdoor limited dot com and use promoted Dana that outdoor limited dot com\nGet WSBIU news weather in traffic flash briefing on\nYour Amazon device on your Amazon to let that go into skills and search tells us be radio now you can enable your flash briefing to deliver news Ninety five five and am seven fifty WSBIU depending on what you\nAsk me about ... er Cox media group station [noise]\nTwenty four hour news weather and traffic\nFive and a um seven fifty\nFor me to\nNo good morning it's\nFive o'clock I'm Robin ... live in the ws be twenty four hour news center with our top stories this hour\nI have and it's up to be twenty four hour news center with our top stories this hour President Trump calls the shooting at a synagogue in Pittsburgh and evil anti Semitic act and orders flags at federal buildings to be flown at half staff\nEleven people shot and killed six hurt as a gun and goes into the temple says all Jews must die\nAnd start shooting Robert Bauer is facing twenty nine federal crimes now the first victim has been identified this morning his name Daniel Stern Seventy years old and new grandfather who was at the synagogue praying alone sports the dog's beat the gators thirty six Seventeen coach Kirby Smart telling us ...\nWe talked about earning this victory they would not be ... or just out we would not get it this way to earn it then the\nNext step the dogs like Kentucky Saturday the winner will head to the FCC championship game\nAt the world series the red Sox beat the Dodgers nine six and two tickets hit the seven hundred and fifty million dollar Powerball jackpot one ticket fought in central Iowa\nThe other in New York City the jackpot the fourth largest in us history now to check for smaller prices here are the winning number's eight twelve Thirteen Nineteen twenty seven and Powerball number four\nWSBIU news time five oh one [noise]\nTo check on traffic here is like shale drought visor and effect and Fulton County WBAI down on the central avenue I could to thirty nine four left\nLanes wide due to crash land delays in the area on the ws be jammed camp this report brought by ... dot org a girl and can your dreams of becoming a doctor an elder in Guatemala dreams being part of the community reach out and change their world and it'll change erode at ... dot org I'm Mike shields WSBIU\nJobs rabbit sunshine today and high of Seventy one will stay Sunday tomorrow low fifty high seventies and right now forty\nSeven degrees at five o two with news on the hour and a half and when it breaks I'm Robyn landscape added line is exclusive twenty four hour news weather and traffic station and it was five and seven fifty W s may depend on it\nThe following program is paid for by Chris Burns investors financial\nDon't waste this week we just saw a dress rehearsal of water market correction would look\nLike and it could be the best thing that ever happened to you hey this is Chris Burns welcome to more than money hey we're going to dig into that today normally I give you multiple topics we're going to have all these discussion points today we're going to focus on one thing and that so we just saw\nA dress rehearsal for what a stock market correction would be we saw six days of the market dropping it showed you wear your portfolio at\nIt showed you may be a little bit how you respond when the market is dropping it certainly showed you how the media will respond how politicians will respond and you'd get a taste for that and that's such a gift because now you have a moment in time now you can actually make an adjustment if you need to\nFriday the market corrected the market came back and correct is not the right word here the market stabilized and get wasn't some massive game but it stabilized we don't know where it's going next week we don't know Monday Tuesday Wednesday with the market will look like what I tell you what\nIf we come out of this okay without any more drops in the market if the market just keeps going up it would be a terrible loss for you to just go who dodged the bullet\nYes I'm OK because you have an opportunity now you have an opportunity to react\nTo to adjust what is needed to make sure you're going to be okay for the future that is unbelievable gift\nAnd we don't want a wasted so I'm going to dig into that today as you listen to the show remember one thing the next hour is about you this show is not just about discussing the dynamics of a market dropped or what's going on or why it was caused those things matter will will will dip into that but the point is we talk about these things because we want to know how they filtered down\nTo your specific situation because if it doesn't matter to you practically if what we talk about this and make an impact on you it was a waste okay that's the point of this show more than money is about how you make real traction towards your dreams for the future so as you listen if you have questions today\nJump on my website it's my life is more dot com and you can ask anything there I Hope there's things today we talk about that hit your specific situation\nThere are things that maybe you think about when you're by yourself and your mind starts wandering things you worried about that keep you up at night things you're excited about dreams you have if you wonder how we're talking about impacts those things\nJump on my website you can ask and I will get back to your team will get back to your we answer a lot of those questions on the show in our lightning round we're going to have that later in the show where I answer the questions that regular listeners have sent in to take advantage of that resource\nAnd while you're on the Web site in my life is more dot com you can also you can listen to past shows you can sign up to receive the daily update that we put out one of my favorite things we do every day on multiple radio stations around Atlanta\nA W speeding point five Ninety seven point one of the river all these stations play or a daily update which is a one minute synopsis of whatever the most important\nPiece of news was that day and more importantly what it means for you so that's the goal every day and the update when I'm writing it\nAnd if you're not listening to the radio 'cause you have better things to do or you're working or whatever it is or not\nNot listening to the radio 'cause you have better things to do or you're working or whatever it is you're not in the car or in the morning and afternoon that place you can get that affected the website we send it to via email every single day it's one of the ... the best things I think that we do\nUm because it's again it's so concise that we don't spaniel just singer that one at that every day you can get that on the website my life is more dot com you can also sign up for a free consultation to have a conversation a discussion with me Chris Burns with someone from my team about your situation so maybe you ask a question\nBut maybe you want to have a long conversation about that we offer a free consultation to anyone who wants to do so again we are going to dig deep into what we just experienced the last number of days I Want you to have practical practical action items you can take their whether it's asking question having a conversation please utilize that resource it's there for you again my life is more\nDot com so what do we see I Want to write this up in a few things first of all\nI Want to talk a little bit about what happened and just step back and look at what happened then again we still in process here you know for all we know the market is going to keep going down next week no one knows\nBut certainly we had a breather on friday where it came back up a stabilized and so some of the fears some of the anxiety has reduced for a lot of folks and you might be listening right now going had zero fear\nHas zero I didn't even notice that was talking with somebody or Thursday after the worst of this after days of six days straight by Thursday of the market dropping and he was like it's going to I had no idea that that's the reality is some people listening to the show you're\nJust like it because of my wonderful voice you just excited to be hearing me talk I guess for a while you don't care about finances too much you don't care about the market too much when you care about it but you're not looking at it regularly and so you missed the whole thing that's fine the show is still for you because there's still something really practical you can do right now today\nTo see where you're at based on what's happened the last few days I'll talk about that in a second but somebody you were watching this like ... some of your close to retirement\nAnd you were watching every day going oh no this is what we've been worried about this is what we saw coming this is it ... and boy financial media only fuel that right if you if you happen to be unfortunate enough\nTo regularly be looking at financial media you know you're reading a newspapers and the finance section you're watching a CNBC et cetera\nUm CNBC anyway I'm losing it um\nThen you would have had a lot more anxiety because whenever the market starts to drop we notice a trend in one of the first things that happens\nIs media makes it the worst right media is going to point towards is this the end of the bull market is everything going downhill to be only to scream and run for the hills and there's exceptions to that there's some great folks doing media they're not that way but that's that's the norm\nOkay and so I'm\nOf whether you watch this every day you didn't notice it at all or it was an amazing dress rehearsal because it showed us exactly what's going to happen so we're going to dig into first what did happen how did that work\nUm in why does that matter to you and then I Want to get super practical and talk about what can we learn from this there are I truly think this experience can be one of the best things that ever happened to you and I really mean that\nThe folks here that and go and you're just you know he said that every week no I really don't like\nThe market dropping this last week because of the current climate were in because of where the stock market is that right now could be could literally changed the course of your future if you understand how to utilize that and leverage that okay so we're going to this is why this is so important to me is the first of all what happened All right so\nThe market started dropping a over a week ago Thursday of the prior week okay so what does that seven eight nine days ago uh\nThe market begins to drop okay and initially when it drops there's an easy explanation for that bond yields were up that day and so the market starts to drop\n'em and no one really too concerned about it and usually in the first two days of the market dropping people kind of shrug it off it's not that big of a deal we can get a basic explanation everything's okay but once you hit day three\nI've noticed that's when there's a turning point if we have three states straight days have continued market draws people start going what's going on\nThat cause effect can be very dangerous because it turns from we look historically at what's happened we create a cause effect relationship and then we apply that to the future and now that influences the way we think about future investment decisions in them that is going to kill you that is going to destroy your long term investments that is the first thing to see here\nIs that there was no\nEasy root cause for what happened last week there was a whole lot of little things and then a whole lot of group change in group mob mentality and suddenly we saw the market dropping in anyone's going to try to eat offer an easy explanation for that\nHas an agenda and\nOffense to either side the the the Trump folk saying it was a fad or anti Trump folks saying it was China\nA trade war both of them are just trying to find an easy explanation when that's just not reality it's just not reality and some of you were unhappy hearing that because I'm offending you politically because either way that's going to offend someone politically Rikers both sides are\nBecause of either way that's going to offend someone politically right because both sides are mentioned here here's a deal this is not political okay but the market dropping\nIs not usually a political thing certainly government economic decisions influence the mark and I'm not saying that\nI thought I Am saying is that it's not as clean as just oh this person made this decision so there was a ... you know what the market is a political the market dropped for all sorts of reasons let's not turn it into a political thing and leverage it as a political weapon to hit our friends with\nThe reality is we need to learn from this because we don't know what's going to happen in the market please don't look at\nCurrent policy and assume you can decipher what the market's going to do next\nBecause if you can decipher again what it did in the past and have a nice clean ... explanation that this is why it dropped you're going to try to do the same thing and apply that to the future and my friend you're going to fail\nBecause again a month ago we knew about the trade war with China\nMonth ago we knew about interest rates continue to go up and nobody was saying a month ago oh well that's going to lead to this exact thing in fact a month ago we all the economists are saying it's great that we're raising interest rates\nAnd the moment the marketing means of drop oh holy cow or raising interest rates right that's nonsense you got to get off that treadmill so let's move on to something super practical here and that's how do you respond to this the first step of that is how how did your portfolio do here\nAnd this is where we get into what I I actually care about okay what I care about is that if this was a test run this was a dress rehearsal of what would happen at the market dropped them all you have to do is look at your portfolio to see how big of an impact that this half\nAnd here's what I Want you to do you can go on line and you can look at how much the U.S will be five hundred dropped okay how much did it drop us just full on a hundred percent American stock or look at the Dow Jones whatever and compare that to how your portfolio dropped\nAnd then you get a feel for when the market drops what does my portfolio do and some of you listening again right now say I I ... I didn't even notice the market was dropping I don't care look still take a minute today later today when you're not exhausted jump on your four one K. website your IRA whatever it is\nAnd just glance at an how's it doing\nHow much did it losing the last few days\nBecause you need to understand what what happened in my portfolio\nIf we had a full on correction okay at the market had kept going and we don't know my next week we have no idea but at the market keeps dropping if it goes down what happens to my portfolio because so many people listening right now have no clue the level of risk they are taking\nAnd I don't say that in a judgmental way it's a fact and meet with people every single day I sit down and hear their stories intelligent people people that have degrees people that are\nThat no way more than I Do about a range of different things in the world and yet when we look at their portfolios they have no idea the risk they're taking in fact many of them many of you right now would tell me I have hardly any risk in my portfolio it's super safe\nI'm pretty darn conservative\nAnd in reality you're incredibly aggressive because your definition of conservative is oh I only invested in big strong companies guess what big strong companies when the market drops they dropped just as hard\nIt doesn't mean you're not aggressive because you invested in you know coke and Home Depot instead of in penny stocks and in bitcoin\nIs Ninety percent of your portfolio is in stock even if it's a great large companies guess what friend your super aggressive and you need to know that because it has a real tangible practical impact on your dreams on your ability to retire\nOkay and so if you go I have no idea how to tell that well here's how you can tell\nIf you go onto your four one K. and it's dropping as much as the market is dropping overall then that means you have a pretty heavy stock allocation and you can see that when you look at your statement because most statements will tell you the percentage of your money that's in equities\nNow there is a difference in aggressiveness between bitcoin for instance bitcoin turned ten last week something about ... coin turned ten years old you are for bitcoin down sixty plus percent from last year\nBut it it it it there's a difference in aggressiveness between owning again Home Depot stock in bitcoin\nAnd yet both are still considered aggressive they're just different levels of aggressive\nOkay so when you look at your statement just look for a minute at the percentage of equities you're carrying drop all your conceptions of risk and look at that percentage that percentage is like a ... okay if you've got sixty percent of your money fifty percent of your money inequities\nYou're humming along but you're not doing overly fast but an eighty Ninety percent of your money is an equities you have an aggressive portfolio that's not a bad thing but you need to know that because it could be bad for you\nIt's not bad in general it could be terrible for you and you got to understand it and if you don't and here's the problem that a lot of people\nFor you and you've got to understand it and if you don't and here's the problem that a lot of people don't just have one investment account I\nCan't tell you I was meeting with folks a at a company recently I was doing four one K. training for a company that came in to talk about how did you use your four one K.\nHow do you maximize the effectiveness within the investments you have what does this look like those kind of training employees how to do that\nAnd so many people in that room when I started asking them about it had multiple for one case they moved jobs for times they had three old four one K. sitting out they had an IRA sitting out they had maybe an inheritance from a grandparent at all these different accounts spread out well guess what happens when you have six different investment accounts between you and your wife\nIs what happens you lose any sense of how much risk you're taking because\nUnless you or some sort of a genius you don't remember exactly how you invested\nFifteen Years ago with an old company but if you never moved your money out it's probably still invested that way so looking at your four one K. is helpful today it's the first step look at your current investments because you can see\nHow are they doing but what if you have six different accounts and they're all invested differently what if your current four one K. or for three B.\nIs invested pretty conservatively but if I go back to the old ones are super aggressive that means you might be taking a lot more risk than you realize how many of you right now\nHave no clue how much risk you're taking spread across all those different that's it that's where you're sitting right now\nI'm going to pause on this because we come back in the minute I Want to talk about what this means if you're closer to retirement\nVersus if you are right now a younger person because there's two very different responses last week really matters to both of you but if you're someone right now that goes I I really don't know the level of risk taking friends this is the time to figure that out\nBecause when the market drops if you go into your four one K. and you see a loss there\nAnd you start going into other accounts and you see different varying losses one of your accounts dropped three percent in the last week another one dropped eight percent and\nYou go holy cow that means you have a risk spread across all different levels you need to know what that is it really matters for your success and that's what we do with our clients\nSomething that they most of them have never done before we take all of their statements everything from the tiny Roth IRA you started ten years ago because you're an said it was a good idea all the way the four one K. you left a few months ago and now you have a new one and we input all of those investments into one program and tell you from that exactly\nHow much risk you're taking\nSo you can know wow\nI'm actually an aggressive portfolio I had no idea 'cause I I turned it down in my current four one K. but I never changed any of the old ones I'm sitting on an aggressive portfolio and I'm five years from retirement and at the market drop\nI could seriously lose some funds here it could hurt my long term plan\nMany if you have no clue the risk you're actually taking 'cause it's spread out so that is something I Do with people every day we sit and do analysis and are able to tell you this is the risk you're taking and again it's not a good or a bad in general do something wrong with taking a lot of risk\nWhere it's not good is when your plan can't handle it\nSo we can define that clearly objectively for you\nAnd then you know then what action items you need to take which is what we're going to talk about them and how do you respond and what do you do but the first thing is understanding how much risk are you taking how did your portfolio respond in the last week so jump on their check it out if you haven't looked at it look at it how much did you lose\nAnd if you don't know or you go I don't know how to tell but it's not being spread across all these different accounts will call us that's what we do jump on my website it's my life is more dot com\nDon't waste this opportunity to know how your portfolio response to risk because the next time when it's not just a few days if it's a full correction you need to be ready for that that is your future\nSew could they afford to be a little more aggressive if they wanted to be sure\nBecause they just really don't need those investments in less than a worst case scenario they can afford to have a little more questions but if you have to if you're the majority of people today and most people listening\nThat are close to retirement or in this boat if you uh plan on having to draw from your investments in order to have income which is the norm okay then you really probably don't have any business\nBeing aggressive as you get this close to retirement the five years prior to retirement\nAnd that was it was far too moderate I said you really probably no let me take away the moderating words you shouldn't be that aggressive\nIf you have to take income from your investments and you're within five years of retirement you really have no business being invested aggressively\nAnd I would put that has really anywhere above about sixty five Seventy percent equities as you don't have business to be there\nNow there are exceptions like I mentioned like my grandparents most people don't have the business to be there but here's the problem\nWe don't realize that because we've been sitting on years and years and years of the market going up now it's snuck up on us\nOkay so you need to understand the risk and if you're close to retirement\nNeed to understand the risk and if you're close to retirement even if you feel aggressive okay even if you're fine with going after it and you're fine with them to market going down and he didn't even notice\nLast week what was going on I really don't care if you're close to retirement that you personally feel fine with risk I care about what happens to your plan if the market drops I mean I'll be nice about it\nBecomes sit down and I'll listen I'll understand why you like aggressiveness but I'm going to tell it to you straight that if you lose twenty or thirty percent\nIt could wreck your plan even if you're fine with it and that's not okay\nSo you need please don't waste the last few days see the level of risk you're taking in like I said before the break if you're someone who just I just I just don't know 'cause I have so many accounts spread out or I don't know because I never even look at that state and I really don't know how to decipher the risk taking\nIs where I strongly recommend come and sit down with me sit down or sit down with a plan or that you know and care and trust whatever you need to sit down with somebody to understand in full context how much risk you're taking and what impact that will have on your future\nAnd if you've never done that because a you didn't even think about it you didn't notice you don't care even looked whatever the reason is okay now is the time to do that and there's there's real objective analysis we can do especially based on the droplet just had to tell you where you're at\nAnd that changes the whole picture of our time is if you're close to retirement\nStop everything and make sure you adjusted your risk here's the danger again the danger is that\nNot only have we been sitting on a market that has been up we've been sitting on interest rates that have been down so a lot of people closer to retirement who in the past would have been fined going into low risk fixed investments\nThat years ago paid pretty well like bonds like CDs that back in the eighties you get double digit returns on your CDs right today interest rates being so low fixed money is just not paying nearly as much that's beginning to change his interest rates increase\nBut it's still not much based on historical context and so a lot of people have said you know what I'm not getting any return on these bombs were not just shift more money into stocks because those are getting great returns and without even realizing it the risk has been going up and up and up\nSo many people I sit down with I Will never forget a gentleman who came in with his wife I asked them how aggressive they were they said we're not very aggressive or moderate investors and when we did all the analysis was able to tell them though you are quite aggressive and you didn't even\nKnow it often is just we don't even know but that doesn't help\nUs if the market dropped so if if you're close to retirement this is a perfect time to look at that and again if you want that analysis that's what we do with every client that comes in you can go to my website it's my life is more dot com sign up for a free consultation\nWith me Chris Burns or with someone from my team to look at the details of your situation and give your thoughts on this again\nIt's my life is more dot com and I would truly say there is no better time than after the market drops because after the market drops especially especially this is a golden window if it drops but it stabilizes which we don't know next week when it's going to do let's assume it stabilizes\nThen we have this incredible learning experience from the drop without the pain are they true correction and now's the time to make sure your position to do well regardless of what the market does you don't need to risk that kind of loss\nYou need to make sure that your plan is built to handle the next correction we face because it'll happen it will happen All right let's talk about young people for for a little bit here if you're younger and and and and folks that are close to retirement don't to me out here if you have children or grandchildren this is critical maybe they'll listen to you if you talk about this stuff okay\nIf you're younger I'm Amazed by the number of young people that when the market dips like this\nThey go super conservative\nOften even more than folks that are close to retirement because they they they they know how much it's up there is someone I work with um she faithfully puts money into a Roth IRA that that market drops and she sees that balance drop even though she's not planning on touching the money\nFor decades for decades it's still a huge blow because it was a lot of money for her\nPeople forget it you know obviously anytime you're saving a lot of money\nOr or saving for the future it's often a sacrifice to save but young people and I mean twenties thirties forties\nWhen you have a family when you don't have much extra you have to make values decisions you have to decide are we going to go on vacation or we're going to say if it's really hard and you know that you're in a minute I've got three kids we have to make those kinds of decisions regularly and it takes sacrifice to choose to save\nRight and you have a balance but it's not easy\nAnd so I get it when the market goes down if you had the truly ...\nAnd so I get it when the market goes down if you had to truly sacrifice to put those dollars away\nI don't want to downplay that you know if you're twenty five clients\nA few clients in their early twenties and it's incredible to watch them choose to invest money and all their friends are going out and doing other stuff\nThey choose to save money for the future but if you know the value of that and you've been sacrificing to do it and laboring away and suddenly you see the market drop and you see you know you put in this much money and it's nice that now that is overwhelming and a lot of people go super conservative a lot of young people\nAnd I would just say you've got to change your mindset on investing because this drop in the market is good for you to test your emotions\nAnd getting that there's two sides to this right\nSide one is how do you feel about risk in the second thing we just talked about how does your plan handle risk when we talk about how you feel about risk\nUm it matters a lot more for young people actually\nHit because young people they're planned the second part of this plant can handle risk look if you're Thirty Years' old right now or forty years old can your plan handle if you're four one K. loses a bunch of money sure even in two thousand eight in a terrible scenario where the market dropped\nForty percent for aggressive investors forty percent drop if you're thirty five years old is your forty years old right now in the market drops by forty percent\nLet me tell you something your plan can handle it in fact not only that\nYour plan will benefit from it because holy cow friends that forty year old listen to me if you were forty in two thousand seven eleven years ago in two thousand eight market dropped forty percent\nOkay where are you sitting now if you were able to if you're again taking your emotion out of it if you stay there and if you kept investing if didn't change anything eleven years later well over three hundred percent growth\nUnbelievable that drop was the best thing ever happened to your portfolio the rebound has made it for you you're on track for retirement because of it\nTalked about this before he did it last week but please don't fall into the trap of thinking a drop in the market is a bad thing it's not a bad thing\nIt just depends on how you respond to it it's the worst thing ever if for all your money out in ... lock in those losses it can ruin your future but if you stayed in it and two thousand eight it could have been the best thing that ever happened to you so your plan can handle the risk but can you and I don't mean that as a challenge\nPeople hear this and go I guess I'm supposed to just be risky I guess I should be okay with it now you're wired a certain way and however you're wired you know whatever your your response to anxiety in the market dropping and how you feel about risk and things like that plays into this and it'd be far better for you to\nReduce some of the risk and be more moderate but stay in the market then to go super aggressive because you hear me talking about it and go on I guess I'm supposed to do that and then you pull everything out that is that is what will kill your portfolio as far rather you'd be moderate in your risk\nBut stay in them be super aggressive 'cause he thinks president and pull out\nHad a great discussion recently with the younger person about this I said look the market's going to death well here we are right last week it does actually called him during the week is remember that discussion we had um\nAnd he is young so he kind of felt like he should be super risk because all his friends said just go after there'll be aggressive but he kind of told me and quiet well none of his friends were listening I just don't feel great about it I'm just I'm a pretty conservative guy I don't know I don't feel great about the market drop by and I said that's great you knowing that is key\nBecause the important thing is that you have two or three decades of savings that you stay in not that you'd be the most aggressive it's just that you get to the end than you've seen growth over time right so he picked a little bit less aggressive portfolio I called them this week and said how we do and\nIf he comes back to you and says we need to move the money soon because there is a dollar tag attached to that for you All right that's all the time we have that they listen if you missed everything else remember this don't waste this week the\nW ... er Cox media group station\n[noise] twenty four hour news weather man from\nFive and am\n\nGood morning at six o'clock I'm Robyn landscape live and there's other us face twenty four hour news center with our top story this hour [laughter]\n\nCNN with a chilling nine one one audio as officers go room to room in the synagogue looking for victims eleven people killed by an\nAnti Semitic gunman in Pittsburgh, Pennsylvania the first person identified as Daniel Stern who was killed Seventy years old or new grandfather the gunmen Robert powers forty six years old walks into the building where there is no security guard and says all Jews must die and then he starts shooting\nThis is the most horrific crime scene I've seen in twenty two years of federal driven\nIs the most horrific crime scene I've seen in twenty two years the Federal Bureau of investigation that special\nAgent in charge Bob Jones leading up young investigation into Saturday's horrific shooting of the tree of life synagogue in the city's peaceful scroll hill neighborhood\nA suspect forty six year old Robert powers who's apparently never been on the radar local law enforcement powers is now charged with twenty nine federal crimes attorney general Jeff Sessions says if convicted powers could face the death penalty becomes ABC News Pittsburgh\nRight now forty seven degrees here in Atlanta sunny today with a high of Seventy one Atlanta's most accurate and dependable forecast coming up at\nThe world series game for\nAs we rise for our nation's colors and I am from which are joined us as we honor the memory of the victims of this morning's tragedy\nThe tree of life synagogue Pittsburgh, Pennsylvania [noise] as our nation grief their loss and for their loved ones we'll switch press are committed to each other to bridge the grief and values tolerance justice dignity formed the foundation of our common bond [noise]\nAnd then after that game goes on the red socks\nOn meet the Dodgers nine six game five tonight at eight Fifteen\nBoston leads a series of three one President Trump calls the shooting at the synagogue in Pittsburgh and evil anti Semitic act in orders flags in federal buildings to be flown at half staff\nAnd make America great again rally in Illinois last night Trump telling the crowd that he considered canceling the rally after the deadly synagogue shooting I don't\nWant to change our life for somebody that's sick [noise]\nAnd evil and I don't think we ever show [noise]\nFirst first this is double you asked me twenty four hour continuing the dog's meeting the\nGators thirty six Seventeen the final score is certainly a lot but did not go right against the gators\nWe got to be able to be physical enough to give a damn yards\nWhat anyone over Florida is a big one especially this year with a crowd of more kids and they deserve this expert be smart after Florida take the lead to start the second half the dog's going or twenty three and a three run to end it led by career high one hundred and four Russian your company ...\nOld line did a great job so just that'd be putting Jake\n... duty basses while UGA was the turnover ... now the dogs could take the SEC with a victory next week I'd get jobs in Jacksonville very black ws\nWSBIU news time six oh three\nTime for track traffic here is Jackie ... morning delays today somebody by north down dumped him north of ... to ... to sixty five just two lanes open that is construction also\nI twenty east down the west freeway at highway sixty one exit twenty four to liberty wrote to left lanes or block or I watch for real work as well George four hundred southbound\nStarting at browns bridge traffic sponsored by mothers against drunk driving drunk driving one hundred percent preventable one hundred percent of the time find out how you can help it M. A. D. D. dot org Jackie lead double the SP\nRabbit\nWith the most accurate and dependable weather forecast after actually start will warm up nicely with a lot of sunshine this afternoon temperatures will tap out around Seventy one degrees overnight and into Monday morning it'll be cool to get down towards the lowest fifty in town some upper forties outside the perimeter that study in a high of Seventy tomorrow on Tuesday will stay sunny low forty eight high Seventy three\nAm right now forty seven degrees it took so for I'm Robin ... is exclusive twenty four hour news weather and traffic station news Ninety five five and am seven fifty W s may depend on it\n[noise]\nIs perspective the show were an examination of our many differences often shows out\nHow much we have in common\nUnconscious Presley and we're delighted to have three very special guests with us\nOn the radio program today because they're going to give you a little taste how do I say a little taste because we tested it before we began our recording today on what you will have an opportunity to experience\nRight here in Atlanta and into kept county October thirtieth through November ... what what are you asking am I talking about\nI Am talking about how the international arts foundation present in celebration of Nelson Mandela's\nOne hundredth birthday Africa\n... means the spirit of togetherness and with us in the studio we have three key players from this remarkable show that will be presented at the quarter Sanford performing arts and community center\nWe have Gregory Gregory is going to tell me his last name because he wrote it down and I still can't pronounce could write Gregory telling me Oh hi my name is ... and my last name has come in\nAnd he is the narrator of the show and then we have with us bright with another last name that I'm Bad 'cause I don't want to put you on the radio right introduced us to yourself I'm running my name is right\nToo much on the on the lead singer and that ...\nThen finally last but certainly never leaves\nAnd then finally last but certainly never leaves a young lady who was the lead singer and they lead dancer in the production her name\nIs beautiful the way it sounds unfortunately I'm going to ... all over trying but I can tell you that her name means lucky introduce yourselves for all of us\nWell my name is non ... followed by the name of the bee and yeah my name means like he so everyone welcome to the program tell us tells a story of Africa ...\nThank you very much and thanks for having us uh Africa majorities is olive can lose cultural buddies celebrating a fellow skin music it through dance and singing\nA forgotten what Joe was started in Nineteen eighty eight as a community outreach project by two ladies are\nNamed ... and Tim beyond any were presented with a ... until the cost of keeping don't be where they put the usa for five years so when they came back from South Africa\nBe found out that most of the kids will remain on the streets and doing nothing cool so then we started this outreach of teaching kids how to sing and dance so we just started like that and then in Nineteen Ninety nine that's when they decided to take it a little ... as in like a production so that's where you started and then two thousand two thousand\nWe had an opportunity to be invited to West End in London where we are supposed to be for\nOnly three weeks 'cause I still remember the headlines were still there there was someone who said a ... making noise so people started coming to the show to listen to this noise and they were like oh this is a very beautiful voice and we love it so we ended up being in on the west end for Eighteen months\nOn London's west and for Eighteen months yeah talk about some views making some noise [laughter] so again a each of you where where where on the continent do what you have\nFrom yes right some kind of get\nA where on the continent are you from\nOh from South Africa in in ... oh lucky I'm from the eastern Cape well I'm from\nSouth Africa ...\nAnd that can you believe that that this is the the one hundred this would be the one hundredth birthday of Nelson Mandela\nUse and all that that you each have been able to see in his in what was his lifetime you must be pretty special to be able to perform in his honor\nIt is it is a ... on a privileged because you know everyone would get some of which leads you to on a human such a way and I must say I'm I'm On a to perform for you personally because oh tell us about that yes the effects on toys in Japan were turning up and so a ... D the friends with a\nLot we call them ... ... ... ... a sign of respect because he's an older so the other friends with a does do a to Z so this was telling ... oh you know turned into the open the through and they are cutting the jump in so that that just said why haven't seen it\nAnd love is thrown into you just said no bringing them back\nSo here we are in Japan just performing backstage and all of a sudden we were told leave everything just take your passwords would go into the airport ... cool\nFrom other us I mean God gave us all those things for us to use what that's what I'm saying we are grateful to the\nBright what do you enjoy most about this opportunity to live your dream and to perform here in Atlanta to celebrate the one hundredth birthday of Nelson Mandela in a program such as this\n[noise] I Know it's a great opportunity to to be this part of um [noise] to to to celebrate that the nest in my data to beep beep beep beep equal paternity as a as a on a Tuesday and also ah\nI'm grateful that I'm I'm here in Atlanta is this is a beep beep beep beep continent and the big city ... we've been talking from New Orleans now and we go into but it's more so\nI'm On that and um I took them caught and also up to and mom taught in ... for believing in me for believing on my talents that caught it gave me it's a great great opportunity\nAnd just to add on the on the bride just said I'm going to look with us and it's all I've got you'd be\nBecause I mean we watch most of the TV I think the TV like a ... Atlanta well also like to lend the couch I yeah I mean like we're having you know the Tyler Perry just got a studio yeah I mean he's very begin TV so we'd also like to come and lend a few things from them\nSo he leaves someone out there who like to invite us Roseville ya please do so let's coming straight into grade maybe they might teach us something and it can also teach them because we also want to be doing a some\nOutreach programs we will not go to schools and communities to go and teach\nWe will not go to schools and communities to go and teach\nAre done in shallow indigenous music chemicals who learn from them because I mean this is America and on the day this is a ...\nYes we want to interrupt you to pull the corn I'd three goes we also have a segment do the true that way we do need people so it would be nice just to Leonard from the muscles of your book you know\nYou still just catching on YouTube and a local girl in theory you know [laughter] just let him from the community ... a senior sweatshirt says be humble [laughter] you don't you don't seem like the type of woman who needs to be reminded of that\n[noise]\nToday say something I should I live uh [laughter] but I\nHandled too honest and grateful of the opportunity because I I wouldn't have thought I was going to miss Deborah Cox my\nLife I'm taking a picture of her how many people here in America wants to take a selfie with her when I got that opportunity and and so as the and\nAh I I've been taught that when you go to China do you what the Chinese do I ... and I do like the Americans do not forget about my college at all yeah\nYeah that's\nExactly so you're going to be able to you while you're here during the run of the show\nAccepting invitations to visit schools and to perform and to share your culture with the American culture ended learned some American culture while you're while you're here is this your first trip to the U.S yes it is oh wow you write if\nSo what are your take away those for what what has\n\nMeant the most to you or what is so far the one thing that's like\nOh these Americans [laughter] you know what I'm\n... I'm ... I'm I'm from another myth that the African Americans because ...\nYou to us we are it be criminally you you ... Africans African and it it was my dream\nTo come here in America and and see okay so it's a I don't know what to say but I like I'm ... I'm I'm ...\nI think our listeners understand why oh [laughter]\nOkay and the other night to and to have been that that\nThat is it a New Orleans and so is this added um say say that\nHe is a like American so he said that he is very honored to have real um oh it's not African people here because you guys often talk about that he said of South Africa and that you only say that I Am an African ... I'm I'm a black\nAmerican person and to be honest I'm\nBefore before coming yeah I I never thought that people some yeah we're still friendly\nPeople not from here people from here the only smiling you wake up and no one in ... [laughter] going to a gym in the morning but in fact I think that we have people like that but in most cases I'm from\nThe most I I was hired to another in the morning I was so tired and this guy was like good morning either good money [laughter] they they usually do that it's just a family and that a lot of taking back home I I'm going to say that my little sister that\nPeople from America they very lovely Lovings sharing caring and yeah are they smiling\nAnd they do look like us that's true [laughter]\nThere's a reason for that [laughter]\nWhat do you all want audiences to take away from your performances of Africa mold your while you were here October thirtieth through November the ace\nOr like the audience to know of all of the music that we use unlike being a reading a book which from someone or being a teacher by someone who's going to tell them the vision I mean we were doing or or to South African story and to sort of contentious and the oil indigenous\nSo long ago just to come and experience would\nLand and get on the Virginia G to integrate with us or are we like to have a you know\nIt's a bit because you you'd still be ... I mean I wouldn't of love maybe after each and every show so that we can have\nA sit down you know a a talk yeah absolutely but uh\nThat's what you're putting into do basically that's what we do need ... so that they can ask questions on the go to a ... a lot of about ... votes will end I mean what do you see on TV it's not real you know some of the shows that you see people would\nGladly pay some of them I mean you find that that are decent American dressed up\nIn some of them I mean you find that there are two cents American dressed up\nQuite ... like human beings school too but everybody ... whenever they talk like you know what I'm saying man ... no no no no there are people who are like that who knows who use one culture the ruin introduced to you know only you there\nFor you in the mood college or like when you go to Harlem says your house you know just like almost a good ... where did you get the blame the light and so I mean around you know he smoked like no it's a big big city I Know is that we've got to see these laughter on his muggy town you know we also\nLive like that those are like people to understand but I mean I've gone back when like when you come to Africa but the the one thing but you're going to be used the language and stuff like the ... if I Want to feel I'm also go to the loop where the sweat lands that kept oil I go to the game particle game rage\nAnd see them as we are leaving in the wild has only been like would you ever like the ... like the big white but it's not like it would have been ...\nNo I mean if you're going to go on a safari and as an organized excursion into an area where that is\nThat part of the country you absolutely absolutely what were you know we're delighted to have you guys here and we're so excited for the show\nAfrica among the spirit of togetherness October thirtieth through November ate their matinee performances for students to schoolchildren at nine in the morning eleven thirty in the morning at the Puerto Stanford the third performing arts in community center a rainbow drive in Decatur, Georgia again this is\nThe story and it's amazing musical chronicles history and the people of South Africa from the very beginning to today so much to take away from it has been indeed and honor and a pleasure\nTo host all of you here today looking forward to seeing the show I think I'm coming on opening night and\nNot that this is about me because it's not but a deed on my bucket list just like your trip was to get here [laughter]\nI must must get to the content I took one of those DNA test earlier this year and I know that at least on my mother's side of the family are ancestry traces back to Sierra Leone's so I got a lot to do once I get on the plane and come over but I Would definitely be sure to look you guys up saying you're again congratulations on the show we're looking forward to seeing you all\nThey would like to ah just to mention to the community that guy Elias tickets five thousand students to Africa ... so that's our target market you can reach all the kids to come out and experience this would really be happy for temperature the turnpike are limited drag it out even\nAn audience of at least a minimum of five thousand students to see Africa Malaysia again everyone Gregory lucky tell everybody you're beautiful name again that I couldn't imagine down\n[laughter] and now that I wanted to live that in slow it up and I'm going to be seeing it in the elite eat they call you and tell you and I was so good to have you all is well thank you for having us think of it\n[noise]\nPerspective and a half hour we produce in mind\nIf there's something you think we ought to be talking about let\nMean by analysts condo twenty nine on Twitter\nDo appreciate you're listening and\nAt the same time as we examine another\n'em so there's a whole list of different things that we recommend for our patients when we go through all that when you come in for treatment and and a consultation\nI Know one of the things that is a part of the protocols with respect to the stem cell therapy treatments you will recommend that your patients take advantage of the hype of air oxygen chamber at your clinic as quickly as possible after receiving the stem cells tell me audience why that is so beneficial to the patient yeah\nUm many years ago they were ... there's research that was done showing that if you had stem cell therapy and then you were treated with hyperbolic oxygen that actually um enhance the potential to potentially out of the year the potency of the stem cells and actually help them replicate more so that helped them a double triple a number more so\nUm it's a it's a wonderful treatment and um it alone can help so many health issues it's if it's a totally wonderful amazing treatments so about something that we definitely offered all our patients and and we encourage them to do if they can't\nAs these new stem cells begin to replicate in a patient's body can you end up with too many\nNo [laughter] the problem is is when are we we just we don't have enough and and um but when we're born one in every ten thousand cells in our body is a stem cell um and so when you think back to when you're a little girl um you know you're three or four years old if you were running and he tripped and fell and he got a scratch or cut on yourself\nIt took you only a couple of days to heal typically and that's because he had so many themselves in your body that can fix and any damage and repair but already by the time were teenagers we have one ten cent numbers so on and on one of the hundred thousand of cells system so\nAnd as we get older we have fewer and fewer and fewer stem cells so age thirty is kind of the the tipping point where we don't have enough stem cells to keep us young anymore and so that's when we started seeing the grey hairs pop up we start noticing that have in your blood pressure might be a little high cholesterol is a little high\nFisher might be a little high cholesterol is a little high here have diabetes or you have joint pain you have arthritis that's developed all these kind of problems is we just don't have enough themselves to kill us anymore\nAnd unfortunately the older we get the fewer and fewer stem cells we have so if you're sixty Seventy eighty years old and you get caught or you get injured you may take weeks to heal or or you can have bad infections and complications from from a simple cut\nSo that's um um you can never have too many themselves [laughter]\nSo when the stem cells come into the body after one if you're a stem cell therapy treatment and they begin to replicate and in three six nine months your patients began to\nAs you've said on many episodes were covered their lives they can do things that they weren't able to do before then does that sort of restart the clock and then these stem cells or or get they're going to pretty much outlive us right is that how well\nI'm from for the research that's been conducted right now we know that the stem cells when you get a sense of treatment um they can laugh at least three to five years in our body um and so you know is um during that time they can do wonderful things that can really heal us in many different ways\nAnd um so so they they don't live forever unfortunately nobody's [laughter] not yet but um but the amazing thing about the stem cell therapy is is actually can turn the clock back in terms of how old we are and how we feel\nAnd um this is real exciting actually that the the very same ... that I use in my clinic there is a research is that have been doing work with them and what they found is there's something called the Telhami or which is on the tip of our chromosomes as part of our DNA\nUm that this if you've been treated list and cell therapy lift all the cells like I use in my office it can actually make this telling me to grow and make it make it bigger they get longer\nAnd what's significant about that is normally telling me a shrink down and get smaller with age and it's actually real accurate indicator of how old we are I'm about ten years ago when I was thirty five I I did this blood tests where I got my blood and I sent it off to the special apt to find out how long the telomeres where\nAnd when they figured that out they would be able to tell me how old I was\nAnd back then I was in great shape I worked out for two hours every day\nA very healthy very clean and I thought for sure the test is going to tell me maybe I'm twenty five or Twenty one or something [laughter] and I got the desk back and I was so discouraged because I was actually thirty five on the tests that it was a dead on and you exactly how old I was I was frustrated by that but um [laughter]\nBut what's exciting though if you've been treated with themselves and you do the same tests maybe a year later\nIt can tell you maybe you are five years younger or ten years younger based on your telomeres so this is really exciting stuff it's just showing that the stem cells of so much healing power and so much\nUm they they can just really make us younger they make a fool our bodies into thinking that they they're younger because they really are they to heal the tissue that's aging and damaged in our body and make us younger\n... things that are damaging the body and maybe even tissues in parts of the body that your patients in time to use it to ask questions about I Know you wanted us to ah you wanted to introduce the audience to a\nMr ... who was suffering some back pain and and had quite remarkable result he did\nUm he came to see if I did a seminar down in Macon Georgia little south of Atlanta and he came to the seminar and hurt it and then he came to see us in the office and I'm at the time is only complaint really was as back it was Dr it was terrible pain that he'd been having for a long period of time\nAnd um he within a month as back pain was almost gone which was fantastic and he felt the difference right away he noticed even on his way back down to making that he was feeling better it was incredible for him\nAnd um what else was exciting it was that he had some really bad shoulder pain and hand pain and he had limited mobility in his hand and he he he failed to really bring that up when we saw him because he was having such a problem with his back\nAnd I was really concerned he would he would have been the happiest man in the world if we just fixed is back and nothing else but he did have these other health issues with his hand in with a shoulder\nOr but when he came back to see if he said that those were better too and I said wow really and um that's all we get to hear every day is that I'm not only does do the stem cells kill a certain problem that this person may have but they they actually can um\n[noise] he'll you in other ways that are unexpected I've heard I've had people tell me that their visions better after being treated with stem cells I've had people tell me that their skin looks better after getting stem cell therapy have now just all kinds of unexpected wonderful things that headaches people have had would go away\nUm so we're we're trying to keep track of all this and monitor and do research on keep data for all these things when we do see our patients but it's exciting that they can help you in so many different ways that are unexpected but wonderful\nSo I think that they can help you in so many different ways that that are unexpected but wonderful just apparently is going to share his story\nOn TV ... Macon Georgia and I came because my bike was killing me I wasn't paying twenty four hours a day and\nI was dragging my right foot and came up here and I got my shot in my bag and before I got to make an ... it would hurt and and uh don't drag my leg anymore and I walk and I do anything I Want to do and I'm not having surgery\nAnd about two weeks later and my phone that they were going to replace the bone in that mysterious liquid hurting as a\nFucking used my hand and well being in pain [noise]\nWow that's fantastic so when you came to see is that the main concern was your back\n... back on that about oh about Twenty years allowed is just got progressively worse [noise]\nAnd you you've seen some doctors about it before what did they tell you it was wrong\nThey told me I forgot what the ... number is but the diet three D. S. S. B. fuse together to make it better but but I Am a hundred percent better thousand percent better average just quit taking pain medicine it didn't really seem to do anything but make me groggy you didn't help to fighting\nSo they told the only option of a surge\nSurgery I put braces screws and [noise]\nSo we if you were to see your pain on a scale of one of his hand what was your paint panicked and it was\nAn out of a tea and yes and the longer I sat here to worst I got enough I have to keep moving to the I Am down to ... I can drive to three hours at a time now where I couldn't drive Fifteen twenty minutes at a time but I have to get out and walk and I have no pain in my back any more\nAbout that is fantastic [noise] and\nYou said you found those better to what what was wrong if\nI've been going on it's got what they called it but the joint right here that we're going to take this joint out and cut my arm bring a muscle down run into them with them in ... back into my and but the this joint is war out right here\nBut it's quite hurting wow I can move it to work with it and it doesn't bother me at all anymore\nThat's fantastic that's unbelievable [noise] um anything else you know cities out more energy and do you feel any other notice any other effects from the\nRight show there's been given a lot of trouble is quick hurting as bad still hurts just a little when I Do certain things with a ... interview to level um I have the same 'cause\nI Can't move to different ... levels okay so that it is not already activity the way that your shoulders much better show as much better yeah yeah that's a [noise]\nWhat would you do it again you have a choice\nI Would do it in a minute a foot of wouldn't think twice about doing these I'd recommend to anybody that it got any kind of joint pain I Would highly recommend it\nMore about the research for your visit hearing foundation dot org a public service from hearing about Asian\nTwenty Eighteen mid term elections Republicans and Democrats battle it out for control of Washington and the state of Georgia follow it every step of the way we do pre and the southeast largest news team amused by by hand am seven fifty do you ask me\nWhat you ask me be about ... er Cox media group station [noise]\nThat one is twenty four hour news weather and five and a um seven fifty\nAsked me to\nNo good morning at seven o'clock I'm Robin ... live in the ws the twenty four hour news center with our top story this hour [noise]\n[noise] [laughter] [noise]\nCNN and with a chilling nine one one audio as officers do room to room in the synagogue in Pittsburgh, Pennsylvania looking for victims eleven people killed by an anti Semitic gunman the first person identified this morning\nAs Daniel Stern who lost his life Seventy years old and new grandfather the gunman Robert ... hours forty six years old walks into the building where there is no security guard and says all Jews must die and then start shooting more now from ABC News\nVigils Saturday Night\nFollowing a deadly mass shooting at a synagogue authorities say among the dead\nThree women and eight men anything's Maggie really is on the list neighborhood has been absolutely rock and that Greece is extending across the nation many leaders reiterating that saying that this is not only an attack on the Jewish community there's an attack on America as a whole\nThe suspect now charged with twenty nine counts including murder and hate crimes\nIs is the most horrific crime scene I've seen in twenty two years the Federal Bureau of investigation\nThat special agent in charge Bob Jones leading the FBI investigation into Saturday's horrific shooting at the tree of life synagogue in the city's peaceful scroll hill neighborhood the suspect forty six year old Robert powers who's apparently never been on the right our local law enforcement powers is now charged with twenty nine federal crime\nLocal law enforcement powers has no charged with twenty nine federal crimes attorney general Jeff Sessions says if convicted powers could fix but the penalty becomes ABC News Pittsburgh\nI'm Michelle France and ABC News well right now it's forty seven degrees here in Atlanta\nSunny today with the highest Seventy one and then as most accurate and dependable forecast coming up President Trump calls the shooting at the synagogue in Pittsburgh and evil anti Semitic act and orders flags that federal buildings to be flown at half staff\nAnd make America great again rally in Illinois Trump telling the crowd he considered canceling the rally after the deadly shooting I don't\nWant to change our life for somebody that's sick [noise]\nAnd evil and I don't think we ever show [noise]\nFirst first this is W. B. twenty four hour continuing new dog and feed the gators the final score thirty six Seventeen of the situation all victories over Florida are enormous square or it and\nNow the dogs are one went away from the ... the title\nWe're not looking for dinner that would just look at me and we're going to Georgia is winning tonight\nAs you see ... on the judges want to Jake robs three TD pass as all of which killed on those down\n... the grows and our two ... worth I covered\nThat go to ... defense forces three turnovers it holds the gators to two hundred and Seventy five yards next up at Kentucky next week in Jacksonville Jay like the old us me\nAnd bulldog brunch coming your way at ten am at the world series game for the red Sox beat the Dodgers nine six game five tonight starting at eight Fifteen Boston by the way leading the series of three one and two take two tickets that is hitting the seven hundred and fifty million dollar Powerball jackpot\nOne ticket bought in Iowa the other in New York City the jackpot the seven hundred and fifty mill the fourth largest in us history check for those smaller prizes that number's eight twelve Thirteen Nineteen twenty seven and Powerball number for\nThe best time seven or three trafficking whether next\nWhile you can see the Abrams Georgia's future is in your hand follow Georgia's race for governor every day which job swayed Erick Erickson hand that sell the largest news team nobody covers Georgia's elections like new ... am seven fifty you asked me penned on it\nYou're beyond busy between work and the kids the dog and the cat\nLet us help them with public delivery powered by the carton you'll get the items you need from the store you know just shock on line all the time you like your water delivered and grocery shopping is done given you more time to take care of everything\nElse like delivering Howard by the card [noise] does it public dot com slash delivery to shop now that the dot com slash food prices are even ... [laughter] the mayor high I think we're going to let the public square shopping pleasure ...\nPeople say things don't matter but that's not true the things you have from the house or your family lives in to the belongings inside\nAre symbolic afterlife heat for it so hard to down when the next flood comes don't let your hard work being washed away\nProtect life you've dealt by investing in flood insurance calling your insurance agent or learn more and fled smart that gun last protect ... by FEMA and the national flood insurance program\nI'm Tom shame hey guys it's ...\nAs a direct diamond importer shake company has the best value on diamonds every day but it's so much more than that we have by far the prettiest diamonds in Atlanta that because of how we select our diamonds we go to the three diamond capitals of the world and pork Tel Aviv andme Mumbai where the diamonds are caught\nPolish and been sorted by their GI grade we didn't have picked only those diamonds with the most sparkle within each grade I tell my friends but how we buy is going to a farm in hand picking the best fruit right off the trees\nYou can examine the fruit from every angle and leave your rejects for the next guy\nBecause we eliminate all middle men and their mark ups that shame company you'll always get the prettiest diamond for your money pick just for you right off the cutting we'll come to shame company Atlanta direct diamond importer now you have a friend and the diamond business shame company in shank oh dot com\n[noise]\nActually we\nSoviet times having a ... team coverage of trafficking mother Jackie leaving the WSBIU twenty four hour traffic center\nLots going on this morning at times ... blocks of anything down down mount parent exit two fifty six are also a vehicle fire on the interlude has all lanes closed east to free aside perimeter to eighty five south down at Memorial Dr exit forty one punch church street or exit is also close right now\nAnd that crash clearing eighty five north down at ...\nSo close right now and that crashed claiming eighty five north down to do for a drive in center lanes Jackie legal ESP\nSatisfaction if either I'll just read news sunshine today and high up Seventy one will stay steady tomorrow low fifty\nHigh Seventy hey right now forty seven degrees I'm wrong but it will land scan Atlanta's exclusive twenty four hour news weather and traffic station and he was not if I find that am seven fifty ws may depend on it\nFace isn't something that really cares to crack [noise] doesn't\n[noise] in the question [noise] doesn't provide the answers [noise] doesn't make for a happy ending [noise] that\nStill maybe just [noise] vastly\n... you've been to and today he brings you a powerful message and title\nI feed her wallet and this is\n\nWelcome to gain the weekly\n... standing preaches from America's historic Protestant Church\nSharing inside information got\nNow here's your host Peter ... to introduce today's speaker\nThank you Sherry today on day one where honor to have with us wherever and Matthew event a senior pastor of university Presbyterian Church in Austin, Texas\nBefore coming to Austin to twenty Seventeen he served his pastor ... Presbyterian Church in Amherst, Virginia\nAnd this chaplain to Sweet Briar College of medicine that claimed riders preacher and also co hosts the podcast technicolor Jesus for the Christian Century online and\nHe holds degrees from Georgetown University University of Iowa and Princeton Theological Seminary and was a twenty twelve recipient of the day but agency read preachers scholar award given by Madison Avenue Presbyterian Church in New York City ... do they want\nTo be here so you were living in serving in a city that proudly calls itself weird and one of the descriptions of the church on your website is that you hold a tradition that as vibrant alive and rambunctious Lee Reverend I loved that so introduced us to the church youth pastor in this weird city\nUniversity Presbyterian Church is one of the old historic Presbyterian Churches in Austin it fits just opposite one of the main entrance as to the University of Texas campus a and kind of around the corner by Texas standards from the Austin Presbyterian Theological Seminary\nWho gets to complain and who does God thank God is to make us suffer and this way and\nThe Hooters job I think he is to question or wonder or struggle and why of course why do bad things happen to good people I Know why does the world have this crack running through\nIt and then in chapter forty two that dark chapter of that's the last one in chapter forty to the story comes back and it puts a little duct tape over the crack calls a day\nJob relent and then the needs of the guard who had destroyed his life and the first place I\nHad heard of you by the hearing of the year but now my eye sees you therefore I despise\nMyself and repent in dust and ashes\nIt's an ending but not a very satisfying one like\nJob it's been on hold with customer support for hours and hours and finally they pick up and tell him that actually the fire that erupted inside his computer and burned down his house really is\nHis fault and eventually he just says well thanks for listening and hang up the phone\nAnd then of course God does restored job's fortunes his wealth comes back it's a state comes back\nHe has a bunch of nude children which curiously I think is meant to paper over the demise of his old children and he lived to see them all grow into prosperity and long life at the end\nAnd somehow in these eight versus we're supposed to forget the open wound that it's been carved through the heart of the story\nSomehow in these eight versus we're supposed to just let go of all the needless suffering that preceded it something in these eight versus feels deeply on the equal to the task at hand because we know that ... story something in the world has cracked open\nAnd to all be half at the end is somebody trying\nTo duct tape it back together it's not the ending we want\nWants to look up the plane window and see a line of duct tape running around the wing in some ways the history of interpretation of job is one long wrestling match with the abrupt and this of this ending like ...\nAnd ... with the abrupt and this of this ending like even after thirty nine chapters of back and forth somehow we still haven't gotten the answers we were looking for\nIn Nineteen forty five the poet Robert Frost published a short play called a mass of reason which he bills that's nothing less than the forty third chapter of the book of job the additional ending we never quite got to read\n... played jumps to use later at which point and job and ... wife and God and state in all reconnect and try to hash\nOut all the unresolved stuff job gets to finally ask God the questions were all asking\nI tried to think job says the reason might have been some other persons but there is nothing you are not behind I did not ask then but it seems as if now after all these years you might indulge me why did you hurt me so\nGod even gives them half an answer I was just showing off to the devil job but even frost can't put all those pieces back\nTogether there's something unresolved in this story something fundamentally unresolved something fundamentally unresolved people it's not the ending we want but\nMaybe it's the ending we need\nEven and its abrupt and is there something refreshingly honest about these versus something honest about what it is to have faith job doesn't quite get the answers he needs but at some point he decides that he's heard enough job never\nQuite get the conversation he was hoping for but at some point he decides that at least he's\nHad enough after all something has changed God has appeared caught has listened God has spoken into the gap\nGod has not answered all the questions God has not repaired the breach God has not been done the damage and yet job\nHas faith here at the end I think job chooses to have faith faith despite\nAll of that faith born in this middling mass faith regardless of the outcome faith to move on faith to keep going face to carry forward it doesn't repair the cracks faith isn't something that repairs the cracks\nIt doesn't end the questions it doesn't provide the answers it doesn't make for happy endings\nFaith doesn't put the world back together\nAt best it's a patch job but still maybe it's just exactly what we need\nThe most famous duct tape hacking history is without a doubt the one that saved the lives of three astronaut aboard the Apollo Thirteen spacecraft in Nineteen Seventy\nMaybe you've seen the movie\nAs the craft was approaching lunar orbit an oxygen tank exploded which uh boarded the mission and sent the cruise scrambling into the lunar module for the long trip home\nOne of the problems they had to solve with the help of a crew of engineers back on earth was how to attach a square carbon dioxide filter to the round opening of the lunar module filtration system\nAnd the solution eventually of course involved the duct tape that the crew already had on board alongside some cardboard and nephew plastic bags\nSo perhaps it's surprising that for generations duct tape became standard issue equipment on every space flight\nJust a few weeks ago in fact astronaut discovered a leak and the international space station a whole a mere two millimeters thick caused probably buy a micro meteor right but big enough to drain the air out of the place over the course of a couple of weeks\nInstead they fixed it right up first an astronaut stuck his finger over the whole to block it for a few minutes and then they went in with the duct tape\nAnd would love to ask an astronaut how it feels to look around the station and see a pile of duct tape and one of the storage bans I mean on one hand you are piloting multiple millions of dollars worth of technology put together by some of the smartest people on the planet\nThe international space station is literally the most ambitious assembly of global knowledge and production ever created\nIt is a little unsettling or at least I might find it a little unsettling to look back on the corner and see a bunch of duct tape as a project of this substance ended up this deliberation might ever come to the point where we are using\n... end of this deliberation might ever come to the point where we are using everyday household adhesives to put it back together\n\nAnd yet it has gotten them home before\nSo I Wonder instead if the astronaut looking at the duct tape ... something else entirely like it's not just a sign of the cracks and the foundation it's also a sign of the resolve of the mission\nLike it doesn't just say look at everything that can go wrong it also says we are going to get home that says we are going to get home no matter what\nIt says we are going to get home no matter what the falls us\nIt says we are going to get home no matter the miles and no matter the damage and no matter the cracks and no matter the cost it says we've come this far pipe faith and we are going to get home even if we have to duct tape the wing on the side of the fuselage but we are going to get home\nTogether\nThis is the power of the faith in which we stand and which job stands the power of faith to carry us into all the broken places the power of faith to bring it home again\nIt is not the domain of easy answers it is not the stuff of quick resolution it cannot repair the foundation but it does come with courage\nIt comes with the courage of the children of God that says we will get home again in a wide therefore should we be afraid no matter where we go\nIt may not be that the week ahead finds you heard a link between the stars more likely it'll be ... head finds you and the more routine excavations up the crack that runs through everything\nIt may find you and the fire and may find you in the dark it may find you in the cold\nBut the gospel is this there is no where this week may find that does not also come with the faithfulness of God who has been there since the beginning and who will outlast even the end\nThere is no word this week you may go where you will not also be met by the God who created all things and sustains all things and what deems all things even the fire and even the dark and even the cold so half of little faith\nOur serving leadership life within the church and out in the larger\nWorld now if we're going to have that conversation and we're going to talk about competencies we're going to talk about skills for going to talk about habits I think we have to begin with one particular idea one particular skill and that's this servant leaders are self aware\nSermon leaders are self aware people have you ever heard of the ... the mirror self\nRecognition tests or the red spot technique experiment or heard of this if you're if you're in a childhood development child psychology or you may have seen this before have you studied animals you may have seen this test before it was developed by a guy named Gordon Gallup who is actually a bio psychologist\nAnd he worked with chimpanzees and here's the experiment [noise]\nHe went and that's the size of chimpanzees put them to sleep\nAnd he would create this ah alcohol solvent odorless tactile lists or die that he would put on the forehead or on the brow of the chimpanzees so the chimpanzees asleep in this room he puts the dot on their head and then he brings a mirror into the room\nThe chimpanzee comes it comes to wake up and now Dr Gallup he wants to see how the chimpanzee interacts with the mirror\nAnd so many times a chimpanzee will cross the path of the mirror look at the mirror and think that they have an enemy primate in front of them and the punch the mirror shattering it\nBut other times of the experiment ruled on what Dr gal began to notice is that the ... chimpanzee began to notice\nThey're reflection first they began to notice movement their movement corresponding to the movement that they were witnessing in in the mirror and then soon enough what they began when he began to see was\nAnd this was the tell tale for\nFor if a chimpanzee was actually recognizing themselves they will begin to try to ... wipe\nThe red dot off their forehead\nAnd Dr ... used that\nAs the tell to say this is when the chimpanzee knows that they're looking at themselves\nWhen they recognize that there is something on their face that doesn't belong stay recognizing that it's their face and that red dots shouldn't be there and well we'll child development theorists began to use similar techniques in the Nineteen seventies they would take toddlers they would take infants they wouldn't put them to sleep\nSince they wouldn't put them to sleep [noise] they would put a mirror in their space and they would watch them interact with the mirror there's actually psychologist right down the road at Emory name Dr Shay\nWho who says that when a child begins to come to that point of self awareness when they're looking in the mirror there's a stage called a self identification and it's similar to the chimpanzee when they noticed that if they move their hands on this thing in the mirror moves with that\nThey don't necessarily recognize that it's themselves they're looking at but their corresponding movement and they begin to say I have something to do with what I'm seeing\nRight and then the next phase is is it has to do with brain development Dr ... says it's it's a process of permanence\nWhere the child actually recognizes themselves in the mirror they see themselves and they say that's me and they know that to them and the idea of permanence is is it they begin to edge in their own mind this is a brain development thing\nActually in their own mind what they looked like so that when they look at pictures in a little toddlers when they're going through picture albums sticking say that's me they recognize themselves\nSo\nI thought I was I was doing a little research on this I thought that was the sort of the last level of awareness like when you can recognize what you look like who you are what your identity as its cetera but Dr ... says there's actually another level of self awareness\nHe calls it met a awareness and that's when a person\nNot only sees himself or herself\nBut they also become aware of others seeing them they also become aware that there are other people looking at them making decisions about them\nSeeking to the fine then\n\nThey begin to understand that others can can recognize the minute that they're part of this larger system something bigger than themselves\nThat this child is being that is similar and yet different to other being's this idea of meta awareness now here's what's fascinating I think this is a a ... moment that we all know but but from a scientific perspective childhood a psychologist will will\nSay that that that this sort of notion of how other people see me actually defines my identity it defines who I Am\nWhat I see you seeing me define what I think about myself so everybody in this sermon had their heads down and was shaking their heads like that I'm going to have an opinion of myself based on the way you see me\nAnd I see you\nAnd the way I look at you if I say a hard part in the sermon I'm looking right at you\nYou may make a judgment about yourself the tea and this idea of men are where it's it's not something just stays with us in childhood but something that last a lifetime\nThat we not only define ourselves by what we see in the mirror\nBut we find ourselves by what other people see we shape our identity and our self understanding based in large part to that reality is on one hand self awareness is about how we view the world\nIs how we show up in the world\nBut on the other hand self awareness is what the world thinks of us or what we think the world thinks of us self awareness is also\nHow we think the world perceives our showing up in it self\nAwareness is about knowing your instincts about knowing your strengths it's about knowing your weaknesses it's about knowing your experiences that have shaped your the euphoric experience the traumatic experience the experiences that so many of us have\nHave walked through all of those things shape our self understanding but we also project cat out to other people and other people will begin to see us and we see them seeing us\nThe whole package all of these stories the fork and a traumatic all of his strengths all of these weaknesses and we begin to make assumptions about who we are\nNot just on what we see\nBut what others say or what we think\nThey see now there's methods here to this madness\nI think Christians are to engage the topic of self awareness in this particular way and the the idea of metal awareness I think we need to address it in the theological sense\nTo think about meta awareness theologically because ultimately ultimately when we think about the other seeing us\nWe could just defined God as the holy other and we may ask the question how does God see us\nThere and we may ask the question how does God see us this meta awareness not just about what we see of ourselves but what does God see one God sees us have you ever asked that question of herself\nWhat does God see one God sees me because\nI can guarantee that the way you answer that will deeply impact profoundly impact your sense of self\nYour awareness of self\nYour identity it shapes that profoundly and I think self awareness in this sense is a critical skill\nFor servant leaders because it asks theologically two of the most important questions we can ask who am I and what am I supposed to do\nWho am I on what am I supposed to do and when you model or what do you use Jesus rather as the model of serving leadership you you realize that he was absolutely clear and answering these two questions\nThe story than Andrew Read for us from Luke chapter to Jesus as a company as parents to\nAh to the Passover festival in Jerusalem they left Nasser if they're a little town and they're on their way to the big city to have\nThis religious celebrations and and they were traveling caravans when traveling community it would be like all of us sort of maybe getting out on the peach tree getting all of our cars lining up maybe and then\nAnd there may be driving to a spiritual place maybe the birthplace of Dr King were making a little pilgrimage there the whole community goes together that's what they're doing they're going to Jerusalem for the Passover they celebrate it's over everybody gets back in their care of in and they and they start moving back toward Nassar is\nMarion Jones says they don't see Jesus but their assumption is that he's fine\nThey used with the communities where the ... second cousin or something is with their next door neighbors he's okay [noise]\nThey come to realize that he's not with them and they immediately turn around and they had back to Jerusalem\nAnd they have some words with Jesus once they find him he's in the temple he's in church he's listening and and doing the wisdom of the rabbis and they have words for him and the way I imagine it is is when my brother and I worked for our cousins we we get in trouble with our Italian great aunts\nWho talked with their hands more than their mouths\nOn AM seven fifty W. S. B. W. at the program and continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nYou know breaking weather and traffic you demand on now on your\nDoor you had to do you have the radio and listen to the latest WSBIU lord traffic on demand and weight\nAlive continuing coverage of people you depend on\nThe radio out downloaded out in the outdoors\nNow when you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty do the broadcast restrictions we cannot allow for the UGA exports presentation on that when you asked me radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game a bulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\n[noise] [noise]\n[noise]\nBusy I hate it when I this white and Jamie breed when it's warm than we lose power would be\nLike a guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocate all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio and download it out of the store and Google Play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on\nThese ... by them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie for my family on the road and ... how\nYou know breaking weather and traffic you depend on on your\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand and wait\nA live coverage on the people you depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nA busy I hate it when I miss white and Jamie breed when a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty deliberate kept restrictions we cannot offer the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... about them on your radio and\nOn a um seven fifty W. S. B. W. at the programming continues here at a later our as normal and all that [noise]\n\n\n\n\n... powerful\nHear breaking weather and traffic either end on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand an\nAllied continuing coverage of people you depend on the radio I downloaded\nNow what do you ask me is broadcasting University of Georgia board ... by ... am seven fifty do the broadcast restrictions we cannot allow for the UGA sports presentation on that when you asked me radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... about them on your radio and on AMC seven fifty W. F. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] [noise] morning workout\nBusy I hate it when I this latest James brain when storms and we lose power what\nWhen it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah if you were stationed on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board ...\nPi by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north through ws be radio dot com Chilean and I hard here the game and bulldog talk on these ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our normal depend on it [noise]\n\n\n\n\nA ... hour\nBe you know breaking weather and traffic you depend on on your\nDoor you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand way\nAlive continuing coverage on the news\nPeople you depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I this white and James brain when a storm didn't release power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the dark and they'll play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nThrough W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... by them on your radio and\n\n\n\n\nYeah I'm a junkie here on the road ... powerful I can hear\nBreaking weather and traffic you've and on now on your skin [laughter]\nDo you ever do you ask me radio I listen to the latest WSBIU more traffic on on demand and when\nDoesn't live coverage on the people you depend\nOn the radio I downloaded out the door\nNow about us being broadcast the University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nMorning workout\nI'm busy I hate it when I this white and Jamie brain when storms and we live our wouldn't\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their\nTheir latest news and traffic on demand it always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now to do what do you have the radio ads downloaded out of the store and\nYou don't have the radio and download it out of the store and go play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty you asked me WFDD programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road on ... hour\nThe breaking news weather and traffic you demand on now on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage on the people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter]\nA busy I hate it when I miss white and James and brain when the storm did we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse pizza all their their latest news in traffic on demand is always the weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on me it's not a pot pie them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nYeah my job to be on the road a ... hour\nCan be breaking weather and traffic you demand on now on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU or traffic on demand and\nListen live continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNobody us be broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and James debris and when they stormed the Willis Tower one\nGuy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out in the store\n[noise]\nWhen you asked me a broadcasting University of Georgia sports on\nNow when you asked me a broadcasting University of Georgia board or not\nHe bought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through ws be radio dot com tune in and I hard here the game and bulldog talk on\nThese ... about them on your radio and on AM seven fifty don't you ask me do when you ask the program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic you live and on now on your\nDoor you know you asked me radio\nWaves until the latest WSBIU more traffic on on demand with\nAlive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nMorning workout\nA busy I hate it when I this late in Jamie breed when they stormed the Willis Tower one\nGuy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece all their their latest news in traffic on demand it always severe weather\nAbout when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out on the app store and play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\nPowerful\nHear breaking weather and traffic you demand on now on\nW. W. F. B. radio I listen to the latest ws for traffic on on demand and\nLive continuing\nCoverage of people you depend on the radio out download it out in the outdoors\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nOr through double USB radio dot com tune in and I hard here the game as bulldog talk on these ... about them on your radio and\nOn AMC seven fifty U. S. B. W. at the programming continues here at a later our as normal and all that [noise]\n\n\n\n\nMorning workout\nI'm busy I hate it when I miss white and Jamie breed\nWhen storms and we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a double USB real advocates of all their their latest music and traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nWhen you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth through double USB radio dot com and and I hard here the game as bulldog talk on me it's not a pot pie them on your radio and on AM seven fifty W. S. B. W. F.\nAnd on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\nI'm a junkie here on the road on ... hours\nBe breaking news weather and traffic either hand on on your\nW. W. F. B. radio I listen to the latest WSBIU lord traffic on on demand and quite\nLive coverage on the people you depend on the radio I downloaded out in the outdoors\n\nA busy I hate it when I miss late and James brain when storms and released power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse he's all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store and Google Play [noise]\nThat what you ask me is broadcasting University of Georgia sports on not buy buy them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on the menu at the radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... by them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n... our\nBe breaking news weather and traffic you demand on now on your\nDoor you know you asked me radio until the latest WSBIU more traffic on demand and\nLet them live coverage of people you depend on the radio out downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on\nBy by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com and and I hard here the game a bulldog talk on music ... them on your radio and\nOn AM seven fifty U. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\nBusy I hate it when I this white and Jamie breed and when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio I downloaded out in the store and get it or play [noise]\nNow what do you ask me is broadcasting University of Georgia board and\nNot by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on AMC seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\nThe pen on it [noise]\n\n\n\n\n... how\nCan the breaking news weather and traffic you demand on now on your\nW. W. F. B. radio waves until later WSBIU more traffic on on demand for\nLive coverage on the news people you depend on the radio I downloaded out in the outdoors\n\nA busy I hate it when I miss white and James and brain when a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W s be real advocate all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio I downloaded out in the store and play [noise]\nThat what you ask me is broadcasting University of Georgia board or\nNot he bought by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on music ... by them on your radio and\nOn AM seven fifty W. S. B. W. F. B. program and continues here at a later our normal and on it [noise]\n\n\nWheat investor get plus two free tickets to a live training of it which includes a free smart watch judge for attending call eight hundred six one seven three to one one that's eight hundred six one seven three to one one for you're free to actually get now individual results Mayberry\nYour roof as the most important part of your home don't settle David Baker here locally owned and operated Beverly Ruben set the standard for roofing excellence nobody replaces the repairs more area roofs get a free rough announces it Ruth Ruth dot com\nAnd when you ask me about ... er Cox media group station\n[laughter] as long as twenty four hour news weather and traffic\nFive AM\nMe to\nNo good Sunday afternoon I'm Sheryl Castro live in the W. what's being twenty four hour news center\nWere very diverse we're not going to be afraid of that [noise] um we were out and about in the thousands last night we are going to be all about today\nThat's Pittsburgh city councilman Corey O'Connor the day after eleven people were shot and killed at a synagogue in Pittsburgh squirrel hill neighborhood there is a vigil playing for tonight with heightened security tomorrow the man accused of carrying out the massacre will make his first court appearance ABC's ... has more\nThe suspect Robert Bowers is now in the hospital under guard and in federal custody the FBI said there's nothing to indicate he had accomplishes but the damage Bowers allegedly did on his own is evident in the victims including a Ninety seven year old two brothers and a husband and wife\nIt's not clear why he picked tree of life congregation Pittsburgh Mayor Bill could you do called the Saturday it'd be attacked the darkest day in Pittsburgh history\nThe attack is being investigated as a hate crime twenty two of the criminal counts filed against hours carry the death penalty Brian Clark ABC News\nSixty three degrees right now and Peachtree Street head lettuce most accurate and dependable forecast is coming up the candidates for governor respond to that synagogue shooting Democrats Stacey Abrams criticized what she calls the vicious anti Semitism stoked by hateful rhetoric she also said quote we must also commit ourselves to find in common\nRhetoric she also said quote we must also commit ourselves to finding common sense solutions to end gun violence and ensure a right to safe communities Republican Brian tempted not mentioned the gun rights debate but he did condemn what he calls the deranged killer and said quote\nWe stand with the Jewish community against violence hate and bigotry\nFirst first this is double you asked me twenty four hour continuing this\nPackage investigation at Hartsfield Jackson airport is wrapped up in Atlanta police it's bomb squad and fire all coal to the international terminal where the device was found outside we're now hearing the suspicious device turned out to be to flashlights at a weather radio the investigation did not affect airport operation\nBecause the mid term elections in Georgia and across the nation is is\nThe last weekend of early voting that are twenty voting locations in Fulton County today's balloting runs until five pm for both the general and special elections early voting against this Friday democratic leaders held a souls to the polls march this afternoon including candidate for governor Stacey Abrams\nRepublican candidate Brian Kemp begins his five day bus tour tomorrow night president Mike Pence will visit Georgia this week in support of camp well after the big win over rival Florida Georgia has moved up a spot to number six dogs will say number eleven Kentucky next Saturday for the SEC east title\nWon't be hard to guess what comes up and practicing meetings this week we got to be able to be physical enough to give a damn yard we have to you'd have gone on issues of a top talking point but there's a lot more coverage board is worried about what the Wildcats limit\nRussian is a concern to work in progress there\nUK features the FCC's top back and Betty sell the winter or just bottom of yesterday the championship game gig on Saturday and three thirty year old all the dogs in Jacksonville read like nobody was buying WSBIU\nTime three oh three\nI've got some are investigator Dale card well since Nineteen Ninety eight superior pro exterior has transformed thousands of homes that trust quality value and seamless customer experience in painting windows citing roofing and got her superior pro dot com your total exterior solution\nIf you're feeling worried you're normal hey this is Chris Burns here's your more than money update\nWell maybe you know that the market dropping is expected maybe you know it could actually be good for your portfolio because you can buy more when everything's on sale and maybe you know that the worst thing to do right now will be to sell everything and go to cash you know all of that\nAfter another drop friday and five straight weeks of losses\nYou feel awful you feel ready to give up and go somewhere safe well\nCongratulations friend you're a human and we humans aren't always great it following what we know so give yourself a break if you're a little worried right now about your four one K. and here's the keys don't go it alone talk with friends and advisors that no your long term goals it can help you stay on course that's a decision I promise\nYou'll feel good about it that's you're more than money updates this is Chris Byrne let's build your financial future go to my life is more dot com\nConfidence it seems to be the missing ingredient in health care today as we know more about the human body than ever before\nFrom cutting edge research\nAnd have access to medical technology that previous generation would have never dreamed up when it comes time to decide what to do for you and your family's hell the choices can be overwhelming with something so important\nYou deserve a partner that you believe that confident and it's exactly what you get with George ...\nAt Georgia you ... you don't know you made the right decision a moment you enter one of our twenty eight chicken location when you meet your physician and receive a treatment plan to my desk for you you'll forget\nHow complicated healthcare utility men and women ... pediatric care treatment for kidney stone overactive bladder BPH and prostate cancer affecting the and the reversal no matter your healthcare need\nYou deserve to be confident you deserve a partner even try you deserve the expert at George a urology\nPlay WSBIU news weather in traffic in a flash\nGo into the hills and your Amazon and search still us the radio and unable to blast briefing from news not by by and am seven fifty WSBIU depend on it [noise] we\nWent spending time three o five ... coverage of traffic and whether Jill Nelson joined us lines in the deli wants to be twenty four hour traffic centered\nCrash on the east ... Seventy one ... that slowly get back past evidence Neal you can use to Seventy eight as a possible alternate roadwork on Seventy five north bound blocking\nFor right lanes from ... to sixty one del grows up to two sixty five the north loop that slows you all the way back packed to eighty five he's highly forty one is your alternate theory this report sponsored by Sam's Club it's read grand opening weekend at your sharp ... Sam's Club and you're invited come explore your new\nFresh zone and get one dollar off select can roll sushi it all starts this Friday October twenty six Jew Jill Nelson W. S. B.\nThey're all just reading it lots of sunshine today will have on the low seventies and again tomorrow sunshine low fifty high Seventy\nSeventy and again tomorrow was sunshine low fifty high Seventy\nRight now sixty three degrees on peach tree street with news on the hour that happened when it breaks on several accounts for news Ninety five five and am seven fifty W wants the depend on it\nNow following program is sponsored by lens marketing [noise]\nA swing bird [noise] news\nNot five five AM's so when you ask me freeze that in mind George AOL edgy about go to jail for a good living from current events on health care policy for better\nLove him to the weekly check of ... and I'd like to think that this is just another Sunday just like any other Sunday and it's it's unfortunately\nNot for me um as I was leaving the house today uh I went through the kitchen and we have a your site candle burning and ... candles a memorial a memorial for those who have passed and we let it um as a result of the massacre in a synagogue in Pittsburgh\nAnd it it's hard it's hard to just let that pass and not talk about it and yet I'm I certainly don't want to have the typical conversations about it\nUm my guess this week is berries assaults berry's been on before Barry is one of the senior positions it's okay to say senior position now address at George urology a pass managing partner he continues to be very active on the board still sees patients\nAnd and I called burying or actually very called me originally we were having the same thought as we were playing phone tag a which is you know it's kind of not business as usual ... you know uh what do we how do we approach this and ... are both Jewish and I I think it's just beyond the faith because\nI I think when there is a massacre in a house of worship\nEveryone everyone is part of that family and I don't think that we're distinguished by that by the faith in that regard\nUm and and we were talking about you know is it just going to be a show on prostate or whatever it may be and\nAnd it was interesting because plan for the show a very had recently written an article um that was published about\nThe conversations that parents need to have with children now interestingly that that was a focus more on dad's talking to their sons about puberty and advancing the conversations about puberty from parents to children at earlier ages\nBut it was also more than that and when I read the article it was kind of interesting 'cause it wasn't just the the ... kind of talk it was talking about the me too movement and other things about awareness um that need to be taught to kids and I was thinking about\nUm how I deal with the show today and I asked Barry if he was comfortable with you know there there's a important message there because when you hear the ... all the polls talking and and all the morning news shows and you know everyone is at fault and all the different pieces and things that are broken in society or\nRecognize changes in their bodies when they do have that pain they won't be embarrassed to tell their parents so we have a chance to to do good for them\nOr a medical way break we're going to break we'll be back stay with us [noise]\n\nThree twenty and the whole re carrier W. I. C. twenty four hour traffic center earlier crash ... somebody wants to know a road on your backpack Adams Neal keep using highly to Seventy eight as your alternate real work on Seventy five north down blocking for right lanes from don't grow up to the north loop that slows you back down to two eighty five\nYou can use highly forty one is an alternate there but it is getting pretty full so they expressed lines or an option as they're heading north bound right now this report sponsored by usa a life insurance company help secure your family's tomorrow for less than you may think that the U. S. H. A. dot com provided by usa a life insurance company San Antonio Texas Jill Nelson W. S. B. [noise]\nSounds like you know I'll just read it with a lot of the most accurate and dependable weather forecast will keep sunshine is temperatures climb up into the low seventies this afternoon and then with a clear sky turning cool again overnight falling through the fifties Monday morning starts at fifty in town some upper forties and suburbs\nThat sunny and Seventy tomorrow Sunday on Tuesday low forty eight high Seventy three\nSure might be a special plumber about lotto homes [noise]\nWe know how important the news weather and crossing guard a you say connected to Atlanta and telling us in the eye heart radio I listen to mark harem on his lawyer and Erick Erickson anywhere\nYou go on the other side of the country or the other side of gloom but when you asked me everywhere I live in the heart radio out in the store for on Google Play\nAmong gynecology formerly McDaniel indirect gynecology aren't landed GYN and surgical national in\nWith offices if he my hospital in non cat and then on the side hospital among analogy providing comprehensive ... a logic hair and said it'd be our surgery Thurman them not literally ... I'll be ... and burned team all of\nOur own moon range and gone to the logic hair\nAnd the bonds and burn team over a long range and gone to a logic care annual exam that nothing can screening had the full range of contraceptive options\nSpecialized services such as ... identical hormone therapy Mormon ... nation as well as minimally invasive and robot assistance surgical procedures avant garde ecology morally McDaniel underwritten mold in mission to her by the exceptional compassion and care to women at every stage of their lives\nThey try to be at the forefront of knowledge and skills in the fields of women's health and ... surgery visit avant-garde ecology dot com today a bond gynecology dot com [noise]\nHey although Halloween is a holiday for the scares and surprises choosing where you buy your next vehicle shouldn't be\nThat's why I gladly river all my friends and family to a gym Melba Chevrolet why because they always go above and beyond to exceed my expectations kind of like those houses to get a full sized candy bars Halloween and the savings well they're hard to beat especially this time of year\nRight now Jim Ellis Chevrolet you could say twelve thousand dollars off limits or a piece on all twenty Eighteen ... suburban checked ... number T a one to seven\nIt's a measure appears fifty three thousand nine Seventy one after rebate so that you know the Chevy discount you're paying just forty one thousand nine Seventy one just added ... trees take it for me by your next vehicle doesn't have to be a fight for various especially when you could shop by and trade your way a gym now the Chevrolet\nMore details visit Jim Ellis Chevy dot com or stop by our Peachtree industrial just inside the perimeter\nOf Scott's late sent you to find new roads this fall to Janelle ...\nAt the Georgia vascular Institute and we are dedicated to uterine fibroids treatment many women may not know they are suffering from fibroids\nHeavy bleeding during cycles housing pain fatigue and the urgency to use the restroom are all symptoms of this painful and burdensome condition Dr Kevin Carson of the Georgia vascular Institute has dedicated his medical career to fighting uterine fibroids and empowering women through treatment\nFor a limited time they Georgia vascular Institute is offering free initial consultations with Dr Carson to women who may be suffering from uterine fibroids many women postponed seeking help because treatment may mean time away from their family or jobs\nThankfully due to a procedure called uterine fibroids immunization many women are able to get back to their lives within one to two weeks after treatment\nTo learn more about Dr Carson and your free consultation visit Georgia fibroids dot com or call Seventy I don't know five or six four o seven\nGeorgia fibroids dot com\nI'm Tom Shane we see a lot of customers coming to Shane Company to buy gifts for all kinds of occasions your anniversary or birthday celebrating a new baby\nIf you're not sure what to get her remember there are many essential pieces that every woman needs in her jewelry wardrobe that she can wear with everything you can't go wrong with our fourteen karat gold hoop earrings from Seventy five dollars to three Seventy five\nA diamond tennis bracelets a classic gift and ours begin around a thousand dollars might go to gift is a strand of coach or pearls and we have them in every price range\nAshamed company we have the largest selection of jewelry essentials at the best value in town you'll find better designs better quality and better craftsmanship than anywhere else what ever the occasion she's worth the drive\nNow you have a friend and the jewelry business Shane Company in shank oh dot com [noise]\n\nKnow that one teacher children well by Crosby stills and Nash and young are song of the week senator songs you'd like to hear will start playing them as early as next week we're live in the weekly check up on your host Dr Bruce fiber of life you're a doctor berries it's also George ... actually it was produced by lens Atlanta's healthcare marketing expert\nUh interesting the reason for that choice of song is our conversation for the past segment was about an article the doctors assaults wrote it was recently published about more engagement in teaching young boys and young boys seven and nine years old\nA given the fact that puberty is happening earlier um and that that's an observant nominate across the U.S I don't do the extent it's observed worldwide and lots of theories about it\nFrom a ... a ... a supplementation of food source as well as you said ... and other things and how they might be altering the chemistry um but nonetheless it's happening and the idea was that\nUh that earlier use a in that earlier presentation of puberty or might make it worthwhile to have that conversation earlier time and not just that conversation not just the birds and the beast talk but also about not just had their bodies are going to change but how their emotions might might be affected by it or their passions might be effect\nTheir emotions might might be affected by it or their passions might be affected by it and what a great opportunity that then is to get in to even more discussions about the values that that you embrace as a person that you could share with them\nA and isn't that a timely conversation given the events that are so recent uh like those that just transpired over the weekend and particularly those yesterday I'm with the letting killed in the house of worship\nSo that was the reason for teach your children are we're going to get back to the team a little later in the show we're going to kind of touch basing it into a little bit more medicine or over the next a few bits of the show or and so we'll be talking about some new treatment opportunities fucking about some of the changes\nUm in healthcare in our community that are impacting where patients can go to receive treatment do a lot to get into stay with us [noise]\n\n\n\nOf premium quality rumor that's affordable only my guys David Baker your top rated family roofing buys materials in bulk and doesn't pay commissions that means a lower price for you they stole over fifty thousand affordable Ruth seeing that real fruit dot com\nOr you experiencing hot flushes or fatigue do you suffer from sleepless nights or low libido you could be suffering from a hormonal imbalance which could cause you to feel like a stranger in your own skin\nNorth Fulton compounding pharmacy can work with your doctor to develop a biological hormone replacement therapy specific to your needs and get your body back in balance the natural way\nVitamins and supplements go hand in hand with hormone replacement therapy and we're proud to offer pharmaceutical great products but we're told molecular pure and kept solutions ed ... we also offered medications that are free of dies preservatives gluten and other allergens in the dosage that is right for your body\nNorth Fulton compounding pharmacy offer shipping across metro Atlanta\nTell them you've heard about a W. S. B. I receive free shipping on your first order for new patients north fault in our ex dot com north Fulton our ex dot com or called southern southern old four seven five eight nine three seven seven zero four seven five eight nine zero three\nCome through shame company you had ladders direct diamond importer whatever size or shape you want we offer the best value on the prettiest diamonds in town now you have a friend in the diamond business shame company in shank oh dot com\nOr some of these procedures need multiple procedures to have to go\nTo our drive each way and if they have a complication to go back it becomes a problem the other thing that ends up happening is they end up in emergency rooms and they have to be treated on the south side but if it's an elective schedule case they have to go\nAll the way up to the north side of Atlanta\nSo I'm well I'm curious that the conversation you're having insurance commissioner was it just one sided and you did spiel and he just got ahead not or the equivalent you know by voice it had not thank you for calling or is there kind of a real dialogue that took place\nI explained to position it was more it was more of a head and I he listened the there was somebody else on the phone and I explained it but I don't know maybe behind the scenes or stuff being done\nBut I think it's all about the contracts that insurance companies have with the hospitals and they try to make their best deals and get the best care but there should be a centers that are not so far away especially because a lot of the patients we treat her over Seventy five\nAnd if they do drive they don't go and highways\nWell I'll be I'll be surprised we don't get some calls about that for individuals who had been in that situation now this is relatively new a new Dell right the contract\nI think contracting is not you know I tried this particular changed it on to this party daily to effect yet or is it no this is in fact this is in effect for a year or two actually and uh it's a it's a difficult situation because if if I'm a physician that's contracted with that insurance\nI Would like to treat the patient where it's easier for the patient not necessarily for me or I could go to North side but for the for the patient is very very difficult for them to to to navigate especially today look you know what the growth of Atlanta over the last twenty Thirty years is huge it's it it can take sometimes\nTwo hours to get from a random south of land and\nInjured urologist strong presence on the north side of town so I don't know if you're privileged in the north side hospital areas\nI'm privileged north side I'm privileged and actually I'm going to start going through the office in downtown we're going to open up an office next month so I'm gonna go there one day a week but it's not about me it's about the patients\nAnd sitting in a car for so long especially if they really don't want to be on the highway and you're hearing this from the patients correct and on hearing it yeah I'm not I'm hearing both from the patient and when we try to schedule\nYeah I'm not I'm hearing both from the patient and when we try to schedule the hospitals will say we can't do this this this particular case here because their insurance won't allow it\nRight now I'm thinking about the fact that the patients are gonna have to I Want I I Wonder how ... how powerful your voice will be versus the voice of the individual patients who are having to deal with us and but if they're not calling the insurance commissioner you know if they're not making a stink if they're not making the burdens that they have to overcome\nKnown my concern is you're going to sound like another angry doctor that you know his life is made more complicated by a contract\nBy so it's really doesn't affect my life that much but it but I'm really trying ... I think one of my strong points is I always try to fight for my patient and I think\nWhich is much ... much more fair for the patient and much more comfortable and much more uh ... much less stress for them if they could be treated closer to home\nNow now you you know as I'm understanding this this is one particular regional insurance carrier that's done this\nNo this is at least three years at least three at least three\nAnd a they have actually they have primary care some of them have primary care centers on the south so they could send that patients north but but still I think that there should be a um the ... the possibility and the availability for their patients treatment if they're being seen by a primary care center that they should be able to be treated\nCloser to home so you know it's interesting you think about the consolidation that's happening in Atlanta in terms of\nHealth care in general and George ... kind of did it on their own by being as big as they are with a number of locations but from a hospital perspective you've got every you've got Piedmont you've got north side and we'll start\nAnd there's not that many up individual players left a Emory has just absorbed a cab and now it's emerita cab with the same thing with the ... I think Piedmont grabbed rock down I think other than when that southern regional Henry I mean I'm not sure how many are independent\nLike so so that and that and that creates a big a fight for certain a certain contracts and and when they get the right price thing in the insurance company gets the right price and then they want their patients treated at that institution\nRight now I get that and almost seems like that in the city the size with six plus million people and so much geography if we are going to end up with four systems and not what we used to be you know twenty six an independent hospitals or did he system has to be represented in each geography\nRight I agree I agree ... percent and I I think that it becomes dangerous especially just think about it if you have the OB patient the obstetrics patient who's pregnant\nThey have to navigate to go to a certain place or you never know if it's basically a potluck whether that tropical allow that patient to\nTo get to that hospital and I told the commission I think you're going to have a lot more babies being born on ice Seventy five\n[laughter] again just the ... the quiet not on the phone or where you live or ... no I was like we were like All right no no response on that one either\nNo I think they were going to look into it I Would see what happens yeah\nAll right did you get was there any kind of follow up are you are going to be are you going to follow up were they going to get back to you at some point in time after day and I do the analysis we know sect follow up but we'll see you know maybe this will help and and did you did that on your own did you do that as a ... representative the is that a role you serve this kind of\nUm you know outreach political outreach for the practice no I did that because I had plenty of patients each week I've patients that can't be treated ... my main hospital and they don't have to give you up as their doctor no right they just have to go to different locations but\nThen you know sometimes it's a very very conversation with an eighty three year old woman or man thing how are we supposed to get there and then so after so many of those conversations I said I'm calling to get insurance commissioner\nAnd actually I had the c._e._o. of my hospital listening in on that conversation so I Hope that they'll follow up and are somehow a this will be taken\nCare of for those patients and and so obviously they must be Medicare Advantage or I'm just saying what kind of an eighty three they're likely Medicare but now Medicare is but if they haven't had this commercial have Kaiser or human or you know I said the Medicare Advantage plans like right\nThere are certain plans that they have certain plans that they have that even if they have that extra then then they're not allowed to be on\nBecause that's done that that is to contract in a way that the that insurers making with Medicare is that will accept those rates but we have to have more control over how we're going to manage the money and do the coverage right right [noise]\nSo I'm with all this going on and healthcare while we were just finishing up the topic is there anything good that you're seeing in terms of the reorganization of health care as we move to what what's being called a value based uh care program away from volume based or fee for service payment are you seeing anything that's positive\nI think there's a lot of good there's a lot of new development a lot of new technology is you know you're in the technology business as well a lot of new procedures or were trying to get away from\nThis is well a lot of new procedures or were trying to get away from a more invasive procedures were trying to uh\nGive patients better quality of life without without a necessarily or any major procedures if we can and that's certainly true in urology or we spoke about\nPreviously ... with a trip to the which fragments stones without a major operation with different type of a prostate procedures like the euro lift or their resume procedure so we're trying to uh I think there's a lot of excitement in medicine today\nWith a new technology and and uh you know and and and when it comes to technology is also new drugs you know I don't have to tell you about cancer therapy but there's immunotherapy is a lot new development and none of research and\nDevelopment I'm interested that you know you're trained as a surgeon you practice urology ... you're talking about him you know therapy um\nWell and you know therapy now is a proof of bladder cancer so we have to ... you know we have to we also have to learn ... we don't administer necessarily some urologist may administer chemotherapy but we do a lot of therapy for cancer patients and the office\nAnd we've actually yeah no I I hear it's great it's great to hear your ... your ... like that we're going to go to break when we come back or to get into some more in depth about some of the specifics um last it'd be touching back into the events of the day and kind of some thoughts just a conversation a today about um\nSomething that meaningful and how we you know it has to change us and they should affect us and we should keep talking so we'll do that as well stay with us\n\nAnd\nWomb\nForty nine or ... W. B. twenty four hour traffic pair of that earlier crash out on the east ... west bound before ... road has been cleared for a while now just a little bit of a minor delayed their back towards Evans mill\nUh you know have used to send your as your alternate anymore it's just a little bit of slowdown roadwork on Seventy five north now that's a different story for right lanes blocks from elk wrote up to the north loop that plus the fact that you and he thought\nYou think he's highly forty one or the express lane says you're alternate ... shut down by rubber southbound ... north down on eighty five between Pleasant Hill and at one of seven ... road and the ramp\nAnd then giving you more time to take care of\nEverything else like delivering powered by used a card does it public dot com slash delivery to shop now that public dot com slash the prime minister [laughter] deeply live they live on ... ... we're shopping pleasure\nWhen you asked me about 'em doorbell er Cox media group station [noise]\nTwenty four hour news weather and\nFive and a um\n\nKnow good afternoon\nClock I'm Sheryl Castro live and the ws be twenty four hour news center\nJak politics is coming together outside\nTriple a manual and New York city morning those killed in yesterday's Pittsburgh synagogue shooting massacre rabbi Josh what David should\nOur hearts reach out to the families of those murdered and wounded and to their temple community we grieve beside\nThem synagogue shooting happened in the Pittsburgh neighborhoods squirrel hill or ABC's aerial Russia is\nFreddie Radner was a member of the synagogue for years and lives just blocks away because I tried that and I'm ready to have their own son's bar mitzvah\nWhen you hear that there was none of that going on we're a family was celebrating joy you start to think of how horrific that will be five that joyous moment turn it into a heinous bloody a vast\nPartake casting a shadow as the lights he can senseless late begin to come into focus on\nForces or the alleged shooter Robert Bowers isn't fair condition at a hospital with gunshot wounds choked secrets and ABC News\nA vigil this afternoon at temple Sinai in Sandy Springs to the victims of the synagogue massacre rabbi Bradley loving bird tells channel to watch the news he hopes the visual will help with the healing process\nIs also trying to put this in the context of Jewish tradition and asking God for assistance and not only helping us to heal and recover helping to prevent this from ever happening again extra\nSecurity in place today at local synagogues right now sixty four degrees the plant has most accurate and dependable forecast is coming up\nFirst first this is double you asked me twenty four hour continuing this package investigation\nAt Atlanta's airport is wrapped up a Hartsfield Jackson spokeswoman says the package outside the international terminal turned out to be to flashlights add a weather radio of violence scuffle between two like only a middle school students captured on video where were the adult\nVideo obtained by channel to action news shows the brutal scene with only a middle school a Fifteen year old student delivering below after blow to uh crouching twelve year old seventh grader trying to shield his head with his hands the students mother is demanding to know why school staff didn't step in\nThe ... teacher no ... no security\nShe says her child will not return to school Bodie Brooks W. S. B. to\nLucky winters will split that seven hundred and fifty million dollar Powerball jackpot one of those tickets sold in Iowa the other in New York\nIn sports reports at the Cleveland Cavaliers it fired at coach's Tyrone Lou after an open six stores the team has not commented on the move\nLou guided the Cavaliers to an MBA titled back in twenty sixteen Cleveland's first pro sports championship since Nineteen sixty four\nAnd help the team to four straight finals Atlanta Hawks flew back an action tomorrow night against the Seventy Sixers Atlanta United take onto around to see this afternoon it for three falcons are off this weekend WSBIU time is now for oh to check of traffic and whether next\nDo you hear voices those nagging little voices in your head the voice that remind you every day of all the things you need to do\nMaybe you've been skipping your twice yearly maintenance on your front as generic conditioner not good it's time to get that done right now and get back on track\nSo cool re a super seizing the wrong famous no breakdown guarantee called cool right for your winter safety jak in furnace maintenance you'll get a credit up to two hundred and fifty dollars towards any repair of your furniture breaks down this winter\nJust called cool right just called cobra your factory authorized terrier dealer sign up for three you're cool All right cool care maintenance agreement and get a two hundred and fifty dollar credit with no service coffees anytime until march thirty first twenty Nineteen\nI'm Dave Baker the experts you here on my own fix the Joe are the ones you want keeping your heating and cooling system running right\nCool cool right they get you faster and often the best warrant teasing guarantees I have seen in Atlanta they also get rid of all those voices in your head Korean carrier turned to the experts\nSometimes changing your mind is a very ... every year thousands of men decide to you again pursue fatherhood\nThat county reversal procedure\nAt George ... we understand that sensitive and personal decisions that men make regarding\nHandling our job is to be there for you and provide the experts surgical care you need to confidently entered the next phase of your life or reverse doesn't always mean killing ... learn more at ... dot com\nIf you've ever suffered from a kidney stone you know they're waiting to see the doctor is simply not an option\nOn a kidney stone you know they're waiting to see the doctor is simply not an option that's why I joined in urology created the kidney stone hotline now you can contact us any time day or night and receive an appointment within twenty four business hours just call one eight by by stone one one sometimes the fact is care available is also the bat if you had a kidney stone\nI Need help back all Georgian urology kidney stone hotline at one eighty five five stone one one that won eight five five down one one\nSometimes changing your mind is the very best decision every year thousands of men decide to again for fatherhood\nThe second the reversal procedure\nAt George ... we understand the sensitive and personal decisions that men make regarding\nFamily our job is to be there for you and provide the experts surgical care you need to confidently entered the next phase\nOf your life to reverse doesn't always mean going to learn more\nAt G. A. you're on a gene that if you've ever suffered from the kidney stone you know they're waiting to see the doctor is simply not an option that's\nWhy I joined in urology created the kidney stone hotline now you can contact us any time day or night and receive an appointment within twenty four business hours just call one eight by by stone one one sometimes the fact that care available is also the bat if you had a kidney stone\nAnd need help that all Georgian urology kidney stone hotline at one eighty five by stone one one that won eight five five down one one\nTotally lesbian news time four oh five live team coverage now with traffic and whether Jill Nelson is in the ws be twenty four hour traffic center tractor Brandon\nLet me know that I travel advisory crash eighty five sat down at how we treat Seventeen Lawrenceville ... wrote\nThree left lanes or block there and that's causing delays upon to eighty five and nine eighty five years old peach tree or satellite boulevard at your alternate another new crashed duty five north out out early before I twenty on the east side that's blocking to write lanes I almost about to be three right lines watch their earlier crash on the East Bay we I twenty west now before pinola with clear but now they're holding that right lane again\nCausing more delays back to Evans mill Jill Nelson ws be\nMaybe they're all just bragging it's with a lot as most accurate and dependable weather forecasts what keeps on China's temperatures climb up into the low seventies this afternoon and then with a clear sky turning cool again overnight falling through the fifties Monday morning starts at fifty and towns um upper forties and suburbs\nBut sunny and Seventy tomorrow Sunday on Tuesday low forty eight I Seventy three\nRight now sixty four degrees I'm sure we'll Castro news Ninety five five and am seven fifty WLS faith depend on it\nThe following program is sponsored by lens marketing\nWeinberg amused by five at a um do you ask me presented by George W O O G L very good living from current events or they don't care for the better\nThis is a weekly check on your has doctors fiber this hour is presented by George urology kidney stone hotline one eight five five stone one one available day or night for scheduling appointment within twenty four business hours were alive today with Dr berries is holds\nA who practice with George ... Riverdale locations who specializes in kidney stone geologic cancers and men's health he's been recognized the top docked in Atlanta Magazine many times and you can learn more about him and the practice at Ga urology dot com\nAlso we talked in the first hour that very recently a road kind of an opinion piece commentary a that was published about teaching\nFather's butt ugly fathers teaching young sons age seven and nine about puberty and life values um that was a segue into talk a little bit about uh how do we really get into values with our kids are as we deal with the events of this past weekend\nI'm as a Barry now I are both kind of mourning the loss of our community or the extended community is really everyone's community a given that eleven were killed in the house of worship\nUm we're gonna come to change gears a little bit this hour get a little bit more clinical among the other hatch that Barry where she is also directs the marketing program for the practice George ... is quite large how many locations\nWe have about a twenty two okay so he's showing how docs forty four forty five dollars\nAnd forty five ... and so um you know ... it ... you often see a marketing pieces about nor side hospital or Emory or Piedmont\nAnd you don't think much about them when practice get to be that large uh they too often participate and uh but the marketing strategies are often different and I'm Barry has\nKind of a been been stressing to his stocks that it can't be a one man effort it's got to be something that they all participate in to tell me more about what you were dealing with the blog posting\nThat sunny and Seventy tomorrow sunny on Tuesday low forty eight high Seventy three\nWhether brought to you by she made the official electrician Atlanta homes\nElectrician of Atlanta homes\n[noise] we know how important the news weather in credit card you say can I've been to Atlanta telling us in the eye heart radio at least some of them are Karam heckler and Erick Erickson anywhere\nYou go on the other side of the country or the other side of a dog but when you ask me everywhere I live in the I hardly any all out in the store for on Google Play\nAt a certain age we all start to feel the effects of aging especially if you have chronic pain due to an injury or disease yet your desire to live life to the fullest and operate at your best probably hasn't diminished\nIncredible advancement send the use of stem cell therapy has brought new hope that we can eliminate pain and give you their freedom you desire to get back in the game is Melinda Skelton and I'm a patient have Dr Rick ... the leading expert in stem cell therapy and host of the regeneration radio show on W s D\nYou haven't chronic pain are having problems with your joints her back learn about the advancements in stem cell therapy an application Dr Ambrose accuses to leave he ate pain and increase activity I'm blown away by the success stories and incredible results we're seeing in this field\nBy the nation's leading expert in stem cell therapy now if you're interested in learning more and consulting with Dr Ambrose ... visit the website Dr Rick dot C. oh that is letter D R Rick dot ...\nPeople saying things don't matter but that's not true the things you have from how your family lives in to their belongings and find\nAre symbolic afterlife important so hard to down when the next flood comes don't let your hardware be washed away\nProtect life you've dealt by investing in flood insurance calling your insurance agent or learn more about floods my walk down last protect ... by FEMA and the national flood insurance program\nOr you experiencing hot flushes or fatigue do you suffer from sleepless nights or low libido you can be suffering from a hormonal imbalance which can cause you to feel like a stranger in your own skin\nNorth Fulton compounding pharmacy can work with your doctor develop a biological hormone replacement therapy specific to your needs and get your body back in balance the natural way\nVitamins and supplements go hand in hand with hormone replacement therapy and we're proud to offer pharmaceutical great products but we're still molecular pure and cancellations embedded genetics we also offered medications that are free of dies preservatives gluten and other allergens in the dosage that is right for your body\nNorth Fulton compounding pharmacy for shipping across metro Atlanta\nTell them you've heard about is a double USB and receive free shipping on your first order for new patients north Fulton our ex dot com north Fulton our ex dot com or called southern southern old four seven five eight nine three seven seven zero four seven five eight nine zero three\nNow this is the time of the year to get your new hot spring spa from the Georgia spot company a spectacular truckloads sales going on through the thirty first said six thousand eight thirty nine on six and seven person salt water hot tubs they're normally over Fifteen thousand dollars\nYou also get a free coverage steps water ... delivery and set up a Seventeen hundred dollar value\nGeorgia spark company for doctors Kennesaw Alpharetta now in Augusta, Georgia Spock company dot com\nIf you're feeling worried you're normal hey this is Chris Burns here's your more than money update well maybe you know that the market dropping is expected maybe you know it could actually be good for your portfolio because you can buy more when everything's on sale and maybe you know the worst thing to do right now would be to sell everything\nAnd go to cash you know all of that\nBut after another drop friday and five straight weeks of losses you feel awful you feel ready to give up and go somewhere safe well\nCongratulations friend you're a human and we humans aren't always great it following what we know so give yourself a break if you're a little worried right now about your four one K. and here's the keys don't do it alone talk with friends and advisors that no your long term goals and can help you stay on course that's a decision I promise\nYou'll feel good about that you're more than money up they this is Chris Byrne let's build your financial future go to my life is more dot com [noise]\n\n\nWe're back on the weekly check of ...\nA lot and he said we had a message one of our sponsors every health care so pleased to welcome to cab medical to the family\nTogether they offer even stronger more accessible high quality healthcare to learn more visit Emory Healthcare dot org slash to cap medical air show was produced by lens Atlanta's healthcare marketing expert and we're live in the studio today with Dr berries is host of Georgia algae\nWe taking some time today very night both being Jewish and trying to sort out the events of ...\nBoth being Jewish and trying to\nSort out the events of the weekend and uh the tragedy of eleven people dying in their house of worship past spent some time talking about different things today and we've got a call now and I guess it's a rabbi Barry a nose from his congregation duck and rabbi Adam star and we're going to bring him on the line for his comments\nRabbi started how are ya Hi how are you good thanks\nSo it must be tough being a rabbi and events like this take place\nYeah this is a a very hard and fall and a difficulty for for our people on the entire world\nSo I I was saying earlier that I'm hopefully with an event like this so senseless in in a house of worship um crosses all lines of identity and tried 'em and let's be something that should affect all of us\nAbsolutely I'm One of the things we really feel as that attack on one synagogue Israeli attack on every single night either as an act of anti Semitism an act of hate against Jews and I hate to say it could have been our synagogue\nThey didn't care who it was it was an issue that was that we're all under attack and we're really feeling that while their ability right now\nAnd one of the things we talked about actually when we were off air how will the synagogues including ours are having a armed guards are are armed police officers or during or a a prayer services Saturday morning\nYeah we we we've always had that Saturday morning but now I'll get Betty stepping up the security the more significantly it's really sad that we have to live at a time [noise] um [noise] where people coming to pray in which a synagogue sanctuary should really be a sanctuary should really be\nA safe space from the all the ills of the world around us and that unfortunately has turned into a place of a threat in fear it's just it's just sad\nSo you're you're you're going to be given the difficult task of kind of trying to offer sermon that's going to get Sollisch but also some hope I'm chair congregation ... and I'm curious if you I'm sure you've thought about it but um you know what what what where do you go to to find that help\nSo I turned to our traditions I'm as tradition of a of the ... the Bible or to look for words of hope in in times of darkness I for me it actually it\nActually goes to the very very beginning the book of genesis where a God of the world was was dark\nAnd he said let there be life and we're certainly\nAll Ezra Klein of darkness right now [noise] and I think every one of us each in their own faith communities are on the way\nTo find a way to bring some more light to that darkness Fisher that we love to hate rap I unfortunately I got to go to break 'em or we're going to bars and legislation do his job and we'll be back in a little bit with us [laughter]\n[noise]\nThat that a cat medical joint solutions center we often hear that Haitians wish they had done it sooner some people think that joint pain or lots of mobility and just a part of getting older but it doesn't have to be take pastor Michael rubber he was living with chronic knee pain for three years before he found his solution to cap medical\nMy experience with the surgical center at the medical and the joint solution center was actually far better than what I expected although I did expect that things would go well\nBut it was just a first class model of caring compassion such a friendly atmosphere my congregation pretty flabbergasted that was back in the pool bit at three weeks since having both of my knees now replaced there's not a day that goes by that I'm just not grateful that I don't have the pain and discomfort that I had for three years does\nIt hurt to walk and what are you waiting for Dan ... medical joint solutions center had for oh four or five oh one talk or emailing and talking to a cat medical ... today\nKnow that everyone has their own taste and jewelry especially when it comes to engagement rings\nThat's why Shane Company carries hundreds of fresh and current styles that no other junior has already signed team collaborated with the top jewelry innovators around the world to create original and distinctive styles\nExclusively for shame company many other ... carry the same designer names with all the same rings which by definition means they can't be unique and they charge you forty percent markup just for those names\nLot of data is a ... yeah yes it's a a protein prostate specific antigen and uh the higher that gets the more\nRisk that you may have is having prostate cancer although it's a very non specific test at times and many times we see PSA that blood tests being high and there's no cancer and many times\nWe see it a little low and there could be some prostate cancer so that the exam the blood tests and there are some other new blood tests that are out and there are some other X ray studies like an MRI at a press that can be help to see whether there is anything going\nIt can MRI of the prostate that can be helped to see whether there's anything going on and that's some of the new technology that's developed over the last few years uh but if there's a family history or there are symptoms then you probably should be checked to younger or there's been debate or in the literature about whether or not\nScreening is significant or is helpful and it's gone from yes to no to back to maybe and I'll tell you the truth when I first started process of a urologist in Nineteen eighty eight in private practice\nThere was no such thing a PSA was just being developed and we were seeing most of the people during my residency when PSA before PSA came in with prostate cancer it had already spread\nAnd then for once PSA came out it was very rare to see somebody with prostate cancer that was a stage for prostate cancer because people were finding it early over the last few years when they stopped the screening and the government said not to do screening we're seeing more and more people coming in with advanced prostate cancer so\nI think more knowledge is good\nWeek a debate about the cost efficiency of it but for the individual if you know that you have it and you could treated early or you have a much better chance of beating it\nIs that helpful\nIt is like All right Lynn thanks Lance thanks for the call I take care of you to\nSorry so interesting when we talk about prostate cancer and you mentioned symptoms in the symptoms usually aren't prostate cancer because God Forbid you truly have symptoms prostate cancer you probably have late advanced disease most of the symptoms are likely related to the ... the so distinguish the two\nAnd then maybe talk about that much more common condition and what can be done and the newer things being done for it\nSo I always talk when it comes to cancer many times uh I refer back to the Simon and Garfunkel song silence like a cancer grows usually starts growing very quietly and there are nice\nAnd easy if you did it which song\nSound if our All right do you try to put me on the spot\nYou know I Know it's like you run and not you have to go there I normally test everybody when I play a little feet as an opening song and one of the segments if they now and I don't do very well with that one but not as good\nSo anyhow so usually cancer is silent and that's until it until like you said until the show symptoms and then it's more advance so um [noise]\nIn terms of a benign prosthetic aperture feet when it's when you have an enlargement of the prostate many times that also could be following you could have a big prostate and not have symptoms\nOr you could have a smaller prostate but if it's growing in blocking the channel you may have symptoms so symptoms of of of prosthetic enlargement could be a weaker flow\nThe urge to urinate getting up at night more commonly or the feeling that you're not in the near bladder as much those are symptoms of a some sort of prostate issue but\nSome of them are obstructive symptoms like a week slow and some of them are irritate of symptoms like the urge to run to quickly to the bathroom so those type of symptoms have to be differentiated and evaluated separately\nAnd and and the ph has no correlation with prostate cancer they are two completely separate conditions\nCorrect so people could have an enlarged prostrate what a lot of symptoms\nAnd that can be treated a prostate cancer may have no symptoms so uh it's just like somebody being taller or shorter somebody having a bigger gland or or a smaller thing I mean and then one is malignant and one is benign like you said BP agents benign ... who has to be treated if there are symptoms\nSo early in the show you were talking about you know\nKind of while you're still doing this after Thirty years is that there's still a lot of exciting things happening and among does just that exciting things you were talking about where less invasive procedures ways to save patients and and and you know have better quality of life\nSo I think some of those things where BPH related because when I was in training by far and away the most are cake thing that I ever saw in my training\nOr why as a patient being treated for BP age when the old technology or a technique was going through the urethra and literally shaving\nDown the prostate was pushing into it and it was bloody and horrible and I know it's still done to procedures called a term but done much less than it used to be\nCorrect so they ... the late ... late late person may call it the wrote a routine but basically it's sort of like having a\nA miniature little a scope with a back home on it and it basically spread back home if if they don't describe that to your patients no no I don't know I got out of it but I'm trying to give you the I get it I can try and give you the picture it looked like a little a little uh scooper and it's it it basically a re sex or the prostate\nThrough the urethra ah that's not done as much because there are a number one there are medications that can shrink the prostate or medications that can open up the channel\nA little better and they're also a less invasive uh techniques that involve a that that can be done in the office in an outpatient setting that if if those proceed\nOr send an outpatient setting that if if those procedures work it avoids the the more invasive procedure TYP\nI Know I mean can you give me a sense like you know when you came into practice you go back twenty five years how many Turks where you're doing then you know a month or whatever and how many do you do now\nSo when I was going into practice that was probably the most common procedure we were doing there were no drugs to shrink the ... we didn't have the same type of\n... a medications to open up the channel that or a specific for the urinary tract that we have today so we were doing that for you know every week we were doing a few procedures a week today we were not doing them we're doing them a few months maybe\nBecause we could do these less invasive procedures\nNow and now when you were talking about some of the you mentioned some names resume you're a left are they related to BPH or they treating other ... other bladder issues\nYou know they they treat BPH so the euro lift as a basically it looks to think of it as almost a a\nLittle spring it's not it's not a metal spring otherwise you would get that he would form stones on it but it's basically a\nSpring that opens up it takes the two lobes of the prostate in and spreads them apart and it's it's basically is a mini implant and if it could always be removed a respected if possible so sudden outpatient it's done it either in is usually done in the office and the little station or some local anesthesia\nAnd ah they're cutting you're doing is recording treasury which really goes in through the ... and the resume is like that it is using a water vapor esteem esteem energy that heats up the prostate and basically\nThe nature of some of the protein and by the time the catheter each eat these ... this that procedure you need to work out for for a little while\nAnd once the catheter as remove some of the swelling goes down then you could you urinate better and again it doesn't preclude doing anything more invasive but it's certainly worth a try uh to prevent the more invasive\nProcedures so it starts it starts with I'm I'm guessing they started just behavioral teaching right in terms of somebody who symptomatic like maybe drink less at nights you don't get up at night and then eventually goes to drugs\nCorrect but if it's just getting up at night I wouldn't necessarily say that BPA to you know there's many many women who get up a lot at night and they don't have it\nBut if they had a bigger glands so what would be the specific ... it's not just glance size that make the determination\nNo it's the the so you may you may they may need to to check the residual to see if they're\nNot in the in completely they may have a test called the your them is to see if they're having high pressure avoiding it's just like sort of when I explained to patients when they go to the heart doctor they have an EKG that measures how strong your heart is pumping if the bladder has to work really hard to get all the urine out then they may have a degree in obstruction\nSo everybody's got as we get older are probably gets bigger ... correct most everything yeah like our noses in our ear lobes right I mean just things change in our body ... it gets bigger and by just getting a bigger profit doesn't mean you had BPH for BPH there has to be a you're a dynamic has backed\nBPH everybody gets BPH even if the press it gets bigger you have BPA that doesn't mean you're you're you're symptomatic that you need to treat it if you got us they've got to get that means the process of getting bigger\nBut in terms of whether or not you need an operation it's only if you're not emptying or your flows weak or you're having significant symptoms that are affecting the bladders with the kidney that you'll need to treatment of the BPH\nGot perfect I we're going to break we will be back to one last chance to ask doctors this ought to question you'd want to call stay with us\n\n\n[noise]\nOr forty nine and a cooling carrier Debbie likely twenty four hour traffic in our earlier crash anybody found out how we treat Seventeen Marshall ... cleared but still falling out on the eighty five and nine eighty five as well earlier crash police on north not hourly before I twenty on each side also cleared\nBut someone you back to Boulder crashed earlier crash on the Southside Seventy five thousand bats and birds passing moved over to the left shoulder but that really work still a problem Seventy five north down blocking free for writing range from ... up to the north live", "year": "2018", "show_name": "no_show", "city": "Doraville", "day": "28"}