{"month": "10", "state": "GA", "station": "WSBB", "content": "Attention all authors page publishing is looking for authors have you read a book and want to get it published page publishing we'll get your book into bookstores and for sale on line at Amazon apple I do and other outlets they handle all aspects of the publishing process for you\nBringing ... publicity copyright an editing go eat under advisor or one thirty six eighty nine now for your free author so they should get that's eight hundred times or one thirty six eighty nine for your free author somebody should get again eight hundred bonds or one thirty six eighty nine\nAnd when you asked me about ... er Cox media group station [noise] twenty four hour news weather and\nFive and a um\n[noise] what is\nAt eleven o'clock I'm Jennifer craft that live in the u._s. be twenty four hour news center would tell us the top story this hour the Senate majority leader is taking a first procedural step towards the vote to confirm Supreme Court nominee Brett Kavanaugh to saving the set of\nWill receive the results of the F a supplemental background investigation\nOf judge Brett Kavanaugh\nMeantime Atlanta connection to the Kavanaugh story ws beach Chris Chandler report the metro Atlanta teacher has caught investigators attention\nIt turns out the man nicknamed squeaky immortalized on Saturday Night live last weekend is a middle school teacher in Roswell\nAnd the Atlanta Journal constitution reports Lana academies social studies teacher Chris Garrett was interviewed by the FBI this week as part of that new capital background investigation Christine Ford says Garrett introduced her to cap it off he's already told senators though he has no knowledge of the alleged assault Garrett\nLabs and adding Dallas states right now Seventy three degrees in Atlanta scattered clouds tonight low sixty seven mostly to partly sunny tomorrow high near record Ninety degrees Atlantic most accurate and dependable forecast is coming up\nAnd eventually they didn't apply to South Carolina ... lease officer who what where do you think was killed during a confrontation with a man who help children hostage as he shot seven law enforcement officers city of Florence spokesmen say the opposite their parents care way was fatally shot tonight conditions at the six other one did officers have not been released\nFirst first this is double you ask me twenty four hour continuing to talk of the\nAction is she was just a moment and inches away from being killed now it could be ... comes report the young\nAway from being killed now it could be ... comes report the young labeled and woman is thankful to be alive and thankful for the county police officers who saved\nHer twenty four year old Jessica Adams says her boyfriend twenty six year old James Martin was furious after they broke up it come to her house for blood\nIt has to kill me when I open the door\nOpen the door\nAdams as Martin opened fire killing eighty year old Jimmy ... he didn't help Jessica under seven year old daughter hostage swat officers got inside as Martin put a gun to the woman said and then the officers opened fire Martin died in a hail of bullets really\nThink that they live in Cobb County ... W. S. B.\nArguments were heard today on whether or not to release a grand jury testimony in the Nineteen forty six lynchings at more for bridge considered one of George is most notorious acts of racial terror the AJC Brad trade with in the ... circuit court of appeals today what\nWas quietly powerful in in the courtroom was the descendants of one of the victims ah his name was Roger Malcolm weren't in the courtroom listening very intently to these arguments and you know they're still looking for justice and to understand what happened\nA decision by the three judge panel could be several months away ... eleven how to treat these brought you by coal ray and bright box\nAre you scared of the the one just before your lights go out who knows how long have you be sitting there and the dark it's automatic backup generator kicked saying as soon as your power crashes but you need to produce a design your system generators or not one size fits all\nSo get your free system design and has meant when you called ... box electrical and I'm David Baker might experts who never leave me in the dark right box electrical get up to one thousand dollars off in two years maintenance for a limited time called black box electrical and don't fear\nThere are a lot of companies out there but only one in Atlanta that has been in business for over sixty years and that\nHeath tree service whether you need tree removal or tree pruning work done our certified or births are experts in all aspects of tree care\nIf you're looking for quality professional tree care call heath tree service or find this on line at he tree service dot com [noise]\nThe following message for monster contains multiple uses of the F word it may not be suitable for younger audiences and those easily offended\nFree it's a bad word that a lot of job sites use and it's creating a lot of noise you know those sites they tell you a free posting we'll get your small business qualified candidates and then the candidates you get aren't the candidates you want so they aren't free because you end up paying a lot\nOr there are those other sites where you post your job in the same environment as someone selling a human sized hamster wheel or were qualified candidates can't find you because you're jump post gets buried really quickly way deep down at the bottom of the site\nPosting her job on monster means you don't have to post on those sites because we don't do any of those things we deliver candidates and qualified once monsters job posting started just forty nine dollars no hidden fees no relevance Kennett matches now having to re posted for ten minutes\nOnly the candidates you want delivered easily at a fixed affordable and honest price visit monster dot com slash radio to learn more and cut through the noise\nHere sort of take advantage of Georgia powers refrigerator recycling program if you've got a working secondary fridge reprise you were in your home called Georgia Power they'll pick it up for free you'll get thirty five dollars and they'll recycle it they didn't environmentally friendly way learned more George power dot com slash refrigerator\nLiking coverage of trafficking letters ... advertising\nCentered in it for a pair of travel advisories to watch out for on the Southside Union City I live south down ws began showing that crashed blocking three left travel lanes just before you reach highway one thirty eight Jonesboro road exit sixty four\nAll the right length anybody's crash that so the reason for your delays south of ... eggs in sixty six\nServers Street's gonna be an alternate to get back on to eighty five south as well also on the west expressway I twenty east bound crashed blocking two lanes just before you reach the eye to eighty five Northrop exit fifty one the few bright lights glowing just pass Fulton industrial boulevard exit forty nine Steve Winslow ws be somebody\nAsked me to start polish ... quitting to promote forecast for tonight a few scattered clouds early lows around sixty seven tomorrow mostly Sunday to partly sunny and near record high Ninety low sixty seven friday mostly sunny high Ninety low sixty eight Saturday mostly sunny Heidi lows sixty nine\nSeventy three degrees on the streets read it and he was Ninety five five and seven fifty devil us be depend on it\n[noise]\n[noise]\nDid you hear a Clark Howard show where it's about you and that wall of yours that Wilder yours I've got a new information for you and how much prices have dropped to whole foods since Amazon took it over that's coming up for you later\nAnd this shows all about you\nAmong us four years later and this shows all about you [noise] being able to keep more of what you may [noise] and you follow me Facebook dot com slash Clark Howard so there's a new law in California\nAnd this new law requires that all electricity in California the produce from clean sources by twenty forty five or twenty forty five you may say well that's like for ever from now believe\nIt or not not in the power industry that's not far away and it's really controversial and having a a government mandate like that is\nReally not my cup of tea because it causes distortions in the market but we do need\nSignificant massive reform and how we do electricity in the United states not necessarily for the clean air angle\nBut I think that's great to reduce the premature death 'cause of asthma and all that that are happening because of traditional sources of power but what about the cost\nCalifornia the nation's most populous state taxes was Texas third most popular second most populous they have both taken completely different paths\nTo cleaning up the air in their states in Texas has been able to do a two for Texas has dramatically lower the cost to power while it's going up and up and many other states\nWest Texas done that worked well let's draw third contrast the state of Georgia\nThat is doing things in such an obsolete\nAnd unfriendly way to the public and to businesses and it's the old fashion model where the power company is a monopoly in Georgia this company called Georgia Power\nAnd this power company does everything on a cost plus basis\nThe Moran cost overruns they have the more profit they make that they report to their parent company stock holders\nOkay well you know when we go to the recordings are really appreciate your information\nAnd the fees are low with both of them speaking fees do you happen to know your for three baby I'm always nervous when I hear somebody as for three B you happen to know what kind of expenses you're being charged on that and if you have a choice of companies even heavier for three B with\nNo I mean I could tell you the company named ... through ... through are you at work or university\nOh so ... is it CIA dot org\n... if you're cooking for years yeah go ahead and say it it's through lawyer\nOkay I'd have to look at that one but what I Want you to look at\nIs what kind of expenses you're paying on the plan to make sure that you're paying a reasonable amount which is less than one percent of your money being spent on the management expenses and overall expenses\nTo have that account by the way the Web address for coins is Q. oh I N s dot I oh not dot com you're listening to the Clark Howard show [noise]\nTwenty and the great barrier WSBIU twenty four hour traffic center\nSouth on crash I eighty five south down just before he retired in ... sixty four Jonesboro wrote\nIn a clearing stages off to the right still some bowling the latest one from ... in sixty six heading down to where the county also west expressway I twenty east outcry still blocking to left lanes by the two eighty five Northrop acted fifty one heading over from folding industrial boulevard state of the far right traveling with\nPolice and fire on scene Steve Winslow ws be\nNew long when you asked me Herman Cain is daily pure came perspective I Am going to ... filtered unscripted just fewer came I don't have to be politically correct every day he lamented the six I'm not that was held\nAnd Maine followed by the U.S be extended news at noon but\nOn the state the fat Herman Cain's daily fear came perspective every weekday and eleven did just a fun at lettuce news weather and traffic station is ... ... am seven fifty I guess the\nOutage alerts which ... ... email or phone you to help you stay informed whenever there's an outage just log on to your account and follow the easy steps to set them up to matter where you are you'll know when there's a problem I Know that George power is on it to get power back on started George power dot com slash storm\nHearing nagging little voices in your head telling you all the things you need to do this is David Baker checked just went off your list get your phone furnace to not done when it's cool right\nYou know done when it's cool re Korea super seizing their know breakdown guarantee what their credit up to two hundred and fifty dollars toward any repair if you're a furnished breaks down\nAfter your safety chicken tuna this winter just sign up for a cooler a cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also help get rid of all those voices in your head Korean carrier turned to the experts\nWere insisting putting your own for rent not for sale because there were only friends but not always fires friends if they do is foolproof recession proof and retirement plans [noise] rent just they\nDo the free market renters warehouse because lawyers [noise] changing Medicare beneficiaries now is your chance to get a will care\nOnly one Medicare Advantage plan designed to help you get to stay healthy getting zero dollars or low monthly premiums plus\nGreat benefits like free over the counter items dental and vision coverage get exclusive access to a large network provider pharmacy hospitals and special ed open enrollment and then we seven so don't blame let well can get news coverage and benefits you deserve on your journey to a better\nYou call welfare now sit learn more about your options at age seven seven to find here on nine to ... well care for G. H. dot com that's eight seven seven to five zero ... takes a\nFew more visit well care for G. A.\nDot com today will care health plan isn't H. M. O. E. P. O. P. M. S. plan with a Medicare contract\nEnrollment in our plant depends on contract renewable\nConsumer investigator Dale card well here I Want to thank you personally but the overwhelming response we've gotten to our investigation into the gimmick of leasing when they tell you everything is free to get a new air conditioning and heating unit all you pay is a small monthly fee I'm especially pleased to know we've actually\nEducated homeowners before they fell for this too good to be true proposition which goes something like that they say you'll never\nHave to buy a system again and for a small monthly payments they take care of everything here's what they're not telling you it's I'll leave by the time you're ... term is up it's possible you've paid far more than if you'd purchased it wants to stop leasing\nYou'll have to pay a big residual payment to buy out your lease and if you want to sell your home the leasing company gets to do a credit check on your potential buyer I'm especially happy to know we've prevented some single moms from falling for this extensive give it\nWants to see the facts check out my free research report on lie and fight heating and air companies that offer my make it right guarantee at ... dot com slash no lease\nMessaging database ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little sixteen months one hundred percent on line\nTo find out more text forward\nTo seven nine six four or five that's S. O. R. W. A. R. D.\nTo seven nine six four or five star to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs on line text forward\nTo seven nine six four or five that's that's a large W. A. R. D. to seven nine six four or five\nGood uh certainly for the latest developments of the cat and our confirmation battles tomorrow in Atlanta as morning news and the days we could talk Ninety\n... by the forecast ws\nFor asked for this or do you post a question for me at ... dot com producer Joe ask your question for you [noise] who's asked a question ...\nFatty did she says where's the cheapest place to get new lenses for my existing glasses I got a new prescription for them [noise] I Know this is\nWeird but it's cheaper almost always to buy a brand new frames and lenses together because in the industry\nPeople white to grind lenses into frames that are in their inventory that there are people are used to doing it some more specialized thing to take an existing pair of frames and put new lenses and them\nYou will normally have to go to an independent optician shop and have them do it and they will do a great job but it will be more expensive likely than starting all over\nArt and Justin says would asking for an increase in my credit limit on a credit card affect my credit score\nYes it raises your credit score you absolutely want to if you have been a good player of a credit card you want to periodically see if you can raise your limit because every time you\nSee if you can raise your limit because every time you raise your limit it lowers the amount of available credit you're using which is the second most important factor in a credit score and accounts for almost a third\nOf what makes up your credit score let me give you an idea if you have a credit line of five thousand dollars and you're using two thousand to that are available credit you're using forty percent of your credit\nYou got the credit limit raised to ten that two thousand dollars is now twenty percent of your available credit and gives you a big booster to your credit score\nOr in Bryant wants to know is at stake to submit your Social Security number to find missing money on the links that are on cork dot com as long as you're not\nAt one of the advertisers in Europe the real things that I write about you are missing money dot com you go to on claim dot org and then go to one of the state unkind property officers\nIt is a well as safe as it is anywhere to put your Social Security number but it is ... and it's how you move forward with the process of finding if there is any money hanging out there for you\nIf you don't put in the Social Security number you're basically going to be shut down for moving forward with getting the missing money\nThat is yours and remember missing money is free to use [noise] you're listening to the Clark Howard show [noise]\n\nContingent all authors page publishing as looking for authors have you read a book and want to get it published page publishing we'll get your book into bookstores and for sale on line at Amazon apple I do is in other outlets they handle all aspects of the publishing process for you\nPrinting ... publicity copyright and editing go eight hundred five zero one thirty six eighty nine now where you're free author so they should get that seat under advisor or one thirty six eighty nine for your free author somebody should get again eight hundred ... or one thirty six eighty nine\nIf you or someone you know is struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight that eight hundred three nine zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one call away eight hundred three nine zero nine five to eight make the\nExactly so do either of you have a retirement plan available to you where you work\nI Do I have a four O. one K. and hard about it\nBut they are very new there are only about a year old\nOh are you a police officer now oh because usually when I hear for fifty seven people are public safety workers to some guy\nI work with the public eye in a city bus driver\nOh wow okay yeah often do you have to call the police to come meet your on your Ralph bus driver\nNot not very often okay or usually pretty mellow\nSo is a bus driver do you have a pension you're going to get from the bus system\nWell if I had it started with the company years ago they had an Chen or that people that are more senior but for whatever reason they can hold can for any new hires\nSo you're on the on our own here okay\nIs that why you have it and not the job that\nCan show and I do not know what they offer a pension at the same I'm looking into that\nOkay well then what I Would like you to get doing is putting money in that for a one day\nAnd start with what you can if that's one percent of your pay two percent of your pay whatever number it is that you and your husband can still live your lives but you can start the habit of saving for retirement\nAnd then a year going to need to over the years whether you're working there working somewhere else with a retirement plan you're going to need to keep stepping up the amount you're putting in and normally if somebody is younger\nI talk about raising it one percent every six months\nBut when somebody's past fifty I Want you to step it up one percent every four months\nOne percent or more in line\nAnd I want to keep doing it you can't breathe anymore financially from your take home pay okay because you've got to get to where you're saving\nA significant chunk of your paycheck to build up a reasonable amount of money for retirement and in your husband's case he is no retirement plan available to them at work is that right\nNow he heard that work for the last four years and he just started a job he had had an injury\n... kept him from one day I'm really\nYou're a ... hour a day I'm really sorry\nYou know great partner or hear what it\nWill wait wait wait wait you been living as a couple and you've been able to keep things going on your pay\nSo he should say that and what\nWe had a battle captain going wow\nOkay so what's that means to me is that if if you will keep your lifestyle as it is is his pay starts to come back into the picture\nThat he didn't have as much of that as he possibly can and the Roth IRA or since these past fifty he's allowed to put sixty five hundred dollars a year in it\nAnd I would set out where you do your budget where every year moving forward he can put sixty five hundred ended that now that he's working again\nBecause you're in the need to keep stepping up ... percent of your pay goes into retirement and he's going to need to build up retirement\nAnd that's how you get it done even if you start you said to me is it to white it's not too late it's just the work you have to do is more difficult for him I'd like him to go look at my investment guy to cork dot com to see how they set up a Roth IRA\nAnd then start throwing money in it every pay period\nKale is with us on the Clark Howard show hello kale\nHey how are you great are you getting married I Am a little more than a year away\nAll right how can I be of help with this wedding coming up\nI'm I'm trying to go ahead and start looking at options for our honeymoon and we're both want to go somewhere tropical in the Caribbean and so I was kinda curious as to whether you thought a travel agents are worse you know giving or of course one channel found the ... with all this time of uh\nDepends on how much experience you have doing Caribbean island vacations\nNot much we went to grand Cayman or with their parents on us but you know and I'm planning I'm only twenty three so\nSo that's definitely a situation where you want the services of an experience travel agent\nOkay generally someone who has a C. T. C. designation certified traveler counselor they've gone through extensive education and continuous training to be an expert at helping plan your trip\nAnd they're not going to be as cheap as buying some package on the Internet\nBut okay this is your honeymoon and if you buy something that looked great and you get there and it's a disaster that's a terrible way to spend that honeymoon so are as cheap as I Am\nI Would say this is a case where you don't want to cheap out and ... you're a real advance planner Jim this more time\nBefore you really start trying to look at possibilities 'cause you're too far ahead for availability and for any sense of pricing\nAnd be clear what you really enjoy doing for activities you want to do scuba you know you said you went to came and did you go scuba diving there or snorkeling\nWithin within yeah oh so you're a license scuba on we went we actually went snorkeling\nOkay 'cause I think through the kinds of things you might enjoy you have plenty of times since he got so much time what if you both consider taking one of the dive courses where you live okay and then that opens up a whole different series of possibilities for your honeymoon\nOkay cause you enjoyed the snorkeling right right right nothing like being a diver\nThat's a much more enjoyable experience I've I've done dives doing something called snoop ... and I also did something I should not have done I did an unlicensed scuba dive I'm lucky I'm Alive now to talk about that [laughter] oh I'm getting looks I really did an unlicensed scuba dive\nAnd uh that that almost did not end with me still being with us I'm telling you it was\nNasty story but anyway it's if you're going to do a Caribbean thing there are a number of places you can go that that really brings the trip to a new level if you have this Google license or or you can do short of that and do this new but where you can go twenty feet down\nLow kinds but a but a a certified travel ... will really be able to help you plan it out\nReally yeah\nAnd it out really yeah\nSam is with us on the Clark Howard show Sam how are you doing\nGood so um my buddy well not Buddy Guy no recently coming out and get me to get disability insurance and I don't know if I should get it or not that my company does not have it part of their plan that would be a third party\nAnd what your body sounds like he's my Buddy Guy is I'm a big believer in people considering buying and maybe in fact buying disability insurance yeah because how old are you\nOn the eight so you got a somewhere close to forty years of working time ahead of you wreck\nStatistics show your three times more likely to become disabled during your working years then you are to pass away during your working years and was really terrible is he think about if you become disabled do you have a family\nYou know I'm Still a solo cello as a single guy who's going to take care of you if you become disabled mhm you have family that would take you enter they they move like no no no or to dress\nNo yeah they would I don't want to put that burden on them\nSo at twenty eight unless you're in a high risk profession yeah disability insurance should be pretty cheap okay and I like for you to do a longer waiting period on receiving disability coverage okay so that you lower the premiums\nAnd use your savings to ride through a period\nTill you get to where the disability insurance would kick in okay a lot of people think oh I don't need that yeah I don't do it without thinking Social Security will give me disability insurance right Social Security disability if you mess you are a relatively modest income earner\nThe Social Security disability payments will not give you a lifestyle to which are used to okay and it's hard in a slow process to qualify for disability insurance from Social Security so your friend is right\nEngineered solutions of Georgia and engineering solutions in Georgia and we don't sell products we provide solutions give engineering solutions of Georgia a call at six seven eight E. S. O. G. now [noise]\n\n[noise]\n[noise] yeah well you\nAsked me about ... er Cox media group station [noise]\nTwenty four hour news weather man from\nFive and I am\n\nNow [noise]\nGood morning to talk of tone is three o'clock I'm Dale why live from the U.S twenty four hour news center there are new developments from Washington DC I'm a screen court nomination of judge Brett Kavanaugh do pre to point with\nSenators ready to review FBI information put together in recent days majority leader Mitch McConnell set in motion a plan that would lead to a final vote on judge Kavanaugh on Saturday or ...\nOr ...\nNomination of Brett Kavanaugh ought to be an associate justice of the Supreme Court\nOf southern cloture motion of ago for the covered all over the ocean\nAs the pressure mounts on three Republican senators Collins and Murkowski or on my blog W s a radio died um\n... three oh one sixty nine degrees that'll be meteorologist Kirk ... predicts clear skies overnight with those in the mid to upper sixties sunshine Thursday highs around Ninety Atlanta's most accurate and dependable forecast coming up\nFollowing an armed confrontation with the suspect holding children hostage in Florence South Carolina one officer his dad's six others are hospitalized ... suspect is in police custody\nFirst first this is double you ask me twenty four hour continuing\nThat will be ranch raised Pete combs is learning more this morning about that deadly Cobb County swat standoff\nTwenty four year old Jessica Adams has no doubt her ex boyfriend twenty six year old James Martin intended to kill her and her seven year old daughter you'd already killed her eighty year old grandmother Jimmy screw I\nBang bang bang and then in a moment Adams figure would be her last\nAnd then in a moment Adams figure would be her last the SWAT Team rushed in\nProtests sometimes had and what I Know that that's I think came in and start flying right\nMartin died in a hail of bullets income county peak combs WSBIU\nAlpharetta police filed charges against one of the two main street racing on Haynes ridge road from a traffic light both cars quickly reach speeds and access to Seventy miles an hour the arresting officer eventually caught up to Anthony's wants the\nOfficer was able to pull up beside the driver and yelled at him to pull over\nOfficer Howard Miller gels channel to action news\nPeople could lose control of the car and either hit the other driver run off the roadway themselves or somebody totally not involve\nSlump has been charged with racing and obstruction the other race or got away are you a baseball player is no longer a part of the diamond dogs program\nThe University of Georgia dismissed senior first baseman Adam sat there from the team following the school's equal opportunity office investigation\nSat there just missile comes after alleged racial slurs directed at freshman quarterback Justin field that took place during the bulldogs home football game this past Saturday against Tennessee had football coach Kirby Smart earlier address the behavior as unacceptable ... W s the\nAmerican the wild card games and the books Yankees beat the a seven to two that sets up a match up between the red Sox and New York and Boston for the American league division series in Los Angeles the Braves open play against the Dodgers Thursday died in game one of the national league division series\nI don't want our team about five reinvent ourselves we are who we are so\nBrave manager Brian ... says young roster can keep their bright lights the post season in perspective Mike ... has never been here he gets the pitching start you didn't lose the Dodgers back in July LA throws a huge in were you at the Braves first time to face them this year the Braves sticker knows the Dodger challenge there is such a deep the\nSolid flash playing really well first\nPitch eight thirty seven tonight ... started USB\nDo the rest reduced time three oh for\nBusiness owners that professionals face special challenges in divorce court\nIn addition to everything else going on they have to contend with allegations that they're earning more than they are coupled with claims on their business or practice itself attorney CPA joke or Dell ineffective defense often hinges on sophisticated strategies strategies relating to income tax projections\nBusiness valuations spousal support claims\nClients with assets depend on their divorce lawyers skills in these matters and that's why it's so important to hire someone that has those skills\nContacted domestic litigation from of course the Ellen Cordell to schedule an appointment with one of our firms had Lana area attorneys a partner men can count on for\nZero four seven nine three zero zero zero zero online at Cornell Cornell dot com that's Cordell Cordell dot com offices in Sandy Springs Fayetteville Lawrenceville and Marietta Cordell in Cordell one Glenn parkway northeast sweet nine Seventy five ... Georgia three zero three to a\nDoctor I see patients every day who are losing their vision and independent to age related macular degeneration also known as a and B\nIt's the leading cause of blindness in adult fifty finding older some of us aren't greater risk for AMD if you have blurry vision or blind spots they can be symptoms they indeed left untreated it can lead to blindness\nThe good news with early detection AMD can be managed with affected clinically approved treatments that can reduce or even reverse some vision loss\nLearning that you have a and B can be scary but there is hope\nThe foundation fighting blindness researching and developing treatments and cures for AMD to get you know free AMD information packet contact the foundation fighting blind was today one eight hundred line for one eight hundred blindness joined the fight against a and B because to gather secure insight [noise]\nCouple of us do sign three oh six liking coverage attracted whether it's the winds blow Donald us read twenty four hour traffic center report\nNorthern suburbs we go I eighty five north and south on land restrictions north of handled a middle road ... at one twenty causing a few break what's the globe as you're going between ... and barrel ... used to just be mindful that also for the north which he ended up you must be kept him still left lanes were blocked in four hundred dollars going by\nMcFarlane parkway age of twelve having a ... one north bound and south on heading down toward Wynwood parkway and also Seventy five north and south on a bar to kind of used to have a pair of Lance block in both directions by red top mountain road to it to\nTo eighty five this report brought you by the ... foundation which invite you to take steps for cures walk events near you get started at CDC take steps dot org Steve Winslow ws be\nPossible yes we're all just started college what it might as well jak dependable forecast overnight mostly clear lows sixty six to six to nine and for Thursday mostly suddenly the partly sunny and ...\nSixty six sixty nine and for Thursday mostly Soviet apartment near record high ... low sixty seven fraught emotionally Hi Nadia below sixty eight Saturday mostly sunny ... law about sixty nine\nSix to ... degrees on Peachtree Street at Rio seven ... seven fifty doubled us free depend on it\nWould do the show [noise] have you ever had discussions with anyone ah besides your attorney\nOn how to take a polygraph never and I don't just mean counter measures but I mean just any sort of tips or anything like that [noise]\nNo I was scared of the test itself that was comfortable that I could tell the information and the tests reveal whatever it was going to reveal it didn't expect it to be as long as it was going to be so it was a little bit stressful\nAnd you have you ever given chips or advice to somebody who was looking to take a polygraph test never\nNow see when when Rachel Mitchell as that question that stuck out to me because I thought that the oddly specific question to ask somebody um\nThat's very odd to me and so a ritual natural who\nI Am she's has impeccable credentials and you're supposed to believe all women except when you know there Rachel Mitchell [noise] um I I thought it was so odd that she actually sat and they're always stuck in the back of my head and I even remember when we came back\nThe the first show that we had after the testimony I said since I'm briefly about it but I thought you know maybe she's just covering all of her bases it's just so weird\nThat she would have asked to that but is it is it weird though I mean the woman's now she calls herself Dr Ford she's you know doctor I just thought you know I don't know it was it and I'm Wondering delve into that because that's now a huge thing welcome to the Sean didn't lash idealized on Twitter official Dana lash on Facebook and I'm\nI'm let me just\nLet me just I'm going to go back to pull this up and I'd like to try to get her on everybody knows ins dependent right everybody knows Glenn Reynolds everyone should also in Oakland's wife who is a psychologist a doctor Helen I mean she's written books about it\nAnd she actually she's a psychiatrist excuse me she has\nSo tad low tad\nLow you think I'm just saying he said he was an undergraduate when Kavanaugh was in New haven and that he says I was an eye witness to a shocking ceremony taking place or inside the a decay fraternity house involved a cheering frat brothers watching\nA a a prostitute essentially and he says I Can't say for certain that judge Kavanaugh was president but he was all during that time\nOkay and what the\nHell and then senator Coons publicize is this an act says oh well look at this he literally said I Can't I don't know that he was there but you know he was at Yale wow good\nHeavens it's one of the stupidest things I've ever heard oh and then Michael ... new accuser says that Brett Kavanaugh I'd put quite loads and punch and I'm like\nThat's not how quite lose work I don't even know anything about ... but I Know they're in pill form right I think you would notice that they're floating in the punch wouldn't you\nIf you go to these pills here for ... for it I don't know if we're going\nTo discuss that as well and then um we also ... we all are also going to take portions of the White House press corps or the the press conference a jumble now he's talking about the decision to pull the United states that have the Iran treaty ah but\nI'm also you know Sarah Huckabee Sanders is going to be taking questions on Kavanaugh and we will roll with that when when it takes place so I'm as we get rocking on we have quit five on the way\nOh we have a lot of stuff where a lot of ground to cover today as well as we get rocking super beach is going to help you with all day energy it's um\nIt's gonna it's just it's going to help fight fatigue just take that just take it my gosh what are you waiting for just if you I mean unless you want to suck down monster energy drinks and all that garbage go right ahead\nA but a beach are loaded with nitrates and safer because this Patton to dry and process to condense everything down into a powder there especially growing non GMO beach he destroys nitrates this whole process is the way to preserve the full concentration\nAnd it gives you a natural energy without the need of a stimulant or processed sugar it's it's actual healthy energy where you don't get the ... and you're not gonna\nCrash and all that stuff and it tastes good even get mild Barry flavor or black cherry just called eight hundred six six four fifty six Seventeen or visit Dana's beats dot com find out how to get a free thirty day supply of super beach in for\nAnd as the dot com find out how to get a free thirty day supply of super beat and free shipping with your first purchase eight hundred six six four fifty six Seventeen Dana's beats dot com\nI always had to the range with ... but it's amazing how fast you can go through all those rounds there's nothing more aggravating and having to stop and reload everything when you get into a good read um you know when you find your focus and concentration and you're\nJust really on top of acquiring your target and you want to get right back into it instead of having to stop\nAnd ... ministry to work and what I call it\nTake a look at your old speed letters and be honest about it they look lane compared to the ATS letter this is literally the fast this letter in the world and if you doubt me for even a second you got to go to ... dot com\nAnd see the video for yourself for thirty bucks it's the best money you can spend on the range and I'm telling you from personal experience once you have this ATS letter you're never going to lead the same way again load on the whole mag in less than three seconds\nGo to ... dot com that's love max ask dot com and east promote Dana for free shipping low ... dot com\n[noise] usually when you ask me when they were breaking news first and accurate than from the voices you ... twenty four hours on he was not he by five AM's feminine Jaffe double you asked me\nIf you need a rate may apply guys isn't the time you stepped up your game in the gym in the boardroom and especially in the bedroom American men are getting saw we have left off drone that our fathers leaving left in our grandfathers we owe it to them and ourselves to fight back\nWith alpha king for Boris Becker it's never been easier just one small bill a day for a serious boost in total testosterone alpha king is on the right to GNC but you can claim a complementary bottle by texting cop\nTo eight or nine eight or nine more lean muscle from your workout more energy to power through the day and more passionate drives or you can rule the bedroom\nIt's no wonder thousands of men across America trucks Albert King to fuel their performance just tax cut up to eight or nine eight or nine for your complimentary bottle of thirty five dollar value respond in the next ten minutes for your you have to also smack bottles score our number one performance libido an answer\nThat's the UP to eight or nine eight or nine\nKnow\nYou worry liturgy\n\nMemory serves the\n\n[noise] [noise]\nHello this is Joe Cornell at Cornell Cornell here a few quick divorce tips we provide our clocks one of the mistakes that guys often make and divorce is it to move out of the house simply because the wife told him to an often this was a mistake\nBecause it means that the ... in a position to be the sole parent do the kids it means that the guy has surrendered possession of assets potentially they're often records they leave behind\nThis is an important decision and gosh should make it simply because for a wife has pointed toward the door\nThe attorney said Cordell in Cordell worked at home and maximize their role in their children's lives\nContacted domestic litigation from of course ... to schedule an appointment with one of our firms had Lana area attorneys partner men can count on for zero four seven nine three zero zero zero zero on line at Cornell Cornell dot com that's Cordell Cordell dot com officers in Sandy Springs pay a bill Lawrenceville and Marietta\nCordell Cordell one Glenn parkway northeast sweet nine Seventy five ... Georgia three zero three to a\nIt's a whole big zipped up from David Baker brought to you by the home things at various job\nDid you know cock roaches can live without their heads week eventually ... did you know the roads to live for a couple of months without food and cockroaches have been found to be the top as much triggering allergens in your home want to remove the cockroach from your premises [laughter]\nThese ideas may help identify and seal off cracks purposes and hold these are places that Harvard ...\nMany of these holes and cracked just possible remember that cock roaches are attracted to reach the surface this election it makes your kitchen services or glean ...\nAnd Dr ... pesticides available to kill cock roaches I have found it easiest doing trust a pest control company what the job of getting rid of a cockroach infestation it ensures that you're not stuck with the hassle of sourcing and storing the pesticides and home\nHome picture based job job your site for how to do it I Want to try and who the higher valuable information on the Web\nAt the whole ... job\nHey it's Eric bond has to learn my radio show is now on three hours every weekday ... noon right here on several you asked me\n\nTo come over\nDanny ... all over ... over nation being their show\nLindsey Graham says the midterms are now that Kavanaugh [noise] and that's true to a point I think the media is determined bound and determined to make it about\nA identity politics and when it which is why he's so focused its way he's so ... that's why they're there are so focused on that but the thing is and I got some polling to this effect\nI mean Americans are actually completely just done with the ridiculous ness that they're seeing over this they're absolutely done with it let's kick it into us some quick five showing\nThat flood producers quick five [noise] so there's two different people that I have for your first off\nPatty Hi camp is experiencing somewhat the same problems that Claire McCaskill's experiencing in Missouri this has not signed the castles hit because of the Kavanaugh stuff with those Heidi Heitkamp in North Dakota\nAnd it's heading south for her it had south right can't head south of Democrat hopes the any any chance that they have taken over the Senate so far uh at let's say it may not people are upset with the way her party is handling\nControversy in addition to that another falls out there's a Gallup one that's out as well [noise]\nUh that talk about how the most to the majority of Americans actually from the health majority of Americans want him to [noise] they want him confirmed sixty percent believe that he should be confirmed and there's been no corroboration any evidence and they're like absent that confirming absolutely\nWhen we come back I Sarah Huckabee Sanders is holding the first a White House press conference on the Kavanaugh issue and we're going to go to that because you know to just up the media are going to say [laughter]\nI was such a skeptic when I heard all of the my pillow commercials I mean some of my listeners might even remember me kind of making fun of them on air because I mean how in the world could a pillow be so magical it just seemed like ten years to make it\nThe day and I was given my pillow as a gift and it was a life changing I seriously want all of my listeners to own one because I Know from experience once you do you will enjoy better sleep instantly\nEnough that I and this idea of the process but in the path a little bit Central Park five he put out an ad basically calling for the death\nWhy they had been found convicted and even after they were exonerated he's still a basically said that they made the guilty and even as president he talked about um presided over rallies were ... they lock her up talking about Hillary Clinton so\nIs there a disconnect between when the president is interested in and do that for some but not ... you got it all\nThe president actually encourage or the Senate to hear Dr Ford testimony in the same way he encouraged them to hear a judge Kavanaugh says he is simply stating the fact\nThat we are a country of law and order we are a country that do believe that you're innocent until proven guilty and we want to see that process I go through in its entirety and it should be on a fair playing\nField I simply the only plant like okay yes that's are on the field and he yeah he does he feel that now we're back at a specific comment a day but that's\nEnemy because if the president has taken this modern day go ahead of president has taken this moment to say that he's the affected\nBy all of the allegation and he's picking and choosing just as the question was set to provide park fibers guilty and then he has made Bill Clinton's\nHe decided to change his mind all the special court by the ... they may be some interesting that\nYou bring up Bill Clinton nobody wants to hear those accusers voices be heard but you're certainly happy to hear all the other day go ahead and\nInterest is I don't have an email to ... go ahead no mom into them\nServe several times in the last week the president has tried to reassure voters\nPeople with preexisting conditions\nAnd go find that he's worried Republicans\nI think it's a sign that the president wants to protect people with preexisting health conditions I think it's pretty simple and he said that he supports that and he wants to make sure that that's not something that gets ...\nAnd ... let me go back to the uh [noise]\nPretty obvious the president was marketing crushing laws before last night he says\nHow did you get home I don't remember how did you get there I don't remember\nSeem to be on the light of the crowd there in Mississippi mocking her repeatedly\nIsn't there something wrong with the president of the United states mocking somebody was she was sexually assaulted seemed\nTo me that he was dating back to the doctor for herself a laid out in her testimony once again a\nEvery single word that judge Kavanaugh has said has been looked at examine picked apart by most of you in this room but not no one is looking at ah whether or not the accusations made her corroborated whether or not there's evidence to support them\nSince Mader corroborated whether or not there's evidence to support them every person that she names uh\nHas come out and said either they didn't recall it or didn't happen or they weren't there every single bit of evidence and facts that we've seen in this moment have supported judge Kavanaugh's case and the president simply pointing out the facts of the matter and that is what the Senate will have to use to determine whether or not they vote to support him or not\nOr some of our soldiers\nI think both Dr Ford and judge Kavanaugh all\nAre are victims at the hands of the Democrats I think it is absolutely disgraceful what they've done and exploited this process they exploit a doctor for their exploiting all of the women that have come out\nTo make any type of accusations this isn't the process that should've been done and certainly everybody deserves to be hurt but that includes judge Kavanaugh and that should be part of this process and the facts have to be looked at and I think you have to look at the prosecutors memo\nThose are where are you see all of those facts laid out I think she makes a\nVery compelling case though I tell them and plus I don't have any problems with food I don't have any problem stating facts know John ... I Know that you know then you probably do have a\nReally try hard when you don't see the first survivor for so long ago and has\nSet you Sarah ... to go on friday the president\n\nRally audience to see\nWhy they changed\nThe president still believe what is it\nOn friday that she was very credible\nAddressed is the number of times I'm the president also said she had a very compelling\nStory and nobody disagrees at the end and nobody orbit he disagrees with that but the president simply stating the fact that she laid out in her own testimony and that the prosecutor laid out in her memo at the end of the day the Senate has to make a decision on where they stand\nAround\nPresident believe that judge Kavanaugh should be confirmed he has a lot of confidence in him and he'd like to see a boat see that happen\nA couple of questions\nLincoln credibility ever claimed with how much time has\nThe individual needed them at all for all this activity scandal in\nOf the victim waiting decades\nPresident will\nClaiming abused but wait to come\nThat's just completely untrue the president\nHas supported again ah throughout this entire process\nDr Ford's ability to come forward and tell her story he's the one that order the FBI to do a background further supplemental background check or to look into each of the accusations and allegations that the Senate deems a necessary before making a vote\nUm he's also I have been more than happy to give a platform to the accusers that have come out against ... then President Bill Clinton\nI to say that he's never started with women is just ridiculous\nAll of a sudden cited that as a reason why even though he is calling for an investigation to\nAfter judge Kavanaugh has been in public service and in the public eye for over twenty six years been through six backgrounds investigation now part of the seven\nThat this is the first time you're ever sharing of any of these allegations the fact that all through all of those background checks now even an inkling of any of those things is ever come up despite the fact he was one of the top\nProsecutors for Ken Starr in in a major public position\nNone of these things came up when he was nominated to be on the federal bench none of these things came up he has been a public figure and there's been a lot of opportunity\nFor people to raise this issue and it never has and now at the eleventh hour the Democrats have exploited this process and done so publicly and it's a shame and he simply calling that out thanks so much\nSo\nI don't know if you could tell Sarah Huckabee Sanders is not having any of general Costas nonsense today did you hear how the brain that question well you know he was mocking dealing here with that do you want to hear the audio of what he actually said\nYou could if you wanted to say something about the town's vine I mean and then we can have a conversation about the town that was used to treat a Brett Kavanaugh if you're upset about innocent people being just marched right\nLet's listen to this was that that was the last uh last night before last last night yeah the ... at one of his rallies or listen this is this is what they're asking about I have\nOne right I Want to be\nWell you know I was wondering how did you get home I don't remember how did you get there I don't remember when I was\nHow did you get home I don't remember how did you go or don't remember when I was going to remember how many years you don't want to [noise]\n\n[noise] what\nWas it and I don't know where\n... where I don't know when I was younger and [noise]\nAnd I\nWas ... a man who lives just shut\nMe up so that I mean some people are mad because they said oh he's he's mocking her\nThat is what he's doing it's just so horrible why was he said that and I've seen so I'm seeing a couple of conservatives the ones that are desperately trying to find some kind of foot hold the ones that always well I'll say something about the administration after I say something bad about the administration's those individuals they have to they they are trying to show everyone how fair and balanced they are\nBut then they say something that I see so many ... especially a lot of them coming people doing this stop it you just it makes you look so bad to be honest if you don't agree\nWith that just say I don't agree with it if you agree with that say agree with it what was factually incorrect about what he said\nAnybody let's start without question what was factually incorrect about what the president just said\nNobody knows he's pointing out the inconsistencies and her account\nHe's pointing out the inconsistencies in her testimony\nIs point you're not the inconsistencies that are between the letter to issue the letter should that Feinstein had some of the ... the test at the um uh the synopsis of the\nPolygraph et cetera et cetera there's a lot of inconsistencies there and that's exactly what he's pointing out and maybe if the media many in the media they worked as hard at looking at some of these inconsistencies as they do a damn your book quote from high school with Brett Kavanaugh\nMaybe they would I mean maybe the president then wouldn't have to ask these questions instead of you know maybe depressed could do it\nSo I and here's something else how many people that were sitting on the Senate Judiciary committee mocked Brett Kavanaugh because unless there's some sort of damning evidence that comes forward this is an innocent man you all are trashing\nUntil one big never mind it's time to embrace the adventure and carving instead Gore being dot com is your one stop shop for all things RV camping rouse the different types of RVs fighter rental agent or dealer near you and compared to ... more more than sixteen thousand RV parks and hit\nNationwide have a plan you're being used for the trip to find out what you've been missing it Garvey ... dot com that's go are being dot com\nBubble you asked me about ... er Cox media group station [noise] twenty four hour news weather and traffic by hand am seven fifty\nTwo\nGood morning it's four o'clock I bought a cable line live from the ws me twenty four hour news centers\nAre more than he was complete\nSenate majority leader Mitch McConnell says the Senate will get the findings of the FBI's latest background check up and battles Supreme Court nominee Brett Kavanaugh\nWill have the opportunity to review investigator records\nAt as a standard procedure doesn't noted [noise]\nReduce your staff members what's required clearances will be all or a ... member\nLeader McConnell is also sort of cloture vote for friday the cut off debate on the cabinet nomination vote could come after that Richard chance to ABC News\nDo free to point\nAngered by run in with critics this week they attacked us at the browns shirt in Germany in the Nineteen thirties Georgia Senator David Perdue said Democrats will do anything to stop judge Kavanaugh\nWhen paid actors attacked my wife\nYou have gone too far\nFor doing other senators get the chance to review the Kavanaugh FBI filed today with GOP leaders aiming at a final vote on Saturday or on my blog W. S. U. radio died um Atlanta\nTemperature at four O. one sixty eight degrees doubled you ask me meteorologist Kirk says we could expect clear skies through the remainder of the overnight hours before sunrise in the mid to upper sixties\nSunshine later today hot highs around Ninety five is most accurate and dependable forecast kind of got what officers dad's six others hospitalized following an armed confrontation with the suspect who held children hostage in Florence South Carolina Batman is now in police custody\nFirst first this is W s me twenty four hour continuing new [noise] new details\nEmerge about a deadly swat standoff in Cobb County\nTwenty four year old Jessica Adams says her boyfriend twenty six year old James Martin was furious after they broke up it come to her house for blood\nHas land was going to kill me when I open the door\nThe door Adams says Martin opened fire killing eighty year old Jimmy ... he didn't help Jessica under seven year old daughter hostage swat officers got inside as Martin would have gone to the woman said and then the officers opened fire Martin died in a hail of bullets\nReally think that they live\nIn Cobb County ... W west ...\nStreet racing leads to the arrest of one of the drivers on ... road in Alpharetta Anthony's wants the and another man began they're illegal competition at a traffic light\nThe light turns green the two vehicles left side by side and took off with a higher rate of speed\nUp your Howard Miller tells channel to actually news got up to over Seventy miles an hour and the vehicles were still pulling away an officer eventually for slump see to pull over about the other driver got away slots he's been charged with racing and obstruction UGA kicks the student athlete off the diamond dogs baseball team\nFollowing an investigation from the University of Georgia is equal opportunity office the school now in Greece had football coach Kirby Smart who earlier deemed Adam fathers' alleged behavior as unacceptable UGA dismissed the senior first baseman from the team a Mets alleged racial slurs that were directed at quarterback Justin field this past\nSaturday and the game against Tennessee ... W s the\nAmerican League wildcard Yankees over the age seven to two that sets up a meeting in the American league division series between New York and the red Sox game one in Boston ... that actually division series between the Braves and Dodgers tonight in LA there's a preview from ws resent portray gets\nThe Dodgers plenty of postseason experience the Braves\nThe feelings of the play off the whole thing I mean this is this is part of the journey that we've been looking to go I embrace\nManager Brian snicker knows this is real Mike both individual find that out he gets the game one pitching start with this electric stuff against the Dodgers who you generally you\nAre there are big match up oriented team of whatever club they put out there really good so the regular\nSeason the Dodgers one spy for the southern games between the teams that good ... ... us\nBe ... between LA and the ATF ... at eight thirty seven you can watch it on the ... will be network\nWs me news time for all for\nBrian Kemp Stacey Abrams Georgia's future is in your hand follow Georgia's race for governor every day we got played Erick Erickson and the company's largest news team nobody covers Georgia's\n... and the company's largest news team nobody covers Georgia's elections like news not five Pan Am seven fifty do when you asked me and honest ...\nFight ... fight fitter wealth or is this the second issue the Georgia lined up late strike immediate opportunities in the Atlanta area for five ... long term projects\nExcellent benefits this is the best opportunity in Houston contractors are firing white you know all the dishes will be Phil ...\nGeorgia killing lined up free shot Georgia Joel lined up ...\nTom hello Atlanta it's Tom shame hey guys on roared and shame shame companies are direct diamond importer but some folks aren't really sure what that means it simply means we traveled directly to where the rough diamonds are actually cut into polished stone\nFor nearly Seventy years my family's been buying from ethical diamond cutters and ... Tel Aviv and then by\nThe world's three diamond centers hand picking the prettiest diamonds and then selling them directly to you there just aren't any other jewelers in town that do that by not importing directly other ... mine diamonds that have been marked up by a series of middlemen three four more times before they even reached their store\nAshamed company we eliminate all the middlemen am there mark ups\nAnd pass the savings on to you and because we offer the best value in town you will get a bigger diamond and they're pretty a ring whatever your budget has come to shame company a plan has direct diamond importer now you have a friend and the diamond business shame company in shank oh dot com\nThe information you need a new era Gary says five seven every day five\nYou asked me the ones who lived with ... Margaret now W Mr jam camp shows roadwork still continuing\nOn the album perimeter north side to eighty five west bound by a Seventy five globally Cobb County so state of the far right lane for new north side driving over\nToward cob parkway on the east side perimeter to eighty five self taught at West on all traveling is no open\nWork has been removed from the right length between twenty and flat shoals wrote also watching construction or continuing on eighty five north on\nAs a lame block going between highway twenty and Hamilton middle road north out south down they're picking up the battles heading down from highway two eleven this report brought you buy unbalanced dot org\nOr girl in Kenya dreams of becoming a doctor an elder and Guatemala dreams of being part of a community reach out to change their world and that will change your own unbalanced dot org Steve Winslow ws be\nPossible yes we're also for college what it might as well back when the forecast overnight mostly clear\nLows sixty six to six to nine and for Thursday mostly Sunday to partly sunny near record high around Ninety low sixty seven Rodney mostly sunny high Ninety low sixty eight Saturday mostly sunny high about Ninety law about sixty nine\nSixty eight degrees on Peachtree Street at four O. seven I'm our cable line news on me five five and seven fifty doubled us be depend on it [noise]\n...\n...\n\nBond houses are doctrine millions right now [noise]\nWe have more headlines news then what do you want me to start he actually we have even more headlines watch even more\nHeadlines than we did more headlines and now let's get a new level with\nEven more headlines ... October second show is missing\nSplitting\n... popularity is like that it's like a little as if the opens with champagne\nI Can't I Can't do that I'm In the ...\nOh that's great but are there any ... I'll do you think like a nice ... and then I'll do you do the ... the ant\nLiquor you split ... get\nA better one I just got a text from Pete you guys are related to [laughter]\nKnow with Pete program director doesn't like the show what he says to me is that settled a lot like the pod cast\nA\nThen I cry and All right even more headlines you have the the ah empowered female there and I'll go ahead and give me some a\nWarhead and I've got a new development for you a new develop and it's just breaking news yeah how could you hold his breaking news says you don't seem to ah well technically broke during when we were talking to Dr joke well I'm not\nGoing to break away from Dr Joe ... we can't do that at all unless you tell me the Beatles are getting back together and this is the gay why to feed at this point at ... indeed it would be [laughter]\nSo the FBI is interview with Brett Kavanaugh's high school friend mark judge has just been completed this one don't\nUnderstand about the FBI interviews why do we know every step of what's happening it's an investigation so why do we know that they talk to mark judge and why do I know that Dr Ford hasn't been contacted yet by the end why is that a news story\nAnt mount the thinking here is that the fire ants were waging war on each other and exterminate themselves number\nAnd it's we're waging war on each other and exterminate themselves number three more gasoline on the mound especially if you're a night it after you pour Warren is a this is not to say not smart not to mention bad for your yard and my favorite number for some\nOn more of a pianist you who hasn't taken pride and mowing a fire at that\nI'm not sure any of these uh work I don't endorse any of them but suddenly your idea\nThe home fix it pays dot com your site for how to do it ... to try and who the higher valuable information on the Web at ... dot com\nThis is ... a few years ago I realized that many of the happiest\nRetirees that I work with had several common habits in trade and I decided to explore those similarities\nAfter conducting the survey verified by George attack I was able to distilled down the money secrets of the happiest retirees and then wrote the book you can retire sooner than you think\nAnd it's now helped many people get their happy retirement plan in place if you like to learn the secrets of the happiest retirees please visit retire sooner book dot com that to retire sooner book dot com method you need everything they apply\nGuys isn't the time you stepped up your game in the gym in the boardroom and especially in the bedroom American men are getting soft we have left off drone that our fathers and even less than our grandfathers we owe it to them and ourselves to fight back\nWith alpha king from forest factor it's never been easier just one small pill a day for a serious boost in total testosterone alpha king is on the rise of GNC but you can claim a complementary bottle like texting cop to eight or nine eight or nine\nMore lean muscle from your workouts more energy to power through the day and more passionate\nDrives or you can rule the bedroom it's no wonder thousands of men across America trust alpha keen to fuel their performance just tax cut up to eight or nine eight or nine for your complimentary bottle at thirty five dollar value respond in the next ten minutes for your chance to also smack bottle a score our number one performance libido an answer\nThat C. P. to eight or nine eight or nine\nDo you hear voices those nagging little voices in your head the voice that remind you every day of all the things you need to do\nMaybe you've been skipping your twice yearly maintenance on your friend is an air conditioner not good\nIt's time to get that done right now and get back on track so cool ray is super seizing the wrong famous no breakdown guarantee cocoa right for your winter safety checking furnace maintenance you'll get a credit up to two hundred and fifty dollars charge any repair of your furniture breaks down this winter\nJust call cool re sign up for a three year cool All right cool care maintenance agreement and get a two hundred and fifty dollar credit with no service coffees anytime until march thirty first twenty Nineteen I'm Dave Baker the experts you here on my home fix a Joe or the ones you want keeping your heating and cooling system running right\nCalled cool re they get you faster and often the best warrant teasing guarantees I have seen in Atlanta they also help get rid of all those voices in your head Korean carrier turned to the experts\nFishing facts you probably are aware that follow fishing in the north Georgia mountains is as good as it gets nothing like good fall weather when you fish in a nice flannel shirt from El al bean or it could be a hand me down as one gets sold his fishing season gets shorter but they're always members that resonate in the summer when it's hot and the trout are hiding\nAnd the bad weather days when you're indoors by the fire\nFishing on the Chattahoochee is the most wonderful experiences and you never get enough in a few days I'll be getting a man of a fat which echo it with my friend Jimmy Harris on the chat a Hoochie last spring\nI've been wanting to catch a brook trout the only native trapped in Georgia for many years never could get official NATO my September calendar but for an iceberg wandering down to the damage ... just south of ... and I was in the right place at the right time when that ... percent goes up on the wall and we'll make Monday\nIn my mind that I can recall the details of catching the native broke on the Chattahoochee ...\nWhen it comes to your house you may have some questions and answers are as close as you're Kroger pharmacy just ask when you want to know how your medication or where your insurance for having your prescription or for any other questions you can rely on the experience professionals who take your health your Kroger pharmacists from\nTime to get your flu shot and talk to your certified vaccinating Kroger pharmacist most insurance plans except the day and no employment need just ask you a Kroger pharmacists today\nSharon Solomon here proud alumni at the University of Georgia and owner of Solomon brothers fine jewelry and I have an exciting offered to share exclusively with my fellow dogs all you have to do is mentioned this ad\nAnd you'll receive twenty percent off your in store purchases serve you bleed red and black like I Do come visit me and my family at Solomon brothers on the seventeenth floor of tower place in bucket on line that Solomon brothers dot com some restrictions may apply seashore for details and go dogs [noise]\nTurns out of a second\nI don't listen to W. S. B. to hear the tracks from David Byrnes solo albums I listen to W. asked me to get the facts still waiting for David ... he's not going to sleep but I'll tell you if anybody with a cruiser but this was not the phone it in\nYour in Atlanta\nFabulous Fox theater I Know it's been a long tour this the last show I've not only is the last show but I think we're toward the end\nBut a very long time\nI've seen a couple of these shows unfortunately in Dayton I was too far to the left or lost some of the shadow work [laughter] and I want that to happen to know you don't want to lose the shadow ... dead center tonight and I expect the best damn show you've done this year well that's me that's\nWhat am I got his problems that free thousand dollars on the door oh by what anyway Lindy uh lifting program I don't know what's going on with him so I started a few days ago we started throwing the rap word around\nThis is going to destroy the ability of good people to come forward because that that's crap\nNanny she took it up a notch was was this on CNN last night I threw the S. word\nOut there you know lightning working with President Trump to make the world a better place I don't give\nA male gloves or officer [laughter] you're trying to pick fights with everybody all of a sudden\n... steak entirely papal here again after cabin out Trump we need to buy a bag of when\nYou're an alpha male that I\nAm an alpha male I I Am sick and tired of your crap [laughter]\nHe keeps loved to fight our listeners 'cause I think some of our listeners called him a rhino\nI Am in your earlier today somebody with young ... whipped up my ... bathe him\nOn a hot yeah a a son 'cause like you know I got to be honest with you I don't mean to buy them at All right back off a little bit there Lindsey I I just ask you a question that's a yeah just it's a it's All right I'm Ray I know you are\nEnraged you said I bet interact raged okay uh well I ain't got that I've always thought of you is more I you know maybe even kind of a feminist I don't this is why do scientists this new alpha male Lindsey Graham is just kind of knew it on me and so it's getting used to I ...\nI Do that [laughter]\nI don't want to deny that I don't want to fight there's that looked like a girl no it's not as you please I don't need to look at that I think you need to look at I didn't need to see that you know whether or not you were a man or a comment on a smack you I'm not used to the new alpha male Lindsey Graham hardier crab [laughter]\n\nIt's a whole big zipped up from David Baker brought to you by the Olympics at ... dot com\nDid you know cock roaches can live without their heads ... week eventually dying of ... did you know the roads to live for months without food and cockroaches have been found to be the top as much triggering allergens in your home want to remove the cockroach from your premises\nWhose ideas may help identifying seal off cracks purposes and hold these are places that Harvard ...\nMany of these holes and cracked just possible remember that cock roaches are attracted to greet the services are wanting to make sure your kids in services or green ... and\nDr Walter variety of pesticides available the guilt got roaches I have found the easiest joined trust a pest control company what the job of getting rid of a cockroach infestation it ensures that you're not stuck with the hassle of divorcing and storing the pesticides and home\nHome victory based job job your side for how to do it was about to try and who the higher valuable information on the Web\nAt the home ... job\nThe Army National guard is committed to keeping the country safe and our community secure composed of hundreds of thousands of citizen soldiers from all walks of life the guard is always ready to respond to local\nOr national emergency we project the homeland and we're always there when called upon and in every state in territory\nStand guard for our community to learn more log on to the national guard dot com\nThe Army National guard thereby Georgia association of broadcasters on this station\nKnow\nYou must be diamonds for thirty nine are based on temperatures sixty eight Marta board is set to vote this afternoon on an ambitious expansion playing with a price tag of almost three billion dollars\nShe just expansion plan with a price tag of almost three billion dollars have\nLand to have to switch their cultural mentality from this car centric culture that we have\nAnd Georgia State Urban Institute researcher Chris ... says private partners do need to step up to be part of this especially the hope to add light rail to places like the belt lined\nUp I Need a dog with fiscally conservative Georgia Public policy foundation says depend on federal money and that private investment\nTo participate in a public private partnership on both pipe dream\nEdgar Craig it's W. F. B.\nAfter a unanimous vote for the Atlantic city council mayor ... bottom signs a bill renaming three streets that have been named after the confederacy\nReally is a model for how we can get things done and the city when we talk with each other they're not at each other Confederate\nNice Confederate avid user both be named United well could set a record will be named trust of old tree court after an apartment complex on the roads not clear when the new street signs will go up\nArguments heard Wednesday and whether a grand jury transcripts you'd be made public a divorce for lynching an eastern Georgia Atlanta Journal constitution reporter Brad trade says descended from one of the four victims travel from Ohio to hear those arguments\nThere was a real personal a part of this that this family is still seeking answers Seventy two years later\nWe have reported earlier those transcripts or only recently discovered that could shed light on why no arrest ... ever made and the notorious case a decision could still be months away so we're still arguing the mores Ford lynching it's for forty one\nNinety minutes until the our rock chest pain is a ... here this evening is seven or the including ten thousand maniac the catalyst Atlantic Conference began it'd be given an energy arena today or tomorrow let's check whether traffic now gets ready for what might be another record setting damn the monitor\nOn WSBIU meteorologist Kirk knowledge where they might as well as I couldn't dependable forecast overnight mostly clear lows sixty six to six to nine\nAnd for Thursday mostly sunny the partly sunny near record high around Ninety low sixty seven friday mostly sunny high Ninety low sixty eight Saturday mostly sunny high about Ninety law about sixty nine I meteorologist current knowledge ws be\nSixty eight degrees right now it's for forty two electric back in the morning time here's Doug Trimble\nWould clear up with a loud and that is what about how good that you're an avid walking up to three laid there all of I'd what he is wide open out of the western suburbs it's worked out construction\nJust clearing your one road was actually\nNot a whole lot on the west side and their lives to eighty five north downstate limit up from South ... I haven't even had earlier roadwork that's five left town right before I Seventy five had it at the ... out of the blackout\nDelayed free in DeKalb County to eighty five knows north about it no construction crews and your way headed between cutting down the highway and spaghetti junction well behaved west bound for four hundred terrible\nThat would that construction\nKind of got after a short break the fast moving new developments in the Brett Kavanaugh's confirmation process from overnight correct malicious a five day forecast it'll be planned through the weekend will you need to worry about a chance of rain ... nobody ... times for forty three\nJust like a rocket doesn't always take off your mortgage loan with the big national guys isn't guaranteed to take off either even after you spend hundreds of an application the hey folks in Syracuse and for the experts I use\nRight past mortgage in my research and personal experience I've learned that avoiding the big guys is the smartest way to secure your mortgage here's why the thousands of dollars and closing costs an application fees are shocking the rates you can do much better the personal service\nYou'll get handed off to five or six inexperienced people instill not know if you're approved inter right path mortgage no application fee\nNo closing costs the lowest rate possible Ninety percent closure rate and one experience loan officer partnering with you from start to finish\nPurchase re fi reverse or cash out followed them right past the savings called six seven eight seven zero seven sixty three hundred or go to a break path dot com to look at the two party whenever I'm going to last like seventies era late last hundred us we'll talk with you and I\nAn up and let area are you interested in making some extra cash\nBuying real estate tax ... the real estate and to actually\nNetwork is offering a free tax link yet that will show you how to use their simple three step formula and they're proprietary website to earn secured returns potentially up to twenty five percent it's so simple you can do this in your pajamas from the comfort of your own home just\nPoint click and start buying tax liens right through their Web site anywhere in the U.S and they're completely secured by the government so if you're lucky to become a real estate investor without getting dirty fixing up houses\nThen call one eight hundred five seven zero five three three nine now to get your free tax filing get than getting ready to buy tax\nLiens for as low as a few hundred dollars working only part time call eight hundred five seven zero five thirty three nine right now to get your free tax thing get plus two free tickets to a live training event which includes a free smart watch just for attending golly hundred five seven zero five three three nine that's eight hundred five states\nAttending golly hundred five seven zero five three three nine that's eight hundred five seven zero five three three nine for your free tax link it now individual results Mayberry\nAbused ... five five seven fifty do what you asked me\nThis morning news weather and traffic every six minutes\nThe top three things you need to know this morning we Scott ... or forty five never once the winter mostly to partly sunny weather do near record high of around Ninety two days those ... record was Ninety One we can hit\nAnd number two the Marta board votes today at a three billion dollar expansion plan that includes miles of new rail detractors stations and extending the street car to the bill lines\nAnd number three sort of a journey we're Mitch McConnell said the first procedural step toward a confirmation vote on Supreme Court nominee Brett Kavanaugh ABC's Eli Rogan reports beginning this morning there's got to see the FBI report the alleged sexual misconduct\nOne copy of this report that they're going to be able to review and shit going back and forth between Democrats and Republicans hour by hour until all senators who want to have you report hop had a chance to do so\nIn the background investigation delivered especially to the U.S Senate overnight behind closed doors in that motion made the move forward with the Kavanaugh lotion on a capital nomination for the Senate ABC's Emily rouse picking this up in Washington\nWe are now officially counting down the hours ... vote on Kavanaugh's confirmation and right now this morning it's still unclear if Republicans had the votes they need\nA late night motion and the Senate officially kicking off the county will crucial vote bomb calling cloture on judge Kavanaugh's nomination which brings cabins lifelong appointment to the nation's highest court\nOn the line the full Senate couldn't vote on his final confirmation this weekend that decision could come down to a handful of undecided senators including Republican Lisa Murkowski Jeff Flake and Susan Collins\nAlong with Democrat Joe Manchin someone\nOff for condemning President Trump's mockery of Christine Blasey Ford at a campaign rally how did you get home\nI don't remember how did you get there don't remember where it was so I don't remember Senator Flake on NBC I Wish you have to\nStay out of\nWork for a minute\nAfter spending much of the day Wednesday defending the president and it wasn't\nAnything other than the president said in fact the White House he's now debating the release of this finding sounds that FBI investigation as attorney for ... first accuser Christine Blasey Ford attach it to marriage\nReally think this statement saying a supplemental investigation that did not include an interview with her nor the witnesses you corroborate her testimony cannot be called an investigation\nWe are profoundly disappointed\nAnd senators will have a chance to review that FBI report starting at AT and later on that morning and overnight the White House saying that they are fully confident authentic well confirmed catch countdown\nAgain the cloture vote on friday I made the cut off debate that Saturday Jamie ... says he would not be surprised at all the Kavanaugh nomination goes to the floor of the entire us set up to this point you know the the vote count the built in limbo with a couple of senator still on the fence somebody must be do science for forty eight\nOnly five day forecast on a\nAddress and dependable on news Ninety five AM seven or eight of them you ask the right to buy and ready to pass management they handle bonds and here's ws the media relatives Kirk malice temperatures running\nTen to Fifteen degrees above normal as summer refuses to die quickly looks like most of us will stay dry the next five days as the un seasonable heat continues\nThrough the early morning hours mostly clear lows around sixty seven\nAnd for Thursday mostly suddenly the partly sunny near record high close to Ninety One low around sixty seven friday mostly sunny Hi Ron Ninety low around sixty eight Saturday mostly sounded partly sunny high near Ninety low about sixty nine my exclusive five day forecast Sunday and Monday\nMostly sounded the partly sunny Sunday or thirty percent chance nicely it's on the shower Monday ... Sunday eighty eight Monday poor lows sixty seven Seventy meteorologist Kirk polish ws be\nYour guy got up on my roof and took pictures of what he thought I had two holes in my room his seeming to picture I Can't engage in my house where they were I went down in my living room felt the wall it was much she\nMight have been leaking for over a year drip drip drip here insulation is kind of catching most of it by the time you're seeing it on your sheet rock it can be pretty significant damage\nFind problems with your roof before they really started to urge you get a free Ruth I now since its peace of mind for your roof\nAbout eighty percent of the free ... don't lead to recommendation to spend any money kid that peace of mind that we can offer you for free a free roof analysis from family roofing\nNo longer a plane his or her parents more Atlanta stand Stanley raising prove\nProve dot com\nYou ask me about ... Cox media group station\nTwenty four hour news weather and traffic\nOne is twenty four hour news weather man from\nFive AM's\nMe\nNow is five\nO'clock on Thursday October fourth time scotch laid welcome to Atlanta It's MORNING used us these top national stories we begin this new day Senate Republicans moved one step closer toward a confirmation vote Supreme Court nominee Brett Kavanaugh\nOf southern cloture motion for the for the government on all of a\nWSBIU manager mores reporting why the FBI is completed its investigation into the sexual misconduct allegations against the judge\nScott Senate majority leader Mitch McConnell sets up a procedural vote for friday getting all one hundred senators today to review the results of the FBI's investigation\nTheir shirts up numbers with a require clear up those will be all ... members\nThere is one copy of the report beginning at eight am Republican and Democratic senators will take turns reviewing it in our early shifts in a secure room now prior to the release the FBI report Georgia's David Perdue gave a spirited defense said the judge\nTo preach to point aggravated\nA democratic activists they attacked us with the brown shorts in Germany in the Nineteen thirties\nGeorgia Senator David Perdue lashed out at Kavanaugh critics who caused him saying it's time to end this debate\nTo put partisan politics and noise behind us it's time to confer judge Brett Kavanaugh to the United States Supreme court\nGOP leaders are aiming at a final vote on Kavanaugh by Saturday\nWSBIU Jamie ... reports the decision could come down to a handful of undecided senators including Republican Lisa Murkowski Jeff Flake and Susan Collins along with Democrat Joe Manchin all four condemned President Trump's mockery of Dr Christine Blasey Ford at a campaign rally in Mississippi this week\nReporting live with Jamie to pray Amanda Moyer ws state [noise]\nTemperature at five oh one sixty eight degrees I'll tell you how many record threatening days ahead in five minutes I'm W I was reading your all just her college\nOnly reopened after they were ill for several that attract or the construction ... I Wish you a lot of number one twenty six to leave\nTheir Adam rather than trying to think of the north and south and there was an altitude area there is for the rest of the freeways are speed limit from around it through downtown traffic every six minutes does are pulled obviously\nSomebody must be do Simon spy bow to this is this morning news here's Veronica waters of jokes about them\nAs it landed beliefs continue their search for whomever shot at Clark Atlanta student in the back of she was driving don't give us these Michelle writing reports lie the girl's parents are speaking out Veronica like any parents Michael\nAnd democratic were super proud that their daughter days you had it all for her first year Clark Atlanta then they're nightmare began early last Tuesday when word came that day she was shot [laughter]\nNobody's ever get that call in an interview\nWith channel ... news Dana says the Nineteen year old is now paralyzed\nThey're unsure at this point I Want to show them to walk 'em one just kind of wait ...\nDays until police the woman shot her in the back no word yet on a motive the suspect still out there reporting live Michel ...\nOf a hostage story leads to a real drug charges against a Cobb County couple it happened one thirty year old Andrew Douglas ran up to a woman in Marietta bank drive through and convinced her to call nine one one\n\nDouglas claimed his wife was being held hostage but when police got got to match me walk all they found were five pets living instilled and some pipes with meth residue police say the husband and wife were high attacked\nOn tickets feet to pay for police presence of big sports music events that's the idea from Atlanta city councilman reactions mixed on channel two action news if it's\nGoing to cause that get back to the city I'm definitely more apt to think we can keep paying the taxes that we have public\nSafety committee is studying this idea now the tax would be anywhere from fifty cents to a few dollars\nDoubled ESP used on five of foreign custody in Utah thirty nine year old William Clyde Allen after rice and poison scare involving letters sent to the Pentagon and White House\nABC's jak ... says it wasn't actually the process poisoning the intercepted letters into the field has made indicated that yes this could be rising however it wasn't rice and it was the thing that they make it out of which is the cash or be down as a navy veteran\nAnd Florence South Carolina they used an armored vehicle to remove seven police officers shot as they tried to serve a warrant Orange County sheriff can you build and test the gunman had the upper hand\nSo that was positioned is do fire was several hundred yards so he had an advantage\nOne officer died the gunman was arrested after two hour standoff\nOn American Airlines flight from Phoenix to Boston is diverting passenger who refused to stop doing Paula on the overhead compartment\nWitness to say the intoxicated man got belligerent and verbally abusive when the flight crew asked him to sit down the plain stop to Kansas City so we can be escorted off double the reduced on five oh five\nFive minutes after we are do forget the effects of alcohol double Kevin altitude when you're flying\nThe lord but springs up to date on whether in traffic now are going to get updates every six minutes so you always know what's front of you in the morning drive when you listen to this radio station ... we're all just ...\nWant to drive when you listen to this radio station WBEZ we're all just Kurt militias here he's got mine is most accurate and dependable forecast\nOr it's got forecasts for today it's mostly somebody to partly sunny near record high Ninety ... nights sixty sixty Seventy\nTomorrow mostly sunny continued on Sicily hot high Ninety low sixty eight Saturday mostly sunny high noon id low about Seventy recapping the forecast for today mostly somebody to partly sunny near record high around Ninety yesterday was eighty eight currently at sixty eight on the street I meteorologist Kirk polish W a space\nLet's get back to the morning drive now here's the terminal\nLook at the dark as well to do when you get there but like Alex Seventy five northern down down down down road exit number when you buy that looks like most of the go up there it is\nModerate and Seventy five at five Seventy five are cleared actually pressure for to get to know\nOvernight roadwork left on Georgia for hundreds of times people that ride headed down from old mountain park waited two eighty five and Sandy Springs northeast improving mark\n... Rasul could remains but I'll lanes now open eighty five shouted highway two eleven sluggish below that trying to get below shot to align heads up a DeKalb County new trouble eighty five south on the exit ramp too pleasant Dale road rivals trained comfort systems down include free liked him repair maintenance and service\nNo payments still twenty Nineteen visit reliable air dot com for more info this what rocky by reliable heating and air on WSBIU\nComing up after a short break ... kids in the postseason block amid the bright lights of Los Angeles for the Braves finally time for the playoffs tonight I'm W s ... edit update on the investigated got fatal shooting of this\nBill Walmart parking lot in just a moment nobody best reduce times five o seven\nCars\nCounseled explosions coming from the engine cars and SUVs engulfed by\nGiving it the last\nWord letter gyms Puerto were record what we discovered them other companies recall some cars they got the\nFeeling of orange will read them today and five\nYou can count on\nTo\n\nTo some of the structure is not down\nBeginning on channel two and ABC [noise]\nHey Sean Hannity here from my friends at runners warehouse and I'm here to talk about TNT that's top notch tenants people who'll respect your property they pay their rent on time\nAnd good neighbors to those around them out top notch penance so the key to making renting rock and you find them by partnering with runners warehouse once your property is in rent ready condition renters warehouse taps hundreds of Web sites they but thousands of potential renters\nTo score you top notch tenants in just a few weeks on average now they do walk through they do the thorough background checking credit checks\nThey assist with these documents inspections rental licensing everything that builds a solid foundation for a great relationship between you and your renters plus for one low monthly flat fee winners warehouse will manage your property twenty four seven\nTo keep your renters happy now there's no upfront fees no binding contracts and you can cancel at any time they have a number in Georgia for all for six six two twenty three twenty two renters warehouse great tenants live here\nBringing from Atlanta north Georgia and do around the world first and accurate than the game dumped analysis on the big story from those voices you trust and he was not he by by hand am seven fifty do when you asked me every morning do candid on\nTraffic update includes ... metro Atlanta in less than three minutes five o nine now are becoming temperatures sixty eight\nUpdate on August fatal shooting of still below Walmart parking lot the suspect is asking for bail\n... again this got on top of the morning Dr ...\nLook at our to the table is like just about all that real work is pick up their Seventy five down to read I'm not really the number two eighty five well after the break it down to the area and then nobody problems at all it's Seventy five beyond that out of five Seventy five working through\nThe lingering delays had a ... now and eighty five ... highway fifty three down to the paving project at highway two eleven below that you're in good shape traffic uber gestures that only eleven minutes to go between them all of Georgia in beaver ruin road actually ... four hundred\nEight team and it took time rolling out of coming on four hundred top on highway twenty two eighty five triple team Catholic telling us\nComing up after a short break here in Atlanta as morning News I'm do but he wants these ... comes in Cobb County where we're learning more about Monday's deadly standoff in ... and the massive bill to reauthorize the FAA may make airline passengers more comfortable\nA bill to reauthorize the FAA may make airline passengers more comfortable will explain after a short break ws reduce Imus five twenty [noise]\nYeah I kept traffic on the expressway great when my own it's called I'll be first in line I owe zone to baby well your first class\nRank ... are now open an identity by anti anything I don't get in the past and when you get to work tone or anywhere faster just ride on the ranch lanes peace pops out cost me half dot com [noise]\nEverybody wants to feel like they're getting a good deal that's why e mc security customers love their monthly rate from just sixteen Ninety five a month in fact for such a low price\nYou'd think you'd have to sacrifice service or quality not with the emcee security you get it all\nLow priced a plus better Business Bureau rated service lightening fast response and no monthly contract to walk us through what more could you ask for well for a very limited ... security will switch your service for free visit EMT security dot com or costs seven seven o nine six three zero three zero five to get started\n\nCommented you [noise]\n\n[noise] [laughter]\n\n\nDo hear nagging little voices in your head telling you all the things you need to do this is Dave maker check just went up your list\nGet your bowl furnished do not done which cool re Korea super seizing their know breakdown guarantee with a credit up to two hundred and fifty dollars toward any repair if you're British breaks down\nAfter your safety check in tune up this winter just sign up for a cool All right cool care maintenance agreement and you'll get two hundred and fifty dollar credit on any repairs through march they also help get rid of all those voices in your head Korean carrier turned to the experts\nEric bought has floor here was some important information for the motorcycle community if someone causes you to lay your bike down you need to call in my friends at the horse law still horse founder George Stein there's not only a world class attorney he is also a fellow biker steel horse law can help you get back\nOn your feet get your bike repaired your medical bills paid and your case resolved get more info and request to free riders advantage card at steel horse law dot com\nWhy is that in God\nDonate your car today with one eighty seven seven cars for get near a recognized five oh one C. three charity organization so you'll receive a maximum tax deduction much more you'll receive a vacation voucher up three days in tonight is also on the Web and cars for kids dot com wind\nBattering car donate your car to remember that cars with Jay\nLeno show for the very accurate coverage I'm breaking news where\nTo turn for in depth coverage on the local news and more balanced reporting from Washington news Ninety five and a and seven fifty W. S. B. got play\n... to eighty five buildings are next update on the morning Dr unless three minutes five twenty four first it's brought a quarter judging about we\nNow know the identities of the people involved in the deadly swat situation in ... I Believe\n... Mike register says the standoff began as a domestic call\nThere was a young lady and a child that was being held against their will buy an armed suspect\nRegister says it began as a confrontation between twenty six year old James Barton at is twenty four year old girlfriend Jessica Adams at some point Jessica's eighty year old grandmother Jimmy ... later being\nI Believe say Martin shot her dead soon after the SWAT Team right at the home saving Adams and her seven year old daughter and killing more than a process it got out he becomes W. S. B.\nThe lawyer for the Nevada woman accusing soccer superstar Cristiano Ronaldo or break that her post traumatic stress invalidate stat nondisclosure agreement she signed\nAnd fast miss my Oregon is determined by the court to lack capacity to enter into the agreement than the agreement is not enforced\nLeslie still ball says Catherine my Oregon was paid three hundred and Seventy five thousand dollars to keep quiet Ronaldo strongly denies any attack\nIs sending the president the new essay a bill would corresponded my rental are tells us includes things to make flying more pleasant for passengers\nFor example no more bumping passengers from flight that they've already boarded the plane better accommodations for pregnant in breastfeeding mothers and an order from the FAA to establish minimum seat standards like wit and hit\nKnow the bill also includes Congressman John Lewis this measure to allow airports to buy generators with federal bonds an effort to avoid another crippling outage like the one ten months ago at Hartsfield Jackson WSBIU time five twenty five\nLike the one ten months ago at Hartsfield Jackson ws produced on five twenty\nFive stuff about drones have you have a bill to actually give federal authorities the now the authority to go actually would shoot down drones being used for criminal activity they couldn't do that for now I understand that it's five twenty five list check whether a tropical start with today's forecast years W s ... district militias\nAre plenty of some again today with a high around Ninety right now sixty eight I'm\nPeachtree Street what's happening in the morning drive your ...\nOr driving shippers are going to the other troubled capital or that but we're glad Rick Shaw trouble at the center later ... daughter and I did I drive drove us out here are the ones that you\nKnow delays there on the outer loop traveling as they get into any five left all the way to Sandy Springs the in early in the last time that checked Sinclair Fulton County city five north down all the way at the mining triple team trying to tell you know pay\nW. S. U. money matters this morning here's ws be money matters host west small screen this up to speed on Wall street\nScott good morning stocks flat to slightly positive on the day but the real story of the day was not so much about stocks but instead the strengthening economy specifically regarding the strong private labor market and non manufacturing business sectors which are the majority of our economy this group expand it at a historic clip\nAnd that means higher interest rate since because in Syria strengthening economy leads to higher rates that was true yesterday's the ten year U.S Treasury rate ... three point one five percent its highest level since ... eleven\nAnd impassioned US Senator David Perdue and the floor of the U.S Senate\nIt's time to put partisan politics and the way and behind us it's time to confer judge Brett Kavanaugh to the United States Supreme\nCourt out of the cabinet nominees should move forward overnight the new developments after a short break giving us be do scientists five twenty seven\nWashing cars\nLow shit was coming from the engine cars and SUVs engulfed in by\nThe last\nQuarter were record what we discovered them other companies recall some cars they got the\nFeeling of orange will read them today and five\nYou can count on line with Elena Ryan is the worst thing about them out and you're\nSaying that Iraq I fly Michelle Williams flashing Oscar winner common has never been busier it's a little tricky situation [noise]\nNow we have to deliver our that's [noise] the line on channel [laughter]\nEvery week we bring many new under original engagement ring styles to both our showroom and our website I'm Tom shame and I'm here in the studio with the leash a shame companies had to design Hi Tom Alisha what are the brighter looks everyone's talking about this season\nOur customers are skipper excited about our engagement rings with ... and ... designs this look of ours is all over ... and Instagram the drinks Taos make the center time in the larger than life\nTheir feminine always a plastic and right on track and you can personal like any of these same company rings at the center diamond really are sapphire and the size and shape is your choice\nThat Shane Company we have the state's largest selection of engagement rings every on Trent looking style you can imagine over a thousand rings and all you have way more current styles to choose from in every price range than at any other jeweler\nNow you have a friend of the diamond business Shane Company and shame co dot com hey Sean\nHannity here from my friends at runners warehouse and I'm here to talk about TNT\nOfficer Howard Miller tells channels you mentioned news\nGot up to over Seventy miles an hour and the eagles were still pulling away\nAn officer of venture relief for ... to pull over but the other driver got away swamps he's been charged with racing and obstruction reporting ... W asked me\nA new report out of India estimates more than two hundred fifty people around the world have died taking selfies since ... eleven drowning is the leading cause of death with many sell the takers falling out of both\nOthers were hit by moving objects fell from high places are attacked by wild animals study says the U.S leads the world an accidental shootings during selfies how\nThe brain's prepare to make their first play out the payments in five years when they take the field and added LA against the Dodgers reliever AJ miner says they are excited\nFor the for the younger guys feel like you know we all want to be super stars of the time where you can be superstars first\nPitch schedule for just after eight thirty game to tomorrow in LA before the series moved to Atlanta on Sunday was the bulldogs\nPrepare for Vanderbilt Saturday they seem to be evolving into it to quarterback team\nBuilding football saying is if you have two quarterbacks you have no quarterback smoked for Herbie smart Jake from and Justin Fields is a two headed monster ... two huge Georgia fans they want what's best for the team for almost ... most of the snaps\nIn Georgia fans they want what's best for the team\nFor almost do get most of his snaps but it's clear after last week there is a place for the talented freshman\nI was taught her run around in my practice deal passed about one player makes the movie doesn't see something you take off running a defensive\nLineman Michael Barnett field is now second on the team in rushing touchdowns more from the coach tonight on bulldogs ... southern pick on Saturday seven thirty here on the home of the dogs say like a couple of us ... five forty one\nNinety minutes until six got flavored product waters judge Higginbotham you must be ... joined just take it down memory lane here just a moment it was sixty four years ago that I was likely is bowling baby at Emory hospital during a heat wave no one in the world happened yesterday that hasn't happened since then\nUh we hit Ninety degrees officially at Hartsfield of course ah Hartsfield wasn't Hartsfield back in sixty four years ago I'd just like we weren't quite to save either\nA as a result uh technically that is the first Ninety but most of Atlanta uh yesterday was actually no higher than the eighty eight but it looks like there'll be more nineties more widespread today tomorrow and Saturday most of us Stay dry as well\nLook for a near record high today around Ninety the old record is Ninety One set back in Nineteen fifty for tomorrow mostly sunny Hi Ron Ninety and on Saturday mostly sunny high nineties load sixty nine\nRecapping your forecast for today mostly sunny to partly sunny near record high around Ninety wake up temperatures don't mountain and Dallas both sixty six Stockbridge sixty five and McDonald waking up to sixty six it's sixty eight and peach tree street I meteorologist Kirk polished WSBIU\nFive forty two let's get back to the morning Dr here's Doug Trimble\n... tried to slowly the trash out of the right lane looks like the don't ask me again and I'm going to do an alley by the board it'd be harder exit Ninety nine but there are several that at the back of the album or ruin wrote\nA rational guards raided by the number one what did I Believe that have rattled at all you may know physically what\nGood is that the only read the news that the west side perimeter north downstate cascade rather it all the way to pay its airy across the north side it's fine leading the cop clever liaison to eighty five ... ...\nNo delays yet and they can they'll arrive soon but for the time being ... find north and west speed limit covered in highway overpass Peachtree industrial boulevard you get a better they're just sitting alone in your car they're warning to ... save you money drive change go better can be learned more edgy ache need options dot com this war rocky by George agreed options on do you ask me extra\nCredit quest for you this wondering what is the salary for the president of the United states it is\nFour hundred thousand dollars a year and I believe it's a pay quarterly at any rate WSBIU Jamie ... Doug ... is the third quarter just ended the White House just announced the president will donate his second quarter salary to the small business administration which will put her to use for programs dealing with veterans\nOr why it took so long to make the announcement about the second quarter is not completely clear because the third quarter of course you know are just\nComing up after a short break in Atlanta as morning news it's\nBig and bold has supporters and critics inside bart does expansion planned before the agency votes on it I'm do to us that we try\nAnd hot day she's ... she's five day forecast nobody best reduce times five forty three\nAnd my specialty radiation therapy we meet the ... family their kids so not only dealing treat the patient we see what they're going through Dr\nNancy ... radiation oncologist to North side hospital Cancer Institute\nA lotta times it's a Monday through friday treatment so it's really nice to have some place close to home north side very supportive of the fleet can says something kind of have a better terrain north ... sit there for our nation is definitely into my parents to decide what is the best treatment for that individual ...\nTimes somebody has that first abnormal men in is on a theory timeline time when they're dying as men with the team together and treatment has started and that's one of the things I've been ...\nVisit built to be cancer dot com to learn more about one of the nation was leading cancer fighting networks on the north side hospital Cancer Institute\nOkay what's happening in your neighborhood grocery store is pretty important 'cause you could save some money how about the weekly specials grab your plus car take on private selection Angus boneless tip certain line steak Rowley for Ninety nine a pound\nAnd yellow or white peaches are plump just Ninety nine cents a pound plus you could save them ... or a healthy choice entrees get this price\nThere's just a dollar sixty nine each would you buy six or eight ... great deals like these many more you can always see them on line a Kroger dot com or we while you're on line get your favorite essential item ship right to your door here's how\nWould you shop online you'll find the digital flavors and sizes of your favorite products plus shipping is free and orders of thirty five dollars or more\nJust started Kroger dot com trying new way of shopping today and I've got one more politically assignment for you bought your online at ... dot com download the digital coupons you ready for the next day to day only digital sale this Friday and Saturday select six packs of Dr Pepper's seven up or just a dollar forty nights\nLike six packs of Dr Pepper's seven up or just a dollar forty nine and so my priorities planters peanuts for Ninety nine cents with your postcard of digital coupon this weekend a Kroger fresh foods low prices\nNinety five five seven Fifteen do what you asked me\nThis morning news breaking news first hand accurate\nOn the top three things you need to know this morning to you by not dot com\nFears constantly had five forty six member wants to be a wetter yesterday the first official the land of Ninety degree October day since Nineteen fifty four we could have a second one today are near record high nineties [noise]\nRemember to Atlanta police say carjacking actually down over twenty Seventeen but their increased aid pd patrols now in the morals college here after three carjacking some one week within a mile of each other ladies crimes concerned police because all three cases the car jak or said guns\nAnd number three Senate majority leader Mitch McConnell taking that first procedural step toward a confirmation vote on Supreme Court nominee Brett Kavanaugh centers will get to see the FBI report into alleged sexual conduct you're going to get eight o'clock this morning one\nCopy of this report that they're going to be able to review and shit going back and forth between Democrats and Republicans hour by hour until all senators who want to review the report have had a chance to do that\nFinal vote in the cabinet nominations could be as soon as Saturday nobody was reduced times by forty seven\n[noise] Martin Lawrence does today on an ambitious expansion plan with a price tag of almost three billion dollar Atlanta\nHas to switch their cultural mentality from this car centric culture that we have\nAt Georgia State Urban Institute researcher Chris what's your ... says ... partners do need to step up to be part of this especially the hope to add light rail to places like the belt lined up I Need a dog with fiscally conservative Georgia Public policy foundation says depend on federal money and that private investment\nTo participate in a public private partnership on both pipe dream at ... gets WSBIU\nUnanimous vote by the Atlantic city council may occasionally at the bottom signs of bill renaming three streets named after the confederacy\nReally is a model for how we can get things done and the city when we talk with each other and not\nAt each other Confederate any Confederate avenues will both be named United while Confederate court will be renamed test and treat court after an apartment complex on that\nRoad or the newest girl sport in ... county schools officially gets underway next\nWeek I've always wanted like like football in high school senior Morgan all can't wait to take on call and tell next week as when it counties\nFirst ever like the ball games get underway I'm always wanted to play football but felt like they couldn't because a lot going on but now they have the opportunity to play and I feel like it should be anyway so does our coach Brett will send the top of our county down they want to turn this into a ... time donated a hundred and ten thousand dollars for going to become one of only a\nHandful of school systems in the country to have\nThe girl's sport England at county seat or perish W mass\nLet's see a little bit lambasted Delta Airlines that he wants to offer all passengers and flight why and bastion admits he doesn't know of any place else besides an airplane to customers cannot get their ...\nAnd he tells the skipped global forum there's no specific timeline for free can activity but he wants to happen soon currently only a handful of foreign airlines offer the services no\nCharge WSBIU signed five forty nine that's better news about ... eighty five delays or next graphic update to listen to minutes\nOnly five day forecast radio accurate and dependent on news is Ninety five AM seven does he he has the right here by Rita past management they handle months and years W s a meteorologist Turkmen less\nToday will mark our fortieth straight day of above normal temperatures after the second warmer September in the history and we'll be near record highs today the record is Ninety One said back in Nineteen fifty four\nAdvice you always dreamed of owning a Rolex not only that iconic it's one of the most prestigious watch brands in the world the sheer beauty the weight the below the smooth metal under skin\nOwning a Rolex is one of the best ways to reward yourself Tara fine jewelry company is it landers authorized dealer for Rolex watches Tara carries a stunning selection and stands by rote lectures vibe your factory warranty ensuring that your beautiful time piece as the ultimate care\nVisits terrifying jewelry company ... today and find that iconic Rolex of your dreams\nAnd when you ask me about ... er Cox media group station\n[noise] twenty four hour news whether an from five to seven fifty\nAsked me to\nGood morning the time it's six o'clock on this Thursday October forests I'm Scott Slade welcome to Atlanta It's MORNING news ... national story that kept down to a Senate vote of Brett Kavanaugh Supreme Court nomination is on\nOur index team coverage begins with ... reporting lived the Senate majority leader is taking the first step is setting up a weekend up or down vote on the judge\nScott the FBI is wrapped up its investigation into sexual misconduct allegations against Brett Kavanaugh\nThere'll be plenty of town for members review and be briefed on the supplemental material or a friday cloture vote that cloture vote Mitch McConnell is ...\nTurtle before friday cloture vote\nThat cloture vote Mitch McConnell is talking about is a motion to end debate as for what it all means senators will have until then to review the just completed FBI report all one hundred senators are expected to have access to the information in a secure room in rotating time blocks this process will begin to eight am with the Republicans\nAnd then trading off with Democrats every hour now earlier when of Georgia senators lashed out at Democrats\nDo pre to point\nAngered by Runyon with critics this week they attacked us of the browns shirt in Germany in the Nineteen thirties Georgia Senator David Perdue said Democrats will do anything to stop judge Kavanaugh\nWhen paid actors attack my wife\nYou have gone too far\nFor doing other senators get the chance to review the Kavanaugh FBI filed today with GOP leaders aiming at a final vote on Saturday\nWSBIU Jimmy to pray reports Democrats are calling the report incomplete since neither cabinet or doctor Christine Blasey Ford were interviewed reporting live with Jamie to pray Amanda Moyer W. S. C. [noise]\nSeparate ... show one sixty eight degrees I'll tell you how many records threatening days ahead in five minutes on WSBIU meteorologist personality of\nThe airport to five is starting to see all your big areas of trouble it's all to the right to the heart\nFor a trip for Apple wiped out by the end of the construction silver for handles the bills are full of us\nThis force you to the land is one of the ... Finley roofing Mexico to here's broader waters ... off of\nThe parents have a college freshman speak out after their daughter is shot in the back Italy must be show right joined just live with their emotional story as police searched for that shooter\nVeronica Michael Indiana Craddock were excited as their daughter days you begin or first year Clark Atlanta that excitement turn Tuesday when they got a call ... data had been shot\nAt home in year old was driving near the easy campuses when she said the woman shot her in the back and his beliefs continue the search for that woman Michael tells channel to actually news he just can't believe what's going\nOn at all and she was supposed to be about\nThey just currently paralyzed and police don't have a motive and this shooting ... Michel right to speak\nOn county man convinces a stranger to call nine one one to help his wife\nOn on it and when\n... spokeswoman Sarah O'Hara tells channel to actually use it turns out that Andrew Douglas in his wife were high on met with five animals in on magically filthy\nOut the\nShe calls the nine one one stunt a slap in the face of\nThirty nine year old former navy sailors under arrest in Utah for sending letters with suspected rice into the Pentagon and White House ... sources tell me that on the letter was his actual return address and so that's a pretty good clue to start with\nCorrespond a Jack ... says the envelopes did not have actual rice soon but rather castor bean seeds which is used to make the poison\nWSBIU time now six oh three the mom of a former Westlake high football player critically injured in his latest college game is asking\nFor prayer Christian Abercrombie was injured during Tennessee State game against Vanderbilt he is continuing to fight for his life says his mom\nHad been left his um bad sign or left the hospital says we arrived here on Saturday\nShe says her son was born prematurely and has always been a fighter and this is no different\nChristian he's a strong young man and he's fighting and we see his fight she says they have\nA strong faith and belief he will make a full recovery Jennifer credits W s D a school\nBus ride home near Dallas texas ended a fiery crash that killed one student and injured three others when mom says her daughter will not be riding the bus anymore\nWe expect them to be safe you know we expect them to come back home safe with us\nPolice say the bus rolled into a ditch and struck power lines sparking the fire doubled ESP use I'm six o five\nAfter the hour you come to the right place for maximum coverage of weather and traffic are not going to be surprised what's in front of you if you stay tuned to Atlanta It's MORNING news updates every six minutes us being drawn to skirt Miller says his most accurate at vegetable forecast your forecast\nFor today mostly somebody to partly sunny near record high nineties low snide sixty six to Seventy tomorrow mostly sunny continued unseasonably hop high Ninety low sixty eight Saturday mostly sunny high not eat low sixty nine\nRecapping the forecast for today mostly Sunday to partly sunny near record high around Ninety yesterday was eighty eight currently at sixty eight on ... street I meteorologist Kirk knowledge W ...\nSays five after six or W must be triple the traffic coverage begins with ...\nAnd over I devised Shelby County all your government building and I think it is worth it because we had a class of one party glaze\nRegardless of what they're going to be\nSo you don't want to be eighty five earlier than what what did I\nHave three or four cars off to the right for hundreds of thousands in McFarland Parkland one or a parkway path that breaks down man cell and look out for a report to roll over crashed Johnson Ferry navy block that brand and melon Sandy Springs northwest mark\nOut no complaints yet five Seventy five to lay free through candidate Holly springs in Woodstock Seventy five ... only about a Fifteen minute ride between the Wade Greene road and I ... five even back to working ... take the bus or the train you could even work from home just don't stay stuck in the past and alone in your car\nDrive change to better can be learned more Ga reductions dot com this what about you about George agreed options on WSBIU\nHere this is aviation to serve the biggest in America you could argue with the world's busiest airport than the FAA a reauthorization bill comes into play in a very big way\nWatch and if that will keep Atlanta passengers out of the dark and more knee room on future flights plus I'm do but he was ... comes in Cobb County where we're learning more about Monday is deadly standoff andme able to somebody must be do Simon six or seven new\nRoof hey it's rumors and the dog for ... Ruben\nRuben you see 'em on family moving trucks and billboards all over the metro area I'm famous young said it's been a fixture\nThere for over Twenty years and in that time one would assume he's learned a lot about ripping all of a business day Baker also don't fix it so I can tell you that family roofing is the best during Owens warning planet preferred contractor move roof real backs Sony that don't eat that\nThey've installed over fifty thousand roots in the metro area including mine mine too mine too family will come to your house and give your Roomba thorough roof analysis for free no obligation pretty three very no charge it's easy to see my family's land is most recommended river Rouge any questions shoes are good boy boy me\nAll over the real world road rules are having the I'm On my part real world dot com bubble me me me Bruce Bruce dot com Ruth Ruth\n... times and pipe nurseries having huge selection of everybody's favorite guard up your front porch had they season with tons of airline pumpkins and eye catching shapes and colors\nLike beach sounds that red white and gray greens plus get classic orange pumpkin for Jack o' lanterns and Pi Day coming many medium cross the pumpkins if you can carry for just Nineteen Ninety nine and they do now\nRight now is that perfect time to plan\nTemperatures combined with a warm soil stressful for planes and make it easy for you to grow up on ... hours like ... Mars my nursery that the ... election of trees and shrubs skills\nVarious blooming chameleon Japanese maples handler and guaranteed their trees insurance for life you can plant with confidence in any professional after the jar but we'll talk about our planting and landscaping nursery signing with I\nA lot of games and playing and they\nCan happen at twenty four hours and tomorrow\nMorning news by him seven fifty\nThey're driving up table look for any I twenty delays or less than three minutes six oh nine ... sixty seven we're learning more about Tuesday deadly swat standoff andme able to in authority say it started one twenty six year old James Martin\nMy exclusive five day forecast Sunday and Monday mostly the partly sunny ... Sunday eighty eight Monday the five lows sixty seven to Seventy recovering the forecasts for today run six in the management or mostly sunny the partly sunny near record high around Ninety\nCurrently at sixty eight and Peachtree Street I mean Iraq just Kirk knowledge W ...\nTornadoes get back in the morning Dr here's dumped terrible\nAre the only one or the needed Sandy Springs John Berry road out that blog right here at river valley border on the river valley wrote back street that actually pick up the other end\nOf the various go overboard Abernathy only every year but that's going to change that is almost twenty minutes five that trouble right if there's a tractor trailer blocking that you have on what do you get onto the interstate was\nAlive that we asked me jam can't can't find any slow zones on Seventy five ... looking great between ... road and windy hill five Seventy five south still lighting easy down through Woodstock actually ask a four\nHundred watching a couple of cars off the rightful hundred south on between McFarland and window where parkway Scalia tapping the break there that it's starting to flow ... traffic project I can hear your products terriers painting windows citing roofing can make your how comfortable divulge terrible and beautiful visit to carry a pro dot com triple team traffic tell us\nThey just put together with the Braves you're saying inside the locker room now getting ready for tonight's first playoff\nWe don't want to be super stars of the time where you can be superstars and we do our things and accomplish things that we want to accomplish hell we can compete with anybody has a chance and doesn't matter and again\nWell we we can compete with anybody has a chance and doesn't matter and the games you one during the season we're all here for a reason\nI don't want our team about trying to reinvent ourselves we are who we are we we play the game the way we play you know it's been really good\nAs mentor mark ... back to back they're getting ready for what's gonna happen tonight coming up next the new\nKids in the postseason block admit they're bright lights of Los Angeles for the Braves finally time for the playoffs tonight I'm W s ...\nI just try to watch it for all of a hug is healthy ws reduce crime it's six Twenty one\nKnow\nKenya where he wouldn't even interview [noise]\n\n[noise] the\n[laughter]\n\nEverybody wants to feel like they're getting a good deal that's Y. E. M. C. security customers love their monthly rate from just sixteen Ninety five a month in fact for such a low price\nYou'd think you'd have to sacrifice service or quality not with the emcee security you get it all\nLow priced eight plus better Business Bureau rated service lightening fast response and no monthly contract to walk us what more could you ask for well for a very limited ... security will switch your service for free visit EMT security dot com or costs seven seven o nine six three zero three zero five to get started\nThe following message for monster contains multiple uses of the F word you may not be suitable for younger audiences and those easily offended\nFree it's a bad word that a lot of job sites use and it's creating a lot of noise you know those sites they tell you a free posting we'll get your small business qualified candidates and then the candidates you get aren't the candidates you want\nSo they aren't free because you end up paying a lot or there are those other sites where you post your job in the same environment is someone selling a human sized hamster wheel\nOr were qualified candidates can't find you because you're ... get married really quickly way deep down at the bottom of the site\nPosting her job on monster means you don't have to post on those sites because we don't do any of those things\nWe deliver candidates I'm qualified wants monsters job posting started just forty nine dollars no hidden fees no relevance Kennett matches now having to re posted for ten minutes only the candidates you want delivered easily at a fixed affordable and honest price visit monster dot com slash radio to learn more and cut through the noise\n[laughter] five five AM seven fifty you asked me home of Georgia Bulldogs\nNews weather in the morning news we constantly\nDepend on it got better ... for six thirty versus six twenty porch product waters ... first\nPlay off of parents and five seizes begins tonight against the Dodgers in LA the\nDodgers plenty of postseason experience the Braves\nThe feelings of the playoffs the whole thing I mean this is this is part of the journey that we've been looking to go I embrace\nManager Brian snicker knows this is real Mike both individual find out he gets the game one pitching start with this electric stuff against the Dodgers you generally you\nAre there are big match up oriented team of whatever club they put out there really good either so the regular\nSeason the Dodgers one by the southern games between the teams that good stuff that you asked me\nTo sit down Fulton will now be able to bar Eighteen wheelers from driving a residential neighborhood just a problem that's been exacerbated ...\nTrust in areas where their school accident ... up in a long south in Parkland\nTwenty Seventeen ordinance to restrict big rigs was later said to be on enforceable\nMore than two hundred and fifty deaths worldwide can be blamed on ... eleven according to a study from India it finds drowned and get the number one cause of death\nWith many stealthy take her spelling out above others\nFell from high places were attacked by wild animals us leads the world and accidental shootings while taking a selfie\nIt doubled the news about your health hugs really do make you feel better Carnegie Mellon Mr just find hug each help improve mood after people had some kind of conflict or negative it during their\nGame this effect was seen across all genders in ages so their advice if you're stressed you're depressed I'll get out of the time six twenty five\n... what is the minimum amount for oxytocin transfers of Twenty one seconds it was six or seven we need to look that up okay if you are right you know ... and let's get to the weather traffic update now nobody rescued her I'll describe gr relishes you're updating today's forecasts are it's got forecast for today\nMostly sunny to partly sunny near record high close to Ninety One right now sixty eight on the street and I\nHad a Clark Howard what's happening in the morning Dr ...\nAll you make really everywhere we've got a regret about by the job that very but Green River valley where to change the name of an avid avid they looked like the vehicle by the crash back next to actually\nOut and it's not just a bit on the east side parameters that door than before and after a highway Seventy eight traffic batch of at the Georgia Lottery download the free Georgia Lottery mobile apps are camped ... million but the new ...\nThere's a lottery mobile after a chance to win millions with a new app you can play online check winning numbers and scan your ticket the New Georgia lottery ... triple team traffic tell us the\nCompany must be time is six twenty six to ... hours you may have heard me talk about how my son was conned by people pretending\nTo be from apple tech support my son at the time was twelve years old and he's pretty independent sort had a problem with an apple product and just went on the Web what for the number for Apple tech support called it and realized when they started asking for credit card number from him\nThat it wasn't actually apple tech support it was a con so then he called the next number he found searching online it was also focus\nAnd fortunately he is savvy enough to know about scams and didn't get taken a lot of other people are being taken by phony tech support you need to be very careful if you do a Google Search or anything like that even as the search engines try to get rid of the cameras they still slip back in\nBefore you call a number of make sure you're dealing with the right one the best thing is go to a company's\nOwn website [noise]\nUS Senator David ... and the floor of the state of yesterday calling for the question\nIs to put partisan politics and the way behind us it's time to confer judge Brett Kavanaugh see nice state Supreme\nCourt kind of got next late developments overnight and the confirmation including the FBI investigation this will be available to US Senators that about Ninety minutes nobody must be due time is six twenty seven\nJust recently I had some more computer equipment shipped to me down here in Naples from where from vision computers why not just by it down here because while I've always had a bit of an issue with those big box computer stores vision has never been anything but perfect\nDo you know they have a five star Google rating perfect out of Eighteen hundred plus reviews find that other computer store somewhere that can match that\nOld people love love their technical support you never listen to a telephone recording they answer within about Fifteen seconds and once they do answer they solve your problem the person that answers is the person that can help you\nI've been talking about vision for years still doing business with them so should you\nGive them a call for oh four compute for all four compute provision we work hard it being healthy and\nWe really need is better quality sleep\nThe new fleet number three sixty smart bed intelligently says your movement that automatically adjust your conference support on both sides your number setting\nThis is not a bad it's proven quality sleep\nBe number three smart and not only eight Ninety nine bus federal financing for young delivery almost back\nAnd what will be some historical asleep number ... subject minimum monthly payments quite she's pretty good\n[noise] here's why flee allies vice president of the gym Alice automotive grape family owned and operated since Nineteen Seventy why\nBuying a newer ... vehicles should be an exciting time however many consumers would rather skip today's traditional car buying experience and the stress of haggling over priced navigating an unfamiliar cells process pen spending hours at the dealership\nLight both cars quickly reached beads and access to Seventy miles an hour the arresting officer eventually caught up to Anthony's wants the\nOr officer was able to pull up beside the driver and yelled at them to pull over\nOfficer Howard Miller gels channel do you watch the news\nPeople could lose control of the car and either hit the other driver or run off the roadway themselves or somebody totally not involve\nShrunk he's been charged with racing and obstruction the other driver got away or gay line WSBIU and let\nMe ask you to laugh at the bottom signed the bill officially renaming Confederate and east Confederate avenues United avenue\nA change that helped put the divisions of the past behind us and moved\nForward to counter unanimously passed a bill which also renamed Confederate court ... court after an apartment complex on the road the mayor calls it a model for getting things done by talking to each other rather than at each other\nOnce again the bulldogs plan to use both of their star quarterback when they banned Saturday smart\nAs soon as they have no script project from adjusted infield will be huge\nYou can't have a plan because we don't know how the game's going to go\nLast week was the first chance for the freshman field to show his legs it gets to the SEC opponent and the hype Israel\nYou probably got the recipe for the rest of the season it is a great little match a problem for deep ...\nField is averaging almost nine yards you carry well from you be writing a second in the league ... dogs live at seven kickoff Saturday seven thirty year old the home of the dogs Jay Black ws my eldest reduce time\nSix forty one okay to the extra homework on hugs you know the story last half hour on the health benefits of a hug how long do you need to hug to release oxytocin [noise]\nHere to at least twenty seconds according to everything I've seen there's varying opinions on that but right about twenty seconds will release oxytocin and why is that important but when a person\nGets back going they consider themselves to be secure or safe and more connected to their loved ones are\nMy twenty seconds for someone you loved\nMy benefit till seven o clock ws your authors Kurt relish oranges live once you get to this\nIt'll seven o clock ws you're all district relish orange is live once again this right we haven't had a day like yesterday in October and how many years\nUh let's see ... all the way back to Nineteen fifty four sixty four years at least a for Hartsfield airport anyway they reached Ninety rest of the area was eighty eight we're going to top that today we should be Ninety Ninety One and most of the area today\nLows tonight sixty sixty Seventy tomorrow mostly sunny continued on ... on your Ninety One and on Saturday mostly sunny Hi Mandy low sixty nine\nRecover your forecast for today and round and five and the management or mostly Sunday to partly sunny near record highs route Ninety temperatures run area right not the suburban school bus stops Stone Mountain sixty six Dallas and Stockbridge sixty five McDonald waking up to sixty seven sixty eight and peach tree street I mean Iraq just Kurt polished W. S. B.\nSix forty two let's get on top of the morning drive all marked the gays way here's Dr ...\nIs on orange or out of the way round the brake light starting now about ... rode out\nTo do after all that heavy traffic there and got him when he was over twenty minutes from the east I was like the trouble is he believed what the hell out of around a report that could\nGet a break lights duty five Norris founded a camp Glenwood memorial then heavy highway Seventy eight to North lake parkway west about us lows only be peace tree industry boulevard west side for other ...\nPretty easy it down to ... find new album I twenty over Seventy five declare relieving just kept the rights to find ...\nWrote this report probably about ... do my job that he knows he's of course as we pick up on this beef Chuck ... a pound at forty eight ounce Friendly's ice cream pie for five dollars with your ego thanked his car he goes no prizes let the savings ...\nJamie degrees insider time table in the cabinet confirmation process coming up next and I got to find a minute first entered David produce incredible for speech on the floor of the usa to yesterday and the Kevin a nomination while you hear that next ws reduced I'm six forty three\nHello Atlanta it's Tom shame big eyes on roared and shame shame companies a direct diamond importer but some folks aren't really sure what that means it simply means we traveled directly to where the rough diamonds are actually cut into polished stone\nFor nearly Seventy years my family's been buying from ethical diamond cutters ... Tel Aviv and then by\nThe world's three diamonds centers hen picking the prettiest diamonds and then selling them directly to you there just aren't any other jewelers in town that do that by not importing directly other juniors or mine diamonds that have been marked up by a series of middlemen three four more times before they even reached their store\nAt Shane Company we eliminate all the middlemen am there mark ups\nAnd pass the savings on to you and because we offer the best value in town you will get a bigger diamond and they're pretty uh rang whatever your budget has come to shame company Atlanta has direct diamond importer now you have a friend in the diamond business Shane Company in shank oh dot com\nHi this is Scott slate did you know that Emory University school of law now offers legal training for non lawyers and that you can get that training on your schedule that's right Emory last online master's degree in law is designed for healthcare in business professionals who want to study law as it relates to their field work\nThe courses are taught by Emory law faculty and the program takes only Eighteen months to complete apply today just start classes in January at Emory law J. A. M. dot ORG bets Emory large am dot org would you like to see actual\nMagic all you have to do is call one eight hundred God jump to be made we make Jones disappears rights\nCall you have to do his point then that's a signal and then to\nIn clean shiny trucks and snappy happy\nYou would have gone\nOne eight hundred and guide junk or visit one eight hundred got junk dot com\nThe new study five five Fifteen oh you asked me\nThis morning news breaking news first accurate\nThe top three things you need to know this\nMorning we Scott ... forty five number one bill whether we have another record high today or near record high of ... and number three the increased de de de patrols in the Morehouse College area after three carjacking some one week within a mile of each other latest crimes concerned policed as all three cases the car jak or is that guns\nNumber three Senate majority leader Mitch McConnell takes the first person team procedural step toward a confirmation vote on Supreme Court nominee Brett Kavanaugh\nThere'll be plenty of time for members to review and be briefed on the cellphone metal material\nBefore friday cloture vote\nThis supplemental materials have yet to be I investigation going to be made available to US Senators and just over an hour somebody must be ... six forty six\nMedals or control in Georgia and in Washington do you believe that when you ask me is continuing coverage\nWashington have me do you leave now when you ask me is continuing coverage from DC here Scott slave these headlines this morning Senate\nSince Trump landmark opioids bill key GOP senators grumble about Trump's remarks on foreign and the GOP sets a possible Saturday vote on Kavanaugh Jamie Drew Brees Washington insider timeline and what can happen here's the\nTimeline for the judge Kavanaugh nomination if everything stays on track the Republicans filed cloture late last night so that means the Senate would vote to shut off debate on friday\nIf that gets a majority then the Senate would have the final vote on Kavanaugh Supreme Court nomination most likely on Saturday Night at this point GOP leaders still don't have the votes his Collins of Maine flake of Arizona and Murkowski of Alaska or the three unknowns some of it may well depends on what's in the FBI Files that senators will read today\nThough the president's remarks about Dr Christine Blasey Ford did not help Kavanaugh with GOP senators\nAre do you recall began students at Reagan National airport earlier this week with senator and Mrs David Perdue\nHow can you not talk to women who have been assaulted how can you please\nStandby in your face protesters had been\nDug into the restroom [noise]\nAnd he took it personally on the floor of the U.S Senate\nAfter ... and all my wife and myself this week we have seen firsthand the link to which members of the other side of this hour we'll go to distract us away from the truth and he was just getting started in fact I Believe my democratic colleagues have gone on to it too far this time\nWhen paid activist who support\nYou attack my wife\nYou have gone too far the American people will know that\nOh both sides\nWhat am I and I didn't start outside this body it actually started in here you are inciting this\nDisrespect about wall\nWhat am I democratic colleagues in this body has encouraged people to and I quote get a new place to some of those Congress people\nReally how does that\nThe cause of justice for\nIt will move forward today US Senator David Perdue be among the one hundred US Senators who will have access to the FBI background investigation and Brett Kavanaugh that included around ten witnesses we hear that ah that briefing room will be open to senators after\nEight o'clock this morning somebody must be news time is six forty nine\nOnly five day forecast Honda letter radio accurate and dependent on news Ninety five five AM seven does a we have the right here by Rita pass management they handle months and years W s a meteorologist skirting allies\nMake the Swiss Comcast Business getting ... fast reliable Internet just one more weight contests his ... teams [noise]\nGet started to Seventy five magazine Internet for forty nine Ninety five per month when you add ... voice mobility lines [noise] how many hundred five or ... thousand today [noise] contacts business [noise] yawn fat offers of on the Twenty one of the restrictions applying to business 'cause there's only two years remember quite clearly termination for your flight to\nCome in Texas and these extra subject to change can extra pro backup limited up to six hours\nWhen you ask me about ... er Cox media group station [noise]\nThat one is twenty four hour news weather and five and am sent\nMe a lot to me\nNow eleven o'clock in the morning I'm Sabrina cupid live in the u._s. be twenty four hour news that are looking for a near record high this afternoon sunshine in Ninety One ... militias full forecast is coming up but our top story you hear the eleven o'clock to Kavanaugh findings what did the FBI find out\nAbout the Supreme Court nominee and allegations of sexual misconduct and what are the Democrats have to say\nThis year in committee said within the last hour there's nothing in the FBI report on Supreme Court nominee Brett Kavanaugh that we didn't already know Senator Chuck Grassley statement said the investigation found no hint of misconduct and at the White House spokesman Raj Shah expressed confidence\nWe're fully confident uh after reviewing this information senators can become comfortable voting in so far\nMore than twenty senators have been seen going into a secure room where the FBI report is laid out attorneys for Kavanaugh accuser Deborah Ramirez says she is deeply disappointed no additional witnesses appear to have been spoken to who she said good backup or clean more from ABC starting my rent\nIt was always going to be a challenge for investigators to find corroboration for allegations that are so old and were some of the key possible witnesses were admittedly drunk but the speed and the political pressure on the FBI here seems to have left some possible witnesses on heard and perhaps some stones unturned a\nConfirmation vote could come this weekend Aaron ... ABC News\nAs the Democrats old news conference we're streaming it live on line doubled us the radio dot com seven Russian operatives charged with hacking anti doping agency's to undermine the Olympics U.S attorneys Scott breeding\nThe tide doping agencies to undermine the Olympics U.S attorneys Scott breeding defendants\nTargeted athletes an anti doping agency's as retaliation for the outing of Russia's state sponsored athletes doping program\nHe says they also hacked other entities to further Russian interest\nFirst first this is W. B. twenty four hour continuing new ...\nWife outside of club on white whole street it let a police captain Reginald Mormon says that it started with a fight early this morning inside the ivory restaurant\nPushed by ... by outside the\nMan was shot in the leg during the first fight more shots were fired later from a car driving by the scene although nobody was hit the club has been the scene of at least two fatal shootings since twenty Fifteen\nA Seventy four year old man accused of shooting seven South Carolina police officers outside his home posted on social media about being a competitive marksman taking his children shooting with\nImages capture from Frederick Hopkins Facebook page show comments that he made a twenty fourteen talking about taking his ... year old to a shooting range you posted quote I just love the smell of gun powder in the morning\nAuthorities have identified Hopkins as the suspect in the shooting of seven law enforcement officers in Florence on Wednesday Florence police officer parents care away was killed\nThere was an urgent search underway this morning for a masked gunmen who was terrorizing Chicago neighborhood police releasing surveillance video that suspect they believe killed two men in two days\nAuthorities say the victims did not know each other investigators have not really any details on a possible motive or they're hoping someone who sees that video or recognize this talk about now\nAnd that's NBC's Alex press reporting from Chicago told us the news time is eleven o three as we take a look at the USB marketwatch the dial down two hundred points at twenty six thousand six hundred twenty seven aspects down Ninety six the S. and P. also down this morning\nTomorrow morning news group pushing the red light the Gulch develop a project and the high speed Internet coming to it later the Clark Howard is calling a game changer years Ninety five ... strip you ...\nWell actually the cars\nExplosions coming from the cars I guess you reason Gulf and fire\nTo get the less\nWorried about her just regular pored over record what we discovered that other companies recall some gardening ...\nJoined trust environmental read them today and fought\nYou can count on\nTo\nTo somebody's going to get back\nTo structure is not down\nBeginning of eight on channel two and ABC [noise]\nDead pumpkin time and pipe nurseries have a huge deal actually in of everybody stay regard it dries up your front porch had they season with tons of heirloom pumpkins and eye catching shapes and colors like beach jumps at\nRed white and gray green plus getting classic orange pumpkins for Jack o' lanterns and pine may come as many medium classic pumpkins if you can carry for just Nineteen Ninety nine and did you know right now is that perfect time to plant\nTemperatures combined with the war in the soil stressful for plant and make it easy for them to grow unsolved hours like pansies and ... dragons and Mars\nMight nursery that the ... election of trees and shrubs to get\nValue is booming chameleon Japanese maples ... more like nursery guaranteed their trees insurance for life you can plant with confidence if you need professional help to boost your herbal deal about are planting and landscaping every day like nursery gardening without\nLoving the pumpkins and playing in\nIraq was European garage we believe maintenance for European a luxury vehicle should it be a pain you deserve more options and your dealership but you can't just trust anybody it's Rocco and that's why Iraq was European garage do get better service and save money plus with reconvene your locations in Marietta east coast and bucket\nYou'll be back on the road and do some so next Sunday the maintenance on your larger European vehicle come see me at Rutgers European garage or visit Rutgers European garage dot com Rutgers European garage we all your dealership altered of wealth beautiful to be\nThe all new two thousand nine Mercedes Benz the class is built to be driven from five driving models at the ...\nThe show to MB usa dot com for Detroit area jailer schedule your test drive today [noise]\nIn a perfect it would be no break late Fred\nIt only one sound good drown out your radio\nWe we\nSo we\nSome time on his decline team coverage trafficking weather here's Alex Williams new trouble and coming out of town northeast Atlanta eighty five and north bound just north of the Brooke would split\nIt just all reported to be in the HOV lane starting to see some lays out of midtown into north east it winds up heads up for a gas leak fair been road at ... part of that roadway intersection is shut down so might want to try to avoid that that's just south of I twenty over on the west side there and we're still seeing delays with construction ... eighty by the north bound getting past highway three Seventeen\nExit number one eleven it's an ... back towards ... parkway\nThis report rocky by reliable heating and air reliable strained comfort system now includes a free lifetime repair maintenance and service no payments until twenty Nineteen visit reliable air dot com for more information Alex Williams ws\nSomebody else for you to skirt polish within quitting dependable forecasts for today\nMostly sounded a partly sunny near record high Ninety lows tonight sixty sixty Seventy tomorrow mostly sunny continued on she just really hot high nineties low sixty eight Saturday mostly sunny high near ... low sixty nine already eighty degrees of sunshine a peach tree street it tells us be depend\nOn all the all the thousands of hours on the job search right now\nI'm looking up at the uh [noise] I have all the twenty four hour news channels one [noise] I'm looking at here they're all\nDoing the same thing Senate Democrats react to cabinet report oh wait a minute maybe I should stop and we should turn this up\nMaybe because I don't know what they're going to say right I have no idea maybe maybe they're going to come out and say it's wonderful it exonerate Kavanaugh we immediately now need to put him on this I'm going to turn this up\nSo all I don't have to turn it up oh wait a minute I knew ten minutes to get what they were going to say when I saw the banner that says Democrats will soon speak about the FBI Kevin report oh OK don't bother I I guess I don't that's right it's it's it's kabuki right we know what's going to there's no reason to even listen\nWe knew last night we knew the day they asked for the report Chuck Schumer is up there\nI was able to open a vaults in read\nThe report from the FBI or bowels of the capital of the aisle in deep into the bowels of the capital and as we expected that investigation did not go as deep as we had hoped for so we're asking for another one week delay there are a couple of cases\nJust words that you could hear the Miller minute every night on the mark your show\nBut I Know that whole ah interviews on radiolab rent will be out tomorrow downloaded usually filthy but I think this one slight weekly [noise]\nTerrorists on Hitler entertaining honest independent thinker time until noon and find them on Hitler doctrine daily podcast has to be a doctor in dot com [noise]\nOr the Nineteen and the great barrier WSBIU twenty four hour traffic center stall cleared eighty bonding north bound just north of the broke would split\nThe jihad or Georgia four hundred all linked back open they're just the top of the right swept jumping the delays downtown heading south bound eighty pounds outbound sluggish leaving Georgia four hundred good actors out bound doing the same thing seventeenth street down July twenty don't read about that construction eighty by north bound\nRight around highway three Seventeen eggs at one of ... county that's an ally playing calling blaze Beck torture goes parkway and construction getting set up to eighty five east bound the outer loop at watch oh that'll be an ally plane also causing delays back toward Boulder crashed Alex Williams WSBIU\nThey're saving and then there's big saving the kind of maybe you can always mind at your neighborhood Kroger with low prices and delicious joined last personalized coupon club planning to how you shop and save any time from anywhere and then you get more for less than ...\nHello to new lower prices and the least their prices to like yellow and white teachers are planning for just Ninety nine cents a pound would gardening brings food prices have Kroger\nBecause you've got Kroger on your team and you see on the ...\nAnd that can be very fighters yes\nWere victories it delicious Robert ... great where stand\nA huge lake front liquidation is taking place this Saturday on one of the top recreational lakes in the southeast gorgeous lake Keely incredible like located just a short drive from Atlanta\nHas it all beautiful mountain views crystal clear water and endless opportunities Saturday\nYou can have it all or just and he's on the dollar for example I to wake our private lake lot he's he's forty nine hundred dollars for under five grand you can have two acres at Laiki away ten total like lots in all will be liquidated this\nThey tend to little lake lots and all will be liquidated this weekend need more acreage how 'bout nearly four acres with direct like access for under twelve grand do you\nHave about there's two acres with a boat dock and mountain views for only twenty nine thousand nine hundred properties have wide paved roads underground utilities nice views and direct like access but they will all be sold on a first come first choice basis they Saturday\nOctober sex so call now eight hundred six seven five Eighteen hundred eight hundred six seven five Eighteen hundred eight hundred six Seventy five Eighteen hundred\nArmed Tom shame hey guys wrote and change here ashamed company\nOur diamond buyers are constantly in the world three diamond capitals and worked Tel Aviv andme Mumbai where the rough diamonds are cutting polished the diamonds are sorted by grade then we picky stone one at a time choosing only the prettiest diamonds from within each grade\nWe sell diamonds loose and show you how to examine them the way our buyers do my friend Bryan recently started his search for a diamond on line which is fine he found tons of ideas but to properly evaluated diamond I told them he had to see it in person and to paradigm and side by side it's a fun experience and a really cool thing to do\nBecause of how we buy our diamond sparkle more than other jewelers diamonds of the exact same grade shop around then come to shame company where you'll get the prettiest diamond in every price range now you have a friend in the diamond business shame company and shame go dot com\nOr what is at well put simply we're your online homebuyer off or bad is the modern home selling solution with uh personally human touch that lets you skip all the traditional headache we buy your home from you so you can move forward them moment you're ready\nWe've had the pleasure of helping thousands of happy home sellers and we'd love to help you getting started in ... to offer ... dot com and your basic information about your home and the next day send you a great offered free and there's no obligation\nWise Auburn had the better way because we knew what traditional selling can't certainty and control ... means no showing you pick your closing day and ... even\nMovie locally for free we have a Ninety four percent satisfaction scores end a lesbian maybe reading her reason it truly is a better way they're thinking about where you want to live next get excited about making that new\nWith our pet your soul and go to Africa had dot com and request you're free purchase offered today for bed freely\nThis is Wes moss and our money matters we talk a lot about income investing well what does that really mean well it's an investment philosophy that I worked for many happy retirees rather than getting locked into one product income investors rely on three things\nDividends from quality companies that stocks interest from various bonds and distribution from things like publicly traded real estate if you like help the coming and coming faster I invite you to talk with me and my team at your wealth dot com that's why oh you are wealth dot com\nSad is that in God\nDon't need your car today with one eighty seven seven cars forgive near a recognized five oh one C. three charity organization so you'll receive a maximum tax deduction what's more you'll receive a vacation voucher of three days in tonight also on the Web but it's hard for kids dot com\nWhy that is that in Carthage donate your car to remember\nThat SARS with Jay\nThis is W. meteorologist Kirk relish I'll tell you how many near record high temperatures\nAhead find my forecast any time on the W. B. with us\nI guess funniest I Would say\nAspect of this whole Kavanaugh surface\nBut he can always say well it's not really funny because it has such an effect [noise]\nMaybe I should say interesting I hesitate to say\nIronic because you never know if you are right or wrong in that situation\nI don't want to who was the singer the got it all wrong a lot more so yeah I don't know about a poll on us more so that was our irony but it's interesting out of this whole thing the thing that stands out for me the one thing that uh is this underlying idea by the left that they're the they're the people of peace\nTolerance\nWe're open minded and we're we're tolerant and yet as we see in the cabinet thing not so much\nTolerance [noise] from the left or the way I see it now the tolerance is only to those deemed were worthy so we're tolerant only to those deemed worthy of our tolerance\nWe have not deemed judge Kavanaugh's family as worthy of tolerance or respect or peace open mindedness\nZero tolerance for any one of the country\nSo tolerance for those that they do\nSo tolerance for those that they deem worthy of their tolerance but to zero tolerance for any one of the country to thinks the guy should be presumed innocent until proven guilty zero compassion\nFor the man's daughters\nWhere are the feminist worried about his two daughters I don't see everything I don't watch them and he's saying are they out there\nI certainly haven't seen a headline about it I haven't seen one damn word Chelsea Clinton said one thing she said they are off limits leave him alone they're ... they're not off limits there are going to school and their friends know that their father is being accused on a national stage of being a gang rapist\nAnd kids eleven years old are asking for\nEvidence they're not saying was there anything exculpatory [laughter] sorry doctor for it and do you do know that words that's all right\nWell I mean okay let them or Coca Cola\nPerhaps ... this week [laughter]\nI Believe\nThat feminists should think that he's innocent until proven guilty if only to protect the man's daughters or any woman that's in that family he has a mother\nOK Chelsea Clinton said they are off limits but they're not off limits their lives are being chopped up right now right along with their father and their mother\nI'd like to hear the feminist at least say you know it's a shame but that's not what I'm getting\nTolerance only those deemed worthy of their tolerance [noise] zero tolerance if you disagree with him politically so you have feminist who do not give a damn about the man's daughters even though we don't know if this stuff is true [noise]\nListen up Atlanta area are you interested in making some extra cash\nBuying real estate tax lanes the real estate and to actually network is offering a free tax link yet that will show you how to use their simple three step formula and they're proprietary website to earn secured returns potentially up to twenty five percent it's so simple you can do this in your pajamas from the comfort of your own home just point click and start buying tax\nAnd I'm not letting Fox News off the hook because the analog over there as Greg Jared just go to your YouTube typing Greg Jarrett airport watch what's there and ask yourself is this really the guy to moralize about Rod Rosenstein ... I don't think so let's do this\nEven more headlines Thursday October for it [noise]\nAh right hey I've you know what there's some stuff on the table and a little too serious I think what I Want to make sure that we get to a lot of audio oh yeah we've got lots of audio but I Want to jump around a little bit there's a story I heard coming in a fake hostage story leads to real drug charges against a Cobb County couple\nIt happened one thirty year old Andrew Douglas ran up to a woman that Mary at a bank drive through and convinced her to call nine one one\nDouglas claimed his wife was being held hostage but when Cobb police got to the ... yeah all they found were five pets living in filth in some pipes with math residue police say the husband and wife are high now this was this audio is the lady who was at the at the ATM\nFerret [laughter]\nTime I love this I Love is audio\nFrom our family [laughter]\nSo it turns out some I'm guessing because they're a mess they were hallucinating impaired oh you don't have them\nHere the rooms are lovely couple of ...\n... ah you can leave that your wife had been abducted\nYeah my wife she she she she she she was she should these guys pulled up in a fancy and the huh they jumped out at grandma's got me out of their house being held but the\nPolice showed a sudden they found nothing meth residue\nShit they're available they made it you can see 'em\nOut yeah they have these these devices that they put over their bodies and they make 'em and miserable\nIn it and they had her mind there and they were going to kill or unless we get money and then you can see them because they were from the government the government has these think Mr Mr and Mrs Jones who has yes yet as you do everything possible you might be just a little too high other Beth ... no no no I just well [laughter]\nI barely got high marks that he felt so yeah yeah because we have problems we have pain\nYeah can't we can't we can't get we we were five years yeah I've been laid off five years and they let me go try and get my ... yeah yeah yeah and we try we try and we she she learned all her wake vouchers\nAnd now and and and that would be an option bucks you happy that she's ... she's safe\nThat just just just just so lucky that only got ... ... ... e bay and then later on\nAnd I'm him your lighter okay on it's under the under the GOP\nAre we going to have to get another dog named her so they always them poisoned our dog they make they keep they keep poisoning our there was an episode of\nThe ... and I believe it's going to be on CBS [laughter] this fall\nIt's fall some bad things to work it out\nA ... uh I'm\nI'm interested in Bernie Sanders but not necessarily this you know we got we got to do that CNN this light promo oh oh yes oh you're not so great you know on Sunday night they it's is it a documentary 'cause like doing a lot of documentary yes it's like they want me I'm a really listen to CNN tell me what the eighties where I was there\nI was Eighteen and in Nineteen eighty\nTwo well why do I need CNN to tell me through these documentaries what the life I Lived was so I pretty much ignored is just another documentary do they\nDone the eighties and nineties it in two thousand and done the history of comedy I read um comedy now that I've\nHad some expert on comedy CNN they have a new show Jeffrey too but he's pretty funny if you look at his path\nAnd then this is called a this is life and it's their their new show up for one second that just to name right there I mean is it scares me a Mr candidate all what is Ralph's mean what Eric doing when he hears the name vis his life he skiing okay CNN you'll tell me what life is\nWhat does it have gender\nAll she's\nRight\nIt's everywhere Sunday night it's on a very special Sunday night locked gender what does it mean\nCNN but I didn't like to be bully [laughter]\nI guess the abstract theater it's a it's another CNN documentary that tells the people\nIn the middle of the country that they're wrong\nWhen he was national episode him [laughter]\nWhat's that mean the beach and for me to be ... [laughter]\nMy name's gender\nShe\nOf male female member that\nAs what we found out is that a a um cops are the enemy and anyone who has a a multiple genders\nIs it's courageous out there like a hero to be called the brave I'll cheat and that will be re didn't like to call them and I have to be the ... and ah I like to be so brave people like to say that I'm the president in China so they called me she still be brave\nI Know that I'm not really but I and ... now in a national identity\nCourage you have your your your your uh your your identity or national identity is actually fluid\nIn as sometimes Chinese Canadian other times I can be Canadian and then other times I Can't be from like luck luck than\nBurgers and you stop there for one moment here because I just don't think this happens enough and maybe you know I'd like to take a moment to tell you just how brave and courageous you are ain't yeah but you can't make up your mind I Love that as to how\nTo create an arm and I I Know that nobody is you know I Am but Twitter ... oh you do get in touch with her will make a moment of and everybody on their land\nBut you know I take a moment myself here junior but you know that the moment that you create is going to be a very brave courageous moment and sometimes\nSometimes and yeah I'm also identify myself as being ... and I don't even want to say it 'cause I get bullied so much for it\nThat was ... I'm Sorry I didn't know that were you bullied and was can I stop you for a moment sure 'cause I don't think it happens enough and media these days that we stop for a moment to literature\nTo listen to you but also to tell you um how great I Am by recognizing that uh you you are so brave to come to the bowling in your ally I thank you thank you because you may see me as a man but you may notice that I'm lowering my\nLike very sort of Swiss spring almost so that I don't trigger anything being very respectful I being very respectful and I just want you to know that I don't know if enough media outlets just come forward to let you know how brave men courageous you are only CNN [noise]\nI moved down here in the other one they wonder verification journey that are very very ... [laughter]\nEvery documentary that CNN does it doesn't matter what it's about what's this one called uh this is life moves in line that should be overreaching one or two percent of the population [laughter]\nThey're not playing opposite is crowded\nAll Africa and the subtitle of every document or should be ... you're stupid wrong that it was whether or not\nTrump ... you're stupid wrong\nIs whether or not gonna like we were going to you can't handle the world's becoming the post you make on Facebook is going to make you lose your job and we're not going to celebrate your break for\nYour thoughts your tweets can't so [laughter] this documentary we just we just dropped all the pretense this week on CNN\nAre smarter than you know after all we went to college\nIf you're a white man and you're in the Midwest turn off the TV no known on Sunday night didn't want to\nLeave it on and find out that you're wrong you find out how strong you are\n... were killed ...\nOn the other cat you know what we do we go down to local wherever they go over and uh you know sure support to go get that rainbow shirt you've been keeping in the uh\nNever going to do that I got out rose from the ... just last night or take the rules that any of it at a time out\nOther ... in the mid west they're they're a man accuracy in the improv weekly shirt that Milwaukee on the front okay\nVery oh we're going to go down there to wear them you know wherever they hang out whatever they're\nCalled gay people survival they get all my hairdresser the gate there aren't you doing today on the spectrum search under fluid grandad he even spectrum was only like ... times why sometimes\nYou feel like a lady you know your Keynes he doesn't remember that'll commercials and things I feel like sometimes they don't really have mountains elm enjoy\nAnd I can I jump in here and ask you a question\nCommercial or CNN spreading on each pack and saw a\nLet me check my rules I've got about to render TV [laughter] have you ever have you ever felt\nFifty four offers a fool line of pet certified water proven stain resistant flooring\nAnd then people are couldn't make it any easier they bring the samples to use it you can see that in your life and with your decor\nAnd fifty four really shines on the day of installation they move your furniture all the way your old foreign clean up\nAnd leave and now through the end of the mind you'll get\nFree installation and all carpet ... mentioned ... WSBIU receive an extra hundred dollars off the floor is the place to shop at your pets are doing well well what pets do in the house call eight seven seven fifty four I go online to the floor dot com bust schedule your free in home consultation\nSo stop worrying about what your pets might do your home and just love what they bring your life\nCall and we'll be knocking\n...\nMedia group station [noise]\nTwenty four hour news weather and traffic\nFive and a um a\nLot of\nGood afternoon it's three o'clock I'm Chris Campbell live and they told us to be twenty four hour news\nBreaking news from when you asked me twenty four hour news there\nBy any reasonable standard every sign points today towards confirmation for President Trump's Supreme Court nominee Brett Kavanaugh the latest you heard live on WSBIU just a few minutes ago chairman of the Senate Judiciary committee Chuck Grassley\nThis person is very well qualified person that believes in the principles of due process the presumption of innocence and readiness to serve are recognized\nSo judge Kavanaugh should be confirmed\nOn Saturday and that confidence comes after the senators had a look at that FBI file they just had a look at on the sex assault accusation from Christine forward against judge Kavanaugh has proven to be\nA six day investigation the deadline Ford was tomorrow one Republican after the other came out saying in this report in all these interviews there was no corroboration\nOf Ford's claim we heard induce a news conference from these Republicans there's also no confirmation of a second claim of sexual misconduct from a woman named Denver Ramirez turns out the FBI I've been asking about that too and reported we've found no corroboration Erick Erickson\nTell us what he tells his wife he has been hearing about what's in that report\nFrom what I'm hearing from Senate Republicans we're now seeing the report they say it\nThat report from what I'm hearing from some Republicans who now seem to report they see it largely clears Brett Kavanaugh of any charges in the ... the second accuser who went to the New Yorker comes across as not credible at all and\nFrom Jimmy to pre in Washington just now Republican senators are feeling increasingly confident I was just downstairs he says near the secure room or were they were going in one by one to look at this report and he says Republicans seem in a concert in ... we still do not know this is so key how mark ... Murkowski make that sleek and Collins will vote\nBut the feeling in the hallways of the capital is not one of impending doom for the G. O. P. N. all both Collins and flight potentially key swing votes today\nSay that they have found the FBI investigation thorough and complete and there was nothing new and it we have not heard from Murkowski at all cloture vote to cut off debate likely tomorrow\nAnd then be confirmation vote one way or the other some time on a Saturday Jimmy to pre predicting in about eight o'clock at night but that's of course subject to change so that's where it stands here\nAt the moment maybe five degrees on peach tree street is thrilled to W. S. B. meteorologist Kurd malice has the most accurate forecast on the way back to the Thursday Afternoon traffic next year's Doug Trimble\nBeautiful weather I mean just slow down right now we have it if they get out of anybody out there right before the downtown could I could ever really started university\nAnd now new message from Jamie confirming I hear what he had said earlier it's a bit more concrete now first test vote expected on friday morning for Kavanaugh and a final vote by Saturday afternoon or evening Jamie's those will be a day than of watching college football\nIn the nation's capital on Saturday DeKalb County woman has died from the west Nile virus we are told a warning from DeKalb County health authorities just happen to guard yourself against mosquitoes even though it is\nComing to the middle of October he's out with a hand injury dance be Swanson not on the roster for tonight's LDS game against the Dodgers in a way WSBIU time used three oh three\nA huge lake front liquidation is taking place this Saturday on one of the top recreational lakes in the southeast gorgeous lake Keely incredible like located just a short drive from Atlanta has it all beautiful mountain view crystal clear water and endless opportunities and Saturday\nYou can have it all or just pennies on the dollar for example I to wake our private lake lot he's he's forty nine hundred dollars yes for under five grand you can have two acres at Laiki away ten total like lots and all will be liquidated this weekend\nNeed more acreage how 'bout nearly four acres with direct like access for under twelve grand do you\nHave about there's two acres with a boat dock and mountain views for only twenty nine thousand nine hundred properties have wide paved roads underground utilities nice views and direct like access but they will all be sold on a first come first choice basis they Saturday\nOctober sex so call now eight hundred six seven five Eighteen hundred eight hundred six Seventy five Eighteen hundred eight hundred six Seventy five Eighteen hundred [laughter]\nYou got to work I Do have traffic in the express lane got here before the by well we're going to even complimented his hair ruckus\nExpressway and I'm now open and I mean five in five Seventy five to teach for America ... membership and get a significant for free AAA dark hair flash fast sat coms like AAA for town [noise]\nEverybody wants to feel like they're getting a good deal that's why he um see security customers love their monthly rate from just sixteen Ninety five a month\nIn fact for such a low price you think you'd have to sacrifice service or quality not with the um the security you get it off\nLow price a plus better Business Bureau rated service lightning fast response and no monthly contract to walk us what more could you ask for a while for a very limited time he and see security will switch your service for free visit EMTs security dot com recalls seven seven to nine six three zero three zero five to get started\nIs your home prices right for the market will the show and you get today lead to offers tomorrow one of the most common concerns people have one cell in their home is the uncertainty of what's next\nAfter finally making it through the inspection appraisal of negotiations will everything go right at the closing table selling your home can be stressful but it doesn't have to be Hi this is mark Spain and we have your solution\nThat guaranteed offer for mark Spain real estate a completely new way to sell your home without ever putting it on the market how does it work you can receive an all cash offer in your home and closing as little as Twenty one days how so free\nNo showings no open now there's no negotiations it's that simple you buy them or did you choose one you want to move then close with confidence\nThe team known for your home so guaranteed presents the mark Spain guaranteed all for taking our promise to a whole new level visit march Spain dot com slash guaranteed offer that's mark Spain dot com slash guaranteed offer\nUpper that's mark Spain dot com slash and guaranteed offer and start packing\nYou're rushing out to the car your hands are full you try to pull the front door closed and it doesn't do that properly then you look down and you might see a crack in the garage floor Doug Turnbull here that can be foundation trouble and that is a big part of your biggest investment you're home choose the foundation experts like I did Atlanta ramp jak [noise]\nTell us when you spend three o seven Doug Turnbull\nTroubled Seventy west Howell roads that are laying blonde jammed up there but it looked like do travel these freeway when he was down around but oh I see those later the trouble game travelers that ad Phillies on the west freeways you'll know\nYeah they do it's a pre cutting in the right and it got a right wing bloc twenty west found between we wrote and fair and read that puts you on the ... at the railroad crossing on how we how we Seventy eight and ... also causing the top of the rights that terrible\nAll you're picking up and all of a normal rush hour areas on the downtown to revive remember that crashed don't leave Seventy five sounds right before the sound of north side Dr troubles me\nWithin the Muslim world forecast for today mostly sounded a partly sunny near record high Ninety lows tonight sixty six to seven\nEighty five degrees at three o seven trafficking whether ... by ram jak of Atlanta I'm Christianity was Ninety five five and seven fifty WSBIU depend on it\nWas only thirty three more days until unit inside the mid term elections do have a merry go great [noise] I enjoy the slum happening\nToday and glad you're a part of the program right down a toll free telephone number is eight hundred nine four one Sean if you want to be a part of the program\nNewt Gingrich has been weighing in heavily on the comings and goings of the nomination of Brett Kavanaugh to the U.S Supreme Court the FBI report is finished and Republican after Republican after Republican says there is absolutely no new in permission\nIn this report none whatsoever Bob Corker\nActually set it offers hero corroboration which by the way we knew I had a time\nLimit you know the Senate Judiciary ... and I don't often give Republicans in recent years by any stretch the benefit of the doubt and I'm often more critical of them than Democrats Republicans have handled this\nThe appropriate level of seriousness\nThat this topic deserves knowing that there are evil people in the world that there are predators there are rapist there are people that committed horrible evil and atrocities a on a regular basis it's scary you're raising kids you know all too well\nFrom my home visits beyond the vicious portion rancor that is going on beyond\nThe accusation we don't lose sight of what this moral moment is about the country and also when we ask ourselves the question is this the right person to sit on the highest for you know land for a life time appointed Paul mentally\nWhether he's innocent or guilty but there's not a trial to fall asleep questions the rain that we should not ... the other candidates\nI mean just based on the allegations is that\n... is is now the party that doesn't believe in the constitution the rule of law due process presumption of innocence and this is a guy that admit to being a jerk when he was a teenager because he wrote about it\nAnd where are the calls to interview have the FBI interview Juanita Broderick all the same people sanctimonious as they are upset and they are if we allow this\nTo stand and it's going to come down and we're going to get into some polio ... this anger that is and righteous indignation has energized conservatives Republicans even never Trump ... believe it or not in ways that\nYou know they could never have had happened on their own you're gonna think the Democrats for this and it's going to have an impact thirty three days from now we'll get to all of that Newt Gingrich is going to weigh in on this and what will\nLisa Murkowski Susan Collins and Jeff Flake do what about mansion Heidi Heitkamp is out the only possible Democrat now that could vote for Kavanaugh is Joe Manchin of West Virginia that's a Trump plus forty two state in West Virginia that's going to be interesting\nHey I Want to remind you give you a heads up hackers exploited they security vulnerability on Facebook potentially exposing the personal information get this of nearly fifty million Facebook\nAccounts and the attackers stole the quote access tokens which they could use to take over people's accounts now those tokens like digital keys that people logged in with so they don't need to re enter the their password every time and Facebook they say they fixed the vulnerability they told law enforcement but\nIn this digital age you got to protect your good name your reputation your finances criminals can open a bank accounts take out loans Rob you blind your retirement account your bank account they can do it all even buy property and your name\nOr the way to protect yourself is what the all new life lock identity theft protection with the added power of Norton Security they'll protect you against threats to your identity or devices it's real simple just go to life walked out\nIt's real simple just go to like walk dot com or call one eight hundred life walk and just use the bravo called Hannity you get an extra ten percent off your first year and for a limited time right now when you become a member you'll get a twenty five dollar Amazon gift card\nThat white block dot com one eight hundred life laws to protect your name your reputation your finances and your future\nLife ... dot com one eight hundred like walk promote Hannity [noise]\n\nGet out of a media room\nIs Sean\nHannity show\n[noise]\nWhat did you travel by the way down that trouble on the freeway what the what about you rightly logged on to do it in the campaign but then on the deputy one at a gym in ... Evansville out now delayed\nAlso Judy von already loaded it worked out it was around twenty what's what Lincoln structured you'll know the north east\nAnd north and delays from Shelly Tucker have Indian trail four hundred north bounce only go from Glen reach up to the Marta station have on your cell phone on the brakes Abernathy to two eighty five and from bucket down to the eighty five merge this report brought us ... y shopping things of course this we pick up boneless beef Chuck roasts three Ninety eight a pound and forty eight ounce Friendly's ice cream\nTo for five dollars with your ankles advantage card angles low prices led the savings triple the topic of the\nGood news you are not stuck with your health care plan really you have a choice and it's a great when it's called met his share and if you've heard about it and wondered what exactly it is it's a way that people share their health care bills\nAnd these are people who have a common face you want to be part of something beautiful and it's people who loved to save money\nBig time Medicare members typically save\nFive hundred dollars a month per family on their healthcare costs that is a life changing for people so this could be for you a way to pay health care bills that's not only very smart financially but it's even profound met a share is a nonprofit with four hundred thousand members nationwide or pray for and share with each other\nSo yeah so you're not stuck there is another way and it could save you a lot\nCall star star to six nine to receive a text and be connected to a met a sheriff and find out how much you can save on your healthcare messaging data rates may apply cost star star to six nine that star star to six nine\nPrices are for these buildings all you're not a good windows doors ... attentional business owners who rent or at least space including storage space stop wasting your money paying someone else for your space you can now see but a ton of money and own your own building with the incredible sale prices from\nGeneral steel it's right now you can save as much as half the time and cost of conventional construction and stop renting speech from others just college seven seven forty seven steal to see how general steel can help you save money or fifty years structural warranty buildings are\nCustom designed for your needs you can get a forty by sixty foot building were less than twenty five thousand dollars for a fifty by one hundred Klinsmann building for under forty thousand dollars there is no wasted space and construction takes half\nThe time college seven seven forty sevens deal with strong construction spending in high demand this special pricing will not last long college seven seven forty seven seals and get your options pricing package on dozens of building options college seven seven forty seven seals and see how general still can save your money ... eight seven seven forty seven steel\nDefeat seven seven four seven seven eighty three thirty five eight seven seven four seven seven eighty three thirty five\nDead pumpkin times and pipe nurseries having huge selection of everybody stay regarding your front porch had the season with tons of airline and pumpkins and eye catching shapes and colors like beach ...\nRed white and gray greens plus getting classic orange pumpkins for Jack o' lanterns and pine may come as many medium classic pumpkins if you can carry but just Nineteen Ninety nine and did you know right now is that perfect time to plant\nTemperatures combined with a warm soil stressful for plant and make it easy for routes to grow sunflowers like ... dragons in Mars nightmare said that the last election of trees and shrubs do\nValue is booming chameleon Japanese maples ... more like nursery guaranteed their trees in trust for life you can plant with confidence and you need professional help to beat her but we'll talk about our planting and landscaping tight nursery starting with I\nOf games and play and and the hair\nI Know what it's like to be a burglary victim and I'm not alone I Monica Kaufman Pearson for loud security and the statistics of frightening and it doesn't matter what neighborhood you live in every home is a target listen to this resident of east cop you never think it can happen to you we live in a safe community\nWrong one night out or an afternoon at work is all it takes\nEverything a value is gone jewelry electronics I let my family down and that feeling of violation it never really goes away my husband is retired assistant police chief and we've been loud security customers for ten years having a top notch security company protect our home with a necessity\nNot security company protect our home with a necessity\nJohn Loud president allowed security says it best it's better to activate your security system thirty days too early instead of one day to lake called now at six seven eight get loud and get a free total connect camera two hundred dollar value and you'll have the peace of mind knowing your family had twenty four hour monitoring of Berkeley and fire\nSlap security is Honeywell authorized security and fire alarm dealer [noise]\nAdvocate haven't traveled vibrating Gabby right laser blonde about what he wants to put all the delays there the downtown rides low Seventy five now grass right lane below\nTwenty down to the University in regard to Seventy five at least averaging ...\nBringing bringing ... traffic you asked me\nWhy don't we roll long Sean Hannity show a lot of news ah we have going on today are FBI report is now in senators have seen it I Love the Democrats actually this is a cover up\nA cover up of what with all the\nTime seven heating gates and we know that they known about this since July who is covering up what what did the FBI cover up beyond asking\nThem for people identified by professor for that that we're at a party where the alleged attack occurred what else is there to do when you don't even know the location\nWhat are you supposed to do in the case of Mrs Ramirez or just brought up or the ... and Julie sweat Nick who's changed his story dramatically and backtrack dramatically in in in an interview mentioned people to corroborate that they don't even know who she is or their dad\nIs nothing left now Jeff Flake ensue Susan Collins this morning of if there's any indication on how they're going to vote those two votes are needed\nThese are Murkowski said she doesn't know yet doesn't read it she wants to take time and actually read it in ... blah blah blah blah but Blake said that the new NPR report on Kavanaugh's failed to corroborate professor Ford's allegation of sexual assault against the Supreme Court nominee\nAlly dirty air dirty water besides Mitt Romney binders of women\nKill grandma Paul Ryan throwing granny over a cliff\nWant to kill children they only want to increase Medicare seven percent a year not ten percent a year that that means they want your grandmother die they don't support extreme environmentalism that makes American business less competitive they ... they want dirty air and water\nThere's been a collective left wing melt town\nThey have now the now collectively the media the Democrats bordering on other psychosis as it relates to all things Trump these are fundamental basic American principles that should apply to all of us the presumption of innocence and due process\nNow a professor Ford's attorney that well now they claiming they have no witnesses to corroborate the testimony\nWell why didn't she mentioned it before the Senate a week ago or why didn't she mentioned it in the Washington Post\nIt'll now there's an outright attack on the FBI by\nThe very people that defended even call me and struck and page and McCabe and and some others\nYou know the lawyers the the liberal hacked Deborah cats lawyer that Dianne Feinstein helped arrange for professor Ford that didn't believe Paula Jones and supported Al Franken investigation conducted over the past five days is a stain on the process on the FBI and our American ideal of justice no the stain is\nThe fact that that so many people rushed to judgment no presumption of innocence guilt by accusation I Believe this person or that person but you know nothing about any evidence in the case you've made a decision\nThat's now beginning to show up everywhere in the polls president today as his highest approval rating of fifty percent for asked me to sit by nearly two to one margin voters agree the judge Kavanaugh's treatment is a national disgrace\nThat we see what the Fox News poll of this big blue wave we heard was about to crush chosen thirty three days you know the the now calling it the cabinet effect and it's impacting Democrats all across the country Quinnipiac poll at the Democrats generic generic ballot lead for house races cut in half\nLiterally almost a dead heat at this point is you have to think Chuck Schumer and and company for rushing to judgment in and being willing to bludgeon and in character assassinate somebody without any evidence of gr operation you got a significant uptick in GOP interest in all five state surveyed Missouri Senate race is now dead even\nAnd for a an incumbent only have thirty three percent that means that Claire McCaskill at this moment is losing in North Dakota Heidi Heitkamp is down by ... you got a dead heat in Indiana that wasn't the case we're going to find out what happens there and I'd say the same thing\nWe're going to find out what happens there and I'd say the same thing with Joe Manchin we'll see where he goes and I think important races in Arizona Martha ... Sally Dean Heller of Nevada\nScott in Florida you know but all these congressional races matter too because we know what they want to do they want to they want to have a list investigations just like this one that'll start if Democrats take over the house in ... the speaker and Maxine Waters chairs committees and Chuck Schumer is the head of the Senate but Senate majority leader\nAll the progress on your economy say goodbye to all of that new survey today more Americans getting pay raises more than ever before\nAnd the studying turn the Republican quote base has awakened\nIs the article the headline than a ablaze dot com report in July Seventy eight percent of Democrats said that the November elections were very important only sixty percent of Republicans said that well now it's eighty two percent of Democrats saying is very important and Republicans now with eighty percent\nYes you can think Democrats were passing off what is a I built in to the core fundamental fairness that exists in the American people within the margin of error the Senate race out in Arizona it is a ... an exact time now in Missouri as well that's a dead heat\nAnd if you look at it in a Arizona's a to point race and this is getting pretty interesting as you go through all of these states it's now a to point race in Indiana Michael Braun is catching up to Joe Donnelly use of no Claire McCaskill no on Kavanaugh is the people that rush to judgment in cases like this\nAnd we're going to watch all of the Senate races and watch them all very very closely because it's going to matter North Dakota forget it it looks like it's over for Heidi Heitkamp Kevin Cramer is up fifty three forty one today\nIn a new poll that came out we have a poll that came out in Tennessee Marsha Blackburn is now what by fine she was trailing by four\nThat's an important race Marshall would be a great senator by the way if you're in Tennessee she need your support big time if you look at all these racist they're all close and it's all going to come out to turn out and that seems Republicans have finally understanding that there is no vision\nIs NO PLAN or policy that's going to make the lives of the American people better that anyone's proposing is an interesting side bar I Want to play those that from the American civil liberties union is spending over a million dollars comparing Brett Kavanaugh again no presumption of innocence the people like Bill Cosby and Clinton listen\nWe've seen this before denials powerful man I did not\nI never seen anything like this categorically unequivocally denies the allegations against me by Dr Ford American he's watching we choose a lifetime the highest court manners\nTo confirmation of judge Catholic\nOr joining us now NOAA that as being run by the ACLU by the way an Alan Dershowitz lift them up the other night on TV Mike Myers\nIs a a is a long time writer in the New York area and believe it or not I think he's far more conservative than there will ever meet a meds but he actually was on the\nWhat were you at your the vice president worry for a period of time and I was I'm a member\nOf the national board of directors for the ACLU from Nineteen eighty one to two thousand and five I was also a vice president of the ACLU and that was a voting member of the deck of this committee\nYes well I guess you're going to say I mean I\nI Am as you know I'm a liberal\n[laughter]\nHow do you how do you great Trump's performance was president I don't [laughter] as America better off than it was two years ago I'd\nI'd I I my organization and the uk civil rights coalition is truly non partisan\nYou can answer that question do you think that Donald Trump has done a good job and I said I Want to answer\nThe question of about what the heck is the ACLU doing\nWell you in on the national board in Nineteen eighty one to two thousand and five tell us what are they knew you\nWere supposed to be a non partisan organization is nonpartisan except when they are not more often they are not\nThe ACLU now become a part of the resistance movement leftist progressive organizations that have fight it on their own against Donald Trump and they are they are not used to go on the side of\nThe presumption of innocence they used to be on the side of the accused that they accused of a right to contest charges to confront witnesses against him no now they're not for the ACLU has been hijacked by the left wing crazies lunatics\nAnd I it as a member of the ACLU long time since I was a youth since I was in high school\nWe balance by the ACLU so it's not just Alan Dershowitz who is calling out the ACLU some of us have been calling out the ACLU now\nYou some of us have been calling out the ACLU now for years because\nIt has it changed the organization you know I I've been in this business wait too long because I was broadcasting in the Nineteen Ninety six in the Atlanta area when the Olympic bombing happened and I learned a lesson when everyone else rush to judgment against Richard jewel but we've seen it with Duke lacrosse we've seen it at UVA\nWe've seen it in burgers in Missouri in Baltimore, Maryland in Cambridge and\nTrayvon and George Zimmerman and I think there was a rush to judgment and never bet Obama either but you know where we we take our time and we look for is there any cooperation do you see any cooperation and professor of orange story\nToo often the ACLU is common knee jerk they were in Egypt where the Trayvon Martin situation they immediately so it was Obama ... bomber I'm telling you the ACLU as a partisan organization\nBut here's my question do you see any cooperation to the stories of any of the three main women not the other stories that have already been debunked because it's not like Brett Kavanaugh never went to Rhode Island and his life\n[laughter] [laughter] oh I think that all all the so called witnesses\nHave either been they've the bunk all contradict it so I don't understand the eighth or use opposition to a nominee for the Supreme Court when they're used to be their policy is to not to take a position on\nWhat is in our mellowed out the Democratic party today I'm arguing their party that doesn't believe in due process the constitution and ... presumption of innocence\nApparently they believe in people who um\nWho don't believe in the things we used to believe in and we used to believe in freedom of speech\nWe used to believe in a presumption of innocence\nWe used to believe in due process of war or used to live well even fairness fundamental fairness now you have to believe what they believe and you have to assume guilt you have to assume guilt about people who are on the different side a part of a point of view on different side of a political issue\nI Want to create a new boyfriend\nAssault going on WSBIU none of these allegations are true no doubt in your son or did you believe [noise] having a board hearing me they were inside the hearing\nRoom I was telling us bees and Jamie do pre what a day this was before the Senate Judiciary\nCommittee covers continue to the bottom ... percent W s\nP is where you need to be depend on it\nThat way you ask me about 'em doorbell er Cox media group station [noise] twenty four hour news weather and from five AM's\nMe want to\nKnow it is for clog an afternoon\nOn Christians alive and they told us be twenty four\nNews [noise] now taking the Hart office building in Washington and the atrium at the Capitol police of the gun removing\nSome of them it is not violent is just while those protesters are mad about today's chain of a bit\nMe do pre two point oh I'm Jeanie\nDo pre in Washington the FBI review at this point has not changed the dynamic on judge Kavanaugh this is a search and destroy missions GOP senators still on board with the judge while Democrats say the FBI review fell short\nI Am extremely disappointed that they were so narrow scope\nThe Senate is headed for the first test vote tomorrow morning and the final vote on judge Kavanaugh maybe by late Saturday afternoon\nIt's eighty five degrees on Peachtree suited for one double you asked me meteorologist Kirk mellow says near record high temperature today we could even break the record high wind is most accurate and dependable forecasters on the way not trouble team traffic Doug Turnbull\nRiding down down it's going to be monitored about Seventy five an hour bill died when he worked out through from one\nOr the humidity is what he was forty nine out about ... miles lane highway Ninety two thirty seven Seventy eight year old ... once again don't get\nTo anybody's done already and go from four hundred overpass memorial drive that right taken you thirty eight minutes how the outer loop Alex Williams\nConstruction because you'll be out there for another hour or two eighty bodies found the out of ... county ... forty eight ... back to six Seventy five new stall stolen the out of ... west bound Ashford done what he second right lane ... blocked\nYou're slow before shampoo done when he's been delays bashing arousal wrote slogan approaching I Seventy five then just on and off the break so far to eighty five south down through smarter binding down to the west ... triple ... W as we uh west\nNile virus has killed a Dunwoody woman kept county distracted sending out a warning to camp\nCounty is a hot spot for West Nile so Sandra Elizabeth for district director of health in DeKalb County\nWe have so many positive holes in this county which means the mosquitoes are out there\nIn addition to the Ninety two year old woman who died in ... also has another human case and a younger person she says as long as the warm weather hangs around so will the mosquitoes that take steps to protect yourself from mosquito bites Sabrina cupid ws\nAfter what seemed like endless debate in some major changes as well Mart is nearly three billion dollar expansion plan was approved by the board\nFirst first this is W. B. twenty four hour continuing news and I raise roster\nIs out and as expected it does not include shortstop dance be Swanson who was out with the hand ... even though the games out west as you can imagine things are busy busy this evening at sun trust park and at the battery\nHere at the home of the Braves and battery ACL they are getting ready for tonight's game against the Dodgers there is a lot going on landscapers are pouring down new mold\nThere planting flowers ... other workers are hanging different banners along the Atlanta Braves sign here in the middle of the battery the watch party gets underway at eight pm tonight there is another one tomorrow night starting at nine so you can read the a ... you've raised here come on down to the battery and cheer on your home town team\nThe battery Michelle right WSBIU\nParking free in the red green and purple ... for the first four hours for fans this evening WSBIU ...\nCamp the Abrams Georgia's future is in your hand follow Georgia's race for governor every day with guns played Erick Erickson ... largest news team nobody covers Georgia's elections like news Ninety five Pan Am seven fifty you asked me and on it\nFor years I'm encouraged you to get your heart scan it virtual imaging but did you know that they also do cancer scans that detect sales at the earliest stages costs seven seven zero seven three zero zero one one nine or search virtual imaging H. T. L. dot com\nYour comfort in safety is dependent on your heating and cooling system you're relieved that made it through the summer and we'll make it through the winner gets shared assured comfort heating ... schedule your fault seems not purchased forty nine dollars offer ... details at a certain comfort dot com guarantee service\nWe're twenty in detail at a certain comfort dot com\nGuarantee service on time sunrise prescribe I'm Jerry Hall and I assure\nTime done right right\nBut it was written welders at age ... Georgia you ever wonder trays of a media joined refer Rogers are hiring right now is your wages an excellent benefits information visit Georgia ... jobs\nA huge lake front liquidation is taking place this Saturday on one of the top recreational lakes in the southeast gorgeous lake Keely incredible like located just a short drive from Atlanta has it all beautiful mountain views crystal clear water and endless opportunities Saturday\nYou can have it all or just pennies on the dollar for example I to wake our private lake lot is forty nine hundred dollars for under five grand you can have two acres at Laiki away ten total like lots and all will be liquidated this weekend\nNeed more acreage how 'bout nearly four acres with direct like access for under twelve grand do you\nHave about there's two acres with a boat dock and mountain views for only twenty nine thousand nine hundred properties have wide paved roads underground utilities nice views and direct like access they will all be sold on a first come first choice basis they Saturday\nOctober sex so call now eight hundred six seven five Eighteen hundred eight hundred six seven five Eighteen hundred eight hundred six Seventy five Eighteen hundred\n[noise] you're going to\n... actually get it right we\nTold us to use six year is\nDoug purple you notice when he was about it I when I Need to exit thirty constructed as we are but it's going to take twenty minutes later over from either by getting mediocre on any ...\nAbout a guy we want to get one Georgia you'll know according\nTo North than heavy delays from the old ... up to the north springs Marta station on you're going to go out to come in for hundreds out back plus you're from the station down to two eighty five and then from bucket down to the eighty five ... northwest Alex Williams\nSeventy five north down just a brief data to break from the south blew up the highway five five Seventy five north and I've been checking for trouble up around ... haven't seen it to slow traffic breaks review there as you leave I Seventy five triple team tried to W. S. E. I'm familiar\nWith what's happened to them all forecast for today\nMostly Sunday to partly sunny near record high Ninety Los tonight sixty sixty Seventy tomorrow mostly sunny continued on seasonally hot high now below sixty eight Saturday mostly sunny high near not eat low sixty nine eighty\nFive degrees of peach tree street at four O. seven I'm Christian ... why does exclusive twenty four hour news weather and traffic station he was Ninety five five and seven fifty W. S. B. depend on it\nWas only thirty dream or do you decide mid term elections do have a merry go great what\nBeen dealing with the show either town [noise] the downhill slope that show has put us on Israeli dealing with a demolition derby [noise] and we're just about destroyed a good person to be on the Supreme Court\n[noise] so [noise] hopefully we're forty eight hours away from having a new person on shrink for\nSenator Chuck Grassley the chairman of the Senate Judiciary committee glad you're with us our to Sean Hannity show right down a toll free number it's eight hundred nine four one Sean if you want to be a part of the program\nAs now they have moved ahead last night during Hannity the TV show with culture and we should have a final vote up or down confirmation of judge Brett Kavanaugh\nAnd after the FBI report came back in ... basically just confirmed what the Senate investigation Peru which is of course that there is no evidence no corroboration of any of the allegations\nAgainst judge Kavanaugh here to go through what has been a horrible Seventeen Days for him and his family I don't know if he ever gets his good name back in the end I don't think people will ever forget\nWhat he has gone through in the allegations that have been made against him and former speaker of the house Newt Gingrich and\nThis of course all with the backdrop thirty three days from now the most important midterm election in our lifetime Mr Speaker thank you for being with us the FBI report is back now the Democrats won more up investigations nothing seemingly will ever satisfy them\nI I ... first of all it's great that you were actually on the air I think he and Lindsey Graham [noise] with the Republicans who did the best job of getting us where we are now I get the impression you you make a more information than I Do but I get the impression from what Senator Flake said earlier\nTowards Republicans now I think that the ... were almost certainly now going to keep the Senate and probably going to increase our uh\nSenate and probably going to increase our or the total number of senators pushing in Marjah\nHeidi Heitkamp of North Dakota who's down eleven is no on Kavanaugh to me what a fork in that race it's over\nAgain I think Kramer and it was a great great guy I'm I've known for twenty four years and he's got to get out there and keep campaigning I mean one one of the lessons you know I I had very close races including a couple of recounts and I had very big raised my experiences\nAnd I said it's every candidate do not quit to the polls closed and do not relaxed until the recount has over a this is a business where big things can happen\nVery fast the American people are in charge not Bloomberg hundred million dollars not shores is millions\nNot any of those left wing or in the ... the genius of America is it the American people are in charge and I believe that they're going to send a big signal to the left miners so they really don't like they don't want to live in a country where you smear lie assassinate character and believe that you can get away with it\nI even think it's where I think they like to bludgeon people with absolutely zero consideration\nOf the impact that has on them families with a with a total disregard for any\nTruth or corroboration\nQuick break right back more with former speaker of the house Newt Gingrich thirty three days out of the most important midterm election in your lifetime the refresh leadership ... past events coming up on Wednesday October the twenty fourth write it down hosted by our friends at expressed pros dot com\nOr they're celebrating their ninth year there were a fresh leadership same old cast\nIs going to be hosted down two hundred locations it's a very unique event you can recharge all your leadership skills will will help inspire and motivate encourage your team\nRegistered today refresh leadership dot com slash slime overcast refresh leadership dot com slash ... cast you gonna learn how former president of Adidas North America mark king encourages creativity incompetence with big dreams vision an energy\nJoined expressed prose this year at the we're fresh leadership same overcast all happening Wednesday October the twenty fourth that helps with networking and inspiration register today we're fresh leadership dot com slash same old caste or just go to your local express employment professionals office that express pros dot com [noise]\n\nArea are ready to get out of the media spin\nIs Sean Hannity show [noise]\nFor twenty two Doug Turnbull W as the writing on five and getting up and to gab county leveling construction and the right lane crab to anybody about the outlook blanche old egg deporting any January I think Seventy five\nOr ... what he is an altered the rest of the five of the what are you just a normal winding along our vote only for you but it doesn't look what he was Nineteen thirty seven all over ten minutes an extra ...\nAccording to what they don't stand out from the old told has up to the north springs Marta station four hundred pounds Sonya from Marta station down to kill deciding from down to the eighty five merge and you're not north on these will slow down from South for our past Indian trailing from several of them all George I North West Alice when\nSeventy five north down a little slow zone from the south one twenty up the highway by then again ... five Seventy five up the ... five Seventy five north bound you're on and off the breaks the whole weight reading I Seventy five up toward highway Ninety to triple team traffic W. I. C.\nLike so many of us suffered from insomnia but I'm doing better than ever thanks to my friends at my pillow and my friend my Glendale and not only do I fall asleep faster by stay asleep longer and now you can to it's really simple just go to my pillow dot com or called toll free eight hundred nine one nine six zero nine zero\nUsa ... and you get one of my best offers ever his special for pack\nYou get over fifty percent off to my pillow premiums and to go anywhere pillows my pillow was made in the usa has an unconditional sixty their money back guarantee end of ten year warranty just go to my pillow dot com or call eight hundred nine one nine six zero nine zero\nUse the promo code ... Mike special for pack offered you get to my pillow premium pillows to go anywhere pillows for over fifty percent off those pillows arrive you start getting the kind of peaceful and rest bowling comfortable and deep feeling and recuperate asleep you deserve America My pillow dot com ... code Hannity\nHappier much care foster really know what it was a lot\nShe is a hundred and five pounds of shiny happy dog for life the shedding staff itching and stopped\nSince two thousand and one we've held more than a quarter million dogs get over their nutritional deficiency misery\nA quarter million dogs get over their nutritional deficiency misery and saved our customers Brazilians and vet bills\nEverything we tried sail except of come to nine of I proudly I. N. O. V. I. T.\nIf he wants to talk now you gotta pay the ...\nThe legacy fatty I think the digestive items that are cooked out a regular dog\nFight is Tricia dying to fight for life\nDon't let your dog itch scratch stink or shed like crazy come to China for help\nEight five nine four to eight went out eight five nine four to one thousand I N O T\nHey folks it's God's late here for my mortgage professional fringe of Milan\nWhere the tip of how to make sure your offer on a new home we've taken seriously you know it's a seller's market\nLet's say you make it off or own a house you really want but you only pre qualified by your lender I suggest you call mileage I get a full pre approval letter there's a big\nDifference in Milan has all the mortgage options loans up to Ninety five percent when the mortgage insurance one hundred dollar down programs Ninety percent jumbo with no mortgage insurance reverse mortgages first and second loans I was saying it for years\nIf you had any mortgage need you need to call my friends at mile it they'll spend the time but do you make sure you are the best mortgage for you you'll get the white gloves service\nWithout the white glove price so called seven seven or eight months seven two thousand that seven seven or eight one seven two thousand on line it's my land dot com spelled his M. I. L. E. N. D.\nGeorgia residential mortgage licensees Seventy three forty and I'm On this one for eight seven six night mileage located in eighty nine Ninety five west side park like Alfredo Georgia three zero zero zero night Milan is an equal housing lend\nA huge lake front liquidation is taking place this Saturday on one of the top recreational lakes in the southeast gorgeous lake Keely incredible lake located just a short drive from Atlanta has it all beautiful mountain views crystal clear water and endless opportunities Saturday\nYou can have it all or just pennies on the dollar for example I to wake our private lake lot he's he's forty nine hundred dollars for under five grand you can have two acres at Laiki away tend to little lake Latino will be liquidated this weekend\nNeed more acreage how 'bout nearly four acres with direct like access for under twelve grand do you\nHave about there's two acres with a boat dock and mountain views for only twenty nine thousand nine hundred properties have wide paved routes underground utilities fees and direct like access but they will all be sold on her first come first choice basis they Saturday\nOctober sex so call now eight hundred six seven five Eighteen hundred eight hundred six seven five Eighteen hundred eight hundred six Seventy five Eighteen hundred [noise]\n... you have your writing down ... started ...\nUniversity of Missouri's\nPretty by double the ws the\nThe house Newt Gingrich no I I Will say this if we allow this to get rewarded and they get power as a result of this or look we're not going to know till Saturday of impact judge Kavanaugh is confirmed and\nYou know I I Hope Susan Collins and Lisa Murkowski are satisfied I Know who Susan Collins says she was satisfied with the FBI report and Jeff Flake said the same thing I don't know where Lisa Murkowski is he has not spoken publicly as of now but I Hope we don't reward this behavior because if we do\nTo me it becomes a tipping point in the country where you're just going to get more of this\nAnd anybody that the Democrats don't like is is going to be subject to guilt by accusation and this type of smearing and slandering that goes on I'd also like to see a change in the standard in the law if you're a public figure well do you have to show and this is the absence of malice how do you prove an absence of malice\nIt's a ridiculous standard that nobody could ever reach which is why people like you and me whatever with people say about us we get stopped taking it sure looked\nLike limited shake I think that overwhelmingly the American people do not want to reward that kind of behavior and I think you know they look kind of surveys we're seeing now are amazing people have moved\nVery significantly in the last week and it's in reaction to how despicable oh and how vicious and how personal [noise] ah the Democrats have been and they brought this on themselves and I think that they're now going to reap whirlwind\nThat ms Ramirez was calling her former yell classmate said well I don't remember I'm not sure do you think it might be judge Kavanaugh that and of course then gaps in her memory and being an e bread it early\nAnd I don't even want to get into the whole issue of Julie sweating that can you know she goes on NBC News why this ever got reported is beyond any understanding that I have changed your story backtracking from a story in a multitude of ways mentioning that there are four eyewitnesses in her case one dead and the numbers\nWitnesses in her case\nOne dead and the number two person has no idea who she is no idea at all\nAnd the allegation that on almost on a weekend basis that young boys were drugging young women and lining up in the halls and then raping gang raping these young women\nAnd then that involved into well I'm well Brett Kavanaugh I saw it near the punch bowl so it may be probably was one of them and he gave out red solo cups I saw them give out red solo cups wasn't lined up in the hall but he was in the hall I saw him in a home and nobody else can corroborated\nThey wouldn't never getting the answer that they want it but there's they've all known as the smear so now they're just\nMe or the FBI investigators in this case that did what they were supposed to do there never was going to be a recommendation or a conclusion made by the FBI we learned that from Joe Biden in Nineteen Ninety One\nBut that wasn't the purpose of any of this their whole their dream their prayer was that the FBI would find the smoking gun that didn't exist based on the accusers own words in each specific case\nAnyway joining us now lead you with us by the way eight hundred nine four one Sean Dr Sebastian Gorka former advisor to President Trump author of the\nSoon to be released book why we fight Monica Crowley is a contributing editor to spectator you as a senior fellow at the London Center for policy research and welcome both to back to the program Monica we begin with you I'm listening the Democrats didn't get what they want but it never was coming was it\nNow because it never be enough for Sean very smart reality that none of our ships they cited and that is that the left is that war\nThere at war for the future of the country they are at war against the constitution they're at work and it's free market economics there weren't gets individual liberty and everybody's there are at war with everything that judge Kavanaugh stands for and both for\nOn the Supreme Court therefore not only can be blocked you must be destroyed because if you had to reset to the highest court route and that means that the left is no longer able to use the highest court in the mind to slam treated their agenda\nBecause lord knows they can't necessarily get it to the ballot box for decades they've been lying on the judiciary in order to affect their left on the agenda and they know what happened on the bench and potentially over forgotten and they're going to have to change tactics that's why they have\nI don't know if they ever ... this is the only play both that in all my years of now Thirty years in radio now having but gun my you know while on two days I'll begin my twenty third straight year at ... since the day they launched the channel\nAnd I'm One of the remaining original boxers\nI mean I got to tell you that things have not changed that and that's the point Dr ... that they don't change their tactics\nIt don't seem to have any concern at all for the fact that there's no corroborating evidence in any of the cases that they have brought up now they're sending out or at least Deborah cats as friends are sending out these phishing email saying you know something please we need your help hurry up please write us now tell us\nYour absolutely right so I wrote a piece today in the hills\nUm which is a kind of summary of my my book why we fight if you're surprised at what capital has been put through this trial by what field is this column or it shouldn't be then you have no historic perspective the Democrats have been doing this for a century now\nGo back to Nineteen forty faith and the case of Whittaker Chambers his was the first ever televised live televised testimony before Congress and what happened that this is the man who was a former communist who knew where the communists were inside the\nUS government including out his love by the Democrat Party senior State Department\nOf former officials he told the Congress this guy's a Soviet a joke I was the person carrying secret messages from Moscow to out to his out to his denied it but because he he was a a darling of the left they took\nWicked chambers and they used a ... of everything you can imagine as they used them or not only being unfaithful to his wife they used it in the back of his brother\n... of the accusations are true I'm a loan officer with the change has died when the load a a a communication with the classics like we have the proof that out of his was a Soviet spy so sure they've been doing this since at least the second World War I bought it because that's the right there doing this because they are war\nWith the will of the American people we told we chose Donald Trump Donald Trump chose judge Kavanaugh and that is why drugs capital must be destroyed so\nWhat are these three Republican senators do a Collins and Murkowski and of course Jeff Flake and then what is Joe mansion and the high camp who's down by a Lebanon North Dakota do Monica\nWell I think they've gone from the comments we've hurt today Sean from Senator coming in particular looks like they're pretty satisfied with the FBI investigation on and it looks like they could he asked his flight crew knows he's the quake so who knows what he's going to ...\nFirst half of October they're extremes tapes are on sale the second half of the month they're running their Franklin Stein event and that means you can save hundreds of dollars on the liberty customer favorite uh Franklin an extreme series during these two sales\nWhenever you have to protect jewelry cash documents important papers firearms do it with a liberties safe and that was the perfect time to become a liberty said Boehner they have twelve months interest refinancing unapproved credit\nCheck and check out the special details at liberty save dot com or more time liberty faith\nDot com [noise]\nOften acts to our final round of ... and information all\n[noise] [noise] [noise]\nFor the job done blood and the guy got a travel advisory all the album out of five and he's got a bit of right leg crashing the Lakers ruptured at lunch all day but it more to the gym you're back to ... and we have\nToday by west itself out of this spring there you're really slow or four hundred all the way around I Wonder if it was pretty\nHeavy traffic sunshine in your eyes or in writing down on the debates about an hour and the guy got if you go from Georgia hundred around\nToward will drive north nobody wrecks at a problem or the way but you're definitely going to be able to get up to the trail area and then they get from oak tree pretty sixty about about forty five minutes to go from\nI drove trouble\nDon't give me that during the headlights look you know Georgia's distracted driving laws enforced but that doesn't mean you'll ever be stuck in traffic just download the app and keep your hands off your phone\nWith us these seem traffic alert them on your phone your golden bf before you begin your commute travelers are automatic ... bone loses enabled ... nobody sees your traffic alerts that we move you\nKnow\nThat when you asked me about ... media group station\nTwenty four hour news weather man from\nFive AM's\nMe\nThat afternoon it's five o'clock I'm Chris channel to live in the W. S. B. twenty four hour news center police\nArrested this law allowing chapters has more or less occupy the Hart office building in Washington and the capital and Kevin on Supreme Court nomination today seems to have cleared a major hurdle\nBut it is still not a done deal for me do free to point when Jeannie\nDo pre in Washington so far the FBI information related to judge Kavanaugh has changed ... has\nBeen no one to corroborate any of the allegations made by Dr Ford Republicans\nSticking with Kavanaugh while Democrats said the review didn't go far enough\nHe was a very limited Bronx is the first\nTest vote is expected tomorrow morning with a final Senate vote by late Saturday afternoon or evening\nAnd it's down to math now of course had the potential swing votes of those\nCollins and flake both they say they are satisfied with what they have seen today promote FBI report eighty six degrees on peach tree street it's five oh one double USB meteorologist ... militia has has the exclusive five day for canceling the way natural team traffic ...\nEverybody ... right on the connector is Seventy five or anybody else that's going to take about thirty minutes from the get down to I Want to go down to the county but with no record of the way from or University in order\nTo survive nor this after getting\nOver it or we're almost out of the gas\nUp to five out the rest of the perimeter\nDelays to what he find westbound starting Ashford ... Seventy five out bounce back an impact ... down to the west freeway and that pesky left lane construction and steal their two eighty five east bound the little bit ... plane delays from six Seventy five ...\nToo and he's on he's done already going do from Ashford nobody overpass memorial drive now fifty one minute ride the brakes on the west bank ... north down from South drive up to Cumberland crippling traffic can be a speedboat\nWhichever way the cabinet vote turns out you couldn't escape the story this past couple of weeks certainly what have you told your kids\nAbout ... says her Fifteen year old daughter has doubts about the allegations against Brett Kavanaugh raised by Christine Blasey Ford saying\nThere's no proof tobacco what she's saying\nBut what's more important for June July was that her daughter's learn something from all of this\nHow to avoid situations that you don't want to be in and how to get yourself out of the situation if you end up in one that you're not comfortable in\nVictim advocates say that's a good way to put it and they say the earlier to hear that message the better Pete combs ws\nFirst first this is W\nFirst first this is W. S. B. twenty four hour continuing our workplace\nVilla Braves jerseys today that yours is to channel to sports directors that climate against our playoff team coverage from Los Angeles raves\nAbout to leave the team hotel make their way over here to the stadium where they will have batting practice at six forty getting ready for tonight's game\nOn as expected dance to be Swanson not on the roster for tonight he's out with a hand injury rates fans can still watch the game it's sun trust park WSBIU Michelle writes that the batter will\nBe lots of things going on two giant screens broadcasting the game they'll be DJ they'll be mascot there'll be things for the kids to do right now landscapers pouring down new mulch and planting flowers as all of their workers hang banners along the giant Atlanta Braves sign here at the battery\nIs is it eight o'clock tonight parking free for the first four hours it has been three months now since George's new hands free law took effect in New numbers out today show it is making a different\nFrom the Georgia State patrol show the number of accidents dropped two point five percent in July the first month the new hands free law took effect an eight point nine percent in August over a year ago representative John Carson who wrote the new law that is clearly happening in effect\nIt just shows you how much of a distraction and how dangerous it is to be distracted by your phone while driving\nThe number of fatalities was also down eleven percent from a year ago it\nDefinitely had a trial run and it's still a little distraught run but I think we're having some early success\nOr perish devil you buy\nThe important health alert this afternoon in\nNinety two year old woman who early this morning from West Nile virus had\nWoman from Dunwoody into cap health director Sandra for their says they've got another case too she is warning protect yourself from mosquito bites even though it is October\nAfter what seemed like an endless debate major changes martyrs near three billion dollar expansion plan approved by the board this afternoon\nBut nobody wants to be marketwatch ... rpm of Atlanta Mercedes Benz Sandy Springs a dad got two hundred points today to close twenty six thousand six twenty seven the NASDAQ down hundred forty ... points close to two percent Seventy eight eighty WSBIU signed\nBy both will be busy Atlanta's morning News Tomorrow new developments of the cabinet confirmations the price for the playoffs the dog's homecoming game and along with triple C ... coverage every six minutes where things are to cool off at current militias five day forecast when you wake up at W. S. B.\nSix on channel two actually news the father of the men policing murder the grandmother and held her family hostage who's speaking out do you want us to talk after seeing power story and told us about the gossip the broken down\nAlso terrifying video of cars forcing are driving down the highway\nInvestigate the connection to a Georgia plant adult film tied up and the witnesses describe what the owner was doing while his dog suffers inside wash it six on channel two action is [noise]\nTonight and we can you need to know about tonight will and grace new season premiere what\nThey are beautiful and just got rich for doing nothing\nWas we're in Seattle but does that mean firefighters in ABC's prime time John Nineteen\nAnd we'll tell you what happened just before the premier of dancing with the SARS juniors\nEntertainment for years and then when the night at seven thirty on channel two\nOwners secure your biggest asset for just Eighteen Ninety five a month right now for a limited time after my security has dropped their rage installed a brand new alarm system or switching existing alarm system and lower your right to just Eighteen Ninety five among call before Wednesday you'll get an Amazon Echo ducked absolutely free\nAckerman security seven seven oh five five to eleven eleven limited time offer Eighteen Ninety five a month plus a free Amazon Echo dot brand do or switch it existing system for free called ... five five to ... eleven\nWhy that is that in God\nDonate your car today with one eighty seven seven cars for get near a recognized five oh one C. three charity organization so you'll receive a maximum tax deduction what's more you'll receive a vacation voucher up three days and tonight is also on the Web but cars for kids dot com wind damage\nCars to donate your car to remember that cars with the wind\nCan use on titles seven here is\nThe term goal in mind or down to about thirty five minutes arrive you when you buy under the law and order your group that I don't know if you're driving\nDown Jack up from the auto plaza to the north brings Marta station earlier crash border to help out at the Marta station holding the right lane again delays go back to ... bridge it might still functioning at the intersection a poke in Britain nothing very northwest Mike he'll\nTrouble on the ws ... moved to the right Seventy five north El Paso what spaces ferry that has delayed\nAnd moved to the right Seventy five north ... what spaces ferry to edgy delayed back to North side Dr once you get past that delays pick back up to ... uh Seventy five north on South Park way up to ... five Seventy five more than usual volume develops ... jumping traffic you\nAt the amount of radio is only five day forecast ws me meteorologist Kurt ... hot and dry\nDry and hot we're in a stagnant weather pattern\nIt will ease off some as we get into next week as the temperatures gradually decline and the chance of a shower shower gradually increase is unfortunate I clear low sixty Seventy Seventy\nTomorrow mostly sunny skies near Ninety One low sixties seventies Seventy Saturday mostly sunny high near Ninety One low sixty nine\nSunday mostly the partly sunny Heidi eight low Seventy\nBy exclusive five day forecast Monday and Tuesday a mix something clouds of thirty percent chance when isolated thunder shower Monday eighty five Tuesday to Lowe's sixty eight\nEighty five degrees on peach tree street at five or nine I'm Chris Chandler on Atlanta's exclusive twenty four hour news weather and traffic station use only five five and I am seven fifty doubled us be depend on it [noise]\nErick Erickson lemons evening news who is a guy I Love\nThe information you need to demand every night on Ninety five five AM seven in the\nEvening news is sponsored by ... business [noise] five and\nI think I got there and we have to wrap now shut down with an RV ran out they don't want their land to wipe out the way they can walk down the rhetoric\nDude on north Georgia from I don't know the center\nFor North on on a break from the auto plaza up toward Holcomb bridge and then waited a volume from Alpharetta area upcoming four hundred southbound earlier crash at the Marta stations been clear for a while now but delays still go back towards ... bridge in light still malfunctioning at the intersection of poker Britain never very northwest Mike he'll\nLook ally to W. S. B. GM came troubled move to the right Seventy five north and west pieces ferry extra two fifty five ... heavy all the delays have you laid back to downtown Atlanta delays pick up once you get past that at ... park way to make your way up to\nChat said road five Seventy five north unusual volume through the ... the south on the way from Seventy five and when he held down to two eighty five triple traffic W. S. B. [noise]\nHabits scout into lightly it gets\nTo the British right over the Chattahoochee\nRiver when\nAnything can happen when you know very very kind of\nSo anytime you're in your car then you've got to keep moving the only\nIs tripled the traffic explosively on WSBIU that's cows were defender [noise]\nChanging Medicare beneficiaries now is your chance to get a will care all\nIn one Medicare Advantage plan designed to help you get to stay healthy getting zero dollars or low monthly premiums\nClass great benefits like free over the counter items dental and vision coverage get exclusive access to a large network of provider pharmacies hospitals and special ed open enrollment and there were seven\nSo don't waste let will care get news coverage and benefits you deserve on your journey to him better you call welfare now to learn more about your options had eight seven seven to five zero nine six two Horton is it well care for G. H. dot com that's eight seven seven to\nFive zero nine six eight more visit well care for G. A. dot com today\nWill care health plans [noise] isn't H. M. O. P. O. B. S. plan with the Medicare contract\nEnrollment in our plan dependent on contract renewal\nSchools back in the kids are getting the pop quiz questions well you might have financial questions Doug Turnbull here you\nMay ask can we afford a bigger home or what's the best way to save for my next vacation or should I leave or buy a car or what have you have questions about saving spending or anything in between\nBank of America's experience financial specialists are here for you probably serving Atlanta scheduled appointment at bank of America dot com slash conversation\nGo ahead do it now start the conversation\nA huge lake front liquidation is taking place this Saturday on one of the top recreational lakes in the southeast gorgeous lake Keely incredible like located just a short drive from Atlanta\nHas it all beautiful mountain views crystal clear water and endless opportunities Saturday you can have it all or just pennies on the dollar for example I to wake our private lake lie\nOr just pennies on the dollar for example I can make our private lake lot he's he's forty nine hundred dollars for under five grand you can have two acres at Laiki away ten total lake Latino will be liquidated this weekend need more acreage how 'bout nearly four acres with direct like access for under twelve grand do you\nHave about there's two acres with a boat dock in Mountain View for only twenty nine thousand nine hundred properties have wide paved routes underground utilities fees and direct like access they will all be sold on a first come first choice bases there Saturday\nOctober sex so call now eight hundred six Seventy five Eighteen hundred eight hundred six Seventy five Eighteen hundred eight hundred six Seventy five Eighteen hundred\nReady to start those long overdue home renovations or get rid of high interest student loans\nPut the equity in your home to work for you Eric Ericson here with some timely advice from my friends have bright path mortgage if you have more than fifty percent equity in your home you can use that equity to take cash out and you may have more equity and then you realize because home values have\nAppreciated as much as nine percent get cash to make those home improvements pay off those loans at a much lower rate or use the money for whatever you choose right now is the perfect time before interest rates rise again to better your life investing in renovations kitchen a swimming pool or finishing\nOut your basement home improvements equal instant equity coal bright pass today the new costs mortgage experts know fees knew closing costs for the right path just even like I did called six seven eight seven zero seven sixty three hundred or bright path dot com\nGeorgia residential mortgage ... my last one Seventy seventies era lay twelve hundred ...\nPlumbers bitter bitter welders at age ... Georgia several trays of immediate joined roughly Rogers are hiring right now ... is an excellent benefits for information visit Georgia and we want to raise some job while beautiful to be\nThe only time he spends the class is built to be able to survive driving models the mood you're in Santa Rosa Iran go to Emmy usa dot com or visit to Atlanta area dealer test drive today [noise]\nFive twenty five ... garbled over the country are up over nobody my north at one point in a row of kind of believe that we have any ... any dog would do extra good\nPeople down for a long before I\nGot Seventy five or outside the thirty five so I get a photo of the north were upper was really an eighty five stuff out of Cleveland twenty\nTwenty east bound you're on the brakes before the downtown connector out to a moral an avenue of a break I find you again in DeKalb County I twenties mount ... sluggish between Wesley chapel in the east side perimeter twenty westbound on and off the brakes before and after MLK than sluggish from a two eighty five all the way out to erode exit forty one in Douglas County ...\nReports on our side eighty five is actually a duty five Seventy five or six\nSeventy five to ... to all the traffic afraid they're going to be [noise]\n\nIt is twenty six of the hour let's start taking phone calls for oh four eighty seven to zero seven zero one eight hundred W S P talked Danny in McDonalds you're next\nOn air but are you a good good you\nKnow just wanted to put your heart disease and just wanted to let you know that being married to a bike or be this great uh you you shouldn't do it I mean it's it's an amazing thing I Will mention one thing about the Senate confirmation here each do that I had just so enjoy the senator from Louisiana\nYeah he is a boy so he\nEnded up Kennedy is probably one of the funniest people in Congress have not the ...\nHe said in this article that he was looking across there and seeing\nYou know people that there was nothing behind their eyes like they just had lost their soul and I think it's a spiritual battle we're seeing that's happening it's going to make the Senate look very different the next Twenty years but concerning being married to a biker babe I think you should embrace it\nI think you should be able to just\nBe completely happy with it and and let you know treat yourself from the\nI don't know I Will tell you this she didn't declare yesterday too so she's a biker baby in a plumber\n[laughter] you know I'm I married a girl that was in the navy and that was an aircraft and she loves drought motorcycles and I think it went\nWell God Bless you for it it's yours me to death Danny thanks very much ... when we come back more phone calls we don't have enough time to do justice to any other calls in this short segment so I Will spend time with your goals\nThat's just any other calls in this short segment so I Will spend time with your goals I Want to give you the ... and the polling as well because momentum is clearly shifting to the Republicans the question is will Jeff Flake and some of his Republican colleagues shuttle that momentum by voting against gathering all\nUh that could hurt one person who could be hurt as Martha mix Sally who is running for election to fill Jeff Flake seat now that he's leaving the Senate pulling out there has gotten very interesting today from really big credible pollsters\nSix on channel two actually news the father of the man policing murdered a grandmother and held her family hostage who's speaking out one of the talk after seeing our story and told us about the gossip that broken down also terrifying video of cars first thing is they're driving down the highway\nInvestigate the connection to Georgia plant a dog pile up in the witnesses describe what the owner was doing while his dog suffers inside watching six on channel two action [noise]\n[laughter] hey Hi there\nI'm very glad you made it um that's terrific feeling that would drive me crazy as well um but my question as I'm Chris she started this whole mess with like like\nUm I was wondering ... what is how he was gonna lean are after this whole investigation\n... uh and he was uh know within hours of Kevin I'll be nominated are arguing that it was his judicial philosophy that was the problem\nUh now I I Do ... I've got to give a Chris Coons credit on this he has not been one of the over the top Democrats in fact he got on CNN this morning and said he didn't know what the Democrats are screaming about now that he's all the investigation was fine uh but he opposes Kevin off ... judicial philosophy\n[noise] I'd say I just saw his ah yeah he started this whole mess and thought that there might have been some sort of on the screen ... after this FBI investigation but I guess you know\nThere's no now he's trying to persuade flight to still vote no ah which is somewhat crazy given the flakes that if they did a fair then thorough investigation ... vote yes and now flicks amounts that they've done a fair and thorough investigation and\nAnd he's gone flaky again but I I don't know that he has part of me still think flake is going to you I mean this is this is what flake did that begin with people you don't let's not forget it's only been a week\nPeople were freaking out about how ... was going to vote any issue the statements that it was going ... yes I'm I'm thinking he does again for oh four eight seven two zero seven five zero one eight hundred W. S. B. talk Vicki and Woodstock welcome\nHi how are you Eric I'm great how about yourself\nI'm fine thank you for taking like listen I kinda haven't come ... I'm I'm Wondering ... fight ... the Republican Party in the back and forth on how you feel about\n... listen I think McConnell and the Republicans would like the settled they would like it's settled yesterday and ... is is flaky on this and part of it is I we all have\nTo remember there there are still ... number of senators despite the massive amount of person shipping Washington\nThere are still senators on both sides who've view their loyalty to the institution\nJeff Flake is one of those who views his loyalty to the institution more than anything else ... more than two to his voters more than two his constituents ... views himself as a an air too the legacy of the Roman Senate\nWere in high minded discussions were had and long debates were held in order to do the best for the republic\nAny views himself now and that ... that position that you can say it's very pretentious but that's how he sees himself and he believes the process needs to be is fair and transparent and open and dragged out as possible and that's what he's doing whether we like it or not as he's deeply frustrating\nAnd the end of the day the remember he he voted yes that committee voted to move the nomination to the floor and he said if the investigation was Thoreau unfair he would vote for\n... capital the investigation has been thorough unfair it hasn't revealed anything all the allegations about perjury have largely been dismissed so there's no they're they're flake should keep his word\nAnd vote for bread Kevin all the other Republicans appear that they're going to his well ah Shelley Moore ... West Virginia by the way has come out and said she will be voting for bread capital because she thinks it was a fair and through investigation by the FBI and it turned up nothing oh there's one point I forgot dimension so I talked to a senator earlier who has seen the report\nAnd he tells me that the debt ... mere as a person she's the one who gave an exclusive to the New Yorker were all the witnesses said it never happened but\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYeah when I go through me wrong but I'm not working or whatever or like a border to blame reopening eighty\nFive you're you know but we don't know if you're north Georgia\nFor North down to very slow from the old toll plaza up to the north springs Marta station that for ... park with a highly one forty one and coming for the hell bent on and off the break from Haines for Israel's sort of a slow on and off down gets you eighty five and from ... down to the eighty five merge northwest Mike he'll\nWs ... still showing trouble move to the right shoulder Seventy five percent of what speech is very but that's causing delays in the area ... once you get past that break like pick up against Seventy five north South Park way crash in the ... there\nAnd it delays on and off the breaks from North park last you make your way up to highway Ninety two inaccurate five twenty five more than usual volume on the brakes airport going through the bell curve trouble dean traffic USB\nThe eye AA supports people who are driven by purpose those who build others instead of just well who gets back\nAnd never give up whatever your purpose maybe tea I ain't will help you live your definition of success whether you have five hundred dollars for five million he I ain't will get you where you want to be with investing and vice banking and retirement planning start today\nAT T I ain't died or\nYou asked me about ... er Cox media group station\nOne is twenty four hour news weather and from\nFive and a um\n\nKnow six o'clock on Christmas Campbell lives and they don't want us to be twenty four hour a new senator the evening and has been five years but now we are just two and a half hours away from the first pitch at Dodger Stadium the Braves will make their return to the post season stage and our team coverage begins with W s ...\nAnd Chris this was about the Dodgers playoff experience there in the world series last year to a general lack of it for a lot of the Braves player starts uh starters like Ronald the coon yeah I'll be I'll be is Johan Margot all making their playoff debuts tonight but veterans on this Braves team like ... flowers ready to lead for the youngsters\nVeteran drives here you know trying to contribute some of these young guys in the ... on the field of the times when we don't know if there were no vision for oh\nAll right so for the starting pitching match up it will be Mike ... for the Braves opposed by the U.N General you for the Dodgers and L. D. S. first pitch in LA is at eight thirty seven so or those Braves fans not in Los Angeles many of them to watch the game tonight in the sun trust part while I was a that is where do us beads Michelle right is\nThey'll be lots of things going on two giant screens broadcasting the game they'll be DJ's they'll be mascot there'll be things for the kids to do right now landscapers pouring down new mulch and planting flowers and all of their workers hang banners along the giant Atlanta Braves sign here at the battery\nEighty five degrees on peach tree street at six o one double USB meteorologist Kurd militias who's exclusive five day forecast on\nI'm not troubled team traffic Doug Turnbull\nBut those trying to get onto the battery Seventy five door down one area that die every all the right people have never gotten garbage slowdown before I wrote a\nUniversity of north north of the University of forty\nTwo eighty five east bound still almost an hour to travel from Ashford done what he overpass memorial drive forty one and then on the Web site in early heading north down onto any thought you're going to see a little bit of break right between a Bolton wrote up to south Atlanta really Alex Williams ...\nToday by west down you're still stacked up ... done what do you have your head north Central Park all the way over to I Seventy five south bound to lay still about a half hour to get down to the west freeway dribble team drastic W. I. C.\n[noise]\n... just wild those protesters angry about this new breed to point any\nDo pre in Washington the FBI review at this point has not changed the dynamic on judge Kavanaugh this is a search and destroy ... senators still on board with the judge while Democrats say the FBI review\nFell short I am extremely disappointed that they were so narrow and stoke\nThe Senate is headed for the first test vote tomorrow morning and the final vote on judge Kavanaugh maybe by late Saturday afternoon\nNo matter which way the turns out the subject has been just an escape all this last couple of weeks what are you telling your children about the capital controversy\nReviews from says he recently had a chance to talk with a Seventeen year old twin sons\nThey're aware there's a lot of the country over these issues but Houston doesn't focus on that one talking to his sons we talked about sexual abuse so we talked about the importance of respecting women\nParents are telling their daughters to stay safe sober and out of places where they might fall victim to sexual predators a message experts say\nThis is where they might fall victim to sexual predators a message experts say all kids should here early and often Pete combs W s ... well after what\nSeemed like analysts debate answer major changes to martyrs nearly three billion dollar expansion plans been approved this afternoon by the Marta bored with us being used to have six so full\nOf oral freelancers morning news group pushing the red light the Gulf Coast it down to the project and the high speed Internet coming to Atlanta the Clark Howard is calling a game changer not using any by by the name seven fifty ...\nI had a confession I'm One of the eighty million people in the U.S could suffer from Maine disease instead of seeing a doctor for years I covered up my legs and live for the embarrassment and pain and ugly building barricades flag remains one of ... thankfully I heard about ... clinics America\nPi I'm Dr Robert words and can curse the physician event clinics America being diseases more common than people realize and typically goes undiagnosed often recognizes embarrassing very close or spider vein that left untreated can be debilitating and dangerous and vain clinics of America we're specialists and the diagnosis and treatment the main disease\nUsing minimally in Beijing treatment named Nixon America had me back on my feet in about an hour and we're burning fatigue are covering up it used to say that you may have been disease and calling now to see if you qualify for free evaluation treatments are covered by most insurance including Medicare mon eight hundred\nReading row three forty eight eighty four\nAnd eight hundred three zero three forty eight eighty four eight hundred three zero three forty eight eighty four\nWelcome to pick up what can I get you know large skinny now that my my Fifteen year old has a taste buds a middle aged woman\nShe's no adult that's why we took her to children's her Scalia that their pediatric orthopedic ground is nationally ranked they're specialized understand growing bones and how to treat them my kid ordering an adult foul coffee okay going turn into a doctor not so much\nChildren's health care that Leno orthopedics where you take the matters learn more C H away dot org slash short though Tara fine jewelry company just three miles from the mall of Georgia interview for coveted brands like Rolex forever mark diamonds Mickey Mouse auto Roberto coin tutor watch it and so much more\nVisit terrifying jewelry company and fear for today\n[noise] in a perfect world it would be no break like fat\nAnd only one sound good drown out your radio [noise]\n[laughter] [laughter]\nWe\nTo kill us you have a six uh six now wife team coverage in traffic and whether prescription team traffic here they'll turn\nTo the right eighty five north outdoor to do all the game addict lays out of bed got above that I bought a neutral\nNor nor the Jimmy Carter nor nor do the Georgia\nNorth than usual delays from the old talk lots of up to the north springs Marta station wait the volume for Alpharetta uptick coming southbound on four hundred you're going to tap the bridge between manned cell and who can bridge and also as you approach to eighty five and now looking at a new crash it looks like Roswell road north downright ... pits wrote causing some very heavy delayed northwest my ...\nGood news Seventy five north and west basis very that trouble in the rye children now clear but delays remain as you get through that area delays picked back up from ... waged by makes you make your way up to ... five Seventy five north on your stack and pack from Seventy five through the bells very ... triple teen traffic ws\nRadios only five day for cancers WSBIU meteorologist ... hot and dry dry\nHot we're in a stagnant weather pattern it will ease off some as we get into next week\nAs the temperatures gradually decline and the chance of a shower shower gradually increases unfortunate I clear low sixty Seventy Seventy tomorrow mostly sunny skies near Ninety One low sixties seventies Seventy Saturday mostly sunny high near Ninety One low sixty nine\nSunday mostly the partly sunny Heidi eight low Seventy\nBy exclusive five day forecast Monday and Tuesday a mix something clouds of thirty percent chance when isolated thunder shower Monday eighty five Tuesday to Lowe's sixty eight\nWs be thrown tracker radars cleared it's eighty five degrees on peach tree street debt six eight time Chris Tambor on Atlanta's exclusive twenty four hour news weather and traffic station news Ninety five five and am seven fifty W. S. B. depend on it [noise]\nI Am ... years and this is it lenses evening news on WSBIU welcome everybody the phone number for all for eight seven to zero seven five zero one eight hundred W. S. B. talk I'm going to do something I never do you know one of the reasons I never do this\nBecause you wouldn't be shocked to find\nThey never do this because you wouldn't be shocked\nTo find the number of people who believe that radio show host read a script I'm I'm I'm always stunned when people come in for tours and stuff and they want a new uh where's the script or that I'm ... I\nI don't really have a script I talk I'll stop my ads for better or worse and the pig farmer call sometimes it says that was that was great what you just said I don't know what I just said every moved on but I'm In a region something this is my syndicated column for tomorrow\n\nI've wobble back and forth on the idea of supporting the president and twenty twenty\nI posed him and twenty sixteen and voted third party and the Canada supportive and McMullin has like so many others abandon all his values as his hatred of Trump is poisoned just conscious I\nEvening news very Gary breaking\nNews militias accurate than to be a five day forecast for the same traffic every six minutes to do what do you ask me [noise]\nThat I mean we're both of those guys are there is trouble lately there was what I boil over in any by north north of Jimmy Carter I couldn't either doing her family back to the darker above that we're going to take a few\nMinutes but I don't want to go around and riverside you know that are\n... are still there for North south from Glen reach up to the Marta station then of course from Alpharetta the coming to weigh the volume therefore the southbound elite do from Haines bridge to hold the bridge and as you approach to eighty five and from bucket down to the eighty five merge bad crashing the intersection of Roswell road north down and it's really not that John the break back toward Abernathy northwest Mike he'll speed\nLimit rise like admit tell Seventy five or thought up the two eighty five and on and off the brakes and getting rid of the highway Ninety to an aquifer ... wrote down to two eighty five five Seventy five north down\nSo on and off the breaks from Seventy five through the bell is very curb this report brought by racetrack pizza makes like better at race record a slice just for one dollar when you purchase a twenty ounce coke or medium don't drink at a participating locations restrict get whatever gets you going triple the traffic ws beat\nThe milk to follow the hearing of a lifetime with wants to create a certain point blank Brett\nAssaulted born on\nWSBIU none of these allegations are true no doubt in your son what did you believe [noise] having a board hearing you were inside the hearing\nRoom ws bees Jamie do pre today this was before the Senate Judiciary\nCommittee rich continue to the odds are one hundred percent sure W s\nP is where you need to be depend on it\nI Want to hire the most qualified job candidates who are also the right fit\nTry glass door for free glass door gives you access to over fifty five million job seekers fast and easy just one submission to glass door and your job goes to over a hundred different jobs ... plus glass door candidates are twice as likely to be higher than those from traditional songs and they're thirty percent more likely to stay\nGood a glass door dot com slash higher and start your free trial today\nGlass door hire the right fit for your business\nDads pumpkin turn in typed nurseries having huge selection of everybody say regarding your front porch had they season with tons of airline pumpkins and eye catching shapes and colors\nLike beach ... red white and gray green plus get classic orange pumpkin for Jack o' lanterns and pine may come as many medium cross it comes to ... you can carry for just Nineteen Ninety nine and digging out\nRight now is that perfect time to plan\nTemperatures combined with a warm soil stressful personally and make it easy for routes to grow sunflowers like ... Mars\nMy nursery that the ... election of trees and shrubs give give\nVarious blooming chameleon Japanese maples handler and their parents either trees insurance for life you can plant with confidence in any profession will have to be her but the thing about our planting and landscaping nursery signing with I\nA lot of games and play and and the\nAttention all men have ... let you down if you suffer from any type of a reptile dysfunction ... disease regardless of your age your medical history the doctors in Atlanta health clinic and help you now\nBe a lot of health clinic has the U.S patented device to help you get your sex life back\nOthers may claim upended program but they still use the same old on patented technology\nYou can trust the doctors in Atlanta health clinic we have the new its revolutionary treatment from Europe utilizing advanced acoustic wave technology we're delivering unprecedented results using our US patent it and the FDA cleared medical device that regenerate blood vessels and a reptile tissue was short in office sessions and it's all done with no pain\nNo needles no surgery and no medication golfer consultation today called for all for eight nine one six nine nine zero best for oh four eight nine ... nine nine zero called the trusted leader in Atlanta today and get your sex life back\nWith the Atlanta health clinic call for oh four eight nine one six nine nine zero or visit our website at Atlanta health clinic dot com\nAt Georgia Power we're not just investing in power were also investing in\nAnd we're not just investing in power were also investing in people\nVogel three and four nuclear expansion is the largest chops producing construction project in Georgia and employs more than ten thousand workers\nOnce on line will create more than a hundred and permanent jobs plans on who will provide carbon free energy to power one million homes and businesses for eighty and learn more about our commitment delivering clean safe reliable and affordable energy into into power in dot com slash nuclear\nWas enough land to area are you interested in making some extra cash\nBuying real estate tax liens the real estate and to actually network is offering a free tax link yet that will show you how to use their simple three step formula and they're proprietary website to earn secured returns potentially up to twenty five percent it's so simple you can do this in your pajamas from the comfort of your own home just point click and start buying tax\nLiens right through their Web site anywhere in the U.S and they're completely secured by the government so if you're lucky to become a real estate investor without getting dirty fixing up houses\nThen call one eight hundred five seven zero five three three nine now to get your ... get then get ready to buy ...\nFor as low as a few hundred dollars working only part time\nGoal eight hundred five seven zero five three three nine right now to get your free to actually get plus two free tickets to a live training event which includes a free smart watch just for attending golly hundred five seven zero five three three nine that's eight hundred five seven zero five three three nine for your free tax link it now\nIndividual results Mayberry revived\nOn terminal another human being the hundred thousand out and bought that break why start running but at the number do you have it down to I Want to go down on that how old the old Seventy five eighty five or just going to run you about\nFifteen minutes from university yeah but it could be five hundred let's go back\nI ... I'm Still seeing the ... from two eighty vine out you've been over ... found a little sluggish leaving kind of getting past Wesley chapel on the west side twenty westbound it the sunshine I Believe it's ... down as you leave at Six Flags trying to get out past we wrote exit forty one in Douglas County Douglas\nBreak on before and after after\nThat there are several stone tractor trailer the Seventy five Barclay number two well triple the traffic\n\nIs twenty six after the hour on the phone number for all for eight seven to zero seven five zero one eight hundred W. S. B. talk ah Joel in Athens I'm going to go to you next welcome\nThank you good afternoon how are you doing I'm great how about yourself I'm doing wonderful hobby and uh so basically what I Want to talk about or ask your thoughts on it ultimately look\nLike they are basically eliminating religion to replace politics or religion with politics and that now they're they're basically driving a this type of ah ah have your from their party\nYes uh I think you're right ... the Democrats is that listen uh there's no such thing as an atheist and I know some people have homes when I say this but what I mean is he everybody worship something\nAn edge so religion doesn't go away just morphed into something else when you replace worship of God with something else you tend to find worship of government and\nThey have Sacramento one of the sacrament says abortion and that's what all of this is about they've got to preserve their Sacramento um this is the new different endings in some ways from the Christians who opposed to having to baked cakes for same sex weddings again\nUm same sex marriage being uh Sacramento on the left or at least a a religious centered on the left is you've got to tell everybody else to adhere to their religion\nAnd you're you're having this tension between people of traditional faith and people have the secular faith but it is a thing there there is no such thing as an atheist\nNow they're atheist you listen to this program I Know they take issue with me when I say that but I I'm just going to tell you that everybody worships something you may not worship the ... but you worship something and she used to be that what you worship is where you put your money\nOr some get their money to a charitable cause did they turn into an idle some ... ... it's the environment earth science to some degree or whatever\nPeople worship something you're either worshipping create the God of creation or your worshipping some aspect of creation and that's all idle worship\nThe Democrats are a bunch of idle worshippers most of us are our mind perpetual factories vitals um the issue is they want to impose that faith now in the rest of us and that's why we're having this fight over the Supreme Court it's about their religion\n\nTime to greenlight the Gulch\nRight now there's a hole in the heart of Atlanta\nDowntown baking for decades\nThe Gulch area downtown specifically for decades generating almost nothing and tax\nWith a five billion dollar Gulf development changes all of\nNothing to thirty five thousand jobs for nothing to twenty eight million dollars in affordable housing\nFrom nothing to twelve million an economic development for all of Atlanta from nothing at all to new parks bridges sidewalks and bike lanes had hundreds of millions of new tax dollars\nInterest in the weeks that are coming up and ... and make sure they get out as a\nOh that's a great question Jenna thank you very much for asking the you know the the number one ways to connect with them on the issue they care about\nAnd if they really care about the Kavanaugh situation you need to make sure they understand that this is only the beginning it's not the end\nThat there are other fights for other judges that are coming up and it's going to get even worse unless we stand up to them if their issues guns connect with the one that the the Democrats back in Congress are going to try to pass gun control measures\nIf the issues the president will make sure they understand the Democrats really are going to try to impeach the president now if they take back the house and in fact there really is capitals convert they're going to try to impeach him as well so the capital fight isn't over even if he's confirmed\nYou guess you gotta find the issue that your friends and family connect on\nAnd drive that message home repeatedly to them that it's important to help them get an absentee ballot if they want an absentee ballot it I mean help them print out the form forum or let them signed the foreign mail it in and and when they get their ballot a sit down with them help them vote\nNo remember that they gotta they gotta cast about you can't cast to form they got assigned the forms you can't sign up for them\nBut you can you can help get your friends engaged you can help them get their absentee ballots that you've got to gauge y'all I Can't tell you a and I'm going to sound like a broken record 'cause I'm probably gonna see this every day until November now\nThe number of Republican strategist consultants and elected officials who are deeply concerned\nThat the GOP is is phone in this election in sure you're really fired up right now over capital but will you be in two weeks or will you settle back down if he's on the court or we decided that he will it's game over you know what they can't get capital nominate if they can't get capital put on the court\nWell then you need to go make sure the Republicans increase gains in the Senate so the president can re nominate him in January and making make sure he gets on the court\nThere are fights to be had but you've got to fight the fight and to get your friends and gauge you've got to connect with them on a personal level that an issue they care about and keep pushing them on that issue to get them involved are done from Marietta welcome\nShark lessen the lockout talk to you know ... uh uh I was listening to your comment on worship and it reminded me of a question I asked my nine year old on the line how church one day because the last three fourths of Russia and the ... set up with since the adults are more than I asked him what he or she was\nAnd he said well it says I think what you think about the most that's what you are\nYup ... while from anybody but a lot on your oh yeah that is\nVery much is so true too and I I see so many even people who go to church regularly and they spend all their time\nIn church even thinking about football or baseball or or you know the travel ball is a big win these days and what message are you sent into your kids the travel bowl is more important than going to church on Sunday ... pretty soon you're gonna have a sports worshiper a not a Jesus worshiper\nScience friday Ari Fleischer thank\nYou Don ... folks I'm listen I don't want to be flipping I don't want to get on the the last conversation you and I just want you understand this is why it's happening\nDemocrats have traded\nGovernment or traded God for government it is their religion\nAnd they got to prop it up and they believe that Brett Kavanaugh stands in their way particularly on the sacrament of abortion that is a religious sacrament a rite of passage for Democrats and they've got to take him out there's got to do anything and everything they can't take him out\nThe question is have they convinced Jeff Flake to help them or Lisa Murkowski we will find out soon enough you know I Do have to say if Lincoln Murkowski eagle flaky\nHaving Joe Manchin has the swing vote probably is the best thing to happen to the GOP because he really apparently does like uh Joe mansion or really does like Brett Kavanaugh a and having him be the swing vote that could put his election in jeopardy in West Virginia now let's go check traffic see we get\n\nThe right button for us to be on the road to anybody about it going on in a minute ride for four hundred over to have anybody really difficult in that\nOr the duty by any of them died on eating out is now under forty minutes I don't know when we got to do on the freeway\nWe do on the way way down the number three allegedly won Italy they're\nThey are basically it's fascinating ah Jeff Merkley one of the senators a ear see New Mexico or again Jeff Merkley calling it a cover up the Senate investigation he says it's a cover up the FBI is it a cover up yes that's what Republicans say two\nFascinating to hear the Democrats adopting that tactic of attacking the FBI Rick in Athens your next welcome\nThank you for taking my call their short lung Lynn ... do you think\nIt's the all these protesters at the Kavanaugh that are protesting\nKavanaugh do you think that might actually be the lobbyists inch Trump or each being funded by them\nOh a good number of them are the the fact that they're being paid the bus in a they're in for example the University of Maine is is offering a spot course credit\nOr they will give students a course credit to travel to Washington DC to pressure main senators are Susan Collins did\nAbout Kevin ... uh you have unions busing people in abortion groups busing people in yes this is all paid their hotel rooms all their cost there they're being taken care of this is a huge lobbying effort by democratic partisans to pressure members of the Senate Craig from Lucas grow welcome\nThank you um I had a question about a catch twenty\nTwo ... and ... and a a stall tickle your question about Democrats in jail right\nOf the catch twenty two is if they vote no then you think they'll lose you know a lot of moderates and independents who want Kevin on the court but if they vote yes then you're going to lose a lot of Democrats you're got a question for voting yes\nYeah Joe Donnelly is in that situation in in Indiana if he supports capital he's going to lose democratic votes if he doesn't support Gavin who's gonna lose independent votes in in Indiana a it's a really big issue and it's hurting them and this has helped Republicans I was talking to a Republican\nI'm senior Republican staffer earlier today and um they they said this is a Democrat is completely\nScrewed themselves in this ... this hurts their ritzy sitters and again it's worth remembering that Donald Trump did win\nSixty Senate seats\nWhen it comes to the election he won a total of six\nDecent seats that\nThat's a pretty big given the number of states to senator first date I mean he he won that many and they're going to be more people up for re election in twenty twenty and are they going to oppose this president's nominee for the Supreme Court\nIt's going to be a brutal issue for the Democrats but if Jeff Flake and Lisa Murkowski ... for the GOP\nIdle ... I think they're going to be a lot of Republican voters who say you know what a if Mitch McConnell can't turn this around is there's just no redeeming the Republican Party and they're going to bail Kevin needs to pass for Republicans to really keep this energy level up and Republican senators need to understand this\nEvening news very Gary breaking\nNews or militias accurate than be five day forecast for the same traffic every six minutes don't you ask me [noise]\nHelping us these Clark Howard is on every weekday tend to die here I definitely you asked his cleric how worried dang sponsored by selling the headline has only time they may have heard me talk about how my son was fine by\nPeople pretending to be from apple tech support my son at the time was twelve years old and he's pretty independent sort had a problem with an apple product and just went on the Web what for the number for Apple tech support called it and realized when they started asking for a credit card number from him\nThen it wasn't actually apple tech support it was a con so then he called the next number he found searching online it was also bogus\nAnd fortunately he is savvy enough to know about scams and didn't get taken a lot of other people are being taken by phony tech support you need to be very careful if you do a Google Search or anything like that even as the search engines try to get rid of the cameras they still slip back in\nBefore you call a number of make sure you're dealing with the right one the best thing is go to a company's own website [noise]\n\nI really don't want to travel a binary thing forty eight garbled W as me do what he was bound around and okay I have a grasp of the blame the SP jammed him now that really hammering\nLowry boulevard and one of their lives don't altered and still choked up between two and five articles orderly\nArticle the orderly school Rick every four\nHundred north bound delays Glenn rights to the north Koreans Marta station then you're off to the races Seventy five north than looking good in Cobb and five Seventy five more than slow up through the ... report rocky by Kroger friday and Saturday at the Kroger two days only digital sales select six packs of Dr Pepper or seven up our one forty nine\nCheck out the newest cat from the Associated Press ground game hosted by a piece digital editor Megan crane ground game is a weekly conversation when ab reporters in ... about the topple ethical issues around the country I had this year's midterm elections available on our podcast and when you\nAsk me about ... er Cox media group station\n[noise] twenty four hour news weather and\nVolleyball and am\nMe want to\nAt seven o'clock on Jennifer regret that live in the u._s. be twenty four hour news center would tell you at the top story this hour\nBreaking news from what you ask me twenty four hour news there's\nThere had been in Iran and a Thirteen year old murder came we get the very latest from Delhi Wendy's print Chandler\nBeautician was Lee Adams disappeared in two thousand five remains discovered two years later at a swamp in Franklin County\nIdentified by the serial number on her breast implant now police arrest her ex boyfriend Billy cook charge him with the murder gentle to actual news reports two days before Adams vanish she'd taken out a restraining order cook for domestic violence Khrushchev a double us be\nEighty two degrees in Atlanta clear skies tonight low sixty Seventy Seventy mostly sunny tomorrow heights Ninety One Atlanta's most accurate and dependable forecast is coming up now let's look\nMy feelings and they don't let the twenty four hour traffic than her\nAge but look alive the W. B. GM came crashing into the rice shoulder always open twenty west building homes drive a fifty two building delays do in the area Mike shields ws be\nWe are about Ninety minutes away from the Braves to return to the post season game one of the national league division theories the Braves set to take on the Dodgers in LA hearing from the players just minutes ago from the clubhouse years Charlie ... percent who gets to start at shortstop for the injured dance we want\nThat there's a reason why both of you know we're here and the Dodgers are there you know we both really well the sheer\nWorks either that or you know we got a real job to do it in\nHis office or go out there when games\nFirst pitch at eight thirty seven\nTo ... to point\nI'm Jamie do pre in Washington the initial reaction from Republicans is that there is nothing new in this FBI review of judge Kavanaugh allegation Tibet cooperative while Democrats argue that FBI was limited in its investigation it\nLooks to be a product of an incomplete investigation that was limited\nThe first test vote on Kavanaugh is set for friday in the Senate\nMeantime Senator Susan Collins says she had finished reading an FBI report on the sexual allegations against Kavanaugh but she still isn't saying how she plans to vote\nNo response that attack no no anything all we know is that is that found things that never left often\nFamily missing dealt a man is asking for your health Seventy year old Steve Black was last seen on friday September twenty eight he was driving a Nineteen Ninety three white board at two fifty extended cab long bad truck W at the new assignment seven oh three\nIt will be a busy Atlanta's morning News Tomorrow you develop a bunch of the cabin operation the Braves who do it for the playoffs the dog's homecoming game and along with ... coverage every six minutes where things are to cool off at current militias five eight ... when you wake up at WSBIU\nThe bulldog it represents the diversity string determination and is a mascot symbol of dog nation the ram it also represents determination action leadership and as a mascot symbol of a vestige\nOf drug in America so it's no surprise but both skipped the long run they save money on a\nLaughing and yet they're big city deal from their hometown dealer Avon dot Chrysler jeep ramp right now it's ... job or no major deal all round models no holding back some of your vice good Athens odd jobs bills every once and you also get the adage dodge low rise from its what's your top dollar trade cash\nIt's super low financing so when you're ready to buy a new rail trucks go to the dealer determined to deliver like the dog avid garage Chrysler jeep ramp they've got the good to get through that big city deal with our own town feel go visit them at\nForty one forty five Atlanta highway or apathy C. J. R. dot com threats over\nOnly hit ... hour day\nExperience luxury Tara fine jewelry company interview for terrifying jewelry companies home to the world's most sought after brand names Rolex tutor Michelotto Roberta Aucoin and forever marked on when it comes to your quality no one does it better to buy friendship Tara the scotch late\nEach and every dime if they choose promises unmatched ... superior beauty guys these aren't diamonds but you could find anywhere else but Tara if you're ready to propose Tara carries a tremendous elected a diamond sizes even larger hard to find diamonds\nThere is a tremendous selected a diamond sizes even larger hard to find diamonds where three carrots that above and parole lectures on your wish list\nTara has a stunning inventory of Rolex watches including the hard to find role models that everyone's talking about visit terrifying jewelry company again view for just three miles from the ball of Georgia you'll find a credible quality no nonsense pricing and very personal customer care I Know\nI've been shopping with Tara for over Twenty years you're authorized ... era fine jewelry companies wind\nMy ... the twenty four hour traffic than are allied the ws BGN came trouble continued on the ... when he was about it a whole was driving to fifty two rightly partially blocked their use caution it good news troubling to ... almost been cleared all linked now open Mike shields ws be\n... dependable forecast tonight generally clear load sixty seven Seventy tomorrow mostly sunny continued on cheese hop on Ninety One low sixties seventies Seventy Saturday mostly sunny high NIH below sixty nine Sunday mostly to partly sunny Heidi eight low Seventy\nSilly the storm checker radar all clear metro Atlanta eighty one degrees on peach tree street at seven six with news on the hour that happened when they break I'm Jennifer credits not Atlanta's exclusive twenty four hour news weather in traffic station and he's not by five and seven fifty deli you at\nThe radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal depend on it [noise]\n\n\n\n\nYou're my job to be on the road on ... hour\nYou know bringing weather and traffic either end\nDoor you got to do when you ask the radio I listen to the latest ws for traffic on on demand and\nListen live coverage on the people you depend on the radio out downloaded out in the outdoors\nMorning workout\nI'm busy I hate it when I miss late in January when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news tap your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now to do what are you on the radio ads downloaded out in the dark\n[noise]\nDo you ask me is broadcasting University of Georgia sports on not he bought by them at a um seven fifty broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nNorth through double USB radio dot com tune in and I hard here the game as bulldog talk on ... them on your radio and\nOn AM seven fifty W. S. B. W. at the program and continues here at a later our as normal depend on it [noise]\n\n\n\n\nI'm a junkie for my family on the road ... stormed in power\nBreaking news weather and traffic you know on your\nDoor you had to do when you ask me radio I listen to the latest WSBIU more traffic on on demand and\nLet them live coverage\nOf people you depend on the radio out download it out and the outdoors\nNow what do you ask me is broadcasting University of Georgia sports on not he bought by ... am seven fifty broadcast restrictions we cannot offer the UGA sports presentation on USB radio up north through W. S. B. radio dot com tune in and I hard here the game a\nNormal and on it [noise]\n\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I miss white and James debris and when it stormed than we leave power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com Chilean and by hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road and ... our\nBe breaking news weather and traffic you demand on on your\nDoor you had to do you ask the radio until the latest WSBIU more traffic on demand and\nLive coverage on the news people you depend on\nThe radio I downloaded out in the outdoors and go go play [laughter] morning workout\nI'm busy I hate it when I miss white and James brain\nWhen they stormed and we leave power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and we don't play [noise]\nThat what you ask me is broadcasting University of Georgia ...\nPi by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. program and continue here at a later our\nNormal that can do that [noise]\n\n\n\n\nI'm a junkie for example you're on the road a ... hour\nYou know breaking weather and traffic you'd have an on on your\nDoor you had to do you have the radio waves until the latest WSBIU or traffic on on demand way\nLive continuing coverage on the news people you depend on\nThe radio I downloaded out in the outdoors\nNobody you asked me if broadcasting University of Georgia sports on the part by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio option\nOr through W. S. B. radio dot com tune in and buy hard here the game a bulldog talk on music ... them on your radio and on AMC seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n[noise]\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this late and James brain when they stormed the Willis Tower\nOne guy you know you can listen to WIP anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now don't you have the radio and download it out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on\nNot by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up\nNorth rebel USB radio dot com boom and and I hard here the game at bulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA ... hour\nBreaking weather and traffic either and on now on\nW. W. F. the radio I listen to the latest WSBIU more traffic onto their hand when\nAlive [noise] continuing coverage of people you depend on the radio I downloaded out the door and Google Play [laughter] morning workout\nBusy I hate it when I this late in gym to breathe when they stormed in relief power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now the WWE and the radio ads downloaded out on the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions\nWe cannot operate the UGA exports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n... hours\nBe breaking weather and traffic you demand on now on your\nDoor you know you asked me radio I listen to the latest WSBIU or traffic on on demand and\nLive continuing coverage\nOf people you depend on the radio ads download it now and the outdoors\nNow where us be broadcasting University of Georgia board ... buy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nNorth through ws be radio dot com tune in and I hard here the game as bulldog talk on these ... about them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our\n\n\n\n\nMorning workout\nBusy I hate it when I this latest James brain when storms and we lose power\nBe like a guy you know you can listen to W. S. B. anytime anywhere with the ws be real happy and all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time and the bad news I heard all day\nYeah if you were stationed on your time and the bad news I heard all day I'm downloading that apple right now I don't envy radio out downloaded out of the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie bring back the on the road a ... hour\nBe breaking weather and traffic either end on on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on on demand and wait\nLive continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I this late and Jamie free and when it's warm than we live our what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand it always severe weather\nAbout when something happens breaking news station\nOn your time and the bad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store and good old play [noise]\nThat what you asked me a broadcasting University of Georgia sports on not buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. at the program and continues here at a later our normal that can do that [noise]\n\n\n\n\n... stormed than we live our\nCan hear breaking\nWeather and traffic either end on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic on demand and\nLive continuing coverage of people you depend on the radio ads downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on music ... about them on your radio and on a um seven fifty U. S. B. W. F. B. program and continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this white and Jamie breed when it's warm than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always severe weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out in the store\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n", "year": "2018", "show_name": "no_show", "city": "Doraville", "day": "04"}