{"month": "10", "state": "NY", "station": "WRUR", "content": "Bernard and keeping the\n\nBomb bomb bomb bomb bomb bomb bomb\nBomb in a while to allow the holiday oh\nAbout Jim Brown\nOn um [noise] [noise] [noise]\nOkay thanks Bernard\nBernard\nBernard [noise]\n\nBom bom\nBom bom part of\nA dog um I\nA good thing\nThen how\n\n\n\n\n\n\n\n\n\n\n\n\nAnd\n\n[noise]\n[noise] no\n\n\n\nCan ban\n\nDa da\n\nDa da\nDa\nDa da da da da da da\n\n\nDa\nAnd then\n\n\n\n\nYou\nHave\n\n\n[noise]\n[noise]\n...\nAfter\n\nBut\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\nSupport for W. argue our digital media columnist for our members\nFrom ... a small batch ... brewery located on railroad street where fermentation meets flavors like ginger beat and more open to the public on Saturdays from tend to to what growl are available to go on line at cat ... dot com\n[noise] it's time for your [noise] [laughter]\n[noise]\nCome back [noise]\n\nCome back to the time when your land was free\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nThey\nCharles Miller play flu and the Oscar for Monica war Fidel's fantasy\nWe started off with super stupid but the point that like between any hazel a lead vocal\nAnd electric guitar the word mechanism do\nOr a Bogota what's the name of the song ... was the was the album from ... I'm On your mall and this was written and orchestrated by Richard Evans\nIn Nineteen sixty three in Bogota was a song that I'm much more would play in his in his life shields for for many many years and finally we heard the LA jet song\nFrom book a teeny energies and Booker really has Booker song\nAnd he came up with the arrangements for the background focus as well yeah LA jazz saw\nMy name is Scott Wallace and we have twenty seven minutes left on this week's edition of rejuvenation but that gives us enough time to play a few more numbers like Bye bye baby from Mary Wells and W. I. N. W. I. T. H. different radio\n\nNo no\n\nThe way\nThey do well do\n\nNa na\nNa na na\n\nNa na na na\n\n\nNa na\n\nDi\nDi di di\nDi di\n\n\nNa na\nNa na na na\nNa na na\nNa na na\nNa na na na na\n\nDa\nOne of whom do love the you\n\nMe be", "year": "2018", "show_name": "Rejuvenation", "city": "Rochester", "day": "13"}