{"month": "10", "state": "NY", "station": "WRUR", "content": "So that\n\n\nI don't\nA moment like laid a\nHand he'll walk out on my lap as\nLong as you look at the bottom of my life with\nThe only\nLong wait\nA minute\nI just want to know one thing\nI don't want to know do you live and let\n'em have given me then there was no your mother I don't understand the new year man oh man they have\nA\nYeah it's just the the fans in my\nNew\nFrankie and the spend those out of Baltimore, Maryland\nWith making up time which was a part one in part to single um the gamble label in Nineteen Seventy three Frankie and spend those we start to set up with the two brothers need a little piece to love\nThem heard what was the demo version of what wound up being re titled look healthy but the initial title was would you mind by earth wind and fire and they put some money into this demo because they expect locals and also put strings on it which is quite unusual for a dental recording\nAt once again this would be calm love solid earth wind and fire and finally we heard call me the traveling man from the mess graders produced by as a case where we're doing with more music after these messages\n\nFrom ... farms in Medina you pick season has begun an extent through November for more than three hundred and fifty varieties available including Honeycrisp been sweet tango picking schedule an apple varieties online at ... farms dot com\nSupport for different radio comes from our members from Nazareth college art center welcoming standup storytellers James John and John cobra on Saturday November third as heard on public radio snap judgment this comedy double bill at humor to stories of everyday life\nTickets on line that art center dot in a Z dot edu\n[noise] drinking your brand and benefit the local community by underwriting programming on different radio to learn more about partnership opportunities that is now you underwriting et cetera you argue are shot for [noise]\nA heist film with plenty of charm the old man in the gun is new at the little starring Robert Redford and since these basic visit the little dot O. R. G. for Showtime travelers podcast and more\nMy name is Scott Wallace you listen to rejuvenation retrospective of artist and songs from the pets were coming wicker deceived W. R. S. H. B. Rochester and they'll be like ... ... ...\nDifferent radio pull my coat but Eddie Jacobs exchange will kick off our third and final hour\n[noise]\n\n\n\n[noise]\n\n\nMan [noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n[laughter]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n... to\nWith\nAll\nTo\n\n\nBe brushed\nThey have\nBeen\nBanned from the\nThat would be able to\nAnd we need\nTo\n\n\nOr she will be able\nKnow\nShow's\nWho's doing what they\n\nBelieved\nBe\nIs based\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\nYeah it is nice\n\n\n\n[noise]\n[noise]\nWe do to be\n\n\n\n[noise]\n\n[noise]\n\n\nWho\nWho who do not know what was\n\nDa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter] [noise] [laughter]\n[noise]\n[laughter] [noise] [laughter]\n[noise]\n\n\n\n\n\nThat's [noise] I Do [noise]\nIf you're involved with it [noise] from our new album [noise] got Oprah [noise] just don't\nWant to tell our power from Nineteen Seventy four\nWith a live version of squid ... written by Oregon is\nJust the Thompson who introduced us to enter the band they versus the mental that you've written for the for the group was called check it out and then that basically morphed into\nScript kicks the solo seared by Bruce copy a guitar ... let me pick a tenor saxophone and yet for mentioned just a tops and\nAh the Oregon and this particular edition of the group these eleven guys are the the standard that all other editions of the group are measured against these little guys just chemistry\nOr those couple of years they worked together was just phenomenal music great great play with ... power we saw this at all with Quincy Jones and his arrangements um summer in the city the local was done by Valerie Simpson and Louis um Oregon\nWe heard from the crusaders too good but they're more clear Joe Sample in title by rote ... on guitar we've never seen 'em ramble ... silver tenor saxophone in the wake drumming up six super as usual and finally we heard Santana\nDoing gumbo of song that would close their shows circa Nineteen Seventy Nineteen Seventy one terrible Santana and new shown 'em guitars we're really playing the organ my name is Scott Wallace and we have twenty two minutes left um this week's edition of ... nation\nBut they give us enough to to play a few more numbers like you know everything from the temptations on W. O. U. R. N. double dip in Reno\n...\n\n\n\nHave a lot of\nMoney then\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\nAnd you don't get in and do you do you can do\nTop and the bird\nCan't be do\nYou\nDrive\n\nThe time to be trying to\nBack and I can do\nThat\n[noise]", "show_name": "Rejuvenation", "year": "2018", "city": "Rochester", "day": "27"}