{"month": "10", "state": "NY", "station": "WRUR", "content": "Without sounding flip I can think of worse exams to have to take twice and setting and drinking some of the world's finest wind\n[laughter] well you're not drinking them you're tasting them and says that during them out when you tell people that you for a living you have to taste four thousand whines a year\nThey're they're not exactly drowning in tears for your yeah\nBut I think of all the times you've tasted a great wine and if someone asked you to write an essay on it\n... the vintage year [laughter] worse\nIt's actually quite hard to do and you know when you do get that certification the masters so now you certification you have every right to feel enormously proud\nThat is Karen McNeil author of the wine Bible thanks so much for talking to us pleasure four years ago\nABC News named David near as an anchor a world news tonight since then newer has made the broadcast very much his own as NPR's David Folkenflik reports the newscast has just gotten it's best ratings in a generation\nThat just forty four years old David mirrors actually the longest serving anchor among the big three network newscast and the man does like to go out in the fields\nNear Flint shutting down to like right after the hurricane relied up and down the coast\nHe conducted a virtual town hall with the pope from the Vatican in Spanish the interviewed President Obama in Cuba inland President Trump's first TV news interview an office this spring we reported on Syrian refugees from Lebanon\nSo you're trying to say at least part of their childhood dream fear though that this is sort of the last generation as a boy thirty\nYears ago in Syracuse New York gave it in your had his own dreams I wanted to see the world and I don't think\nAs a twelve or Thirteen year old you really recognize what you mean by that he wrote to a local TV station an anchor wrote back he said something like you know competition and television news is keen\nThere's always room for the right person it could be you bat meant the world to me you're says he was lugging around camera tripod reporters by Thirteen and staffers may pencil notches on a wall in the newsroom to mark his growth\nStunts and local TV led to a job at ABC as an anchor and traveling reporter and twenty fourteen your ascended to the lofty perch once held by Peter Jennings\nBy then the anchor position had started to lose some of its stature the monopoly the big TV networks had eroded Mir says he's trying to ensure that his newscast maintains its relevance people are inundated all day long from the moment\nThey get up in the morning when they check their their iPhones or their smart phone and they have headlines on it already making tweets tweeted at them all day long I I Do think people are hungry for someone to break through the noise a and I think it's made six thirty newscast actually more valuable\nYou're also enjoys guest hosting on later ABC programs such as good morning America and live with Kelly and Ryan former ABC News correspondent Judy ... says this when asked about near\nExtremely attractive the camera loves him clearly a a good presence on television\nStatistics from the TV news analyst ... just mere successes lied not on soft news but on a local news formula with a focus on crime natural disasters and other video friendly stories\nMotor takes exception dumb years approach\nThe network news shows especially ABC have shortened all their report is a verb free zone\nUh people fleeing rivers flooding factions siting there are no verbs it's all ... to give the sense of restlessness and it's all very exciting and all very rushed and all done on the cheap\nMir says he pushes for some stories to run short so we can devote more time to more complex pieces traditional is like Muller say the chief at the way mirror personalize the news in this piece you're sings a lower by the Syrian child refugee named Toto because\nIf you're going to\nHold a climbing up onto her bed how wrong with this off to a\nMere says it's a gift to be able to present stories on world news tonight and he says people respond\nI go through my email him a subway on if I look up I generally will have someone just you know waiting to catch a glimpse of mobile smiled I recognized that they know they know who I Am from the news or whatever your enjoys his celebrity and also ... but there was a gentleman sitting next to me and I look up and he said are you and I said yeah and he said well what happened today\nAnd I found myself doing the news all over again so you know ...\nThe news anywhere um\nHave been since I was Thirteen Years old so that that's not going to change David Folkenflik NPR News New York\n\nIs all things considered from NPR News\nSupport for NPR comes from the station and from ... I'm committed to changing lives through math by building math achievements problem solving and critical thinking skills for thousands of students every day and nine hundred franchise location that's amazing um dot com slash NPR\nFrom the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Amazon Prime video presenting the return of the man in the high castle where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nYou're listening to double helix which I Am Rochester W ... Rochester and double directs\nThem each day to Rochester W are you are is a broadcast partnership with the University of Rochester ... public broadcasting [noise]\nEvening music is next starting at six and are you were and more news ... considers that a way to answer to Seventy blind the police reading up tonight increasing club sickening clouds it's rained developing loews right around forty but cooler in the southern tier cloudy with a show or to tomorrow morning portion son later\nBy about fifty a Saturday [noise]\nIt's floating in fifty degrees here in Rochester\nSupport for your public radio station comes from our members and from the ... eye Institute offering lasik seminars opportunities to learn more about laser vision correction meet Dr Scott in a crate and toured the facility to sign up for an educational seminar visit lasik dot U. R. M. C. dot edu\n[noise]\nGood evening\nIt's six o'clock my name is Scott Wallace and welcome to rejuvenation retrospective of ... I'll be your host until nine o'clock tonight to W. O. U. R. H. B. Rochester and W. I. T. H. of ... years ago\nIn radio [noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nNo no no no\nDo ... do you do\nOh they hate it when they cannot find and finally I really\n\nDon't think\n... [noise]\nThey\nGet a\n[noise] a big debate\n\n\n\n\n\n\nOh I'm I'm looking for my ...\nI\nWonder why they can have\nA\nUm low or something and look in\nFormer de\nLa ... the ... ... oh so I don't know how to look in or not\nThey they wonder\nWhy am I make me\nAh no I don't know searching\nFor my de de\nLa ... ... oh ooh\nCry\nCry in all ... calling\nFor you\n... o\n... o\nLo O L o calling\nFor my baby [noise] they won't you please\nOh I'm Laurel I call a former bay man\nI ... ... oh\n[noise]\n\nHeard of that [noise]\nThink that this\nBeen here\nGet the job and they\n...\n[noise] I normally\nI got out all the\nJump Simon singing silver spoons and coffee cups which is probably in the top five oh the best records he ever made no longer singing secular music he's a he's a minister\nBut\nHe left us so many great great recordings and these recordings though in the gospel idiom as you might expect Joe Simon we begin with these rails what a sweeping that was when the pen of Carole King and jury golfing from Nineteen sixty one then we heard as long as I got you by Laura Lee\nAnd finally Irma Thomas from sixty five in January of ... year she recorded it leads to same accord songs at that session and this was one of them are but Thomas some things you never get used to my name is got one son we're just under way on this week's edition of jubilation\nWith the planes so is it just for you until nine o'clock please be sure to check out Scott Reagan in this program open tuning every Monday to friday morning from nine to twelve new on Tuesday nights from six to eight marine rich is your host with a rule the joy and during those same hours on Wednesday just my ...\nAnd the mystery train like to leave selection by bunny Bremen Nineteen Seventy three for her Columbia album called Sweet Honey brand but the song is called crazy about my baby on W. R. you were to teach different radio [noise]\n\n\n[noise]\n\n\n\nHave any [noise]\nA stay\n\n... ... do do we know\nThe live free and three girls and they are\nDraw me home\nLaw the table\nAnd I am your bomb loaned those little ... in the late\nNight I'm told I die in a way\nTo read the ...\nVery shy in wage yeah\nGarry\nAll the time\nAir raid stayed\nWe're going to do a show\nIn ... the\nRape me mom ran in here that are on\nThe on line\nAnd we we ...\nWe dream ... why\nWe all agree then here alone not\nAnd ran the\nMuch John\nAnd where I Am I'm\nYou hang on\nAir renting\nWent home\nAnd where's the\nRead home jobs have\nIn the ...\nWe're going to\nNow I'm a big you\nDidn't want\nGood grades you know\nYou know let me let you know\nI Know I'll be\nGuarantee you\nA\nAnd they don't like that are violent read your\nDon't like the guy\n\nWell\n\nI Know well\nLong but I knew what are you doing man\nYou are\nI'm the one thing\n\nWind\nWill show\nTo\nOf a new memo\nNa\nNa na na na\nNa\n\nThen\nCame home late yesterday\nThe un ma'am no\nNo I'm just going on in\nLate in the in\n\nI\nThink my\nMom she may have\nUse named God way long\nTerm\n\nI'm\nSitting down to keep the\nShe but they\nJust you know\nIf you give me a man\nNamed ma'am\nOh\nBob\nMy last the\n\nLast\n\n\n...\nJust said that that that the\nGet to know\nWhat he's saying is nasty\nMan you know oh\nOh oh\nOh\nCan't\nTake the\n\nLead to more keep the home fires burning from Nineteen Seventy five\nWhich set us up with ... got your girl and go on a number one single lemme sold chart\nFrom Johnny Taylor they would hear the oldest clay what what was the B side to the first thing that he did for the high record label\nBrand new thing was the name of it and finally heard sill Johnson could I be falling in love my name is Scott Wallace you listen to rejuvenate you read the specter of artist and songs from the ... were coming your way courtesy of W. R. U. R. S. I'm an HP Rochester and to teach at ... at the\nDifferent radio it's we hadn't to our second hour let's see a little our friends the horizon the Squires Terry ... very making our brothers are written that dog you can listen to my memory a whole lot of chicken every Saturday afternoon from four to six was that our second hour with\nLet's go let's go let's go from Hank ballot and the midnight\n\n\n\n\nDon't\nSee a lot longer than\nGame in town\n\nThey may they\nBeen looking at a\nTime [noise]\nDon't make me when I'm when\nDo for me to\nGive ... percent true why\nSo just give Jordan\nMay and all all all all\n\nNo no no no\nAnd I you know let me see if there are\nHave you know not\nI see a ...\n...\n\n\n... you know when\nThe day I don't want to\n\nWho\nDoes\nThat make me we can\nAnd they may they\nMe maybe a\n\nThat the way\nThe laws in\n\n... they they can be\nThe day and I thank\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\nDi di di di\nDi di di di di di\n\n\nDi di come [noise] [laughter]\n\nWhat do you usually\nDo\n[laughter] no\nNeed to be paying you\nKnow not be allowed\n\nTo a gym di\nDi\nDi di di\nDi di di di di di\nDi di di di di di di di di\nDi di di\nDi di\n\nYou will take me to lay down does that tell me about my my\nJourney to the red shirt stupid thing and [noise]\nMan I don't want to\nBe not already see\nThe thing that I might do\nLittle bit and not that came from\nA little bit about it brings in my yard and talk to you from\nNon donated from bad he have already named the property and the thing that he should not be\nOne that would be banned in the man most\nThem are bonded real when they were ready to\nBrand new no no he ...\nHe goes some they then where she goes in\nThe city that day and walk there\n... well do you know\nThey've got to call me never landed\nOn the new new breed of\nPeople to die and then you know we get in on\nOn people's granted all new to me and\nSay this ... that just a stain on the phone a loan\nTalk about I guess maybe on the phone down but it really is about a\n... year old and my mother [noise] they didn't do they call the man leading the man who are involved in this day and all day and a new law\nWell you don't have to say though that is basically where you can stay in ... when you when they do the\nState of the day is a strong accent from the ban them too much do they have the de la ... tend to use them we'll go to all the way they were gone\nYou know in fact I think the fact that a lot of his old\nJob of Boulder, Colorado and I am ... been a stay at the same [noise]\nYou're going to want a homeland from I've been basically is a re opened up now you're talking about your blood I make the daily but hey you know going to build in but hey\nYou let the sun that made him the ... the ... that motivated mom duck in bed and you [noise] do people get\nDown there and go to the west for a little bit bonded and the bugs you guys are getting dirt on his\nBack on the Cape and da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da de da de ... about [noise]\nYou know now they do da da da da da da da da da da da da da da da da da da da da da da da\n\n\n[laughter] [noise]\n[laughter] [noise] [laughter]\n[noise] [laughter]", "year": "2018", "show_name": "Rejuvenation", "city": "Rochester", "day": "12"}