{"month": "10", "state": "NY", "station": "WRUR", "content": "And it was interesting out with a couple of the board members we spoke to today had to varying reactions I Know you had some comments you played earlier from Beatrice liberal and she was more critical saying that she didn't think dean Williams was a good fit for the district\nThat'll be shepherded another fairly recent board member was a bit more politic about saying that the dean Williams did have some successes during her time or a superintendent especially as it relates to dealing with issues of structural racism but she does go next to pretend that will have to be around for a while to help see some of these initiatives achieved success\nWhen he somebody that's going to be a vested to say okay I Know I mean it's it's something that's going to be very very difficult but they have to believe that our students are worth it and after that Tennessee that so we're going to need somebody that's got to be strong and bold enough to come in and say okay we're starting at that level but we're gonna we're gonna push it up\nIn a shepherd also wants to see better accountability for everybody who works in the school district and by the way right now they will have to look for an interim superintendent because of course a search for permanent superintendent expected to take a number of months Alex All right\nThank you to believe ... director ready or been\nSupport for your public radio station comes from our members and from Tennessee regional tank supporting businesses and individuals in Rochester community with business banking personal banking and home mortgage services Tennessee regional bank community banking community building information online at G R B bank dot com\nJust remind or you're listening to members for to public radio double helix six I Am Rochester W ... FM an HD Rochester and W. X. X. I. F. M. H. D. to Rochester W are you are as a broadcast partnership of the University of Rochester and double the ... public broadcasting\nAnd to six minutes before six o'clock you're listening to all things considered on your public radio station\nOn the left afternoon of a really important membership campaign how everybody norms Silverstein presidents of W ...\nI'm here with Susan Rogers and we're going to close this campaign out with your help will make it to the goal we need to hear from you at five eight five four or five four sixty three hundred or online as WXXI exciting news not Oregon remember we're in the final dollar for dollar match of this campaign thanks to a free\nEducator Dr Walter Cooper or he is challenging you to become a new member to make an additional gifts\nAnd he will double it and you know we just heard an end to report on the retirement of the city school superintendent unexpectedly early from our our news director that's what you're paying for your you when you when you make that pledge\nYou make sure there's a strong news department here that gives you more than forty seconds or less on a story that important to the city\nYes and gets multiple voices multiple voices on something that broke last night that's what you get here when you have a news department that's on top of what's happening with paying attention to the community it is so difficult when we have situations where there is no local news news coverage on issues that matter to us\nAnd I know that you value this doctor Cooper totally gets it totally values that and that's why he's making this challenge we are in the last\nFew minutes up our campaign we are really really close to making the school\nAnd we know that we can do it if people like you know and recognize the value of the station make the call right now eight hundred tonight five nine nine nine four or online at W. electric side dot O. R. G.\nAnd you know even if you're just sitting around you and you're looking forward to rejuvenation or blacks or blues tonight that's still a good opportunity for you to say that and tell us that when you make that call that take advantage of the dollar for dollar challenge\nOr maybe you're like me love the weekends or I don't miss wait wait don't tell me you know there's so many new programs that we were offering on the weekends and without your support we wouldn't be able to go out and purchase those shows\nAre people forget that we pay dues to NPR or many of the shows that the un joined the weekend or a from different organizations in stations and yes we do pay for them\nBut we try to find things that make a difference in your life the things that you want to hear earlier this afternoon we at science friday another example of a show that we bring to Rochester I Know you hear about this and I'm going to ask you to help us make\nThe goal take advantage of the final dollar for dollar match by making one of the lost cause of this drive at ... hundred dollars left six now very doable in the next four minutes that's right well there are thousands of people listening\nYou are one of them and if you have not called it is your chance to do it right now\nThat's right and that number is five eight five four foot four sixty three hundred Oregon um if you have any trouble getting through you can\nYou go to our website WXXI news dot org visit donate button there it's really simple to do and you'll be able to take a look at even at some of the thank you get so you know we've been laughing about this but we really do have NPR logo socks when you make a pledge of the six dollar a month for Seventy two dollar level\nWill send you a custom socks with NPR logo the do keep your feet really warm\nAnd they're made in America from a a a a family owns a mill I Believe in North Carolina\nAgain that's our way of saying thank you when you make a pledge of the six dollar amongst the stain or level or you know ask for the the new tote bag I mean we have a beautiful tote bags all different colors just make a you know make sure you ask the volunteer about it when you when you call in a ... for five or sixty three hundred\nMost of all take advantage of the final dollar for dollar match up this campaign and we are so close or if we can get a flurry of calls and the next two or three minutes I think we are going to be right over that's\nBeen a ... I I I'm pretty confident that\nYou know it that you know coming together in this community one time can make that difference and it's sort of amazing you know that we make the the remake the goals based on you know expectations on what our needs are and that\nPeople come through year after year it's it's really very heartwarming that people care that much about the station four by four sixty three hundred one eight hundred tonight five nine nine nine for you still have time to make a difference\nAnd don't forget will be hosting the debate with the twenty fifth congressional district that will be on October twenty fifth it'll be on there'll be ... radio and on WXXI TV\nAnd these are the kinds of programs that you allow us to do\nWhen you become a member when you keep a station strong and then when we were approached about will you hosted debate will you be able to cover the story can you send your reporter to something special in Albany or someplace else yes you know we want to be able to do that we want to be\nIf we want to be adding reporters we don't want to be part of a downward spiral journalism to some people would call that but there are places that are doing well and this was one of them that are that are still committed to the news and making sure that this community gets coverage and here's the information and get the kind of news but frankly you deserve\nBy five for five or sixty three hundred one eight hundred to nine point nine million going for more on line W ... news dot org we are closing in on that ultimate two hundred thousand dollar going ... we're so close\nWe are very close and you know what\nI Will say we have we're right now I can I think we can say we made it only because we know more than Thirteen hundred people have called us and all the folks are busy right now that means that you have a really helped us make this call we can we get pretty much say we have made our goal and we are going to continue to bring quality news and public affairs to Rochester\nRight and and don't hang up just because he said that we still we still teach you to complete your pledge to make sure we all know it matters it doesn't matter if you're one of the about Thirteen hundred people you made a pledge to support this week's thank you so much\nYou help keep W ... strong and we want you didn't know we appreciate our listeners we appreciate you [noise]\n[noise]\nGood evening\nIt's six o'clock [noise] my name is Scott Wallace and welcome to rejuvenation retrospective Roberson songs from the past and I'll be your host until nine o'clock tonight to W. O. U. R. H. B. Rochester and W. I. T. H. S. H. B. one this one radio\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n'cause I\nSaw it on\n\nThe radio and his wife and\n\nI wouldn't\n[laughter] [noise]\n[noise]\nOh my\n\nAretha Franklin with the third oh that was written by running Shannon that she had recorded they were all three with three eight sided singles\nThis one from Nineteen sixty eight I Can't see myself leaving you from a reason frankly we started to set up with\nThe watts break away by Bill Maher ovens recording just part of the Johnny oh to show that was one of my I'm sick you all from oldest renting them finally we're gene jealousy Curtis Mayfield what no with background vocal helped by the impression the curse him so\nPlaying guitar my name is Scott Wallace and welcome once again the human interest will be together until nine o'clock at that point it will be the curry taking over\nAs the black is the host of black lose until twelve midnight\nSo but the next several I was real we'll sit back relax and enjoy all of the News Let's carry on with pop popcorn children from Eldridge homes and the yard work and the ... this one radio ... na\nNa na\n\n\nMy God I Know\nThe air\nBob Dole drew on I\nBob\nAnd Bob cold\nYou know a lot though about ball\nBop bop bop bop bop bop bop a while I don't know [noise] [noise] [noise] [noise] and I think\nWe should just\nHave\nAgain you can be bought bought stock in a bowl of ...\nHospital children\n[laughter] [noise]\nIn in Champaign management structure that you're up there [noise] ... [noise]\nI don't need the Bob Dole each bomb bomb bomb\n\nBomb bomb bomb bomb bomb bomb\nBomb both Jodie Foster\nBop bop bop bop I can\nAnd can't do that [laughter]\nAnd you know and they keep on going to change the bomb Paula Jones beach to drop all charges\nOn the team and we need to be in the nineties and\n[noise] Mm Mm [noise]\nI'm calling in\nYeah [noise]\nThis huge\nMe\nGiving my oh\nJust some people\n\nWhose lives are\nTo me\nHe said my\n...\nMen\nWho wants to blow\n\nLuck\nOn need some help on how\n...\n... what are some who\nWho's not well\n\nIf she oh they can\nJust the very least bit\nAs a whole Comey\n\nDifferently [noise] well the ... really do and make me I'll\nTell you whether or not\nWe well we know me you can go back\nAnd in the country they're not\nTelling the oldies I\nTo spend your rent or you're not trying\nThem to remind\nYou have to I got an American pie\nAnd I got I'm not going to\nAnd I got on my\n\nRecord you heard me\nTo be with you you know he just\nWon't go back to bump into contact man\nTelling them well we're not\nGoing to do that and then you're ready to go\nNew stadium I\nAnd I got on my grandma ... [noise]\n[noise]\nYou do with it and when\nMe he just won't\nAround and read from your comments\nDaytime [noise] she's\nGet out on my\nGod I'm not going to talk on our back on my\nOn my [noise]\n[noise]\n\n[noise]\n\n...\nThe\nNo ... there's not a bad year they will understand that you sit around\nReally his life's dream about predicting one of the myth that runs come near ... ... you know the\nDreams but there's not as much as always Ken this is more than a minute I didn't live long enough to see his dream come true\nOh he does win too much we're supposed to be without a problem with my mom and then if it was the last thing you did with the new law in the early ... what do you consider what did you see we don't think without versions hoping to God because\nWe don't know his plane and we don't include him up in the way can do to help you know they say but now I'm a good in the last person to bear with him gone down\n[noise] average Joes and the watermelons\nMust be\nTen years of devices that can\n[noise] um\nWhat was your right now to me early\nIn love with she'll be proud of Israel into juniors up no somewhere\nTo Jimmy related with some famous man who's that poll we do know me to do with family in their moms who I'm going\nTo be with the well the Jimmy ... rather than rather than one of the release of job making good money ...\n... do you know by the ... house with me and my mother in law my mum did you the region and she gets older every day and\nJoined us how many of them at home as\nAs everyone was so low that many\nWhat's that about George W crop and no one ever\nI just wish I was not a\nI Love that song [laughter]\nThe mayor's ask them\nDown to\nYour right hand man would\nProbably be human\nWe bother girls on\nJoe Tex with one of his own compositions entitled papas group we start to set off with the soul brothers six featuring John Alison on guitar\nAnd the lead vocal can you feel the vibrations and John Alison once again will be in performance and just over an hour\nOver at the Wilder room which is located at one twenty east avenue hitting stage eight o'clock opening the show will be speed grills and we certainly do look forward\nTo this performance of Janet Wilson and our fair city of Rochester New York then we heard my true confession by ... and that was made in Nineteen sixty three and finally the Dell phonics thing over and over\nMy name is Scott Wallace and we're just under way on this week's edition of would you a nation will be playing soldiers are just view\nOn 'til nine o'clock please be sure to check out Scott Reagan in this program open tuning sure every Monday through friday morning from nine to twelve new on Tuesday nights from six to eight Murray rich your host for the root of joy and during those same hours on Wednesday just my group\nAnd the mystery train let's play\nAn instrument allow for you by Willie mobile this isn't title roasted right um W. R. N. W. I. T. H. different radio\nTV [noise] the [noise] the pages [noise] easily [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\nAnd [noise]\n\nA bag\n\nAnd Cathy [noise]\n\n[noise]\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\nKeene Curtis saxophone along with Billy Preston playing Oregon for not pretty playing some terrific drums and their version of Mr Bo jangle did you hurt Keene Curtis amounts at the beginning of the to\nRead from the ... we heard a group called six\nAnd they were a self contained unit and there was a full band version of this particular too which is called I'm just like you but quite obviously they were with sly stone and slide provided\nMost of the instruments backing them up on the on the really only where maybe two members of six on this particular recording I'm just like you\nBuy six we also heard that a little bit with a song from the repertoire of the band free\nThat wasn't titled the Steeler and we started everything off with Willie ... and his band roasted off right\nMy name is Scott Wallace the program is rejuvenation let's put the microphone in the hands of and people's she's going to sing I feel like bringing up somebody's home um W. I. T. H. ... different radio\nThey yeah they do they have to\nPay\n\nTo do\nRight yeah na na na na na\nNa na na\n\n\nNa na\n\nNa\nChild reading\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] I mean when I went\nOh it's a\nVery\nAnd I wonder if you\nDo you what happened to me\n[noise]\n[noise]\n\n\n[noise] oh\n[noise] oh\nI just\nGot a degree\n\n\nMm\n[noise]\nAnd\n\n\nUh [noise] oh\n\n\n[noise]\n[noise]\n\nYou tuned to W I work at seven eighty Rochester and W I teach at the ... you have to go do some radio\n[noise]\nOoh\n\n... ... ... no longer\n\nBlack guy mom\nBut I'm a ... or\n\n... yards\nThey\nMeant you know I'm\n\nSure you are\nGoing to make way\nFor me please\n\nAnd not\nMiss new\n\n[noise]\n[noise] there are no\nThey met\nNa na na na na na\nNa\nTo\nThat\nThey have and\nI went down into trouble figuring well some some some good\nThings I've been talking about bad you know try to but if you're in a way maybe you can see some say Ron Ron then that is well not that I thought\nMaybe I Would write a song that\nEven a legal jak talk on the top of my back is not you know no maybe so but you know\nRon Ron I'm not in\nBut um\n[noise] here in the pages and pages and pages and and you can\nDo to\nDo but we're not going to end up kind of no no no no no but I tend not to\nRun your God [noise]\nAnd I\nKnow about it that way for you that are getting a job right now I wanted to\nTake the time they do not at all the time they don't know nothing wrong with you on TALK about something\nAbout I'm not talking about\nOh\n\n[noise] oh\n\n\n\n\n[noise]\n[noise]\n[noise] oh\n[noise] oh\n\nUm\n\n\n\n[noise]\n[noise] [laughter] [noise]\n\n\n\n\n\n[noise] [noise]\n\nNo I understand\nThat and um\n[noise]\n\nMy\nJunior Walker and the all stars from Nineteen sixty four\nSickness blue so this is the the model forty five mix which is super tight but it does eliminate it elbow though really what's his guitar solo what sort of revert to just a straight up blues\nAnd be recorded sound is fantastic junior walk in the all stars they blew we open up our second are with I'm In love again from\nThat's dominant we're rookies Tom is with the besides the jump back from Nineteen sixty four all night worker and finally were run diddly daddy by boat did when he got what was the program is rejuvenation some of them was in the studio were five ...\nFive to five eight zero to wait three or ... eighty eight sixty nine five six one three\nLet's see what would shut up sue Margaret Joe I'm In the boys and girls or read print ramifications as well as to relish got Chapman and Walter and the gym we like to play can get ready for losing you from the miracles and there'll be like huge into your radio\n[noise]\n[noise]\n\nSharon [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\nAnd\nThen when\nThey\n\n\nThe Dell's would assume that lead singer my junior compose\nWe used to tears and it actually was written ten years the full ten years before they actually put it on the ... the Dell rent from the ... we heard listen to the clock on the wall from the OJ written by can gamble and we got along with Mitch Batman Whitehead\nAnd this was from Seventy two McFadden in white and it just come into the fold their\nPart of the part of the team because they had written\nThe ... to the ... album which this comes from the OJ case we also in the ... where the five stair steps with ... that was clear it's Burt unbelievable and he wrote the lyrics to the tune his brother Kenny did the honest with the music\nThat was really ... who produced it and was playing the keyboard and at the top of the set the miracles with a will be much to you actually wrote it along with his brother Richard will be the producers will the miracles can get ready for losing you my name is Scott Wallace and we're just passed the halfway point on this week's edition of rejuvenation\nRemember we do reasonably refreshing to hear W. R. N. W. I. T. H. one six until Ninety Days rejuvenation follows in the booth\nAbout partners the curry the host of blacks loose may\nUntil twelve midnight or women dressed as a Wu were orgy and W I teach radio that orgy like going to those sites you can get platelets for specter program a schedule I listen to some of the world Wide Web we have a live stream\nWe can be heard anywhere in the world by the Internet once again the address is W. already were dot org and W. I. T. H. radio\nDot org we also and let you listen to the soul monologue is hosted by German Jackson comes on every Saturday evening five until my editor this thing that W argue we're orgy sting that W anywhere that or did you\nLike to play Marvin Gaye with what was the original version of flying high in the from the sky was part of his beside and it was titled said tomorrow's on your on your end W I teach different radio\n\n\n\n\n[noise] I'm back\nIn like my mother than non stop some of the\nSeason you\nCan be something will happen to you [noise] [noise]\n\n[noise]\n\n[noise] oh I feel\nLike I'm not sure [noise] but I\n[noise]\n[noise]\nAnd he said I\nHow they kept them not to be the fact\nThe\nRepeal of three jobs [noise] [noise]\nYou think that when\nHe would rather than a challenge will\n\nFor\nLa di\n\nDi\n\nDi\nDi\nDi di\nDi\nDi\nDi di\nDi\nI Know how\nTo be\nYour ...\nHe doesn't do you know just about three o'clock in", "show_name": "Rejuvenation", "year": "2018", "city": "Rochester", "day": "19"}