{"month": "10", "state": "TX", "station": "KTDH", "content": "[noise] fine they if they're if they find on the face of\nA sign of gaining a foothold in Europe the kind of on the next MORNING EDITION [noise]\nTuesday Morning beginning at five central [noise]\nThis is Ninety One point five ... eighty nine point three Katie da di ... of high plains public radio available everywhere on line at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\nComing up this week on the Thomas Jefferson our we traveled to Kansas with President Jefferson\nThomas drivers in Pittsburgh Kansas and the southeastern part of the journalism purchase from ... on the subject was the Louisiana Purchase yes in President Jefferson to begin the conversation pointed out to the citizens of Kansas that he will\nStay on for three cents per acre the driver of the RPGs to Pittsburgh was the host on your behalf David they all asked about you know this was Thomas Jefferson American heartland\nI think it's great for listeners to have the opportunity to hear president Jefferson in front of a live audience it's a bit different than here in the auditorium learn to live with spectacular I looked out on five hundred people who come here for the money [noise]\nShe'll join us for all that and more of this week's miscegenation [noise]\n\nHello I'm Gary Smith toward the b._b._c. news puck is done says they plan to enter talks with the international Monetary Fund about a bailout package the country's new prime minister Imran Khan needs to tackle its multi billion dollar trade deficits and currency crisis succumb to money reports\nMany analysts had blown predicted that the country would need to put the IMF for that teens bailout package the prime minister Imran Khan had faded exploring other options fest including possible by natural loan from friendly countries\nEconomists say however buckets on needs around twelve billion dollars and then the IMF light needs to be able to provide that kind of funding the money could however come with spending with ... making it more difficult for Imran Khan to implement his vision of an Islamic welfare state\nMore than ten thousand people have been evacuated from their homes in northern Ukraine offered seeds of explosions at an ammunition ... emergency services said that been no reports of deaths has joined a Fisher in Kiev\nIs a weapons that poll which held it contains pretty old weapons dating back to the Soviet era and this morning at about three or the ... an explosion went off this fire began\nMeasures were proceed quickly puts in place\nTo evacuate people and we saw there's about ten thousand people who were taken away in the middle of the nice as some of those people have been posting footage on social media shows are pretty terrifying sight really a huge ball of fire effectively on the horizon and you can say at some points weapons exploding rocket seems to be going up and yet\nPresident Trump has apologized to the newly appointed U.S Supreme court justice Brett Kavanaugh of forty code a campaign of destruction against him based on lines and deception during the confirmation protests Kevin ... sites historical allegations of sexual assault\nDuring the confirmation protest Kevin old face historical allegations of sexual assault\nThe investigative to be in [noise] gave me\nThe website spending cuts seemed to get more details to the British Parliament shortly about the Russian military don't say it's named as a second spy who puts the form of ...\nExcuse me who\nPoisoned the former Russian agent send a guy ... in England last march but in ... Michigan is the true identity of the supposed consensual loving towards the Britain is implicated in the know that they can attack the rain for the most guy\nSeparately uncomfortable for the crime that I see I think came out I really I mean I say the ... we have an independent and ... and cats\nPlaying but that need to fight Zika does not very like the one that we've seen in the images of the line calling us off I think that they throw off on the Russians ... and ... out\nThere listening to the world news from the BBC\nThe United states has called for a thorough investigation into the disappearance of the prominent Saudi joined the gym ... last week the U.S secretary of state Mike Pompeo said he does that sound your fellow to to be transparent about the master\nTurkeys ... a critic of the Saudi Government was murdered in the Saudi conflict in Istanbul\n[noise] Australia is considering plans to ... to federal temporarily in regional in rural areas when they arrive in the country the aim is to ease congestion and overcrowding in the main cities most migrants who arrived last year went to live in Sydney Melbourne\nAnd their case to be the first of its kind five young Filipino men including one teenager or to a British convicted Peter found for damages the high court in London\nThat'll give evidence for our video link about the ... the abuse they claim to the south and the children of the hands of Douglas laid while he was living in the Philippines and gets Crawford reports\nIn the Nineteen seventies Douglas laid campaign for the legalization of sex between adults and children in Nineteen eighty five he emigrated to the Philippines buying a house in a poor neighborhood\nFamilies complained he would entice bullied into his time and sexually abused them\nSeveral attempted prosecution failed but two years to go off to being extradited to the u._k. he was convicted of child sex offenses in Britain and given a twenty four year prison sentence nice find young people from ... city in the Philippines assuming him for damages at the high court in London\nPolice officials in Japan say as you keep it has been moved to death by ... in his enclosure the target it today to do with a tranquilizer guns wide target Seventy exist in captive breeding programs a lot for a living in the world was shown in Nineteen fifty eight\nI bet it's the latest stories from BBC News\n[noise]\n\n\n\n[noise]\n\nThe citizens and welcome to the Thomas Jefferson out your weekly conversation with President Thomas Jefferson this week president Thomas Jefferson as poetry was Thomas Jefferson\n... with presidents Thomas Jefferson in this week\nPresident Thomas Jefferson as ... Thomas Germany now the Japanese you to crush me now is your college and get some resident in Jefferson does something uncharacteristic he leaves Virginia and goes to Kansas you know David in his own lifetime you never travel more than ... miles west of his birthplace\nBut in this instance on September fifteenth two thousand Eighteen Thomas Jefferson went to south eastern cans\nI Love to a present these shows ... because well I really enjoy a speaking with President Jefferson and in the barn and\nAnd getting him one on one and just inside so I I don't know that people really appreciate your talents at a presenting Jefferson to to a large audience you said over five hundred people attended this and I must say to that they the presenters just did an excellent job\n... wonderful young man who was um my host and the ... the interlocutor moderator from the audience is was a big no family Center for the arts on the campus of Pittsburgh State University in southeastern\nAn advantage for new facility and they ... they provided us with just this Christine recording of the whole show and I I Will say that um\nThe show went for about Ninety minutes and of course we don't have that much time on the Thomas Jefferson our what we will post the entire show is this week's pod cast off so if people want to hear they can go to a Jefferson our dot com and find out all sorts of things in and here that show in support the show\nI Love live concert editions of the drivers from our I knew him do them as fundraisers around the country and I love I Love that this performing arts center is as beautiful as anything in this country and this one is just the blows your mind to think that in a\nA centrally tiny town in South eastern Kansas there was a world class performing arts center and you get on the stage and you're types in your way you know and you just want to ... you just want to just want to hold postures because you're looking out on this perfect space the coup sticks were\nAbsolutely spot on\nI I think it's important to the people know that you do this on a regular basis lumped into it or they can contact you through the website and it will have some pictures from the performance on the way it was just great I I I'd like to cut our conversation short ones go to the drugs or to the show in particular there's a a\nA segment of vandalism that uh oh resident of Jefferson in globalization and coming up\nThey found that if they if they're if they find on the inside of\nChina is gaining a foothold in Europe's economy then the next MORNING EDITION [noise]\nTuesday Morning beginning at five central\n\nHigh I'm Valerie Smith development director for high plains public radio and I have the direct benefit of working went on the line with H. P. P. R. members and under writers in my opinion public radio attracts the cream of the\nPeople who support public radio or lifelong learners think globally and act Berkeley they concerned themselves with news that matters and music that's meaningful the knowledge grow community give today at H. P. P. I. dot org\nWelcome back to the special edition them to Thomas Jefferson our drivers mama road in Pittsburgh Kansas hosted by K. R. P. S. F. M. eighty nine point nine a broadcast service of Pittsburgh State University David going\nOn these concerts tours is one of the joys of my life I always come back recharge you can hear it too so let's rejoined that performance right now\nOne of the problems that\nWe had to face was how large country can you hold together\nAnd we were using very primitive infrastructure you know we have a few little\nNational trails like the matches trays and the national road that went through Pennsylvania but for the most\nPart this was a a virgin confident the rivers had never been\nChannel allies the pilot never broken any of the grasses the trees are never meant God was said during my time that a squirrel\nCould jump from tree limbs to train them all the way from the Chesapeake to the Missouri River\nAnd so this was just this vast primordial landscape and\nIf Montana was desert or semi arid for me looking at this in my own time that seemed to be hundreds\nOf years in the future and so I didn't worry very much about that that\nKind of brings back again to the original purchase in Louisiana Territory and that again in France they\nMuch about that that kind of brings us back again to the original purchase of Louisiana Territory and that again in France they they they discovered they they come ... somewhat they claimed\nThey eventually gave it to Spain because they thought it was useless again what areas where I saw was how are we going to use this land and and and um\nAgain in Spain a densely trades into France again\nAnd that sets off a chain of events because that is something you did not\nKnow about a publicly although I started getting some will some information about that and course Napoleon is at war with in Europe and so this has office this chains of events now you were actually end up on that in in France for a while\nSeventeen Ninety four to Seventeen Ninety nine I was a minister plan a potential route to the courts of of Europe and I joined Dr Franklin and John Adams there\nThe foreign ... time so you never got to ... I saw the beginning I was one of the most fortunate enough men I participated in the small way on our own revolution\nAnd then I had the chance in Seventy and eighty seven to see a much greater revolution and Paris\nMean ours was benign revolution compared to the French Revolution and and as you know the French Revolution went into very destructive direction eventually and\nAnd descended into a reign of terror and which ten or Fifteen thousand were beheaded than\nThere were terrible street riots and a whole series of wars were born of this that didn't really end until Eighteen Fifteen\nUm but when I was I left before all this really became chaotic and I was thrilled because I thought that the little flame that we live on the fourth of July Seventeen Seventy six which really was the beginning of a whole new era in\nHuman history when the rights of man we're going to be understood for the first time I thought that little flame had jumped across the Atlantic and now it was\nGoing to engulf all of the tyranny of the old world\nAnd our revolution was going to be the spark that liberated the entire earth and so I was thrilled at first and then I saw towards the end of my time in France that it was turning into a very dark\nDirection and here's here's the answer to that\nWe were right we were ready for liberty because we were highly educated we were European derived from northern Europe from England with England had a long tradition of the magna car to the bill of rights and the the glorious rebellion and so on and so\nWe were the inherit tours of a of a of a\nPeople that had already established liberty\nBut the French had never known liberty they'd only known despotism of the people were were terribly ignorant and if you expect to be an Asian ignorant and free you expect to have never has been than never can be in the history of the world and so I felt that they weren't ready for our\nLevel of freedom that that what they really need to to do is go to an intermediary phase and then wait a generation or two and then moved to a greater liberty and and eventually they would get to us but I haven't I have the stage there you can't impose\nDemocracy on other people they have to be able to create it out of their own value system\nAnd the polling it looked like he was more in the ah the market for conquer conquering the world\nAnd he was he was of the ... of the age you know exactly what I predicted what happened happened unfortunately but the revolution collapsed and the military dictator emerged out of it\nExactly what I predicted what happened happened unfortunately but the revolution collapsed and the military dictator emerged out of it and he was a\nPsychotic um who wanted to control the world and he waged war against everybody and it took from Seventeen Ninety nine to Eighteen Fifteen to finally stop it and\nThat would be one thing if it were just the old world but at bled over into our world the French Revolution bled over into American caused enormous political chaos here\nAnd and that's kinda where we get into the meat of actually the purchase that happened\nUm 'cause they\nThey hadn't they'd just acquired again the Louisiana Territory from Spain\nThey well they they pull in Tokyo from Spain he just insisted that they see to\nBack to that there was a there was a kind of a one sided trade when they're not\nIt was called the treaty is on the phone so and he gave them the Spanish almost nothing and so because he wanted to build a new empire he hit one of his plans was to start a New Orleans and then to to fill\nThe Louisiana Territory with the French and if he had succeeded in Kansas would be a French speaking colony or French Republic we\nAh [noise] however\nAnd what may be hit save that was what happened in Haiti or what is now known as Haiti or the French had a colony there it was a very profitable sugar plantations but there was an uprising in their slaves slaves up rose\nUm really basically slaughtered enemies horribly horribly horribly bloodied his laughter and you know they're they're a slave owners so Napoleon sends a one of the most to its powerful our monitors in the world and he was in the world to to Haiti he wants\nTo even get basically gives them the word or take it over and when you're done go ahead and head towards New Orleans and see what you can do there\nThe first thing he had to do is quell this rebellion and there was a the the conditions of slavery and the Caribbean were infinitely worse than here it's a bad institution anywhere but\nThe conditions were appalling and they were working\nSlaves to death and beating them to death and there were disappearances and concentration camps and it was an unspeakable mess and finally if you push any people too hard too long they will finally rise up and so there was a black leader by the name of to solve all of a chore\nAnd he led the black ... against the colonial masters and the poll and decided to quell this rebellion and he sent his best troops\nUm with his brother in law to to do this but when they got to Haiti son Domingo oh it was called then um the diseases they're yellow fever and malaria and so on were so I'm\nHorrible that they they killed off his troops that he lost the bulk of his best troops to disease and guerrilla warfare and so when this happened it was a debacle that was expensive it was it was time consuming it it it it\nUh decimated his armed forces it or disillusioned everyone\nWho was in the field and so in a poll and finally said\nI'm done with a U.S just sell the territory to the Americans if we can and get something out of it and we'll revisit this after I conquer Great Britain\nAnd Russia and this led to [laughter] and and this led them to be a so enthusiastic about giving such a great deal to the Americans to get that Fifteen\nDollar well he knew that if you know the war so when I became president and the polio and of course had already been done but there was the pizza mommy ends in Eighteen to and so there was a brief interlude where there was peace with lots of tell Eighteen five and this was a great boon to us because\nBut there was the piece of on the ends and Eighteen to and so there was a brief interlude where there was peace with lasted until Eighteen five and this was a great boon to us because\nWe were just as in some little republic and we didn't want to be caught in this world we just wanted to felt trees and create farms and to build a\nMerchant marine and and and and to gain some prosperity and to be drawn into that World War would have been just ruin us for us and so fortunately there was a three year peace well when you realize he was not going to be able to get to call this rebellion in Haiti\nThey find the information they if they're if they find on the team [noise] instead of\nChina is gaining a foothold in Europe the kind of stuff on the next MORNING EDITION [noise]\nTuesday Morning beginning at five central\nAs summer of fades age PBR radio readers book club gets new light the launch of our twenty Eighteen fall read from\nAugust three November we're talking aging death and dying with three new that first at being more to\nBuy I told the one day next medicine walk by Richard ... then cartoon it's Ross chats provide the little comic relief we can't we talk about\nSomething more pleasant to join us visit H. P. P. R. dot org for more information\nThan the one I'm Around my\nWe can't we talk about something more than to join us for H. P. P. R. dot org for more information in San Juan I'm Around my team will tell me if\nIt's you know him president ... live in Pittsburgh and clay you really good I Love doing it for my own\nLife is really fun to listen to his son David I Love doing fundraising programs for public radio stations and other entities around the country and it allows me to go see the\nEnd you know ... you really do you agree fun to listen to let's go back to the show\nI'm not I'm ... I'm\nI have friends who are masons at George Washington was a Mason Mary whether Lewis was a Mason in fact very whether Lewis created the ... and the Louisiana Territory in St Louis when he was serving as the governor of upper Louisiana I had friends who are masons in every direction and I'm very fond of must sonic lore and the sonic philosophy and the free masonry movement\nBut I'm not a joiner don't join organizations and I particularly don't joined exclusive organizations because they create social distinction and here in America we're trying to create the conditions of equality and so I like the term from the French Revolution citizen you know\nBlack or white or read male or female Jew or gentile or or Unitarian what we share as Americans as we're citizens so we are citizens and if we call each other citizen\nThat expresses are equality I didn't like the terms ... Mr and Mrs a master at Esquire doctor because they create these social distinctions which I think of damage to the European world\nAlmost beyond recognition and so I wanted us to find as many ways to be equal in America as we possibly could be and and every time I had a chance to join a secret organization I reluctantly said no\nJust because I did not want to help to create class distinctions we're so fortunate you know in my time I don't know that this is true in yours we had the widest middle class world that ever known\nA tiny number of rich and and even tiny are number of poor the great mass of people were the middling condition and there was this brought equality here and where there is equality there will be human happiness\nJohn Adams on how close with us and then we're gonna have another little segment of this of this program so so please don't rush out unless you have to I'm\nAdam ... and I had been friends than we core old I'm over the French Revolution than a whole range of things\nThan I supplied to them as the president he was a one term president and he thought he should serve at least two and was upset when he was retired and blamed me in part on\nHe committed the greatest snob and the history of transitions he left Washington city\nAt four AM on the day of my inauguration on the public stage because he refused to stay to see me inaugurated in this place that was personally unkind but it also was a violation of our system because\nIn a republic when we transfer of power from one administrator for the next and needs to be a sign of harmony in continuity and not just taste\nSo I never saw him again you know I didn't travel I I went back to mount a cello after my presidency and I never left its environs for the last Seventeen years of my life\nAnd Adams was up in brain tree Massachusetts and so we would have died on reconciled but our mutual friend\nOf ours by the name of Dr Benjamin Rush decided that he wanted to reconcile us called us the north pole and the south pole of the American revolution and so he made a real campaign of this over several years and they finally convinced us to start writing to each other by telling each one of us\nThat the other was ready for reconciliation\nYears and they finally convinced us to start writing to each other by telling each one of us that the other was ready for reconciliation and so Adams broke the silence first on the first day of January Eighteen twelve with a ... little letter\nAnd I wrote back a careful little reply and then he wrote a slightly more effusive letter and I did too and and then suddenly the flu skates of our ancient affection opened and we became um deer correspondence and close friends one of the things that we wrote about was aristocracy\nAn Adam said what thank you of aristocracy and I said\nI'm for natural aristocracy but I'm against pseudo aristocracy\nNatural aristocracy is talent creativity wisdom intelligence good judgment artistic capacity these people are born we don't all have it\nAnd when you find a natural aristocrat and by the way Alexander Hamilton was one when you find a natural or ... you want to nurture that person and lift that person into leadership positions in the arts and in politics and so on\nNot everyone can teach a college course we want our natural aristocrats to be those professors not everyone can paint we want our natural aristocrats to paint the problem in culture has been that we've given authority to the pseudo aristocrats and these are people who are just born into privilege they don't have any particular merit often they haven't done\nAnd so the good nation is the one that takes\nAuthority away from the pseudo Eris the crowds and puts it instead on the natural aristocrats of course that's what a university like this one does is is to try to nurture young natural aristocrats you call a meritocracy I'm for that ... were born\nEqual we have equal rights under the law but we're not equal and beauty and strength in character in artistic capacities or even intelligence and we need to lean on them best of ourselves the best minds\nBut the best judgments we want our our leaders are senators are governors our presidents to be the very best exemplars of what it is to be an American and when we settle for anything less\nThan we make this difficult because a republic is a very fragile form of government\nA republic only works if all of you in this room try to be your best solve all of the time to give our hard that is\nBut you have to try to be your best self and to be civil and polite and tolerant and generous\nEven when you don't feel like it but if we all do that if we're all striving to be our best selves\nTo read to work from evidence to argue only those things we actually know something about um to give people the benefit of the doubt to to listen with respect to tolerate things that appear to be intolerable\nIf we will rise to our best selves then if we all list this culture together we might be a a thriving republic and there's one more piece that I Want to close with and that's agriculture well I Love about Kansas as you have been a farm state how many of you are actual farmers\nThat's not good [noise] um [noise] that [noise] they're like three farmers here [noise]\nI wouldn't have come out I Know and I was told Kansas has this agrarian\n\nI Would never come had I known I was told\nKansas has this agrarian plays wheat farming and soybeans and turns out you're you're not farmers of I set in my only book\nNotes on Virginia those who labor and the earth of the chosen people of God if every haven't chosen people whose breath she has made his peculiar deposit for genuine and special virtue\nI Believe that a nation based on family farming is more likely to be virtuous I'm happy and independent than any other\nForm of a nation whatsoever so how many of you have some Jimmy a logical linked to a farm\nWhile they're usually the you're living on fumes [noise] I just started I just\nUrge the following two things since we're on a university campus number one I Want you all to grow up something in the next year a tomato geranium\nAsparagus a potato tomatoes are particularly important to me so I Want you to grow something even a little pop because if you grow as you know if you grow something it deepens your connection to the major\nNatural law so how many of you will grow something in the next year or we should we should follow this up and secondly I Want your wall to consider learning ancient Greek\n[noise] it is worth burning ancient Greek three at home or in the original and and you might think I'm joking\nBut I'm not it is worth learning ancient Greek to read Homer in the original and then you can read about happens in the fourth century and you will you will if you imagine if a year from now I came back and there were thirty Greek", "year": "2018", "show_name": "Thomas Jefferson Hour", "city": "Dalhart", "day": "09"}