{"month": "10", "state": "MA", "station": "WXKS", "content": "Seven Daniel full flooring yard sales going on now with incredible deals had lumber liquidators we've got hundreds of floors on sale up to fifty percent off in stock and ready to go see big on waterproof floors all on sale from just thirty nine cents get would look limited flooring all on sale up to forty percent off\nFree finished hardwood and bamboo starting at Ninety nine cents plus special financing stop by your local lumber liquidators store or visit lumber liquidators dot com today\nMessage into your ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload but what if there were a business\nDegree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree and as a little less sixteen months one hundred percent on line to find out more tax prepare\nTo seven nine six four or five ... P. R. E. P. A. R. E. to seven nine six four or five star\nTo your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online checks prepare\nTo seven nine six four or five that's P. R. E. P. A. R. E. to seven nine six four or five now are you in rock bottom [laughter] Seventy seven\nFebruary Seventy seven six family\nMan as us number one I\n\n\nSo do I do a home and have their first some rich girl but\nWe wouldn't max album rumors is releasing their second number one out in a row in the U. S. dominating the charge that number one for one week in laws for top ten singles including the number one drink\nListening to my heart radio more from Nineteen Seventy seven coming up\nIn the future of everything from the wall Street Journal on the epicenter that trial technology and superstorm digital money what max Perri kept biting supervisor\nJoined me Jennifer a strong anti examine how science and technology are influencing our lives today tomorrow and be on the future at\nThat point from Wall Street Journal\nJak search W at J. I. heart radio now we're more than\nTalk radio and just so little time you've been lied share and follow it to [noise]\nTalk twelve hundred Boston dot com he\n\n\nWas ground zero tonight you're learning something very important that is\nThat we thought we knew very strange place you're experiencing is something that became to walking in the ... are\nEasy to manipulate it's easy to a program\nAnd and do conjure spells and the workings and to put people into positions of helplessness would powers that they don't understand the book sorcery indication of strange this is Thomas ... book it's a very fast the book and here's the thing\nYou know Thomas I'm One of the lucky ones I have a copy of your book and I really think that every ground zero listeners should have this book because it is almost like and I I Want to compare it to the boy scout handbook for sorcery to boycott handbook to identify some of the things that are going on but you wouldn't normally\nAh equate with ah sorcery magic conjuring that sort of thing so tell me a little bit of book a little bit about what inspired you to write the book and where we can find a book\nWell thank you very much for ... for that that comment on the book well\nBasically what you said that is look we you know like it or not accept that or not\nBelieve it or not we are Marty Annette suspended ... sorcery it's being built tools non stop all the time and it's being done to us no stop all the time by people are telling us it isn't real and that's part of the the the the hacks\nAs well to make us believe it isn't real and if if you don't understand\nWhat's being done to you how can you defend yourself from but more importantly\nIf you know what you're dealing with how you can prosper in a world where you're constantly being ... can you turn it around and use it against them can you turn it around to improve the quality of your life and absolutely you can you can understand these things because the greatest way to defeat\nEuro presser is two oldest on their rules and then you know the ... the rules of engagement than that you can actually you have a ... like the fence even like the book is not written as a thing to teach people up the logical workings it's just very little about the idea is that just by knowing\nJust the ... the power of it\nJust by knowing it is enough to protect you I Know that sounds very strange but that's exactly what happened you read the book it seeps into your consciousness it stays down there and you've already got a far wall around your psyche you're automatically protected from anything that will try to\nThat'd be logical magical intrusions if you if you want to go for it or you can\nPut you don't do you don't have to be you can be an atheist and believe this bill you can be a Christian and tried this is not anything spooky are weird a lot of the science magic is ... like a lot of magic what we call magical practice\nA magic itself is scientific plays on things like psychology human nervous system on human behavior [noise]\nIt certainly does and that's why they always say you know if somebody gets advanced science it's always was picking his magic magic is science and we're learning about more with quantum mechanics and spooky brings in the distance Donald shared in fact you so much for being on the program that I really enjoyed it took care [noise]\nI get close right center and I will be back with more ground zero listen to ground zero dot com your phone calls Tripoli six seven three thirty seven hundred as Tripoli fix every three thirty seven hundred back with more ground zero don't go away [noise]\n\nThinking about life insurance what if you could make one free phone call and learn your best price for nearly a dozen highly rated price competitive companies well that's exactly what happens\nWhen you called select quote life for example Georgia's forty\nHe was getting sky high quotes from other companies because he takes met to control his blood pressure but when I shopped around I found him a ten year five hundred thousand dollar policy for under twenty five dollars a month I'm select quote agent dance to you know and believe me if select quotas and shopping for your life insurance\nYou're probably paying too much\n... more you're free quote comb eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty or go to select quote dot com since Nineteen eighty five we shop you say\nGet full details on the example policy it slowed down ... commercials or price could vary depending on your health insurance company over factors rebel and I'll say\nIt's about what they want\nOut of my life is about what's important\nIs pretty important for me to hear exactly what they have to say about lying life I got to say first of all I don't agree with the demonstrations weekend important issues don't matter what Amanda's white side west side by side down sideways how many people are going to demonstrate join the conversation it doesn't matter what side\nYou're from what matters is what you say the truth behind the Boston\nSwelled hundred Melissa from Michigan I work an extra part time job serving lunch at school but I still can't afford food on our cable\nVenue for California choosing whether to pay their rent prepare to record a good word doesn't leave us with much at all now we can even be for me on\nHunger is a story recon armed and dead at Feeding America dot org brought you by Feeding America and the ad council\n... home more conservative talk to your family even bought [noise] Ninety four or five at least you have to keep on talking twelve hundred and I hardly radio station [noise]\nFive thousand migrants moving closer to the U. S. Simon Carrick Fox News a caravan of Central American migrants continue to march through Mexico stopping for the night in ... New Mexico Fox is William laws you and ask\nWhen the ... and to transform the history of man\nHe is an opportunity now to move the world back from the bits of destruction\nBut returning to his government's own words that it had no need to station missiles outside of its own territory and withdrawing these weapons from Cuba by refraining from any action which were wide know deep in the present crisis\nAnd then by participating in a surge peaceful permanent loop\nAnd I think a lot of us don't know how close we came to Armageddon back in Nineteen sixty two hitting the pop charts on this stage in Nineteen sixty fix the beach boys good vibrations\nGood vibrations was just something that came up out of our subconscious her group huh Brian's always been an ally a timely respect it's music feeling\nGood vibrations who become the beach boys served number one hit and sold almost a quarter million copies in the first week of ... needed to the cost of producing the single was between fifty in Seventy five thousand dollars\nThree hundred sixty five to five hundred and fifty thousand dollars in today's money in Nineteen sixty eight Apollo seven faithfully splash down in the Atlantic ocean after orbiting the earth a hundred sixty three times in Nineteen Seventy three AFL CIO President George meaning called for the resignation of President Nixon\nWherever I I don't know that at all [laughter]\n\nWe're on an airliner [laughter]\nThe nearly nine hundred delegates at the AFL CIO convention bounce harbor Florida called by the president to resign and to be impeached if he would not\nIn Nineteen Seventy six red dye number four banned by the USDA after it was discovered it caused tumors and the bladder some dogs\nThe U.S federal labor relations board voted to certify the professional air traffic controllers organization on this date in Nineteen eighty one strike the previous previous August in Nineteen eighty six doctors the Everett coop issue the surgeon general's report on a\nClearly this disease which drugs men and women children and adults people of all races must stop it is estimated that one and a half million people are now infected with the AIDS virus these people remember journey of whom are well and have no symptoms of the disease can spread the virus to others\nThe report made it clear that HIV could not be spread casually and called for a nation my education campaign including early sex education in schools increased use of condoms and voluntary HIV testing\nMany people especially are you are not receiving information that his rifle through their future health and wellbeing because of our reticence in dealing with the subjects of sex sexual practices and homosexuality the silence most in\nCoop one of the most visible of the surgeon general's ever in history a Nineteen eighty six President Reagan signed the tax reform act of Nineteen eighty six and the law\nAnd in two thousand one grand theft auto three was released ... genre of open world action adventure video games as last spring controversy around violence in video games\nPassing away on this date in history many AT T has to thaw mud it's all in the game tonight yet birds\nSports caster Red Barber from Blazing Saddles cleave on little the movie that could not be made today a urine member her best as a character on the ... theater a match and the Lucy show Mary wicks\nPassing away on this data very tall lady character actor or actress I should say\nFrom the star of old Marcel ... law Arthur Murray hill a soupy sales\nVery funny comedian actor but you may not know he was a DJ\nAt W. N. B. C. in New York City was meant days sandwiched between Don Imus and Howard Stern and don't you know that had to be a good bunch to be around I and asked Ron Paul white passing away on this date in history this is the birthday of composer Franz Liszt\nPartner federally Titus ... how the Bob\nUh currently Howard of the Three Stooges Joan fun pain and writer professor Timothy Leary songwriter dory prepping Bobby Fuller who thought the law and the law one ad Annette Funicello all born on this date in history\nHappy ... birthday to Christopher Lloyd\nBut I Need a nuclear reactions to generate the one point but I Want you to go up\nFrom the original back to the future and of course he was on taxi the Reverend Jim Christopher Lloyd eighty years old today the co founders of Black Panther party Bobby seal is eighty two actor Tony Robert Seventy nine squeaky from limit from the paroled attempted assassination of a President Gerald Ford Seventy\nJeff Goldblum sixty six by and by tunneled fifty five Toby Mac fifty for John Wesley Harding fifty three from mister show Jay Johnston is fifty country music singer Shelby Lynne is fifty\nVery underrated pro wrestler ... Brown's forty eight from Modern Family Jesse Tyler ... forty three from Hansen Zachary Hansen is thirty three and for medium so the yeah that's a levy is twenty six I worked hard on that name\nThough some of the people who are born on and the twenty second day of October this is your birthday\nHigh for freshmen and we just want to say\n\nComing up in free minutes we'll go back Seventy two years Boston Blackie October twenty second Nineteen forty six you're listening to classic radio theater on your favorite station\nHi Wyatt Cox classic radio theater I told you about my pillow a lot but in case you been living under a rock here's one was a story\nMy pillow stays cool it keeps shape all night long\nNo more waking up in the middle of the night to flip over to the cool side of the pillow it maintains shape you can wash it you can dry added like new again it comes with a ten year warranty and I did come with the sixty the money back guarantee but if you buy one through our special opera you have up until march first\nTo return your pillow if you're not absolutely in love with it and go to my pillow dot com click on the buy one get one free special ... usa you'll get one free pillow when you buy one at regular price plus shipping or call one eight hundred\nNine to five one eight one seven five mentioned criminal code USA or go to my pillow dot com click on the buy one get one free special use promo cold usa a guaranteed 'til march first where she's going to get that\nGot an old car you can donate it whether it's running or not to the United and breast cancer foundation and save a life\nThey'll even come and pick it up for free\nThey United breast cancer foundation has saved hundreds of women's lives through their free or low cost to breast screening exams but now they need your help\nThe United and breast cancer foundation wants to save more lives through early detection by offering women free or low cost breast screening exams and donating your old car SUV or truck whether it's running or not it helps pay for them plus you get a charitable tax deduction\nHealthy United breast cancer foundations save lives by donating your old car SUV or truck called out for free pick up eight hundred to eight oh two one for for\nEight hundred to eight oh two on for for\nEight hundred to eight oh two one for for the call right now that number again is it hundreds to into Twenty one forty four\nIf you enjoy our classic radio theater broadcasts them want to start building a collection of your own go to classic radio dot stream that's classic radio downstream\nThere you'll find links to great classic radio collections on CD along with links to grade reading on classic radio plus classical radio theater on demand check out our Web page debatable now ... classic radio dot stream that's classic radio dot stream and enjoy\nEveryone loves liberties so why are you letting other people tell you what's best for your health care exercise your freedom but liberty how share liberty how share is a community of people volunteer at least share one another's medical cause members are able to take back\nInto their own decisions about their health care stop lending others do you want to do commerce that eight five five fifty eight liberty for more information or track us out online at liberty house shared dot org batch liberty house shared dot O. R. G.\nClassic radio theater on your favorite station we're going back Seventy two years for an episode of Boston Blackie as it was originally broadcast October twenty second Nineteen forty six\nOh All right ... right now going on and get a good night's sleep ... sure to today's rector around I guess it was the evidence collected that's going to send ... at a prison\nYeah we did a good job Ellen's I'm proud of the department says right says that God Reynolds of Santa Monica specter wait a minute you weren't walking home are are they go in there though may go\nAnd writing an\nHour drive from Gretchen the midterm election green Cox greenery out and\nVote here about it to talk about it I just don't trust the election why\nYou talk twelve hundred [noise] you know a year in rock spotlight Nineteen\nSeventy eight in January of Nineteen Seventy eight this Saturday Night lever soundtrack is released redrawing the music of the Bee Gees his number one in the U.S for more than six months and amazing Eighteen weeks it number one in the u._k. becomes a best selling soundtrack album of all\nTime in February Seventy eight Pasadena, California hard rock band van Halen where there were some metal duo album number nine you know the charge discover really got me cry\nMore than their album Easter goes the number twenty they're single because then I go to number [noise] [noise]\n\n[noise] you know\nThey may have Seventy eight to ... rock singer Bob Seeger releases attends album stranger in down it goes to number four in the U.S you get three top twenty leading Silverstein which also goes into her\nListening to her radio for more\nFrom Nineteen Seventy eight\nUnexpected reactions to smart financial decisions do you buy feed the big dot org\nWell I finally did it my student loan is totally paid off\nI Can't believe that I Can't believe it either I paid more than the minimum each month and soon enough it was gone you're just giving up giving up on what their life or luxury it keeps them rotten Gabby are there and they design or everything what are you talking about what happened to winning the lottery and mastering the art on the perfect memos that\nThing gala wearing enough you're ready to acquire a bodyguard vacationing in the French Riviera\nAnd then I just thought maybe it was time to prepare for my future you know get some financial goals make some smart investment open a four O. one K. was\nHorrifying right now written winning the lottery\nWhere everyone ... when it comes to financial stability don't get left behind good tools and tips for say they're going to be the big dot org dismiss it brought to you by the American Institute of CPR is on the council\nToday we just started to walk to school at the corner we waited to cross the street\nFifteen fourteen [noise]\nI mean that\nWe took a left on journal Gordon streetcar\nLoud music was coming from a car\nAnd he's a smart kid but the kids so distracted\nAre so many others down\nDanny hers to Danny\nSuddenly he realized he forgot his homework again a lot\nAt the school steps we hooked on\nReally hope he doesn't have another bad day at school today\nWhen you can see learning and attention issues from their side you can be on their side\nThat's why there's understood that or a free online resource for the parents have the one in five kids with learning and attention issues get personalized recommendations practical tips daily access to experts in more go for a misunderstanding to understood dot org rocky by understood in the ad council\nMandela or radio you want to hear\nUsed the thumb up and down by Gillette heart programmers know how to make I already urged down doll rags\nGot something to do\nSo do you think we're all here because you can't rely on the media quote them correctly Watson's\nHome for conservative talk talk twelve hundred\nClassic radio theater on your favorite state or listening to an episode of Boston Blackie starring Gary Coleman\nAs was originally broadcast to the October twenty\nSecond Nineteen forty six in the newspapers up that Tuesday Seventy two years ago these were some of the headlines\nSomething to strike of airline pilots and new demand by John Lewis which could shut down coal mines again in thirty days confines of the nation last night the walkout a fourteen hundred AFL pilots of trans world airlines resulted in cancellation of all the W. H. lights in the U.S and overseas\nTo surprise walk out which grew out of a lengthy dispute over wages\nBut some three thousand passengers predator horses because of transportation when the strike went into effect at four fifty nine yesterday morning meanwhile a new strife possibly developed in Washington\nWhen Louis keep the AFL United mine workers demanded new contract range which on wages hours in love with the man's\nUnder procedures like George which could shut down the coal mine November ... Lewis requested the conference with secretary of injury approved friday to reopen the miners contract with the government [noise]\nDateline Washington Russia's sharply ... yesterday in American Plan for ally that can do what is your free elections in Bulgaria\nDeclaring the plan would constitute glued interference in Bulgarian affairs the state department obviously irate made public an exchange of messages on the development and sharp notice it would keep a sharp object on the company [laughter]\nDateline New York international news services ... report representatives of more than a billion of this or is equal converged on this capital of world almost a yesterday\nIn preparation for the opening when the state of the first sections of the UN's established and held in America their aim is making other durable peace and dressed the range from foreign minister mall solved all the business suit\nAnd the radiant bowls of the area you being a delegation is down the emissary first it's headed to the task of located themselves in the city's private hotel\nConsulates clubs and private oh\nBut that software on Wednesdays beginning of the six weeks meeting during which they hope to heal the going bridge and beg for relations ratified peace treaties with belligerence\nAgree on the methods of governing last kept her from the axis attempt to read the earth and wanted to a new un are are a had missed three new nation as to the president families fifty one and it seemed to fifty other items on the historic agenda [noise]\nDateline Chicago the heaviest volume of livestock in three years yeah markets Sanders yesterday and to market full force Margot further shipments into congestion usually a railroad car shortage hampered some markets as farmers rush their animals to stockyards to obtain a high prices\nDespite the avalanche prices generally edge hire an indication that supply lines to consumers are far from sales and the band still exceeded supply [noise]\nBig line San Francisco a smile was indicated that the best antidote for stomach ulcers\nDoctor you're going ... psychiatrist at the University of California in medical school was authority but the conclusion that people would watch personalities are common among the victims of stomach ulcers Dr ... basis conclusion on a survey of patients\nAt the university's at Langley Porter clinic in San Francisco to psychiatry explain to people whose inadequate personalities leaves them and able to deal with complex situations become agitated\nA condition for ... [noise]\nSo some of the day is top news stories as report in the newspapers up Tuesday October twenty second to Nineteen forty six on your radio sixty Seventy two years ago today Boston Blackie which continues now on classic radio theater\nI'm sure when the wrong neighborhood rocky I thought this was face side of town\nYeah but said and done a mind like on the other yeah as long as I don't try to cut in on it and why over here\nThose around all day and that in to see you you mean the great rocky bold one time was fair is the city is number one rocket table stoop solo is to come to see me but I'm Still mostly in his face in line so I didn't miss this I've got a reasons for wanting to see you again they usually one I suppose\nYou want to try to scare me into doing something for a while I don't scare I got beaten up a little while ago because I don't ...\nIt got me wrong I mean because I Want to help you I Know last Saturday as goes I Know get mountain pro fat\nAnd want to know [noise] you know ... and his hide out a lame street uh-huh very interesting\nExcept for one thing I don't believe it why not because why should you across there and help Faraday\nOh that's ... I don't like cops clause that fat is only one cup among many let's say he's a one man who stands\nOn their way of controlling this whole town\nOn the stand ...\nWhen you put it that way to do for so I didn't understand\nOr you know for a black but that are out and get your friends that I did it for say a finishes within and sad you know what's that\n[noise]\nOctober twenty second Nineteen forty six Boston Blackie the conclusion in three minutes on this Monday edition of classic radio theater\nThis is a national health alerts from the healthier hotline\nAre you on Medicare and we're in a private insurance and suffer for back pain empty topical has a solution for you\nToday you can qualify to receive a pain relieving treatment which is a comfortable back brace were customize ... but a little or no cost\n\n\nHaven't frankly I could honestly kind of place in industry is going to be a right\nNot going to be a picnic Mary has power to in the house across the street from I may be able to log in my mom who does what [noise] stay here ...\nYears while I'm All right thank you but I'm Alone I don't like it just about to lead you brought a lot of men rolling it was maybe a battle but\nNot a long one of the shooting does it start like I Know I've got a hundred men I don't think there are more than two or three\nBut he has holiday aren't you afraid he'll kill the inspector if you opened fire on\nI'm going to try reason it wasn't the first AJ Jay and be loud speaker microphones out Steve there was no reason to bars All right\nWell good luck wrong [noise] I got standing out on the clock can I somehow you almost went very touching like can I\nAsk you a good girl and we say find a squad car fixed on [noise]\n... [noise]\nLet's see if I can be talked into showing some sense in showing himself\nOh [noise] [noise] [noise] [noise] yeah\nI\nI\nI don't I\nDon't know I'm Still remains at two wrongs ask him if I can come and go back to\nMy\nWife for telling us to make a deal and to see if our days where we still alive\n[laughter]\nProbably\nIn the air and good\nFrom Iran is I've got an idea how that works for our party out of there are no time you can't go in that they can you find out what they say\nI'm right here what is it like she performing or you're not going into what how are you I Am if I expect to come out of live give me a to a gas bomb you asking me one quick\nAlright heres one might need a search you think fine but they won't find that [noise] which may not do you mean exactly three minutes and then coming back yeah wish to what I said wish me luck you're about to get behind this what coverage what goes wrong [noise]\n\n\n... yes they're open up I Alone you saw me come across the street by myself open up\nAll right I mean let 'em in [noise]\nHe's alone there he's got his hands up to a lot of damage to your search and sorrow\nI don't think you'll find anything on me Tony ... oh there's nothing much to say he's clean\nOr Letterman and oh wait a minute\nEgg office at first I'll take it up on myself there and put it over here on the table how's that that's good come on and like\nThings like and put my hands down oh\nYeah yeah your hands down and your cards on the table\nYou want to make a deal what is it first I Want to see far they want to make sure he's still alive then enough\nGold brings Saturday out here do good and if Saturdays alive blackie then one let's wait until I see Faraday alive you just don't trust me to leave like you know mind uh no I wouldn't have much respect for their\n... like do they look like yes as much as we have a damn about finding\nOut like ... what are your pals alive blackie what's the day\nNo deal as far as I'm concerned that can go and kill them whereas my hand I'm\nGetting out of here by the way that like oh why is my hand on the table\nParty I'm driving on the far gas Tony I shall I got I got about ... we're not you don't mind if I got I I finally okay [laughter]\nWell yeah I've never been so [noise] [noise]\n[noise]\nOh blackie isn't this a lovely evening fudge I marry this was a lovely evening practically anything oh\nDid you say thanks to my ... ... you have\nWhy don't you realize that if it weren't for this ... I wouldn't have had anything to keep that tear gas bomb on them and that that would have been no way of getting ... oh well and I hadn't I Can't thank you very much\nBecky what\nHappened to rock the boat is dead and so it was beyond the man who killed him [noise]\nThey must have shouted out both the bulls eye oh bonds were then because he killed his friend Jenn ... yes uh-huh James he deserved guy there was a killer [noise]\nFrom when I guess I made about him\nI guess I guess to him right the night when I called up rocking\nYes I guess you did and I get to the good written he this was exciting letting it all the shooting and kidnapping\nOh I don't know Mary aren't saves the quickest case I ever saw some quick ... why do you say that well\nWhat did I Do the rest of your party\nYou put a tear gas bomb and your hat and your through your head on the floor of the gas would explode\nWell that's why I say was the quickest Mary is the first case I ever saw the drop of a hat\nOr [noise] [noise]\n... Boston Blackie inspector fairer day uh portrayed by Maurice ... best known for his work on the mysterious traveler a and that this episode was originally by at Seventy two years ago today October twenty second\nNineteen forty six you can find us on Facebook or maybe by searching classic radio theater email classic radio Peter G male dot com or pod cast are available through I changed ... heart radio ...\nAnywhere find podcaster sure his church usa classic radio theater or you can find them\nOur website I should say I just want\nA classic radio dot screen with classical Radio Free I'm Wyatt God's sake the stations support the advertisers and tell us ... great radio shows with my little baby face in the\nThere is a solution Glenn Beck has found who makes total sense to you end up very late your rent\nVisit audience is going to be the\n[noise] no pressure can once you understand what you're really facing the game that is actually being played\nThe dissolution weekday morning did not do it all my gosh I get a Boston conservatives are well\nMelissa from Michigan I work an extra part time job serving lunch at school but I still can't afford to put food on our cable\nDaniel from California choosing whether to pay the rent for a car to get to work doesn't leave us with much at all now we can even be for me on\nHunger is a story recon and in debt at Feeding America dot org brought you by Feeding America and the ad council\nUnexpected reactions to smart financial decisions brought to you by feed the big dot org [noise]\nWell I finally did it improve my credit score you're kidding right or know how are we supposed\nTo be the bad boys of electrodes in pop if you're out there being responsible the ban is about to be discovered this year\nI uh you've been saying that for a while now you think anyone in the rock and Roll Hall of fame was worried about their credit score I never really thought\nOf course they weren't rock stars aren't supposed to think about that kind of stuff we're supposed to think about how many guitars we've smashed right aggressively sensitive power ballads dark questionable fashion trends tragically breakup and blame creative differences I just\nI thought maybe it was time to take control of my finances you know start using a budget get out of debt\nSet some goals a budget\nThat some goals listen I knew that we'd ever created differences but I was hoping that involved a little more scandal\nWhen it comes to financial stability don't get left behind get tools and tips for saving a feed the big dot org this message brought to you by the American Institute of CPAs on the council\nBoston's you home for conservative talk to your family your boss Ninety four five nobody Judy I managed to keep on talk twelve hundred and I heard radio station\nMigrants back on track moving north ... character Fox News Central American migrants streamed through the southern Mexico border heading toward the United states after bypassing Mexican agents who briefly block them at the Guatemalan border Fox is William ... is\nNo new chair for the living room no nothing like that you'd never guess than a million years we had you know well they were having an auction sale over the commercial where all my stuff do you know who won the world could you get at a warehouse options she had a baby\n[noise] you don't buy babies this does not go ahead Mary Ann Arbor says they're still pay for her baby sister\nAlice father has nothing to get excited about I just got a very unusual bargain\nESL for what is that old isn't exactly and if it's more of them\nFor goodness sake I'll never get this cake frosting and their\nAllies I make in jail\nHey there's a truck back in the driveway well we really are I guarantee there's going to be the world's biggest surprise or the or the mantle bring 'em and\nI Can't say this is simply can't say that they're going to me and I don't\nWish I'll have to sign for older grandsons dried river from the commercial warehouse Sean right here please [noise] there you are ... I bought one but again we wish we put the others all you can just back to them in the back porch it emits back porch\nSure just act um up your social\nWorld is in that ... day\nI told you you'd never guess\nYou know like in the kitchen close the door but\nRisotto\nBrace yourself for the big surprise [laughter]\nOh no no no [laughter]\n\nYeah is that what you bought that he not oh job I'm there isn't some kind of a joke you\nKnow I picked him up at the auction just stopped in for a minute to see what was going on and the auctioneer said what am I did for these bags of fine roasted bean bags you mean there are more than\n... probably do more anyway he didn't get any business so he said when I didn't want to start a bidding ... five dollars for this five hundred pound\nRed you won five hundred pounds of Pina\nWait a minute I hadn't intend to bid on any but five dollars for five hundred pounds of Pina's it's a fantastic bargain I had no idea I guess and it was too good to be true anyway I said oh but five dollars\nNext thing I knew he was saying only when I ended up being sued for five dollars I couldn't believe it\nAnd having a little trouble believing it myself you know\nI thought maybe it was a set of antiques or something\nIn that help yourself there's plenty I Want any\nWeight like tell Joe we got five hundred pounds of peanuts you won't believe\nBut don't go telling it around the neighborhood will have all the kids in town over here\nAnd there have you any idea I mean how much does this one bag way\nOh probably twenty five pounds but think of it honey at five dollars for five hundred pounds that's only a span of town\nYou know what you pay for peanuts when you buy them in the store yeah all that thirty five or forty cents a pound I got two hundred dollars worth of peanuts for five dollars but the ones in the store shelves there\nYeah that's right but it's still a terrific bargain he not let down going upstairs and make plans for readings on\nDead is his bag just twenty five pounds it must be some others huh yeah that'd be a few more [noise] that's the delivery man again Jim\n[noise] well ... ... we've got a porch\nYou told me to come out here in ... and I wanted at the time I I didn't realize there was no money\nOh for heaven's sake washing machine\nGame see a man but it's\nUnder there\nOne of these five pound bag for banks to a hundred and you've got five hundred pounds was during the next twenty bags and those bags are little yes I can see that it it's none of my business was Dan isn't but if you don't mind my asking\nWhat are you going to do\nWell there are unlimited uses for peanuts I Hope so\nThey knew\n[noise]\nWell there\nWhat do you mean sure seems like a lot of Pina's just looking at them in the bag there but you'll have to admit it Margaret that's the greatest bargain you ever heard of a penny a pound think of it what are we\nGonna than Matty\nWhy there's no end to what you can do is we can shells some of them put them in jars we can grind them up make our own peanut butter or when do we do all their spare time long winter evening things are fun all families sitting around the fire\nWell I have to finish this cake this reminds us we'll be hearing a little while it'll be a case of knowing a bargain when you see one there yeah honey I don't think\nYou'll have to admit it was a bargain Margaret yes dear [noise] but I think it was a bargain then of course it was I don't care if it's peanuts or real estate or what the bargains are bargain sure it is you know what you're doing then ... what are you going to do them\n[laughter] well we\nCan't leave them there on the back porch I'll tell you what we'll do it but I'll give you a quarter if you move them down into the play for a whole five hundred pounds well you can take them one bag of the time the player was a good place for them\nOkay down under the clean room Margaret I'm crossing the Cape fear\nThe funny thing the way a person just don't move into an opportunity like that like right there the auction down at the warehouse [laughter] I Can't imagine that out of all those people down there I Would be the only one to realize what those peanuts were really worth\nI can imagine what it's doing to the front and Kathy don't get\nA two hundred dollar value for five dollars how could anybody in his right mind pass it up I just don't know\nMy dad told me Joe [noise]\nBetter brace yourself there sounds like you're in for storm\nYou're putting those certainly why not princess wind here tomorrow night well\nThat's all right the bags of Venus won't be on your way just pushed him over against the wall\nFather dishes my reading slob reaching the classics the literature and\nThen well I don't see as reading mountains Paradise Lost surrounded by\nWell throw a cover or something over the\nLaughing stock of the\nQueen of female friends as you're getting all upset about nothing can you do this to your daughter I didn't know you were going to use the play room I told my mother well I didn't know the peanuts we're going into the play room\nIf you'd asked me about it and here we have a little culture to rise above our surroundings\nThere's nothing wrong with the surroundings try to read the classics in a chicken ... just because of\nWhat is it was I didn't get all the peanuts into the play room\n[laughter] well\nThank goodness one of the bag broke\n[laughter] you know something burning some of the peanuts went down the furniture spend\nYou know you'll have to get them out of their their it'll be all over the house it isn't bad enough father that you know house into a peanut gallery we have all this\n[laughter] what are you going to do\nThat you know buddy buddy artist coincidence I'm asking myself the same questions\n[noise]\nAbout what it looks as if\nFather has an embarrassment to peanut\nVery true bill foreman October twenty second Nineteen fifty father knows best on classic radio theater Hi Wyatt Cox classic radio Peter I told you about my pillow a lot but in case you been living under a rock here's one was a story\nMy pillow stays cool it keeps shape all night long no more waking up in the middle of the night to flip over to the cool side the pillow it maintains shape you can wash it you can dry added like new again it comes with a ten year ... and I did come with the sixty need money back guarantee\nThrough our special offer you have up until march first\nTo return your pillow if you're not absolutely in love with it and go to my pillow dot com click on the buy one get one free special ... usa you'll get one free pillow when you buy one at regular price plus shipping or call one eight hundred\nNine five one he won seven five mentioned ... USA or go to my pillow dot com click on the buy one get one free special used promo code usa a guaranteed 'til march first where all she's gonna get that\nBe old ten thousand dollars or more to be all your Russian you cannot afford to make payments to the Irish humid qualify for this being the tax program this is a new program and if you qualify you won't make anybody wants to be Irish wildly ambitious program once you're accepted into this ...\nKong\nNow are you in rocks spotlight Nineteen Seventy\nMeals release the specter produced album let him be generating renewable want him\nLet it be and the final number one the long and winding road to ... song Lola about a romantic encounter was transvestite make them retreating K. and number nine you\nHe's alive is to just release their second album on a lecture records one house and British Band Monroe Jerry or number one in the u._k. number three in the U.S with the single in the summertime\nOut and see what you're getting by\nIn August Eric Clapton releases his first solo album and scores of twenty hit with this coverage Gigi hills after midnight Neil Diamond gorgeous versus number one with crackling rosy September Nineteen Seventy Neil Young at the top Janelle with after the gold rushing Warren anti war protest song by Edwin star topped the charts\n\n\n[laughter] listening to my\nRadio for more than seven\nUp to God it\nBack to the drone struck up next we have ... ... who's a\nMember of the shelter pet group that's right a coup known especially for the couch smuggling ball chasing based looking tail hanging back yard and of course companionship\n... would you say it's actually I did that with maybe a ... turn you around twelve or looking kind of mix tremendous do I'd also like to point out such was coloring all white or a brown and black parental simply Marvin you know it's\nSuch a treat to watch Dr ... after she just actually\nHow he makes I contact with us I\nActually don't treat stare\nHow in ... [noise]\nOn no UPS ... new turning in circles happy dance so common with this group [noise]\nConfined when they were loving fixed rate how we just\nGets in there and while licks contested but really the best way to know in amazing shelter padlocks attachment nice to meet one was it the shelter pet project dot org today adopt\nBook you buy nice on the humane society of the United states in the outcome so ... ...\nName is Dale ... Nineteen years old and this is how I live here and I did I've always been kind of computer geek and I found a way to use those skills to help the homeless in my community\nComputer skills any basic resume are so important may seem like a small thing\nBut it makes a huge difference that people go through in the United way created a program\nTogether we go through their whole chop history write\nOwn us be trying to provide work books and trains I even budgeted for cupcakes so he can celebrate as a class from one of our people get the job that huge when somebody says hey man that job they helped me apply for I got it\nThat's what living you know I didn't feel like to me my name is Dale to help people chief financial independence so I don't just wearing a shirt\nGift and became\nVolunteer Libby nine and ... by United Way in the ad council\nStuff people are talking\nAbout you know we need to every ... out of our government Boston ... all\nLife radio feet are on your basement space Malibu\n... about ... seconds Nineteen [noise] I'm not at\nAll I was ... Michaels who was your was at Davis whereas my cake I mean it took\nA don't ask me to explain it's just one of those things but you have any given that Margaret don't use the word we all take on the table thought that was why I asked him already Martha's birthday I was trapped believe me but what what I tell you\nWhy I didn't know\nI Will give me time if I had known this is Michael but I wouldn't be like honey out by another case there isn't here than\nFederal sticks that yes but I've been thinking about your idea of filling the peanuts maybe I could do all but I I'd give up that idea by with you\nBut I got a swell idea if people laugh at me I can just tell them I'm helping my father\n[laughter] no\nBut well would it be any better if I said my cold father\n[laughter]\nYeah I'm here comes Mr Michael ... the rocks will jump to have to tell like planes\nRun some ... Margaret you go in the kitchen which could either that yes I'm taking care of it but here's a dollar gift those peanuts out of the play room although I Do all of them I don't care what you do when\nYou're there in Seattle right All right I could call the zoo make a deal with\nThe oceans maybe [laughter] that's good [laughter] yeah All right All right\n[noise] well uh Mr Michael ... is that stretch it sorry to interrupt your wedding I uh I'm ... well it's a pleasure to make your acquaintance or in fact there are a comment and\nWhat do you think he is these are busy days aren't they Mr Henderson is they certainly are busy day\nHere and there the yeah I was supposed to pick up something for Mrs Michael I completely forgotten what it was\n[noise] bad is he doesn't\nKnow and she she told me only five minutes go does your mind ever do strange things [noise]\nFamily often think that was something\nIn connection with the charity searching well don't worry about it why don't we just let it go until you know it it it was something your wife the computing something we were going to sell us district judge them that well I'm sure Mrs Anderson would know\nWhy dollars really the these are busy day you know maybe if you went home that really case\nWell\nYou the truth or you just after forgive me really I'm going in circles my wife is the chairman of the ways and Means Committee\nThe district and I've been running my legs are rounding up things to sell can they saw rings that\nI Am using my mind over Pina not use you know there isn't enough to be had in this town\n[noise]\nWhat uh what what was that again some unscrupulous speculation buck up the last five hundred pounds and the way you know whoever he is he has a corner on the big enough\nNot to say it\nReally makes me sick is that the ... the ... five hundred pounds of options for five dollars if I could have had even a hundred pounds when they saw when he died the sack his heavy all of them in a\nBad is Michael open a corner of this bag [noise]\nBy some how how many you know five hundred pounds [noise] miss ... [laughter]\nWell I'm not exactly a peanut speculate are but I knew it was a barking or are you interested\nIn just as the old saying by lucky stars what's your pride and much for the lock no charge\nJust say this is ... contribution to the charity dirty over ... you forgive me those awful things I that I should bite off my junk you all the houses here are some very solve this book or you know I I'm going to get to talk to all those Tina's oh bless you don't change your mind I'll be right\n[noise] holy\nCow you must have snapped his cow\nNice held a hearing\nThe conversation there you are probably didn't know you were married to and unscrupulous speculated\nWas practically bring with joy congratulations there the peanuts grow wonderful Vargas\nWell thank you I've been trying to tell you that ever since I came home here pretty sharp bad\nBut run upstairs\nAnd tell your sister she has anything to say she may come downstairs and address me in a respectful tone of voice [noise]\n\n\nWe'll have to be a little quiet right now you see the very end of the literary society is in session and the downstairs but without the living room Margaret of doing some ending while Jim reads the paper\nWhat are you reading their nose and very interesting ads in the paper demand oh such as\nSomething that's the only place that piano can go there there's a fireplace was building those shows on either side and going around the corner to each of those ...\nHannah would fit in between that when now\nAnd the doorway that I ... I\nMean I Know that's an outside wall too I mean the I think\nThat is an outside won't have the yardstick please thank you cannot put it over there they're very sick and and I go there I don't know why your mother to measure and when he too and I like ... thirty six fifty fifty eight it would fit in\nWith a bit in with its an outside wall or for the more you can have the piano jumping out like that right in the doorway every time you walk through your cricket hip on the on the piano\nOr you can have it then why are they going to go to\nThe inside wall right here and I can't go there I I got I got to the guy I have a plan but why\nWe're not putting the silver there that's going to going on one side of the fire but what about what are the big pieces do we have nothing we even talked about what would go on this wall ages ago\nNow I have something\nWhy well I've got the pride ... and I said why did\nIn the\nOcean that see I told you anything their favorite well oh what is it\nRan I wanted to save it as a surprise\nSecretary are a lot I think governor when secretary or something you know the bottom part is kind of a death that opens and by that is a bookcase absolutely beautiful hunting and I got a real bargain it very wide and very high and it has to go on this wall\nOh for pizza if a genuine antique darling and you will just loving and holding it finally tell me moving\nOne man's holding it the ... finishing I don't know\nI don't know why I bought it they don't look at me that when I was with magic famous and you know how much does she said I had to get it and so I did and\nFrankly I didn't think about it ever since I don't know if I should have gotten it or not you know how that makes you feel that you're an idiot if you don't do what she says in time I get talked into it and so\nYou don't worry about oh don't worry about it I'm sure it'll be All right so many mistakes on this house was one more thing\nOh dining room model any room in their\n... dining room table ever heard of the piano in the dining room but\nNot call it the dining room call it a combination dining and music\nRight now about over there for the side board goes you know the Roman yard than\nThan mine didn't I don't\nWant a piano when my son when I get my desk in there and all that I Want him to run for piano\nThey maybe we could put it right upstairs and vets who bedroom\nSquare investing bedroom with all of building shells and covers her play thing\nWell maybe a little I don't know maybe we'll have to put it down in the basement sooner or later we'll fix up a rope Israel down there and you know but\n... ... yeah [noise] and keep the piano when the basement and walk with my mother think he gives his hair and I and the piano and she comes over to visit and find to put it down the basement of\nThem ever going to give it back to your mother\n\nLove that just don't get it a practice now she has to have it well I certainly wouldn't hurt my feelings by giving it back to her why she was so sweet to give it to the right\nAll right All right well what what are you going to put it in the kitchens the only real live unless we took a best of all because the piano when one of the best\nUnder this way where I had I not go on to the day away is wanting to mind and I want how their body well I don't know you have a well for goodness sake why can't I don't think any done [noise]\nAnd I\nMet Mr devil jak one inch Charlie something can be done and hauling I'm telling you even one initial damage can something be done to get that piano to fit under the than we couldn't we cut into that wall take some of the closet they record\nYou we could make kind of on the al ... effect than aren't going\nTo cost ... don't have to go through all that\nThen you got to do before\nAnd that may be bought and beam that after a hope\nOr can be doing All right but\nGosh it'll take a piece of your calls at\nAll I don't care about and I'll hang a short thing in the rye I think one thing that really ... how much would it cost to make this change we're all going to do that right now\nWell tell me not want to know anything can be done I haven't got an expense well we're going to put the piano Dan mother gave that could that they view it off and ... and you know my mother I Will never hear the end of it if we dump it in the basement I've told them we were putting it right in the front hall and she was pleased right\nOn it All right you know your mother well\nI'll get at it first thing in the morning then\nOh gosh now is that just about and\nBeing so I Know I Know it's a\n[noise]\nA couple of my daughter has written a glimpse of stars piglets Alan Boss would run the Myers meddling pierce John Shelley [noise] and it's produced by water harden\nA couple next door on classic radio theatre\nWork research has become pretty familiar to all of us in the last ten years or so\nBut have you ever stop to think what research especially medical research moved to you personally\nWithout research we would have no penicillin or any of the other wonder drugs research is also the most important weapon in the fight against mental illness\nAnd mental illness today more than ... million people\nAlready research has opened up leaves for preventing many mental illnesses and research has shown us speedier and more effective ways of helping Middle Eastern people to get well\nResearched either say we can be ...\nWhat they need help from us they need money to carry on research\nWe help serves signs can give us a much better chance to escape mental illness and secure mental illness if it should strike\nYour for the mental health funding care of your local postmaster just gr mental health from your job your local postmaster\nDon't wait this worthwhile cause need your support no\nAnd we thank you for your support can contact us classic radio theater Gmail dot com classic radio theater at ... dot com or you can find us on Facebook or me will you by searching classic radio Peter our website classic radio dot scream\nThat classic radio dot stream more restrained classic radio beer and as always you can find our podcast you I can use me we the heart radiolab anywhere where find pod cast are served just church\nUsa class radio the\nLake for making us a part of your day I'm Wyatt thanks for listening thank you for the advertisers and there's all we\nWith your feet are on your favorite station\nThe usa radio network [noise]\nBeen diagnosed with Iran Dr Limbaugh fear for you are still is much deem ranged see out there\nFor the liberal enclaves in this country Trump has more in common and it's sort of\nThing I've ever heard of\nThis is a definition\nOf the week days at noon on derivatives dog Dr Wilbur laundry now a year in rock spotlight Nineteen sixty\nNine may have sixty nine Neil Young releases his first album was crazy horse everyone knows this is nowhere featuring the songs should have been drawing down by the river nearly doubled concept album Tommy which goes top ten in the U.S and the u._k.\nMom [noise]\n\nHave always ... space oddity released going started to be followed the news landing reaches number five in the u._k.\nAlso in July by doing at the top than you would lady lane is new deeper sounding booths who signed which he tribute to quitting smoking\n\nIn your mind\nShow then\nAnd you see this\n\n\nBug sweat and tears I have a number to hit with spinning wheel popular rising to show called brash rotten movement medical ... Chicago and electric play\nJim ... owner\nAlmost been\nListening to my heart radio for more Nineteen sixty nine coming up [noise] ... for conservative talk to your family even bought [noise] Ninety four five nobody ... you can talk twelve hundred and my heart radio station\nThe caravan of migrants move closer to the U.S border I'm an Carrick Fox News Mexican the agents blocking\nThe Central American migrants briefly before allowing them in at the southern border Fox is William ...\n\nRetriever around the\nDog would you do it like sticking the lake and he runs in and bring back somebody's banking cabinet and again\nThat the guy in the end do you have a dog\nIs Nicky I only wanted one because mom always told me to be done to kind of animals [noise]\nWhen we do and I had a horrible like you and what happened to the wire hair with a short circuit [noise]\n\nThen who was trying to sell me a job and then turned out to be a pinch human cell\n\n... days how revolting\nWhat did you do at the\nEnd she on he's delighted with the housing situation until Nineteen Seventy two [noise]\nOr three kids that went on to the business of beauty I got three clients with type ...\nDone rather attractive Elvie unit bottled work must be an interesting it didn't really you know the best way to avoid Bollinger McGee is duct one side\nYou get a girl to avoid falling air just took it upon and bombing us\nAnd finding the game [noise]\n[noise]\nLet done I've used that joke for twenty two years or hey you gotta go else\nI think it's safe now they have is Nikki it just you know what you need to several days now wherever I Do I Want to stay out of sight too long or you might get carried [noise]\n\nQuite a character that you can buy at her job I shouldn't be eliminated and I'm Glad I'm not because you being a woman\nI meet dandruff might turn out to be a lovely ... sentiment Danny ... but if you're going down at the time to get them she listings you remember the name of the getting shocking huh\nOh yeah well come on let's go to my mother never mind the map\nYeah I Know but I ... I don't have to put on a neck tie where do you suppose I put my own it where it is I don't\nKnow I had a kid [noise]\nAnd it\nSounds a little different this week it's because the program is originating from Palm Springs rather than from a Hollywood, California as ever in Mali around for a convention of some stores or at least in the entertainment per se [noise]\nAh the Johnson wax program ... McGee and Mali October twenty second Nineteen forty six we continue in three minutes on classic radio Peter\nHi Wyatt Cox classic radio Peter I told you about my pillow a lot but in case you been living under a rock here's one of the story\nMy pillow stays cool it keeps shape all night long\nNo more waking up in the middle of the night to flip over to the cool side look below it maintains shape you can wash it you can dry added like new again it comes with a ten year warranty and I did come with the sixty de money back guarantee but if you buy one through our special offer you have up until march first\nReturn your pillow if you're not absolutely in love with it and go to my pillow dot com click on the buy one get one free special ... usa you'll get one free pillow when you buy one at regular price plus shipping or call one eight hundred\nNine five one he won seven five mentioned criminal code USA or go to my pillow dot com click on the buy one get one free special used promo code usa a guaranteed 'til march first where all she gonna get that\nEveryone loves liberty so why are you letting other people die you watch best for your health care exercise your freedom liberty health share liberty house share is a community of people volunteer at least share one another's medical gosh members are able to take back\nThe freedom to make their own decisions about their health care stop letting others do you want to do commerce that eight five five fifty eight liberty for more information or jak goes out on mine at liberty house shared dot org bashed liberty hill shared dot O. R. G.\nHi I'm Chris cofounder of neuro coffee a delicious nutritionally enhanced coffee recruited to not only improve your focus and attention to also support your brain out it's been featured on roe magazine ... magazine called the next big\nThing nor coffee was developed by nutrition PHD doctor Mike resell\nWe created a coffee there not only piece amazing it also supports bringing up that neural coffee I Am so confident that you love neuro coffee but you don't like it you can return in three days for a full refund and I'll even by twelve ounce bag of your old called\nEvery couple of nor coffee isn't as with all natural antioxidant that support your body's ability to grow and repair Nora these are the options protesting to human clinical trials\nTo prove that they work basically it's a brain of supplement infused into amazing artist and coffee with a deli cause there's less than what you're currently paying again if you're not happy you're going to turn in three days for a full refund and oh by your twelve ounce died the bureau coffee is truly risk free start drinking coffee to support your brain help now I'd get bring copies dot com that get bring coffee dot com\nGet bring coffee dot com get bring coffee dot com\nI Am way down the route to conservative warrior my show war now here's the everyday right here on us in radio from six to ... pm eastern uh most of the ... the way down the road show a Newsmax TV reaching over fifty million homes but my favorite role of the speakers drug there I was opening speakers many Donald Trump for president events I\nSpeak a Republican conservative ecology of events and I'm available to be the start your next to ... contract me to arrange for a waiver keynote speech\nAlso free agency for for for ... that Haiti date for for for R O O G or email we were at ... dot com\nClassic radio theater on your favorite station from Palm Springs California October twenty second Nineteen forty six ever [noise]\nOnly make it look at that now the people who have defected to be a mob of ... [noise]\nNo but I forgot it's been dominate the Montana let's goal in anytime I pay a dollar for a very\nGood writer and I said well no not really clear your garden or recovered from America up your mind\nHey hey wants who your governor you slap sided bunny and grower\nGrowing\nHer ... her her mind burn your skirt [noise]\nI don't think it's ... I don't ... queens [noise]\n... I think he's off my ... are you a ham handed stop sign right you're going to start being you\nKnow I Know\nYou wrote company Mick [noise]\n\nWhat are you doing in his precinct anyway\nLike the number of them was playing the fly speck you're a little off your beat aren't you [noise]\nDark beard is your daughter\nOr for murder would your today that this we may not be on your dog and wouldn't sure\nHimself a large extent shopping kids Mr among gay he ... he didn't do your duty to somebody else and well let's get this over with so long square\nAre a good day here in front of the writer with atmospheric the don't rent a word of a\nCredit card the mayor never go dry you\nKnow maybe I'm wrong maybe your partner or [noise]\n\nI mean the opposite his name is ... ... square\nBecause when you want him he's never around [noise]\n[noise]\nLie to ground isn't it yeah I suppose they'll find a few things in the notion divide and then\nThey pass the bar walk I Need the money may a gym right over there how do you know the only guy in the store the standing still [noise]\n\nWhere do you keep your shoe laces or in the top right hand or my address is ...\nYou made in the door that you know since ... over and I beg your pardon aren't you Mr bitter muggy while at the end is going to be quite a scandal in our neighborhood [noise]\nWhy but I'm so glad you came in the [noise] the uh ...\nThey've already been overdone charge through your kind of why this late date but we did the best of the good madam after all he signed for them you don't want to if I did my guys you get an old one piece broke out I'd want to cancel the order all the manager a yes or have you seven dollars and sixty five cents and said\nWhat all day long distance [noise]\nHe's in Palm Springs amends whatever [noise]\n\nAmong Molly make me look at those you know the California bar chairs to get one of the ... yeah they're still comfortable\nWhen the cod are open note tied the loud ain't my trouble I wear the Colorado and the cost I but I never wear up and I mean\nWell look who's here they're calling an old expression good day Molly you know Dr gambling eyes skin graft or [noise] here looking for the cutlery department it's in the basement Denver oh character like the basement on me gain mind your man and\nA year in rocks spotlight Nineteen Seventy two\nBy by\n\n\nDe dum de to Don McLean goes number one with the single an album American Pie Paul Simon saw debuted gives them a content his mother and child reunion\nBasketball were to march where Neil Young has a number one album and a number one single with heart going and the purple relieved there would you sensual album machine had which goes the number one in the u._k. number seven in the U. S. had reaches the class of kids smoke on the water oh\nPaul sue in March the band America released their debut album he goes to number one and use the number one single with wars with NO NAME way\nListening to our radio for more\nFrom Nineteen Seventy two are coming up\nThis is more you work so hard to pay the mortgage a\nHome is more than ... ... ... ... ... the courts winning summer night just pajamas would treat everybody over for dinner and the old stuff chair in the living room and you just can't get rid of this is what do you work for a second job this is why you learn to six weeks or so\nSo you could see\nGoes home was your place your memory family sleeping in the room that night [noise] [noise] [noise] that is why we want to ... we are making home before [noise] free government resource that can be paying the mortgage [noise]\nYou know even more options are available [noise] cold eight eighty nine Ninety five today ... eight eighty nine nine\nPliable or visit making homo poor dog [laughter] which is why I wrote to by the U.S treasury notes\nI uh I found a toy dinosaur over on the playground ... street uh it had this phone number on it and well I I just wanted to make sure the dinosaur made it back to its little owner [noise]\nYeah Hi I think I found your kids' stuffed animal near the swing set 'em just want to call I'm sure she misses it\nI Know my son gets to a protest at the smallest things even a fire truck and I'd be happy to dropped off [noise]\nI was a little money so cleaned it up and um it's good to go whenever you're around [noise]\nWhen I found a little sip\nA cup I just had to give you a call for it you know we do anything for kids yet one in six children in the U.S struggle with hunger help end childhood hunger in Massachusetts and New Hampshire and give all of our kids the meals they need to grow find your local food bank at Feeding America dot org\n... by Feeding America and the ad council\nHe originally ... were making the insurance company branch and what making a pharmaceutical company perhaps is Boston server to dock talk twelve hundred [noise]\nLaughing radio beat her on your favorite station you're totally Johnny Dollar comes up in about ten minutes\nBut right now the conclusion of favor muggy and Molly from October twenty second Nineteen forty six now that\nYou met missed cremate where\nNow than what was she doing singing in Oklahoma\n[noise]\nThe physical impossibility hundred if she was in Yonkers okay they're singing or out in Oklahoma if you had a voice like that you are like I said you're saying ... or a girl\nIn the same number of religion and the youngest old for me to put\nFeet were younger than ...\n\nMuggy [laughter]\nWhere'd you could have a job with us today he loves the mayor wouldn't get near the ban what kind of a job with drip\nI don't want to have any particular favors mind you I Want to start at the bottom you will you all the new store inspector [noise]\nCouldn't again when you're trying to stir up trouble between the mayor and knock the gamblers don't you realize they're both gentlemen and nobody can win anything from a gentleman except another gentleman\nI'm just trying to needle along baby that love of or they're just too quiet needs to fireworks is love is about to be conservative don't you think Cuba where more close my gosh I don't see why\nThey aren't you Mr muggy oh no not again is ...\nWhat is it but here just a matter of trying to contact with a muggy it's here\nBut even got it on the ... for delivery\nYou look you near you lean on the counter I I like the man what loaded on the truck for delivery care why the combination bomb shelter and septic tank Mr McGahn [laughter]\nRight on order for three years is simply beautiful and it's muggy really yeah but but but but but the ... that was way back in ... by\nA bomb shelter no wait a minute by minute second maybe you're not that comes out but like I can show that they phrase yeah I'll think of something for that but a bomb shelter but if you think for one minute I'm\nWhen I heard All right we have your signature on an order and you have to discuss the details of the credit monitor good day\nLA it's been quite a shopping can\nWe take for rock camps in diving you know\nI could do rather than an IV long enough as it is let's get Mike who strings and go oh\nRight All right that we get out of the ... ...\nS a myth that my husband\nI'm Sheila strength me one eight inches this round one show stranger\nOh I'm Sorry but we haven't been able to get mental chips for several years we had a war on you know but if you care to sign this waiting list we\n[noise]\n\nMagic and all those wartime orders coming to life\nDecrease which is terrible I don't you worry about it and we think of family\nBy George just man I'm looking or Mr muggy I out of it you have what your three ton dump truck miserable [laughter] around yesterday it's taken us for years but we got it down project but I Need back it up over to the bottom down but I got enough stuff over there to huh all night and [noise]\nThat's how we all got to make a gun for Black Friday prominent disgrace voyage farm spring fashion round up far I talk about how we have I mean what if a guy\nOctober twenty second ... in Mali you're totally Johnny Dollar up in three minutes on classic radio theater\n... is a national health alerts from the healthcare hotline\nAre you on Medicare and we're in a private insurance and suffer for back pain indeed topical has a solution for you\nToday you can call up wide receiver paint believing treatment which is a comfortable back brace were customize ... but a little or no cost\nCalled indie topical toll free now\nEight eight eight nine nine eight seven to two five\nIt just takes a couple of minutes to qualify for these amazing treatment bit of help thousands of people with severe pain you're personalized pain treatment will be delivered directly to your door oh indeed topical toll free\nEight eight eight nine nine eight seven to two five eight eight eight nine nine eight seven two to five\nOr go to envy topical dot com and get started on your road to a pain free life called indie topical toll free\nEight eight eight nine nine eight seven to two five eight eight eight nine nine eight seven to two five eight eight eight nine nine eight seven two to five\nThat's the sound of a house being trashed one of the gang of Steve's ransacked\nAnd what they don't steal ... will be destroyed\nThe cheer resolve not to be the next victim of a break him go to the TV dot com and discover a device the greed the illusion someone inside is watching TV even when your miles away security is a mindset and ... should be part of your security solution be vigilant but not fearful on the TV dot com\nWhen you started talking about murder I realized I was getting involved and things I should what are you talking about [noise] honestly I can explain everything to you Mr Dolly O. J. [noise]\nThat's just what you're gonna do [noise] what will take his tail right here [noise] once in a [noise]\nTo die I Want you to know and pretty ashamed of what I was trying to do was wrong I should have realized sin less editorial more news huh\nI Know Tom chaser count James's he calls himself here in Barbados a couple\nOf days to come up all of days ago you mean in New York a long time ago don't your county noticed a dollar I liken chases girlfriend\nI'd never seen him before two days ago right here [noise] going\nTo do with [noise] then I found out you've been asking around town foreign [noise] so I decided on a class so I found you until I joined in which case why you thought I was this girl and so I went along with it I was supposed to have a date with him last night here at the trade winds but he didn't call it was too busy hitting me over the head of the time\nYou're telling me the truth county I Swear\nAnd there's one big question\nBecause I'm from cars to die\nI stand here and by ... and I want to go back to the state I thought he was going to put the finger on a runoff do to get back to the states and you don't have any idea where he has no none at all that's just fine my last laid out the window I'm Sorry your sorry did he mentioned his girlfriend too yeah [noise]\nIt said was expecting aspirin down here they probably had a break for her to meet him here later\nHe didn't give you any indication when he was staying on\nWhat his future plans were [noise]\nThat was one thing that was well I don't know if it means anything they want us when we were here at the trade winds night before last after which we walked around the water ... yeah\nKind of stopped and talked to one of the fisherman there\nCould you hear what they were saying no they left me and went off to why\nWasn't kind of do you think you'd recognize that Fisher no if you saw him again [noise]\nWe went outside with some of the fishermen\nWere scattered along the war spending that's getting their gear in shape [noise] we gave each one of them at once\nGrading [noise]\nGood evening good on sound very convinced tall surely too good evening so that would be a good night and then I can go to bed hey look I had a I like to ask you a couple of questions [noise]\nSure a mind staying awake a few minutes that um [noise]\nLast night that will cause night oh\nFishing really must be good around here it's not the fish and it was the passenger\nPassenger [noise] and don't give his name what's your take him\nI'll go say was that was three hours but both from here what's their last nothing [noise] smaller\nBond and ... old abandoned house nothing is noble did\nYou let him off there [noise] yeah but there should be comfortable [noise] it took much who do\nYou mean is there now and then [noise] [noise]\nYeah I Know ... and nobody could swim so\nI see [noise] okay\nThanks a lot [noise] pleasant dream [noise]\nAt this point it looks really [noise] and I began to wonder if it wasn't a little two weeks ago [noise]\nChase sitting there on law goes silent with no way to get off\nI had to do was higher myself a boat and go pick 'em up [noise] I look at the fish smile\nI look back at ... she smiled to everything could be on the up and up\n[noise] or it could be a great big trap [noise]\nI was going to have to go to law goes island to find out [noise]\nNo ears are starting to tell you about the next exciting episode of this story cutting the law goes easy getting away from it in one piece that's a different story\nYours truly Johnny Dollar [noise]\nTruly Johnny dollars starring Bob Bailey friends Dr Ali was written by Robert why it is produced and directed by jak John shorter joined us for the next big setting up into the story on yours truly Johnny Dollar ruins\nBecame [noise]\nUm\nFrom on twenty nine fifty\nSix years truly Johnny Dollar on classic radio theater\nThan nine part phantom chase matter would be the final set a quarter hour programs will be yours too bleak Johnny Dollar and the program would move back\nTo our weekly programs from the quarter hour night we chose the quarter hour nightly show's we're probably the best and yet still there were a lot of good years to lead Johnny Dollar straight ahead that would continue from Nineteen fifty six\nTo the conclusion in Nineteen sixty two\nYou can find more of our great programs by searching it uh I teach breaker any big pod cast aggregators church\nUsa classic radio theater and you can also find us on the ... radio at church usa classic radio theatre or at classic radio dot stream on the ... classic way too\nI'm Wyatt thanks for tuning in a fish radio station support the advertisers\nThere's always read the brake radio shows or\nBeat or you're on your station in the usa radio [noise]\nNever reach still final straw I don't use the west I don't use plastic Richard's point Raj how\nWe brew coffee for me here you know when we when we put it in the new one boy we shaped by Campbell\nControlling any crisis I'll do it ... days that\nNew innovation everything gets out as ... or a three minute without the use of\nTime is saying you're with my\nDog will laundered now here in rock spotlight Nineteen Seventy two he made the Rolling Stones when the recording in southern France and release the double album exile on main street\nCalifornia banned it to be rather score hit off their second album to the street with the single listen to the music\nAll for the summer of Seventy two Curtis Mayfield is back on the charts with the soundtrack for the film super applied the meals to top than his with bread he's dead and the title and\n... has ... album by single when the U.S any gay would hold your head up\nVery cheapest form of judicial taxi on the Tonight Show two nights and release to\nEnsure the new ... will get help and David all we can do to their album and write them\nWhich makes it number dreaming K. and in the top story in the state\nI think I heard radio from\nFrom Nineteen Seventy two\nThe Boston so do you have more conservative talk to your family you bought Ninety four or five and what did you manage to to talk twelve hundred and I heard radio station\nHurricanes in earthquake Simon and carriage Fox News extremely dangerous intel forecasters are describing hurricane Willa in the Eastern Pacific now almost a category ... storm on track to hit Mexico's west coast between mother in law and order by or to\nE as an opportunity now to move the world back from the abyss of destruction\nBy returning to his government's own words\nThat has had no need to station missiles outside its own territory and withdrawing these weapons from Cuba by refraining from any action which will widen or deep and the present crisis and then by participating in a surge peaceful permanent loop\nAnd I think a lot of us don't know how close we came to Armageddon back in Nineteen sixty two\nHitting the pop charts on this stage in Nineteen sixty six the beach boys good vibrations\nGood vibrations was just something that came up out of our conscious or group huh Brian's always been an ally a timely respect it's music is feeling\nThe vibration to become the beach boys served number one hit and sold almost a quarter million copies in the first week of bitterly ... needed to the cost of producing the single was between fifty in Seventy five thousand dollars\nThree hundred sixty five to five hundred and fifty thousand dollars in today's the money in Nineteen sixty eight Apollo seven safely splash down in the Atlantic ocean after orbiting the earth a hundred sixty three times in Nineteen Seventy three AFL CIO President George meaning called for the resignation of President Nixon's\nWe're I don't know that at all [noise]\n\nWe're on an airliner [laughter]\nThe nearly nine hundred that would get to the AFL CIO conviction ... harbor Florida called for the president to resign and to be impeached if he would not\nIn Nineteen Seventy six red dye number four banned by the USDA after it was discovered it caused tumors in Blatter's of dogs\nThe U.S federal labor relations board voted to certify the professional air traffic controllers organization on the estate in Nineteen eighty one strike the previous previous August in Nineteen eighty six doctors see Everett coop issue the surgeon general's report on a\nClearly this disease which drugs men and women children and adults people of all races must be stopped it is estimated that one and a half million people are now infected with the AIDS virus these people the majority of whom are well and have no symptoms of the disease can spread the virus to others\nThe report made it clear that HIV could not be spread casually and called for a nation my education campaign including early sex education in schools increased use of condoms and voluntary HIV testy\nAny people especially are you are not receiving information that is vital to their future health and wellbeing because of our reticence in dealing with the subjects of sex sexual practices and homosexuality this silence most in\nCoop one of the most visible of the surgeon general's ever in history a Nineteen eighty six President Reagan signed the tax reform act of Nineteen eighty six and the law and in two thousand one grand theft auto three was released ... genre of open all the action adventure video games\nAs last spring controversy around violence in video games\nPassing away on this dating history many AT T has to follow but it's all in the gang Tony yet birds\nSports caster Red Barber from Blazing Saddles cleave on little the movies I could not be made today or your member her best as a character on the ... theater a match and the Lucy show Mary wicks\nPassing away on this data Barry tell lady character actor or actress I should say\nFrom the star of old Marcel ... law Arthur Murray hill a soupy sales\nVery funny comedian actor but you may not know he was a DJ\nAt W. N. B. C. in New York City was ... days sandwiched between Don Imus and Howard Stern and don't you know that has to be a good bunch to be around I and asked Ron Paul white passing away on this date in history this is the birthday of composer Franz Liszt\nParker federally Titus moody ... how the Bob\nUh currently Howard of the Three Stooges Joan fun pain and writer professor Timothy Leary songwriter dory prepping Bobby solar who thought the law and the law one aunt Annette Funicello all born on this date in history\nHappy eightieth birthday to Christopher Lloyd [noise]\nBut I Need a nuclear reactions to generate the one point I Want you to go out\nFrom the original back to the future and of course he was on taxi the Reverend Jim Christopher Lloyd eighty years old today the co founders of Black Panther party Bobby feel is eighty two actor Tony Robert Seventy nine squeaky from limit from be paroled attempted assassination of President Gerald Ford Seventy\nJeff Goldblum sixty six by and boy tunnel fifty five Toby Mac fifty for John Wesley Harding fifty three from mister show Jay Johnston is fifty country music singer Shelby Lynne is fifty\nVery underrated pro wrestler demo Brown's forty eight from Modern Family Jesse Tyler ... forty three from Hansen Zachary Hansen is thirty three and for medium so the yeah\nThat's how he ... his twenty six I worked hard on that name though some of the people who are born on and the twenty second day of October ... birthday\nHigh for freshmen and we just want to say\n\nComing up in free minutes we'll go back Seventy two years Boston Blackie October twenty second Nineteen forty six you're listening to classic radio theater on your favorite station\nHi Wyatt Cox classic radio theater I told you about my pillow a lot but in case you been living under a rock here's one was a story\nMy pillow stays cool it keeps shape all night long\nNo more waking up in the middle of the night to flip over to the cool side was a pillow it maintains shape you can wash it you can dry added like new again it comes with a ten year warranty and I did come with a sixty money back guarantee but if you buy one through our special opera you have up until march first\nReturn your pillow if you're not absolutely in love with it and go to my pillow dot com click on the buy one get one free special ... usa\nYou'll get one free pillow when you buy one at regular price plus shipping or call one eight hundred nine to five one eight one Seventy five mentioned ... USA or go to my pillow dot com click on the buy one get one free special used promo code usa a guaranteed 'til march first where she's going to get that\nGot an old car you can donate is whether it's running or not to the United and breast cancer foundation and save on life\nThey'll even come and pick it up for free so United breast cancer foundation has saved hundreds of women's lives through their free or low cost to breast screening exams but now they need your help\nThe United breast cancer foundation wants to save more lives through early detection by offering women free or low cost breast screening exams and donating your old car SUV or truck whether it's running or not it helps pay for them plus you get a charitable tax deduction\nHealthy United breast cancer foundations save lives by donating your old car SUV or truck called out for free pick up eight hundred to ... to one for for\nEight hundred to eight oh two on for for eight hundred to eight oh two one for for the call right now that number again is eight hundred to a Twenty one forty four\nIf you enjoy our classic radio theater broadcast and want to start building a collection of your own go to classic radio dot street that's classic radio dot stream\nThere you'll find links to great classic radio collections on CD along with links to great reading on classic radio plus classical radio theater on demand kick out our Web page debatable now at classic radio dot stream that's classic radio dot stream and enjoy\nEveryone loves liberties so why are you letting other people tell you what's best for your health care exercise your freedom liberty how share liberty house share is a community of people volunteer at least share one another's medical cause members are able to take back\nTheir own decisions about their health care stopped letting others do you want to do commerce that eight five five fifty eight liberty for more information or track us out online at liberty house shared dot org batch liberty house shared dot O. R. G.\nClassic radio theater on your feet\nShe rebounded doctor about it right here on earth and good luck Dr well beyond rated\n[noise] now a year in rocks spotlight from the heat Seventy seven\nSeventy seven American duo steely Dan release their album Asia it goes number three in the states stranger to top twenty bag and the blues\nIn October the major leagues eating out and buy meat loaf is released its number for seeming us and goes on to be one of the bestselling albums of all time [noise]\n\n\nWinters generally the survivor three days later sitting around even with a band members were killed in a plane crash goes number five in the states and saying what's your name\nThe November Eric Clapton slow hand is released it goes to the number two driven by three hits singles cocaine wonderful tonight and lay down Sally\nKnow\nKeep listening to her radio for more from Nineteen Seventy seven coming up\nToday my new dad threw a barbecue today my new Sunday night through a barbecue there were burgers and chicken I burn everything the burgers\nTo chicken salad\nThey were ... they were awful and then\nAnd then we had watermelon [laughter]\nNo I'm allergic to watermelon and then we play catch\nI broke Mr Lewis this window [noise] but this way comes when don't miss this way comes when ... [noise]\nThen somehow my hand\nAnd then my dad even let me driving car\nThere was a rough day it was a great day\nYou don't have to be perfect to be a perfect parents thousands of kids in foster care will take you just as you are for more information on how you can adopt visit adopt us kids dot org a public service announcement from the U.S department of health and Human Services adopt us kids and the guy at the council\nOkay time what are you wearing right now ... that's right I Want to people normally where\nExactly then I'm going to try to do with ... cricket is one they look good and if we go out without them neighbors will talk so it's important to know how to get dressed here's how it's done and we're always comes first name talk of the ... century get the first button in the right hole you have to start on that right if\nYou're anti goes over round round through and pull type type of certain to your path that I prefer soccer on first then she was right on right left on that which you license is taking a cross of member switched to live the rest of the town hall tightening lots of money or I don't know it's good to know never never ... whereabouts and\nMy you're panting her head\nPlus parenting is hard to do and just two minutes\nSpending just two minutes twice a day and making sure they brush their teeth is easier\nCould help save them from a lifetime to pay\nFor fun two minute video to watch while brushing visit to men to X. dot org that's two men two X. dot org message from the partnership for healthy miles copy lies in the castle\n... radio you want to hear\nUsed the thumb up and down by to let our programmers know how to make I already found our back on\nTalk people are talking about calorie she's like my daughter in Katy Perry world\nLike Boston conservative Braun\nTalks will hundred\nClassic radio theater on your favorite stay home and listening to an episode of Boston Blackie starring Gary Coleman\nAs was originally broadcast Tuesday October twenty second Nineteen forty six in the newspapers up that Tuesday Seventy two years ago they used or some of the headlines\nSomething to strike of airline pilots and new demand by John Lewis which could shut down south coal mines again in thirty days confined to the nation last night the walkout a fourteen hundred AFL pilots are trained for their lines resulted in cancellation of all the W. H. lights in the U.S and oversees\nThe surprise walk out which grew out of a lengthy dispute over wages\nBut some three thousand passengers federal ... when the strike went into effect at four sixty nine yesterday morning meanwhile a nice try possibly developed in Washington\nWhen Louis Keith for the AFL United mine workers demanded new contract range which on wages hours in love with the man's\nUnder procedures like George which could shut down the coal mines November twenty Lewis requested the conference with secretary of injury of crude friday to reopen the miners contract with the government [noise]\nDateline Washington Russia's sharply breakfast yesterday in American Plan for allied act nobody's sure free elections in Bulgaria\nDeclaring the plan would constitute interference in Bulgarian affairs the state department obviously high rate made up like an exchange of messages on the development and sharp notice if we keep a sharp eye on the company [noise]\nDateline New York international news services ... died before representatives of more than a billion of this earth people converged on this capital world policy yesterday\nIn preparation for the opening when the state of the first section of the UN's assembly and held in America their aim is making of a ... piece\nIn dress the range from foreign minister mall solved lumpy business suits radiant folds of the ... delegations down the emissary first is headed to the task of located themselves in the city's crowded hotel\nConsulates clubs and private oh\nBut that software on Wednesdays beginning of a six week meeting during which they hope to heal the coin breach in bed for relations ratified peace treaties with belligerence\nAgree on the methods of governing last kept your son the axis attempt to read the earth do they want it to a new un are are a admit three new nations to the president family you're fifty one and it seemed to fifty other items on the historic agenda [noise]\nDateline Chicago the heaviest volume of livestock in three years yeah markets Sanders yesterday and to market for for for the bar go further shipments into congestion usually a railroad car shortage hampered some markets as farmers rush their animals to stockyards to obtain a high prices\nDespite the avalanche prices generally add to fire an indication that supply lines to consumers are far from filled and demand still exceeds just supply [noise]\nDateline San Francisco a smile was indicated just the best antidote for stomach ulcers Dr European ... psychiatrist at the University of California in medical school was authority but the conclusion that people would watch personalities\nAre common among the victims of stomach ulcers Dr ... basis conclusion on a survey of patients\nAt the university's Langley Porter clinic in San Francisco\nTo psychiatry explain to people whose inadequate personalities leaves them and able to deal with costs\nLike situations to become educated a condition for ... [noise]\nSo some of the day is top news stories as report in the newspapers up Tuesday October twenty second Nineteen forty six on your radio sixty Seventy two years ago today Boston Blackie which continues now on classic radio theater\nI'm sure when the wrong neighborhood rocky I thought this was fair side of the time\nYeah but said and done a mind like on the other yeah as long as I don't try to cut in line and why over here those around all day and that in\nTo see you you mean the great rocky Baldwin tied with fairs the city's number one rock of table stoop solo to come to see me but I'm Still mostly in his face in line so I didn't miss this I've got Iranians are wanting to see you again they usually one I suppose\nYou want to try to scare me into doing something for a while I don't scare I got beaten up a little while ago because I don't ...\n[laughter] you got me wrong and it goes I Want to help you I Know last Saturday as 'cause I Know get mountain pro fat\nAnd want to know [noise] you know ...\nAnd his hide out a lame street\nUh-huh very interesting except for one thing I don't believe it why not because why should you across there and help Faraday\nOh that's ... I don't like cops clause that fat is only one cup among many let's say he's a one man who stands on their way of controlling this whole um understand ...\nWhen you put it that way here for so I didn't understand\nOr you know for a black but that are out and get your friends that are that are for say a finished as within and sad you know works fast\n[noise]\nOctober twenty second Nineteen forty six Boston Blackie the conclusion in three minutes on this Monday edition of classic radio theater\nThis is a national health alert from the healthcare hard line\nAre you on Medicare and we're in a private insurance and suffer for back pain envy topical has a solution for you\nToday you can qualified to receive a paint believing treatment which is a comfortable back race were customize ... but a little or no cost", "year": "2018", "show_name": "Classic Radio Theater", "city": "Newton", "day": "22"}