{"month": "10", "state": "TN", "station": "WWTN", "content": "... N. A. R. K. E. T. to seven nine six four or five\nStar cheer on line NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line checks to market to seven nine six four or five\nThat's an A R K e T to seven nine six for fun\nFor ... and everything in what you really care how much more\nFedEx delivery game day their return that her by delivering\nHey this is Iraq wasn't a matter of on them to tell you about my pot Rashid impress each week I'm joined by special that some of\n... stop by pop football and get you inside scoop on the biggest story and maybe even a little bit about that if you have a tag in your closet that says structure that things got [laughter]\n... feet in France they held on apple pies yes for your favorites I kept that from the Westwood One podcast network\nFollowing is not an actor that are real life story from trinity debt management\nMy story began with that a lot of debt credit card debt and I heard a commercial for eternity I gave them a call\nIf you're in debt and you need help coal trinity one eight hundred seven for one eight to ...\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the numbers and I saw how quickly that astronomical that that was in my life would go way\nCommunity will consolidate your accounts into one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands what I Would\nTell people please pick up the phone and call trinity just let them put together a program and see how affordable and easier to to pay off your debt\nCalled trinity a one eight hundred seven for one eight to ... that's one eight hundred seven for one eighty two oh five\nOr life with Dr ... [noise]\nI Love Indian food in turmeric is one of my favorites by\nDr Sanjay Gupta scene in chief medical correspondent turmeric has a bright yellow spice that you can find that a lot of curry powder and mustard I grew up with it living in an Indian household\nNot only does it taste great I think what it's been studied for years and found to help with the wide range\nOf medical ailments according to the age there are more than Fifteen thousand manuscripts than termer dozens more getting published every week\nAnd there's good evidence that term or can help control meetings um arthritis as well as a decrease the likelihood of a heart attack\nAfter bypass surgery\nI reveal the medicine\nThey also use turmeric to help treat breathing problems information to teach him maybe something that helps prevent certain kinds of cancers even want to be clear you can't cure cancer or infertility we're all time is on Dr Sanjay Gupta\nHelping you live a better line\nSaid hey make sure you know what's going on and talk about it\nI Believe that I didn't even you know ... to have a duty ... and\nJohn welcome to the bill Cunningham show John please go ahead\nKelly I'm a graduate of the nation wow what happened at Purdue I have no idea really two questions first if we can identify anybody coming across the borders of gang member why are we sending them to go on\nAnd um obey because what they say is I'm a refugee and I want to hear in the ... federal law that was okay and and then we have made a\n... member ... why can't we send them\nBecause because we they have civil rights under the federal statutes to a dab of hearing is that we can't do it without a hearing we get rain sandbag Central Americans we can't\nKnow Billie it why can't we fed and have our induction or whatever I better like we have along the border at age ... Alaska well set up camp up there weaken private people up they're\nNot all we can't because there's too many my friend John we do not have the space we're not scaled don't have enough hearing officers that camp so not big enough\nWe're talking about this year so far one hundred and Seventy five thousand kind of under the radar we're talking about tens of thousands more coming at one time were not scaled to do it doesn't work that way\nNo federal law odd to say that upon arrival from Central America or any other place you're sent back to your country of origin immediately that's not federal all federal law says Mexicans yes other countries you know\nSo if you're from El Salvador Nicaragua Guatemala or Honduras or Venezuela and you show up on the southern border instead of ... and running away from the cops border patrol\nThese individuals run toward the police and say in English\nI demand refugee status I demand herring then add three processed it takes to lots of time to process that person then give them a hearing and ... months from now that never transpires were not scaled to do it Guantanamo is too small\nMilitary bases are too small\nOr talking about tens of thousands a month coming into America we don't have the money it doesn't work what needs to happen is the federal law needs to be changed with the cooperation of the Democratic party that says when you arrived here illegally you're mainly sent back to your country of origin without a hearing\nThat's it no due process because you're not an American the Democrats\nTend Democrats in the Senate will not allow that to happen they will not allow that change Trump wanted to get the so called dreamers might be twenty million dreamers don't know how many citizenship on the path to in exchange for a border wall to stop it but it can put a cork in a bottle but Democrats wouldn't agree\nDemocrats right now we're not agree\nThey'd rather destroy the country and get political power and they keep the country the way it is in Cape out\nI tend to rent migrants from the most violent places on earth continually their calls coming up in about thirty five minutes I'm going to put a called into Corey Lewandowski the legendary campaign manager of Donald Trump's been Eighteen months is his campaign manager and then later\nOn also Kevin ... of the blacks fear about the impact in the black community of tens of thousands perhaps millions some\nMigrants coming into America from Central America the most violent place on earth is continuing your calls one eight six six six or seven seven three three ... still counting and the great American live with you every Sunday [noise]\n\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to ... and you're even getting up at night to go this is not okay listen\nThe makers of super beta prostate the number one prostate formula or introducing a new one pill super beta prostate\nPiece three advanced with three key ingredients that are great for your prostate reflect picking treat prostate supplements and want to celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supply is free\nPay shipping and handling call one eight hundred three eight eight three eight one six\nEarly research suggests that an ingredient in P. three advanced may help support an normal prostate sauce combine that with a reduction in or just a pie and you have a formula you'd be crazy not to try get pi three advanced free\nCall one eight hundred three eight eight three eight one six one eight hundred three eight eight three eight one six one eight hundred three eight eight three eight ones that\nAre veterans were there for you everyday to ensure our way of life [noise] let them know you can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundred anniversary of Veterans Day help no that alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much ... V. E. T. to eight eight eight eight\n[noise] some knowledge belongs to act and that's the loans to react girlfriends long\nTom can he can only can no amount hurt or [noise]\nThe ones that carry with them every game [noise]\nBond with this girl lying and knowing a breath and said no your girls or for the ... on ... counts rocky says he called me and the ad council\nAnderson veil Nashville\nSee we were talking about I mean I [noise]\nThe Saudis changed their story the midterms mass and Michael I'm Evan Handler they're growing\nBipartisan calls the whole Saudi Arabia to account for the death of journalist ... from Riyadh correspondence Sam ... reports how the kingdom story has changed\nBack in early October soon optimistic ... she disappeared when he went into the Turkish considered to Saudi Arabia the crown prince himself Mohammed bin Salman in states that he had left that patients safe and sound and then he simply dissipated as far as the Saudis were concerned now we have\nThe Saudi foreign minister saying not only that he was murdered but that he died at the hands of Saudis and this was a mistake\nThinking let's go continue in California Perry in California Perry go ahead\nAnd build love your show every Sunday night thing I'm an ethical your producers if if you guys ever do podcasts for your regular show during the week okay anyway um yeah my comment is that I think\nThere is something beyond that the a deeper steak beyond a shadow government probably the dark I don't know what it is one world government is at the door to burgers or the child or or whoever\nYou know on that point in about an hour and twenty minutes I'm gonna call Peter Wallison he's written a book about the bureaucracy the so called\nState how that continues it continues today three thousand new rules and regulations a year hundreds every month it never stops is going on right now Trump's trying to stop but he's going to make that he made the point in his book that I read\nThat that it cannot be stopped that there's a deep state in Washington that will continue even assuming Trump is there for eight years it will not be stopped that's his point\nHe might Iran agree\nBut I Would agree with that completely and I I Want to tell you you know the ... the clip protested against a governor governor I mean judge Kavanaugh right they were led by the Democratic party for a specific reason they don't want constitutional judges on the Supreme\nCourt will know that they\n... they don't want a super legislature they they won judges\nTo impose rules and regulations on us that cannot be passed through the Democratic process and so they've done that the last thirty or forty years and when you got course itching Kevin all who ... oh I Hope become constitutional judges they're going to say wait a minute if you want to convince your fellow citizens have abortion or gay marriage or something else\nGo convince them in the legislature passed a law it's OK don't come to us to service the second legislature\nAnd I hope that that Kevin ... Roberts and Alito and and not Thomas I I Hope that's what that's what they do in the future is don't come to us to impose new rules and the American people go to the legislature go to the Congress go to the states go to the cities go to the county that's where it belongs\n[laughter] you know the Democratic party bill ... on the socialist in a ...\nA shore experiment and he did over your mind state of California\nYeah how's how's Venezuela looking\nOh my God yeah you know it it yeah on the same [laughter] but we have a a man who will probably be governor and lieutenant governor\nOf data California New under Jerry Brown yeah which is\nA given 'em or do you have a new cabinet rank your bill\nFor him and I gather news than it used to be married to Kimberly ...\nOh friend of mine today\nI'll really know interesting yeah well this man is fairly lacking and character\nBecause he was going to win and ... isn't it going to win nonetheless\nYeah again John ... who were on going to vote for the work for the Republican running but you don't want this man is so far left the banks Jerry Brown look we're growing a Ronald Reagan and all he\nWants to open borders he wants to pay for health care housing automobile any things that illegal immigrants want in this state is broke\nAnd now we got proposition ... the Democrats are fighting withdrawal repealed the gasoline tax which is about what ten percent and\nThe doubling of the registry your feet here of a vehicle or can you not when I'm cooking\nWell I I don't understand you you go forward ten or Twenty years give millions of illegals free medical care free public education free lawyer free Dennis free doctor's free veterinarian services and free car now how does California survive it'd be it becomes Venezuela done it\nIn the dark because we're we're broke and I don't know why\nWe're broke because I mean there there is no real reason for it\nAnd talking about middle test job destruction talk about the the pollution controls talked about the lack of job creation talk about in Los Angeles county schools there's fifty seven languages and dialects being spoken inside the public schools every day which means no one's getting educated in anything\nThat's right that's right it is a it doesn't make any money [laughter] you know what the Democrats you but I like I said it really does come down to that they want and open border of socialist states here and I I I'm Sorry I just\nWell you know I like to know where his socialism worked\nDid it work in Cuba Venezuela where does socialism work even read Chinese communism turning away from social as it doesn't work it doesn't work in Central America\nDoesn't work in South America Brazil and Argentina and dig deep trouble that Israel is already there and so I can see the day in the future when we do have a hundred and Seventy five thousand so far this year I can see the day we have one or two million or three million\nWe have a two hundred and fifty million who live in South and Central America Mexico given their druthers would move to America two hundred and fifty million were and how are they going to go how does that work anywhere in the real world\nContinue their causes go to Cheryl in ah New Jersey\nSurely New Jersey welcome to the bill Cunningham show Cheryl go ahead\nAnd said men only Hungary all bad home got re elected in the Arab George\nSoros with oil and vive wrapped in tune with all of these immigrants\nStorming ... Hungary down on whom right\nThere in a row so I'd rather have had the universe sitting there and uh in Hungary Budapest, Hungary and pick the on band said we're going to attack all in the courtroom that they're giving at twenty five cent\nKicked out or a or a black on the on ban says no gender starting that college says that\nUm we got to raise the tantalizing right we don't want them going calming when you want more Hungarian [laughter]\nSure I Love eastern Europeans gum and I'll say this I Want every legal immigrants coming to America because they are tested\nThe our research we know who they are and they tend to do a pledge allegiance to our country I Want every illegal immigrants who said to hell where they are and I want a government that enforces the law\nAnd God Bless America that we got the trumps during the White House imagine of Hillary was there right now which you would be doing let's continue now we have two lines open if\nYou call now eight six six six or seven seven three three seven eight six six six four seven seven three three seven as we continue a cause the Missouri tendency Connecticut in Las Vegas\nEighteen minutes after they are built counting on the great American why with you every Sunday night\n[noise]\nDiscussed daily life in local all day long super talk Ninety nine seven W yes [noise]\nAre you considering a safe for gun safe to secure your valuables and firearms if so before you spend any money on any typical run on a male safe check\nOut the amazing handcrafted rhino iron works safes had rhino safe dotcom see for yourself why rhino safe customers are so passionate about their antique industrial style safes and if you're a gun owner you'll love the convenience of those swing I've done rack\nRhino has a huge dealer network great pricing warranty in customer service so go to rhino safe dot com today that's rhino safe dot com\nThe seven Daniel fall flooring yard sales going on now with incredible deals and lumber liquidators we've got hundreds of floors on sale up to fifty percent off in stock and ready to go see big on waterproof floors all on sale from just thirty nine cents kid would look limited flooring all on sale up to forty percent off\nRefinished hardwood and bamboo starting in Ninety nine cents plus special\nFinancing south by your local lumber liquidators store or visit lumber liquidators dot com today\nMessaging database may apply burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut wonder if there were a business degree to further your career and give you access to world renowned faculty\nLeaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur in Salt leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six\nFive star to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the w._b. carry business graduate programs on line checks market to seven nine six four or five\nThat's and they are ... tea to seven nine six foot\nHey this is what the minimum that you didn't tell you about my pot that she didn't\nEach week I'm doing my ...\nMy ... stop by hustled off and get you inside scoop I mean we think it still is and maybe even a little bit about that if you have a tag in your closet that says structure that things got [laughter]\nThose who have served our country\nPlease show your support and text V. E. T. to heat heat the heat and give back a little to those who give us so much ... V. E. T. to eat whole heat heat it\nWith you a Mayo Clinic radio\n... minutes I'm Vivian Williams pancreatic cancer is relatively rare\nIt's seldom detected in its early stages and often deadly\nBut new thoughts on treatment strategies are getting more patients help this cancer needs more than a nice surgeon Dr ... says there are really three pronged to treatment surgery chemotherapy and radiation all three have seen major advances in the past few years but the key\nIs how do we take what we have and apply it in the right to sequence to get the outcome we're looking for\nIt used to be that surgery for the few who qualified with these followed by chemo and radiation the doctor Trudy has flip that script chemo and radiation come first\nBecause of all the therapies they'd gotten ahead of time these patients now we can offer them much more complicated operations\nEven patients whose cancer would traditionally had been considered inoperable for more information talk with your health care provider or visit Mayo Clinic dot org\nPurview into deep you want to teach you wanted to and wipe you want to be OK people into the TNC two fifty a sea to fifty easy to fifty cue not available in all states Yorker Colorado call for a similar offer\nThat's the scary thing about going to the dentist\nOpening your mouth or opening your wallet\nBecause just a simple cleaning can cost a hundred and fifty dollars\nI think like root canals can cost you hundreds more\nIf you don't have dental insurance to help compositions mutual insurance company\nEight nine three zero three two two\nThis isn't a discount plant or preventive only coverage this is real dental insurance that help pay for checkups right away so you can call today and get your teeth cleaned tomorrow plus it helps cover the more extensive procedures you might need down the road feelings crowns bridges even ... dentures there's no deductible and no and you will maximum\nYou're acceptance is guaranteed for one of these insurance policies\nCalling now for free information kit with all the details one eight hundred\nEight nine three zero three two two\nEight nine three zero three two to\nEight nine three zero three to two\n... two thousand sixteen the world changed run like a girl out that you think a lot of people are pretty sick of ask well\nIt's so much more than a way it's supposed to nominate change headed our way on November ...\nWe can't take anything for granted a lot of stuff off that I have to have\nRun like a girl podcasts sisterhood as powerful subscribing now wherever you listen to your favorite part test run like a girl from Westwood One\nAllison is perfect I mean she never tell you that she's perfect we are you going to try to get training makes people\nStopped text outbreak started work brought you in the national Highway Traffic Safety Administration and the ad council\nAllison is perfect I mean she never tell you that she's perfect we are you trying to get training makes people\nStopped text outbreaks artwork brought you in the national Highway Traffic Safety Administration in the ad council\nBecause what happens in DC affects us right here in music city super talk Ninety nine seven WPN news weather traffic ... welcome again to the bill cutting Hampshire Corey how are you I'm doing great how are you today\nDoing well you know about a week ago I spent some time with the president privately it was wonderful\nYou spent like hundreds or thousands of hours with the guy and I sit on the air the other day that uh maybe there's a differential between what I see in the media sometimes with the president and how he truly is before we get on to so many issues going on especially the mobs versus jobs and all that kind of stuff\nYou know give the American people a measure of the man himself\nWell you know I spent so much time with a then candidate Trump but now President Trump and a truly cares about other people he's extremely\nMagnanimous and private he is funny he's gracious he's always asking about how my family is doing and what he can do to help me that just who he is and if you listen to the media you know they tell you have the worst\nHuman being on the planet but the truth is\nHe's exceptionally gracious I've seen so many times helping people that never get the story told because he doesn't want the story told but he's always there to help whenever again\nWhy is that because the media ought to be calling balls and strikes you know they ought to be saying well this is what's going right this is what's going wrong media ... Research Center ...\nWell ... ... one of my buddies every few months as the media coverage is Ninety two percent negative Ninety five percent negative\nThe media is protected by the U.S constitution only business in America that gets constitutional protection and the media should call balls and strikes a lot of good stuff a lot of bad stuff why does the media only report the bad enough the good\nWhat are they only report the bad and the ministry of the Obama administration you would think that our economy is growing at four percent and we had more Americans working than any other time in our nation's history it conflated those to see the Trump agenda is not what the mainstream media wants to talk about\nI here's a great example just last week I think it was a President Trump did an interview with widely stove or sixty minutes interrupted him the five times during that interview to put that in comparison\nWhen the minister in an interview with a bomb or a couple of years ago they interrupted him more times have their own agenda their agenda is to make the president look bad not to give him credit\nThat he deserves for the successes that he can because they're no longer in the business reporting the news now in the business of making the news and the big change over the last two decades\nLewandowski the president or the other night in Montana framed it as mobs versus job the only difference is the Edmond J and I think that's brilliant on his part because one look at Brett Kavanaugh all along about a trucks that have a Trump sticker on getting burned I look at Congress makes\nIn shock I look at a Republican congressman Republican operatives getting beat up and getting stuck into side with pen\nHuh I look at how you're confronted in airports and restaurant mobs versus jobs and do you think the average American I think forty percent of what the president forty percent oppose them there's twenty percent going back and forth do you think that the moniker of the president mobs versus jobs is going to stick\n... I think it will stick because what the American people see and hear what people like Eric Holder had to say very recently when they're down and we kick them and we kicked in the head [noise] you know the the calls to violence by the leaders of the Democratic party whether it's\nA Maxine Waters or other is saying if you see them in a gas station if you see them in a restaurant you go after them you don't give them a break\nYou know back and not the way our country is supposed to be\nAnd I didn't support proper Obama but never ever ever did I ever remember\nRepublicans or conservatives for that matter going after members of the previous administration when they're eating dinner at a restaurant we've now seen it with Sarah Huckabee Sanders sleeping with secretary Nielsen of da chess we've seen with Senator Ted Cruz we've\nSeen what happened to Congressman Steve ... where he almost lost his life because the mob violence antifa is so out of control their goal on their desire is destruction it's not to make our country better this president has created I think\nOver for a million new jobs in the last Twenty one months and that's where we should be doing look even if you don't want this president if he didn't want him to succeed\nYou want him to succeed because you want our country to succeed and that's what the differences that Democrats I hate to say this and they hate this president more than they love their country\nWhile the other issue the culturally acceptable didn't mean to fame and to make fun of and dismay or the president and the first lady you may recall about a week ago TI who's a rapper that I Will watch nonetheless I sold them TMZ\nAnd I did a video in which a look alike millennia Trump was stripping nude in the oval office performing sex act in the oval office and it was culturally acceptable to do that I'm sure you might sell a lot of\nLot of his songs and records from that can you imagine three years ago if a country artist had to pick the Michelle Obama stripping naked in the oval office and performing sex act in the oval office what would the outcry from the media have been if it was Michelle Obama\nIt would be front page news for a week on and that wrap that the the country artist would have had his life probably threatened on multiple occasions but look let's go back to each other again about a week ago Hillary Clinton gave an interview about her husband and his\nRelationship with Monica Lewinsky and they asked her I mean do you think that relationship was inappropriate\nAnd less than two weeks ago her answer was no it was appropriate because she was an adult [noise]\nEven if the president of the United states the leader of the free world Monica Lewinsky was an intern and Hillary Clinton is still justifying her husband's behavior can you imagine for one second that was the the converse Donald Trump had done that with during the media would be saying oh\nYeah they would give them an excuse right away and I'm sure the media would say well she's an adult no big\nDeal I mean the double standards amazing\nIt has always been that way but the American people have seen through it and as you've referenced as it relates to Brett bows out Ninety two percent of the media coverage of this president\nNegative now I Would accept that if we were in the middle of twenty five percent unemployment a national crisis all over the place nobody working and the country would ruin the wrong direction growing at point zero zero percent\nGod Bless America Corey Lewandowski Trump campaign manager thanks for coming on the bill Cunningham showing my friend will do it again\nThank you have a great day God Bless America must continue with more built counting the great American live with you every Sunday night [noise] Nashville's\nLargest radio news room and he's right here we're talking ... you [noise]\nHave\nYou tried that trendy need eating out you can have my siblings fine with people who just love to play the game you're ready for something more grown up trying to match over thirty thousand new people a day are heading to match\nFor grown up conversations that lead to a great game and beyond our listeners to go to match dot com can start for free today you sign up and informative profiles to get a deeper sense of the people you'd like to me start for free today at match dot com match dot com\nSeven Daniel full floor and yard sales going on now with incredible deals and lumber liquidators we've got hundreds of floors on sale up to fifty\nPercent off in stock and ready to go see big on waterproof floors all on sale from just thirty nine cents skin would look laminate flooring all on sale up to forty percent off\nRefinished hardwood in bamboo starting in Ninety nine cents plus special financing stop by your local lumber liquidators store or visit lumber liquidators dot com today\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to the your even getting up at night to go this is not okay listen\nThe makers of super beta prostate the number one prostate formula are introducing a new one pill super beta prostate piece three advanced with three key ingredients that are great for your prostate it's like taking free passage supplements and want\nTo celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supplies free\nShipping and handling just dial pound or two fifty on your mobile phone and say the key word empty early research suggests that an ingredient in ... three advanced may help support a normal prostate sauce combine that\nWith reduction or just a pie and you have a formula you'd be crazy not to try Dr ... free dial pound to fifty on your mobile phone and say the key word\nEmpty again dial pound to five zero you see the key word empty\nEach day researchers make discoveries that brings us closer to the moment when all cancer patients can become survivors [noise] their progress is made possible with the help of clinical trial\nClinical trials and the brightest horse researchers happened like there and wait for the better treatment\nAnd if you've been diagnosed with cancer they may be brightest rain\nSpeak with your doctor in the canopy cancer dot org slash clinical trial to learn more together we can stand up for on\nThe phone is not an actor that are real life story from community to manage\nMy story began with that a lot of debt credit card debt and I hurt a commercial for eternity I gave them a\nCall if you're in depth and you need help home trinity one eight hundred seven for one eight to five\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the numbers\nI saw how quickly that astronomical debt that was in my life would go away\nCommunity will consolidate your accounts into one easy to manage monthly payment reduce your interest and possibly improve your credit score you'll save thousands what I Would\nTell other people please pick up the phone and call trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity one eight hundred seven for one eight to ... that's one eight hundred seven for one eighty two oh five\nAre veterans were there for you everyday to ensure our way of life [noise] let them know you can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundred anniversary of Veterans Day help no vet alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much ... V. E. T. to eight whole eight eight eight\nRun like a girl is a nonpartisan ... it's a documentary on the unprecedented number of women running for office in twenty Eighteen mid term elections\nTend to hear what it's like to run like a girl in today's heated political climate last year we marched this year we run\nAround like a girl from Westwood One mind on apple pie cat built upon half or wherever you listen to your ... cat\nFor if you want to keep you went to a TGI he wants to be and why you went to the Cape you went to the TNC two fifty a C do fifty easy to fifty cue not available and all states Yorker Colorado call for a similar offer\nWell that's the scary thing about going to the dentist\nOpening your mouth or opening your wallet\nBecause just a simple cleaning can cost a hundred fifty dollars\nI think like root canals can cost you hundreds more\nIf you don't have dental insurance to help compositions mutual insurance company\nEight hundred eight nine three zero three two two\nThis isn't a discount plant or preventive only coverage this is real dental insurance that help pay for checkups right away so you can call today and get your teeth cleaned tomorrow plus it helps cover the more extensive procedures you might need down the road feelings grounds bridges even costly dentures there's no deductible and no and you will maximum\nYou're acceptance is guaranteed for one of these insurance policies\nNow for a free information with all the details one eight hundred\nEight nine three zero three two two\nThat's one eight hundred eight nine three zero three two to\nEight nine three zero three two two\nOr something I'm always ... I Hope that there is an ... an you a Trump campaign when he was in charge I tell you what things are going\nVery well things are going to go well believe it or not put me in that camp who believes the twenty Eighteen and twenty twenty it's got to be very close to twenty sixteen that is\nI Believe the Republicans will keep the house by slim margin\nAnd pick up seats in the Senate maybe four or five seats and mix tallies doing a fabulous job in Arizona and I'm looking forward to a some sort of a from the grave endorsement\nBy Senator John McCain of mix Sally who's an American a pilot hero flyer who was the defending the nation while her opponent was basically burning the American flag in Arizona and calling those who live in Arizona part of a meth lab\nSo uh when I look at what's happening around the country especially in Nevada and uh\n... what's going on in Florida I have great hope that when it's all said and done much like in twenty sixteen the Republicans in twenty eight you know going to shock the world and pick up ... seats in and you also keep\nThe house say tuned coming up next from live from St Louis Missouri will be Kevin Jackson the blacks fear who ah was banned from Fox News about three or four weeks ago we're going to talk about what he said that got um banned and more of a long becomes available eight six six six or seven seven three three some still counting undergrad American ally with you every since you know [noise]\n\nMessaging to raise map lights burning your degree from one of the top business schools in the country might sound impossible to fit into your workload but what if there were a business degree that\nFurther your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur in thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\nThat's an A. R. K. E. T. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line checks to market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six for\nA better life what Dr ... [noise]\nI Can't even believe this is the thing\nNow it's got an e Snapchat just\nMorphine I'm Dr Sanjay Gupta CNN steep medical correspondent I Can't tell you the last time I saw one of my daughters text message their friends they communicate on Snapchat an instant around and they take tons of pictures a lot of time with filters some filters are fun\nThey can make you look like an animal or alien where they can make it so that you can't see your face at all\nBut others can be dangerous and how they distort reality of what your face really looks like\nThat's according to researchers at Boston University school of medicine they say social media apps allow people to alter their appearance in an instant\nAnd conform to an unrealistic often on attainable standard a beauty\nYou want to know how you really look up in the mirror don't look at your phone and definitely don't scrutinize your faith based on a self\nSpecialist in\nHenderson bail Nashville\nSee we were talking about I mean I [noise]\nThe Saudis viewers explanation migrants on the move primary hand Saudi Arabia's foreign minister now admits Washington Post journalist ... she was killed at the Saudi consulate in Istanbul\nMan as yours and out\nOf our cat on I Would have been negotiated a lawsuit against everybody in the food chain including all the congressional gangs that went after him including Chuck Schumer and for the record\nThat's good for me and not just a a girl it's a guy to and Chuck Schumer is the ... because he's a guy who was complicit in this uh later\nAh from New York there are all people they just want to watch somebody be destroyed over a thick ideology known as left isn't\nAnd I think it's pathetic and the far reaching ramifications impact the guys like Bill Cosby\nWho sits in prison at the age of Eighteen years old and American icon\nSits in prison in his eighties over allegations that date back for five decades meanwhile a guy who vowed then I mean you know denial sex abuser Bill Clinton runs around here campaigning\nI tell you it was amazing and I you you had a situation where he actually raped a woman who told us that one either Broderick\nWhen Clinton raped her with a bloody lab told her a roommate what happened the roommate solved the blood on her lap saw her pantyhose was torn\nShe actually had four or five corroborating witnesses as the event took place and then they also had the so called uh Arkansas state troopers confirming the fact that the Juanita ... was actually raped and then you have while he's in the White House is president sexually groping and molesting Kathleen Willie in the White House\nAnd that was well known and corroborated but the media completely ignored both of those events because it didn't fit did it but it did go to go to Brett Kavanaugh\nAbsolutely and and so that's that's the double standard and then the bigger double than it has to do more with men ... me too movement and trying to to learn how the left tries to migrate thing how they try to get us to take ownership so the ownership of me too is a bunch of left us led truth Hollywood lefty\nOkay it's Harvey Weinstein's of the world with all these young on the news and these\nOld school actresses and all these ... political\nFeminists taking pictures of Harvey going to his party's expelling virtue that awards dinners and so on while enabling him to do exactly what he's been doing for women for a decade\nDating back decades and and all the trail of women\nWho did exactly what Harvey ask them to do getting their butts ...\nOut and then suddenly when their careers are waning they decide they want to turn states' evidence but what's interesting to me to a ends up\nBeing a bill ends up being part of a\nWoman being used against Kavanaugh being used against ah the high powered CEOs of companies this movement is born of the lecturers activities of left us in Hollywood\nThat and and and the entertainment industry where they marginalized objectify women like crazy and suddenly a guy like Kavanaugh they want to make him the poster child I mean it just it bores me\nAnd when it came time for Obama to put his daughters on summer in terms of physicians would somebody\nA Brock Hussein Obama and Michelle Obama selected Harvey Weinstein\nTo to take their daughters ended the Hollywood scene when they knew or should have known exactly what was going on from all of their connections but they couldn't care less Harvey Weinstein was a star Harvey Weinstein had access Harvey Weinstein was are making millions of dollars and giving millions of Democratic Party including the Obamas\nSo they set their own daughters end of the character has been in control of Harvey Weinstein and the media didn't cover that either did they\nKnow they didn't but here's what's interesting about that so they know Harvey their daughters are untouchable but you know whose daughter's aren't bill the daughters of ordinary people there the daughter that you don't that you got to be concerned about cars Harvey will take advantage of them but the ... the what the what Rocco bombing selling us\nI have so much power I Know that this guy the lecture is left is who will take advantage of women and every time but I can put my daughters with them but don't you dare put yours\nThat's exactly how the left stacks up I can do it you can't because I'm covered but you're not and and look at it it's a lesson it as a precautionary tale\nFor many many boys I said many times what harmless thing is your kid here than going to do at the age of Fifteen at some woman's gonna come back twenty five thirty years later and say oh look and what you did to me more if he's not even going to remember it\nHe hid it not it's going to be insignificant to him and her\nBut because something may be important in life she decide I'll take him down for what\nWell you know it was hanging by a thread two weeks ago and now he's on the court and I think the other issue I Want to get your perspective on this Kevin Jackson and the black sphere which is the what's happening now with the Honduran migrants\nComing through Guatemala into Mexico there right now it's three to five thousand strong and they're heading toward the Texas border this is a terrible event for the Democrats over the next two weeks before the election they have the video and the pictures of thousands of migrants\nWhenever I watch MSNBC all I hear about is women and children\nAnd then I see the video of these migrants coming to urban areas in America and they're almost always young males and the young women tend to be raped or sexually molested the men are drug meals and I'm sure there's good family members among them\nAnd Kevin Jackson of you and your wife and your children were in a more in Honduras in a bill Cunningham and my wife and kids were in\nAnd we're in Honduras living the horrors of socialistic left wing military hunter regime\nThe first thing I Would want to do would be to get to America I understand it completely but along the process it gives billions of dollars damage Thirteen other gang bangers to provide a passage Everytime you go through some other drug infested area Mexico you got to pay\nHomage you gotta pay either sex or money to even pass through and and live by the time you get to the northern part of Mexico according to sixty minutes about two months ago there was hundreds of dead bodies because some men did not want to participate and becoming drug meals to give drugs into America\nSome women were killed because they did not want to be ritual is typically raped on a regular basis this is a horrible journey I watch MSNBC this is about refugee status of desperate people I watch other news outlets and this is terrible Trump's going to send supposedly\nOur soldiers to the southern border to stop it and all of this is playing out during the election to the Democrats supposedly have in the bag because hundreds of millions of dollars up to a billion and it's been pumped into these campaign\nOr buy a Tom Styron by Bloomberg and others in order to uh to me are Republicans all over the country yeah did you give me over the next two weeks ... how's this going to play out I like to early on November the sex\nBut Democrats have missed every find they no longer have their finger on the poll from the American electorate people want our border protected and so they and they also get that this is fake news it's contrived it started as a hundred and sixty people now it's up to four thousand now\nAnd so what prompted the right thing he said Honduras these people show up you're losing their aid Mexico I guarantee he made the same call to the new president of Mexico and say look\nIf these people get three you were going to renegotiate our trade agreements we're going to look at the age were able to send you to Mexico deploying military on the southern border\nSo I just heard this literally today good so Mexico's going at it Honduras I bet you will send buses to say you got you're going to get back to our country or else ... and ... what the live how they're going to play out to Democrats again overplay their hand\nAnd they think that there's some issue that's going to be the ... the you know the ... the division point with Americans in Americans overwhelmingly won our borders protect that we don't want these migrating who wants to think that they can just come anytime they want so whether whether it's the kind of effect\nOr whether it's the Kavanaugh fact whether it's the stars of an investigation of the Russian they'll which we now see that that is completely been busted part because the judge Royce Lamberth who just said I don't understand how Cheryl Mills isn't in prison you know\n... and it or Clinton a bunch of others and then there's a conspiracy with the FBI so that's about to break that's going to be the big story this week and then you've got this yet again read a dirty patient of the whole border issue that Trump's going to send troops and say you're not going in you\nKnow hey man\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nYou can't afford to pay off all your debt\nTo not let the credit card companies tricked you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without debt consolidation or bankruptcy\nDepend on your success offer a guaranteed\nFree information cold now one eight hundred nine five seven nine seven four six that's one eight hundred nine five seven nine seven four six one eight hundred nine five seven nine seven four six\nOh hey this is Iraq was a matter of on them to tell you about my pot wrap sheet impress each week I'm joined by special that some of\nMy careful stop by pop football to get you to inside scoop on the ... biggest or maybe even teach you a little bit about that if you have a tag in your closet that says structure that things got [laughter]\n... available on apple potash stitches or your favorite pie kept that from the west would one podcast network\nThe possibility of lung cancer can be pretty scary especially through proxies you knew your current or former smokers you risk that's why I see by the skin down once you know this is a breakthrough low dose E. T. scams can detect cancer early and it only takes sixty seconds you stop smoking now start screening\nWeren't easy quiz to see if you're eligible visits said by the skin or you could save your life like Mexican workers broke you by the American lung association Islam force there should be a council\nOr veterans were there for you everyday to ensure our way of life [noise] let them know we can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vets alone improve the lives of\nThose who have served our country\nPlease show your support and text V. E. T. to hate hate hate hate to give back a little to those who give us so much text V. E. T. to hate home heat heat hate\nLying about you but I didn't think of ... I don't like plugging calligraphy\nAnd you wouldn't have attempted to ride your bike typing a letter\nSay the ... and ... ...\nOut and play some of the\nIf you want and can be I'd be trying now and tax thing I Lived for ten\nMinutes ... message ... by the national Highway Traffic Safety Administration project yellow light noise and the ad council\nIn the wake of a disaster what one thing can use and that will help people the most [noise]\nTent sandbag doctor actually if you send a monetary donation you sent all these things even a small donation can make a big impact and can quickly become exactly with people affected by disaster need most in the wake of a hurricane your monetary donation can make a huge difference to those in need to donate doesn't support\nHurricane really thought that support hurricane relief dot org ... by the council\nOn north or whether it's graphic and talk we pretty much have all you need super ... Ninety nine seven WGN [noise] I thought\nLike hunting and the great American is continuing to suffer as they were simply continue\nThe other night on Fox I'm watching and uh the speaker made a comment the expert on the administrators agency slashing the Congress that made the comment that every year and matter who's the president something like three thousand new rules are put into effect by the alphabet soup federal government agencies\nAnd uh they're simply a room making that becomes law making which is completely different than what the founding fathers intended what the constitution did not intend the consequences had been necessary rules and regulations that caused the American economy billions of dollars every year\nThe Constitution's separation of powers been compromised in other words\nThe ... the the agencies or the federal government or the state government agencies were mainly the federal government agencies are accountable to no one other time lawsuits filed might be years before their compromise and you can't even\nBegin to stop three thousand new rules going into effect and then as a consequence we Americans are going to question the legitimacy of their own government when it's completely on accountable a good man Peter Jay wall isn't written a book judicial fortitude\nOr subtitled the last chance to rein in the administrators state and Peter Wallison welcome for the first time the bill Cunningham show Peter how are you\nI'm fine thanks to go to have you here a couple of weeks ago of course we got a the fifth conservative vote\nOn the Supreme Court Brett Kavanaugh which is a good thing in his writings and the second circuit us court of appeals where he was for twelve years Brett Kavanaugh often knocked down the administrative state ruled by rule which is a great thing now described it the American people what is the administrator state and how does an impact our lives\nOr ... minutes to the aid is all of the federal agencies including everything from the Treasury Department\nAll the way down to the FCC and their hunger grab them and the way that may impact our lives is that they make a lot of rules and regulations\nBased on staff who in many cases a ... year old and those rules and regulations\nAre not only credit for all that is there are many of them but they have a major effect on our lives and the ... percent the book that I have written is to explain that we have to rein in in in some way\nOr who's ... when the ... when you when you say we have to rain the men who is weak\n[noise] uh well the American people have to bring them in and the way to do it is so unfortunately the only way to do it is through the court system and that's why your point about a ... Brett Kavanaugh having been I'm a concurrent could this record is very important because I think he is the\nRoad the five of the five member majority would be interested in raining in the administrative state by cutting back on the activities and the rules that they are able to make\nCan you give me a concrete example and I think government agencies I think the FCC I think the IRS\nBut you're telling me there's hundreds of government agencies bureaucrats\nAbout about one point two million strong new every day made an office is mainly in Washington about our little all over the country\nAnd then they got to do something they just can't sit there and drink coffee all day so they started not enacting rules because they want because they have some generic piece of legislation giving them real making powers and then they issue these three thousand new rules that day that must be complied with how much farmers are causing as\nWell I think it's causing a lot of harm in the center for businesses of course it creates a lot of regulations that they have to comply with compliance activities are very extensive for business is one of the estimates that I have in the book is that each\nNear it car who really in dollars to comply with government regulations\nThough that ... trillion dollars actually gets passed on cruel other Americans who are consumers of the of the products that we used to produce so that's an important factor and in fact a trillion dollars this more than the government actually tax rates are either from businesses or from individuals each year\nThis is a very significant thing but it can be turned back how they can be reduced give me hold on\nIf the idea here and described in the book is that the courts can step in and begin to review carefully the legislation under which all of these rules are made and very frequently\nUm their rules are based on our laws that were ... years ago sometimes generations ago and they are in ... by the administrative agency to give them the authorities issue all these new rules\nAnd the court can look at that legislation again and say wait a minute\nYou've gone too far that Congress did not give you the authority that make this rule and there are a number of examples in the book where um you can see that the that the agency has gone well beyond what Congress actually authorize so\nIf the court is willing to step in and take those steps and that's what fortitude is necessary that's why the book is called\nConditional forward it to they have to have the strength of character that go in and make these decisions that will turn down regulations\nOf um of administrative agency and we can actually begin to reduce the amount of regulation and the rules have come out of Washington\nPeter Wallison let's go back in time does not hot summer in Philadelphia and Seventeen Ninety seven article one they said the founding fathers said and we believe that the Congress the house in the Senate\nOr the most powerful instrument talented government because of the best reflects the will of the people in reality at least for the past fifty years it was perceived Congress's number one it\nWas perceived the president's number two and they and the court system is number three in reality number one is not the Congress one might say it's the presidency is the most powerful number two is the current number three is the Congress and Congress\nIs feckless foolish any relevant and and so what would the founding fathers day if they were transported from Seventeen Ninety seven the twenty Eighteen and October twenty Eighteen and they looked at the situation today when that Congress is foolish in fact once\nLeaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more sex market to seven nine six four or five\n... N. A. R. K. E. T. to seven nine six four or five star cheer on line NBA\nInformation management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs online checks to market to seven nine six four or five\nThat's an A. R. K. E. T. to seven nine six four or five\nYou guys can hear from the hip type cast today's growth who would win at three mile bicycle racing eleven year old girl or last year's winner the Tour de France\nIt all depends on the bicycle it depends on their vehicle will send a ten speed in the ... going to win every time but put the race around the trade circle and the eleven year old winds every time you see it's not the driver it's the vehicle\nWhen it comes to generating revenue it's exactly the same if you have a job or a small business you are writing a tricycle you can only go so fast if you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed\nWhen it comes to helping people create their next revenue model both for joining recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely depend on you so you need to check out income store dot com that's income store dot com\nI'm waiting for you to tell\nFedEx delivery passion what we turn left her by delivering\nWith your Mayo Clinic radio health a minute I'm Vivian William Young kids need to\nPlay that's according to a new American Academy of pediatrics report Mayo Clinic Dr angel Mackey agrees\nWe want them to be learning to play ... structure and play is the best way that they can learn their developmental skills they can learn social and emotional regulation and they can learn how to relate to problem solve with other children\nDr Mackey says good old fashioned play time not only have children develop social skills but it also helps with language skills and stress\nRelief and in the world where screens are everywhere Dr ... said it's important to make sure to turn them off\nThere's a lot of different areas that too much screen time can affect the health of children first ... we see it from young children all the way up to teenagers\nToo much screen time is associated with being sedentary and moving is important for good health for more information talk with your health care provider or visit Mayo Clinic dot org\nLike a girl is a nonpartisan hot cat it's a documentary on the on the number of women running for office in the twenties mid term election\nWe\nWant to hear what it's like to run like a girl in such a heated political climate last year we marched this year we run [noise]\nFind us on apple ... gas or wherever you listen to your gas\nIf your child is sick over and over again it could be ... a serious effect of the immune system early testing give children a chance to drink\n[noise]\nJeffrey motel foundation helping children reach for their dream visit info for PI done to\nOur veterans who were there for you everyday to ensure our way of life [noise] let them know we can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vet alone improve the lives of those who have served our country\nV. E. T. to hate hate hate hate and give back a little to those who give us so much ... V. E. T. to hate whole heat heat it\nThey said you need to make me applied individual results may vary see what's after details\nI'm buying a huge flat screen TV so I can finally see it without my glasses why can't really\nThat's what I'm hearing my glasses and contact her pain I'd love to finally get rid of these but\nWho can afford lasik you can\nBecause some basic mission is to do is offering dramatically low prices and an absolute free consultation Jeff taxed clear nine nine two three five zero three five zero lasik vision Institute has already perform over a million procedures they use the latest FDA approved lasik technology that helps the majority of\nPatients a cheap twenty twenty vision for a fraction of what others charge\nLet her vision better value the ... Institute make this year you finally get lasik for a free consultation plus an extra twenty percent discount tax clear nine nine to three times zero three five zero you'll see for free if lasik it's right for you that the L E A R nine nine to three five zero three five zero\nAnd ... when I taught a Ninety nine Sally ... you know what I mean our weather traffic and dog\nDoes immigration issue I think's going to be the October surprise that will trust the Republicans\nBack into the leadership of the house in the Senate ... most pundits Charlie Cook et cetera say the Senate is like a done deal Nate Silver was on a this afternoon or this evening on one of the evening talk shows he said the odds of the Republicans keeping the Senate if something like eighty five or Ninety percent\nAnd they also said the odds of the Democrats winning back the house or something like eighty eighty five percent I don't believe the main reason this president was elected in my viewpoint was the hordes of individuals from third world countries\nFleeing maybe justified reasons such as violence on doors El Salvador El Salvador Guatemala and Mexico maybe Venezuela Colombia and I understand that completely but they're coming from those violent places on earth give you some fact toward\nThe males coming from Honduras have a violent death rate of about Ninety five per one hundred thousand\nCompared to ... to Japan which is zero point to seven or America which is nine poor one hundred thousand\nIt's violence in our doors Nicaragua El Salvador to make transit large amounts of money must be paid this is a terrible circumstances and I think tomorrow morning the coverage on the news is probably going to be negative towards Trump but I think in reality this is the October surprise\nWas thrust of Republicans fact in charge of the house in the Senate and shots of world just like twenty six teams twenty sixteen will be visible in twenty eight seen in twenty twenty I'm confident the American people cannot be so still says his putting individuals like Nancy Pelosi in charge of illegal alien migration into America\nThanks for listening still counting and live with you every citizen\n[noise]\nHave you tried that trendy need eating out you can have my sibling fine with people who just love to play a game\nBut if you are ready for something more grown up trying to match\nOver thirty thousand new people a day are heading to match for grown up conversations that lead to great date and beyond our listeners to go to match dot com can start for free today you thought it would end informative profiles to get a deeper sense of the people you'd like to me start for free today at match dot com that match dot com\nAre you considering a safe for gun safe to secure your valuables and firearms if so before you\nSpend any money on any typical run a male safe check out the amazing handcrafted rhino iron works shapes had rhino safe dot com she for yourself why rhino safe customers are so passionate about their antique industrial style shapes and if you're a gun owner you'll love the convenience of the swing out gun racks\nRhino has a huge dealer network great pricing warranty in customer service so go to rhino safe dot com today ... said\nThe following is not an actor but a real life story from trinity debt management\nMy story began with that a lot of debt credit card debt and I hurt a commercial for trinity I gave them a call\nIf you're in depth and you need help coal trinity one eight hundred three eight three oh six eight seven\nWhen I first called I was a little embarrassed and kind of a shame and I looked at the numbers and I saw how quickly that astronomical that that was in my life would go way\nTrinity will consolidate your accounts into one easy to manage monthly payment reduce your interests and possibly improve your credit score you'll save thousands\nWhat I Would tell other people please pick up the phone and call trinity just let them put together a program and see how affordable and easy it is to pay off your debt\nCalled trinity one eight hundred three eight three oh six eight seven that's one eight hundred three eight three oh six eight seven\nAnd you're seeing bail Nashville\nStudio where dogs I mean I [noise]\nEver miss not convince Texas farmers concern for and so is Saudi Arabia is calling the killing of journalist John ... a huge in grave mistake as many western governments continue to reject the kingdom's explanation of what led to his death some totally reports from Riyadh\nI don't condone looting or things like this but what I Do condone is stocking up on items okay you're here's what you need you need some rice you so you know by some of the dry rice we're doomed\nIt's gonna happen it's not going to be the zombie apocalypse it's gonna be the stupid apocalypse that's how it's going to end people won't know how to do things [laughter]\nWe always say\nTheir their you know the weather guy or you know the on your local TV you know and make sure you wear a big jacket today but\nNobody says hey make sure you wear pants today they should say that every\nDay or you know we we laugh at that and now we're getting into that time of the ... before the kids leave the house today make sure you put on their winter jacket yeah most of us say stop it right just stop and stuff\nAnd now we have to realize no those are valuable instructions for many people that exist today I don't know that when it gets cold you need to put a jacket on we\nGotta we gotta apologized to all of our friends who who work at these TV stations who are way ahead of the stupid curve and I do mean stupid curve\nBecause there was a stupid curve here look we know our audience the critical thinkers we we but but we're all going\nAfter like a I don't know build a Fort let's just call it Texas and we're going to have to guard against\nThis kind of stupidity but I don't know how you do that you know or who was at a Ron White you can't say stupid but I I don't know how do you repair that I don't know how ya doing that back\nThat's not even funny anymore\nNo no that's actually [laughter] drugs you know that's a comment like if he if Ron White just you know had his own show on Fox News or something that would be just as serious comment you know you can't look stupid 'cause you can't\nI don't know how we\nDo that so what you need to do your stock up on you know Dr rice and and dried beans in the whole thing that you're going to need because the stupid apocalypse\nIs on its way it's it's not far off not far off we don't know if if we have a significant number of people forty eight percent who\nAren't sure where chocolate milk comes from we're not going to need a purge\nNo no no no no no people just sort of no see that's the thing that sort of this running around in circles that's just sort of fade away because yeah it's like they can't they can't survive on it\nReminds me of the the old magnetic football say in a game where you just turn it on that just all go in circles that must have your life I had\nNo idea that when I got frustrated that a game as a kid come on can you guys were\nJust wandering around in circles\nLittle felt football the one guy was old enough to remember they had the little kicker and you tried to get fat but like never word it never got past the center [laughter]\nOver and the kicker kicks up old who had to their own already had a game and that and that's why we all instead of playing the the you know the electorate football we all put the penny and remember you put the penny underneath a finger and they after you're\nOn your finger and you flick it up in the air and the other one held the gold price right and they're like this is more satisfying metal like football right exactly I've no idea how we got to electric football from turning out when Elizabeth Warren in one income thousand twenty well what does all of the stupid people are running around like the little electric football players these days\nIt's what they look they're just running around in circles so getting back originally and by the way this is going to be most of the show [laughter] you just heard the first segment yeah by the way I've a question another question we've gotten a lot a lot of questions from vacation is it a caravan or a mob\n[noise] I Will say this ... I think putting on our ...\nAnd we're going to be like we always do we put on our our substance had which is looking at the issues and basing it on the substance in our\nPolitical had put it on my political hat I thought that what came out of the the the campaign from the Republicans and Democrats I thought the best campaign slogan actually came from Trump was jobs not mobs very a very easy to understand\nAnd very quickly on the the caravan here 'cause we had a lot to talk about today and uh it's funny sometimes I just wonder how do people think and this is comes from from the uh people to support Trump but that's just about Trump it's about to get to Trump but I'm thinking to myself and you at the same thought\nThink people was it was for him this works for him we're moving towards election day and the closer the caravan comes\nTo the U.S border is going to help Republicans and help Trump but I'll tell him say it's a ... because this is because that's all I heard this is a conspiracy sources behind it and and they're doing this in order to win the election well then try and spend more money to win the election in a more caravans command\nIf they believe that that's an effective way to win an election because it's not\nIt's not it it ... we started and it was the timing and everything going on in twenty sixteen but Trump own immigration illegal immigration if you want if he if he is to get back on\nTrack to get funding for the wall this will be part of it\nIf I if you and I were talking about if there is a conspiracy yeah it would be the Trump behind all of us [laughter]\nThan a billion dollars to make it happen because it's working for him right there is any conspiracy politically that would be called brilliant or affective in terms of a positive for one side of the other they would be him behind the conspiracy because\nThis work for the president and Republicans if you've got five ... this is what we saw a few years ago ... years back or when you had an influx not quite like the\nCaravan mob or whatever you want to call it\nUm but but pretty much the same effect right there are about to reach the border and you had people you had Democrats who had rank and file Democrats saying no no no no no no we're spending people on\nThe ... spending money government money on people\nWho aren't citizens and we're not spending enough and in the cities and in our town them on our kids and that's the way that went and uh that was before Trump was president ah if you think this is a conspiracy let them try it it does not work for\nThe left coming up on the show first the one over one thousand\nAnd twenty four we will we will get to because still I was you and I both on vacation very rainy vacation whether I was in New York or whether I was here didn't matter ... it just it rained it was a complete are up ... wash out and in fact the most the the biggest thing that I accomplished was I got three room steam cleaned in my house\nAre brought up the steam cleaner and did a three rooms and how far more to go\nOr so that was really what I did over ... you know vacation oh\nBy the way very quickly happy sixty seven wedding anniversary to my parents as sub Saturday and I will have the ending was the seven yeah anniversary\nA ... a but we'll we'll get to that coming up because I just when I saw that I went when I first saw that I said if she if she dumber what how dumb ... she ... you know for doing that and she came out yesterday and said that she did it because the world needs transparency and she was attempting to be transparent to\nWell I uh also coming up on the show Hillary is just like Mike Myers from Halloween she just won't go away or should I say Michael Meyers yeah Michael Meyers Michael Meyers is pretty funny right All right in ...\nUh the uh the the jobs not mobs political slogan that came out while we're on vacation and the Democrats platform is what we thought it was going to be which is put hats on Kavanaugh to those Democrats upset about the ... or ... death where were you on Benghazi right\n\nWhere were you on ... because the criticism\nOf the administration luck none of us know everybody becomes an expert on these things oh here's what happened you have no clue what happened and maybe somebody in the CIA knows what happened maybe Trump knows what happens maybe somebody some of them in the\nHouse and and uh the house intelligence committee and and the Senate intelligence committee maybe they know none of us know what really happened over there but one thing we do know is the hypocrisy of the Democrats\nThat in essence said when we found out that Hillary Clinton and the state department lied about Americans being killed in a terrorist attack and lie to the American people about it what did the press have to say this was her best day yes best week ever run Hillary right\nA peta says a cow's milk as a symbol of white supremacists ... car crashes rice in states uh with that have legalized recreational marijuana and the illegal immigrant caravan Elizabeth Warren and that the study that finds that a number of Americans think the chocolate milk comes from brown cops\nWill have to repeat that I think once in our yeah probably that's why we are doomed update plus your calls and comments we got a great show I had eight six six Ninety red eyes [laughter]\nWhat book read are ready to do with a record every McNamara [noise]\nMister show listen anywhere anytime on demand to catch up on Eric and Gary's topics of the day is it red eye radio show dot com and click on demand that's red eye radio show dot com\nYou been forced to make some tough choices over the past few years do you want greater fuel efficiency and profitability or a tougher truck you can count on with a western star forty seven hundred you don't have to compromise you can get your tough back\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up\nThat we've neglected one of the more important products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall\nHealth I worked with dentist to ... ... ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums and built in climate pulses to guide you round your mouth all packed into a beautifully slim and dies at least many him design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping\nBacked by thousands of dentists quip is one of the first electric toothbrush has accepted by the American dented association upgrade your or capped and stopped brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plant sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W O\nO hey this is interesting what the minimum that you to tell you about my pot Rashid in each week I'm joined by special that someone on the with\nTom ... stop by pop football to get you inside scoop on the biggest story or maybe even a little bit about that if you have a tag in your closet that says structure that things got [laughter]\n... feet in France they held on apple pie tests or your favorite pie kept that from the Westwood One podcast network\nAnd three miles than registered to joined the million mile club on line I read I radio show dot com red eye radio in our sponsors support your safety on the highway\nThe tough tested Bowers lead is on the road the tough tested truck we'll be traveling the country at truck shows truck stops and national retailers across the U.S stay tuned to read I radio for up to date information and be sure to follow red eye radio and tough tested on Facebook Instagram and Twitter for\nInformation on tour stop events and promotions if you see this truck take a picture posted on Instagram and be injured too when great prices at hash tag tack this truck keep listening for us for the next stop near you have your driving right\nNow and you'd like to read the informative and entertaining content found in the current September October issue of rotating magazine or if you'd like to listen that's right I said listen\nAs a voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of votes your drivers is now available for free as an F. R. E. E. N. N. E. T. H. Petro location nationwide\nAnd if you're not fueling at a TA Petra location today while you're in luck you can simply go to road king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote getting on your smartphone will scroll down version is also available at Rhodes ... dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening road king dot com\nThanks for calling consolidate ... says can I help you I sure hope so I'm In that credit card bills yeah I have to credit\nCards that are making minimum payments on and another that I'm behind on about five thousand dollar slid\nInterest rates have hang between Eighteen and twenty two percent that rate it will take over Twenty years Twenty years like consolidated credit can give credit at Columbia payments and reduce or even eliminate your interest charge as he should be able to have anything I can tell you what do I have to do just that they can be cast get ready to celebrate\nYou know you were saying some mobile you find the ... and I see I mean he was one guy was this easy I Would call ... years ago\nOnly children my mind to sixty seven hundred and sixty seven fifty eight hundred five five to six do some\nReading on the sort of the free but he wasn't like more than ... remembering somebody might you might want to share with the MIT organ the image eagles eagles won by says why there was just the corporation commission license number\nD.C thirty two a cultural appropriation ... right now right journal chill appropriation she's\nShe's a appropriating a culture ... the thing I liked his one even came up with a one sixty fourth while she could be one sixty fourth or could be won over five hundred and twenty or one over one thousand two hundred and twenty four\nAnd it was like yeah but the one or even if it's the one over sixty four and I don't even know whether this is true or not but somebody pointed out they said well no the average American is one point eight percent Native Americans who doesn't even meet with the average American\nIs that that particular point so without question this is ... ... you know cultural appropriation right\nThe the the second thing was you want white privilege white privileges a white person claiming that they can be whatever they wish to be whatever minority they wish to be that they can be whatever minority they wish to be the other thing was the media jumping on this is it as if this legitimize\nEver veto you're right wrong no doubt that we did but yeah that that ... that was it\nBecause there was some here's what was I think great about the whole scenario I don't know that was planning on the part of the president I don't think it was it was just basically basically it was his rhetoric on his side right\nBut remember back in twenty sixteen we were saying okay when you're on a stage with Hillary and you're you're debating just throw the facts out or you know she lied about being ... she you know the she broke the law when it came to her email server all these things is\nThrow the facts out and have them back well they ended up back checking Elizabeth [laughter] and Elizabeth Warren people basically doing that and then they come back as if it's a legitimate\nRight but then they remember they kept changing it that well I met him at the ... was the Boston Globe yeah right yeah we made us take care of and we made a mistake again\nIt just got to the point of being the most bizarre thing yeah right and I'm thinking to myself\nWow how bad are seriously now you when I Need to reconsider ... we need to get out of this radio thing and get into political consulting do yeah I Would totally do that and just say you idiot yeah\nDo you think they're going to work well if you're gonna\nIt's your money waste your money on us give us the apple a million dollars and we can be a lot better political consultants for whoever you're using right because remember this means that Elizabeth Warren got together with all of her aides and they sat in a room and said okay here's our plan to counter Trump [laughter] yeah and everybody took their head going ha ha\nHa ha ha ha ha that's only go is that it was that you'd think there was one guy or gal in the room that said\nNo no [laughter] they all they all there was an overriding vote as sorry we all voted you were deciding to go with it because we're just a tactic become a good idea\nAnd and but this is not this is the mainstream remember when you have the Kavanaugh hearings the first cabinet hearings and it was the first day and remember that whole weekend the Democrats on the committee had decided whether or not they were going to do a full on walk out\nOr you just do the ... thing right and they thought that it struck destructive thing you know with Grassley\nA basically would be the tactic they would use that is what they went with and it's like they had that meaning they met all weekend about it okay we can get up and walk out which ultimately they\nDid a during the a committee vote on on on Capitol you know that you had come out Harris going outside and doing the\nPress thing and all that but it wasn't that wasn't so much the ... that was like the protest after that they are they still voted yet and they still voted so there wasn't offensively anything you know it it will show about it\nBut they had the meeting that first weekend they had that meeting will just get up and walk out this is this ... this is a mainstream Democrat today this this is not the protesters\nAnd we talked about how the protesters ... lead the party they lead the party they lead the call for the party but how many groups how many different causes and different protest groups are there this is why they have no direction because they're in every direction\nAnd it's it's it's crazy and then then I guess the the the other point was so Elizabeth Warren then does DNA matter quite right does this does is destroyed transgender isn't mhm if DNA matters because remember\nThe the the next thing is as as we all know uh we we've gone through the whole trans racial thing them a leftist starting to embrace right or remember you're talking about Elizabeth Warren who was [laughter] before this one of the leading liberal icons [noise] you know socialist icons\nSocial justice warrior ... who broke a ton of social justice warrior rules and regulations [laughter] number one you were saying the DNA matters does it does so DNA matters across the board then and then it matters for uh your your sexuality it matters for your gender huh that writers for your race huh right is is that the", "year": "2018", "show_name": "The Savage Nation - Michael Savage", "city": "Hendersonville", "day": "22"}