{"month": "10", "state": "PA", "station": "WVYA", "content": "Although a certified genius we talked with a new MacArthur Fellow who's bringing music under served communities all that and the latest news from Washington and around the world on weekend edition from NPR News\nSunday Morning eight to ten all W. V. I Am\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] Geithner is committed\nTo ending opioid addiction with buck prevention and treatment in the last three years we've reduced the amount of opioids we prescribe like fifty percent\nAnthony ... three medication assisted treatment centers to help patients recover from attacks and learn more at guiding her diehard finally had enough\n[noise]\n[noise]\n\n[noise]\n[noise]\nFrom the W. V. I. H. studio in Williamsport community arts center this is Jim standards I'm Sasha Feinstein today we're listening to guitarist Wes Montgomery in the year in Nineteen sixty when he recorded a masterpiece led another excellent album and contributed brilliantly to several others\nMontgomery was born in Nineteen twenty three and the only live to be forty five so almost all of his recordings seem precious even if they're on even but this work in Nineteen sixty was uniformly superb and we're going to begin with the session from January twenty fifth\nLed by core noticed now at early on this cut he's back to just by Wes Montgomery on guitar and Sam Jones on base the lovely I've got a crush on you you know W. V. I. A.\n\n\n\n\nWho\nUm\n\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\nSomebody\n\nCan just move\nInto thinking missing\nIsn't\nTell them\nThey come\nAnswer for me\nSaid\nOf\nIn the\n... when they get the money is going to grow to groups who can do on the opinion of human\nAround them and they said they will\n\nThey they\nHave to pay for their favorite shows they they they\nThey know they they they they do\n[noise] um I'm a blogger from among mostly he\nSays the poodles grew\nClose to somebody and all\nFrom she's from the from the city to\nStage\nIn a\nBad thing to say\n\nThey\nTo\n\n\n\nThat was the natural blues Wes Montgomery original and before that polka dots moon beams from the incredible guitar Wes Montgomery recorded in late January Nineteen sixty\nProbably Flanagan on piano proceeds on base and Albert ... on drums we move now to me in Nineteen sixty with an album led by tenor saxophone is Harold Land joke Gordon was on trumpet Wes Montgomery on guitar Barry Harris on piano Sam Jones on base and Louis Hayes on drums\nHere's one Wes Montgomery is most famous compositions the title track to Harold lands west coast blues on WB I AA\n\n\n\n\n\n[noise] and\n[noise]\n\n[noise]\n[noise]\n[noise]\nYou know and\n\nWest coast blues from the album the same name let die tenor saxophone is Harold Land Joe coordinate trumpet Garry Harrison piano Sam Jones on base Lewis he's on drums and the composer Wes Montgomery on guitar coming up next more music from guitar lead\nBarry Harris on piano Sam Jones on base Lewis Hayes on drums and the composer Wes Montgomery on guitar coming up next more music from guitar legend Wes Montgomery in the year in Nineteen sixty as we continue with jazz standards on W. V. IRA [noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nThat was never will lie Mary from cannonball an early in the poll winters cannonball on Alto Victor Feldman on vines and piano ray brown on bass Lewis Hayes on drums and are featured performer Wes Montgomery on guitar\nIn the fall of Nineteen sixty west and his brother's Fiennes buddy Montgomery and bassist monk Montgomery recorded an L. P. called groove brothers they were joined by learns Maribel on drums\nAnd we're going to hear a buddy Montgomery original appropriately titled buddies to you know ... you\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n\nIn\nThe game\nDo\n\n\nWho\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n", "year": "2018", "show_name": "Jazz Standards", "city": "Williamsport", "day": "14"}