{"month": "10", "state": "PA", "station": "WVYA", "content": "Immediately jumped into supporting them and telling their stories rather than going into protection about\nAll that and the cat down to election day send me on weekend edition from NPR News\nSunday Morning eight to ten on WB I Am\nSupport for WBAI comes from the white Center for the performing arts hosting a free health and wellness fair on Thursday October twenty fifth from five to seven thirty PM in the atrium lobby in conjunction with the performance the nature of forgetting that evening at the Y. center\nThe health and wellness fair will feature a dozen vendors sharing information about staying active and healthy as we age including resources for those affected by memory loss and their caregivers for more information about this health and wellness fair five seven zero five seven seven three seven to seven\n[noise]\n\n\n\n\nFrom\nThe W. vi studio in Williamsport community arts center this is Jeff standards I'm Sasha Feinstein today we're listening to recordings made by Jimmy Jew free the innovative clarinet is and saxophone player and guitarist Jim Hall\nJew free would break ground with his freer approach to jazz clarinet in Nineteen sixty one trio session with Paul bland Steve Swallow\nBut the first incarnation of the Jimmy ... trio emerged in Nineteen fifty six with Jim Hall on guitar and Ralph pain you're on base we're going to hear from that group as well as other sessions featuring Jew free in hall\nWe'll start with their debut album the Jimmy ... three recorded in early December Nineteen fifty six here's a Jew free original called two kinds of blues and W. V. I. A. mhm\nOoh\n\nMhm\n[noise]\nMhm\nThat that\n\nAnd\n\nBoth both both\n[noise]\n\n\nI'm\n\n\n\n\nCome\nAnd said\n\n\n\n\n\n\n\nThose two\nGoing\n\n\n\n\n\n\n\nAnd then\n\n\nThe\n\n\n\n\nMhm\n\n\n\n\nThat was two kinds of blues from the Jimmy ... three three ... clarinet Jim Hall and guitar and Ralph paint on base in July of Nineteen fifty seven jewelry and hold record it together again\nThis time inside men on Bob Ruth Myers traditional ism resisted on this cut ... tenor along with Myron trombone Jim Hall and guitar joke Benjamin on base and deep Bailey on drums here's some sweet day on WB I oh\nMany news the news and the New Year's New Year's eve we\nYou know\n\n\n\n\nSort of\n... a long time and you never really offensive to\nAnswer the phone from one\n\nRoom\n\n\n\n\n\nNo it's been a\nNo no\nNo\nI'm a\nIn in in ...\nA long\nNo no\n\n\nNo no no\nNo no\nThat the ... [noise] [noise]\n[noise]\n[noise] Mm\n\n\nMm\n\nMm\nI'm I'm\n\n\nThat was the title tune to the Nineteen fifty eight album traveling light the leader Jimmy Jew freon clarinet mob broke Meyer on trombone and Jim Hall and guitar coming up next more music from Jim ... Jim Hall as we continue with jazz standards until the CIA\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\nFrom the W. V. I. a studio in Williamsport community arts center I'm Sasha Feinstein with jazz standards\nToday we're listening to sessions the parrot Jimmy ... free with Jim Hall and we're going to continue where they live recordings from October twenty seventh Nineteen fifty eight made for the TV show stars of jazz the instrumentation was pretty unusual Jimmy Jew free on tenor\nBob broker Myron trombone and Jim Hall and guitar that said this is Pony Express on WB I\n... oh\nOh\nHe is he the G ... ...\n... ... ... you know\nI\nWho live around the house\n\nOn it and then how do we know Don ... and ... and and and I mean we have ten and got them and\nThey had a little ... sangre de\n\n...\nWill boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom\nBoom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom boom boom\nAnd we don't do\nNot both federal and from\nOver the\nSo we're both men and women were down\nPitcher\nCattle\nThan that\nFor you know we're going to work that\nAnd\nAfter that happened and\nThen but then again and then and then the\nLong voting ... around\nYou know no no no no no no no no no and I'm going to move on and\nMove out of it in our food a\nTo run for the\nEconomy in in a\nRoom for a long time you turn on our on our own souls and painting and drawing a pilot on that when you can get a ...\nSo that'll do it again [noise] [noise]\n\n\nNo no no no\nNo\n\n\nNo\n\nNo\nI\n\nDon't know and then\n\nAnd then you're going\n\n\nTo\n\nDo\n\n\nThe\nBest\n\n\n[noise]\n\n[noise]\n\nMm Mm\n\nMm\nMm\n\n\n\n[noise]\n\n\n\n\nMm\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\nJust\n\nTo\nDo from\n\nHome", "show_name": "Jazz Standards", "year": "2018", "city": "Williamsport", "day": "21"}