{"month": "10", "state": "MA", "station": "WFCR", "content": "Streaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional and education those most health sciences psychology a icy dot edu\nFull service optical company in Springfield north Hampton what field and each long metal for over thirty five years cans I wear ink dot com\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and it N. D. E. P. R. dot net Julia is next at eight o'clock\nHigh it's like yeah but he ain't no close up from like you know usa you have so much information at your fingertips don't you sometimes feel overwhelmed by it all your Latino USA\nWe know that your time is valuable which is why our team prides itself on producing original story that you won't cure anywhere else check us out and share with your friends and family thanks for listening listening Sunday nights at ten on New England public radio\nThat Tony ... is next state to\nThe news [noise] [noise]\n[noise]\nThen then\nA young\n[noise] [noise] [noise] [noise] and and\n[noise]\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writer enrolling now for August twenty seven applications that they pass dot edu na na\n\nNa na na na na and they\nKept telling me oh we went to North ... to duck you know what he's going to stay there is a fear that another change their station ... full week I didn't know anything that they're watching your trip with the ... ... ... ... aims to find it on that idea\n[noise] [noise] you know maybe [noise]\nGood evening and welcome to another edition of that ... I Am ... over the one with you until ten tonight from your radio station ... radio eighty eight five ... and [noise]\n[noise]\nStreaming of knowing what public radio was bundled raw you add American national college offering low residency graduate programs for the working professional ... health sciences or college or a ... do you\n\n\n\nGet them eagles ... must have supernova down not Dominique guy\nThat ... is it OK role I Am ... they\nThey wanna know ... that are they ... out of that but I'm which ... ... ... ... ...\n... ... ... ... it's almost a key but I Do that or ticket to administer finishing mine owner is author of ... ...\n... did I go by that is aimed land not changing or good evening I welcome once again\nDo that during the ... how are you doing tonight tell us your day how we shall we can going menial if I have a long weekend\nAnd if you are one of those I Hope that you\nAre having a good time and that you know that you're still have one more day to do things to ... DVDs a fall festivals going on and that a lot of direct sales if you are into that and a lot of those\nAnd a few only half de la ... weekend Saturday and Sunday in Georgia well I have a great program for you tonight\nThis is their ... and our radio station ... New England public radio eighty eight five ... ... line that any PR dot net and before we get started with music I Want to thank the people got called last Sunday during our\nFundraiser and congratulations to ... percent\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\nOn that either camp that's thank you so so very much for your contribute ... say it's great they appreciate it I guess they were ... ...\n... ... economy ghetto without at least last could actually I said I bet ... model each country where you don't get on the it's a ... ... plus how they'll do it on to their cause you're meeting me could ask yes\nEat fish she said I ... I Know\nIt when they talk about I mean do they keep that regret I set up the same time though he was cutting me off music in Northampton ... what is your knees\n[noise] [noise]\n\n[noise]\n\nStreaming of New England public radio was funded by you add base at university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot edu\nStreaming of New England public radio is funded by un they pass university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot edu\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n[noise]\n\nMaybe ... ... what I'm not sure an internal chase the only she caught data can they do they just like you know the most ... down ... ... ... ... ... ...\nMore than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n... times tastes as Tony how they ... they do today than any of those mean ... ... is which had mostly ... be a nice ...\nDominique canals meat Cheney come you know they're not at all because many kinda to my eyes says in the number two the it goes back to your boss who's ... each channel ... CDC my ...\nMy ... year battle can it I don't know I don't give you two by somebody that when ... when the protests your best on the team glassy tiny enemy check come you know like on one yeah\nI Would ask you need to do it and then they sing a spot that he has\nDone being at about ... going if you jump but to cheat a companion with them being about ... Antoni jak so ... ...\n... most most he got the ... New York the king Neil ... particle so nice to have what we do home may how much do art\nBlakey and the Jazz Messengers ... they say that or choke on soon as you most ... we're not going to ... Bernice\nPecker coal naturally glows daily better do more to go left Congress he was doing this now companion respect I don't want you to the animal being ... that are going up idea\n... knowing the second show the practical let's bring with us concern is that by ...\nSaxophone and out of the ... days she has ... to ... a horse close your eyes you have any more settled but I'm not going to look on your own\nBut it's you have they ought to be a nice stepped on being ... in on the radio it at all um any kind of ... on my salsa ... ... ... ...\nE is that I don't know but I said when the ... and I got to la ...\nDe la ... me ...\nDreaming of New England public radio was founded by ... riddle architect or forty or your legacy of commitment to community a design celebrating the next generation of leadership a cute little dot com\nIraqi and ... ... to ... that me and I was ... I\n... to be an ad in this bill Simpson gone by the media changed the tone ... electrical a laying saxophone you left without ... hill\n... is that\nWe chest curved three sons on then I think as a society doubt we will surely stacked up ... with this genre of music well though not all the time but quite often I feel that it's a nice way to\nIntroduce our show to you that the media [noise] we just heard music by me change come you know he is from the Dominican Republic ... great Ganis we heard ... ah\nGuy being on\nOn my mom my mom\nThe\nBam bam bam bam\nBam bam that all\nThe way that all\n[noise]\n[noise]\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writer enrolling now for August twenty seven applications that they pass dot edu\n\nOf them will be one\nLook at the lesson we can do more\nNo and I\nAnd I know that I\nStreaming of New England public radio was funded by you when they have university graduate schools and I say in creative non fiction writer enrolling now for August twenty seven applications that they pass dot edu\n\n\n\nBasis New England public radio in Amherst can forget eighty eight five or ... ... ... Ninety eight three that any B. R. dot net\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see da da da\nDa\nDi di di di do\nThe job and then about why\n\n\n\nThat on line and\nLet's do this\nThen judge a job and then and\nThen the judge John\n\nStreaming of New England public radio was funded by June ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nMe\nAnd we\n\nThank\n\nKnow\nMe\n\nDa da da da\nDa da\nEating\nOut as she gets on us or children are not cheap I'm was high school ... they ... they stay good on ... on the ... son is generally on Saturday So we're\nDreaming of New England public radio is made possible by you among the cues garage in Williamsburg offering foreign and domestic ... are you as you sort of on technicians Massachusetts students bedrooms GQ garage dotcom\nEra because Saddam was born in Manhattan June fifth Nineteen forty nine and his parents were from what thirty call\nAnd I'm generally on Saturdays or was he band leader a trumpeter and percussionist and together with his brother bassist on the on Saturdays I played on important role and that they're\nDivided up mental flooding jazz and I joined the Nineteen seventies both brothers played alongside eighty by me eighty and in my knee up can the school who don't leap buddy\nAnd from Nineteen eighty two two thousand Eighteen they directed the Fort ... banned from two thousand two thousand two two thousand Eighteen Jerry ... re cited in mud that eat\n'em in Spain and he he loves that is a city so much so that he moved to muddied he found out that\nA three generation should set a goal he's great when parents\nWere from Spain so he felt a very strong connection to this country and then when he was exposed to flamingo he fell in love with it\nAnd um that's why he decided to move to ... to eat and he came back and forth to New York bad mother to eat well if he's home and that\nIs where a key front that loss Pete ... he formed the scoop it must be said for the call and thank you also found that another group a coal mine do that act lobby\nHe\nThis past Monday October first of a heart attack after a fire in his home in my ... we're going to listen to music by this great\nStreaming of New England public radio is funded by you in the path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nMeat band leader and such a great artist I'm going to listen to songs one will come\nFrom his tears in New York jury goes salads and Fort ... much banned from the CD money in the country\nAre going to\nListen to a let's see um [noise]\nIt is sad song that was composed by the group a need to protect by\nA de Los ...\n... ... members of Fort Apache band\nDidn't even know if there's some is lost being got laid off ... when we are going to listen to music\nFrom his cheers in ... with just beat activists that are ... and in these particular so we're going to listen to the voice of the will seek I always call them ... form\nA former deputy strong connection in the ... going to seek out of that is a gypsy who focus on ISIS swimming pool all do in this particular San\n... and he does a frightening could take on this party one known ballot upsets you and [noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology hey I see da da da\n\n\n... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much [laughter]\n\n[laughter]\n... ... ... ... ... ... ... or\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AS each certifying technicians Massachusetts state inspections seek he's garage dot com\nInterpret that up for it at ... glass yeah a little ... and the throw some egos forty glass in particular that kind of seniority or lend though by be joined in their school chat\nThey stay home close but thirty queen which I got asked just part of them will see ... ... ... like a book I didn't see that one senator ... by the state the soup on me\nBut I and it's in your own land ... it's ... and most most seek a day a loophole by ... [noise]\nReally goes ... most mostly early brown ... you know we'll see how they will be couple can ... the guy to listen to music music interpreted by artists from Puerto Rico are ... artists\nWe we'll start with ... this is a group of artists who not only composed songs but of course they also interpreted their own songs practical and Bailey this comes from the CD ... book or the phone call we will listen to the title cocked\nThen music by one of my favorite artists from what thirty call early brown and then music by roll the gospel [noise]\n\n\n\nDone not just [noise]\n\nStreaming up the road with public radio was flooded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that would roll it for fall gee C. V. S. dot org\n[noise] not really low\nTo learn more [noise]\n\nYou know just being able to learn around\n\nGuy\nDon't know\n\nAn adult\n\nNa na\nNa na\n\n\n\nNa da\n\n\n\nStreaming of New England public radio was funded by you and they tell you a ... graduate schools MSA creative non fiction writer enrolling now for August twenty seven applications that they pass dot edu\nNot an option\n\nDa\n\nDa\nDa da na na na na\nUnderneath the here\nTo do\nThat in\nThere [noise]\nAnd I don't\nKnow I\nBad guys\nThe bank and [laughter] [noise] [noise] [noise]\n[noise] Mm Mm\n\n\n...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences at psychology A. I. C. dot edu\n\n\n\nThen\nThen [noise] [noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n\n\n\nNo no no\n[noise] [noise]\n\n[noise]\n[noise]\n\nOh\n\nNo\n\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment at the house catering hotel north Hampton dot com\n[noise]\nMm\n\nMm [noise]\n\n\n[noise] [noise] Mm [noise] mhm Mm\nMhm\nSo can I buy to set up I got from my beautiful country bagel from they were going up north we will listen to music from Minnesota or not by the group but jail from there we're going farther up to Central America with ... from ...\nAnd then we're going to land in Spain with music by get ... and a also an artist who would be playing with them from Africa from money the money do you have a happy now in this particular CD\n[noise] the money that they would be paying the manly and Cora he's a master at this instrument the quarter is on\nAn ... that looks like a ... and it has plenty one strings us so we will have a chance to listen to\nBritish bassist Danny Thompson and from Spain one and we'll send me got to cut them on a two brothers who would pay their flamenco guitar horse they thought that we'd be playing the regular guitar and\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\nThe marine by our money by your will have a chance to listen to it and that is also played by ... by the end that tastes so many schools get by not fought it shall we start with an outback\n\n[noise]\n[noise]\nYeah so in\nThe ...\nThat in New\nReason\n\nI'm\nSeeing\nThe legacy is\nBeing the\n... yeah\nOur being me\nNot been sunny dog\nHe gives you love and the gamble they\nThey ... sees\n\n... reasons\nYou know seeing\nThe legacy is going\nTo be seeing me though\n[noise] [noise]\nNot being done\nStreaming of New England public radio was funded by you advocate that university graduate schools and asked in higher education administration enrolling for October twenty second applications that they pass dot edu\nO. V. gave only\nDay ...\nCheese\n... maybe\n...\nGetting me\nThe late ...\nAnd I don't mean to me\n\n[noise]\nThe da da\nAnd\n...\nAnd\n...\n\nDreaming of New England public radio was funded by un cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\nBubble\nCan you do\nYou do\n\n[laughter]\n\n[laughter]\n\n\n\nStreaming of New England public radio is funded by you and cute rental architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\nWell now there are some that they are so good and the\nOne that's like the honest to judge them up but then you\nKnow set get for low pay but up and then they\nSee the point that may be one of those who said deal\nBoy me there's the Lucille Ball may I ask how old are\nYour enemy fire lab but as soon as they said well we'll\nGet DNA lane assume one don't do much to do\nGo most of the key to that and so um what do they\nStill sell saying that a\nVoice ... then", "year": "2018", "show_name": "Tertulia", "city": "Amherst", "day": "08"}