{"month": "10", "state": "FL", "station": "WHPT", "content": "A Harvard researcher David Sinclair reported that resveratrol counter acted the negative effect of a high fat diet in mice by thirty percent\nNow given that most Americans seem to be on a high fat diet\nThis was pretty darn interesting well later research goes on to show that resveratrol had a very positive effect on a number of interesting things like blood sugar levels like normal cell growth and it even seem to protect the intestines and the colon it definitely supported normal ... activity in the body it improved indoor ends\nThere was even a great study at the Institute of genetics and cell biology in France that showed that it dramatically improved enduring storing aerobic activity\nAnd it even proved to support brain function great study from Weill Cornell Medical school in New York I was just reading that an even neutralizes free radicals but the reason the bottom line reason mark that it's all over the news nowadays is research at Harvard\nThey found that caloric restriction eating less actually slows the pace of aging and extended the lifespan in laboratory animals by forty percent\nWell whenever our health is threatened any perceived to health threat like not eating enough caloric restriction your body feels threatened this switches on what they called the longevity gene in your body it switches on sort of a protective mechanism that begins on a cellular level metabolism changes your\nAbility to adapt and coat dramatically changes as a major positive influence on growth hormones and stress hormones there's actually an increase in repair all of this switched on by a family of genes we called sirtuin but here's the Cape\nAccording to the work done by David Sinclair at Harvard no this is important\nThe most potent activate or of the sirtuin genes in addition to caloric restriction is resveratrol and a great hope is that what's happening and all these animal studies all these amazing benefits with resveratrol will translate into people as well\nAnd this is why millions of people all over the world are now taking resveratrol pretty much every day\nWell this is amazing but let me just step back for a moment I Know you've been working with purity products for several years of their co Q. formulas but now that your co enzyme Q. ten which is just as important as reservists role especially for your heart healthy and you'll see some ways it's got even more evidence behind so let me ask you this who needs to ten ... what exactly is it good for\nWell first of all let's take a quick peak or what a co enzyme is\nA co enzyme has any substance in the body that speeds up the rate at which a chemical reaction takes place it's like a vitamin in many respects\nWell co Q. ten is the nutrient that is responsible for the energy that's the key word the energy that supplies your brain your heart your liver your kidneys in fact we need co Q. ten to literally convert all the food we eat into\nEnergy wow that's amazing yeah well that's what it's all about not only that but it's a very powerful anti oxen\nAnd I remember Marc let's go back to Nineteen sixty three that's awhile ago while I was teaching for the first time physiology and nutrition and I remember speaking about co Q. ten at that point and that this is Nineteen sixty three\nAnd at that point it had only been discovered six years before Nineteen fifty seven at the University of Wisconsin where they were looking for what makes the heartbeat they were literally looking at heart and saying\nWhat is making this darn thing beat well they found out that was co Q. ten\nAnd that co enzyme Q. ten supplies that energy in fact by Nineteen Seventy eight a British biochemist named Peter Mitchell wins himself a Nobel Prize for describing what he called the bio energetic energy created by co Q. ten\nSo we could say it's so important because your energy is related to the amount of co Q. ten in your body and without an adequate supply of co Q. ten you're living in what we call an energy deficient state your heart needs co Q. ten\nIn fact the highest concentration of co Q. ten in your body is right in your heart muscle\nYour brain needs co Q. ten at all times co Q. ten supplies energy not only to your heart and brain but to your immune system it supplies energy to your lungs to your liver so needless to say we need all of this energy\nThat case is that as we age and this is unfortunate levels of co Q. ten fall we lose this vital organic energy now in fact the research shows by the time you're eighty\nYou got less than fifty percent of the co Q. ten and your body as you did when you were age twenty wow yeah it's really quite dramatic so I Would summarize co Q. ten by saying it's what I call it daily essential\nI mean you could eat sardines and mackerel and peanuts we're co Q. ten comes from but\nIt's not going to be enough just from your diet\nWell documented I just didn't you told the already that'd be quite a bit of research and it was time to combine these two degrees to cook you tune and the reserve several snow why he's proud of is cutting edge combination purity calls it they're huge super boost formula what can you do for people\nWell its energy I mean the combination of these two incredible nutrients resveratrol and co Q. ten in fact\nOne of my students called it the advantage I like that so I adopted the term\nIt's combining to amazing nutrients unto themselves which a spectacular but when you combine them indeed this spectacular this if we can call it that this is enhanced this advantage this cardiovascular advantage the cardiovascular benefits\nBenefits to your brain function and cognitive performance it even is involved in healthy aging and it's important for supporting immune function it's great for your skin it's great for energy and enduring and aerobic capacity and as we said before\nIt supports normal ... activity throughout your body\nAnd I think this is the ultimate combination not remember mark as we said the energy in your body is converted by co Q. ten add to that the benefits of resveratrol this combination it is on the boat and indeed you get as my students said this real advantage\nBut it's interesting you know we're talking with Dr Allen president know that you tell me more about the consequences of being co Q. ten decision\nYeah well that's really interesting you know one of the assignments I gave my class awhile ago was to create a co Q. ten the fishing\nThe questionnaire in other words if you're going to give a patient a questionnaire to determine whether or not they had a co Q. ten deficiency what questions would be on the questionnaire\nWell the first thing everybody agreed on in class was a feeling of being run down feeling for tea you know I hear I'm running out of gas I've got an energy crunch my batteries are a lot you know like that\nSo basically a lack of energy a lack of stamina and remember we need a constant supply of energy to live and to thrive and co Q. ten is that Cain nutrient involved in energy production\nBut the point is you don't have to have these symptoms to supplement keep in mind that co Q. ten is crucial for your general energy production\nAnd as we said it diminishes as we age\nAgain we're talking with Dr Alan ... no I Want you to have a pencil and paper and a pen handy if you're listening we're going to give out a phone number here is just a few minutes purity products has a tremendous offer on their new co Q. with was very troll formula\nAnd I'm going to give out that information and the few minutes we'll get a pencil or pen ready right now let's continue our discussion with Dr Allen precedent now I Know you've used in recommended coke you tend to patients your patients for decades in your practice but now the story is better we see in abundance of research merging Henri spiritual\nHarvard researcher ... spiritual for stamina endurance healthy aging so you tell purity to combine the spiritual blended with the co Q. ten you tell purity you want them to give away a full sized bottle for free and they finally agreed to that\nBut how would you just still the benefits of you had to list been at the top three or four reasons to take this formula what would they be\nWhoa you know I don't know if I could do three of four mocked but how about ten or twelve\nReasons and that was to\nNumber one without a doubt the energy the door and stamina I mean just stopping there my gosh I Love that you know I mean who wouldn't love energy endurance and stamina\nBut there's more physical performance cardiovascular protection cardiovascular benefits but as we go down the list I'm going to talk about immune support I'm going to talk about increase anti oxygen levels in your body would protect cell membranes and end some addict function\nAnd there was just an amazing article on co Q. ten ability to decrease the rough innocent fine wrinkles and your skin it's an amazing combination so I Can't give you a three I gave you a little bit more than that\nWell All right even better but regarding new co Q. ten plus was very tall blimp purity products how many glasses or read one is equivalent to how many would I have to drink a day to get the same benefits\nWell I Would say two to three classes a day\nAnd that's what you see in the Mediterranean diet\nYeah that's what you see exactly in the Mediterranean diet but I got to tell you personally I couldn't handle that maybe you\nCould well I don't know but I\nHave to drink a glass of red wine a day\nYeah talk to me about how many capsules I've got to take when they do take a multi um got other vitamins I take I take fish oil\nWhile you just need to take too soft shell a day and that's really easy to take in the best time to take them as writing for a meal so you can take you know one before breakfast one before lunch or you could take them together but all you have to do is take too small soft gels right before a meal\nWell now Dr personal on a pause for a minute remind listeners about this amazing free bottle offer that's going on and how can we afford to give away a free bottled today with all these cutting edge ingredients in it I mean this is a full sized bottle right\nNow and let's say until you try this unique combination of the one hundred milligrams of co Q. ten the advanced research all the way you find them and purity cue super boost formula that you won't know what you're missing but explain what you mean by that\nWell I Want you to experience it I mean I Know you've heard about how co Q. ten and resveratrol and B. twelve and vitamin D and by the way there's even some vitamin a and this amazing formula how they all work together to create what I call the environment of energy and your body\nNot only physical energy mark but mental energy indoor instant stamina I mean who wouldn't let me raise your hand if you don't want to energy endurance stamina\nEverybody wants it absolutely I mean come on and this is a great way to do that and I said ... you know let's held him about it and let's let them experience it for themselves well\nAbsolutely must have been fascinating but Dr presents for people who were tuning in late having a quick recap here what exactly is co Q. was very ... super formula who needs it and why is this in your opinion the next generation of co Q. supplementation and how to steer these free bottle offer work\nWell look I think there is a distinct advantage to having energy endurance and stamina and if we were going to isolate the nutrients and create what we would call a daily essential and somebody gave me the assignment list the top five or six nutrients that we need to literally give us energy\nTo build endurance to bill stamina I Would lift the following nutrients\nCo Q. ten resveratrol the twelve and vitamin D day this is the advantage as we're speaking about\nAnd rather than going out and buying all four or five of these different nutrients you get them all in one with the co Q. daily super boost and the idea behind this is you take two a day\nYou see how it works for a month and you'll find that you're going to be on the phone calling to order more because you're going to have a lot more energy just make sure you're in that first thousand of the day today and get a free offer that we've been talking about\nEthical or one thousand I understand the daily offer expires so don't miss out\nWell we'll give it a number of the moment Dr precedent is always a huge pleasure always interesting talking with you thanks so much for joining us today marks my pleasure\nWhy appreciate it now one more time had the pencil and paper handy right this number down it's one eight hundred\nSeven three six three three three one eight hundred seven three six three three three\nThat's the number I Want you to call its toll free operators are standing by purity products recognize leader in the field of evidence base nutritional solutions\nAs an incredible free bottle offered today on their revolutionary co Q. ten plus ... super formula\nNow here's the deal be one of the first thousand college today and purity is going to rush you out of free bottle of their co Q. super boost so you can see and you can experience the power of co Q. ten and reservists role for yourself you paid just for shipping only four Ninety five\nAnd a shipping is a hundred percent refundable by the way\nSo wherever you are whatever you're doing made sure you're one of the first thousand college today and lock in this free bottle you'll see you'll be energizing power of purity co Q. super boost in every single cell in your body\nAnd you'll be glad you did this product to try to remember when you think of coke Cuba's ... the cardiovascular health see cognitive and brain performance and think energy and enduring co Q. ten is the body's natural catalyst in the production of cellular energy\nAnd was there a troll you experience your means and benefits of the key red wine molecule would you been seeing all over the news lately so don't miss this chance to pick up the phone and call now make sure you one of the first thousand callers today to qualify for the special radio offer\nThe free bottle of her expires at the thousand in first caller home now\nOne eight hundred seven three six three three three\nOne eight hundred seven three six three three three\nYou as we age co Q. ten levels decline as Dr punishments that get it back with co Q. super\nIt's just like thousands of satisfied purity customers do each and every day you see and more importantly feel the difference this is not available in stores and it's not available online the ... website only right here through this special offer\nLimit of one free bottle per household that toll free number again one eight hundred seven three six three three three one eight hundred seven three six three three three calls right now operators is standing by the call is free one eight hundred\nSeven three six three three three one eight hundred seven three six three three three\n[noise]\nThey're proceeding with an advertisement by purity products the famous have not been evaluated by the NBA this product is not an end to diagnose treat to prevent any diseases\nLengthening the one on the side of the mountain home with me in front of my count to ... have a great weekend in may ... Monday and every weekday morning things\nThan you know and now he's in one way when he was the ...\nThe following is a paid advertising by purity products these statements have not been evaluated by the food and Drug Administration this product is not intended to diagnose creature prevent any disease\nWelcome to the nutrient addition my beauty products giving you special insight into the world um health and nutrition now here's your hose Steve summers we have a breaking\nStory I Want to share with you to David let me start out real quick by asking you just a couple of important questions especially if you're over the age of forty now if you answer yes to any of these then you're going to want to stay tuned to the show today does occasionally lower back pain slow you down would you like more joined flexibility\nAnd what about less every day inflammation\nAlright if you answer yes to any one of those questions today's breakthrough is going to really resonate with you so I I Want you to stay tuned to the show today there's even a finished product clinical study on this very formulation you don't see this every day I'm really excited about this when\nMr jammed limited for this president of purity products easier to talk about this new herbal technology that is changing people's lives Gen lemons are welcome to the show\nSteve it's so good to be here this is a botanical technology\nThat is transforming people's lives as the we didn't just put this formulation together and borrow some science we did a finished product clinical study on this formulation before we even brought it to the market so I'm excited to share with our listeners this really terrific story today\nWell let's get into a gym you've been president of beauty products for over twenty five years now purity as a leading innovator in the field of nutritional supplementation since the early Nineteen nineties so you guys are learned a few things along the way I Know that dozens of formulations out there for joined comfort joined function joined a health\nBut and this is important virtually nothing out there for both the joints in the lower back why is that a big problem in your eyes to you\nSteve in a nutshell if I've got lower back pain and I will tell you I Know a few\nThings about every day lower back pain has an active athlete as a businessman as someone who stands in fits and walks in hikes and bikes and gardens I Know a few things about every day lower\nBack pain there aren't formulas on the market for people that struggle with lower back pain and why would you want to take a formulation that's good for the knee if the back is what slowing down so with this in mind Steve\nI like to say that we decided to do something very very pro active we went out there and a over a year ago we sponsored a clinical study\nDouble blind clinical study placebo controlled\nWe've brought in dozens and dozens of people into the laboratory and we said let's do a clinical study on herbal ingredients three scientifically formulated ingredients and see what can we do to produce lower back pain over eighty percent of the people in our listening audience today will suffer through some kind\nOf every day lower back pain issue\nAnd it's a big disturbance when it happens at some point in their life\nTo date the information is back from the clinical study and I can tell you we've got something that is a game changer\nWill change and I know exactly what you mean my lower back pain isn't that great either I mean that's one of the biggest issues I have to work in the yard ... as you do a little gardening I Believe and pickle ball walk with my wife around the neighborhood and I got to tell you my lower back it it can slow me down a little bit\nBut I remember reading an article the other day that Americans spend a small fortune\nTrying to manage their lower back pain do either right\nSteve when we look to the archives and look at the numbers it's pretty startling we spend as Americans fifty billion that's with a\nB billion dollars a year\nTrying to fix issues related to our lower back pain\nIt's the second most common reason for seeing a doctor and we're not trying to talk about acute situations have lower back pain things like bulging disks Ernie Asians know go see your doctor if you have that but today we're zeroing in on what I like to call every day lower back pain back pain\nThat's associated with things like daily living activity exercise wear and tear over exertion and so when we look at the sum total millions and tens of millions of people struggling with that kind of back pain it really is an epidemic\nLike we said there's very very little finished product lower back pain clinical data there is not formulas you can go out there just for that and so we decided to do something and make a difference\nWhen the study came back Steve that I was referring to on our ultimate lower back release formula the researchers were startled that we spent quite a bit of money this close that's close to a hundred thousand dollars but what we learned\nI'm going to give out that number again in just a few minutes but I Want to bring Janet lemon president of purity products back in here and I think the big takeaway from today is eighty percent because basically eighty percent of us are going to be dealing with back pain at some point in our lives but the thing that we have to deal with every day the slows us down due to wear and tear and aging\nYou say that that's the kind of lower back pain that you guys having your crosshairs and purity products connect the dots for us and why is that on your list and and how does that relate to your favorite assessment in the city that you guys conducted\nYeah Steve I Want to connect the dots here in I suffer with lower back pain and now I Am on them and I am so excited about that I Know because\nI Do a lot of exercise I play golf I'm Out there I'm busy I like to walk and hiking bike so I can tell you it's working but more importantly I knew out there that there's nothing the average consumer can look for that backed by clinical research for their lower back pain\nAnd if you have lower back pain why would you want to take a supplement that's tested for need paying it may not work for you who's got time for supplements that\nDo not work so let me go to the research here I can tell you that\nOn a zero in the study and this was my favorite assessment almost none of the men and just a few of the women can touch their fingertips to the floor by days thirty eighty eight percent of the men and sixty seven percent of the women who were taking the ultimate lower back release formula could touch their fingertips\nTo the floor so Steve we know by virtue of this game\nAnd flexibility that people were feeling a lot better with their lower back pain interestingly on another assessment where they checked out back pain while walking eighty eight percent that the people in the study got a clinically significant benefit for reducing lower back pain while they were walking so\nThis new ultimate lower back release formula it gets the job done we kinda nicknamed it believer because when you see an experience with this can do for you in just two capsules that day\nYou were going to become what we say a believer yourself\nYeah and I want to back up just a second here in the three botanical ingredients in here are widely used and backed by thousands of studies especially with courage human and interestingly there are benefits here beyond just lower back health and joined flexibility we know that courage him and his grades in the liver\nGreat for the brain very healthy to promote healthy lymph nodes in the body like helping cholesterol triglycerides so we're talking about a formula that goes way beyond just benefits for the lower back\nTalk a little bit about the white will barred for a second to standardize extracted you guys for cured for this formula I understand that if it came in like number one out of ten thousand in a screening once that all about\nYeah Steve these are almost like immortalized the chemicals I mean when we think about Kirk human\nAgain Kirk human is very healthy for the lower back and we document that but when you take this Steve it's kind of good for your back but there's so many other side benefits think about Kirk human being great for the brain being great for the heart being great for the cholesterol triglycerides and liver so\nThat's important but another ingredient in your maybe it's a little more obscure than Kirk human is that white willow park and the standardized white well a bark when they did a study and this was done at Cornell University they screen ten thousand plant compounds looking for anti aging properties\nBut number one plant compounds out of the ten thousand they screened white willow bark extract when they tested this on the single celled organisms they were able to boost lifespan by four hundred and Seventy five percent so\nWe don't know what it's going to do in terms of boosting human lifespan and we're not here to make\nClaims about life span and longevity but we do know for a fact Steve\nThis is white will bark and incredible compound for managing inflammation managing aches and pains\nWe know that it has a wonderful history and that what it's doing in the human body to relieve people who suffer from back pain is absolutely off the charts I mean when we put together that short\nFor men and women and we asked him to touch their fingertips to the floor and it's like eighty eight percent of the men and the vast majority of the women to touch their fingertips to the floor\nAfter thirty days and virtually none of them could at the start of the study and we try to put the chart together it was like the results were off the charts\nFolks we got good news purity products as a free bottle offered today on their new clinically studied formula called ultimate lower back release formula now biz reduces ends and pains will boost your joints and lower back flexibility\nIt even helps manage every day implementation so you can do the things you love to do and just enjoy life isn't that what it's all around again this is an unbiased three get one free or a buy one get one free\nIs really better than that it's a free bottle\nSimply gold purity products right now pay four dollars Ninety five cents for shipping and handling and you get to claim your free bottle\nSee one ultimate lower back really formula can do for you in just Fifteen short days folks double your shipping back to if you're not completely satisfied it's that simple what have you got to lose call now here's the number one eight hundred\nFour hundred and Twenty one Seventy five\nThat's one eight hundred four hundred Twenty one Seventy five call now because these move fast\nOne eight hundred four hundred Twenty one Seventy five I Wonder welcome back Jack Lemmon with is the president of purity products Gen the best part of these shows is really telling everyone how purity drives innovation in the nutrition industry\nYou guys you do it the right way your backup your formulations with clinical studies\nTake a moment here and recap some of the highlights of the ultimate lower back really formula clinical studies real quick for our listeners\nSteve I take nutrition seriously and I take the nutrition of our customers very very seriously and I will tell you this\nI Am kind of sick and tired of people thinking that if you go to the store you go online and buy a formula that's making all kinds of crazy claims that it's going to deliver\nBecause if it doesn't have the science behind the ingredients and ideally why wouldn't it have a finished product clinical study then why would you buy that product today and why would I wouldn't\nTell my mom and dad to buy that product I wouldn't tell my customers to\nThat's why we stepped up today and we over a year ago focusing on the lower back and join relief and lower back relief we said let's invest in a clinical study\nAnd let the chips fall where they may Steve not every study we've done this is kind of top secret\nHas had a very positive results sometimes it does it and then we don't bring the product to the marketplace because that's at the marketing and that's the kind of integrity\nThat we have a purity products so when we did this study and it came back to us just a few months ago we sorted through we had our PHD's statisticians tell us what does this mean we realized that\nThe results were spectacular and that's why I kinda so excited nearly all of the people taking the ultimate lower back release formula experienced benefits\nAfter thirty days about half the people got benefits as quickly as Fifteen days and the benefits were transformative they weren't just modest or mine or they were clinically significant\nWe know that about half of the people at a Fifteen can touch their fingertips to the floor almost none of them could on days zero work day one of the study\nBy the end of this study the vast majority of women and eighty eight percent of the men could touch their fingertips to the floor I kind of joke around Steve that this open that lower back release formula it's a little bit like flexibility in a capsule I mean I signed up for that\nRight exactly gym again just a couple of minutes left here I Want you to talk about why you call the ultimate lower back really formula really your everyday plant based solution for pain relief I mean would people live aches and pains out there and they often don't know where to turn and then there's the stomach issues too if they picked the wrong thing\nHow can ultimate lower back release formula help in in this department Jim\nSteve it's exactly what you said if you take the wrong thing off the shelf you can have side effects that can be kind of abrasive too the stomach and it might be something that works a little bit but man I don't want to take it every single day because they know there are side effects that could potentially be harmful so\nWhy wouldn't we want everyday plant based pain relief that can work for us that's reliable that's effective and that's very very wholesome and healthy the ingredients in our ultimate lower back release formula the patent it see three Kirk human\nThe patent it Boswell you extract the white willow bark and the little bit of the twelve this thing or just a combination is an\nAll star inflammation combination that's gonna work to relieve pain in your lower back\nPain in your knees and joins it's going to deliver incredible clinical benefits\nAnd as soon as Fifteen days you're going to be walking tall your spine is going to feel healthier you're going to kind of have a new lease on life and we tell people the ultimate lower back release formula is going to help you feel better\nEvery single day and it's designed to be used every single day to fight the aches and pains and the inflammation that slow us down\nWhat a story today general almost out of time we've got plant botanical here that can help us feel healthier more flexibility less aches and pains and you take this every day so you get the benefits every day and it has a clinical study backing up the benefits here ... what's the key takeaway from today's show\nToday at its core we have a real story about real\nWholesome plant based ingredients\nNot what that looks like that and I don't know I Know it's terrible is going into a by week having just lost the game and then getting ... like that by weakest not going to be fun\nNot oh no you're you're not taking off you know how to use that vacation time well\n... a member I used to hear a Green Bay would be ... by week and they would win the game on Sunday and then the coach would say I'll see you next Monday\nThat means the money so they got a whole week all little sees anyone so a subway says well see you guys on Monday normally then we're going to come on a Wednesday and Thursday or practice friday and a scrimmage on Saturday I'm thinking\nWell actually getting more and we would have been a regular we so we didn't bodies and catch up\nDo you hate sand why should you know I didn't hate so much I just um he was wishy washy yeah like I like people to tell me how it is and and that's going to be the way it is he would say something and then he would waiver uncle Bob's on the worst yeah been totally does you would say it's the way it is and I swear to you a hundred percent of that\nLike someone would say it's time for us to take off the pads we look wore out you're on a part of the season to take the pads off and that's when we won a couple of games right and we lose a couple of games we put the patch back on yeah I mean why my less hurting now than I was I should have to victory\nPot pie just asked me he was saying that guy from the sea hawks got her without a contract and plays for next year to you know\n... or ... Thomas last week said to reporters I'm not ... I have a headache he goes on nobody takes care of me here right so if I had not practicing and then it gets cut it off\nSo you think he feels like he's like a I'm hearing on average ... and beyond Holly or again a party I'm\nThat anyone can yes uh been good morning ever question for him\nYeah you know how do you feel about the strategy a zeta up pick it up the drive now\nUh I you know I thought it was a good pick to begin with and then I had a long long conversation would warrant sapping once I looked at me he said to me you can have a C hundred and fifty pounds guy in Florida it's too hot it's not going to work and then he tears as cats in the first practice and then he goes out in the fourth game and looked like a big fat\nOut of shape defensive tackle right now warn is one hundred percent right and he doesn't look like a football player not yet you can't you can't come in as a rookie not go through training camp insert them into force game I think there's going to be effective it doesn't it doesn't work that way\nDo you think that he'll come around you have potential not\nDoes you know there's no catching up in ... it was in training camp is actually got to get seasons like the work he's got to make all those mistakes and nine and seven and pass rush he didn't do any of that yeah\nAnd once you season starts and I'm a guard and your play across to me that's not when you're supposed to get better I'm a I'm not trying to be bagging like it's a a game right myself so it's\nI think offensive line as hard as position to play 'cause you can't use or anything if you can't grab them or even ... yeah but I mean you're not supposed to the level do you have to yeah you\nCan't block someone as old as you just got to know how to hold them right that's important you see this little ... here I Am a district here if I get my hand in there\nYou're done yeah by the way until they until they see it open\nThey will see it really the only way you get caught is if somebody's trying to disengage you're you're dragging or do you have somebody held in front of you you can do whatever you want yeah all the hold instead of a\nGuy [laughter] it was a holds on to their all do that they ask you how to feel your pain\nI Want to eat one is the way I mean when you can't you\nCan't do this what does that give give you my mom's not like you're learning possible to have you do this originally ...\nYou're going to be like go buy lots of that man with that and I like getting hit by a\nTrain when Reggie White jumps up by you\nHave to you have to slow down yeah you have to slow down and then go for right rich Reggie strengths were my strength so I'd never really struggled against them okay then\n\nNa na\nNa na I'm going to go to a particular song\nA long hard and I you know\n\nThose\n\n\nKnow\nAre well how are ya\nMarket deep on this one\nYou know I'm a lot more I guess by them you know more than\nThat\nI don't want\nTo do that\nWell currently I don't like this is Brittany ... and you know\nOur own middle oh man I listen to your little every week but I'm here to learn the knowledge is good I ... usually challenge us one day we can't be ... very big muscle memory all hip hop hip hop but I mean\nI mean I could go you know you'll give me my band yeah I Do pretty well funk okay yeah I didn't go deep at all I'm On the surface would be bad pretty ... you're right about substantially deeper than\nThat I I but hip hop I can go pretty yeah ... ... give me some olive oil shop idle idle gee the bulldogs are\nAt oh gee and the bulldog gee no no idea I couldn't even imagine that they have it hits on what it's called well in my view of relatives you know right when you play it or their most popular songs yeah oh is that with uh\nYeah this is the one song that Asia ... and ... ... you know is orange ... apartment when it comes\nProtecting the lives of wanting to mayor Afro American then all of a sudden uncle than become very conscious of legality\nThe gallery the our job to go there\nThe dirty mouth [noise]\nBecause if you're black you get my political writer or a trolley all truth just like to talk to\nThat the double maybe do with Mormons your your wife Michele how they're blamed it on a global every ... while the media believing bucks these are people in our but white when I Can't wait\nYeah why these bad right she blog amount but all over a\nGuy who told him or white guys you know I don't know man he's a moderate live without it gets so you're going to hear it ...\nThey don't make no doubt [laughter] I ... I go on this weekend you know yet\nAh this weekend actually today I met Maloney a west have six eight other players the Bud Light friends have challenges as nice at all I've got a picture of that yeah it was good I got the uh pretty Bud Light girls with\nMe and it doesn't hurt and then I never get pretty but my girls alone I go a sub no ... there will be nicer you have been going to be nicer oh I've got a letter on\nFriday I'm actually going to that what's on the wall like there'd be a symphonic a rail the rate of Iran's over there again going said oh I'm Sorry I'm excited when I um\nI don't need to hear about ... ... prince ... go with friends actually\nThe last time I saw the one at a roof accurate delivers up one on one of the better things I've ever seen\nA but that's different because everyone is a symphonic\nBand and that's when you want to hear their rock music being done by a ... piece orchestra that surround were print joins your parents\nAbout that prince has a Little Rock feel to it that ... says I'm not a big orders for a guy but when you're playing them familiar music I\nLove you know I don't know I like classical music so maybe that would be good but not really sure or at least I don't think tiny is going to call in I'm Sorry\nOh that's okay like it was nice to hang out with guys and a static and when they get in a secular level as special by saying he was a guy okay\nWhy why are you going to a special about his regime in college he said hello Michael Carmen ... oh my gosh yeah we have to hold and she's on the road on a show about three hours in a while yeah\nNo it's okay 'cause I'm I'm working and working night so this week by what do you do um I I built a network communications technician\nI would've never guess at a millionaire or will comment and I will see used and I had a good time travelers so what do you think she looks like hot or not she is a late forties early fifties she has begun already blond hair and now she's skinny she's skinny or or no I Know\nI say I say you're a big impact on you know I say she's Seventy and a bad way and saying she's about five six hundred pounds a no she's about\nOne ... forty oh I see\nUsually two forty and she got her hair is long and black and gold granted I write Lisa\nWow now you are actually you guys are pretty good I'm actually and my I'm forty three uh-huh and I'm I'm five seven\nOkay I'll have a fifty pounds\nBut I got to find ways to do I use is you've got a fad voice you play yeah like you are clearly\nOr not but in ... in on my end your voice sounds like you've got a little ...\nNo no I I get I don't get the guy that was pretty good looking guy I hear you now have you got a Facebook page\nUh no actually I you know that's so funny 'cause I Do not like social media\nNetwork lady you probably know all the creepy stuff that they're doing to us\nEggs and back then all of that you would have been able to find tiny odd easier I think\nWell you know what I wouldn't have let it was just the fact that he mentioned you guys and you know pit bulls that are so and it was it wasn't because of that that I went to ... you know hang out with and he was just really cool\nAnd eating ...\nAbsolutely not yeah when's the last time you had good taste\nOr a friday it's really nice I a boyfriend or a guy you may well a singing the karaoke girlfriend\nOh that is that you only like the girls\nYeah I mean you know I I Love guys have always have I I tell you I may I may I may say I made a mistake and lesbian voice for federal is I'm Sorry\n[laughter] okay well you do me a favor you take care of Carmen she really needs to get a shakedown she\nBy somebody who knows what they're doing [laughter] I'll give her like a good time she's not opposed to mix it up a girl's every once in a while\nYou and your friend get our Big Roads [laughter] girl you're going to require\nTools but I uh I ... I was good talking to you\nYou can make it said okay can is instill their yeah yeah\nIt can I ask you a question in real quick sure I\nI Am a giants fan okay and I'm obviously the giants and get a laugh and they said fearful you guys up here for them so I have all night\nJerseys Pierre Paul is do you know way that I can do to like the stadium or what time you know they play or or practice that I can do they actually get it autographs and yet uh\nI Do they do when they give you access like that get lost half their game or something but I don't really want you know fast to get that type of access\nHe can't find anything with us firecracker hands are true [laughter] good luck on your bank you are by the way this is what I imagine she looked like Melissa Leo you know her\n[noise] no I just see how she would get it I think it was like buddy Hackett [noise] let us something great buddy Hackett [laughter] after the great buddy I settled on fifth is a good uh yeah too much I I don't believe that I Believe she looks like ... [laughter]\nThat's how I feel a sense of a question are you are you're not going on a cruise is that I'm not one\nYeah\nI Know uh I intended to yeah\nWas going to have a gun contact with the great Michael barrel or put me in contact with the very sweet travel girls Diane from how 'bout you the absolute ... amazed\nAnd she said well you you have a passport I said yes I Do she goes you know make sure that it's six months it's it doesn't expire in six months\nSo that I said I'll go look I don't think that's can be problems I look at it and it was expired in three weeks after the cruise which is okay yeah how'd you says well then you need to have a birth certificate or like I said I was born in Canada and she says that's not going to work she says you have to go to conflict I go through this and it's gonna\nCost five hundred a ... yeah ... called for the first of all man I gotta I caught I Know yeah nope\nSorry you're are you not a citizen\nGo to get by US DOT com and switched to the one hundred percent fiber optic network one hundred percent phenomenal\nThat Philip brought his little brother on our mission into orbit\nNo I Can't believe how easy it wants to pay hundreds of dollars in my car insurance would die Cal\nThat's that's that's I\nBelieve that guy go could save you fifty percent or more on car insurance\nPM right here on one or two sides to bone\nGet your game on aid Hooters get off the beer specials for all the games Thursday Saturday Sunday and Monday Night for fifty bucks but like twenty three I speak that he voted twelve dollar bucket to bud bud lite Bud Light orange\nGrab your friends and had to Hooters the original ... joined celebrating thirty five years for one\nOut of every three heart attacks there was only one symptom and one symptom only half\nThe wind risque everything you worked for him because he collected to take the one test that can show the early onset of many treatable diseases\nIncluding heart disease and cancer giving you the advance warning you and your doctor neat to more effectively manage your health\nSo called smart scanned today it will schedule you and your spouse for a free CD hearts should you meet the minimum requirements you do not need a doctor referral or a preexisting condition to get this critically important task and studies show that early warning of heart disease and cancer can be critical to lower your risk some premature mortality\nIgnorance is not always boy is it can be deadly so called smart scanned today and schedule your free CD hearts can it can make all the difference coal heat hungry heat six four zero six four four eight hundred six four zero six four four that's eight hundred eighty six four zero six for for\nA brain it rhymes here hosted the consumer quarterback show we're looking for partners that might want to come on our show be featured as an authoritative expert and optimize their video content with Internet marketing and much more please call or text eight one three nine one seven Eighteen Ninety four\n[noise] [laughter] yeah well now\n[noise]\nKnow is a late forties yeah with things that's probably right I was you know\nYeah oh I mean is he really didn't hear you guessing no I Know you know he was like one of those guys who live out his age yeah for like an hour is any wall that he will\nHe won't say like you ask them how old he was he always asking me on my state of mind [laughter] ...\nI was born earlier than something [laughter] while\nYou're alive when Neil Armstrong landed on the moon I've heard of it all by the way that the anniversary today oh yeah yeah ... yeah and I was wondering if anybody in the building was alive when that happened\nWho would be I Would have been alive like I wanted to talk to somebody in the building about what that must have been like ... to happen yeah but he ... he wasn't\nI don't mean to Homs that much older than I Am he looks at [laughter]\nRight [laughter] what he found one of our show yeah I mean how wonderful guy I may have like fifty one to motivate know\nWhoa who could have seen and Kelly marry well\nYes and Kelly probably you ain't huh well what year are we looking at for the nine right man he was\nA [laughter] I Know I don't know if it was I have a rich [laughter]\nIt was made in the manner on man and and meal Armstrong for one small step for sixty nine children I deem do that to light a nine to\nNine and a lot of people were alive you know I didn't know she she nine that's how I didn't know what you're out there who was the other point Seventy one later\n[laughter] oh no [laughter] ah no I was born in September of Nineteen Seventy one so it was just happened right before I was born in\nKosovo you learn from this or is that a lot of people in the building were born when it happened and Tom ...\nWho remembers watching like Joe Joe Joe ... [laughter] Joe ... do you watch the show Dr ... cast that but yeah he just got to be [laughter]\nThe lunar module way and Joe unit watching you ought to be like ten or that\nHave been telling me to come in here why are you all still my girlfriend was looking at my ... last night that I send a ended highly so many of those uh yeah I Know I Wish that I had Spanish is named had Joe said they said though his last name\nAnd Caitlin goes why does Anthony and Joseph had different names if their brothers she thought that these two are\nProud oh our eyes on you did not watch the lunar landing how'd did [laughter]\nHow old are you\nA nine ... eleven actually in school oh it was right before yeah was it at night or in the morning you remember I think it was like it was during the day you know it was I thought it was nice to know well I mean I became the first one to\n... it was a surface six hours later on July ... two fifty six I Am UPC Utah time a\nUniverse time\nWhat does that that is your time or not those you you more universal time universal time which tells me nothing because uh I think we're ... I think we're plus sixteen\nOkay so you ah why do you ... your ...\nThat would be ten fifty six am on a eastern time [noise]\nSo okay so it was ten PM your ... do you say I'm Sorry I'm your parents will you up and so I can watch this yeah you\nGotta see there's a lot and then ... what was going on now is ... is just looked like a you know I mean I just demand and it was TV yeah no\nThat is what inspires jelly is doing a video stuff looks fantastic you ought to be like nine years old now I was ... I was born\nIn Seventy one arm and I'm forty four a few years earlier than\nYou're just not by messages on his foul you\nKnow oh there are one\nYeah yeah so in a ... a couple of years older than me I write six seven years older than me why should I\nGo on a lot of five years old an old school all school going from back in the back of the day and they're going dinosaur [laughter] I'm Still kind of impact could be a A R I Want to talk to somebody ... lives in the man he saw teddy [laughter]\nYeah I saw it was very cool man it was really memorable and two things stood out most of us in the neighborhood didn't average all the time and when we get out of those small black and white when it will eat up a disloyal center much at all um\nThey are good that everybody had a TV right\nRight and they don't usually get most of them are very small and they were black and white but today is formed out as the voice of Walter Cronkite always talking and the ... year old toys that they use to illustrate what was going to happen during soy after\nAnd I think that's what kept my attention 'cause I I just turned nine in April\nAnd uh this is happening here in July limited toy rolling up the show at landing separated wherever you're going to lead a it was just really cool and then when it happened it was like the old world stocks\nI mean everywhere you saw everybody was part subtler listening to it on the radio or watching it in a store shot or something to get a glimpse of what was going on\nYeah boy it isn't it funny how things come full circle tidy you didn't have a TV then you don't have a TV Now still over our frontal\nNudity on a firearm a joking\nI tell you Karen good morning Karen is in the building where are you on strike as soy okay and you watch the uh the lunar landing what what were you saying how old is the time channel and ...\nLike what was the thought of a ten year old that here we are on the moon\nSurreal it was surreal illegality and my brothers and I went outside and look to the moon and thought you\nKnow how in the hell did they get up there\nDid you think while you're watching it that uh that aliens are going to be there waiting like when we go to Mars and we will look at the pictures of the rover I'm just waiting for the time were deceived alien walking around like oh my God or that are already yeah Lloyd at it and\nI don't remember that what did you was there nothing\nSo that seemed like a big waste of time you\nIt was very cold it was very cool you know and then everyone\nIt's an astronaut sure sure\nI ... you are ... um I I just I Would wonder watching it I Wonder uh what would be there when they get there well\nYou have to think of back then I Ellie and talk and all the different space travel as an as prevalent as it is\nParts ... people that that will no well\nYou know participate enough out of our stores last was less minimum ... this was a supply for instance thirty one Eighteen\nAnd now I thought from Geico motorcycle\nIt took Fifteen minutes to purchase the gas station egg salad [noise]\nEat the gas station egg salad and regret the gas station ... as you presented numbers\nTo the board [noise] to add insult to injury you could've used those Fifteen ... minutes just what's your motorcycle insurance to go into\nA [noise] guy got fifty minutes good safety Fifteen Percent or more on motorcycle insurance\nOur show be featured as an authoritative expert and optimize their video content with Internet marketing and much more please call or text eight one three nine one seven Eighteen Ninety four\nLet me get this straight let's bring all over the state of Florida entirely nowhere else to shop except for facility here pretty much non there because who else was going to give them a package like we're giving them this is this out you're gonna miss or your store right was it ... I don't care what what's wrong\nAnd what can you come around you negotiated deal we we give it a bully bonus program of a thousand okay you get the discount you get the rebate you\nGet the ... trade and then we throw in the mountain bike and the kayak and the golf clubs hand the golf hotel right why would you shop anywhere else\nI mean even you can give me the option to people and just pretend that you bought them as well you know maybe I'm wrong [laughter] I don't\nDo it at the time I don't know how would you understand buzzes dirty as I can tell you that it's ... it's all about\nBeing ... October package valued three Seventy one eighty six point lead on this program up to one thousand dollars promotion ends up to the first twenty Eighteen to deliver details\nThey both explained to me again why we're here at this pumpkin patch in the middle of the night tells pumpkin pie is it going through the roof to he went in as white the baby so we can sell them and make a point you\nKnow like it was like give me go back to breaking into houses because so many people that just kind of think that it's putting this database you know weight gain weight from St Louis I Know boss with stealing Thompkins you're\nBanned right the sunshine between say touches signed signed a two way communication last week\nWhat is that over there that big pumpkin on now is that what I take any laws you just said Dutch side passions were\n[noise]\nTo stay away from say such houses violence to Jackson president said security systems no one base our technology for a prize costs they touch today\nAt eighty seven to three eighty six eighty to forego to think that stuck on it but yeah the ...\nIf it's chip to crack they'll buy it back auto glass America I mean one three Ninety six last\nHey you have to tell you here and ... and Don ... more from the ... and sweet show makes sure to lake and follow less on all social media everything at ... or catch a Saturday morning somehow eleven AM to one PM right here on one or two sides to bone\nFifteen minutes could save you Fifteen Percent or more on car insurance visit I said Geico dot com or call one eight hundred nine four seven auto\nHurts downtown five to nine on your cell pound law that's all\nThe way the tea Sarasota ... St Pete and now and now he's the only way she weighs the holidays have seen the\nThe following our is sponsoring and does not necessarily like the opinion of one or two point five about [noise]\nThe following a paint advertisement by purity products these statements have not been evaluated by the FDA this product to not intended to diagnose treat cue overdone any disease\nWelcome once again to help line I'm your host\nPat Campbell glad you could join us today now there's some startling information years ago the EPA conducted a study and listen to this they sampled tens of thousands of people checking for impurities in their tissue do you know what they found virtually every single\nPerson was contaminated with pesticides turbines solvency in chemicals\nSo it's a pervasive issue bottom line it's a toxic world we're living in the big question is\nWhat are you going to do about it but stay tuned Dr Levin has some nutritional inside you're going to want to hear right let me introduce Dr Neil eleven Dr Lebanese a wellness consultant he's a chiropractor a nutritionist a long time product formulate er and spokesperson for purity products that eleven walk it back to the program\nOh it's great to be here with you today pack\nIt you know I just mentioned it's a toxic world we're living in the environment is absolutely polluted\nAnd I got to tell you I'm so shocked by what you sent me this ETA fat tissue survey that basically shows that we're all contaminated by plastics and solve it's virtually one hundred percent of us in our tissue it's downright scary stuff right\nUp to literally this is a scary subject and as you mentioned that EPA attract issue survey and that was done on thirty three thousand us residents they found her beans plastics chemical solvent in a hundred percent of the samples so basically pat\nWe're all contaminated and the environmental working group Becker two thousand six found the tap water in forty two states is in Hammond aided by more than a hundred and forty on regulated chemicals pat\nThis is the craziest thing of all they do studies of them ... or blood they find dozens of chemicals in um bellicose toward blood so I mean what are we going to do about this what are we going to\nDo about this topic environment the Clintons and detoxify our systems on a daily basis that's the question so how do we do that well that's where this next generation organic juice Clinton's with our special\nLiver support when it comes in handy because it has over thirty different super foods they nourish all the cells and tissues of your body you get the vitamins and minerals to fight of nutrients that we missed when we don't get that\nSeven to nine servings at a recommended by the FDA the USDA fruits and vegetables on top of that because it's USDA certified organic we're not getting any of the pesticides herbicides ... older pure organic produce that supports all our tissues\nBut on top of that goes to work supporting the liver in its job of cleansing\nThat the talks are finding the systems you get that cleansing every single day with O. J. C. on top of that at best news of all today we're giving away free bottle of OJ seated everybody in the listening audience\nNow purity isn't saying that they're organic juice clans can fix everything but they are saying that it can be a compelling part of the solution in fact the organic juice coins is one of the hottest products purity is launched probably in the last ten years everybody knows how hot juicy news these days in OJ sea is really organic juicing made simple\nSo tell everybody about the organic juice clans and why you call it a quote unquote game changer\nOh yeah absolutely well we know that you sing it\nSleeping in age and we know it's super healthy\nBut the problem is you know it's messy and it's a big hassle it takes a long time bind that produce the clean them and that's why I created the organic juice cleanse because it's juicing made simple\nIt's the short that it's the easy way to get more organic fruits and vegetables into your system every single day pat each super size scoop it's got thirty different super food like broccoli spinach kale parsley\nBlueberries cranberry strawberries ... berry all certified organic\nIt tastes great it's got a great Barry apple brings flavor and since it's made with real organic produce when your body\nStarts to absorb these organic fruits and veggies and berries it makes a huge difference you feel revitalize rejuvenating you feel energy and it doesn't take long pet if you're the kind of person it's just getting very few or no fruits and vegetables every day you're probably going to notice the difference the very first day you use it\nAll right now is Dr Lebanon it's a toxic world out there but when it comes to consuming lots of fruits and vegetables to help the body\nPlans to feel healthy you say don't exacerbate the problem by using fruits and vegetables with pesticides and herbicides now the organic juice ones clearly helps in that department right I mean I'm looking at the label I see organic broccoli spinach\nParsley barley grass wheat grass raspberry strawberries all organic I mean this stuff's sounds first of all delicious and super healthy\nOh right I mean juicing let's face it it's a great idea but I don't like using commercial produce that's Laden with pesticides herbicides and phones I mean I Want to concentrate\nUp the vitamins and minerals antioxidants the\nFighter nutrients but I certainly don't want to concentrate the pesticides right and that's why I Love this organic juice when it's because it's organic choosing without the mask without a hassle it tastes great we're getting the fighter nutrient the antioxidants the vitamins and minerals from thirty organic super foods fruits vegetables\nBerries packed in essence we've done the hard work for you we've done juicing for you the greens inorganic choose Clinton's their farm fresh\nThere the hydrated at low temperatures which locks in all of nature's\nGoodness the vitamins and minerals antioxidants it's all there because this is made from real organic produce we're talking ... vegetables deep dark Reince blue berries strawberries apples there's green tea carriage cranberries black Haaretz ... we've done to work\nFor you pat and key this is key we've done it at low temperatures blocking in all the benefits of these all star organic stupid foods you simply add water shake it up in the free shake\nHer a couple of give you today trinket down to taste delicious and then it goes to work helping you\nKnow Dr speaking of the organic ... juicing is\nOf celery cherry tomatoes imported snap peas and strawberries each had Thirteen different pesticide residues on them each now I don't want to scare you away from eating more fruits and vegetables in fact quite the opposite is true I've been talking for years now\nI've been promoting eating more fruits and vegetables but the point is it's so nice that with OJ see there are going to choose Clinton's you're getting thirty\nDifferent organic super foods you're getting the ... the berries all the super foods and you're getting them organically the way nature intended and you're leaving behind what you don't want because it doesn't have any of the pesticides\nHerbicides or fungus arts\nNow Jill Evan we're talking today about purity is brand new organic juice cleanse the Barry surprise addition\nThis is their next generation O. J. C. is new and improved now has sixty seven percent more fiber than the previous O. J. C. plus a liver detox support blend along with a mouth watering array of twenty five different organic super fruits and vegetables\nSo each scoop is packed but this sixty seven percent more fiber that must really help to keep things moving talk to me about it\n[laughter] I I like the way you put that and you know let's face it most of my patients are getting nearly enough fiber in fact according to the journal of the American diet headaches association\nOnly five percent of us are getting enough fiber and that's a disaster because fiber promotes healthy bowel movement you know you need to have a bowel movement at least once a day that's critical we're talking about cleansing here you have to clean up their GR track but on top of that fiber motel the cholesterol levels\nTriglycerides blood sugar had a promoter healthy body weight\nYou know it helps you stay full long are so many people when they start adding fiber to their diet to actually drop a few pounds and pretty common it promotes digestion it promotes absorption of nutrients it even reduces bad breath and body odor so fiber is an all around great thing to have\nThe USDA the American Heart Association the national Cancer Institute\nThe American diet FedEx association they all promote getting more fiber and that's why O. J. C. is so great if you're not getting enough fiber O. J. C. has a full five grams of both soluble an insoluble fiber you eat the food you extract the nutrients and then you want to get the waste\nOut of your system rapidly that's what Barbara does for us\nI just want to give up that phone number so people can call us and get their free bottle the newest OJ CD organic juice clans plus the free shaker cup\nSimply pay the shipping and handling just six Ninety five and you get to try it for free also be one of the first thousand callers today and you get the B. twelve energy melts for free as well call now that number one eight hundred\nSix to eight Eighteen Ninety One that's one eight hundred six to eight Eighteen Ninety One this is organic juicing made simple every scoop is bursting with thirty different super fruits and veggies berries enzymes fight on nutrients fiber and more call now\nDie one eight hundred six to eight Eighteen Ninety One that's one eight hundred six to eight Eighteen Ninety One again one eight hundred six to eight Eighteen Ninety One now\nDouglas break this down I'm looking at the list of ingredients here and it sounds amazing I mean you've got the organic blueberries you've got the strawberries the cranberries the red raspberries you've added\nOrganic broccoli spinach kill parsley wheat grass oath grass green tea ... berry apples beach I mean even at a delivery support blend plus of full five grams of fiber this is quite a list and it's all organic right\nOh yeah I mean this is an amazing compilation\nOf nutrients all carefully chosen for this specific benefits that they deliver we're talking carrots for the eyes beats black current digestive enzymes for digestion I had a fire Lena unclear all of those blue green analogies that are super healthy for us pat\nA. R. P. M. magazine brings spiraling it as the number one super food for extending your lifespan and close relatives supports the liver and heavy metal detoxification I added\nFlaxseed important for a man's prostate good source of omega threes\nParsley is a great one it's full of ... great for the heart and the arteries but also at fights bad breath a new one that's new on the list of ... berry great for energy powerfully antioxidant and it's great for sharp focus and concentration that fend\nFor Barry is an amazing stuff so the list goes on and on and all of them were specifically and carefully chosen their all\nFish is really the only great source of these two compounds\nFish oil supplements Haitian has now become the biggest category in the vitamin business because of all the benefits all the clinically proven benefits of EPA and the ha purity has really taken a leading role because we feel we have the best product and now the best product combinations\nWith other ingredients we've combined with fish oil deliver even better benefits for people\nWe're talking with Jesus in camp resident upon a moment of purity products bottom exciting new plummet available exclusively through purity ... called the omega three super ...\nWe've got a special offered me a free bottle offers the tune we're going to be given up that phone number ... Jesus must give to ingredient number two because ... three super bill does something that no other visual upon it can do it actually lowers cholesterol\nTalk about these plants terminals explain how this works and why it's so important\nRight well I don't know anyone who is in concerned about their cholesterol if you have high cholesterol obviously you want to lower it if you have normal or healthy cholesterol obviously you want to maintain it sure well in the world of dietary supplements there is one compound one ingredient\nThat stand head and shoulders above anything else they're called plants they're all they have over a hundred and forty human clinical studies shown to lower significantly lower\nLDL cholesterol and again LDL as the bad cholesterol\nHDL the good cholesterol though obviously you don't want to lower HDL plants they're all only target LDL and the studies are pretty dramatic they show that in his little as a few weeks four weeks you can see anywhere from five to Fifteen Percent reduction in your LDL level safely\nAnd naturally absolutely no side effects very effective they've known about plants they're all since the Nineteen fifties and they work to be a very different mechanism than Staten drugs so I wouldn't tell people to stop taking Staten drugs we're not trying to position this as an alternative to Staten\nStaten work by preventing the production of cholesterol in the liver plants that rolls work differently\nThey block the absorption of cholesterol in the intestines plants their roles are similar structurally to the cholesterol molecules and they basically confuse little cells in your intestine called my feels into thinking that the plants their roles\nAre actually the cholesterol particles so that might feels\nPick up the plan sterile instead of\nThe cholesterol particles and the cholesterol particles instead sort of just get pass through your intestines in you ultimately excrete them instead of absorbing them the point is if you're on that and you can take Lance they're off as an addendum therapy to help control your cholesterol studies actually had been done to show\nThat they can amplify the benefits\nAnd of course this particular product you get obviously first off the full clinically tested amount of the plants their roles to deliver the benefits as shown in the studies\nThat something that's very important because a lot of products out there that you'll see that have plants that laws on the label may only deliver a tiny fraction of what any study has ever shown any benefit for purity delivers the full amount that you need to get these benefits\nNow Jason let's talk about the third ingredient in the formula co Q. ten which is also becoming one of the more popular nutritional ingredients all over the world's tell us about co Q. ten and why it's valuable for our health what does what does it do\nWell co Q. ten is found that every single cell in your body if they're from the moment you're conceived until the moment you leave the earth unfortunately as you age you lose co enzyme Q. ten so by the time you're in your senior years you've only got about half as much co Q. ten\nAs you did when you were about twenty now when you think co enzyme Q. ten\nOne word should come to mind pat\nEnergy you cannot make energy without co enzyme Q. ten ... is the critical\nPivotal energy component of every cell in your body Ninety five percent of all your energy is related to the amount of\nCoal enzyme Q. ten in your body without an adequate supply you become energy efficient you technically would have energy efficient cells\nSo co enzyme Q. ten delivers a whole ton Napoli of different benefits were putting in fifty milligrams a perfect dose for you to get every single day it's going to support healthy blood pressure it's great for your gums\nIf you're a person who has tender gums maybe when you floss or brush your teeth you noticed a little ... maybe a little bleeding could be a sign that you've got to co Q. deficiency coincide Q. ten supports immune function\nSupports brain health and cognitive function it's a very powerful anti accident in fact one of the most powerful anti accident\nEver discovered they're actually taking a look now at Cohen's on Q. ten and its role in exercise and muscle performance one other interesting no coins on Q. ten really has become popular in the United states as a topical beauty products you're seeing a pop up and beauty products where\nOne study recently showed up to a forty percent reduction in wrinkled zap them as little as ten weeks or so\nWhen used topical is a very potent ingredient very safe and greedy and so the three and one product we're talking about these three amazing ingredient extremely safe for a long term use for short term youth in any dosage and I don't know if you saw that report the\nOther day but basically half of Americans are taking one or more pharmaceutical drugs so I Know a lot of people out there listening already taking something they're thinking is this safe should I take it to my doctor there may be no three safer ingredients than the three we're talking about today\nNow Jason as if the super ... wasn't enough with the co Q. ten for energy the plants generals for controlling cholesterol and the fish oil for just about everything else purity is putting together an offer you see people can't reviews tell me about this great double free offer you got going on right now today to give people started\nWright Patt we're letting anyone out there give this product or a really good road test put it to the test for yourself here's how it works you just pay for Ninety five for shipping and then we'll send you a free bottle that said even the shipping is refundable by the way\nBut what we're doing today and what we don't ordinarily do with these free bottle offers that we run on our radio shows\nGive away a second free gift now we just got this brand new what we call our beep twelve easy mouth that's really one of the more exciting really interesting products that we've launched recently it's a little tiny tablets that you put on your tongue and it just melts\nAnd you get this surge of energy\nFrom a relatively high dose of\nB. twelve now be twelve is well you know how people who if someone is feeling a bit run down they may go to their doctor and the doctor may look at their blood and say oh you need a shot to beat twelve then they get the shot to beat twelve and what happens they feel\nLike they're shot from a gun they feel amazing B. twelve certainly if you're deficient and if you restore it back you can see a tremendous difference in your sense of wellbeing and your energy in your vitality\nIn how you feel well this is just a special fast melting tablet it dissolves in your mouth and a few seconds it's absolutely delicious and the idea is that it's sort of like a\nShot without the needle because you get incredible bio availability by taking it this way and then you get just that natural energy surge\nAlong with all of the benefits that beep twelve has that in many ways compliment the benefits of omega three B. twelve is great for your heart it's great for your brain from mood for easing occasional stress for managing something called whole most Fifteen\nAlmost Fifteen of a very important biomarker that your doctor may look at when he does a blood test it's related to cardiovascular wellness\nSo be twelve is what we call a a real work horse vitamin and just\nLike with omega threes too many folks out there are deficient because what happens padded as you get older you do often lose the ability to absorb B. twelve from the food\nThat you eat so age really does tend to minimize your ability to absorb B. twelve and that has consequences it means you need to take more\nAs a supplement so the offer is you get a free bottle of you know make a three super pill\nWith the co Q. ten for energy with a fish oil that like you said does everything and then these plants they're all\nThat we're talking about to lower your cholesterol and we also throw in this be twelve easy meals for an oral shot to be twelve every morning without the needle it's really when you look at these two bottles together it's really a formidable set of benefits and we don't want anyone to miss out on it\nAll right let me tell everybody how to get this purity products a leading direct to consumer provider of dietary supplements has an incredible free bottle offered today on their omega three super pill\nThe super pillage they're exclusive triple action pharmaceutical grade fish oil amplified with the power of co Q. ten and the natural cholesterol reducing power plants generals\nAnd today why they're giving away a free bottled to the first thousand callers from today's radio show here's the deal you're one of the first thousand callers from today's show purity is going to rush you out a free bottles of puts the test or you pay for shipping only four Ninety five which by the way is one hundred percent refundable then you try it and you decide it's that\nSimple even better you also get a free pack of purity is amazing B. twelve easy meals for a delicious natural burst of instant energy and vitality it's like a needle is shock to the B. twelve\nThe omega three super pill\nHelps put it back certainly you'll get all the comprehensive benefits of purity concentrated pharmaceutical grade fish oils the absolute central core of any health regiment omega threes are crucial for so many areas of your health for those looking for joint support\nThey act like an internal ice pack helping us manage a healthy inflammatory response our brains are literally soaking in omega threes critical to support the brains structure and function for the heart\nFish oils are critical even the American Heart Association once you want to make a threes\nThere's no known substance better to comprehensively maintain your cardiovascular system you'll support arterial flexibility blood pressure even triglycerides and a healthy heart rhythm and the list goes on and on the prostate skin bone density even potentially weight management\nHere's the phone number one eight hundred\nFive hundred nine zero zero one getting jobs this down even the calls for eight one eight hundred\nFive hundred nine thousand and one call now for your free bought and don't miss this chance of getting one eight hundred five hundred nine thousand more than one more time even the calls free one eight hundred\nFive hundred nine zero zero one call now [noise]\nThey're proceeding was an advertisement by purity products these statements have not been evaluated by the SEA this product is not intended to diagnose and treat the cure all prevent any diseases\nDid he knew only one here tell a kiss me telling your hair and home [noise]\nEverything is probably the only ...\nLeft by professionals hoping to everyone Sally beauty [noise]\nIt's Jamie progressed as employee of the month two months in a row\nHi Jamie hit me gave me I just had a new idea for our song let the naming rights to do it when it's like\nTell us what you want to pay hey hey hey and trombone goes why you say well we find coverage options defeat your budget then we just all these fingers NASA will acquire those statements coming out of combat jet yes no maybe anyway so you practice tonight I knew there\nWas a casualty insurance company and affiliates price of coverage match limited by state law\nFiber optics move crazy amounts of data at even crazier speed and ... is the one hundred percent fiber optic network\nWith files that connection you'll get the fastest Internet available download speeds up to nine hundred and forty ... TV phone and a two year price guaranteed all for Seventy nine Ninety nine per month on line with a two year agreement plus get two hundred dollars toward a range of Google and that smart home devices and a one hundred dollar visa prepaid card when you order online\nGo to get by US DOT com and switch to the one hundred percent fiber optic network one hundred percent phenomenal\nA robot vacuum cleaner so yeah I got one gig I suck up dirt to pardon my inferiority complex\nA guy who does so much more like not only can they save their customers money on car insurance for the guys fasten friendly claim surface to hands and award winning mobile\nPlus access to license agents twenty four seven who am I kidding I Can't even do corners of choking hazard\nExpect very savings and a whole\nHumid climate like ours so if your air conditioner is over eight years old\nChances are you're on borrowed time if you even contemplated replacing your old inefficient ac system don't wait any longer unique unique now through the end of the month unique services will buy back your old ac system for up to Seventeen hundred and fifty dollars whether it's still runs or not\nPlus get a new unit for as low as eighty three dollars a month and a free nest smart home package this package\nIncludes a nest thermostat security camera nest doorbell and Google Home many all free with your new system purchase I Know that sounds too good to be true\nBut it is true turn your home into a smart home with products value that over eight hundred dollars but you've got a call unique today at eight seven seven nine one for sixty eight eighty eight that's eight seven seven nine one fourth sixty eight eighty eight or for details visit unique services dot com license twelve fifty five fifty five\nYou notice coming from you know less than we thought were you know these promotions or we're doing it doesn't matter if somebody comes in and buys a forte or real regardless of how much money you spend you still get the one thousand dollar boosted bug promotion you still get the outdoor package of the golf clubs the mountain bike in the um [noise]\nA kayak you love that ... you don't sound like a thousand kayaking why why\nDid I like it because like the quality and I like the dice cooler build them and all those\nDandelions bottles of beer and I know of course but certainly I'll Try it out I'm a problem will problem at all get out there and do as long ago and I can I ask\nBut certainly come see us for so it was a chapel this month rocked over its huge\nPackage valued three Seventy one eighty six believe on this program up to one thousand dollars promotion ends up to over three for ... for details\nGoing to hold high one marine was last\nFifteen minutes could save you Fifteen Percent or more on car insurance visit us and die told dot com or call one eight hundred nine four seven auto\nSarasota in St Pete and now and now he's in the way was the only way he when he was\nFollowing our response does not necessarily like the opinion of one or two point five pounds\n[noise]\nFollowing paid advertisements by purity products the statements and evaluated by the FDA products to not intended to diagnose trees cure or prevent disease\nHello again and welcome new health law thank you for tuning in were brought\nTo you by surety products we've got a\nFascinating show lined up for you today but first a quick few questions number one is there a pill you can take that can actually help make you stronger number to let's say you could get stronger with the extra strength make your life better certainly make about this are you weaker today than you were say oh I don't know Twenty years ago\nWell listen if you answered yes to any of these questions than stay tuned Dr ... eleven is joining us today to discuss a miraculous compound with hundreds of clinical studies that just may unlocked the key to helping you get stronger and healthier at\nAny age now Dr ... eleven is a chiropractor a nutritionist spokesperson and a longtime advisor for purity products that eleven welcome back to the show\nOh it's great to be here with you today pat and we have a very exciting topic to cover today packed today we're talking about strengths and power and how to get it back even if you're in your fifties sixties seventies eighties so if you want to feel better if you want to feel stronger this is some very important information we're going to cover today\nYou know this is an exciting topic to talk to me about this important message today what molecule are we talking about in how it's impacting the lives of people who follow the science\nRight right right well we're talking about a new supplement it's cold every strong and it features and exciting molecule called Korea Team now pat a lot of our listeners may have heard of ... and I know you've used Korea teen right but for those that don't know about Korea Tina it's mainly use\nIn the Olympic circles professional athletes body builders\nCollege high school athletes because it does something extraordinary and what I'm about to tell you is proven by hundreds and hundreds of\nHuman studies so here's where Korea Team does for us it helps us to get stronger more powerful helps put muscle mass on the body and it helped protect us from losing muscle tissue\nAs we get older we know that's a big part of aging not only that pat great for the brain great from memory and it helps promote bone strength as well so an amazing molecule that everybody needs to know about\nIs an amazing story you can you share some of the science and tell us why you're calling Korea teen one of the best kept secrets to healthy aging\nOffshore pat what we need to understand with Korea Team is that it's a natural molecule to the body it's in every single cell tissue Oregon in your system\nAnd its job in the body is to generate and maintain strength and power that's a reason for being to maintain strength and power it's an every single cell in the body Ninety five percent of it however is in your muscle tissue because that's where we tend to use it the most the power's off the muscles it's good for strong muscle contraction\nAnd it's important to help maintain strength and muscle contractions when you're using them over and over again for instance if you're working at the gym if you're playing sports golf tennis or anything like that it keeps your muscles powered up in their high energy state so they're strong and ready for action packed\nHere's the key is is so important for those of us say in our fifties sixties seventies\nYou see we had lots and lots of Korea Team when we were young we had one of the stuff that was coming out of areas we had lots of creating our bodies made a lot of it but as we get older like everything else we don't do that is well we have less Korea Team in our muscles you know the good news is that hundreds and hundreds of human studies show that when you supplement with Korea Team\nIt goes to work or go straight to your muscles it's absorbed easily it pumps up at the Korea thing in your muscle tissue and you get stronger you get more powerful not only that it helps support memory and brain health and it helps support the strength of your bones\nYou know we were talking before the show and you were talking about how it limbic athletes have been using Korea Team for years to enhance their strength and performance tell me more\nFive eight zero eleven Seventy five that's one eight hundred and five eight zero eleven Seventy five call right now so you don't miss out just to pay for shipping and handling and even as a refundable to get your free bottle of ever strong and the free be twelve energy melts call right now operators are standing by\nOne eight hundred five eight zero eleven Seventy five that's toll free\nOne eight hundred and five eight zero eleven Seventy five one last time slowly call now\nOne eight hundred five eight zero\nEleven Seventy five All right so we were so busy at the top of the show this ever strong formula does so much for us we have an even touched on the incredible brain benefits I mean some of these studies you sent your absolutely incredible\nAs you know I'm very into neutral picks the anti aging community has taken a keen interest in Korea teen specifically the cognitive benefits of Korea Team\nOh absolutely this is one of those areas where Korea Team really shine you see what we need to understand is that your brain even though it's only two percent of your body's weight it utilizes twenty percent of your body's energy this is a very thirsty Oregon\nFor energy and just like your muscles soak up decree it seemed like a sponge\nBecause this is a naturally occurring molecule in the body it passes right through the blood brain barrier\nYour brain or an soak it up like a sponge and it increases your Korea teen phosphate reserves in your brain so now in your brain you have more readily available resources\nTo do was to recharge those neuronal batteries to make more energy inside the brain so basically what do you notice well your memory is supported and pat scientists have done some amazing research here they found that people that take Korea teen\nIts support their memory it actually helps the brain to utilize\nOxygen better it supports memory and people that are sleep deprived it's been shown to help people add numbers quicker and for longer periods of time without mental fatigue\nGet this study pat just five days five days of eight grams of creativity and supported mental tasks in subjects that we're getting rapid fire question\nScientists were asking him math questions in science questions over and over and over and they found the folks aren't Korea theme didn't fatigue as quickly mentally so this is amazing stuff it's like a turbo booster for\nYour brain it's like a super charger for your muscles are re charges all your cellular battery so all of your cells tissues and organs have more readily available energy\nOr dark I loved that ever strong appeals to athletes and people want to get more reps in the gym maybe get some extra power and their workouts but you're also saying there's a big push a nutritional community to encourage people in the forties fifties sixties seventies and even eighties to leverage their power\nKorea Team to stay fit strong and healthy like you say\nKorea Tina's going mainstream you know I share the story with you before my mom who's in her late seventies now she's taking creating she works out a couple of days a week three days a week she goes to novelist does the free weights because she's got osteoporosis she wants to maintain her muscle mass and she wants to make her bones stronger and as you pointed out creating helps to do that\nAnd then the other three days during the week she'll go and she'll swim now she's not trying to get bigger stronger or anything like that but even at her age Korea teen has benefits\nOh yeah and what blows me away about that story 'cause you told me before is\nThat her medical doctor recommended younger your team for and that just goes to show\nHow much more mainstream this is it's called every strong\nAnd it supports the muscles that supports your power your strengths your speed if you're an athlete you're certainly going to love it but even if you're not an athlete you notice the difference let's go to another study one more review study this out of the journal current aging science December of two thousand Thirteen I thought this was very cool\nCause the researchers looked at the body of research out there on creating and seniors without exercise they want to see what happens when seniors take Korea teen and they don't\nEven exercised so I'm quoting here ... supplementation without associated resistance training seems to enhance muscular string power and endurance increase lean body mass for those that don't know what that is they're talking about muscle and improve the functional\nCapacity of the elderly they go on to talk about how it supports bone health as well and then they finish with this creating supplementation without training in the elderly could potentially delay atrophy of muscle and unproven difference and strength so here again we see bottom line\n... is very very effective it's gonna help you to feel stronger whether you exercise or not it supports your strength and power your brain health\nAnd on top of that it supports your bone health I mean ... when you think about it this almost sounds too good to be true right right yeah you're a\nPerson that never heard about this and you're listening to us you would think this sounds too good to be true but it is true hundreds and hundreds of human studies back up what we're talking about you're going to love the benefits you get with this ever strong formula\nThat's incredible let me remind everybody they can get a free bottom of the ever strong formula today plus the bonus bottle of ... twelve energy melts\nJust by calling us at one eight hundred by eight zero a lemon Seventy five you just pay for shipping that's one eight hundred five eight zero eleven Seventy five will give that number out again later on the show the first judge eleven now listeners can only get ... on this clinically tested Korea teen blend from surety products right\nOh absolutely I Know it combines the Korea teen with the vitamin D the coffee buried the fruit ... be more on him for those who don't know talked about how these work so well together there's a a synergy and it's also a great value to I Know we have a free bottle today but if you wanted to buy all of these things separately it would cost a small fortune wouldn't it\nOh absolutely I mean if you went out and bought the Korea pure creed and that's a purist find this pre teen from Europe if you're both that and then you went out and bought a separate antioxidant formula and separate joined formula and the vitamin D\nIt's going to cost you eighty Ninety a hundred bucks a month but you're not going to spend that today now with purity products and your name going to spend a half that you're not spending forty five fifty because today it for your job is to be one of the first thousand callers\nAnd take it seriously this the flies out the door and the big radio stations be one of the first thousand cause you could you'd be twelve and ... and your average strong you just pay six Ninety five for shipping we want to get it right out you know we want you to try this out we want you to be the judge for yourself\nDon't take my word for it try it look in the mirror go to the gym lift some weights play do whatever you do see if you don't feel better\nAll right let's talk about how you take this you have these easy to swallow tablets which are super easy to swallow it also comes in a very refreshing Sherry Barry powder so how do you like to take and it gives people just choose the tablets are the powder when they're calling for the free bottom today\nYeah yeah you can choose tablets are powder I personally use both you know I'm I work at days are days are making a a protein shake on days I'm juicing let's face it juicing has become a very big these days so if you're doing something like that to a jury very powders fantastic could just take a scoop\nDumping right into your juice dumping pure protein shake and that's a great way to take it but if you don't do that stuff I mean the tablets are super convenient they're small they're coated they're easy to swallowed\nIt's wonderful stuff now I Know you're shopping at the bit to tell us a little more about this study the purity did on the ever strong powder they tested golfers already found out that not only with these golfers getting stronger and more explosive but they were driving the golf ball get this\nFourteen yards further that's amazing\nI have such a big smile on my face right now I'm remembering when the researchers came back and gave us information I mean we were bouncing off the walls this is so exciting the researchers called this\nA seminal study in sports nutrition and this is on our average strong formula the products we're talking about right now the ever strong powder\nSo double blind placebo control study thirty golfers took the restaurant powder for one month no exercise nothing different just took our ever strong powder for one month in one month they were banging the golf ball\nFor teen yards further ... not only that six percent more power on the bench press more explosive they could lift the weights faster\nThey hold our guys spend hundreds of dollars on new clubs to drive the offer\nSo job or you can read five hundred dollars on a driver up\nFive yards right this is for team\nYards pet people shouldn't just how how about this are you on about this this is amazing because let's face it this was a golf study but more explosive than is more speed more power this should help all sports so if you're a tennis player if you're a jogger if you're any kind of an athlete this has ramifications across the board\nBut again these golfers one month on this ever strong powder we're talking about today banging the golf ball fourteen yards further can you imagine pat you get your bottle of ... you don't tell your buddies take it for a month and you go out and you're banging the both fourteen yards past them they don't know what hit him\nWow I Would just got a few minutes left here I Want you to recap this amazing story today about Korea Team would you like to call the molecule of strike who needs it and what about this double free bottle offer today with the ever strong plus the B. twelve energy males\nYou know what at my one concern with this\nShow is that literally it sounds too good to be true right right like when I tell folks about every strong right I'm afraid they're going to think I'm making this up not possible right you know I Know how you feel because six seven eight years ago when I started to read about Korea teen\nI almost couldn't believe it I said to myself if it's really this good with an excellent safety profile how everybody's not using it but\nI started to use it and I noticed some incredible benefits it's just phenomenal and it's as simple as this you're going to get on the strong you're going to try it you're going to get stronger you're going to get more powerful you can look in the mirror\nWell you know when I look at the is there actually isn't a reason to put them all in separate product they do go very well together as you said they're all food derived so it's kinda like you can make a salad if you choose out of many vegetables you don't just have to have a bowl of lettuce or a bowl of\nCucumbers and well that's a little bit simplistic the fact is that all of these are very very rich in groups of protective compounds that are both antioxidant so they actually retired the aging process of the cells in our bodies\nAnd protect our organ systems till they maintain a healthy inflammatory status in the body and this is really a big breakthrough\nI also like the idea that people can get a concentrated supplement of green tea extract curriculum and extracting resume or a trial\nIn one product with truly meaningful amounts of each one and not have to go out and basically by a shopping cart full of stuff\nLet's dive into the headlines and the research especially on the green tea because it's absolutely amazing\nI Know when he shouldn't have been using it for thousands of years for healthy aging but what are you seeing recently in the press you know you told me the nutrition research journal and it's July twenty twelve issue revealed the green tea significantly increased\nPlasma anti oxygen activity in whole blood unify on to recap\nSome of these headlines of chill me while you're such a green tea advocates\nOkay what you just said about increasing plasma antioxidant activity is really critical there are many antioxidants that people consume\nBut don't actually wind up in the body or they don't wind up in the body in any significant amount the green tea antioxidants which we know are among\nThe most highly beneficial antioxidants in the entire world are very well absorbed\nThey improve plasma antioxidant activity that is the blood concentration of antioxidants so what happens is you get this great concentration of antioxidants substances which a protective compounds floating around in the body and protecting the cells\nOf your body your organs every part of your body from premature destruction due to exposure to environmental pollutants and things in the diet with regard to the whole blood glue to fire on when we take in\nThe right antioxidants and not all antioxidant compounds are the right antioxidants\nOur bodies produce more of its own super protective compound called glue to ... so you're taking the green tea extract\nYou build the antioxidant activity in your blood and you also cause your body to produce this enormously beneficial very well studied very powerful protective substance called glue to fire on so\nIt is remarkable this isn't something that most high antioxidant foods or supplement ingredients do but it does happen with a concentrated properly made green tea extract\nAll right let's switch gears and talk about this for human which is number two on you listen by the way these three ingredients are all found in the new green tea combo formula would be offering free bought on a few minutes we'll talk to me about the human which is spelled C. U. R. G. U. M. I. N. now most people haven't heard of it but scientists and researchers know was one of the most\nPowerful super feeds on the planet\nYou can positively influence our D. N. A. maintain joint comfort\nHealthy inflammation in more can you share some of the incredible headlines on human and tell us why you use this and we talked about this off here a few minutes ago just patented B. C. M. Ninety five formula of Kirk human which seven times greater absorption\nOkay well first of all I think well people might not know the term Kirk human\nThey may well no tumor wreck route which is a yellow spice and it shows up in curies and it's part of the five thousand year old Indian ... system of medicine I've been studying ... and its derivative ... since the Nineteen seventies\nAnd I'll say this right off the bat that they are almost no plant materials in the world as extensively studied as there's\nA couple of thousand studies can be found in the scientific and medical literature we know that Kirk human is powerfully antioxidant we know that it\nHas a remarkable capacity to protect the liver and deliver is our primary detoxify Oregon it greatly enhances joined tell so people are experiencing joint discomfort due to overuse\nThis really helps to relieve that and it's also what we called cardio protective it helps to protect the heart it helps to maintain normal healthy cholesterol\nAnd one last thing that is really kind of astounding is that ... actually causes your body to produce what are called neuro protective factors in the brain so\nIt causes your body to produce these agents in the brain that protect the actual issue of the nerves in the brain itself there's almost nothing else that we know of that does this specifically the B. C. M. Ninety five that you mentioned offers about seven times\nThe absorption of any other Kirk human extract so\nWhen you take two hundred fifty milligrams of this stuff you get about seven times the activity that you would if you took say a comparable amount of another curriculum and extract so this in my opinion\nIs one of the most life and Hansing protective totally beneficial substances on earth and it has just decades of scientific and medical studies to back it up\nChris I Know that we turn to them or do you buy the green tea in the current human in your new green tea GR liquid soft formula which purity is given away for free today but first\nTell me about the third nutrient on the list the risk their ritual which is super hot right now here was on some of the headlines and the science behind re spiritual I notice from red wine and the French love it but why is it on your shortlist\nWell Rivera trial is one of those remarkable compounds that I just said to shake my head at how many different things that does it is found in grapes in wine grapes it also shows up and cranberries what we know about resveratrol is that like\nGreen tea and also like Kirk human extract it's profoundly antioxidant\nBut more than that it shows significant properties when you look at some of the things in the body if that happened during aging as a result of fat accumulation in tissue and insulin insensitivity\nResveratrol helps to protect against those things it's a powerful immune regulator\nYou know our immune system is responsible for keeping us healthy it is remarkably beneficial for the heart and this\nIs why it's considered one of the key is to the so called French paradox you know the French drink a lot of red wine they eat a lot of cheese they smoke cigarettes and they stay slim and they have good cardiovascular health which just seems completely unfair but reserve era trial appears to be key in that\nAnd additionally there is a brain benefit\nLike there is with the Kirk human\nWith blood flow to the brain\nSo when you take resveratrol you'd get rain blood flow this means you get more oxygen to the tissues of the brain your brain cells stay healthier longer your mind is clear sharp and focused\nSo this is on my short list for all those reasons and for about a dozen more that would just plain take too long to explain\nIt again we're talking with Chris ... also known as the Indiana Jones of natural medicine sometimes called the medicine hunters well Christmas laser in on how this wonderful formula you greeted to junk purity products I Know the purity it's been a business now for\nWhat is it over Twenty years ago to top reading the better Business Bureau and people can get complimentary bottled up this green T. C. R. today we'll get that number out in a few minutes but first\nWhat does the C R D and foreign second you designed this formula in a liquid soft you why do you like the liquid soft technology so much\nFirst questions first it's called green tea CPR which is short for green tea Kirk human and or is there a troll\nThe big three ingredients that are in this product and meaningful protective amounts the recent that it's in a liquid soft shell is that that allows for rapid end very complete\nAbsorption I'm not suggesting that there's anything wrong with tablets or capsules that contain powders because there isn't but when you have a fluids soft shell\nYou just happen to get more quick break\nDown of the capsule more rapid absorption and to some extent more complete absorption into the intestines that means that your body utilizes more of the ingredients and the supplements so green T. C. R. as green tea Kirk human interest there a trial\nAnd the reason for a liquid soft shell is it's just a superior dosage form especially for the three particular ingredient\nNow of course before we tell our listeners how they get their very own complementary\nBottle of green tea see are telling me this you wanted to buy this green tea plus the patented B. C. M. Ninety five per human plus the spiritual I mean you spent close to probably least Seventy five dollars for all three bottles and store and yet today purity products is giving away", "year": "2018", "show_name": "The Mike Calta Show", "city": "Sarasota", "day": "06"}