{"month": "10", "state": "GA", "station": "WUWG", "content": "Two to four seven eight and thank you so much for your support\n\nFrom the University of west Georgia was Ninety seven FM Wu WG and W. W. H. B. Gerald Ford of Georgia Public broadcasting radio network\nLive from the G ... through my melon Reinhart the cost of building two new reactors that plant Bogle near Augusta was a big topic at public service commission debates today GBDs Steven Tyler reports\nThe SEC regulates utilities across the state including how much rate payers are charged for construction of the behind schedule over budget nuclear power plant district five commissioner Tricia pride more says plant Bogle is moving forward ahead of its new schedule\nAnd so I Would like to see us continue not just with plant Bogle but with all nuclear projects continue to build out nuclear and the state of Georgia\nWide Moore's opponents Democrat Don Randolph and libertarian John Turkish both oppose the current plan to continue construction without a cap on the cost the district five and district three debates are on our website G. P. B. news dot org for GDP News I'm Stephen Fowler in Atlanta\nAround two million Georgians are now being charged out of network rates that hospital corporation of America facilities the agreement between age the a and Blue Cross Blue Shield of Georgia expired yesterday the companies say they're negotiating on prices but in the meantime patients insured by Blue Cross will pay higher rates for exams surgeries and treatment\nNashville based aged ca operates eight hospitals in a number of physicians groups in northwest middle and southeast Georgia\nDelta Airlines says it's partnering with the pets travel pods start up is shelter changes its prices in policy for transporting passengers animal companions [laughter]\nThe Atlanta Journal constitution reports the airline has struck a long\nTerm partnership with care pod delta says the Singapore based firm will help the Kerry and monitor pets better and give real time updates for customers it's four oh one\nLive from NPR News in Washington I'm Laurie London President Trump is expressing confidence today that his Supreme Court nominee will be confirmed by the end of the week but as NPR's Scott Horsley reports Trump also says he's willing to wait and see what the FBI uncovers\nSays as he campaigns around the country he's earring strong support for nominee Brett Kavanaugh from fellow Republicans got it off as vehemently denied Alex\nHovers Trump says as he campaigns around the country ... strong support for nominee Brett Kavanaugh from fellow Republicans God at all as vehemently denied allegations that he sexually assaulted women decades ago Trump's as a hug or a nominee is fighting hard to protect his reputation and whose family\nLife fibers do what now you're guilty until proven that is very very\nSome former acquaintances Kevin ... misrepresented how much you drunk when\nHe testified last week before a congressional committee Trump's as long to Congress is not acceptable Scott Horsley NPR News the White House\nFour days after a devastating earthquake and tsunami on the Indonesian island of ...\nThe situation remains dire the official death toll is over twelve hundred and climbing NPR's Julie McCarthy is traveling with an army aid and security convoy to the heavily hit city of ... near the epicenter\nWith videos on the of what you're going to be in\nThe center of this earthquake devastation goes on as far as the eye can see it it's just a mass of sand omitted Barry buildings in the house is very difficult to believe that there are many people buried under all that it's now just laid waste\nThat's NPR's Julie McCarthy more than a million people have been affected there's no food or water and as powerful earth are aftershocks continue aid groups are urging people to stay outdoors\nFrance says the government of Iran is behind a ... bomb plot last June outside Paris NPR's Eleanor Beardsley reports that in retribution France has frozen some Iranian assets\nAuthorities say the planned attack was on a gathering that's organized every year by an Iranian group in exile the national council of resistance of Iran\nThere were several European and Arab ministers in attendance as well as former New York city Mayor Rudy Giuliani and a joint statement the French interior foreign and economic ministry said an incident of such gravity on French national territory could not do an punished\nFrance has also warned that citizens against traveling to Iran the deterioration of relations with France but I'm wider implications for Iran ... has been one of the strongest supporters of the two thousand Fifteen nuclear deal even after the U.S pulled out\nFrance but I'm wider implications for Iran ... has been one of the strongest supporters of the two thousand Fifteen nuclear deal even after the U.S pulled out Eleanor Beardsley NPR News Paris\nBut down rallied again today closing up a hundred and twenty two points this is NPR support\nFor NPR comes from NPR stations other contributors include the University of Florida we're solving for next is powered by its way into grants heritage from renewable energy for global health us students and researchers are working to solve challenges at ... dot UFO dot edu\nThis has all things considered on listener supported Georgia Public broadcasting good Tuesday I ... and just to head the Brett Kavanaugh hearings highlight\nSen Lindsey Graham's transformation from anti Trump conservative\nToo fierce a Trump supporter rather that analysis coming up in the next ten minutes but first we're taking just a few moments right now to remind you of how important you are in our ability to bring you all things considered on CPB\nListeners like you who understand the importance of being well informed especially now\nYou make the news and information that you need possible we're in the final days of our fall fund drive so right now we're counting on your support please take just a couple of minutes right now while you're thinking about it check it off the list go to ... dot org and click donate or the number to call is eight hundred\nTo two two forty seven eighty eight thank you for your support I'm here with her it was like ...\nAnd guess what we do have a challenge during all things considered today it's a thanks to the Newman's Own foundation here support now G. P. B. dot org or eight hundred to two to four seven eight eights going to have an even greater impact\nThanks so this challenge here's how it works for every dollar you give Newman's Own foundation will add an additional fifty cents so get fifty dollars that become Seventy five dollars to give a hundred dollars it becomes a hundred and fifty a two hundred dollars becomes three hundred dollars make sure we hear from you analogy TV dot org or eight hundred to two to four seven eight eight\nWhile this challenge from Newman's Own foundation is still on the table\nThis is your opportunity to get a fifty percent return on your investment in ... thanks to a challenge from the Newman's Own foundation dot org or eight hundred to two two forty seven eighty eight support for TB programs\nComes from our listeners and Callaway resort in gardens Georgia's authentic outdoor escape offering to championship golf courses the scenic Lakeview course and the mountain view course twelve time host of the PGA Buick challenge Morris Callaway Gardens dot com\nOffering to championship golf courses the scenic Lakeview course and the mountain view course\nTwelve time host of the PGA Buick challenge Morris Callaway Gardens dot com and Georgia State university G. P. B. Atlanta is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot edu\nThis is all things considered from NPR News I'm Ari Shapiro and I melted Chang when Brett Kavanaugh sat down before the Senate Judiciary committee to respond to charges that he had sexually assaulted Christine Blasey Ford visit some of what he had to say\nThis whole effort has been a calculated an orchestrated political fuel with a parent pent up anger about President Trump and the two thousand sixteen election we're joined by half of the coins\nAnd millions of dollars and money from outside left wing opposition groups [noise]\nSo what could the consequences of statements like this speech for judge Kavanaugh whether or not\nHe's confirmed to the Supreme Court to answer that question we're joined by Stephen ... he's a law professor at New York university and he specializes in ethics welcome thank you want to get a sense from U. of how rare it is to hear a Supreme Court nominee talk the way Kavanaugh did in that moment I mean have you ever heard\nSuch partisan language like that during a confirmation hearing\nAre having to not even during the confirmation of Clarence Thomas ...\n[noise] so let's say Kavanaugh is confirmed to the Supreme Court do you think that he can be seen as an impartial arbiter in cases with political undertones\nIt depends upon who's doing the fear I think for losers will not through his decision as impartial he is now branded as favoring literati over the last show and political cases so after all was stripped to lose\nAn do attribute that laws not to a disinterested treatment of the law but to a political agenda\nI mean there's this ideal that a lot of people have about the Supreme Court that these justices that this court is above politics or should be above politics but let me ask you how far removed is that ideal from reality\nVery far removed first of all their justice has been appointed by a prison\nIs that I deal from reality\n[noise] very far removed first of all their justice has been appointed by president of a particular party who\nIf he's doing his homework will be sure to a point to justice who will likely you agree with the political position of that party so while we have decisions that use the language is a law\nYou are exactly the person we're reaching out to especially now in the final days of our fall fund drive if we haven't heard from you yet now is the time to take just a couple of minutes to make your investment in G. P. B. go to our website G. P. B. dot org and click donate or the number to call his eight hundred\nTo two two forty seven eighty eight I'm Ricky ... here with me is where it was ...\nAnd right now you have an opportunity to get a fifty percent return on your investment and she'd be thanks to a challenge in effect right now from Newman's Own foundation we're fortunate that independent media was among the causes that Paul Newman first supported years ago and now Newman's Own foundation continues that legacy by adding fifty cents on top of every dollar that you get\nSo that's a additional money that we're going to receive a from Newman's Own foundation thanks to your gifts so the way the math works if you make your hundred dollar contribution it becomes a hundred and fifty dollar investment a two hundred dollar donation becomes three hundred dollars\nA five hundred dollar donation becomes seven hundred and fifty half of what you give us going to be added on top of things to Newman's Own foundation so that's your incentive to make your call now at eight hundred to two to four seven eight eight or online at ... dot org\nWe have yet another reason that now is a smart time to support CPB because when you do you'll automatically enter are drawing to win a saint Simon's island vacation for two\nThis includes a three nights staying in ocean front room at the beautiful king in print speech in golf resort located right on the ocean imagine the views\nGulf or two at the king and prints golf course breakfast and dinner for two it echo saint Simon's island\nOnly ocean front restaurant you're automatically entered when we hear from you don't put off supporting CPB any longer please go now to G. P. B. dot org or call us at eight hundred to two two forty seven eighty eight thank you so much for your support and\nPut off the ... any longer please go now to G. P. dot org or call us at eight hundred to two two forty seven eighty eight thank you so much for your support and good luck in this drawing desire a\nGlass of this American Life and we asked you to turn in your friends your family your loved ones basically any long time listener who you think should be pledging\nBut happen and you did\n[noise] hello\nHi this is Paul Paul uh this is Ira Glass in American Life\n[noise] are you joking no how's it going I'm I'm kind of a ... volt\nI I'm calling it the suggestion of your friend dealing Lee yes he wrote me an email saying that you are somebody who needs pledge drive justice\n[laughter] um yes I I'd probably do yeah basically I'm\nI feel ... I still can't believe you're calling I'm Sorry this is kind of like this kind of crazy I'm kind of study for an exam and it's just like wow\nGeeky says in his email I recently I brought up the fact that I thought it was interesting that your program just by how good it is still needed contributions I figured I Do my part the policy unprotected served that he had never contributed to the cause\n[laughter] I'm you know I mean after this phone call like I I feel more obligated to ah contribute I think I guess among my friends I'm kind of sort of known as like the guy who doesn't you know like\nYou know what it would kind of like trying to get free stuff ... and so we you know the big joke was that\nYou're going to donate money and I was like well I mean I'm sure by me giving you to listen to the show you're going to donate money and and that way I'm sort of contributing\nI taught him basically made me think here in much out of your idealism\nAs opposed to like the stories about the video\nWe think that's fair you know I'll I'll definitely I mean what is wrong call but I think I'd I'd probably will\nNow and I know that doesn't say much because I you know I I can I can definitely say if you if you hadn't called I probably wouldn't have given another thought but I'm In I'm Sorry about that um [noise] it's um it's it's it's definitely a you know my bad\nI'm freaking you out\nUm I mean I hear your life you're calling me yeah you're kind of freaked me out [laughter]\nI mean I hear your glasses you're ... you're trying to forgive me out [laughter] [noise]\nIs if you are in your heart is this you\nThere is a little bit of him and you\nDon't be the kind of person who sprints decided to have to our\nWas\nDon't make me come after you\nHere's your pledge call us at eight hundred to two two forty seven eighty eight or ... dot org and we will not send Ira Glass calling you surprising you\nEmbarrassing you on national radio this is your opportunity to do it only do the right thing and\nI use the word Tightwad I'm not going to use that word I don't even think people use that word anymore but what I Am going to say is maybe don't be a free loader you know you want to make a contribution you like this service you rely on it you're listening right now that means you value it so why not put a dollar amount maybe a dollar a day five ten Fifteen dollars a month\nThe choice is yours and when we hear from you right now we have this challenge in effect for every dollar you give right now Newman's Own foundation will at an additional fifty cents that means if you get fifty dollars right now the defense of Seventy five dollar investment in the news and information that we bring you an gp\nHundred dollars becomes a hundred and fifty dollars but we've got to hear from you know for you to take advantage of this wonderful challenge from Newman's Own foundation\nAt eight hundred to two two forty seven eighty eight or ... dot org\nNow best selling author and humorist David Sedaris as coming to Georgia for one night only he's going to be at the Lucas theater in Savannah Georgia on Wednesday April twenty fourth two thousand Nineteen at seven thirty pm now why would I tell you about that because we have the exclusive hook up for tickets before they go on sale to the public\nWhen you call us at a hundred to two to four seven eight eight and make your credit card contribution of two hundred and fifty dollars we're going to say thank you with a pair of tickets to see David Sedaris live at the live theater now this isn't again April twenty fourth two thousand Nineteen uh in Savannah it's a beautiful time of year to be there in Savannah\nDavid said there will be reading from his latest works including calypso which is a collection of a hilarious personal essays and as many of us fans know including you most likely because he is a public radio stalwart he's very funny and seeing him live it's certainly an unforgettable experience now this is his only time\nAnd snow including you most likely because he is a public radio stall where he's\nVery funny and seeing him live is certainly an unforgettable experience now\nThis is his only time in Georgia in the coming year so if you are looking for him to come to Atlanta or Columbus or make and guess what he's only going to be in Savannah so this is your opportunity get in now called eight hundred to two to four seven eight make that gift of two hundred and fifty dollars will send you a pair of\nTickets what an incredible opportunity to see one of the world's greatest humorous and of course he got his start on public radio Ira Glass in I guess pretty much discovered him doing a live show in Chicago and of course\nIt's all history from there and again this is David ... is one and only appearance in Georgia for the coming years so it matter where you live you won't want to miss this opportunity to see David Sedaris live in Savannah on April twenty fourth [noise]\nThat's eight hundred to two two forty seven eighty eight with a credit card contribution of two hundred and fifty dollars and you're on your way to see David so there is\nYou know what I think it's so great about that race and you've interviewed David recently ... and I think it's so interesting that we can stay here and have this conversation about the news of the day very important interesting conversations that are going to change and alter the course of American history\nAnd then a few minutes later we talked about going to see David ... says Lucas theater ... advantage there that are all things here it is so true that is that's brilliant we should call this all things considered and that's what's so amazing about NPR's you were brought to so many different places and she'd be here in Georgia allows that opportunity for you and certainly if that's something you value\nI'm always a fan of placing a value on it if that value for you as five or ten dollars a month it's still a whole lot less than what you're paying for your Internet streaming device or your cable bill or any other place it's bringing you important information that you need every day\nValue something that as a part of your life by calling eight hundred to two to four Seventy days go on line to G. P. B. dot org and getting now\nIt really is our mission here at gp be to be inclusive and to bring you stories that you value you are the investor in G. P. B. with your voluntary contribution and therefore you're really are only the only person who matter is we don't have to cater to commercial interests or any but anybody else that really is all about you the listener\nPeople like lacy in Macon who says I'm thrilled to be a sustaining member I listen to NPR for over Twenty years and I've loved every minute of it I Love that she's loved every minute by minute of Twenty years of NPR I don't know how many minutes that is\nWe've got Jill and Perry who says thank you so much\nThat of it I Love that she's loved every minute of Twenty years of NPR I don't know how many minutes that is we've got Jill and Perry who says thank you so much for all you do your programs are for some reason in these chaotic time Ken in Columbus says I Love G. P. V. thank you for all you do\nAnd Jordan in states ... says thanks for all you do to keep me informed\nThere are words that you used to describe NPR and GPS role in your life now we're looking for you to put some dollars behind those words make an investment in G. P. B. at ... dot org or eight hundred to two two forty seven eighty eight\nSupport for G. P. B. comes from our monthly sustain hers and Hartsfield Jackson airport offering a new ATM rewards program participants can earn points for parking dining and shopping and redeem them for miles hotel stays more complete information at age ... dot com slash wards\nAnd we'll start health system a proud member of the Mayo Clinic care network will start doctors can consult with male and complex cases keeping patient care at home well star dot org slash male will start Mayo Clinic working together working for you [noise]\nUh I feel unbelievably honored to be you know with Marie Curie and ... it's like how can I be in the same breath as those three\nMarines for nuclear physics in Nineteen sixty three Marie Curie in Nineteen oh three for her studies of radiation\nExactly you know so it's it's a pretty humbling to be in that community\nWell congratulations to you Don ... is a Canadian is it is now winner of the Nobel Prize in physics along with the weather is Arthur asking if the U.S and Gerard ... uh France thank you so much\nRun the country people are learning that their drinking water is polluted with a potentially harmful group of chemicals\nThey're called pee fast P. F. I. S. I. no link to a number of illnesses including cancer the Trump Administration is working on a plane to regulate them some in Congress are pressing for it to move faster\nNPR's Jeff Brady has been looking into this and joins us now I just I already but first of all what are these chemicals a pie fast it's an entire group of several thousand men may\nBrady has been looking into this and joins us now Hi Jeff\nHi Ari first of all what are these chemicals a pie fast it's an entire group of several thousand manmade chemicals in some of them had been around for decades these chemicals are good at repellent oil and water and that makes them really useful for all sorts of products like nonstop cookware coating on fast food rappers pizza boxes\nAnd the places where pie fast says are used in manufacturing those are generally the places that are the most polluted or there's some sites in New York North Carolina Michigan just to name a few places\nThe fast is also are in firefighting phone used at airports and military bases in some cases around the country the chemicals have migrated into local drinking water and the estimates on exactly how many people are affected very but it's safe to say that the numbers and the million how harmful to people kind of chemicals be what kinds of problems for the cost\nOf the research is limited so it's hard to pin down exactly how harmful these chemicals are scientists will say pee fast is are linked to certain illnesses here's Laurel ... she's a research scientist with an advocacy group called the Silent Spring Institute\nChemicals have been linked to a wide range of how the facts including cancer\nLow birth weight thyroid disease elevated cholesterol\nOn the immune system\nManufacturers have agreed to stop using two forms of pee fast in the U. S. but these chemical take a long time to break down on the environment and that's why they are still a problem now and how regulators responding to this especially given the uncertainty\nThe EPA requires most water utilities to test for a list of ... passes and in twenty sixteen agency lowered a non binding health advisory limit for some ... chemicals\nIt's now Seventy parts per trillion I'm told that is about Seventy grains of sand in an Olympic size swimming pool\nAnd some environmental advocates argue level should be even lower than that\nBut all this uncertainty it creates confusion especially for water companies like ... America it's based in suburban Philadelphia Christopher ... is the chief environmental officer there and he says companies like his needs a clear direction from the EPA and from policymakers\nTo be able to explain to the public that my above or below a safe level here and do we need to put treatment on in this community and how soon [laughter] and that still needs to be determined and that needs to be determined as soon\nAs possible now the EPA is working on a plan to manage pee fast chemicals agency just wrapped up\nThat still needs to be determined and that needs to be determined as soon as possible now the EPA is working on a plan to manage pee fast chemicals agency just wrapped up a series of public meetings around the country the plan is expected by the end of the year\nAnd the Trump Administration has been so staunchly anti regulation especially rolling back protection spent to keep people safe from environmental contaminants why are they responding differently to this\nAn issue like this it really fits in with the way the Trump Administration has tried to narrow the focus of the EPA away from things like climate change and toward issues such as clean air and clean water also we should keep in mind that the ... still working on his plan to manage ... chemicals\nAnd we don't know what that plan is going to look like until it's out sometime in the next few months\nSo what could people do to protect themselves today\nThe water utility aqua that we heard from just a minute ago\nThey've installed these big carbon filters to bring the levels down and that works the utility says the water is safe to drink if you're still worried about it those filters that you get in a refrigerator or water pictures those would bring the levels down too but I've talked to people here who still just don't trust their water that it's safe and they're continuing to drink bottled water\nIs NPR's Jeff Brady thanks thank you Ari and tomorrow we'll visit a New Hampshire town where there's concern that these chemicals are leaking from landfill into drinking water [noise]\nYou're listening to all things considered from NPR News\nIt's been more than two years since Britain voted to quit the European Union that the debate about how to leave it still going on even within the ruling conservative party prime minister Theresa May's plan for brags it has already been rejected by the emu and It's MORNING her former foreign secretary Boris Johnson also attacked it\nIs more pragmatic fact he's not a compromise dangerous an unstable\nBut basically an economic conservatives bases no democracy\nThat is not what we voted for\nJohnson was speaking at the conservative party convention in Birmingham, England and that is where NPR's Frank Langfitt filed the story\nIs when you didn't get that here in the city's international convention center\nParty leaders are upstairs\nNPR's Frank Langfitt filed the story\nThe energy is when you didn't get that here in the city's international convention center where\nParty's leaders are speaking upstairs at a city hall\nFringe event like this populist one nearby where John Longworth kick things off [noise]\nA big leap to do all those people down the road to DC you\nHand me\nCheers remains bleak for group dedicated to the swift exit from the you can also opposes what it sees as prime minister Theresa May's attempt to keep one foot inside the European Union I met you memory at a pack leave means leave event\nLast night I don't want to ... and\n... and they would like to come up with new Dale\nMany economists say just walking away from news market or more than five hundred\nMillion consumers who do serious damage to the u._k. economy but Murray who's managing director of a fish or chicken company on England's east coast to the sooner the u._k. leaves the faster English fisherman can reclaim exclusive rights to their traditional fishing grounds\nHe had taken the majority of our fish we want it back we want control in about ... and the fish would they not what we could be doing with night if someone like Donald Trump\nHost Britain's don't like the American president but his economic nationalism resonates with some breakfast tears we'd Myers willingness to attack free trade deal that her workers at home\nWe need someone like came we need someone who was on that country and the people not just that and\nGreat I'm close to my my prime minister he did have an thankful to track on same anything she Larry men but not everyone\nHere is down on the beleaguered Theresa May\nPersonally I Am a lot of fun to the prime minister\nAnd I hope because she stays on for as long as possible\nI'm round is a law student at the University of Rochester outside of Liverpool\nAppreciate that may is trying to find a middle ground keeping some economic benefits of membership for taking back political power from bureaucrats in Brussels that the old criticism here\nLike the European Union times of economic policy\nWe like the freedom of expression across borders for breakfast tried\nTo put because you're the\nLeader said you can't put the club and still cherry pick benefits told prime minister this last month at a meeting in Austria center back to the drawing board [noise]\nMovie was made its position on for weeks some Britain splints to Joshua\nThat's why Mr this last month at a meeting in Austria center back to the drawing [noise]\nMovie was made its position noon week some written for insult looting Joshua brought her ... another student who tends the University of you\nIs the prime minister of salt but it was so surprised by that so many ... way different policy because they have to follow the cost of how she was treated\nThem in what way because they still actually don't agree with\nWhat we do agree I think we can not giving outrage the\nBut outrage isn't a policy which is what prime minister may still needs to come up with later this month to meet you deadline\nIf she's still hopes to avoid crashing out of the European Union the economic pain that comes with\nFrank Langfitt NPR News\nYou're listening to all things considered from NPR News and\nAnd you're listening a listener supported G. P. B. where support for him generous listeners like you mix all things considered possible and support from generous let's there is like you make possible the story we just heard from Frank Langfitt about brags said and Theresa May is leadership of the u._k. is exit from\nThe European Union I Love that expression you can't leave the club and then cherry pick the benefits of the club when you go with you can you imagine the United states right\nA state in the United states being like oh we're going to leave a but we want to keep this this this this is this the no that's not how it works I think that it's a great example of the kind of reporting that NPR has been doing\nTo help us understand what brags it means a economically not only for the u._k. in Europe but actually for the United states\nThe European relationship with the United states is a significant one and this is just one of the many things that you learned on NPR's all things considered and the primary way that we pay for this kind of journalism is with your support if we have not heard from you get especially now during the final days of our fault fund drive\nThe new season premiere is this October on prime video\n\nFrom the University of west Georgia was Ninety seven FM Wu WG and W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nWu WG pained W W G. H. B. Gerald Ford of Georgia Public broadcasting radio network\n\nLive from the G ... remind melon Reinhart the cost of building two new reactors that plant Bogle near Augusta was a big topic in public Service Commission debates today keeping the Steven Tyler reports\nThat the sea regulates utilities across the state including how much rate payers are charged for construction of the behind schedule over budget nuclear power plant district five commissioner Tricia pride Morris has played Bogle is moving forward ahead of its new schedule\nAnd so I Would like to see as continue not just with plant level but with all nuclear projects continue to build out nuclear in the state of Georgia\nBy Moore's opponents Democrat Don Randolph and libertarian John purpose both oppose the current plan to continue construction without a cap on the cost the ... district five and district three debates are on our website G. P. V. news dot org for GDP News I'm Stephen Fowler in Atlanta\nGulfstream aerospace is buying the Oklahoma company that manufactures a critical part of its planes minority group makes the housing around Pratt Whitney engine switch power Gulf streams G. five hundred and eighty six hundred models\nNor have filed for bankruptcy in July in Savannah base Gulf Stream has been operated the company since September gulfstream also manufacturers the wings and pale stabilizers for its planes\nThe police chief in the Clinton County town of forest park has been fired amid allegations of racial profiling\nW. S. B. T. V. reports the city council voted three to two last night to terminate Twain Hobbs contract\nDid the right thing also a veteran of the Afghan war leaves the race for mayor of Kansas City disclosing but he struggles with the TST and you ... them from print so stories after these headlines\n\nLive from NPR News in Washington I'm ... beer Senate majority leader Mitch McConnell says the Senate will vote on President Trump's pick was the Supreme Court later this week NPR's Kelsey Snell reports what kind of looks back to the FBI will soon complete a supplemental background check on nominee Brett Kavanaugh\nMcConnell said the FBI is working quickly to investigate claims of sexual misconduct by Kevin ... has until friday to complete that work but McConnell expects a report quote soon\nIt will be made available to each senator\nAnd all the senators\nWill be allowed to look at it us away\nQuote soon it'll be made available to each senator\nAnd all the senators\nWill be allowed to look at it as a way to these reports are always handle\nMcConnell said it will be here decision when their schedule a confirmation vote some Republican senators and many Democrats say they would prefer for the public had access to that report they say it could have really confusing or controversy over the findings Kelsey Snell NPR News the Capitol\nThe Trump administration's family separation policy at the southwest border was played from the beginning by a lack of preparation and communications failures NPR's Joel Rose has more on a new report released today\nThe review by the department of homeland security's inspector general is the first official audit of President Trump's family separation policy administration officials said the policy was needed to discourage illegal immigration but Trump abandoned it amid widespread outrage after more than twenty six hundred children were separated from their parents\nAnd the audit found that hundreds of migrant children were detained at border patrol facilities for longer than the three day limit one for more than three weeks\nThe inspector general's review also found serious problems with record keeping and communication that made reunification more difficult ... spokeswoman says the report illustrates the difficulties of enforcing immigration laws that are quote broken and poorly written Joel Rose NPR News\nFederal authorities in Virginia have charged for suspects in connection with last year's violence in Charlottesville men are all from California and allegedly members of the militant white supremacist group rise above movement at a news conference day in Charlottesville us attorney Thomas Collins said the men traveled across the country with the intent to commit violence among other\nVictims on second street these men assaulted an African American man to ... uh two females and a minister wearing a clerical call if convicted of all\nThe charges the men could face up to ten years in prison [laughter]\nThe American dream appears alive and well among the nation's young people do perhaps to be reined in given the current economic realities new poll by the Associated Press north Center for public affairs research an MTV network finds about half a Fifteen to twenty six year olds\nThink they will eventually better off than their parents in terms of household finances only about ... percent of those surveyed said they feel their children might do worse\nOn Wall street today the Dow was up a hundred and twenty two points to a new record closed the NASDAQ fell thirty seven points today and you're listening to NPR\nSupport for NPR comes from indeed used by over three\nThey closed the NASDAQ fell thirty seven points today you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring or employers can post jobs and use greener questions to build their short list a preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nThis is all things considered on listener supported Georgia Public broadcasting Tuesday I ... and the political firestorm over Supreme Court nominee Brett Kavanaugh has raised questions about how judicial nominees are evaluated\nBut could lead to changes in the process we're going to have some analysis coming up next\nBut before we do we're taking just a few minutes to remind you of how important you are in our ability to bring you all things considered on CPB\nListeners like you who understand the importance of being well informed especially now you make the news and information that unique possible we're in the final days of fall fund\nDrive right now we are counting on your support if we have not heard from you get how come now is the time while you're thinking about it G. P. B. dot org and click donate or the number to call his eight hundred\nTo two two forty seven eighty eight thank you for your support I'm here with her it\nWas happening so if we heard from you in the last hour thank you very much we have a new challenge moving into this next hour of all things considered right now it's a dollar for dollar imagine affect things to a challenge from the Newman's Own foundation you can make your contribution now in any amount and you're supportive GDP will be some do\nSupport weekend edition supports all things considered support MORNING EDITION all the programs that you love right here on GB take advantage of this dollar for dollar match good a G. P. B. dot org and click donate recall eight hundred to two to four seven eight eight\nCome in and right now with your support in any amount any amount it All right now in your contribution will be match thanks to a challenge grant from Newman's Own foundation a dollar for dollar match thank you for doing your part CPB dot org or eight hundred to two two forty seven eighty eight support for TB programs\nComes from our listeners and the Georgia brain and spinal injury trust fund commission advising that a traumatic brain injury is one caused by an external physical force such as a car accident fall or sports the commission can help details at B. S. I. T. S. dot George adopt a child\nAnd Kennesaw state school of communication and media master's program and global communication hosting an open house October eleventh at six PM more information that Kennesaw dot edu slash N. A. I. D. C.\nIndication and media master's program and global communication hosting an open house October eleventh at six PM more information at Kennesaw dot edu slash N. A. I. D. C. the communication degree\nTo further a career from NPR News\nThis is all things considered I Know for Chang and I'm Ari Shapiro the fight to confirm Brett Kavanaugh to the Supreme Court continues on Capitol Hill\nBy the end of this week the FBI is expected to deliver findings from it's expanded background check on the judge\nThat increase looking into claims of sexual assault and now there is also growing talked about Kavanaugh's comments on his drinking and whether his remarks were truthful we're going to take some time to go through what's been said and how the story line up first he was President Trump yesterday\nI watched him I was surprised at how\nA vocally was about the fact that he likes beer\nAnd he's had\nA little bit of difficulty I mean he talked about things that happened when he drank others\nHeard Kavanaugh's testimony differently Here's Senate minority leader Chuck Schumer this morning\nBased on the accounts by his high school and college classmate she is grossly ms characterizes relationship with alcohol\nRepeatedly to toes around moved troops\nTo help guide us through these remarks interpretations of them NPR's Tamara Keith is here Hi town All right you want to begin with Kevin us first public comments about his drinking\nYes that was a Fox News interview that he did with Martha ... this was before the hearing he started by describing his high school life in this way\nSo I went to an all boys Catholic high school in Jesuit high school where I was focused on academics and athletics going to church every Sunday at little flower a wartime I service projects and friendship\nHe didn't mention the other parts of it the the partying\nAnd you ask people might have had too many beers on occasion and people generally in high school I think all of us have probably done things we look back on and high school and regret or credential bit but I'm not what we're talking about\nYou can come away from most of that interview thinking here's someone who was really studious and didn't really have time for that much partying um but he was asked in the interview by Martha ... whether he ever drink so much that he couldn't remember the night before now\nOr never happened never had anyone I don't remember anything about last night now\nSo that's the description he gave Fox News several days later he spoke to the Senate Judiciary committee under oath and here's what he said in his opening\nWell as I Know so that's the description he gave Fox News several days later he spoke to the Senate Judiciary committee under oath and here's what he said in his opening statement\nEvery contribution makes a difference no matter the amount so whether you're listening in Athens or savannah\nMaking room Albany Bainbridge no matter where you're listening for Atlanta please take this opportunity to join us for the first time you can continue your support or even increase your support\nThis is a group effort the calls and cliques are coming in from all over Georgia and beyond be the next call except that we get right now during all things considered\n... sitting here with Bert Wesley houses\nAnd you know the thing that I always appreciate about all things considered and NPR in general is that you can you you're you're certainly gonna get the headlines are going to get the news you're going to get a boiled down version of that certainly and a good version you're also going to get the opportunity to get think pieces like we just had\nWhich is you know a deeper conversation around the idea of vetting Supreme Court justices that's the kind of information that you've come to a gp before every day not because you just want the headlines you can get those anywhere right what you get here is a deeper version of that you get an intelligent take on it\nAnd you get long form storytelling bats the power of public broadcasting\nThat's what your dollars do because we're not beholden\nTo all of these commercial interests than advertisers we're only beholden to you so far first instinct is not to serve the advertisers who are giving us the money but instead to serve the person listening and that my friend is used do pick up your phone and call eight hundred to two to four seven eight eight joined the ranks of all of your other\nFriends and acquaintances who would do as a supportive gp before you\nBoard go online to GB dot org right now and make your gift\nAnd right now we have a dollar for dollar match in effect because it's an incredible opportunity for you to double your impact on Georgia Public broadcasting before you get busy with whatever you're doing this evening just a couple of minutes to double your impact call now eight hundred\nTo two two forty seven eighty eight four go online to G. P. B. dot org and click donate\nYour contribution right now will be matched dollar for dollar thanks to it\nFor go online to G. P. B. dot org and click donate\nYour contribution right now will be matched dollar for dollar thanks to a challenge grant from Newman's Own foundation\nThis is to encourage you to support CPB right now sixty dollars becomes one hundred twenty dollars one hundred dollars right now is worth two hundred dollars to the station five hundred dollars right now is worth a thousand dollars this is your opportunity take advantage of the dollar for dollar match\nSuch a special opportunity for you at ... dot org or eight hundred to two two forty seven eighty eight\nI'm Shannon Kato and I live in Decatur\nCPB brings me information stimulates my curiosity and makes me feel like I'm part of the conversation I Can't underestimate the value of sealing informed\nAnd it really makes me feel on top of things\nAnd my husband and I are sustaining members of G. P. B. because it gives our life so much and we choose to give that way because\nI Do not want to see the TV or public radio lose its funding\nAnd right now I think it's more important than ever that you have our money on a continuing basis so you can make plans for the future and you can know how much we value what you offer [noise]\nYou're listening right now because you value a gp offers you can make your investment at G. P. B. dot org or eight hundred\nTo two two forty seven eighty eight thanks to Shannon who says that she and her husband are sustain or as well what that means is is a month to month contributions so when you become a gp sustain are right now your money will be matched dollar for dollar so let's just say you want to become a ten dollar amounts CPB sustain her\nRight now when we hear from you that will be matched dollar for dollar\nBy the Newman's Own foundation that ten dollars a month automatically right now become twenty dollars a month investing in your own public radio listening to your part now don't let the evening get away from you don't let this dollar for dollar match get away from you gp beat out a word or eight hundred to two two forty seven eighty eight\nWe've passed the halfway mark in terms of the number of days for this fund drive however we've not yet reached the halfway mark in terms of the funding that needed to cover the costs of the programs that you expect to enjoy ...\nAnd ... of days for this fund drive however we not yet reached the halfway mark in terms of the funding that needed to cover the costs of the programs that you expected enjoy an G. P. V.\nIf you've been thinking that we'll wrap up this campaign successfully without your contribution please think again your support of GB right now is absolutely essential joined the effort to raise the critical funding that's required to keep G. P. B. and the programs that are a part of your life like all things considered on the air\nPlease make sure we hear from you analogy ... dot org or call eight hundred to two to four seven eight and if we've already heard from you thank you so much for your support right\nNow is a smart time to support CPB in addition to the dollar for dollar match you could win\nAre trying to win a saint Simon's island vacation for two yeah those could be yours when we hear from you at ... dot org or eight hundred\nTo two two forty seven eighty eight vis a fabulous saint Simon's island getaway for two people includes a three nights stay and an ocean front room at the beautiful ...\nKing and prints beach in golf resort located right on the ocean golfers who at the king in Prince golf course breakfast dinner for two it echo that saint Simon's island only oceanfront restaurant you could be our winter but you've got to get your name in the hat\nAnd when we hear from you of course we hope that you also support the TV Now at the time to dream about hanging out on the ocean waking up to the ocean breeze going to play some golf free breakfast this could be yours CPB dot org or eight hundred to two two forty seven eighty eight\nAlec Baldwin ... one one bigger Ireland\nYou need to contribute to public radio\nBecause you've got money we know you've got it and we needed more than you do I mean look at some of the crap you spend your money on there's waste mismanaged\nMr when you're coming on a little a little too strong to scare ... yeah yeah I remember honey gets to be and why don't we go ahead and and get to the next life say we're OK cue music\nListening to MORNING EDITION because\nTo get to work and find out to be a catastrophe or another war and you didn't know anything about it you'd be stupid people would whisper about you behind your back public radio is all but stands between you and ignorance foolishness\nAre not pledge\nAbout who you'll be without us propaganda\nAgain when you're going slightly off script here okay really your plate\nAbout who you'll be without us propagate again you're you're going slightly off script here okay really your pledge pitch frankly sounds like a threat exactly we crush their egos than they are like party they'll give us whenever we want okay just try and be a little ...\nIn fact the same was look let's skip to the third grade [noise] okay I've got\nThat one day and try not to drift from the microphone is in my ear okay there we go [noise] ...\nYes the pledge drive us unpleasant but the fact is those of us would listen to this radio station should be the ones who fund it that's the only fair\nThere are things I've heard on public radio that have shaped my understanding of the world but I bet that's true for you\nAlso in this moment when newspapers are folding and TV news is shrinking in the business of journalism is in crisis it's more important than ever that we get public radio strong and independent voice ... and the only people who couldn't do that\nYou and me\nThat for work\nWe hope it does work you can make your contribution now in all seriousness you our listeners who pay for all the programs who enjoy here on CPB eight hundred to two two forty seven eighty eight or TPP dot org\nNow right now while you're listening to the smart thing come in with your support in any amount right now your contribution is going to be matched thanks to a challenge grant from Newman's Own foundation independent media was among the causes that Paul Newman first supported many years ago and now Newman's Own foundation continue that legacy by matching every dollar you give\nThis additional funding is especially needed this fall as we work to meet the rising costs of the statewide them worldwide news that you've come to expect on G. P. B. so when you call us at a hundred to two to four seven eight are good at ... dot org\nNewman's Own foundation is going to double your gift so if you come in with a five dollar a month contribution that sixty dollars a year instantaneously that's worth a hundred and twenty dollars to G. P. B. your gift of a hundred dollars is worth two hundred dollars you see how it works\nThis is the time to reach out eight hundred to two to four seven eight eight or G. P. beat\nOut a lot of calls and cliques are coming in from around Georgia to take advantage of this a dollar for dollar match\nThank you so much separate Tricia royalty of Atlanta Miranda Thomas in averse aka Dr T Stewart of Alpharetta Dr Marc ... of savannah from Bogart similar rich from Roswell Jemma Harvey from food I'm Nicole\nThat off Dr Marc ... of savannah from Bogart similar rich from Roswell GMO Harvey\nFrom food I'm Nicole size more from Atlanta to limit fish friend from Watkins ville Alberta el it and now we'd love to read your name and your community to this list of generous supporters taking advantage of this dollar for dollar match no matter how much you give right now it will be matched dollar for dollar\nBy Newman's Own foundation what a great opportunity for you to double your impact G. P. B. dot org or eight hundred to two two forty seven eighty eight\nSupport for G. P. B. comes from our monthly sustain nurse and the alliance theatre presenting nixed flamingo grill inspired by the true story of the first integrated nightclub in Atlanta and featuring original jazz music September twenty ninth through October twenty eight alliance theatre dot org\nAnd she ... thinks the many businesses and individuals who work to make our fundraising campaigns that success including see parts catering for providing food and beverage is for volunteers and staff during our current fund drive [noise]\nIt's very very difficult to get in here\nWe've also been hearing reports that supplies are moving more to the city less to rural areas are you hearing stories confirming that that the supplies are being distributed quite unevenly\nWell there's a lot of anger about that but want is so huge and the preparation for this is simply nowhere near what needs to happen here\nThat's NPR's Julie McCarthy she's traveling in Indonesia central super ... province thank you very much Julie thank you\nKnow to the Supreme Court where today to justice has grappled with a difficult death penalty question does it violates the Constitution's ban on cruel and unusual punishment to execute a convicted murderer who has such severe dementia that he doesn't remember the crime he committed NPR legal affairs correspondent Nina Totenberg reports\nBurned in Madison committed a terrible crime in Nineteen eighty five after leaving his girlfriend's house he returned and shot and killed a police officer who had remained outside in his car to provide protection twice Madison was sentenced to death but the convictions were overturned because of prosecutorial misconduct\nWho had remained outside in his car to provide protection twice Madison was sentenced to death but the convictions were overturned because of prosecutorial misconduct\nThe third time he was convicted the jury recommended life in prison but Alabama has a unique law that allows the trial judge to override a jury's recommendation and the judge did just that\nMadison has been on death row in solitary confinement in Alabama now for more than Thirty years in that\nTime he suffered multiple severe strokes and MRI shows part of his brain is dead and there is no dispute that he suffers from severe vascular dementia and\nHis lawyer Bryan Stevenson says that Madison is so disoriented that he doesn't know what day a month or a year it is he's legally blind has difficulty walking and slurs his speech\nBut most critically has no memory of circumstances of this prime things about the state to execute him for\nInside the Supreme Court today lawyer Stevenson told the justices that executing man so incompetent would be unconstitutionally cruel and unusual punishment\nIn the past two decades in cases like this barring the death penalty for juveniles and the mentally challenged the justice who provided the fifth and deciding vote was Anthony Kennedy and he has just retired\nInside the courtroom today the justices appeared closely divided chief justice John Roberts asked whether for the purposes of the death penalty dementia is the same as someone who becomes psychotic while in prison\nLawyer Stevenson they would have to be a memory loss plus something else Justice Ginsburg what would the plus B answer brain damage that is the results of an injury so that the brain is incapable of producing memories are creating the kind of rational understanding that this court has required in the past\nJustice Sotomayor\nSo you're not talking about just amnesia answer no Mr Madison's dementia is so comprehensive that he can explain to you that he has a toilet and his cell for his use\nBut he can't hold that memory and he routinely urine aids on himself and asked the guards to take him to the toilet\nThe problem in this case Stephenson said is that the lower courts have said that since Madison is not delusional or psychotic it's All right to execute him\nThe eighth amendment he said is not like the constitutions other amendment it's a mirror of our norms and our values and what we have argued in this case is that Mr Madison's dementia renders him so frail but we'll dirt and vulnerable that executing him cannot be reconciled with the Constitution's ban on cruel and unusual\nThat Mr Madison's dementia renders him so frail but we'll dirt and vulnerable that executing him cannot be reconciled with the Constitution's ban on cruel and unusual punishment\nArguing for executing Madison was Alabama deputy attorney general Thomas ... junior justice prior a frequent critic of the death penalty asked this question\nI think if a person in the advanced stages of Alzheimer's what's the purpose of executing that person if you wouldn't executed person who's schizophrenia or delusional lawyer Govan replied that the state in this case still has an interest in seeking retribution for a horrible crime\nAnd he said that Madison does understand that he's in prison because of a murder\nAfter the argument Alabama State attorney general Steve Marshall had this to say\nThis involved the little execution of a police officer with this murder\nSome point in time to stay looks forward to being able to obtain the punishment the trial judge Lee was appropriate in this case\nA decision in the case is expected later in the term\nTotenberg NPR News Washington\nYou're listening to all things considered from NPR News\nThe Nobel Prize in physics was awarded today to three researchers including Donna Strickland Strickland is the first woman to share that the physics prize in fifty five years NPR's Geoff Brumfiel reports on what took so long\nEven Donald Strickland herself seems surprised at how few women have won the Nobel on physics she was asked about it at press conference earlier today\nYou are that the woman ever getting the Nobel Prize in physics\n[noise] oh what's your comment on that okay I thought there might have been [laughter]\nIt's true there was Marie Curie in Nineteen oh three nuclear physicist named Maria ... mayor in Nineteen sixty three and now Strickland a researcher at the University of Waterloo in Canada one for her work on an ultra fast alter bright\nMayor in Nineteen sixty three and now Strickland a researcher at the University of Waterloo in Canada one for her work on ultra fast alter bright laser pulses\nJoe coal a particle physicist at Bruno University of London in the u._k. says the gender imbalance in physics exists well beyond the Nobel Prize\nI think these to Disney one of the subject cities viewed as being donated by white middle class miles\nShe says the problem starts his earliest elementary school and it runs all the way through grad school\nWe've tried very hard to try and encourage more women into the buddies but he just doesn't seem to be happening\nHere in the U.S just twenty percent of advance physics degree is go to women that number hasn't changed in a decade\nThe field suffers from more explicit sex with them as well just last week a male says assisted a European lab gave a presentation claiming that men were better than women at physics he was suspended\nOther researchers in recent years have lost their jobs over sexual harassment that's progress as Jane Lou an astronomer at MIT Lincoln Laboratory\nI think at the right direction but it's different from being respected for a one expertise\nLew says she's experienced all kinds of sexism for example whenever she went to visit the telescope\nI wouldn't have a ... and it will mail because I didn't have any a female student and I was always assumed to be the student and a cat that my student was always assumed to be the person in charge of me\nLose says she thinks that kind of bias contributes to why they're so few Nobel Prize is awarded to women in physics to get the prize you have to be nominated by another physicist or astronomer most of whom are men\nI don't know what actually and then they will be thousands of nominations on men and maybe you know like five nomination for women I don't know something like that\nIt's a small percentage that's for sure that's ... and the secretary general of the royal Swedish Academy of Sciences during today's press conference he says the academy which runs the Nobel is trying to fix the problem\nWhere are you taking measures to encourage more nominations because we don't want\nTo miss anyone who says the Nobel need to catch up with the times Silicon Valley billionaires have begun financing a bunch of new prices for physicists to wind blew herself on one of the prices the Kavli Prize in twenty twelve and she was in good company\nThat yeah I Won they will for women\nWhen we were ... for one of the prices the Catholic prize in twenty twelve and she was in good company\nThat yeah I Won they will for women and that was pretty cool\nIf the Nobel want to stay cool Lew says they need to make sure they're not overlooking good candidates who just happened to be women\nGeoff Brumfiel NPR News [noise]\nThank you\nFor tuning into all things considered on\nListening to support at Georgia Public broadcasting where you we're bringing you stories where you think about something in a new way only three women have\nWon the Nobel is one hundred Fifteen Years as we just heard in the field of physics and astronomy\nActually in college I had a female astronomy teacher she was fantastic but this is making me think about women in science and a new way challenging me thinking about well who should be winning prizes should be based on gender et cetera\nAnd this is what all things considered does teaches you about new issues brings you different sides of the debate challenges you to think what do you think for yourself all of this has made possible with your financial support\nThe end of our full fund drive is fast\nApproaching so right now we're counting on you to do your part to invest in this kind of journalism tune them out that it works for you and give on line at G. P. B. dot org or call us at eight hundred\nTo two two forty seven eighty eight every single contribution really does make a difference no contribution is too big or too small so whether you're listening in Atlanta or savannah\nMake in Augusta Rome points in between now is your opportunity to join us for the first time you can continue your support or maybe bump it up a little bit more CPB that or or eight hundred to two two forty seven eighty eight and thanks I'm Ricky diving ten here with that mark ...\nTo euro price and best with confidence\nFrom the University of west Georgia mind be point seven FM Wu WG and W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network [noise]\nSupport for TB programs comes from our listeners and readers\nGerald Ford did Georgia Public broadcasting radio network\nSupport for TB programs comes from our listeners and regions bank helping businesses secure the capital needed through lending practices with financial and business schools firmly in mind from bankers with helpful advice and guidance information available to regions dot com slash lending\nAnd Emory Schwartz Center for performing arts presenting the acclaimed Jerusalem Quartet for an evening of rarely heard string sex tests with pink Superman and I'm into Forsyth on Wednesday October tenth tickets at arts dot ... dot edu\nTime and I was six o'clock thank you if we've already heard from you but if not and that was a time to give the G. P. B. or investment will be matched dollar for dollar at eight hundred to two two forty seven eighty eight or ... dot org thank you [noise]\nSupported by fresh where customer engagement software designed to streamline processes and filled with the end user in mind more fresh works dot com\nThousands of workers get a raise from Amazon but how far does Fifteen dollars an hour really go in this economy plus more on NAFTA to point out from the American public media\nMarketplaces supported by comes in contact with hundreds of customized ... emailed template for small businesses can reach customers where they are everyday they're inbox learned more in constant contact dot com [noise]\nAnd by guideline four oh one K. over forty five hundred small businesses have chosen guideline for his modern retirement plan that automate the heavy lifting reducing the cost of a four O. one K. guidelines four oh one K. dot com\nHand by intercom of business as a platform who's chat box automated manual sales and marketing tasks like qualifying leads and scheduling demos learned more an intercom dot com\nFrom the studios at Colorado Public radio in Denver today I'm Amy Scott in for Congress do It's Tuesday October second it's good to have you with us before we get to the Amazon news of the day it's worth going back to last month and a bill introduced in Congress by Senator Bernie Sanders\nHe called it the stop bad employers by zeroing out subsidies act\nAlso known as the stop bay those act\nAs in Amazon CEO Jeff Bezos the bill would tax big companies whose employees rely on\nAs the stop Bezos act\nAs in Amazon CEO Jeff Bezos the bill would tax big companies whose employees rely on federal benefits like food stamps Medicaid or subsidized housing which is reportedly true in some states of Amazon\nThe idea is to encourage those employers to pay higher wages well Amazon announced today that as of November first it's raising its minimum wage for us employees to Fifteen dollars an hour we got Abigail Wozniak on the phone to talk about all this she's a professor of economics at the University of Notre Dame welcome to the program\nThanks for having me trying to understand the impact of this though the minimum wage in Seattle where a lot of Amazon employees live is already more than Fifteen dollars an hour\n... kind of employee do you think this is going to have the biggest impact on\nSo Amazon apparently has argued that a lot of their full time warehouse workers are fulfillment center workers are already making on average over Fifteen dollars an hour so you're right that they already have quite a large swath of their workforce who would not be affected by that\nThey specifically mentioned part time and temporary workers are they almost certainly will see some changes there those tend to be lower paid positions than a full time positions\nThat should also apply to whole foods cashiers\nAnd average wages for cashiers in general in the whole United States but it's about it's about ten dollars and sixty cents so for those folks this is likely oh a raise but it's very unlikely that this is touching a large set of their core fulfillment center workers Amazon\nAnd its announcement also said it's going to lobby Congress to raise the federal minimum wage which is just seven twenty five an hour\nBut even without the federal wage increasing this likely puts pressure on their competitors to do the same right I mean Wal Mart only recently raised its minimum wage to eleven dollars an hour that's still a quite a bit less than Fifteen does this sort of speed up the the movement in that\nDirection really I think a skilled warehouse worker is already earning more than a cashier\nUm so that's kind of one thing to keep in mind is that Amazon is not quite in probably exactly the same labor market as\nWal Mart is by the same token a lot of other firms are already announcing these types of bigger wage increases so for example targeted aside at wanting to get to Fifteen by twenty twenty and Costco right in saying fourteen so I think Amazon is in some ways just keeping\nSo for example targeted side at wanting to get to Fifteen by twenty twenty and costs go right in saying fourteen so I think Amazon is in some ways just keeping pace with that\nThere are lots of places where Amazon has employees that have lower minimum wages for example Texas what kind of impact do you think this will have on communities where suddenly a lot of people are making more money certainly there are places where this raise we'll have more buying power for the employees who are affected\nThat in general should be a good thing for those local economies\nIt also does put some more pressure though on firms that might not be at a point where they are ready to pay wages that are quite that high so I think definitely watching for effects on smaller businesses on their ability to recruit and retain workers and those kind of local markets\nA would be an important thing to follow up after this announcement\nWe're going to look at how far Fifteen dollars an hour really goes for an average worker but what kind of impact do you think this could have on the larger economy Amazon has what two hundred and fifty thousand employees plus another hundred thousand seasonal workers as you've said a lot of them are already making at least Fifteen\nBut fewer of those employees are relying on public assistance they have more money to spend I mean do you see a macro effect from it's not just Amazon but this larger trends when\nPay expands for workers we have more in kind of a total wage bill that can cycle back through the economy that's good and general for growth um we also going to want to keep in mind what's happening with inflation if\nWages go up generally that's great but we have been experiencing some uptick than inflation and want to kind of keep an eye on the real purchasing power of these raises for workers\nAbigail Wozniak teaches economics at Notre Dame thanks so much things any\nAs the professor and I were discussing Amazon isn't the only retailer raising wages and more could follow suit meanwhile more cities and states are raising their minimum pay closer to what worker advocates call a living wage\nSo what's it like to live on Fifteen dollars an hour marketplaces Renata Sago talked to some of the people who would know best Alex ... is twenty two years old and works two part time jobs in Florida he makes sixteen dollars an hour as a community organizer and nine fifty at a fast food chain he\nSays he's able to pay his bills and bus fare but earning Fifteen dollars an hour full time\nOur as a community organizer and nine fifty at a fast food chain he says he's able to pay his bills and bus fare but earning Fifteen dollars an hour full time with health benefits would help\nMe it's just a permanent job out of your life every week or more alert much\nSharon ... Peterson is forty two years old and lives in Utah she's made Fifteen dollars in the past working odd jobs and said she was able to manage as a single woman now that she lives with her husband and his raising two kids she relies on renting out rooms in her home and her parents chip and money\nIf we hadn't bought this house when we did we wouldn't be able to survive on church in dollars an hour there's no way\nBack in Florida Alexander Saunders who works at a community center received a raise last month after a few years of making a little over Fifteen dollars an hour twenty eight year old credits that wage with and being able to pay off its debts\nActually just straight off last year a car loan\nBut he says he wouldn't have been able to do that if he hadn't been living with three roommates\nKlinger if somebody was on the show\nWhile city like New York Los Angeles and Seattle are mandating Fifteen dollar an hour wages the fiber Fifteen as it's known continues and now Amazon employees across the country will get to see how far the Fifteen dollar wage will take them I'm going to say go for marketplace\nWe have another slice of the Amazon story on line today and explainer on monopoly sunny try saying that five times fast and why the term might relate to Amazon on Wall street retailers paying a price for the promise of higher wages live details when we do the numbers\nNew NAFTA or as it's officially known the U.S Mexico Canada agreements reached over the weekend is already raising some complaints from North of the border Canadians are worried their drug prices will go up\nBecause one piece of the deal gives years of extended patents protection that is monopoly protection too high end expensive drugs known as biologics that means the trade deal could delay the time it takes for cheaper generic to get to market from Washington marketplace\nHigh end expensive drugs known as biologics that means the trade deal could delay the time it takes for cheaper generic to get to market from Washington marketplaces Scott tongue reports biologic\nTo two two forty seven eighty eight or TPP dot org saint Simon's island vacation including it three nights stay and an ocean front room and the beautiful king in print speech and golfers or located right on the ocean Gulf for too with the king in Prince golf course\nPlus breakfast and dinner for two it echo that the island's only ocean front restaurants don't put off supporting ... any longer we're going to Poland winter out of the hat at seven o'clock that's forty minutes from now so really we're down to the minutes for you to enter this wonderful saint Simon's island vacation\nWe can't enter you into this drawing until we hear from you at ... dot org or eight hundred to two two forty seven eighty eight and good luck\nAnd we're here giving you so many reasons to support the baby\nI think the best raises the fact that you're listening right now you probably do it on a regular basis you'll get your name and a half of that fantastic drawing to a saint Simon's island vacation to the king in France and will even throw into thank you get when you get twenty dollars a month to gene PV we'd love to send you this great\nNew ... we've put together just for this fund drive and the blacks above poverty it's got the G. P. V. logo embroidered on the path to the left chess pocket area and it comes in your choice of size small two extra extra large\nHealed ... you could be like sporting met hoodie around town and bragging that you're a supporter G. P. B. but you can only get it when you get ten dollars a month or a one time contribution of two hundred and forty dollars your\nGeneral support of GPS will go directly into funding the news that matters to you so call us now with your contribution in any amount twenty dollars a month of ... D cheap ... dot org or eight hundred to two to four seven eight\nAnd she be thanks good measure meals for providing food during our fall sun Dr good measure meals chef crafted fresh healthy delivered meals and catering in Atlanta and Athens learned more good measure meal\nSo during our fault fund drive a good measure meals chef crafted fresh healthy delivered meals and catering in Atlanta and Athens learn more at good measure meals dot com\nI Am kind of result to host a marketplace you know public radio is an all news and information we like to have fun to kind of fun that everybody can get in on like James Romans funny take on something most of us love All right not really so much the dreaded performance review question where\nDo you see yourself in five years since no one can see the future I Will answer by presenting ten possible scenarios which admittedly very and their likelihood nevertheless I feel that his best to try to be thorough so at least one of the scenarios may prove true in five years\nPlease note that during previous performance reviews I have been repeatedly told that I Need to think outside the box\nScenario one in five years I Will have received a promotion scenario to in five years the company will have realized what a hardworking intelligent and loyal employee I have been and will reward me for my long and dedicated service with a generous raising a bonus\nMy performance rating will go from the unwarranted needs improvement to exceed expectations scenario three in five years I Will have risen to the position of vice president scenario for five years I Will only entire company scenario five\nIn five years I Will have given up trying to understand the phrase think outside the box scenario six in five years I Will be living outside in a box\nScenario seven and five years I started working on a time machine and my garage a night\nScenario eight using my time machine I have gone back and prevented the meaning of the man and woman who without my intervention would eventually given birth to the age are person who came up with the question where do you see yourself in five years scenario nine in five years I Will be doing more with less\nScenario ten in five years I Will be filling out this form again [noise]\nSo what's your five year plan you know and I couldn't resist seriously our five year plan includes you ... like you keep public radio on the airwaves and if we're going to make it another five years or another hundred we need you to\nGet their let us know what you think of us of the news and information in entertainment we provide by making a contribution today there's had to do that\nOr another hundred we need you to get their let us know what you think about the news and information an entertainment we provide by making a contribution today there's got to do that in fact\nThank you for making your contribution right now at ... dot org or eight hundred\nTo two two forty seven eighty eight I think most of us don't know exactly what we're going to be doing in five years\nBut what we do hope is that public radio is stronger than ever in five years and we can only make sure that that happens when we listen when we hear from listeners who make that vital contribution to keep gp strong in Georgia\nCPB dot org or eight hundred to two two forty seven eighty eight were counting on your support right now especially in the final days of our fall fund drive when we each chip in what we can to gather we all make public radio possible and strong in five years in here without markets and\nWe have a big clock on the wall in the studio here in chief he be and according to the clock us less than thirty six minutes to call in or clicking and get your name and the have to win a saint Simon's island vacation for two including a three nights they in the ocean front room at the beautiful king in print speech and golf resort\nIs located right on the ocean it will include golf for too as a ... golf courses plus breakfast and dinner for to echo the only oceanfront restaurants on saint Simon's island don't put off supporting ... any longer\nNow about thirty five minutes for you to call her ... and get your name and the drawing at ... dot org or eight hundred to two to four seven eight eight now maybe thinking\nReally thinking about going to the beach I Am\n[laughter] butter lucky winner will receivers to get good for us to a year that you can use to vacation take your spouse your partner your sister your brother who ever you'd like to travel with maybe a best friend\nAnd you can go down the same Simon's island courtesy of the ... and the fact that you have support is\nGreat news and information and kept public radio strong in Georgia eight hundred to two to four seven eight eight or ... or so cheap\nIt is public radio you hear us say that a lot but we still have expensive operating costs expenses budgets just like our car Marshall counterparts the reason what you hear is so good is because it costs a lot of money and also because we\nFences budgets just like our current Marshall counterparts the reason what you hear is so good is because it costs a lot of money\nAnd also because we don't air Fifteen or twenty minutes of commercials every hour a primary part of the business model of public radio is this very fun drive you are listening to our business model we're totally transparent about it this is the most efficient and effective way to raise the funds to pay for the news that you need\nYour financial contribution helps cover the costs of the programs\nThat news the conversations the interviews on marketplace on MORNING edition and all things considered they'll continue to be right here for you where you want them coming to you on G. P. D. thanks to listener dollars that pay for them\nTo contribute at whatever level is right for you a dollar a day five ten Fifteen dollars a month the choice is yours\nTo become a listener supporter at ... dot org or eight hundred to two two forty seven eighty eight\nAnd you're listening you're thinking about oh how much should I give\nHow about an even twelve dollars a month to twelve dollars a month and we'd love to thank you right back with a great looking window to the world GPA be T shirt it comes to light blue this fall\nThis was a long sleeve really come the T shirt with a great graphic on the front it's very very colorful and it's a G. P. B. is your windows for the world do you have that and your choices sized when you give\nTwelve dollars a month to twelve dollars less than you pay for a whole lot of other stuff that you probably spend a whole lot less time\nNews things is that correct a whole lot of ... a whole lot less time so go ahead and make that gift won't eat twelve dollars a month and cheap ... dot org or eight hundred to two to four seven to eight eight let us know your sides and we'll send you your T shirt\nAnd you'll where your ... support with Dr CPB\nDot org is where you can take a look at the AT T shirt or call us at eight hundred at two to two forty seven eighty eight\nWe love to hear your comments when we hear from you we've got Roxanne in Atlanta who says I rely on NPR for credible accurate information about world news loved to listen\nSandra from lake month says it's so nice to have unbiased reporting in today's News World we love NPR and our household and Robert in Brooklyn Georgia says I've been listening to public radio for many years I'm ashamed to say I have never donated before but these days I feel that more than ever that people need us\nClick Georgia says I've been listening to public radio for many years I'm ashamed to say I have never donated before but these days I feel that more than ever that people need a source of information that is in depth\nAccurate an unbiased which is you TPP\nYou are listening right now because you value the service a gp provides whether it's unbiased objective reporting whether it's the international stories whether it's the music the insightful conversations so many reasons that you listen\nThese are all reasons to contribute and make an investment in your own listening\nCPB is strong thanks to listeners support and you can be the next call or click who supports it at ... dot org or eight hundred to two two forty seven eighty eight\nYou know we talk about the drawing like the uh saint Simon's island getaway for too that we're giving away the deadline to get an entered to seven o'clock\nAround the country people are learning that their drinking water is polluted with potentially harmful group of chemicals\nThey're called pee fast P. F. I. S. and they're linked to a number of illnesses including cancer the Trump Administration is working on a plane to regulate them some in Congress are pressing for it to move faster NPR's Jeff Brady has been looking into this and joins us now Jeff Hi Ari first of all what are these chemicals\nPee fast it's an entire group of several thousand men may chemicals in some of them had been around for decades these chemicals are good at repellent oil and water and that makes them really useful for all sorts of products like nonstop cookware coating on fast food rappers pizza boxes\nAnd the places where Pete passes are used in manufacturing those are generally the places that are the most polluted or there's some sites in New York North Carolina Michigan just to name a few places\n... also are in firefighting zone used at airports and military bases in some cases around the country the chemicals have migrated into local drinking water\nAnd the estimates on exactly how many people are affected very but it's safe to say that the numbers in the millions how harmful to people can these chemicals be what kinds of problems that cause the research\nIt's on exactly how many people are affected very but it's safe to say that the numbers in the millions\nHow harmful to people kind of chemicals be what kinds of problems that cause the\nResearch is limited so it's hard to pin down exactly how harmful these chemicals are scientists will say pee fast is are linked to certain illnesses here's Laurel ... she's a research scientist with an advocacy group called the Silent Spring Institute\nChemicals have been linked to a wide range of how the facts including cancer\nLow birth weight\nThyroid disease elevated cholesterol\nOn the immune system\nManufacturers have agreed to stop using two forms of pee fast in the U. S. but these chemicals take a long time to break down on the environment and that's why they are still a problem now and how regulators responding to this especially given the uncertainty\nThe EPA requires most water utilities to test for a list of ... says ending twenty sixteen agency lowered a non binding health advisory limit for some ... chemicals\nIt's now Seventy parts per trillion I'm told that is about Seventy grains of sand and an Olympic size swimming pool and some environmental advocates argue level should be even lower than that\nBut all this uncertainty it creates confusion especially for water companies like aqua America it's based in suburban Philadelphia Christopher ... is the chief environmental officer there and he says companies like his needs clearer direction from the EPA and from policymakers\nTo be able to explain to the public that my above or below a safe level here and do we need to poetry been on in this community and how soon and that still needs to be determined and that needs to be determined as soon as\nPossible now the EPA is working on a plan to manage pee fast chemicals agency just wrapped up a series of public meetings around the country the plan is expected by the end of the year\nAnd the Trump Administration has been so staunchly anti regulation especially rolling back protections meant to keep people safe from environmental contaminants why are they responding differently to this\nAn issue like this it really fits in with the way the Trump Administration has tried to narrow the focus of the EPA away from things like climate change and toward issues such as clean air and clean water\nAlso we should keep in mind that the EPA still working on his plan to manage ... chemicals and we don't know what that plan is going to look like until it's out sometime in the next few months\nSo what could people do to protect themselves today\nAbout the water utility aqua that we heard from just a minute ago they've installed these big carbon filters to bring the levels down and ...\nWhat could people do to protect themselves today about the water utility aqua that we heard from just a minute ago they've installed these big carbon filters to bring the levels down and that works the utility says the water is safe to drink if you're still worried about it those filters that you get in a refrigerator or water pitchers those will bring the levels down too\nBut I've talked to people here who still just don't trust their water that it's safe and they're continuing to drink bottled water temperature is Jeff Brady thanks thank you Ari\nTomorrow we'll visit a New Hampshire town where there's concern that these chemicals are leaking from landfill into drinking water [noise]\nYou're listening to all things considered from NPR News\nIt's been more than two years since Britain voted to quit the European Union but the debate about how to leave it's still going on even within the ruling conservative party prime minister Theresa May's plan for Brexit has already been rejected by the emu and It's MORNING her former foreign secretary Boris Johnson also attacked it\nJust know\nThat is a compromise is dangerous an unstable\nBut basically our economic conservatives it seems no democracy\nIs not what we voted for\nJohnson was speaking at the conservative party convention in Birmingham, England and that is where NPR's Frank Langfitt filed the story\nThe energy is when you didn't get to hear in the city's international convention center where\nParty leaders are speaking stares at a city hall\nFringe event like this populist one nearby which are Longworth kick things off\nBig today leads to go\nIt was one nearby where John Longworth kick things off [noise]\n[noise] a\nBig lead to do all those people down the road to see the\nHand me\nCheers read means leaf group dedicated to the swift exit from the you can also opposes what it sees as prime minister Theresa May's attempt to keep one foot inside the European Union I met you memory at a pack leave means leave event\nLast night I don't want to ... says steamy hot and\nAll that and they would like to come up with new Dale\nMany economists say just walking away from news market or more\nThan five hundred million consumers who do serious damage to the u._k. economy but Murray who's managing director of a fish or chicken company on England's east coast to the u._k. leaves the faster English fisherman can reclaim exclusive rights to their traditional fishing grounds\nHe had taken him at your face you know we want it back we want control in about ... and the fish would they not know what we could be dealing with night it's someone like Donald Trump\nHost Britain's don't like the American president but his economic nationalism resonates with some breakfast tears we'd Myers willingness to attack free trade deal could hurt workers at home\nWe need someone like came we need someone who wants to protect the country and the people not just that and\nI'm late night night prime minister he did have an actual has tracked owns them anything she Larry men but not everyone\nHere is down on the beleaguered Theresa May\nPersonally I Am a lot of fun to the prime minister\nAnd I hope she stays on for as long as possible\nI'm round is a law student at the University of Rochester outside of Liverpool\nHe appreciates that may is trying to find a middle ground keeping some economic benefits of membership will take him back political power from bureaucrats in Brussels that the old criticism you're\nLike the European Union times of economic policy\nWe like the freedom of\nExpression across borders for research has tried\nTo put closer to the\nLeaders say you can't put the club and still cherry pick benefits I told the prime minister this last month at a meeting in Austria center back to the drawing\nAnd he was made its position known for weeks some Britain splints to Joshua brought her ... and other students here who tends the University of New York that treatment\nAnd the prime minister salt that was so surprised to learn how to help put away a night different positive because they have to say because of how she was ...\nTo the prime minister so that was so surprised by that so many health but it was a different policy because the cost of how she was treated\nThem in what way because they still actually don't agree\nAgree but I think we can not outrage the\nBut outrage isn't a policy which is what prime minister may still needs to come up with later this month to meet in you deadline\nIf she's still hopes to avoid crashing out of the European Union the economic pain that comes with\nFrank Langfitt NPR News\nYou're listening to all things considered from NPR News\nSupport for deep ... comes from generous listeners like you and Georgia State parks as things get shorter and temperatures start dropping there's no better time to huddled around a campfire at Georgia State parks information and rates available at visit gee a state parks dot org\nAnd Georgia State university ... Atlanta is license to Georgia State university a major contributor to the economic and cultural vitality of downtown Atlanta and the metro Atlanta area more information is available at G. S. U. dot edu\nYou are listening to all things considered on listener supported Georgia Public broadcasting where we bring you stories from the ... face Great Britain just like we heard all made possible with your financial support NPR has certainly been educating me on\nThe negotiations has Great Britain negotiates to leave the European Union is and the huge deal in Europe it's actually a great big impact on the United states as well our largest trading partner", "year": "2018", "show_name": "All Things Considered (NPR)", "city": "Carrollton", "day": "02"}