{"month": "10", "state": "GA", "station": "WUWG", "content": "Four seven eight or G. P. B. dot org\n\nGeorgia his mind he points to W. W. W. W. N. G. H. D. Gerald from Georgia Public broadcasting radio network\n[noise]\nMy from the G. P. B. newsroom I'm Ellen Reinhardt education secretary Betsy device visited Georgia Tech today to kick off for re think school tour\nOf all served from Georgia Tech president bug Peterson and other officials about several student programs\nAs part of the tourist she in the federal student aid chief strategy and transformation officer also demonstrated the new my student aid mobile app earlier this week the education department released the app which allows students to fill out their free application for federal student aid on their cell phones\nSome state corrections employees are getting thousands of dollars in back pay following a federal investigation GB Cindy hill reports\nThe U.S department of labor found Georgia's department of corrections violated federal labor laws for tracking and paying overtime Michael ... where the U.S department of labor he says employees at forty three facilities receive money\nTo crush her down our dollar's\nGoing forward the state will change how it reports and pays overtime for G. P. B. News I'm Cindy hill in Savannah\nAtlanta based Delta Airlines says Hurricane Florence costs the company thirty million dollars the September Storm caused at least thirty five hundred flight cancellations mostly in the Carolinas delta stock dropped three point four percent yesterday after the announcement\nPartly cloudy this afternoon extreme north east Georgia I could see some isolated thunderstorms the rest of the state will stay dry partly cloudy skies statewide tonight with fog creeping across much of Georgia loose will be in the upper sixties to low seventies\nThat on Thursday partly cloudy skies a new threat of rain tomorrow highs and the upper eighties to low nineties for more news ... news dot org\n\nLate last night NPR's Tim Mak reports Kavanaugh's confirmation almost certainly hinges on boats from Senator Susan Collins Lisa Murkowski and Jeff Flake\nTrump mocked Ford's Senate testimony at a political rally in Mississippi\nHis attack on Capitol is accuser was greeted with cheers are winters so I don't remember how many [noise] not so much on Capitol Hill Republicans have a slim majority in the Senate meaning that Kavanaugh's confirmation may come down to three key lawmakers Here's Senator Murkowski\nEye and taking everything into a\nPresident's yesterday\nCan Dr Ford were totally inappropriate and in my view unacceptable\nSenator Collins called the comments just plain wrong and Senator Flake called it kind of appalling Tim Mak NPR News Washington\nA un tribunal has ordered the U.S to ensure that sanctions against Iran do not impact humanitarian aid or aviation safety\nAs NPR's Michele Kelemen reports Iran is welcoming the decision while secretary of state Mike Pompeo is blasting Iran for abusing the court secretary ... says Iran brought what he calls a merit list case at the international court of justice based on a treaty that he says Iran has been ignoring\nI'm announcing that the United states terminating the Nineteen fifty for our tree where everybody would the wrong decision frankly there's thirty nine years they've ...\nSays while the U.S is re imposing sanctions on Iran having pulled out of the Iran nuclear deal the Treasury Department is making sure that humanitarian transactions can continue\nBut the secretary ads Iran could be helping its own people rather than arming proxy militias in Iraq Syria and Lebanon Michele ... NPR News Washington\nAt journalists group and turkey is calling on the government to look into the apparent disappearance of a prominent Saudi journalist and critic of Saudi policies\nNPR's Peter Kenyon says journalist ... reportedly entered the Saudi consulate in Istanbul on Tuesday and to not come out\nThe Turkish Arab journalist association edited voice to those official these Turkish fiance and a friend who said they waited in vain for him to come out of the Saudi consulate the association said in a statement it fears for her she'll be security he left Saudi Arabia last year the ring retribution for critical writings about the king of\nNPR's Peter Kenyon reporting\nIt fears for her she'll be security he left Saudi Arabia last year the ring retribution for his critical writings about the king to\nNPR's Peter Kenyon reporting on Wall street that Dallas city for ... finds the S. and P. I. Q. this is NPR\nSupport for NPR comes from NPR stations other contributors include exact science is offering color guard for average risk or does over fifty a non invasive colon cancer screening parents about can be used at home by prescription normally information at color guard tested dot com\nIt's all things considered on listener supported at gp the public radio works because listeners who've value programs like all things considered do their part to keep them on the air\nTime is running out at our fall fund drive and we're working on a goal of wrapping up this Dr successfully with your support we'd love to hear from you before the next three coming up which is a new NPR PBS NewsHour Marist Poll finds that amid the Brett Kavanaugh Supreme Court confirmation battle\nThe share of Republicans saying the twenty Eighteen midterms are quote very important has spiked\nBut first take two minutes right now to make a big difference in the programs you expect and enjoy help us get that much closer to the end of this drive with program costs on the rise your support right now is especially important place called ... dot org and click donate or call us at eight hundred\nTo two two forty seven eighty eight thank you I'm Ricky ... here with her it was like I said\nAnd as Dr is scheduled to end in just a couple of days so please don't put off putting your uh don't put off doing your part until the last day maybe to the last minute make sure that we hear from you right now we're counting on a strong showing of support from you and from all things considered listeners with us this afternoon\nAnd we have a great drawing we have a really cool opportunity for you to win a one thousand dollar visa gift card all you have to do is call eight hundred to two to four seven eight eight or go online to G. P. B. dot org right now make your gift in support of this fall fund drive\nAnd we'll throw your name in the hat for a one thousand dollar visa gift card that you can use how ever you want one lucky list at the end of all things considered today eight hundred to two to four seven eight eight or gp that word\nListener every contribution makes a difference so be the next important and generous listener we hear from a right now\nDon't put it off until the last day do your part right now while you're thinking about it check it off the list for your Wednesday evening gets too busy you're trying to wrap up work or get dinner on the table now is the time take this opportunity\nThinking about it check it off the list before your Wednesday evening gets too busy you're trying to wrap up work or get dinner on the table now is the time take this opportunity at G. P. B. dot org or eight hundred to two two forty seven eighty eight\nThanks to Elizabeth sellers in Atlanta Dorothy ... island and Donald Amos of Augusta for doing their part to support all things considered\nThis is all things considered from NPR News I'm Ari Shapiro and I'd also Chang in the weeks since Christine Blasey Ford accused Supreme Court nominee Brett Kavanaugh sexual assault President Trump's response has been relatively restraint\nThat changed completely last night when president from mocked Ford at a rally in Mississippi\nHow did you get home I don't remember how did you remember when my son will remember and\nToday and the White House briefing room press secretary Sarah Sanders defended the president's comments NPR's Danielle Kurtzleben has been following the president's response to all of this controversy and she joins us now Hey Daniel hello\nSo as we noted the president's tone it shifted dramatically last night and I just want to start out by talking about how his comments last night compared to how he's been talking about Ford up until last night\nSure so late last week after Christine Blasey Ford and Brett Kavanaugh testified before the Senate Judiciary committee Trump had taken a much softer tone towards Christine Blasey\nFord or just a motor users\nCan do as a\nNow he seemed to be sort of ... to the line that congressional Republicans seem to be healing to which was something to the effect of Christine Blasey Ford seems credible but you know maybe she's mistaken or I Wish we had more corroborating evidence but a lot of them use that key word credible\nThen last night he got up in front of the crowd and he he was mimicking her and the fact that you know she can't remember every single thing that happened that night so he was really the verging from that line and he was playing it to last and cheers from that audience yeah you can hear the tape and so that has people really upset today some kind of\nHow the response has been in the Senate because to get Kavanaugh through Senate Republicans are focusing on two key senators Lisa Murkowski of Alaska and Susan Collins of Maine how either of those two women responded to Trump's comments from last night right\nWell they're not happy or Lisa Murkowski has said her words were that it's inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it will\nHer words were that it's inappropriate and unacceptable and that Trump's comments could sway her vote now Susan Collins likewise she told CNN that it was quote just plain wrong what Trump said and she wouldn't say if it would affect her vote [laughter] you know one thing that has\nBeen swirling in the middle of all of this is the fact that Trump has talked about how he actually emphasizes with Kavanaugh because he himself has been accused of sexual assault of sexual misconduct absolutely\nFor this uh evenings all things considered don't put it off to the last day\nDo your part right now called eight hundred to two to four seven eight eight or go to ... dot org\nI'm Audie Cornish from NPR News and if you've been thinking about making a financial contribution to keep you don't put it off any longer donating is easy and it takes just a few minutes of your time\nTo think of all the time you spend with the G ... listening to NPR favorites MORNING EDITION all things considered fresh air and wait wait don't tell me\nThen there are GDP favorites like on second thought and political rewind [noise]\nWhen you join us for the first time or continue your support you help ensure that the programs that matters you continue to be there for you for your community [noise]\nThe end of the drive is almost here all eight hundred to two to four seven eight eight now or give on line and CPB dot org and thank you thank you for supporting\nCPB and thank you for automatically entering or drawing when we hear from you you could be winning a one thousand dollar visa gift card\nA prepaid visa gift card good anywhere a visa is accepted even on line it gives you the freedom to buy whatever you want everyone we hear from during all things considered will automatically be entered we're now looking for twelve calls or click buy for thirty that's ten minutes away\nA little more than two minutes\nCarrot G. P. V. dot org or eight hundred to two two forty seven eighty eight\nAnd we have a great drawing to a thousand dollar visa gift card that we're giving away to one lucky listener when you call eight hundred to two to four seven a day to go to ... or if you've said on the sidelines during on air campaigns like this in the past make this the moment that you join our public radio family with your contribution we could be sending you a one thousand\nSidelines during on air campaigns like this in the past make this the moment that you join our public radio family with your contribution we could be sending you a one thousand dollar\nVisa gift card and you can take that thousand dollars in spending however you want the most reliable and important funding for the programs that inform you and enrich your life connect you with the world's it comes directly from you have you made your contribution yet\nIf not call us at a hundred to two to four seven eight eight or go to ... dot org [noise]\nHi I'm Scott Simon ... happen to you you're on a road trip may be a move to Newtown and you start looking for a familiar shop sugar scan up and down the dial let's get to this week's phones gas [noise]\nCool to be\nThat it [noise] [noise]\n[noise] [noise]\nNo no not that where is it\nLike radio you hear the difference every time you're listening\nRight now your contribution to G. P. V. will make bold\nStation runs on financial support from listeners like you\nGive what they can to help ensure the future of GPA and then we are\nNow it's your turn please give on line that the dot org\nOr call eight hundred to two to four seven eighty and thank you thank you so much for supporting TPP we'd like to say thanks to Mary who lives in Lawrenceville she says I just moved to the area and I want to support my local station I have been a long time supporter of public radio in South Carolina whether you've just moved\nTo Georgia where you're just visiting Georgia we a lot of us have that experience of looking for the public radio station and now you can make a contribution help us Stay on track now during the final minutes or final days of our fall fund drive at ... dot org or a hundred to two two forty seven eighty eight\nBest selling author and humorist David Sedaris is coming to Georgia and he's only going to be here for one night she is going to be at the Lucas theater and savannah on Wednesday April twenty four two thousand Nineteen\nAt seven thirty pm now when you support G. P. B. at eight hundred to two to four Seventy date with a credit card contribution of two hundred and fifty dollars we're going to send you something very special to tickets to the day but the nearest live in Savannah\nIn April before they go on sale to the public\nAnd you're also going to get to join us for a ... a show reception\nWell two tickets to the David ... live in Savannah in April before they go on sale to the public\nAnd you're also going to get to join us for a ... a show reception just for GDP donors so called eight hundred to two to four seven eight eight right now the tickets are not available on our website because we have limited quantities and we want to be able to control the inventory so called eight hundred to two to four seven eight eight that gift to two hundred and fifty dollars we have a lot\nOf ground to cover in the final hours of this fund drive we're looking to hear from you right now if you'd like these David to their tickets we'd be delighted to send them to you or they two hundred and fifty dollar credit card contribution on the phone the tickets are not available at our website the number is eight hundred\nTo two two forty seven eight ... will be reading from his latest works including calypso collection of hilarious personal essays many of his fans know that he's very funny and seeing him life really is an unforgettable experience we would send you to tickets these are not yet available to the public when we hear from you on the phone\nWith a two hundred and fifty dollar credit card contribution at eight hundred to two two forty seven eighty eight\nMy name is called ... I live in Fayetteville, Georgia I Am an avid listener of public radio I listen to hardly anything else\nAll things considered would absolutely be one of my favorites for sure\nThe title says it all it truly does help you sort of wrap things up and then also kind of bizarre things and I loved that idea that there's this individuality this unique missed a human life and I think all things considered sometimes highlights that which I really appreciate it\nWhen I gave my contribution I decided to become a sustaining member mainly because it was just the easiest way and into my budget instead of a one time during ... and it was much easier to do for months and also there's the opportunity to do a little more\nYou can do a little more at whatever level is right for you at ... dot org or eight hundred\nTo two two forty seven eighty eight your support makes Georgia Public broadcasting\nA stronger more vital part of your life and our communities across George and beyond but time is running out half we heard from you yet we're looking for seven colds or clicks and the next five minutes why for thirty be the next caller we receive to keep us on track before for thirty at eight hundred\nTo two two forty seven eighty eight or ... dot org\nAnother four and a half minutes to get those seven calls are cliques that eight hundred to two to four seven eight or online at gp beat ...\nForty seven eighty eight or G. P. B. dot org\nAbout another four and a half minutes to get those seven calls their cliques that eight hundred to two to four seven eight or on line and G. P. B. dot org and as an added bonus we're going to throw you in on this drawing for a thousand dollar visa gift card\nUh this one thousand dollar visa gift card is easy to use and its welcome at any of the millions literally millions of locations where visas accepted even online called eight hundred to two to four seven eight eight go to a G. P. B. dot org this drive is scheduled to end in just a couple of days so do your part right now\nWe're working together to wrap up this fund drive successfully by for a ride day your support will help to get us there at eight hundred\nTo two two forty seven eighty eight there are so many ways to participate in your community maybe you volunteer your time or support the organizations who believe in\nWell CPB is part of your community we keep you connected to what's happening with exceptional reporting and we entertain you with shows like wait wait don't tell me and asked me another\nWell right now we're asking you to join the G. P. D. community become a supporter now in the final days of this fund drive you've been meaning to do it now is the time please make your contribution at ... dot org or call us at eight hundred to two two forty seven eighty eight every\nListener every contribution makes a difference to be the next important and generous listener that we hear from right now join Jennifer my car and from savannah and grant Wallace from Atlanta Gregory mid dad from millage veil calls and clicks coming in from listeners across the state of Georgia\nWho want to keep all things considered a as a constant companion for them in their car in their home while they're fixing dinner whatever it is that your doing right now\nAll things considered is coming to you because of people just like you who gave that support or to help us continue to bring it out so well we want to do that we want you to help us that eight hundred to two to four seven eight eight or online at gp beat out\nThe time is running out on this fund drive every gift to support makes a difference we rely on you to make your contribution now we have an update we're looking for five calls or clicks by four thirty five calls or clicks the eight hundred to two two forty seven eighty eight or G. P. B. dot org\nListeners support the funding that comes from people like you build a strong foundation that helps cheap TBB more independent and less reliant on more vulnerable funding sources so if you weren't CPB to keep providing the services and programs you rely on\nTBB more independent and less reliant on more vulnerable funding sources so if you weren't CPB to keep providing the services and programs you rely on\nThem to help strengthen our base with your financial support\nDo not put it off until the last day do your part right now because they're thinking about it and you're going to get busy you know you are you're listening right now so just take a couple of minutes and do the right thing the amount is up to you what ever is right for you a dollar a day five ten Fifteen dollars a month\nDonate on line at gp beat out or just click the donate button at the top of the page or we would love to take your call at\nEight hundred to two two forty seven eighty eight thank you so much for supporting ...\nSupport for TB comes from you\nOur listeners and Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot edu\nAnd Atlanta parents' fifteenth annual family festival Saturday October sixth featuring fifty plus fun activities performers story telling and exhibits for more information visited Atlanta parents dot com slash family festival\nI'm an outlier in two ways I mean I was a lawyer for signing the letter in the first place was only twenty three out of the hundred and sixty some members of the class who signed it in the first place so that made me a liar and certainly an outlier along with my Proctor and withdrawing from the letter [noise] um so it's it's really only the two of us\nAre amongst that whole group who who did both things do you still consider him a friend\n[noise] yes I I I Hope that we can have a friendship I'm I suspect you might be screened in my calls right now but uh I Hope not\nMark all sorts of Yale Law school classmate of Supreme Court nominee Brett Kavanaugh thank you very much thank you and professor officer now teaches law at the University of St Thomas and St Paul Minnesota\nThe federal government wise so I'm prepared to carry out the Trump administration's policy of separating migrant families earlier this year\nThat it wasn't even ready to has the children nor did he even had a plan to reunite them with their parents that is from a scathing report from the homeland security department internal ...\nThe children nor did it even had a plan to reunite them with their parents that is from a scathing report from the homeland security department's internal watchdog this week\nThe administration has abandoned its policy of separating families to deter illegal immigration but only after widespread outrage and after more than twenty six hundred children were already separated from their parents\nTo talk more about the d._a. chess inspector general's findings were joined by NPR's Joel Rose angel hey also so you know we've been hearing all year about the problems with this policy of separating families but why isn't new in this report that contradicts what we've been hearing from the administration\nWill it contradicts some early assurances that we got from federal officials as this policy was being rolled out here's da chest secretary cures Nielsen\nIs important in it that these miners are very well taken care of I don't believe the press they're very well taken care\nBut this report paints and much less rosy picture the inspector general found that da chess held hundreds of migrant children in border patrol facilities well beyond the legal limit of Seventy two hours in fact federal officials held more than eight hundred migrant children for longer than that including one child who was held for twenty five days\nAnd many of these children were held in metal cages and border patrol facilities near the border\nUntil the government was able to find space in shelters that are equipped to has children\nAnd as we mentioned many parents and children had trouble finding each other in the system after they were separated\nWell again at the time officials denied that that was a problem remember here's Alex aides are the secretary of health and Human Services speaking it back in June before Congress\nThere's no reason why any parent would not know where their child is located I could with with just basic keystrokes within seconds could find any child in our care for any parent\nHGH s by the way cared for children after they were separated while da chess had custody of their parents and at the time da just said there was a central database of the locations of parents and their children\nA central database did the inspector general find that central database\nThe inspector general found no evidence that there was such a central database the two agencies actually had computer systems that could not communicate with each other and the inspector general found that when distraught parents tried to track down their children the government sometimes gave them inconsistent or just wrong information in some cases parents couldn't communicate with their kids at all\nThen what happened to those families\nGovernment was ordered to reunify them by a federal judge and it has reconnected\nKate with their kids at all then what happened to those families\nThe government was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the inspector general's report says that this lack of communication made that reunification process slower\nAnd the process was especially hard for children who are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children it anyway no wristbands and no photographs of them were taken so it was only through communication with the parents that that authorities were able to find these children and reunite them\nStill have federal officials responded to the inspector general's report in any way\nWell as the administration often does it is blaming quote immigration laws that are broken and poorly written unquote\nPh as does say that it deserves some credit for working quote exhaustively to reunite these families although again they were ordered to do so by a judge but the H. S. also acknowledge that the government's computer system still do not communicate across these agencies\nAre there any children who still haven't been reunited with their parents\n[noise] oh yeah more than a hundred and thirty remain in us custody apart from their parents mostly because those parents have already been deported without them back to Central America\nAll right That's NPR's Joel Rose thanks very much Jill\nYou're listening to all things considered from NPR News [noise]\nMontana has become a popular campaign stop for President Trump and vice president Pence\nSo popular that each of them has been there twice in recent months that's because Republicans are trying to unseat two term democratic Senator Jon tester during ... second visit there yesterday he fired up a rally talking about Brett Kavanaugh's nomination to the Supreme Court Montana Public Radio's Eric Whitney reports\nIn a state that President Trump won by more than twenty points tester emphasizes that he can work with Trump he's run an ad listing Nineteen bills you supported that Trump is signed\nSo when vice president Pence spoke in Bozeman yesterday he painted test her as a reliable and reflects of member of the Democratic resistance\nPence spoke in Bozeman yesterday he painted tester as a reliable and reflects of member of the Democratic resistance\nThe or the latest allegations that fully investigated\nSaturday does is already a now voting no on just just like even though we're ...\nTest or didn't take a position on Kavanaugh's confirmation until after last week's hearings were over and then came out against Kavanaugh citing first his record on privacy issues and support for the Patriot act\nFor those reasons and all of the reasons that were brought up last week [noise] um I made a decision to vote no on judge Kaplan I I don't think he has the merits nor the background to uh meet the needs of Supreme Court\nRepublican challenger Matt Rosendale says he'd be a more reliable ally for President Trump and cited the Supreme Court vote as an example\nMyself and a lot of the people are ... are very disturbed with the way this entire process was handled there is a man who has a commendable record and\nCase it'd be serving on the bench an absolutely I Would vote for him\nOn paper standing firmly with President Trump would appear to be a winning strategy in Montana the population here skews older and wider than the U.S in general Montana also has the second highest population of veterans per capita of any state guys like Jim hunting film [noise]\nRetired after Twenty years in the navy ending felt now volunteers at the airport\nIn Missoula helping arriving tourists he voted for President Trump\nGonna mess around with this country where to do something there's no cross or wind a red line\nTo while heading failed says the hell no didn't vote for President Obama like many Montana voters he isn't easy to pigeon hole\nHe says he's voted for tester before and for Democratic governors Steve bullock in twenty sixteen and he says a candidate support for the president or testers vote on Kavanaugh's nomination won't sway his choice\nBecause I don't use it as a platform to make my decision\nStill plenty of voters do see their vote as a sign of support for President Trump\nBozeman retirees Suzie Burton was at a senior community center yesterday near where vice president Pence was holding his campaign rally\nI think a precedent marvelously actually [noise]\nKeeps his promises\nWell I think a precedent marvelously actually\nKeeps his promises\nAnd not many of them do\nWell President Trump is front and center in the Senate race here identity and local issues also matter for example tester has put Rosendale on the defensive about whether national forest in Montana could be privatized Rosendale initially opposed federal land ownership but says he's now convinced that that's not what people want\nAnd test her leans hard on his image as a third generation farmer Rosendale move to the state in two thousand two after a career as a Maryland real estate developer\nVoters will be watching closely Saturday as the to debate one last time before early voting starts later this month for NPR News I'm Eric Whitney in Missoula, Montana [noise]\nThis is all things considered from NPR News\nThank you for tuning into all things considered on listener supported CPB a family of listener supported public radio stations across the state now including eighty eight point five gp the Atlanta I'm Ricky ... and all things considered as a place where you expect to hear stories like we just heard reported by Eric Whitney from\nMontana about a tight Senate race we hear a lot about the Republicans holding on to the house and Senate well the mid term elections are really a big deal in Georgia and nationwide and that's just a great example of for a minute long end up looking at a very serious race out of Montana\nJust because it isn't happening in Georgia doesn't mean it isn't really important to us here\nWell time is running short on our fall fund drive this is your opportunity to invest in this kind of journalism right now we're asking you to join in this critical effort to keep this kind of news coverage to keep the conversations that you rely on coming to you the amount that is up to you\n\n[noise] from the University of west Georgia his mind be point seven FM Wu WG and W.\nG. H. G. Carroll the Georgia Public broadcasting radio network\n\nDouble Eugene and double your age do Gerald Ford of Georgia Public broadcasting radio network\n[noise]\nWhy from the TPP newsroom I'm Ellen Reinhardt members of several civil rights groups in the state or joining a federal lawsuit set to be filed against Georgia secretary of state\nThe suit initiated by a journalist researching an article for Rolling Stone magazine accuses Brian Kemp of using racially biased methodology to purchase many as seven hundred thousand legitimate voters from the states rolls over the last two years\nAccording to W. N. A. Z. T. V. the suit asserts that are purge list was generated by across check software program supplied by the Kansas secretary of state and later used by other states kept denies the allegations saying zero voters have been removed from Georgia's roles based on cross check data\nCan faces Democrat Stacey Abrams in the November sixth gubernatorial elections\nThe Augusta Chronicle reports American Airlines will offer direct flights from Augusta to Dallas Fort Worth international airport beginning in March Augusta regional airport officials say there will be one departure in a rival each afternoon beginning march third currently American only flies to Charlotte hub from Augusta\nDelta also service says Augusta regional airport with flights to Atlanta\nThe government says thirty eight people in seven states have gotten sick from eggs produced by an Atlanta ... an Alabama poultry farm the food and Drug Administration says the illnesses are linked to salmonella tainted eggs from grave ridge farms\nThe FDA says ten people were hospitalized after coming in contact with cage free eggs from the farm but no one has died the government says recalled eggs were sold to several grocery stores in Georgia Tennessee and Alabama\nAnd the forecast partly cloudy skies state wide tonight with fog creeping in across much of Georgia by morning those will be in the upper sixties and low seventies it's five oh one\nLive from NPR News in Washington I'm ... we're the White House is defending President Trump's comments about Christine Blasey Ford who's accused Supreme Court nominee Brett Kavanaugh sexual misconduct goes around scores more\nWhite House press secretary Sarah Sanders says Trump was not making fun of for during his remarks Mississippi campaign rally during the event the audience laughed in a plot as Trump question for the count of the alleged sexual assault\nSeemed to me that he was stating facts that Dr for herself a laid out in her testimony once again a every single word that judge Kavanaugh has said has been looked at ...\nActs that Dr Ford herself a laid out in her testimony once again I every single word that judge Kavanaugh has said has been looked at everything and then picked apart by most of you in this room\nCanonized categorically denied allegations of sexual misconduct some Republican senators have complained that Trump's remarks were inappropriate ... NPR News the White House\nThe murder trial of Chicago police officer Jason Van Dyke will soon be in the hands of a jury as Patrick Smith from member station WB easy reports fan dykes attorneys wrapped up their defense today\nThe defense called twenty witnesses over the span of more than a week much of the testimony was aimed at trying to undercut a dash cam video showing Van Dyke shooting Seventeen year old the one that Donald sixteen times\nThat video at the centerpiece of the prosecution's case it shows McDonald walking away from police and Van Dyke keep shooting until his gun is empty even while McDonald is laying on the ground\nProsecutors called the former FBI agent and use of force expert who testified that the shooting was unjustified on Tuesday then I took a stand in his own defense he choked up describing the shooting and he testified that he was in fear for his life when he shot closing arguments are scheduled for Thursday for NPR News I'm Patrick Smith in Chicago\nSecretary of state Mike Pompeo says he is cancelling a treaty with Rhonda dates back all the way they're Nineteen fifty five establishing economic relations and consular writes between the two nations\nThe move comes on the heels of a ruling by the United nation's highest court ordering us to lift sanctions against Iran\nIn fact imports of humanitarian goods store does not enforceable\nPompeo telling reporters day the ruling is disappointing but also a loss for Ron this is a decision frankly that his thirty nine years overdue around alleges sanctions imposed by the Trump Administration after the U.S withdrawal from twenty Fifteen nuclear deal violate the Nineteen fifty five treaty\nPrivate sector jobs report out ahead of friday's broader base government data on hiring show solid gains last month payroll processing from a deep pie says private sector companies out of two hundred and thirty thousand jobs in September the most in seven months there were games in construction professional in business services and education\nOn Wall street today stocks close broadly hired the Dow Jones industrial average up fifty four points to twenty six thousand eight twenty eight that's a record high but as that goes up twenty five points the U.S and the five hundred closed up two points today you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for ...\nWould closed up two points today you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring or employers can post jobs and use greener question to build their short list or preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting is all things\nConsidered on listener supported gp be good Wednesday ... ten in the wake of sexual assault allegations against his Supreme Court nominee president Donald Trump has been talking about how men feel in such situations\nCould that help his party and the twenty eight in elections\nThat story ahead of the next ten minutes but first public radio works because listeners who value programs like all things considered\nDo their part to keep them on the air that means we're looking for you to do your part right now\nTime is running out on our fall fund drive we're working on a goal of wrapping up this Dr successfully with your support in just two minutes two minutes you make a big difference in the program to expect and enjoy and\nYou help us get that much closer to the end of this Dr\nProgram costs are on the rise so your support right now is especially important while you're thinking about it before you're night gets too busy please go now to cheap eat out Oregon click donate or call us at eight hundred to two two forty seven eighty eight thank you for your support I'm here with bart\nWesley half that and we have set a new goal as we move into the second hour of all things considered for the next thirty minutes until uh\nFive thirty were looking for twenty eight twenty eight calls or collect sets you and twenty seven others calling eight hundred to two to four seven eight eight going online to G. P. B. dot org\nWere working together we need your help to wrap up this fund drives successfully by friday it's your support that's going to get us there you're going to push us over that line so called eight hundred to two to four seven eight eight or go to a G. P. B. dot org the one of twenty eight and the next thirty minutes or so [noise]\nSupport for deep ... comes from generous listeners like you and eagle eye books located in Decatur an independent bookstore for readers of all ages featuring new and used titles and knowledgeable staff to guide any search online or in person or an eagle eye books dot com a great time for good books\nAnd Georgia State university gp Atlanta is license to Georgia State university nationally recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot EDU\nHe recognized as a leader and innovative programs that help students are in their degrees more information is available at G. S. U. dot edu\nBruce was all things considered from NPR News I'm Ari Shapiro and I know that Chang a vote on Brett Kavanaugh's nomination to the Supreme Court could come as early as friday Senate majority leader Mitch McConnell wants it to happen this week though he hasn't scheduled and yet he\nAnd the rest of the Senate or waiting on the FBI to finish its investigation of sexual assault allegations against Kavanaugh\nThree Republicans who could determine the judges fate say they need to see that FBI report first before they make up their minds with us now to talk about the latest is NPR's Scott Detrow who joined us from Capitol Hill have got a also\nAre saying the FBI could complete this report and send it to them as soon as today which would be early because the FBI was given a full week to do this\nDoes this speed give us any clues about the scope of the report\nWell we got one clue in the ... just just while earlier today we know now that the FBI has not yet talked to one key witness and that's Christine Blasey Ford\nHer lawyers say as of today she has not been contacted by the FBI a lot of top Republicans are fine with that I asked John Cornyn the number two Republican as he got into an elevator earlier today\nWe heard from this\nOf course referring to last week public testimony a Judiciary Committee chairman Chuck Grassley has said something similar Democrats say this makes no sense of the whole point of following up was to confirm or dispel what Ford and Kavanaugh said so the FBI should follow up here's Democrat Richard Blumenthal who's a former attorney general\nThe weeds or follows\nThe interviews create additional questions\nSometimes they're re interviews [laughter] very common\nAnd that's an investigation it's got to be more than just check the box okay\nThey're account OK so clearly there is a big split between Republicans and Democrats are talking about this that split was even more parent last night President Trump spoke at a rally and he mocked Christine Blasey Ford's testimony against Kavanaugh let's let's take a listen to a bit of that\nHow did you get home I don't remember how did you get there don't remember where is the place I don't remember how many years you don't want to [noise]\nWe had been saying all along Scott that Kavanaugh's confirmation comes down to a few key Republicans in the Senate how are they responding to what the president said last night\nNot well Arizona Senator Jeff flake said\nTo a few key Republicans in the Senate how are they responding to what the president said last night\nReally not well Arizona Senator Jeff flake said that what Trump said was kind of a polling\nTo pay for it listener dollars go directly into paying for the programs that you rely on the amount is up to you it might be a dollar a week a dollar a day ten dollars a month\nNo matter the amount we're looking for you to not put it off any longer do your part while you're thinking about it because public radio is stronger and better with your support don't let another hour another day or another fund drive go by without doing your part please go now to cheat at work or eight hundred\nTo two two forty seven eighty eight is the number to call thank you for doing your part here with me is ...\nAnd we have a lot of ground to cover in these final days of this fund driver looking to hear from you right now and we're looking for night teens I five thirty just a little goal update for you there were down to ninth team by five thirty that's you and I seen others calling eight hundred to two to four seven eight eight or going online to gee maybe that ordered now\nWhat would you do if all of a sudden you had a thousand dollars to spend any way you choose now is your chance for that to happen\nBecause when we hear from you now you'll automatically be included and are trying to win a one thousand dollar visa gift card eight hundred\nTo two two forty seven eighty eight that's the number to call to enter or go online to cheap ... dot org and when we hear from you we hope that you will also make a contribution to G. P. D. or listening right now that means you value this service\nThink about putting some financial backing to keep this service strong don't put it off until the last day do your part right now it entered to win a one thousand dollar visa gift card at eight hundred to two two forty seven eighty eight or ... dot org\nMy I'm Cindy hill statewide host of all things considered on CPB based at ... news bureau in Savannah and my reporting takes me out into the waters along Georgia's coast from the growing oyster industry\nReally are tuned into your or you are\nThe effects of warming ocean water on Georgia shrimp when it gets cold day just starts slowing down slowing down if it gets too cold well they never start up again I talk with scientists wildlife experts and fisherman bringing you stories of what's happening in Georgia's water so we also followed George ...\nWell they never start up again and I talked with scientists wildlife experts and fisherman bringing you stories of what's happening in Georgia's water so they also followed George and sea turtles aren't sure\nRoseville thing an increasing trend\nIn things so that really good news for longer relations with Georgia\nAnd introduce you to coastal burns like Cumberland Island snowy eager it now minted on us quarters of\nThe native bird is absolutely beautiful bird that draws a lot of attention to its size and its beauty\nCovering the coast bringing you the story each day on the air and online he make all of that and more possible makes for listening to TV and thanks for your support [noise]\nWe're looking for your support it CPB dot org or eight hundred to two two forty seven eighty eight your support makes Georgia Public broadcasting a stronger more vital part of your life in your community is across the state and beyond your support helps pay for coverage of Georgia's coast that are wonderful natural ah\nEnvironment so many great stories that CPB reporters bring you every single day and this is your opportunity before our time runs out have we heard from you get ... dot org or eight hundred to two two forty seven eighty eight\nAnd there are lots of ways that we can say thank you during this drive one of them I think is especially cool is our window to the world's combo when you make your gift to Fifteen dollars a month as a gp sustain or we can send you to thank you gifts one is the brand new window to the world\nA long sleeve blue T shirt has this great looking graphic on the front or that his brand new for this campaign\nAnd the matching mega Moby goes along with another shirt comes in size is from small through double I sell it is a hundred percent cotton and that ... that Meg I'm August porcelain and holds twenty full ounces of your favorite beverage\nYou cannot you know you have that at work for a day's worth of coffee or at least certainly soup I think once we said there was a Super Bowl with a handle\nHundred to two to four seven eight eight go to G. P. B. dot org make that give to Fifteen dollars a month as a gp sustain or will say thank you with the window to the world combo [noise]\nHi my name's Brent tough I live in ... park\nI like to Georgia wide\nBecause of the station as opposed to being Atlanta center\nAt the local content in context that I get from listening to to keep me be\nIt's my state to state I was born in ... and it really is important to me\nThat I get from listening to [noise] to keep me be\nIt's my state to state I was born in ... and it really is important to me to know what's\nGoing on in Georgia for people that don't contribute 'cause they think you know I couldn't afford much and and so it's not worth it but it's really the people that are contributing big\nBucks that matter and it's it's just not true I mean the station survives on the small continuous donations of listening audience so whatever your reason as it it feels really good to give and not the living off of other people's donations and [noise]\nI can speak from experience once we started contributing it changes the dynamic dramatically you are here at a different place in your life you're supporting public radio and here to start a fire will continue [noise] I Can't imagine life without uh\nYou have a needing to support CPB because you can't imagine life without cheap ... so now at the time to support it at ... dot org or eight hundred to two two forty seven eighty eight as we just heard she PBS special\nThat only because we bring you a great program so because we bring you state wide coverage of Georgia and no matter where you live in our state we're able to connect you with stories\nThat only from your community but from communities across Georgia's so you're fully aware and engaged with all of the issues voices stories coming out of Georgia the impact all of us\nThis is worth your investment at whatever level is right for you at CPB dot org or eight hundred to two two forty seven eighty eight\nMost important in reliable funding for all those programs that enrich you connect you with the world it all comes from you have you made your contribution yet we count on you to help us cover those costs of the programs you here and when you do that you're going to help us in this campaign successfully by friday only just a couple of days away\nAh Richard from Alpharetta, Georgia called in and said I Love political rewind such a fan of the local\nCoverage that we bring you hear an G. P. B. and also in terms of and I said I Love GPS ill educated every day but the quality of the shows and information I especially love fresh air and the political shows that you offer wheel of hearing your comments when you call that eight hundred to two to four seven eight eight or click on line to G. P. B. dot org\nAnd join in those eight that we're looking for gold we're down to eight by five thirty or seven you and seven others calls or click that eight hundred to two to four seven eight eight or online at gp beat out or\nGold we're down to eight by five thirty seven un seven others calls or click that eight hundred to two to four seven eight eight or online at ... dot org and\nWhen we hear from you you'll automatically enter a drawing to win a one thousand dollar visa gift card a prepaid visa gift card good anywhere visa is accepted we have a lot of ground to cover in the final hours of this fund drive we're looking to hear from you right now before your evening gets too busy\nIt just takes a couple of minutes and you'll have done your part to support your own public radio habit and enter to win a one thousand dollar visa gift cards what a great opportunity for you to make an impact on the TV and possibly walk away with a thousand dollars in your pocket\nCPB dot org or eight hundred to two two forty seven eighty eight\nJoined Jeff dinner from saint Simon's island pat task from Marietta Robbie Walton from Jonesboro calls and clicks coming in from around the state of Georgia that is\nProof positive that G. P. B. is such a resource to the entire state we're sitting in Atlanta Georgia right now but we are connected to so many other parts of the state of Georgia\nBecause of the news bureaus the GB has in Savannah and then making in Columbus that's the power of a public broadcasting system that it's state wide\nYou want to you want to have that news and information coming to you from all over the state so supportive Colleen hundred to two to four seven eight eight or go to a gp\nWe're looking for five calls in clicks and the next three and a two and a half minutes by five thirty\nFive calls and cliques that eight hundred to two two forty seven eighty eight or G. P. B. dot org we're working together to wrap up this fund drives successfully by friday\nYour support will help get us there it seems to listeners before you have already done their part the GDP is here for you every time you want and need us we're so grateful to everyone that we have already heard from\nBut if we have not heard from the unique get right now we're asking you to do your part this is a group effort it feels so good to join the community of GDP listeners who are also supporters and the amazing thing is that the amount is up to you\nWhat ever you choose to give is a great it's a great place to start what counts most right now is that you participate by going online to G. P. D. dot org or by calling us an eight hundred to two two forty seven eighty eight and remember when we hear from you\nYou will automatically enter are drawing to win a one thousand dollar visa gift card but time is running out on this drive and time is running out on this drawing today to win\nYou will automatically enter are drawing to a new one thousand dollar visa gift card but time is running out on this driving time is running out on this drawing today to win a one thousand dollar visa gift card eight hundred to two two forty seven eighty\nEight or G. P. B. dot org and thanks\nSupport for TB comes from you our listeners and Ogle Thorpe University in Brookhaven working to make a private college education possible for more families in Georgia complete information on their new flagship fifty program is available at ... dot edu\nAnd Peachtree orthopedics helping Atlanta heels for over sixty five years with specialist for every body part from regenerative medicine to outpatient join and spine surgery their goal is to help people feel better faster peach tree orthopedics dot com [noise]\nBut there was one time the father pushed back against his son Donald Trump was beginning to suffer from dementia\nDonald Trump tried to change his father's well what happened\nThat was right in Nineteen Ninety at Donald Trump's darkest financial moment he was facing being forced into bankruptcy by his creditors and he had some lawyers right up a ... a change to his father's will that would give him much more control over all those assets\nHe couldn't tell his father or his siblings who was doing this he just had the lawyers show up at his father's house I believe it was and put the piece of paper in front of him\nHis father or somebody in the room realized right away this is not where we want to go with this man he pushed back and ultimately called Donald Trump sister who was then a federal judge lawyer obviously and ask her to intervene and to make sure that\nDonald's creditors couldn't come in and pillage Fred Trump's empire and Donald we wouldn't have any more control or\nInfluence over the state than any of his other siblings would\nThe White House has responded to your reporting by attacking the New York times and saying that the IRS looked at these arrangements as they were happening and found nothing improper how do you respond to that\nSporting by attacking the New York times and saying that the IRS looked at these arrangements as they were happening and found nothing improper how do you respond to that\n[noise] well we think that's not true um we know there are cases where there was no audit done like all county building that we spoke about the transaction Trump Palace\nAnd the cases where there were audits there's evidence that the Trump didn't give the IRS all the pertinent information about those buildings and that the appraiser\nGrossly undervalued some of the properties\nRuss ... is an investigative reporter for the New York\nTimes thanks for joining us today Thanks for having me or\nThe New York times story you just heard about says that Trump's were able to get away with tax dodging for decades and there's no evidence that state or federal officials ever did much about it and NPR's Jim Zarroli reports regulators were either unwilling to take that Trump's on or is simply lacked the resources to do so\nReal estate companies such as the Trump families are famous for finding ways to pare down their tax bills and some of them skirt the law they can understate the value of a property they've acquired for instance\nBut NYU law school professor Daniel Shapiro says the sheer scope of the Trump family's tax avoidance puts it in a whole other realm\nI don't think this is just like oh this is tax funding as usual as one thing to have a self serving valuations that are in the mobile side but it seems to go beyond it\nYet much of what the Trump did apparently went under the radar for years\nThat doesn't surprise pace law school professor Bridget Crawford she says the Internal Revenue service for decades to simply lack the resources to police tax fraud effectively and years of political attacks may have made it reluctant to take on hard cases\nWhere there's a will there's a way and there has been now with\nOnly one in a hundred tax returns is now audited and Crawford says it's especially easy to do what Fred Trump is alleged to have done pass on assets to your children without them paying much in taxes\nThe fact is that gift tax doesn't raise a lot of revenue also to the extent the IRS has resource as they are not going to be allocating at tort gift tax enforcement\nThe same is true at the state and local level although New York state officials are now investigating the Trump families taxes Crawford says it's taken them far too long to do so\nIt's curious to me that the state department of finance has been utterly asleep at the wheel for decades [laughter] when it comes to a ... on the Trump family\nCrawford notes that questions have been\nUtterly asleep at the wheel for decades [laughter] when it comes to a transactions on the Trump family\nCrawford notes that questions have been raised about the Trump families taxes for years for public eye has reported that President Trump sold to Manhattan condos to his son Eric for much less than they were worth twenty sixteen\nBut because Trump hasn't released his tax returns it's impossible to say whether Eric Trump paid federal gift taxes as he was required to do\nBut the extent of the activity alleged in yesterday's times story is harder to ignore\nThe question is what regulators can do about it and why use Dan severe arose as if fraud was committed it's probably too late for the government to pursue a criminal case because of the statute of limitations but severe says the IRS can always decided to take another look at the Trump returns\nOn her return means that it's never too late to revisit it\nIf the IRS find evidence of wrongdoing severe says it can retroactively force Fred Trump's heirs to pay back taxes and they may have to pay civil fines as well Jim Zarroli NPR News New York\n\nAnd you're listening to all things considered from NPR News\n[noise] there's a new mandate for corporations in California by the end of next year publicly traded companies headquartered there must have at least one woman on their board and I'll have to phase in more by the year twenty Twenty one diversity advocates I've spent years pushing for this and not just in California\nMen hold about eighty percent of the board seats with us and the five hundred companies but there are lots of reasons why other states might not follow California's lead cake you read these Louis to Mali reports from San Francisco\nThe idea that companies must now make room for women on their boards might sound good but California's new mandate is in the past many would've chosen carrying can only speak standing at the communications consultant for the biotech industry\nI got one o'clock because any movement towards gender equality and a great thing but on the other hand you want to cry because I Can't believe they'll pay twenty eight pain we need a bill and mandate gender equality\nCalifornia Governor Jerry Brown signed the bill into law he had knowledge it contains flaws that could quote proved fatal to enacting at the main one it may be unconstitutional Duke law professor Kim ... says a pony\nIn laws that could close proved fatal to an acting at the main one it may be unconstitutional Duke law professor Kim ... says opponents could challenge the law on the grounds that it violates equal protection guarantees by discriminating against men and failing to address marginalized groups besides women\nAfrican Americans a Latino and Latino candidates Asian American candidates are all under represented there is a similar law but is addressing them\nBut corporate America is watching Serena phone is an executive with catalyst a nonprofit that advocates for the inclusion of women in the workplace she says studies show companies with women on boards perform better\nI was actually very surprised that the bill got passed and signed into law the minute that you started talking about gender diversity in the boardroom people what can you oh they're talking about what we do not like ... which is not talk about it at all\nNow California could lead the way for others to follow telling the gal any is the director of the center for equity gender and leadership at UC Berkeley business school she cites what happened when Massachusetts barred companies from asking for salary histories\nNew York city followed on the previous salary as did San Francisco so you do see states and cities are mirroring one another on these sorts of pieces of legislation\nThere's national movement to representative Carolyn Maloney of New York has twice front legislation requiring companies to disclose the gender of directors before Congress she pointed to this grim projection even if half of all new board seats went to women it would take for decades before they\nHold an equal number of seats in board rooms across America for NPR News I'm ... in San Francisco\nAll things considered as a production of NPR News which is solely responsible for content\nLike a story you heard on this or another NPR program share it with a friend at NPR dot org while there and you can also hear stories you miss enjoy expanded content or connect to your favorite member station wherever you are at the NPR app for your mobile device\nYou can also lean back and enjoy NPR dot org optimized for the I ... this is NPR\nNews\nYou can also lean back and enjoy NPR dot org optimized for the AIPAC and this is NPR\nNews\nThis is all things considered on listener supported Georgia Public broadcasting good Wednesday I ... and\nMarketplace starts in just ten minutes before we get to work a place it's six o'clock\nI'm here to remind you that it is your financial support that keeps all things considered marketplace MORNING EDITION fresh air this American Life all of the programs you listen to here for you and she ... the amount of support is up to you it might be five or ten dollars a month for all of a listening you do\nWe're coming up on the end of this fund drive so right now we're counting on you to help keep gp be strong for you and for your community before time runs out don't put it off until the last day do your part right now whether you're listening in Atlanta or Athens savannah Macon\nAugusta Columbus Albany please support CPB right now with a phone call to eight hundred to two two\nForty seven eighty eight or you can give to carry on line at ... dot org thank you so much for your contribution I'm Harrisburg Leslie Hoffman\nAnd you may remember we took about a day and a half off of the drive last week to bring you some breaking news coverage from pizza from NPR and that was very important that we do that because that's the mission of G. P. B. to bring you that news and information that enriches your life that connects you with the world\nDeliver and stole\nFrom the University of west Georgia was Ninety seven FM Wu WG and W. W. G. H. D. Gerald Ford of Georgia Public broadcasting radio network\nSupport for G. P. B. comes from our monthly sustain yours\nAnd Hartsfield Jackson airport offering a new ATM rewards program participants can earn points for parking dining and shopping and redeem them for miles hotel stays in more complete information at ... dot com slash wards\nAnd Georgia State university ... Atlanta is license to Georgia State university a major contributor to the economic and cultural by talent\nEmail dot com slash warts and Georgia State university ... Atlanta is license to Georgia State university a major contributor to the economic and cultural vitality of downtown Atlanta and the metro Atlanta area more information is available at G. S. U. dot edu\nNow is the time to call her click to support public radio and help support programs like marketplace which starts next at six o'clock thank you for contributing at ... dot org or eight hundred to two two forty seven eighty eight\n[noise]\nSupported by the financial services primitive Raymond James offering personalized wealth management advice and capital markets expertise with a commitment to putting clients financial needs first more Raymond James dot com I mean this is a smart thing to do but it's also\nI don't just guess what the future as I say what is the more you're possibly be and can we handle it Jimmy ... and the C. E. O. J. P. Morgan Chase on the program today from American public media\nThis market for [noise]\nMarketplaces supported by ... online test prep for the ACC SAT G. R. E. N. G. mat that's designed to improve scores students can get video lessons practiced questions and experts support on line and ...\nAnd by the three I O T addressing the world's most challenging problems that the convergence of artificial intelligence I O T tend to last a cloud computing Morrissey three I O T dot AI\nHand eye intercom business messaging platforms who's Chapman automate manuals sales and marketing tasks like qualifying leads in scheduling demos learned more an intercom dot com [noise]\nTo Los Angeles on ... result is Wednesday today the third of October get as always to have your long everybody Jimmy diamond coming up and just a little bit four minutes from now give or take what we are going to begin today with a well one hesitates to use the word and wonky someone will hedge by saying slightly weedy economic fundamental\nComes to us by the New York times expose and President Trump and his family finances the times reports the president took part in quote dubious tax schemes and another quote outright fraud but let his father transferred to the president\nAt least four hundred and Thirteen million dollars and that is in today's money and in the process minimize the tax burden or for the president we should say denies any claims of tax fraud or tax evasion and in a tweet this morning the president said quote the failing New York times did something I've never seen done before\nFor the president we should say denies any claims of tax fraud or tax evasion and in a tweet this morning the president said quote the failing New York times did something I've never seen done before they use the concept of time of value of money and doing a very old boring and often told his piece on me out of court\nSetting aside for just a moment the old boring and often told a bit what exactly is the time value of money and what does the president think it has to do with the times piece on him and his taxes marketplaces Mariel cigar gets into\nThe value of money is well I'll let Jennifer ... explain she teaches tax law at the University of Kentucky\nA basic concept is that a dollar today is worth more than a dollar tomorrow for\nA dollar or next week\nYou can do more with that dollar if you have it today than if you have to sit without it for a week\nYou could invest it in the stock market put in a savings account or an interest use it to buy real estate times ... teaches business at Cornell and he says the time value of money is fundamental to business decision making let's say on a manufacturing company you're deciding whether to expand and existing factory or build a new one\nThe new factory may take longer to come up and running but then maybe it has higher returns in the future\nSo you need to think about whether those higher returns will make up for the last time when the factory is being built and your investment isn't making money Jeffrey fossil men at the wealth management firm relative value partners says this concept matters to individuals to he says sometimes clients want to keep money in cash rather than risk losing it\nThey're talking about the merits of investing versus not investing there's a cost associated with not investing and that is due to the time value of money\nIt's not clear what President Trump was referring to when he tweeted about the time value of money he wasn't specific and the times story doesn't mention it the writers did adjust all their numbers for inflation expressing them in what's known as today's dollars but that's a different concept ... for marketplace\nOne hopes would explain it to guys right I mean right anyway self driving cars are the future as we know the only question really is how much that future is going to be worth and\nWe've got a hint of unanswered today Honda announces morning it's going to invest seven hundred and fifty million dollars in GM's autonomous car unit with another two ... billions of dollars coming over the next twelve years\nBut as a whole lot of money going into products that bright now at least or more fantasy than reality as marketplaces Justin report the next generation of autonomous cars\nThat is a whole lot of money going into products that right now at least are more fantasy than reality has marketplaces Justin ... reports\nThe next generation of a ton of his cars not something you can turn out by your company's next board meeting Michelle Krebs that traders as self driving car projects need serious investments\nThis is a really expensive venture we don't know when they'll be with us and profitable\nHunting is investing in GM self driving car unit which isn't working on driverless taxi and delivery services Krebs says the partnership is meant to look more Silicon Valley than Detroit that brings in more funding auto analysts Marion killers has other car companies have been following suit\nIt seems like you wake up in the morning and yet another right now and collaboration for something with someone\nToyota's working with her on a ton of his cars Chrysler's partnered with way mo Keller says automakers need partners to both invested in the future and actually manufacture cars and the present\nThey cannot force fake continuing invest in their current business model\nBut hunters partnership with GM could give both companies a competitive edge to Stephanie friendly with ... market in Detroit\n... says one of the league players in the face\nShe says GM made a smart move by acquiring the driverless started cruise even before hundreds investment GM attracted billions and venture capital and bring Li says Honda brings expertise and engineering\nThey have a terrific ability in terms of packaging and finding space inside that vehicle\nHead of GM self driving car you said it's cars could have things like giant TVs and many bars that would need a lot of space in New York I'm just into for marketplace\nWall Street is Wednesday you know sometimes I say forget stocks watch the bond market today is one of those days yes there were record highs in equities stocks in other words but that was where the action was will have the details when we do the numbers [noise]\n\n\n\n\n\n\nSeventy Park Avenue in Manhattan is about a six minute walk from the marketplace New York bureau over on third avenue ... was drizzling last friday when we're headed over to the headquarters of J. P. Morgan Chase security ministers up to the forty eighth floor where we called our heels for a little bit waiting for Jamie diamond that's on us we were early\nSo we had a chance to poke around a little bit lots of sports memorabilia on the shelves business and management books to interestingly enough make history stuff as well\nEarly so we had a chance to poke around a little bit lots of sports memorabilia on the shelves business and management books to interestingly enough bank history stuff as well diamond showed up pretty much on time we did the usual chitchat as we got settled talked about how we got into banking he's the son and grandson of stockbrokers by the way and then we got down to it\nDo you think um\nPeople understand banks in this economy like you understood banks when you were to\nSome people in the same things as a consumer so you know if you've taken a mortgage you have a checking account type of business need alone if you're a large corporation you have to sell equity your debt that they understand don't necessarily see in the inner workings of a bank\nDoes it matter what does to me but I don't I don't think it should matter to the customer now with the customer wants to do a good experience and you know good credit card in a good yeah\nYeah but doesn't matter whether American consumers understand the way the financial system works [noise]\nI think it I think it matters to understand how business in general works so if you don't have a financial system you don't have an economy\nSo defense is is just part of his great economy in America has the widest deepest most transparent financial markets the world's ever seen in total I'm including private equity venture capital the formation of business the transparency of our capital markets and no other country in the world has it it's not even close as kind of\nIt's kind of a party engine that makes us the most prosperous economy in the world\nYou come to that we just come to that not without some scars right and we'll get to the crisis or a little bit later on but but what do you think\nUm the financial sectors role in this society is what is the banks responsibility in this society I think\nThe most important thing is you help grow a prosperous economy that helps the most people\nAnd they create the wealth by which you could take care of your old you are sick you're poor and so I I think people understand that you need a healthy banking system and my daughter asked me in their financial crisis\nYou know what's your financial crises that was the kind that happens every seven to ten years I wasn't being facetious I was looking at Nineteen Seventy four Nineteen eighty two Nineteen eighty seven Nineteen Ninety and ... and one of things it makes me cautious as knowing all that\nI always always always wanted to run the bank that we can survive anything so that were there in good times and bad times and ... more important than bad times for clients\n... all the host of marketplace public radio is known mostly for news and information we covered everything from the development of democracy and other countries to stories from your town and your block nothing is off the table and as Stacy Vanek Smith reports that includes the return of a decades old hair cut the top the\nAgainst the grain barber shop in Staten Island Shaun White says when he started cutting hair twenty seven years ago high top fade was all the rage\nWill look guys they usually are treated very close and then the top is like a glory goes straight up\nThere's usually flat on my top\nTop state took the hip hop community by storm big daddy Cain salt and pepper Will Smith they all had one rapper kid of kittens play had a high top paid the ten inches high\nAbove the law here but I like it I think it's a great book dial expert George Russia thinks the high top is replacing the mohawk because it's a lot more workable at work\nIf you are in finance or you are in business you know how to rock the mohawk [noise] I think that this sort of has evolved out of the mohawk surreal versatile hair cut Russia's says subtler versions of\nHigh top bank and work on almost any one thirty year old Malcolm DR is a university administrator his high top fate is five inches high ... chose the style because it made a statement and had a professional field not that it doesn't have\nIts drawbacks Joe there's moves there's a blow dryer there's a hot comb and his article and fame and costs a lot of money and a lot of work\nDo you spend five hundred dollars a month on product and weekly shape up and then there's the labor how much time does it take in the morning six forty five minutes\nI just don't seem phased by the maintenance Barbara Shaun White says he does four or five high top paid the week I Love\nDoing that ... wearing that\nAnd I grew up learning how to cut hair on that cyber\nSays white they stand out which is good for business\nWhere everybody looks a\nDo the importance of live in\nStaten Island I'm Stacey Vanek Smith [noise]\nI'm Stacey Vanek Smith [noise]\nThat\nYou heard at the end there Shaun White he was talking about how much you like people to see their views on because it's good for him and his business plain and simple he takes pride in his work and there's a lot of repeat customers new people try him every day\nThat is not unlike public radio and your local station we have a good product that you return to again and again and just like haircuts aren't free neither is public radio your contributions or would keep us ... so please support us today here's how insects\nCall us at eight hundred to two two forty seven eighty eight or you can go online to cheap ... dot org that says marketplace on listener supported CPB\n... here in Studio ... Hoffman and we are here to remind you that it is your financial support that\nKeeps the marketplace and all of the programs you listen to here for you we're coming up on the end of this fall fund drive so right now we're counting on you to keep the be strong for you and your community before our time runs out\nWhether you're listening in Athens or savannah at laptop make in Augusta Columbus Albany Rome now is your opportunity to represent and support CPB eight hundred to two two forty seven eighty eight or ... dot org\nAnd now we're looking for eleven of you by six thirty eleven calls or click that eight hundred to two to four Seventy day or G. P. B. dot org to help us Stay on track with our goals for marketplace of the think\nCall us or click on over to G. P. B. dot org ... you're going to join in with lots of people from all over Georgia to value public media who value public radio in particular\nAnd they are the most you are the most important to unreliable funding for all the programs that inform you that enrich your life that connect you with the world have you made your contribution yet if you hadn't do it now at a hundred to two to four seven eight eight or TPP data\nAnd when we hear from you and the next thirty seven minutes you could be the winner of a one thousand dollar visa gift card to spend any way you want when we hear premier automatically entered in this drawing\nTo win one thousand dollar raise a gift card eight hundred to two two forty seven eighty eight or ... about thirty seven minutes left to get your name in the hat think of all the way you could spend a thousand dollars maybe get a head start on some holiday\nForty seven eighty eight or G. P. D. dot org about thirty seven minutes left to get your name in the hat think of all the ways you could spend a thousand dollars maybe get a head start on some holiday shopping\nMaybe pick up some extra school closed for the kids that you weren't able to get when school started however you want to spend this one thousand dollars we would be delighted to send it to you if you are are lucky winner but you can't win unless you enter sep dot org or eight hundred to two two forty seven eighty eight\nNow when you get a G. P. B. dot org ... through there and take a look at all the ways that we can say thank you during just drive one of them but I Am just absolutely a in love with is is a Mason jar public radio it's the coolest thing is this little Mason jar\nIs super simple but it actually houses a radio that his tuned only to your local GB station just click on and off\nIf the greatest little thing you put you put it on your desk at work or in the kitchen at home\nAnd you're only going to every time you turn it on it's just going to go to your gp radio stations if you live in Savannah and you call in we're going to tune it to GB savannah if you live in making will turn it to make an if you live in Atlanta it'll come tuned to eighty eight point five is a great device when you make your gift of thirty dollars a month\nThat works out roughly the three hundred and sixty five dollars which is about a dollar a day call us at a hundred to two to four seven eight eight or take a look at that radio at gp beat out of work we were working\nTogether to wrap up this fund drives successfully by friday your support will help get us there in time is running out on this fund drive\nEvery gift of support does make a difference so we are relying on you to make your contribution right now\nYou count on smart reliable reporting from NPR in CPB smart shows that make you laugh right now we're asking you to let us know that we can count on you\nAt eight hundred to two two forty seven eighty eight or TPP dot org one of the smartest and easiest ways to support Georgia Public broadcasting is by becoming a gp sustain her\nYou choose an amount that works for you every month it might be ten or Fifteen dollars a month and then he said it and forget it you set it up once your contribution continues automatically you don't even have to think about it supports he'd be the smart way with an ongoing monthly contribution as a gp sustain her\nClicking donate on her secure website G. P. B. dot org or give us a call eight hundred to two two forty seven eighty eight\nOr we're looking for eight now by six thirty eight calls are cliques that eight hundred to two to four seven eight eight or G. P. B. dot org and joined Kara from view for Georgia who says I Love the unbiased informative\nThirty eight calls are cliques that eight hundred to two to four seven eight eight or G. P. B. dot org\nAnd joined Kara from view for Georgia who says I Love the unbiased informative and thought provoking nature of this unique station here I think I just found a new tagline for your local TV yeah that is beautiful thank you and of course Emily from Athens you just simply says thanks for everything\nWe do appreciate you we're thankful to you for reaching out to us and supporting your gp be radio at eight hundred to two to four seven eight eight or on line that G. P. B. dot org\n[noise] the cost of bringing you worldwide coverage from NPR in state wide coverage from ... is a rising every year and that's why we encourage more or less ... and why ... why your participation in this fund drive matters even more than the amount\nThat you choose to contribute we're working to gather this was a group effort because the most important reliable funding for the programs that in a richer life connect you with the world and for me\nComes from that you have you made your contribution next and be the next generous donor that we hear from to join our growing public radio community\nYou've been meaning to do it now is the time and see t._v. dot org or eight hundred to two two forty seven eighty eight we're looking for six calls are clicks and the next two and a half minutes by six thirty thank you for being the next call or click\nAnd we're working together to wrap up this on Dr successfully by friday your support is going to\nHelp us get there and we're so thankful for it at a hundred to two to four seven eight eight or G. P. B. dot org now when you do we're also going to put a un on this drawing for a thousand dollars he's a gift card cash money coming your way you can spend it on anything you want it can be used it literally millions of\nDoors all around the country or the world a it's a visa card worth a thousand bucks Colleen hundreds you to sue for seven eight or go to ... dot org\nYour support makes Georgia Public broadcasting a stronger more a vital part of your life in our communities across the state and beyond\nTime is running out think of how much CPB adds to your life Georgia's a better place to live because of the strength of Georgia Public broadcasting all of the incredible programs that we bring you isn't this worth an investment you're listening right now because you value Georgia Public broadcasting and\nWhat's your dollars behind something that you value five ten Fifteen dollars a month the amount is up to you see the beat out or a hundred\nTo two two forty seven eighty eight thanks to Robin Ray of savannah\nTen dollars a month the amount is up to you see the beat out or eight hundred to two two forty seven eighty eight thanks to Robin Ray of savannah\nDonna teller of Crawford Susan said Simmons of Atlanta and from so vain yet an ad away joined this list of wonderful donors\nMoved on their part to support their public radio habit CPB that order eight hundred to two two forty seven eighty eight you've been meaning to do it right well don't put it off the last day don't wait until friday\nAre among settled group who who did those things\nDo you still consider him a friend [noise] yes I I I Hope that we can have a friendship I'm I suspect you might be screened and my calls right now but uh I Hope not\nMark all sorts of Yale Law school classmate of Supreme Court nominee Brett Kavanaugh thank you very much thank you and professor officer now teaches law at the University of St Thomas and St Paul Minnesota\nThe federal government wise so unprepared to carry out the Trump administration's policy of separating migrant families earlier this year that it wasn't even ready to has the children nor did he even had a plan to reunite them with their parents\nAnd that is from a scathing report from the homeland security department's internal watchdog this week\nEight minutes ration has abandoned its policy of separating families to deter illegal immigration but only after widespread outrage and after more than twenty six hundred children were already separated from their parents\nTo talk more about the ... inspector general findings were joined by NPR's Joel Rose hail\nHail so that you know we've been hearing all year about the problems with this policy of separating families but why is new in this report that contradicts what we've been hearing from the administration [laughter] well it contradicts some early assurances that we got from\nFamilies but why isn't new in this report that contradicts what we've been hearing from the administration\nWill it contradicts some early assurances that we got from federal officials as this policy was being rolled out here's da chest secretary cures to Nielsen\nIs important is in it that these miners are very well taken care I don't believe that they are very well taken care\nBut this report paints and much less rosy picture the inspector general found that da chess held hundreds of migrant children in border patrol facilities well beyond the legal limit of Seventy two hours in fact federal officials held more than eight hundred migrant children for longer than that including one child who was held for twenty five days\nAnd many of these children were held in metal cages and border patrol facilities near the border\nUntil the government was able to find space in shelters that are equipped to has children\nAnd as we mentioned many parents and children had trouble finding each other and assistant after they were separated\nWell again at the time officials denied that that was a problem remember here's Alex aides are the secretary of health and Human Services speaking it back in June before Congress\nThere is no reason why any parent would not know where their child is located I could with with just basic keystrokes within seconds couldn't find any child in our care for any parent\nH H s by the way cared for children after they were separated while da chess had custody of their parents and at the time da chest said there was a central database of the locations of parents and their children\nAt Central database did the inspector general find that central database\nThe inspector general found no evidence that there was such a central database the two agencies actually had computer systems that could not communicate with each other and the inspector general found that when distraught parents tried to track down their children the government sometimes gave them inconsistent or just wrong information in some cases parents couldn't communicate with their kids at all\nThen what happened to those families\nThe government was ordered to reunify them by a federal judge and it has reconnected more than two thousand children with their parents but the inspector general's report says that this lack of communication made that reunification process slower\nAnd the process was especially hard for children who are so young that they couldn't speak immigration authorities according to this report made no effort to identify those young children in any way no wristbands and no photographs of them were taken so it was only through communication with the parents that the authorities were able to find these children and reunite them\nStill have federal officials responded to the inspector general's report in any way\nWell as the administration often does is blaming quote images\nThen reunite them still has federal officials responded to the inspector general's report in any way\nWell as the administration often does is blaming quote immigration laws that are broken and poorly written unquote\nPh as does say that it deserves some credit for working quote exhaustively to reunite these families although again they were ordered to do so by a judge but the H. S. also acknowledge that the government's computer system still do not communicate across these agencies\nAre there any children still haven't been reunited with their parents\n[noise] oh yeah more than a hundred and thirty remain in us custody apart from their parents mostly because those parents have already been deported without them back to Central America\nAll right That's NPR's Joel Rose thanks very much Joe\nYou're listening to all things considered from NPR News\nMontana has become a popular campaign stop for President Trump and vice president Pence so popular that each of them has been there twice in recent months that's because Republicans are trying to unseat to turn democratic Senator Jon tester\nDuring Pence's second visit there yesterday he fired up a rally talking about Brett Kavanaugh's nomination to the Supreme Court Montana Public Radio's Eric Whitney reports\nRunning in a state that President Trump won by more than twenty points tester emphasizes that you can work with Trump he's run an ad listing Nineteen bills you supported that Trump is sign so when vice president Pence spoke in Bozeman yesterday he painted tester as a reliable and reflects of member of the Democratic resistance\nV. all the way it is\nSad or does it All right now we know you're just like you know we're ...\nTester didn't take a position on Kavanaugh's confirmation until after last week's hearings were over and then came out against Kavanaugh citing first his record on privacy issues and support for the Patriot act\nFor those reasons and all of the reasons that were brought up last week [noise] um I made a decision to vote no on judge Kaplan I don't think she has the merits\nThe reasons that were brought up last week [noise] um I made a decision to vote no on judge Kaplan I don't think he has the merits nor the background to uh meet the needs of Supreme Court\nRepublican challenger Matt Rosendale says he'd be a more reliable ally for President Trump and cited the Supreme Court vote as an example\nMyself and a lot of the people are processed station or very disturbed with the way this entire process was handled there is a man who has a commendable record and\nCase it'd be serving on the bench an absolutely I Would vote for him\nOn paper standing firmly with President Trump would appear to be a winning strategy in Montana the population here skews older and wider than the U.S in general Montana also has the second highest population of veterans per capita of any state guys like Jim heading film [noise]\nTired after Twenty years in the navy ending failed now volunteers at the airport\nIn Missoula helping arriving tourists he voted for President Trump\nIs going to mess around with this country or do something there's no cross or line a red line\nTo while heading failed says he hell no didn't vote for President Obama like many Montana voters he isn't easy to pigeon hole\nHe says he's voted for tester before and for Democratic governors Steve bullock in twenty sixteen and he says a candidate support for the president or testers vote on Kavanaugh's nomination won't sway his choice\nBecause I don't use it as a platform to make my decision\nStill plenty of voters do see their vote as a sign of support for President Trump\nBozeman retirees Suzie Burton was at a senior community center yesterday near where vice president Pence was holding his campaign rally\nWell I think a precedent marvelously actually [noise]\nKeeps his promise\nThat many of them do\nWhile President Trump is front and center in the Senate race here\nAnd local issues also matter for example tester has put Rosendale on the defensive about whether national forest in Montana could be privatized Rosendale initially opposed federal land ownership but says he's now convinced that that's not what people want\n... hard on his image as a third generation farmer Rosendale moved to the state in two thousand two after a career as a Maryland real estate developer voters will be watching closely Saturday as the to debate one\nRosendale moved to the state in two thousand two after a career as a Maryland real estate developer voters will be watching closely Saturday as the to debate one last time before early voting starts later this month for NPR News I'm Eric Whitney in Missoula, Montana [noise]\nIt has all things considered from NPR News\n... you're listening on listener supported CPB that means your support keeps all things considered and all of the programs to enjoy on the air here support also keep stories like we just heard\nAbout a very tight Senate race in Montana were able to bring you the voice of Eric Whitney and other reporters who were covering state politics around the nation because the listener dollars help pay for the programs\nThat they appear on like all things considered we're almost there this is the final stretch of our fault fund drive we're looking for support from our entire community of listeners to help us reached that famous line with time renting out on this campaign we hope that that includes you\nShow your support it TPP dot org or call us at eight hundred to two two forty seven eighty eight I'm Ricky betting ten here with Bert Wesley Hoffman\nAnd your support makes Georgia Public broadcasting stronger it makes us a more vital part of your life and makes us a more vital part of the community that we serve all across the state that your community to", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Carrollton", "day": "03"}