{"month": "10", "state": "DC", "station": "WMAL", "content": "Called el eight hundred to oh seven eighty five fifty eight eight hundred to seven eighty five fifty eight eight hundred to seven eighty five fifty eight [noise]\n\nMonday we'll have a well some have managed to visit the thinking against the giants had a great fan of ten of us who has not Les Paul suffocating voters the fact that you will be in Arlington next week at the metro twenty nine died over the next seven a dinosaur rattled saying that the right\nSeveral un am do you want to ... which do you watch\nYou enter you accumulate faces [noise]\nLoses on good morning on John map use then we have breaking news now there's eleven another suspicious packages been found address to a prominent Democrat\nThis package were told by one source was addressed a Cory Booker\nOr the center of New Jersey were told that there is similar markings similarities or in the other packages that we've been reporting on now all week\nSo clearly a another one we don't know exactly what was inside was at the same kind of pipe bomb but certainly indications that by all accounts that this is similar to everything else that we have seen\nCorresponded Ramon ... the package founded a sorting facility and Florida that's become the focus of the FBI's investigation a suspicious package that all of us fleeing from WROL studios here in northwest D.C yesterday afternoon the\nPackage was sent a talk show hosts Mark LeVine Mary Walter Chris plants and Larry O'Connor\nIt was on sort of individual lines of that label tape that we have seen and on some of the other packages that will\nYou on the program Dr bell has D.C police were called and they suggested the evacuation after taking a look at the box roughly an hour later the all clear was given and we were allowed back inside as for what was in a package\nI Believe it is pieces of the Berlin Wall\nThere were no explosives inside and no one was injured Maria ... W. A. L. W. I. L. dot com happening\nNow or pedestrian struck and killed by a vehicle in Springfield this morning this was on west bound old king middle road field master Dr police are asking drivers to avoid the area altogether as they investigate\nLeesburg police say a member of the toughest Aurora high school football team was sexually assaulted in the schools locker room earlier this month\nThree students have now been charged with sexual battery the other two with assault and battery investigators say it was not a case of hazing under state law but we won't learn much more about what happened because all involved are juveniles some parents complained because they were told nothing until ten days after the incident\nHoward county prides itself as an idyllic suburban it not immune to the dark world of human trafficking lawmakers they're holding a day long conference to learn how it's infiltrating the area\nWhere are ... members as they didn't even realize how bad it was\nHoward county executive Allen kept them inside I taped conference people will hear firsthand accounts from survivors of human trafficking\nWhat it was like for them and how they were able to uh to get out it and that is how they were able to continue on and we have a really important day for people to come in on our\nCounty officials we'll also talk about the work they're doing to stop human trafficking including setting up an office of human trafficking prevention Curtis sound WMA Allen W. A. L. dot com\nThe ashes of gay rights icon will be interred at the national cathedral this morning Twenty years after Matthew Shepard brutal murder shepherd of Twenty one year old college student was found hanging on offense in Laramie, Wyoming\nHe had been robbed and beaten and his story became national news sparking the gay rights movement some shepherds belongings were donated just this week to the Smithsonian checking your money the Dow opens at twenty four Ninety five the NASDAQ at Seventy three Eighteen trafficking whether next\nTo the Amazon Echo to heal Russia we knew the three here folks listen to this for one\nSet up say Alexa naval W. N. A. L. skill says listen to say Alexa over you and you got you know retail to W. A. L. dot com\nDon't replace the carpets zeroes clean and safe book at zero ... dot com\n\n[noise]\nEight nine four or five point nine at ... am six thirty WROL trafficking weather here's Lisa baby in the deep carpet cleaning traffic center Virginia where\nWinding down a rush hour on the beltway nothing to report right now in Ninety five or six feet thick Maryland crash catalytic cold bell rolled into that what was tucked onto the shoulder route\nTo Welby close in age water Maryland so they can documented crash near male role that now from garage door repair dot com the WNBA out whether kennel forecast\nToday the gathering thinking this morning rain this afternoon fifty three tonight periods of rain showers around tomorrow especially first part of the day breezy and only fifty six that's sort of return more clouds advance on but still some sun on Sunday eyes low sixties I mean they're all just re ... the weather channel on WMA out right\nNow it's forty one in ... thirty nine in Gaithersburg forty five at Reagan National on John ... use one oh five point nine of famine am six thirty W A L Jewish shot\nThe national keyboard [noise] nine ... nine dollars nine five eight or nine eight\nNine ... will come from your rent free and message we may apply\nThe W and a\nDifferent way of looking at it I Want to run one of five point nine ... am six thirty W. M. A. L. freight pocket near Washington comes to talk\nTo you got an Amazon Echo\nGot a new way to listen to W. A. L. there's this huge human warnings on the law\nLimbaugh leery O'Connor mark\nI listen to this one time that I'm stapling W. N. A. L. skill once your devices unable to just say oh wait till the end it's really that simple however you can actually getting breaking news on the Inside Story\nBeen easier and that kind of what you get all the details or do you have held on\nCall we're Washington comes\nTo thaw your ripping Enron and you're saying the right things that all the world needs to hear one oh five point nine FM am ... N. A. L. [noise]\n\n\nShorthair woke up this morning this guy actually slammed against the ground have been calling them falling falling on shortly after dawn pressure to drown destroy killing all human life on earth [noise]\nGot a treasure sauce [noise]\nWhatever they got better [noise]\nLittle\nBoys with aside falling at this very long ... [noise]\nFigure them\nThink that anything that deviate from bill Sadler Democratic Party narrative is a conspiracy theory [noise]\nBlankets blaming ensure Trump's rhetoric for the for the call mad bomber it's a it's a bombing and there are no bombs are objects that looked like bombs were noted that matters [noise] apparently and capable of detonating [noise] but that hasn't\nStopped CNN on the other is in the phony bloody nose video from saying this is\nAn attack on our democracy a terrorist attack that series of bombings they're calling it a series of bombings I think in order for it to be bombing a bomb has to go off and I asked that question yesterday when as a bomb not a bomb\nA bomb is not a bomb if it was never designed to blow up that's what a bomb is not a bomb these are not from what we have seen so far and it's always possible that the twelfth one will show up and it will actually blow up that it'd be a surprise I think for everyone it could be part of the mad bombers trick but\nIt looks as though the individual involved that have you noticed the news media is very fond of saying his or her they were mad bomber they don't want to they don't want to leap to conclusions but it might be a man\nBut they're willing to lead conclusions better say Republican supporter of President Trump was inspired by President Trump's rhetoric\nThat's fine that's not conspiracy theory that's not conjecture that not leak whipping to conclusions\nThat's not just new to learn a that is as tablets factor that is the narrative the narrative is that this is a right wing not living in a cabin why the Unabomber who is a Fox News fan who watches Sean Hannity's program\nAnd reads the Drudge Report and that's how we got what the CNN people are calling\nAs a Fox News fan who watches Sean Hannity is program and reads the Drudge Report and that's how he got the CNN people are calling Trump's hit list this is what CNN is calling it yesterday\nTrump's hit list and that some mad bomber out there who's obviously a Republican is carrying out these terrorist attacks and these assassination attempts that's what they're calling the hits a mass assassination attempt now you want to mass assassination attempt I got a mass assassination attempt for you\nFraud that is the American media it was truly extraordinary and my alma mater has an absolute distress just a complete and utter disgrace\nOthers so Michael I haven't had any news today speaking of the Democratic party's highest echelons\nUh and also the news media is blaming President Trump for the the terrorist bombing attacks which they're not bombing attacks there\nTurn out you know if you send something that's not right in the end but it's not really a Russian attack if you're firing blanks which James Hodgkinson was not it's not really an attempted assassination\nIf your do your firing blanks and if you send bombs that are not really bombs\nIt's not a bombing attack it's an honor to object to tech it's still a terror attack it's still terrorism it's still he's still a terrorist because these terrorizing but the bombs were not they were not bombs that's very important to understand I think\nIf you're going to be an adult and engage in a serious conversation on the great issues of our day our news media is or not I mean a thing as adults behave and they're not engaging in a serious conversation on the great issues of our day\nThere for all the hate filled angry leftists who are so filled with contempt for President Trump that they try to blame a hurricane zone in St multiply what was the ... you know a lot of Puerto Rico they multiply by forty six times\nTo this one event [noise]\nNo other hurricane will that be that town judge that way just that one so the hurricane could be playing and that that can be blamed on President Trump\nTruly astonishing hypocrisy clown a ship cockroaches\nThis country to an extremely dangerous place\nFigured it out they got it all figured out it's Sean Hannity's\nThere's only one\nRace or class to class show on Washington Mall W. N. A. how Washington to talk\nAround like reporting a train malfunction WMA all traffic at least the David and looking at the latest on the blue orange silver lining up that result from that ... rounds to make the plan ahead good morning Virginia in ... no problem I think the same game fail Indiana\nNinety five Virginia briefly before and after the ... going\nDown pouring down that ate\nHe closed and add water Maryland near mail route to they can document Iraq\nNow from garage door red haired dot com that WMA al weather Channel's forecast\nRain arrives this afternoon with the highest fifty three and a rain grows heavy at times overnight low forty nine [noise]\nTurning my college here kind of my seminar next Tuesday in Gaithersburg or Thursday in Arlington I'll tell you all about the new tax laws and our innovative reservoir trust for you for WN male listeners sign up and Mike Collins dot com that's Mike Collins dot com\nBoom Washington Post indoors to governor Hogan saying polarized times he stuck to the political ...\nGoing back to carry one matter\nDeserves a second term\nDon't care much about politics or somebody who's a Democrat\nI care about common sense\nWe work together with local officials\nBut we respectfully disagree and we were out of the\nBest job we can appreciate\nPlay ...\nAttention investors it's time to diversify to real estate for returns of twenty percent with monthly pay us tax advantages and one hundred percent of cash flow paid to investors first national realty also\nProven eleven year track record eight hundred million dollars of really under management and a new two hundred million dollar portfolio closing now backing your investment or IRA with multiple cash flow in New York City apartment buildings luxury condos with Hoboken New Jersey water views in Delray Beach Florida ocean front town homes your back by\nPrime real estate these are twenty percent return financial units just go to a\nOne to ten twenty seven twenty seven now for free information you're backed by hard assets in New York Hoboken Philadelphia\nReturned financial units just go to a one to ten twenty seven twenty seven now free information you're backed by hard assets in New York Hoboken Philadelphia and Delray Beach gulfstream Florida\nCalled two oh one to ten twenty seven twenty seven for these twenty percent\nReturn hard as that real estate deal and it's for your IRA or cash flow but they're limited availability called now two oh one to ten twenty seven twenty seven to one to ten twenty seven twenty seven in order to buy or sell a security has only made by our other place them ever read it for the best way to guarantee if you're the results actually is a real estate developer and I got that\nSportsmen hunters gun enthusiasts Hi it's Chris plant join Atlanta guns in Silver Spring for their annual fall sale this Sunday from ten to four\nTake advantage of one day only factory pricing on rifles shotguns handguns optics and more ... blames over his stocks are all price to sell plus ... factory wraps great door prizes and Atlanta guns will also offer free firearms safety inspections\nCoal Atlanta guns now at eight hundred five eight nine guns or visit Atlanta guns dot com\nThis is a court ordered notice current and former foreign Lincoln and mercury owners are less sees can receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags and their vehicles\nTo see if your vehicle is included and to file a claim to the auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six\nI'm Don Rosenberg I lost my son drew when he was killed by someone in the country illegally and I'm not alone\nNow cities and states are giving sanctuary to criminal illegal aliens and putting us in danger and then of course\nSanctuaries bring more illegal immigration\nGiving criminal aliens sanctuary\nFor California's population stabilization\nD.C morning commute and meeting downtown can be tough to driving\nThe traffic that distracted people on their phones could even worse having to drive around looking for a parking space unless you have the spot hero app spot hero shows you the closest options near the office lets you compare prices and even reserve you're spot in advance so if your commute is hard to make the parking easy\nMake spot here a part of your morning commute or evening out you can also get ten dollars off your first park by using promo coke pass something yeah that's ten dollars off with promotes that spot hero park smarter\nThan it was on cash from you Associated Press ground game hosted by ... digital editor making great ground game it was a weekly conversation would they be reporters and guests about the political issues around the country ahead of this year's midterm elections available on apple podcast\nWon all five point nine at\nThem in\nPeople who can sit there in front of your and listen to what you're saying it just goes in one ear and out the other that\nThey don't hear a thing on their remarkable junk\nTodd [noise] again the last time there was a terrorist attack against Republicans was about two weeks\nAnd it was by mail [noise]\nWas supposed to be rice and [noise] now it's supposed to be bombs but they don't explode [noise]\nThat it was a month ago and it was letters to the president the secretary of defense that she is from ... operations the FBI Director the CIA director and it was supposed to be the deadly talks and rice said this was four weeks ago\nNow are we just had some limited color call in and say ... ... what would you be sending officials are Republicans being targeted well it's been two weeks since that happened and before that it was another two weeks since that happened\nAnd before that it was James Hodgkinson on a baseball field with an s tasks rifle [noise]\nLecture me about what would I say the last time I got plenty of experience talking about the last time it happened against Republicans you have flipped out your memory is faulty I understand that that's why you're a lefty you don't understand anything I don't remember anything\nUh the last time that happened was a you know I have food in the refrigerator that I still have in the refrigerator now\nThat's how long ago was that we had the last left wing terrorist attack against a Republican government officials All right so you know take your walk through sure if it was you know tune in more frequently and you'll hear what I say every time it happens because it happens fairly frequent like there were\nPeople on the ... and the Senate Judiciary committee had their lives threaten their children's lives threatened their wives lives threatened they had to step up police protection because they'll be terrorists threats against Republican members of the Senate over the cabin or hearing cabin\nOn his life was threatened his children's lives were threatened his wife's life was threatened how stupid are you that you don't remember this stuff from two weeks ago honestly you know that we were uh\nChildren's lives were threatened his wife's life was threatened how stupid are you that you don't remember this stuff from two weeks ago honestly you know that we were talking this morning this Julie sweat next person\nWho Lied about everything and we'll probably end up in prison with her lawyer Michael ... there was a great update on that story today but you know that we were ... by comparison I were talking about this this morning she just emerge this month it was October when share it seems like a year ago\nThe Democrats would seek to dash that because there are political fortunes are at stake here [noise] but\nNew York times has a gentleman that types for the Democratic party but has an office there he is aptly named Charles and blow Charles Blow is a hardcore anti Trump lefty of course he is he's employed by the New York times\nHe wrote a little piece yesterday with the headline count me among the mob or do we have any ... at Berkeley count me among the mob if it means people who stand in opposition to Trump's degradation of the country\nHardy of Bill Clinton look great heart\nWearing a yarmulke call on the phone call\nThis is Bob your heart of Mr blow the aptly\nTo be some stuff out of there are big [noise]\nDisappointing about modern liberalism typed on behalf of the left\nAre typically as it now stands in opposition to Trump ism\nIs the degree to which it is reactive governed by what is going to be done rather than by its own positive vision that's because you're a positive vision has played out in Venezuela and it doesn't work out very well\nIn fact another one to rhetoric mobs and terror say it's a terror now none of this was happening with the rice sent letters with the death threats to to the Republican members of the Senate Judiciary committee to Brett Kavanaugh's family to his children to his wife none of this was done by the news media for any of this\nBecause they're filth because they're corrupt\nBecause their Democratic Party ... journalists at all\nI was a journalist I spent my my good portion of my adult life I'm looking to be as scrupulously I'm strictly objective and fair and balanced as possible and I really had to leave the business because well the business left me to paraphrase\nThe great Ronald Reagan\nThere is no way Mr blow types to consider the explosive devices sent two prominent Democrats and the CNN offices\nAnd not recalled Donald Trump himself has created a toxic environment by openly targeting many of these very people and and to these it is over heated over rock rhetoric now again\nHow how many days ago was it was day before yesterday or yesterday CNN is confused when the individual in Utah was charged with multiple felony counts of targeting the president and cabinet members with rice and envelopes those as the very definition of a terrorist attack\nNow again the rights and turned out to be a nurse in this case the bombs turned out to be a ... they're not bombs\nTheir devices that looked like bombs they're no more bombs then what I'll come at the clock boy bought ... brought to school that day and the news media was very quick to declare that that's not a bomb it just looked exactly like one from an episode of Mission Impossible and commit bringing up the school on the anniversary of September eleventh\nShouldn't have rattled anybody because our committed and it's just a cute little boy who wanted a scholarship to MIT and an invitation to the White House but the news media they know that all of this is Trump's fault and that it's just rhetoric and I'm hearing from people that I Know oh this is clearly Trump's ... you know I\nI just I gotta tell ya ya have news ... you your memory is faulty you don't remember two days ago well that's not your fault because nobody reported that two days ago that the Democrat was charged with sending the rice send letters\nTo all these officials and Russian media completely ignored it ask anybody at the Thanksgiving dinner table or who is James Hodgkinson watched the liberals look around confused because the news media dropped that story within forty eight hours not a big deal congressmen was shot bunch more were shot at\nTerrorist attack attempted mass assassination now the news media they're really something I I got to tell you I let's go to well let's go to some audio let's go to ... number one\n[noise] but it's good of sound button number what Sarah Huckabee Sanders is the spokeswoman for the president the United states and she is ridiculed and excoriated and and smeared uncalled all kinds of names and words by liberals on television on Saturday Night live and\nIt was ridiculed and excoriated and and smeared uncalled all kinds of names and words\nBy liberals on television on Saturday Night live and because you know I Believe the woman now that's a bunch of BS only believe the women that are accusing Republicans if you're a A R Keith Ellison is ex girlfriend and he'd beat the snot out of you and drag job for bed naked\nAnd tells you to take out the garbage B word that's fine the news media doesn't care about that at all if you're Cory Booker and you grab demanding the men's room and tried to force him to his knees to perform an act upon him that alley Watkins at the New York times normally performs upon her sources in order to get scopes\nThen the news media gives you a free pass come sleet\nBolivian for that story they didn't emerge the news media killed that story because their flood first for the Democratic party and they're not actually journalists at all and and those what I fear a Republican and you're in an algae and B. T.\nQ. Q. I a asterisk event in two thousand fourteen and a man came forward and said the ... Lindsey Graham I'll use Lindsey Graham just for no particular reason\nLindsey Graham forced me to a men's room started rubbing my gender tell you with his hands grabbed my hand put it on his then tried to force me to my knees by putting his head on my shoulder I think that it'd be a news story I think the news media might pay attention to that story\nI couldn't get some coverage I'm just guessing I don't want to lead to any conclusion to\nThe news media is a well this is so Trump fought this is Trump's will then again who uh James Hodgkinson was a Bernie Sanders volunteer who loved Rachel Maddow on MSNBC and the Southern Poverty Law Center and he was shot to death by the police in a suicide attack where he attempted the mass assassination of Republican members of Congress\nThat is a non story in the pantheon of stories of the Trump Administration that as an uncovered story they again last week\nUh our rights and to Susan Collins the week before that the death threats against Kavanaugh and all the Republican senators that voted for the men against their families I'm Talking about mangled mutilated burnt\nMammal corpses left on the front porch of the Trump Administration official talking about race in envelopes that guy was just charge two days ago\nCompletely ignored by the news media to all these Trump Administration officials and none of this goes under the radar at CNN or MSN or the Washington Post or the New York times or Bill Maher Saturday Night live or anyplace else no but this is an assault on democracy itself\nAnd an attempt at mass assassination of the Democratic party leadership\nWith ... bombs that couldn't blow up if you strap that MAD to him well maybe if you're strapped to them and he took\nUs let's go to I'm Sarah Huckabee Sanders yesterday they're dogging her and yelling at her best shows on Trump's fault this was all his rhetoric\nPrivate and it's certainly not responsible for sending someone no more than learning to enter the responsible for a supporter of the city not for Republican also practice last year\nA no more than he was well he certainly wasn't held ... and this guy visited Bernie Sanders office on Capitol Hill and met with a senior staff volunteered during the campaign Facebook is all Bernie all the time\nUh is the Southern Poverty Law Center a guy which are specifically targeted congressman state's college says a bad guy and all of this CNN and then he shows up and he shoots everybody not with blanks not with blanks\nSo Alison camera used to be a journalist and then she started work at CNN and this morning on the television\nYou know President Trump tweeted last night in the middle of the night well three something approximately three am they kept changing the time but approximately three am the president tweeted about best and the news media became very upset\nBecause he took a shot at the news media and he said that there should be unity and now he's taking a shot at us but unity isn't about unity with you it's between um you know neighbors son family members in the United states of America you guys still suck\nAnd you and you've been blaming him and you don't even know if it's a Bernie Sanders supporter that sending these these devices that don't explode or not what you know here's a lot of the jokes that emerged yesterday as you know how you know a Democrat sent all these devices\n'cause they don't work\nGoodbye to a boom see because they don't work there are on welfare there is that better being just a they don't work because they don't work that's the joke\nHe gotta get jokes out of the things I think what was the other one oh one showed up at um at Elizabeth and Elizabeth Warren's office now are there was no detonator attached but there were two small wooden sticks\nTakers that's how it ends up six together to make a fire and that would be the detonator it's it's a half baked joke travel give you just like these devices Alison camera is half baked journalist and she's paid seven figures to come in and say ridiculous things like this they are the president\nIt's a half baked journalist and she's paid seven figures to come in and say ridiculous things like this the the president tweeted last night and he and he took a shot at the ... media have any responsibility when it comes to the rhetoric\nGoing on in the country in the back and forth no of course they don't know why they don't because they're the ones who get to say who is responsible for naturally they're not going to say they're responsible for\nTurning three minutes sub CNN or MSNBC and the hate is just gushing off the strength he's the screen he's he's Hitler he's responsible for this but Democrats aren't responsible for anything\nDemocratic Party my party it just to make Trump look bad it just wouldn't actor price now you're always\nVoted Democrat voted for Obama twice\nI voted for Obama the first time and I voted for Romney the second time for simple fact that he drove my ... my ... from two hundred dollars a true thousands out\nYeah right that happened to me to from three twenty over a thousand dollars a month after tax money got to make a lot of money to pay those Obama premiums side so you voted for on me and then you voted for Trump now you're still registered Democrats who you're voting on the Democratic primaries\nYeah try but this next Tuesday but the following Tuesday on election day you're going to vote a straight Republican ticket in your whole family is voting a straight Republican\nTicket because enough of this ... this stuff that they're not doing that for you and\nTell you when I left him with British W a male Washington shot one thousand dollar more time on ... on the on the news again\nGood morning I'm John Madden news breaking just an hour ago the discovery of two new suspicious packages both intended for critics of President Trump\nLaw enforcement sources say that another package was found that a facility in Florida this one address to New Jersey democratic senator Cory Booker meanwhile here in New York police have closed off a block on the west side of Manhattan outside of postal facility there where they say another suspicious package has been found correspondent\nSteve ... package addressed a former director of national intelligence James Clapper his reaction\nGetting one new as in any worse than a quarter of a public was acquitted of a child\nNeeds to be on alert you take some caution cautious because it was supposed to mail he adds this is not going to a silence when\nShe was she quit\nHis murder Twenty years ago this week was the spark for the start of the gay rights movement now the ashes of Wyoming college students are finding a new home in our city\nMatthew Shepard was brutally killed with October of Nineteen Ninety eight who've ashes will be entered in Washington National cathedral this morning thousands are expected to have a ceremony authorities say shepherd was murdered by two roofing workers you targeted him because he was gay\nThe gruesome nature of the crime through a spotlight on hatred violence in discrimination in towns and cities across America also this week personal items including fair ribbons notebooks and homework assignments were donated to the Smithsonian Museum ... W. M. I. L. M. W. O. L. dot com\nHoward counties well known as the wealthy suburb with good schools but there's a darker side getting attention there today\nI Ninety five is a popular road for all kinds of people including human traffickers according to Howard county executive Alan ... that\nGoes right through our county and so we cannot you know turn our back to what we need to be proactive and we need to do all the weekend to stop it\nCan only hope today's all day conference on human trafficking will help raise awareness about the ... and what the county to link to combat it\nBelieve that more loan for now we are put together an app that forfeiture fund so when someone who caught human trafficking we take their assets we use them belt victims\nHow they're courting found out all the ... dot com\nMaryland Governor Larry Hogan continues to enjoy a huge lead in fundraising end at the polls over Democrat challenger Ben Jealous in his bid for reelection\nSeventy seven percent approve of the job that I'm doing and it's because most people in Maryland are not far left for far right most of them are somewhat in the middle there moderates or they're just right of center left of center but they're not extremists\nHogan stopped by W where males diner tour in Gaithersburg this morning and said Maryland's better served by having a Republican governor because lawmakers are forced to consider a broader agenda\nThree students at ... high school in Leesburg human charged in the locker room sexual assault of a football player one team's been charged with sexual battery the other two with assault and battery the allege incident took place October first but parents were not told about it until ten days later\nChecking your money to down down again three hundred and forty one point to the NASDAQ off one eighty seven up next traffic and whether on WBAI male\nPattern WMA El Yunque today with what your self investor radio at five and then it's a Saturday morning update with Rick salaried six and listen for gardens and sitting at nine it's legally speaking with my colleagues at ten here ... new and it's about federal benefits with winter Trump had won its mortgage radio\nAnd at night and it's legally speaking with my colleagues at ten here ... new and it's about federal benefits with winter trucks all had won its mortgage\nRadio on the right to the retirement key at three it do it yourself investors show here an encore presentation of the mortgage radio show at seven and don't forget Sunday night at seven it's real estate today on WMA el\n... he's a court ordered notice current and former foreign Lincoln and mercury owners are less sees can receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls and new requirements for businesses leveraging fast paced applications and public clap platforms like eight ws Asher and Google Cloud\nWe're in the cloud generation now so you're fire will have to be engineered to fit right in ... claim your club at work trying barracuda ... generation network or application firewall free at barracuda dot com slash fire walls still\nReplace the carpets get a zero clean and safe book at zero reds D. C. dot com\nRight now there are young people across the world facing a tough choice continue their dream of education will drop out to help their family put food on the table you can help change their future when a single moment machine help or your support can go head sundown dot or\nAfrican weather here Steve her short and the hit the carpet cleaning traffic centered\nAround the building down a little slow Maryland belly outer loop between university boulevard pass Georgia Avenue of the early ... their cleared away though tiny five north Virginia remaining volume from the prince William parkway up to the ... going south on Ninety five\nWas very so from one in Woodbridge down to the prince William ... west ... sixty six after twenty nine Centerville it was construction blocking the to break lanes now from garage door repair dot com the W. M. A. L. weather Channel's forecast\nCloudy guides for now but rain a ride this afternoon with the highest fifty three brain heavy at times and windy tonight with a low forty nine overcast with rain showers tomorrow I fifty six\nForty four right now in Springfield it's forty and demand gets forty six at Reagan National on John that you don't want to buy ... am big thirty W A L\n\nOne\nScene in Blazing Saddles or somewhere where\nWe're going to blow up the bad guys with dynamite couldn't slim Pickens [noise] was angry with them because somebody for the call John debt invaders [noise] this is Mel Brooks program or watch here [noise]\nTied for God's meant that matters\n[noise] I'm\nSure your nurse to walk the walk boy then you don't call our number ... ... none of them are blowing up [noise]\n\nI Will go up a little James Marshall Hendrix for morning enjoying [noise]\nWhy not\nCNN has punch the barber of course it said Trump refuses to take responsibility for the Trump refuses to take responsibility for the Robert apparently CNN has discovered that as a senior White house staffers sending\nOut that President Trump has been up late in the attic that's rise up all night he's not tweeting\nHe's making bombs and and they're not bombs but they're they look like bombs that nobody's mailing them to people that he really is and it's all Shannon Sean Hannity's fault I saw this on MSNBC this morning a Sean Hannity on Fox News's fault\nBecause one night Sean Hannity did a segment on his Fox News TV show that was about Robert Deniro brought up boom brought up being that explains why the narrows and their MSNBC figured it out they crack the code that was that ... that was\nThat was CNN oh you're right that was Abdul ... they're all in the same thing on MSN Donald Trump's fall time and then they got a real smart guy who uses a lot of lotions and hair product and I he uses nail polish to Donny do show I think is his name and the booster as as friends called he uh he had a little segment this one\nProduct and I he uses nail polish to Donny do show I think is his name\nAnd the booster as as friends called he uh he had a little segment this morning and he's got a you know it's which of these things looks out of place well why is Robert De Niro there how do we explain Robert De Niro there ... rights and they're just thinking about their thinking out loud if you can call it thinking\nAnd uh and the do she says well you know on October fourteenth or whatever the day was that a year's Sean Hannity did at an entire segment\nThat is what he said an entire segment I got an entire when an entire segment on on Robert De Niro and his you know be Trump and I want to punch him in the face and now he's a lunatic Hollywood millionaire leftist with whatever and a at a spread a lot of this stuff around\nDoesn't mean that he focused on it how unfairly treated and all of that how ... how in the fact that he blamed fairly for filing that thought out to people\nThat are at high tide in particular that had been the target the credit\nThey'd been the target service criticism huh where's that James Hodgkinson showing up on the baseball field audio because I think that\nThis guy felt that he was critical of Congressman Steve school age son he was critical of senator\nRand Paul Senator Rand Paul was there that day he escaped alive he was later attacked by is next door neighbor Democrat who broke six of his ribs\nUh damaged a lung and uh and that was in the CNN will tell you that was over a bundle of sticks along the ah the the border of their property and and that's what they're sick and west because never mind all that\nUm and then Rand Paul was asked what what what was when James Hodgkinson the Bernie Sanders volunteer\nWho met with Bernie senior staff and has Bernie office on Bernie Capitol Hill was James Hodgkinson yelling before the police shot him to death in the midst of his attempt at mass political assassination slashed terrorist attack what was James Hodgkinson yelling\nWhen I was at the ball field which basically was nearly killed the guy shooting a football field and shooting I think five or six people were were shot [noise] usually has almost killed he was yelling this is for health care list in his pocket of conservative Republicans that he wanted to kill\nNow that I think the results are in on that one the results are not in on this one but for the media they don't give a flyer and flip in hootenanny about about facts or the truth they uh they're just filth that's all I can sit there and I don't even want to compare them to journalists because they're not\nIf you or someone you know gets leg cramps or foot cramps you know how painful and disruptive they can be\nMuscle cramps ... out of a sound sleep in the middle of the night interrupts your daily life\nWell I recently learned about Sarah works relief Sarah works relief for non greasy from that's proven to relieve muscle cramps fast and reduce muscle ... plus with daily use their works really can even prevent muscle cramps before they start\nTheir works for life takes only a couple of minutes to put on absorbs quickly and it works people love the results you've probably seen doctor drew Pinsky on television or many of my colleagues on the radio talking about Sarah works relates\nThe holiday season just around the corner so if you know someone who suffers fourth muscle cramps or muscle ... I Can't think of a better gift fair works really for the best choice for preventing enroll leaving muscle cramps make it your choice to\nGet Sarah works really today the pain relief ... Wal Mart CBS Rite Aid and Walgreens or by talking to your pharmacist learn more at federal works relief dot\nCom [noise] always yelling this is for health care issue going down members of Congress\nShot him to death\nWhile he's yelling for health care is like Walsh then the jerk I Know that your your base buddies yelling you know the Democratic party line and he's already got\nSomeone was actually shot there now if I'm not mistaken in this latest terror campaign of mad bomber who doesn't know how to make a bomb apparently nobody's been injured [noise]\nNobody had who wants to standing around at CNN taking a picture of that alleged bomb on the counter aren't they afraid of bombs on the counter\nHave there's only one Graceland Graceland show all the men have washing\nSpeaking gun show return to the Fredericksburg ex moon conference October twenty seven twenty times\nThat he is going to talk to over twenty seven twenty eight details and coupons are this G ... dot com\n... over twenty seven twenty eight details and coupons\nThat is ... ... dot com [noise] maybe you're driving to work for just leaving\nListening at the office running errands wherever you are if you\nTook sixty six to get there you probably got west and\nDon't be a shame it can happen to anyone\nBecause this transportation commissioner Jennifer Wexton back to deal leading the tolls on sixty six northern Virginia pay the price up to forty seven dollars one way\nIn the worst way not the first time and it won't be remembered Jennifer Wexton supported the largest tax increase in the history\nNearly six billion dollars\nMaking life harder for us\nNow she was a free ride to Congress no way to ...\nThe bell tolls results\nWill get wet again if we let ...\nIn our cc a porn is responsible for the content of this advertising not authorized by any candidate or candidate committing or CBC dot org\nHigh it's Mary and for a while I've been telling you about how much I loved direct jewelry outlet in Falls Church now the only the name fool you\nDJ as jewelry is absolutely beautiful and it's at prices that are done she only low and this Saturday prices will be at their absolute lowest for the D. J. O. annual sale\nNow de jail only has one sale per year and this is it\nThe jail as a family owned jewelry store where the warmth of the staff and good old fashioned customer service make the jewelry sparkle that much brighter staff as a non commissioned to there's never any pressure just stuff scientists first quality diamonds high quality gemstones and gifts for every occasion\nDiscovered this jam in Falls Church for yourself and see what the jail when the prestigious Angie's let's super service award five years in a row warm trust old fashioned customer service and the very best prices of the year this Saturday only for hours and location visit D. J. O. dot com that's D. J. O. dot com\nThis is a court ordered notice current and former foreign Lincoln and mercury owners are less ... can receive payments and other benefits from a legal settlement related to allegedly defective to call it an air bags and their vehicles\nTo see if you're a vehicle is included and to file a claim to the auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six ooh\nWhat do we really know about liberal democratic Abigail Spanberger and her policy ... well we know she'd eliminate the tax cuts that have helped to Virginia families\nWe know spanberger support sanctuary cities in Virginia\nAnd that she defended the violent gang ... Thirteen we know her liberal healthcare plan went bankrupt\nMedicare as we know at two thirty two trillion dollar spending increase that like devil our taxes she won socialized medicine that put the government in charge of your healthcare instead of you we know that spanberger would be a rock solid vote to make Nancy Pelosi the speaker of the\nHouse and we know she'd vote for impeachment of the president liberal democratic Abigail Spanberger ...\nSanctuary city bankrupt Medicare and a rubber stamp for Nancy Pelosi what else do we need to know\nWhat I'm Dave Brat I'm running for Congress and I approve this message who\nPaid for by friends have day friday [noise]\nTurning my college here come to my seminar next Tuesday in Gaithersburg or Thursday in Arlington I'll tell you all about the new tax laws and our innovative reservoir trust for you for WN male listeners sign up and Mike Collins dot com that's Mike Collins dot com\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls have new requirements for businesses leveraging fast paced applications and public clap platforms like eight ws Asher and Google Cloud where in the cloud generation now so you're fire walls have to be engineered to fit right in\nAnd claim your club at work trying barracuda called generation network or application firewall free at barracuda dot com slash fire well\nThis is a court ordered notice current and former foreign Lincoln and mercury owners or less the skin receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim to the auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six\nOne oh five point nine ... am six thirty Washington Mall W. N. A. L. Washington comes to talk\nAll W A L well Washington comes to talk [noise]\nPanic in New York ... another ... device was apparently discovered in midtown Manhattan and I\nBrought up that a wagon with above white metal ball on the back to bring it up to the Bronx to blow it up and uh that's and that's kind of fun um so what are your which what do you have their\nCars and Hillary Clinton\nIs she's Seventy one year young oh Seventy\nThere was the Central Park or Julius Caesar thing where that Donald Trump nails stabbed him to death and the crowd went wild and the news media loved it and the New York times was uh thrilled by it and CNN loved it\nSo they murdered Trump this Trump like a figure Kathy Griffin with the ah cutting the head off and holding the severed head up and posing for magazine photo shoots with it that's funny snoop dog with the shooting him in the video shooting that Trump a clone with the orange facing the video\nWith the flag that comes out of the gun and says bang\nThey've killed Trump again and again and again they decapitated up and they shot him they murdered him in and all kinds of ways the left has for their amusement an enjoyment\nNow of course if you proposed putting on a play in Central Park where ... bomber was stabbed to death they burn your house down and call you a racist and Lynch your children because that's you know these are the rules of the left that can murder [noise] they murdered a hundred million people the left since Nineteen Seventeen\nAnd they continue to murder and and slaughter say Chicago Baltimore of the list goes on states glaze 'em and so on so many events teams go east today has called on the New York times to remove the Trump assassination short story\nThey will not do that I\nDon't have to wait for a response from the New York times I Know what their response will be they will not do that\n[noise] Louisiana Republican Representative Steve ... told the Daily Caller news foundation Thursday that the New York times should take down and apologize for a short fictional story about assassinating president Donald Trump which they published on Tuesday\nThe media needs to take accountability for the role there are playing and promoting dangerous rhetoric rhetoric in division in this country particularly against President Trump and his supporters Scalia said in a statement to the Daily Caller news foundation\nThe decision by the New York times to run this piece as irresponsible and offensive\nAnd they should remove it and apologize now again if I came up with a severed head of Hillary Clinton I just imagine proposing going into under the mall and Washington DC the Washington equivalent of Central Park perhaps and staging a play\n'em a version of Shakespeare the taming of the shrew and it's about Hillary Clinton she's the shrew obviously um but in the end you have to murder her and stab or to death then everybody shares at the at\nThe left would burn the city to the ground and kill people over it but when it's Trump they give out words for it on and it's and it's great stuff this is what they like because they're filth and that's kind of the short answer [laughter] yeah\nPay twice deported Mexican man at MIT staging a kidnapping in Saint Paul Minnesota in a scheme to win a visa\nOh is that a problem the Minneapolis Star Tribune a Mexican national twice deported from the United states pleaded guilty Tuesday just aging as owning kidnapping in Saint Paul Minnesota complete with the duct tape over his mouth and binding around his hands in a scheme to win an immigration visa\nOr they hung up in court tests for the six years old admitted in federal court in Minneapolis to visa fraud and illegal entry into the United states Cortez holds Mexican citizenship has no lawful status in the United states and was deported in two thousand and one and again in two thousand ten\nDemocrats like to leave the door open in case you want to come back and us attorney's office said in announcing his guilty plea\nProsecutors said court test lied to federal agents about being abducted in Chicago tossed from a vehicle into a Saint Paul snow bank in April\nI just want to make none of the fact that St Paul's still had snow banks in April right that's a kind of why I moved away from the greater Chicago metropolitan area 'cause it gets a little chilly for a little too long there\nLet's go let's go back to our friends in the phoney baloney news media they're upset they're accusing President Trump of being the mad bomber or at least being responsible for the mad bomber they don't know whether it's a Bernie\nThey're upset they're accusing President Trump of being the mad bomber or at least being responsible for the mad bomber they don't know whether it's a Bernie Sanders supporter whether it's the Russians as trunk Todd has now suggested\nOr whether it's um righty Unabomber living in a cabin in the woods they don't know they don't care\nIt's just another opportunity again they blame Trump for hurricanes so much for wind speeds they literally back for rainfall they bring them for the level of a ... they just are great people\nAbby is a heavy fill up as a reporter for CNN and they're attacking them in attacking them and blaming them and blaming him how dare he respond to that\nDon't they know at the White House that they can't respond to the media is attacks we are the media you sit down and take the beating while they fluff\nCory Booker who's accused of molesting a man in a men's room at an algae beauty of it while they ignore Keith Ellison a for beating the bee words dragging them off take out the garbage be worth ... feel\nWell here is the White House doubling down on the president's rhetoric that leaves out on Saturday I don't think that they're not in any way have false half you look at his rhetoric rather as a media affairs\n[noise] it's uh uh how did he say it's not his fault as what they're saying at CNN you can't say it's not your fault it's your fault we blame you for this how many people are dead how many were shot how many received rice and in the mail\n[noise]\nJust extraordinary and really upset he's supposed to be backing down back down we're accusing you stop fighting back\nI think what what President Trump someone not tackled out at all\n[laughter] they're really upset about this this morning that he's not backing down he's got to be backing down and because he sent out a tweet saying hey the news media should think about their rhetoric I'm not which would be a nice change of pace but that's never going to happen either\nJust like the New York times loves this murder of the president's story that they they think it's cute it's cute\nIf you did this story about murdering the editor of the New York times I don't think they think that was very funny\nAnd then in NYPD to the New York times security officer handed the assassin his gun and by the way the story says the secret service agents handed his glock\nThey don't use blocks they six hours is this how lazy and stupid the New York times as they just they don't even have who cares whatever that they couldn't tell them you know a block from how it's her anyway\nSo so what's the problem with that Allison ...\nSay a ... I was I was amazed this morning at how\nAwful CNN was there just so awful there are so horrible [noise] um\n... and and and he said now he's being attacked by pundits on cable news anchors on cable news by fake reporters on cable news by ... reporters that are now pundits on cable news by former Obama administration officials that are not reporters on CNN and anchors on CNN\nAnd literally and and on ABC that got former Clinton Administration officials that are their anchors he's being attacked by on them and blamed for this and they don't care who did it they don't they have no interest in finding out that if Trump ... that are on and they're calling it a bombing campaign when\nInert objects are not technically bombs and nothing yet has blown up and I certainly hope that continues to be the case and I hope they catch this this person I'm now like right now I'd like to see the announcement right now\nThat they've caught the guy and drag them out of his home by as heroin handcuffs ah with his Priya send the front yard with Bernie stickers all over the ... which would be surprising as the sun coming up today\n[noise] Alison ... how dare the president criticized people that are critical of him on our station\nHe thinks that being president of the cable news pundit he like in the mix you were on the same plan for him if the cable news and it said something critical about me why can't I is the megaphone under President they just say something critical about the me he acquaintance\n[laughter] I don't even know how somebody get says confused as that so wait a minute you bring on pundits who are very often\nParty apparatus tricks former Democratic party officials ah administration officials and so on and he attacks them on cable news\nHow dare President Trump respond to that how he thinks that being president is the same as being a cable news pundits no but he doesn't differentiate and correctly so between the news media\nSuch as it is like you for example and democratic ... party apparatus X Y what do you differentiate between them he should not to differentiate whether there is no difference between Democrat Party apparatus tricks and CNN anchors for example\nBut not to differentiate whether there is no difference between Democrat Party apparatus tricks and CNN anchors for example so\nA an intelligent person would not to differentiate and he would slap back and they just hate Betty hits back boy do they hate that he hits back\nBecause they're pathetic week lily liver little girls the president tweeted just a short time ago Republicans are doing so well in early voting and at the polls and now this bomb stuff happens and the momentum greatly slows\nNews not talking politics very unfortunate what's going on Republicans go out and vote he says now is this\nI Would take control\nOf their own going that they don't want that do that was cool\nI got to say the funniest definitely I always look for the funniest outcome the funniest out ... as we have a Bernie Sanders\nVolunteer like James Hodgkinson arrested for this in the end and that's why all the Debbie Wasserman Schultz return addresses that it's an effort to play the victim you know how they loved to play the victim and it's got to be fun being literally in the Bronx you know because uh godfather one that's where Michael\nKilled virtuoso a lot so and a cat but McCluskey and\nUh that restaurant still there isn't it Louise from the Bronx\nAbsolutely but I got a message for the Democratic party says don't [laughter]\n\nThat would just gotta catch the guys\nWere rich WMA all washing\nUn\nELL news of the Web and good morning on John man used to more suspicious packages had been discovered this morning\nPolice evacuated to block on the west side including a US postal facilities inside the building another suspected explosive device was down there the package this one was addressed to former director of national intelligence James Clapper and CNN he spoke to the network soon after the news broke\nHis silence\nClapper said anyone who has been a public critic of the president needs to be on alert also this morning a similar package was discovered that a postal facility in Florida that one was addressed to New Jersey democratic senator Cory Booker deep casting about New York\nPresident Trump does not appear to be happy with the media attention on the suspicious package story he tweeted minutes ago quote Republicans are doing so well in early voting in at the polls and now the bombs stuff appears in the moment I'm greatly slows news not talking politics very unfortunate\nA dump truck rear ended up Charles county school bus it was headed to J. P. Ryan elementary school this morning\nThere were Fifteen students in a driver on board the school bus it was a rare in college and to the school bus\nBill Smith with Charles county fire this happened on popular hill road and met a woman being town wrote in Bryan town Thirteen children were taken to the hospital their injuries are said to be minor their parents have all been told what's going on the man whose brutal murder of fuel the gay rights movement is being in Turkey today in a ceremony currently underway at the national cathedral\nTwenty years after he was killed Matthew ... are finding it for many women are drawn\nTo Washington rapper Maryam ... soil for\nAnd honor his call\nWhile I saw it with a parrot\nFor the last Twenty years separate parents had to wash them from Laramie, Wyoming where he was clean burning signed up to ... dot com\nNational security adviser John Bolton announced today that Russian President Vladimir Putin's been invited to visit Washington next year he says no dates been said both noted that ... and the president are set to meet in Paris when they attend events marking the one hundredth anniversary of armistice day next month\nDay two of early voting in Maryland in lines are expected to be long once again\nThen exciting and some polling places in Montgomery County yesterday voters waited on line for anywhere from forty minutes to over an hour to cast a ballot Dr ... does a lie or what the Montgomery County board of elections says one reason is the science the ballot\nIt is a long ballot for three card or five page ballot\nLong lines are expected this weekend so you may have to spend some time and the elements\nHoly to bundle up we're trying to mitigate the lines inside the facility for ... breezy it's too cold we want to make our voters comfortable\nEarly voting in Maryland in November first Maria leaf on W. A. L. W. A. L. dot com checking\nYour money to doubt down big again five hundred thirty points to the NASDAQ off two hundred fifty two I'm next trafficking weather on W A L let me throw this at\nWas excited to know the next\nPoint to an ad that got two hundred fifty two I'm next trafficking weather on W A L let me throw this\nEllis excited to announce the next politics in a positive at which Chris plan on Thursday November first at Trump National Golf club what a great idea why didn't I think of that makes me think that with like minded people enjoy a beverage at a bite to eat and me Chris play all of the beautiful enforce the just setting up the Trump National Golf club admission is free no ticket necessary\nPolitics and apply sponsored by enlightened lights dot com November first at Trump National Golf club learn more at WM AOL dot com slash fight\nAre used to post a job or to send me tons of regulators to find a few people who are right for my job federal process was not smart then I went to a zipper\nTechnology can read the Lawrence [noise] find the right people\nActively invites them to apply get qualified candidates\nSmart ... three to number one by employees in the U.S try now for pre ... dot com slash free net difficulty dot com slash free different way to higher because of the rating hiring I can never went to the radio\nThis is a court ordered notice current and former foreign Lincoln and mercury owners or less the skin receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags in their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or cold one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five Ninety six\nThey'll replace the carpet to get a zero clean and safe ... D. C. dot com trafficking\nWhether brought you buy DEA take back day your\nUnused prescription drug ... mid ... towards children tend to have them\nA national prescription drug attacks on Saturday Night until the twenty seventh and final collection frowned upon ... dot com [noise]\nMale trafficking whether receiver short in the ... the carpet cleaning traffic center Ninety\nFive in Virginia is pretty still right now as you leave Stafford county there's a work so north of six ten before you get to ... to go along the right side of the roadway three Ninety five north bound was heavy across the fourteenth Street Bridge nothing in the way those south than on Ninety five expect volume ... one in Woodbridge down toward the ...\nTo Seventy north down the road work is after the truck scale is in the left lane delays as you say to the right\nNow from a garage door repair dot com the W. M. A. L. Weather Channel forecasts\nCloudy guys today but rain comes in the afternoon in a high a fifty three rain heavy at times tonight windy also low forty nine more rain showers tomorrow hide fifty six\nForty five right now and what Bridget forty foreign but that they're forty seven at Reagan National ... five point nine at ... am six thirty W A L [noise]\n\nWell we\nHave a major development [noise] has transpired showing these moments ago perhaps see an ad in the cable news network is reporting that federal authorities have arrested a man and heroin\nIn connection with the mad the bombings that orange bombings [noise]\nLittle cat scratched favorite [noise]\nI Hope it's the guy now they can stop saying his or her you know where he or she [noise]\nFor the shows you wouldn't want to leave anyone out [noise]\nAnd reporting interests has been made in Florida by federal authorities in connection with the mailings of bomb like devices that don't explode [noise]\nI certainly hope that's the case I Hope that strike CNN was wrong the other day when they reported\nThat uh one of the packages had been delivered to the White House and I think it was the same reporter little Evan ... to the other day that a device had been delivered to the White House then they said oh no sorry which no not when we're wrong about that [noise]\nBut that's okay they just go on and report it to the next time and a live out the stuff that was wrong before as though it never happened but right\nNow [noise] pardon me CNN CNN alone\nApparently reporting that there has been an interesting uh they're just saying sorts I don't even know what they're saying federal law enforcement sources are telling them that there has been an arrest they arrest as in Florida they were narrow it down [noise] pardon me the uh the male sorting facility in Florida\nAnd uh what's it called ... says something like that\nAh that ah that the packages or many of the pack and just went through the mail sorting facility it's where they grow up to another one today the one that was headed for\nUh that uh that the packages or many of the pack and just went through that males sorting facility it's where they caught to another one today the one that was headed for Spartacus\nAnd I'm now they apparently have a guy in custody and that's good news\nNow I Want to know where the houses and see what signs or in front of his house and see what bumper stickers around his press and I want to know you know the the new habits from the FBI and the other federal law enforcement\nIs to shut down all of the social media accounts their Facebook and everything else so you don't know because information is power and they they want to let out what they want to let out and nothing else\nBut hopefully we'll find out gosh we've got about an hour nearly left on the air before we're off the air and and we're keeping our ear very close to the ground on all of this and as the news pops we will a share it with you if there are any developments or we're right here\nWhere hell bent on blaming patriots and uh and saying that it was Patriots' Day in in Boston\nAnd this meant that it was right winger to waive the American flag and all that stuff how dare they wave the American flag\nAnd and clearly it was a bunch of varieties that carried out these bomb attacks in Boston and then of course it turned out to be ... they saw the uh they uh oh here we go we've got more information now\nThey saw the video of the white guys ... and a joke or is there and a half\nAnd remember the the you know the media they were they talk about uh the rhetoric can fanning the flames remember Rolling Stone that a cover story with Joe ... looking like he's the head of the uh you know let us the rock band to to uh\nTake the world by storm a and and they promoted him like he's a hero or something but it was Muslims there were very very disappointed\nThat it wasn't a and the anthrax attacks in two thousand one they tried to blame Republicans for that and that didn't work out\nA but but never mind that the latest information from CNN the suspect is a male we know that\nHe is because you say you can't say his or her as anywhere you don't have to and let's say is gender fluid or something [noise]\nHe's in his fifties he's white that said he's ... he's a he's a this is why the real problem is white this'll be the new narrative white male terrorists that's the real problem he's a former resident of New York former resident of New York\nAnd he has at least one prior arrests and possibly multiple prior arrests for making terroristic threats now here's what we need to know against whom did he make these prior terroristic threats that's the key right there\nAgainst whom did he make these terrorists threats in the past now on the television for saying what does that plantation Florida is that what it says it's plantation Florida the police have seized a white van it could be the DC Sniper\nTo uh they've ah they've grabbed a white van and they put a blue plastic tarp over the top of the van which means that it is considered to be evidence and inside the van there is evidence so they're basically ceiling\nAnd a a you know somewhat symbolic are superficial way the van I Would imagine they're going to throw it away on a flat bed from here and Michael ... has more information\nI don't know if you were seeing ... did have stickers or some kind of stuff all over the side and rear windows really and I guess I'm assuming Internet sleuth will be zooming in an Hansing\nGotta they gotta stickers out because you know the particular ... political fanatics of all stripes tend to\nPut their politics all over their cars and we're close what their politics on them and and all of that stuff so there are big are the those aren't windows or windows with lots of stickers yeah does it say where the hell is wall drug ...\nTraveling fatter [laughter] I don't know about all that but it is a developing even as we speak a CNN CNN actually seems to have broken the or the news here and it looks real enough now\nOut of plantation Florida white van it is covered with lots and lots of stickers that it's a kind of a custom modified van like a leisure van is Florida after all and um\nAnd there are lots and lots of stickers on the big picture windows on the side of the van and the windows on the back side the doors on the back end of the van so um that's good\nThe van\nLocated near that he was a ... office says that ah [noise] is that true\nStuff again right now we're going through a pack it all up for you and we will ah we will keep you address of the late\nRight now we're going through a pack it all up for him\nAnd we will ah we will keep you address the latest information here back taken into custody van plantation Florida all white male in his fifties former New York residents with at least prior arrests for a terroristic threats and\nPossibly multiple arrests for terrorists threats we'll be right ...\nPlan last year\nWashington Mall W. N. A. L. more\nWashington comes to talk this portion of the great ... is ... zips dry cleaners\nAgain about washing\nGet any damage my\nCue twenty nine that's right any Gardening Guide twenty nine and the other day I carry my pen born for clean when you can go\nWhen mark el Rockefeller return from military service in Iraq he noticed his fellow veterans struggle to find money to grow their business is so we created\nStreet shares of finance company on a mission to serve veteran known then main street businesses street chairs offers small business law lines of credit and government contract financing that's fast\nAnd flexible street shares achieves its Misha with a supportive everyday American Slang Kew who invest in St chairs veteran business fond of social impact investment that supports veteran businesses while returning five percent fix angle interest and providing flexible liquidity\nIf you need funding for your business for you want to earn solid returns well supporting military veteran entrepreneur visit street shares dot com today investing in here on ... street chairs dot com I\nWas not an offer to buy nor solicitation to sell security all investments evolve or at least you're offering staple detail terms and conditions apply\nI'm Rick Edelman could your emotions be getting in your way when you're trying to make good investment decisions\nOur brains are actually designed a trick us\nSo you might not knowingly be making financial decisions that can cost you money and that can hurt your ability to achieve financial security\nCome join us for our new fun and entertaining seminar mind over money how your emotions can keep you from reaching your financial goals learn the science behind your emotions and the simple steps you can take to help you manage your money more confidently learn how to identify emotional decision making\nTo help you take control of your money and your investment strategy to help you feel good about your future\nJoined us in ... a Tuesday October thirtieth at five thirty pm\nJust Fifteen dollars a person twenty five a couple register at ... dot com that's rice Stillman dot com or cola a AAA to plan wreck that's AAA planned Rick\nAdvisory services offered through Edelman financial services security ... yeah like I think the carrying member of the NRA s IPC\nThis is a court ordered notice current and former foreign Lincoln and mercury owners or less the skin receive payments and other benefits from a legal settlement related to allegedly defective take on it airbags and their vehicles\nTo see if your vehicle is included and to file a claim to auto airbags settlement dot com or call one eight eight eight seven three five five five nine six that's auto airbags settlement dot com or one eight eight eight seven three five five five nine six [noise]\nNow today's real estate minute on WMA agency\nLaw in Maryland D.C and Virginia\nGives you an option to hire somebody who only represents your interests and isn't that what you really want I often walk in listings and here from sellers but they were frustrated years ago because they felt like there lifting agent was working harder for the buyer them for them having real estate agents that advertised that they have buyers will\nFind they can represent the buyers but that's not somebody that you want representing you when you're the seller agents represent buyers great\nAgents represent sellers great\nBut not both at the same time\nYou try to do both you have a definite conflict of interest\nI'm Eric Stewart along and foster\nThat's your real estate minutes\nAll real estate insight to tune into ... home here in liberal one local real estate news source this Sunday at eight am a poor\nVisit Eric steward groups dot com [noise]\nAre you supposed to job boards that send me tons of resumes to find a few people who are right from my job that'll process was not smart then I went to a zipper\nTechnology can be as an arms to find the right people\nActively invite them to apply and so I get qualified candidates\nOr the way they were good and the number one by employees in the U.S at ... dot com slash free net different groups dot com slash free\nAnd get qualified candidates\nThe way they could read it never went by employees in the U.S right now for free it's different ... dot com slash free that the recruiter dot com slash free zip recruiting work its way to hire the reading of hiring tied to the radio\nOne eight hundred got John can always get there quicker because we've got more drugs more people and better systems call you have to do\nHour working heroes we make problems go away we tried clean shiny try in where snappy happy uniforms because we're\nAnything you Lewis was gone\nWhich is our commands we work until midnight and seven days a week ago hundred God young form of that one eight hundred got John dot com history courage here\nIn Washington small family and a\nNot so smart maker ... slams von ... Trump for beyond tone deaf happy anniversary message to Jared on day after bomb scares hit democratic officials [noise]\nIt was you know ... the day that the bomb scares hit the Democratic officials there was a lefty charged with sending\nEnvelopes filled with a white powder to a bunch of Republicans but\nBut don't worry about that\nBecause the New York times says people like Charles Blow that say count me among the mob so they're proud of their mob violence\nThat's what they're all about that's what they had to make up present ski slams bunker for beyond tone deaf happy anniversary message to Jared you can't ... don't you know that there's a big news story ... you can't celebrate your anniversary\nMorning show co host of the pigeons sisters went after\nFirst daughter Ivanka Trump for sharing a smiling anniversary ... men to be nationwide manhunt for a serial bomber he's not a serial bomber starting up bombs there is no explosion there is no bumps he's a serial prankster\nThen deleted it may president's daughter White House advisor to wait it out the offending tweets on Thursday\nShe sent out a tweet Yvonne Condes yesterday was their wedding anniversary she set out a tweet with pictures of them nice pictures of them smiling and one is from their wedding day and they're about to kiss and he's wearing his ... his ...\nAnd she wrote you are in my life to my love my life happy in ninth anniversary Jared she wrote directing it to her husband Jared Kushner senior advisor to President Trump and um then Mika became very upset\nThey love the w._b. trait set off the host of Morning Joe\nWho became angry and she was angry at the wedding pictures she tweeted and then later pulled down she wrote this is beyond creepy is tone deaf\nCan someone helped them like no no we don't want to see that today on any day we want people in the White House to work for America during this difficult time when these ... things were being so I mean again\nA rice in envelopes anybody or anybody 'cause that was just it was very very recently I Know you have news timers but\nAnd then she's very angry we want people to White House worked for ... during this difficult time I guess the ... things going to somebody else where this difficult times show us that Mrs ... totally out of touch God help us that's what she wrote\nBecause she's a\nVery severely mentally challenged individuals not nice to make fun of the mentally ill but I'll make an exception and make us tests let's go to a a let's go to a phone call what do you say telephone call a let's go to John ... in Georgia John you're on the Christmas show\nCrafts enjoying your show I can call and false flag and be on the on the top stickers following this Chris me and my friend we don't like our car parking lot yeah [laughter] so yeah\nSo you don't wait a minute you're in Georgia and if you put in Trump bumper sticker on your car you figure liberals are gonna vandalize\nOh most definitely that's true in Washington either to where we don't want our hope is we don't want to make them funded by not in\nYour house on your house is to you don't put any signs in front of your house because of the violent left\nThat's right yeah there are no American flag thing for my court uh I don't want my courtship firebombed\nMy lord where in Georgia you must be in the Atlanta metropolitan area\nWhere we're we're close with her ... novel apparently here and making them down and you look at a big donors five or ... you know\nBut for ... well you know I mean you're right I heard you know turn drawing of blue yeah\nSpy on I guess you know yeah but for ... well you know I mean you're right I\nHeard you know turn Georgia blue yeah uh and and then the blue and then nothing they can put as much [laughter]\nYeah well there was a ... where was this one in New Jersey you said you're afraid to even put campaign signs in your front yard in New Jersey where Bob Menendez narrowly escaped a long prison sentence because these are corrupt Democrat\nThere is a lefty Menendez supporter there's video of it here of this left the Menendez supporter walking along a street ripping all of the the a Republican signs out of the ground and throwing them in front of cars in traffic\nA somewhat violently and then he is you know cursing and anybody that questions ... and you know you can't you come on you can't put signs up that don't support the Democrat will come out violently tear them down nowadays\nAh you know it's a it's a criminal thing they do that that's what\nI call for crack on this because we we like her home jobs in our cars we don't want to eat so we're out stickers on our cars\nI I Do I've got to say though I understand what you're saying John I'm Sorry that that that's ... George as well with the violent left violent everywhere they go\nI'm certainly in DC you don't put a Trump bumper sticker on your car will be vandalized that day you don't put a Republican sign in front of your house it will be vandalized that day it wouldn't make it through a day [noise] ah whereas you know you put your Hillary your Bernie ... never vandalized because we're not a violent mob\nAs a as a role but you know if you keep pushing you might be able to turn to send to one we'll we'll see how things go well you\nKnow you bring up that hundred million figure since Michael seventh putting all the time and thinking well where the communist taking over that they were ever a stop on the sides are maybe in Korea where we spent lots of treasure in lives for\nSale that took that to you know Joseph Stalin and saw a kid is true is Nineteen forty five and the Soviets and solved the communist regime of North Korea and they've been there we tried to unseat them um and a terrible war fifty to fifty three but uh but that's another story for another day do you know if that follows flag on it\nThat way or gun so they can uh so they can do away with this and put us in a re education camps\nNow that said that it's just around the corner thank you John thanks have fun let's go to Danielle and New York Danielle you're on the Chris plant show\nHi Daniel I just wanted to say that of course it's possible for a crazy person\nSupport Trump ... not responsible for each individual because anyone who attacks can't hurt or killed people something wrong with that and the problem is that democratic leadership\nIs calling for filing and for the correction I'm Democrat too with funding that will let their response to both for\nWell you know there and and look I Would agree with you wholeheartedly and we've got James Hodgkinson the Bernie supporter and the news media to could care less about him where the\nThe the uh a white powder envelope sent to administration officials last year we had them sent to Eric Trump's house to Donald Trump juniors house now we've had them just in the last six weeks we had these envelopes to the\nTo the state department or the state department the CIA to the FBI to the defense department to the White House news media didn't really cover that certainly not with this level of hysteria\nThe guy was arrested they didn't cover that enough helicopter shots the guy was charged in court day before yesterday they didn't cover it\nBecause they don't consider those to be a terrorist attacks of course that and they and I I Know what the hell the responses Danielle their response is that Trump caused this by his rhetoric\nBut Democrats didn't cause that by their rhetoric\nBut they're back home for ... all his rhetoric that said that they are fake it but\nThey they'll run the video on a loop of President Trump over the course of the last two years\nSaying I'm a you know ... like a punch him in the head you know I go and get them out here I'll pay your legal bills that's all there and they say sees encouraging violence and they latch onto those few soundbites from the last couple of years now we've got Eric Holder about a week ago saying when they go low we can come\nAnd Hillary saying there will be no civility this is just in the last weeks and the last couple of months at most\nAnd all that trying to Chris Rock Obama going back years getting their face and that they looked at the end and here's the thing we don't have mobs smashing windows and burning cars and beating people with sticks we we don't have that\nThere was the Charlottesville thing that they loved to latch onto that crowd was full of left wing or as with a mask over their faces in clubs in their hands when that lunatic crashed his car into the crowd within two seconds there were four left these bashing out his windows with clubs within two weeks\nI'm sitting there hands when that lunatic crashed his car into the crowd within two seconds there were four left these bashing out his windows with clubs within two seconds and the news media always\nStudious late edits just before that point now but I I I don't know about false flag I don't I don't uh I I'm an evidence person and I don't suppose anything I've been saying all along that it's about a fifty fifty split on whether it's a righty or a lefty either way it's not I want 'em ... either way\nAnd if it's a righty then the news media is going to go crazy for days and weeks and they're going to cover the trial like it's the you know ... and and it fits a lefty that they're going to say oh well thank God it was just a false alarm and nothing actually happened here because that's how they work to\nHelp us the emotionally if he's elected\nThat's all well and that's the standard thing every time when you get a jihadi they say well he's got and this guy's clearly I just buy a bumper stickers or their stickers all over his van", "show_name": "The Chris Plante Show", "year": "2018", "city": "Washington", "day": "26"}