{"month": "10", "state": "DC", "station": "WMAL", "content": "Taking people and why we're\nRebuild and repair runways all kinds of terrain under all kinds of conditions to keep our claims why\nWe maintain an array of magnificent aircraft\nFighter jets to one so big big and Jerry hundreds of thousands of\nRoutinely perform amazing such as refueling planes as they fly to their destination\nWherever your neighbors we live and work in your community still hold part time jobs to keep America\nWe are the air force reserve and we're proud to be America is when\nDo you do you\nAnd A L do you feel if it would which do you and they all Washington\nWashington election headquarters\nJail [noise]\nAnd they all news at nine I'm had occurred at thousands of Central American migrants are not being deterred by efforts to stop them from coming to the U.S correspondent Patrick ... says when Mexican authorities prevented them from crossing a bridge from Guatemala into their country they found other ways to get there\nSome cross into Mexico we bought him on my boat\nFour square just barely\nFor thousands of migrants mostly on tour and said they were fleeing poverty and violence many or wishing to reunite with loved ones\nPresident Donald Trump is sad they will be turned back when they reach the border between Mexico and us\nThe European Union calling for credible investigation following Saudi Arabia claim that journalists and ... she was killed during a fist fight inside the Saudi consulate in Istanbul correspondent nic Robertson chat a Turkish investigation it's focusing on finding ... body\nFrom the Saudi justice ministry yesterday saying that because it happened on sovereign territory involving Saudi citizens just as the jurisdiction of the implication being that if a buddy was handed off to Turkish collaborators ah that's the implication than than this would be if you will on the Turkish to discover whether ...\nPresident Trump says he believes the Saudi account but still doesn't know where the body is students at Walter jumped in high school alerted the least to the rats they say their classmate made on Snapchat\nIn Allen Eighteen year old ... harassed Montgomery County police St Louis ... era hosted a picture on social media in South holding an AR Fifteen but a caption reading school shooter\nHe also posted that he hates W. J. and plan to shoot it up he was arrested Thursday and charged with one count of threat of mass violence where it's being held without bond\nMeteor shower made by Halley's Comet is speaking tonight that you probably won't be able to see it\nUnfortunately the moon is about Ninety seven perceptual which means that you have this natural source of boy in the sky which will wash out all but the brightest of the shooting stars\nJeff Chester with an evil observatory said your best bad of getting a glimpse of the ... meteor shower is to leave the city and go to ... Howard county wants to turn your unwanted leftovers into organic landscaping gold\nIn twenty six Detroit them to remain around eleven thousand to regards of compost Justin\nIs with public works as that amount will double with the county expands it's composed facility\nIn being able to process what would be a waste\nRight here you reuse it a landscaping materials luckily our roads our schools rarely barks for the county ...\nCounty executive Ellen Ullman says by next year thirty thousand homes will be sending food scraps of stability to be recycled instead of being thrown in a landfill John nephews on W. M. A. O. W. O. L. dot com\nAnd sports the LA Dodgers are going to the world series after beating the brewers by two wanting games ... yesterday the wizards fell to the raptors one Seventeen to one Thirteen and the skins or at home today playing the Dallas Cowboys at four twenty five boys at the Redskins Larry Michael Dell WMA ALS mornings on the mall\nNeither team as well to straight this year for these two teams of where I left right and and whoever wins this game's going to have a pretty good start the season of the division\nYou can hear all the action starting with pre game coverage here on WBAL three twenty five trusting him either an accent WMA out\nAfter you win over the panther and we have you been doing for the cowboy boots off live from your group\nWhich begins Sundays we ...\nBegin Sunday we twenty five\nM. A. L.\nI'm Nick ... is a liquid agent with the true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him\nWell I talked to many highly rated term life insurance companies we represent\nAnd found re who was forty one and takes medication to control his cholesterol a ten year five hundred thousand dollar policy for under twenty seven dollars a month that's almost twice the coverage for less than half of what he had paid to select quota hasn't shop for your life insurance you're probably paying too much for your free quoting\nCalled eight hundred for two three forty five fifty seven or eight hundred for two three forty five to seven\nEight hundred for two three forty five fifty seven or go to select code dot com and since Nineteen eighty five we shop you save\nGet full details on the example policy of political down how much commercial surprise could vary depending on your health insurance company number ... ...\n... your carpets cleaned venue need heartbeat to go to Joe ... dot com [noise]\nAnd I know fine fine point nine ... thirty hours trying to become weather here's Michelle marry and then the carpet cleaning\nTraffic center the earlier accidents on the Internet for the beltway after the legion rage has been\nCleared and delays have easy now in the district we do have the police activity closing down in New York Avenue imposed directions between north Capitol street and first street to follow police direction they're also in heights ville to uh to remain closed at national Henson avenue because of his theory is acting\nHeavy earlier roadwork on more than three Ninety five I think you've seen the seminary road has been cleared the delays heavy we do have construction west to east of the Fairfax County parkway and the left lane now from garage ... W and the weather channel\nMostly sunny behind low fifties tonight areas a prompt otherwise mostly clear a low rent thirty eight right now fifty seven degrees in Washington I'm Heather Curtis sound Washington's Mount Lemmon now\nThe following program it's paid for by sponsors who are solely responsible for its content views expressed on this program or not their views of W. M. A. L.\nY. Z investors show right now on one oh five point nine to ... am six thirty W. M. A. L.\n[noise] listen the wives investor radio featuring the wives you\nThree decades the wires investors will be better understand the marshes analyze stocks\nDuring that thirty your vote for the life that show the money in their way of using a conservative value oriented style\nHere's your host Simon\nHow many articles have you read recently offering after the fact explanations in great detail and was complete and utter certainty for this sudden rise of market volatility\nPlenty on my end explaining the sudden and for some unexpected decrease in prices in hindsight is simple what's left so it was properly framing the balance between potential risk and reward going forward so let's take a look at this rapidly evolving backdrop and what you should probably be focused on if you're going to make wise investment decisions\nGood morning welcome on board as always another busy edition otherwise invest your show\nI've said multiple times over the years that no points are awarded for determining causation\nSo easy to sound smart on T. V. O. pining about how X clearly led to why and produced unexpected result\nButter reality there are countless influences on stock prices many unrelated to fundamentals such as the whims of automated computer trading programs seasonal portfolio moved by hedge funds in in large institutions like mutual funds to think that you can stick the cause with any great accuracy\nIt's a fool's errand and even if you're right who cares that only helped you understand yesterday's move\nSo up next let's discuss the current increasingly challenging backdrop but plays most of the weight of what factors are likely to impact stock prices in a sustainable way not those whose effects may wear off in a day or two I think it's appropriate to do with deeper dive than I normally do into the big picture\nA few times over the years I've come up with a checklist of common investing mistakes given the ratchet up and volatility a refresher might make sense right please understand I'm not suggesting that we have all the answers and I'm certainly not trying to lecture you\nSometimes it's just important for all of us me included to look in the mirror and assess some of our inherent weaknesses and maybe more importantly buys these emotions and attitudes towards risk and reward generally influence investment outcomes more than anything else including returns themselves\nOf course we're in the early throws a third quarter earnings were reporting season as time allows all highlight what\nMore than anything else including returns themselves\nOf course we're in the early throws a third quarter earnings were reporting season as time allows all highlight what a few of our top holdings have to say as well so a lot to get to remember do you miss anything please go to our website tomorrow that's the wise investor group dot com\nSo maybe this weaknesses in surprising a next sick with sick with me I Want to finish this thought we can't dismiss the idea that this is the start of something more dominant more pernicious\n[noise] just doesn't feel like that to me [noise] back in ... you're\nListening to the wind investor shows to Tokyo host for anyone from the winds invest a group called eight six six seven five eight selling fool seven three seven years old become a better informed wise investment [noise]\nMy point ... hey I'm six thirty W. N. A.\nL. we're children be ready to manager assets after you're gone are there any strings you would like to attach have you considered their spouses and you're planning this is chase interesting co host of the wives and best of show on WMA al we help our clients with these and other financial questioned and we'd be happy to discuss how we can work with you give us a call you'll like what you hear\nTo reach chase called eight six six seven five eight nine four seven three or log on to the wise investor group dot com and resolve to become a better informed wives investor\nSo your doctor says you need an MRI granted it's a marvel of science in modern medicine but hardly a convenient are comfortable prospect listen are you going to submit to the discomfort of being run through a to put your foot down put two feet down and experience the most revolutionary way to have an MRI anywhere\nWashington's open MRI now has the world's first high field strength up writer weight bearing open MRI with lower out of pocket costs for you choose Washington open\nMRI ed one eight six six MRI ASAP that's one eight six six MRI ASAP\n[noise] Hi madam can can you hear owner of valor roofing this fall we want to thank you for making valor one of the most hired him trusted rivers in our area valor roofing is built upon the principles of honor respect and trust this week for police to root for payments as low as Ninety five dollars a month\nTo get a free upgrade HD architectural shingles or things to\nSeven three seven to one forty nine thirty one to schedule you're free to come in\nAnd check out our latest raise a roofer event for about ... dot com\nWhen the need for senior care arises there's no place like home\nYour loved ones should never have to give up living at home\nVisiting angels will provide home care for your mom or dad at home up to twenty four hours per day including personal care meals and light housework you'll select your professional caregiver with visiting angels look up visiting angels dot com or coal eight seven seven three seven four live that's eight seven seven three seven\nFour Liz franchises are available\nVisiting angels America's Choice in senior home care\nWashington's mall W. M. A. L. more Washington comes to talk [noise]\n[noise] [noise]\nThis is a wise investors show on the wives investor network\nComebacks allies and veteran shows Simon Hamilton here as I start talking about before the break been talking about the big picture we can't dismiss the idea that this intense selling to start on October start something more pernicious but I'm not sure that's\nGoing to be the case ultimately I mean the remember the fed is responding to a strong labor market and a record performance by the service sector and our economy not to mention manufacturing data still clearly an expansion mode\nAnd they're doing it by raising rates gradually against a backdrop of low inflation pressure in fact I was seeing just recently in the September consumer price index report that showed inflation ... uh pressures weaker than expected\nAny political buys these aside it seemed to strengthen the U.S economy Israel with a great job market there still more openings and can be filled and it's not just being supported by quantitative easing from the fed maybe like it was a few years ago\nAnd recessions have never started with a real federal funds rate that's the rate that the fed controls relative to inflation near zero\nBut perhaps the clock is now taking a bit as Ford returns for equities decline when real rates start to move from below zero where they've been the last few years to positive so that is true another angle might be that perhaps now we're in the period\nWhere the positive parts of the of the president's agenda and overall economic strength have already been factored into stock prices while the negative parts that were sort of part of the background noise and partially reflected are now coming to the forefront\nThat doesn't mean that the next chapter is bad it just means that market has to take some time to appropriately price the risks just as it took time for the positive aspects to work into stock prices remember stuff didn't fully reflect tax cuts and twenty percent plus earnings growth to probably August\nWouldn't surprise me if we had sort of what they call range bound trading and developing over the next few weeks as we all sort of balance these had wins and he's still\nTo me if we had sort of what they call range bound trading and developing over the next few weeks as we all sort of balance these had wins and he's still present tell what's\nThe worst thing in the world I still believe in optimistic biases warranted but what about earning specifically this is what I Want it to get to this is probably where investor ... is the greatest and also the most appropriately focused\nIt has been the persistence of record profit margins over the past few years that have really kept this thing going right to stay low input costs like oil had been benign wage growth has been subdued companies have become more efficient by using technology and of course massive tax cuts perhaps provided they direct boost to bottom line profits\nAnd on the face of it with high profit the strong profit margins and weaker prices\nStocks have become more reasonably valued the PE on the market the price to earnings ratio in the market is lower than where it was in January some follow the P. E. to gross or the so called PEG ratio which compares the price investors are willing to pay for expected earnings with how fast those earnings are expected to rise\nAnd as it stands we're seeing the lowest and therefore most\nI guess enticing ratio if you will since two thousand eleven high earnings growth with lower stock prices makes socks more attractive put another way\nRelief from stretch valuations has come as companies have exceeded expectations and estimates had been revised higher and profit margins have continued to move to new heights as I said\nBut that PE to growth ratio looks a lot less compelling compelling when we look at it that\nCompared to forward looking earnings everyone knows earnings aren't gonna grow two thousand Nineteen over two thousand Eighteen like they didn't Eighteen over Seventy would be almost impossible based on consensus forecast of about twelve percent earnings growth next year\nThat PEG ratio goes to about one point three are actually slightly higher than where it's been since the mid eighties saying can be said if you look at other types of valuation metrics now it's very early in the earnings reporting season but so far the percentage of companies beating estimates for both sales and earnings\nHas been above average but the degree to which they've done so it was below average\nIt's also true that post earnings reaction uh in in terms of stock prices from companies beating estimates has been much more subdued than it's been a recent quarters so what does this tell you tells you the good results are mostly baked into the cake\nUnless evaluation is low enough and expectations were really subdued and of course the penalty for eight disappointing report\nWill probably be more severe than usual with a bar set so high so it's anecdotal reports of rising costs becoming more widespread\nThe focus of margins as he is who is certainly going to become more acute going forward I don't think it's any accident that the companies that have under perform the most in recent weeks or those facing some of the biggest bottom line pressures\nWhether it be from a rising dollar higher rates higher raw material costs consumer staples materials stocks utilities there in the crosshairs\nOf next stick with me I Want to finish this thought talk about what you really need to focus on in your stock\nAnalysis for you to be successful I think particularly over the next six to twelve months and they don't want to switch gears talk about some common investors we all make it ties need to look in the mirror backing\nYou are listening to the winds invest a show for sound advice about your personal financial situation coal eight six six seven five eight ... online otherwise invest a group of comb\nFight going on at ... am six\nEver wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning habanero battles award winning technology gives you speaking right away whether you're learning Spanish French German and best of all I Do remember what you've learned and\nI always thought I was bad at languages but after using battle I can tell you I was just talk the wrong way using battles ten to Fifteen minute lesson you can be speaking confidently in your new language within weeks to me that I can start having real nice conversation right away so fast and now I'm speaking Spanish\nNo wonder battle is the number one selling language learning happen Europe trying for yourself and see my battle is the quick way to get conversational in a new language like Spanish French for more you can try and battles were free to go to ... dot com or download the app and try and for free\nThat's battle B a B B. E. L. dot com or download the app to try it for free that's babble dot com\nSmokey Bear for teaching us how to prevent wildfires for Seventy years outdoor lovers everywhere and want to give you a bear I Want to give Smokey Bear hug for teaching me that of fires and out till it's cold for teaching me to counseling silently wires lashing out at a gas was showing me that's far from a drag into Jane can start a wildfire being being striking bear highlighting\nFrankly they're happy seventies big guy let's bring it in ...\nShowing me that's fortunate dragging to drink and start a wildfire being\nBeing seizing bear I like the funding there that would be Seventy\nIs big and bring it in Burbank Scott we smoke you happy birthday using hashtags Smokey Bear hug ... by the U.S Forest Service you stay forest fires and the council\nIs you know the team I don't hear our bureau in New York and they're going to be a permanent teenagers potential commuting road going to be strong feelings about foreign hearing what they also have a more personal when it came to blow the independent\nTo meet your long term spending goals so make sure you have a written planet isn't hoping a prayer for an extended bull market but one that uses some genes grounded in the strong likelihood\nThat returns over the next eight or nine years will probably be less than the ... the last eight or nine years that's just reality doesn't mean that would be bad weather to lose money or that you can't add value through good security selection a bigger emphasis on dividend yield better fixed income yields\nJust set\nPrice growth capital gains may not be able to bail bail you out as much as they have\nI've talked to over the years about how valuations are poor timing indicator butter reliable predictor of future returns simply put when valuations are extended as they are now to a degree\nFuture returns are lower and vice versa just makes sense right the higher expectations are the easier it is for them to get discounted prices\nAnd leave Oz susceptible to disappointment same relationship is found in the household exposure to stocks I read a really good piece by Nick ... who quoted on the show before talking about this and how when the average investor allocation to stocks has high returns for the next ten years or low\nBased on pretty compelling data from uh\nAmerican Association of individual investors\nI mean we know this anecdotally without even looking at the stats right here and he noted Nick noted how business weeks infant miss the death of equities issue came out in Nineteen Seventy nine right before the best back to back decades in us stock history\nOn the other side dot com bubble was the point of maximum stock demand right before a decade of lower returns so folks it's appropriate to be optimistic but states over let's switch gears\nQuite a really good piece from Michael baton equipped quoted on the show before ... management New York\nEntitled ten common investing mistakes and I've I've done a similar thing probably three or four times over the last five years I think sometimes it's important to step back look yourself in the mirror and say listen am I making these types of mistakes\nI'll Try to get to all\nTen really briefly all ten or injurious to your long term returns oh at some of my own color as well of course one investors tend to expect the future\nTo look a lot like the recent past when stocks are going up we expect them to continue of course the opposite is true\nWe believes we believe that object stay in motion [laughter] and two thousand seven after years of strong gains and was prices getting above the dot com peek a lot of people thought that the market will go up the next year if you read surveys at that time including professional no money managers surveys\nAnd when stocks crater during the great financial crisis to percentage of people who thought the market would be higher twelve months into the future was cut in half course\nDoing the opposite would have made more sense same thing with sector selection if you look at these if it's in charts that show you the best and worst performing sectors each year it's uncanny\nHow the best performing sectors several years often but come the worst the next few years and vice versa same thing goes for asked the class is like international versus domestic value versus growth even stocks versus bonds these things go in cycles don't think that the current trends will be the future trends\n\nHow about this one you've heard me talk about this investors behave as if the price we paid for security should somehow be factored into how we view the investment going forward as ... points out stocks don't care that you hope to achieve a twenty percent return over the next year\nOr\nYou know you've heard that the you know people say I'll sell want to get back to even that idea of sort of hankering to purchase price is dangerous 'cause most stocks are losers if you look at the numbers most stocks in the wheelchair five thousand will not be sold at a profit or even at a break even press\nThere's nothing wrong with taking a small loss it's big losses that are hard to recover from financially and emotionally anybody running a diversified portfolio like we do a thirty thirty five forty holdings you're not going to ... thousand I don't care how smart you are no mutual fund bats a thousand here just looking at the overall return\nYou have to be able to manage risk\nAnd if a stock does go down like they most stocks are right now stuck goes from a hundred eighty you shouldn't look at it and say well I paid a hundred some of the wait till it gets back to a hundred\nIf a stock does go down like they most stocks are right now is stuck goes from a hundred eighty you shouldn't look at it and say well I paid a hundred someone to wait till it gets back to a hundred usually should look at the prospects for that company here in eighty dollars and decide if it's a good investment going forward\nOr the fundamental still intact is the thesis still intact that's the most important consideration\nAs a famous a hedge fund manager David ... or you know once said what do you call a stock that's down Ninety percent it was a stock that was down eighty percent and then got cut in half so it's it's never too late to sell you think that something is a broken stock\nWarren Buffett sorry always talked about this one investors make the mistake of thinking about the stock instead of the business remember when you own shares of his stock it's ... it's an ownership stake in the future cash flows of that business\nIt's easy to forget that the stock is more than a price on a computer screen you really when you're investing need to have a three to five your outlook minimum\nOkay very few people have that in this day and age of computer trading and a program trading seems like if a stock doesn't go up in the first thirty days it's declared a loser make sure you understand the business okay\nPeople are loath to admit that they were wrong about anything and it's particularly true with investing most people would rather hope that they're right than admit that there are some sort of related to what it said a minute ago the best way to prevent large losses has to take small losses\nStock doesn't know that you own it all those marvelous things or those terrible things that you feel about stock\nAll those things are on reciprocated by the stock with a group of stocks\nDon't fall in love with the company\nVery important a lot of people you know this comes up in my conversations with clients all the time\nYou know I'll never sell my XYZ stock\nWhy because maybe it made you a lot of money ten Fifteen Years ago remember folks when you're investing it has to be about the future prognosis what has occurred in the past now again this doesn't mean that you can't stick stick with a blue chip that's gone through tough times that's not what I'm saying\nI mean we just bought Starbucks recently symbol sb you X trading around what fifty eight fifty dollars a share so that is a ... you know has been one of the best growth stocks in this country for a long time they've been a dog the last two years so I'm not saying that\nYou know you can't go back to a company or hold on to a company that goes through a rough patch but you have to have a future thesis\nPeople often look to others for approval see this all the time it's comforting when somebody on the TV or you know it says something positive about the ...\nAnd it's not just stocks right is politics to write it's natural to seek out opinions that we agree with\nThat is why a lot of left wing liberals watching ... ah NBC all day a lot of right wing conservatives watch Fox News all day because everything on there is going to evaluate ah you know validate your opinion I get it there's nothing wrong with that I'm not criticizing you for that but when it comes to investments\nYou really need to be objective and just because somebody in the crowd agrees or disagrees with you\nDoesn't mean you're right or wrong\nPeople are over confident\nWhat's that thing everybody thinks that they're good looking and everybody thinks that they're a good driver or the ... sex brushing like that by definition that can't be the case right we all think we're at least average when it comes to intelligence\nOne of the most important characteristics of really successful investors is that they know their limits Warren Buffett's the poster child of this of course he's at Berkshire Hathaway right simple B R K be\nTrading uh about two hundred and five bucks to share one of our largest holdings off it's always said this he didn't invest in technology during the dot com bubble 'cause he admitted that he didn't understand it\nHe didn't know what was driving these companies he didn't understand the fundamentals so I didn't go into Enron he didn't understand the balance sheets and we know how that turned out no your circle of confidence were like that here to be honest\nIf we're investing in something like emerging markets are high yield bond or something that we feel is a little bit out of our\nSkill set will do it through an index or do it through a fund some sort of broad basket we're not going to try to be a hero this one folks I have to share with you because it comes up literally on a daily basis success in one area of life\nDoes not unfortunately guarantee success in the market is uh somebody at a one of the founders of like Mason\nWrote it at one point expertise is domain specific when experts in one field shift their attention to another field performance or Keats retreats to the novice level I hear this all the time my brother is an MBA or my brother's a CPA so he knows a lot about this or\nA ... you know he's a smart guy he went to Stanford so he understands the market\nWhere my brother's a CPA so he knows a lot about this or a ... you know he's a smart guy he went to Stanford so he understands the market\nNot necessarily the case unless you're immersed in this business on a daily basis and read what we read and other professionals read does not necessarily mean that your expertise translates and the worst is when somebody ... works for a large company and thinks that they know that company\nNot what you might work for Starbucks I already used as an example and you might be involved in their you know something to do with their China division you might have some insight there\nUse a shorter better job than\nI Am like so Joe you you\nYou don't have to speak team to be a perfect parent thousands of teams in foster care will think you're I'm\nJust the same\nAnd learn more visit adopted us kids dot org\nPublic service announcement brought to you by the U.S department of health and Human Services adopt us kids\nParalyzed veterans of America national service officers courage or racial men and women who are seen war you're going to be voice\nWas Britain's locker room changing lives building that's paralyzed veterans of America to learn more TV Guide or a public service message from ... to veterans of America oh\n\nOh you are they all if it were rich W a male Washington shot one thousand dollars\nTo leave him in jail [noise]\nA male news at ten time had occurred at Mexico try to stop them but a caravan of thousands of Central American migrants continues to track north to the border Mexican authorities wouldn't let them cross the bridge from Guatemala into their country so correspondent Patrick ... says they took ...\nDeliver a heavy load of some of them was carrying out on their back and now they're going to get off here finally on the Mexican side of the journey north to the United states\nPresident Donald Trump has vowed to keep them I rinse out of the u._s.\nDisturbing social media posts lead to the rest of the Montgomery County high school student police say Eighteen year old Luis ... of Rockville posted pictures of himself on Snapchat holding an ale or Fifteen but loaded magazines and the caption school shooter\nStudents at Walter Johnson high school told the school resource officer ... also recently posted I hate W. J. and ha ha I'm going to shoot up the school he was arrested Thursday in charge with one count of the right of mass violence to where it's being held without beyond\nThe University of Maryland board of regents has the results of an independent investigation into the culture of the university systems football program\nThey'll talk about the findings to special closed door meeting Tuesday the ... comes after football player joining McNair collapsed during a team workout and died from heat stroke over the summer the findings of the investigation will be made public next week\nA separate investigation found trainers didn't take the right steps who make narrow down after he collapsed\nThe Washington Redskins take on there and have these divisional rival the Dallas Cowboys today both of the Redskins Larry Michael W. I. males mornings on them all the cowboys are a straightforward team\nIf you look at the statue look at their roster you got to stop their regimes go Eliot ... Scott is going to roll the ball game is this something that's going to Syria their defense will though their deepest upstanding especially against the road\nYou can hear the game right here on W. M. I. L. pregame action starts at three twenty five kickoff sat for twenty five [laughter]\nAlert can from Senate majority leader Mitch McConnell at a restaurant yesterday audio courtesy of TMZ\nIt was at a diner in Louisville, Kentucky and Senator McConnell is having dinner with his wife transportation secretary Elaine Chao he was confronted by small group of people including a man who yelled at the to\nThe encounter at the Havana run the restaurant was captured on video it shows a man shouting they're going to come for Social Security and why don't you get out of here earlier this year White House press secretary Sarah Huckabee Sanders homeland security secretary Kirstjen Nielsen and Texas Republican Senator Ted Cruz also had similar encounters\nCorrespondent Linda Kenyan Howard county wants to turn your scraps into fertilizer\nWith the technology and the improvements here will be able to like the threat from thirty thousand homes by next year\nCounty executive Ellen Ullman says those scribes are turned into composed which has been used for landscaping are sold the wholesale customers it's been so popular the county's doubling the size of its ... we're\nBlessed that we're able to\nWithout aggressively marketing so all the composite we make here\nJeff Dan is with the county public works department says composting costs less than dumping and it saves space in the landfill is well John nephews on W. W. O. L. dot com\nVirginia and violent environmental regulators give the green light for an ... ground natural gas transmission line called the Atlantic coast pipeline next tropical weather and WMA how\nDo you got an Amazon Echo you got a new way to\nTransmission line called the Atlantic coast pipeline next chapter matter and ...\nYou got an Amazon Echo you've got a new way to listen to this is true human wanting some awkward\nLimbaugh leery O'Connor mar\nThan it is for one time that upstate the evil W A L skill once your devices unable to save the lifestyle and it's really that simple however you can actually getting breaking news on the Inside Story never be able to do what do you have a ...\nAre you paying too much for term life insurance\nThere's a tremendous price war among the major term life companies rates have dropped dramatically in the past few years for example among men aged forty five ... tobacco user one million dollars of coverage Seventy five dollars per month level rate for the next ten years or a man age fifty non tobacco can obtain five hundred thousand dollars of coverage for a monthly premium of only one hundred ten dollars per month\nGuaranteed not to change for the next Twenty years that's right\nLevel right guaranteed not to change but the next Twenty years\nIf you're a smoker we have great rates available for you as well at turned busters we specialize in policies of five hundred thousand dollars and above if you're looking for new or replacement term life insurance called today for quote at one eight hundred five six nine fifty for\nForty that's one eight hundred five six nine fifty for forty you're probably paying more than you should call term busters one eight hundred five six nine fifty for forty or visit our website that term busters dot net remember one eight hundred five six nine fifty for forty rates in availability may vary by state sample read quotes based on preferred not tobacco underwriting exam required to qualify\nMe your carpets cleaned Tibetan you need a need to go to Joe hot needs dot com\nThat went in ... six thirty WMA out chocolate and whether he was Michelle Mary and the heat the carpet cleaning shopping center\nOver all traffic running well on the beltway to Prince George's in Montgomery County and through Virginia as well and the district we still have New York avenue close between our capital seeking first date for police investigation and we also have to to still closed in both directions at math in the hands that avenue\nTo accident activity also we have been slow traffic right now in the south and Baltimore Washington parkway between the Enron a Prince George's blind in one Ninety seven and delays continue from one Ninety seven to powder middle road snapping garage dot coms WMA our Weather Channel\nToday mostly sunny hind fifteenth tonight areas that problems that arise mostly clear low around thirty eight now forty nine in Washington I'm Heather hurting someone who find point nine ... six thirty blossom in small WMA how\nThe following program is paid for by sponsors who are solely responsible for its content abuse expressed on this program or not the views of one oh five point nine ... am six thirty W. M. A. L.\nToday's show is provided for entertainment and general information purposes opinions expressed or does the presenter oldie we make no promises are guarantees of investment performance on light training academy is not a broker dealer certified financial planner or register investment advisor enjoy the show\nFrom the do yourself that show this is Chris ... and during the do's and don'ts for the financial markets thanks or sponsors Tom Landry academy contribution to show possible online training\nAcademy has been helping individuals like you've become do yourself investors since Nineteen Ninety seven\nOnline training academy as two campuses to serve our listening audience one in Tyson's corner and one near BWI Airport\nAnd now that we have market volatility back we're getting people in with a lot more conviction and a lot more motivation to prepare themselves for the markets volatility markets up to the markets dams OK so a week ago when the market was plummeting down ten percent\nWe have people came in and they saw there's a real threat to their wealth\nAnd you know if you have money and a four one K. your money is always at risk\nAnd it's taking these market hits but very rarely get the nice bounce back on the upside and for most folks just to realize we're at\nThat at ... during this week if you had all of your money in the S. and P. five hundred then you'd be lucky to be a break even and then then you have to subtract out the fees and expenses which makes it less likely that you would even be a break even for the year\nAnd so when you're taking a look at this from a long term perspective and look at it from as a business person you know you're going to have appears in down years but why on earth would you allow that to happen it'd be philosophical about it okay what did you want to be able to learn is there a way that I can protect what I've got\nTo take some steps to actually be making progress on a regular basis in the market\nAnd for a lot of our students they come to us because they have assets and they're tired of this roller coaster and you were able to get complacent over the last few years over the last few years market didn't do a whole lot so you were able to sit back and relax and you know see what might happen but\nYou know this year has been very clear from February and April into June\nYou can relax and you know see what might happen but\nYou know this year has been very clear from February and April into June and to September and October the gums were happening and so these guys are the warning signs that at a moment's notice the folks of money are going to want to protect themselves [noise] and so part of being a do yourself investor\nAs realizing that one of the most important things you can do is learn how to protect the Capitol you've worked so hard for\nMe right you know you've earned capital by the sweat of your brow you pay taxes on the capital and then you have to defend that capital from all those things and wine to spend money on it\nHere and Tyson's corner and up near BWI Airport in the Baltimore area and you know on a tray cat has been helping people\nGenerate income from the market for over Twenty years now and we've been in the DC Baltimore market for eleven years and part of that as we've seen the opposite we've seen the dams and we're approaching a spot where those downs are pretty likely\nAnd just also recognize that you know there's opportunities as the market goes down if you learn how to position your assets more effectively\nAnd you know part of it is you know we've been brainwashed to focus on the stock market and the certainly opportunities in the stock market and if you love the stock market that we have programs that you can use to focus on that\nBut for most of our people as they start positioning their assets differently it's taking a look at things like for X. or things like futures or even just how can I get insurance on my current portfolio how can I protect what I've got\nMore and more significantly how can I be generating income from what I've got without the market risk because ... you know with the market in a high volatility area you don't have to participate in it\nThere's things that you can do to remove stock market risk from your whole portfolio and if you're worried about it you know you can remove that mark a risk and then develop some strategies that don't rely on the stock market to generate more income\nUh that sounds like a winning combination when you're worried about what's going on the stock market and the folks that we see aren't particularly confident that this is going to keep going up to ... billion ride the market is already told us it's kind of stalled out\nCrash down and what we need to do is recognize the markets talking to us you know the people with money are talking to us and the key is do you know what they're telling you\nDo you understand the message that they're giving you and are you able to take action based on the message that they're giving you that so that's what we help our students do at the online trading academies understand that you know they're always opportunities around us the key is to position ourselves so that we have the right frame of mind\nAnd we have our money in a safer and smarter place and so if we want to you know we can use that strategy that Sam side and talked about a few weeks ago and remove all stock market risk and at the same time get the benefit of stock market gains when they appear\nAnd with Sam talked about was basically having money in a diversified bond portfolio and using the interest from those bonds to buy call options on the stock market you know ... five hundred or something else and use that to generate potential upside\nBut with no stock market risk\nWe can do similar things and expose ourselves to other markets if we don't like the stock market up side so we can still have our money outside and absorb no stock market risk generate income and then we can buy call options on other assets\nThat you know seemed to have the wind out their back\nAnd so we know oil right now is they're charging up you know we've got excitement in the middle eastern excitement and other oil producing nations we've got a public policy that his focus on driving the price of oil up\nAnd so in that case you know maybe that's a strategy that you could use to help protect yourself and give you some peace of mind and it's part of positioning your money away from the the high risk in the stock market but still give you the opportunity for beneficial returns and so\nPart of what we help you do start looking at your money differently and start thinking bigger about the opportunities around you\nSo you don't have to be a victim of whatever the markets throws at us next and you know we're starting to see you know people steps are quick and you know they see that the end is near\nBut people aren't willing to take a position\nWhere they're protecting themselves right now\nWell that's the perfect time to start protecting yourself\nYou know as the market charges up again this is the perfect time if you weren't if he didn't get your money out of harm's way the last time this might be a great time to do that\nAnd then start learning about alternative ways that you can use your capital to generate safer and smarter returns without stock market risk because that's where\nIs that you can use your capital to generate safer and smarter returns without stock market risk because that's where you know\nWith the stock market where it is now with the volatility ever present and with the upside really kept unlimited based on what's going on in the environment than we probably need to start looking at some other ways to generate income going forward\nParticular as we head into the new year and as we start seeing you know the trade policies are kicking in going to have a real significant impact on our consumer based economy and if you look around\nThere's a lot of retail spaces that are empty now there's a lot of bacon shops that are have been available for a lot longer than they used to be\nAnd if if you were there back in two thousand eight two thousand nine if you were there and two thousand two thousand one here there Ninety to Ninety three right you saw the same sort of thing where all of a sudden this commercial real estate there was less appetite for it\nAnd that was the beginning of those are the canaries in the coal mine\nAnd so as the canaries in the coal mine are giving us a message we need to be able to listen to them and take action based on it and so what we're looking for the online training academy or people that see these canaries and want to do something about it\nAnd folks that are ... you know willing to learn a new way of thinking and have a higher aspirations for their assets then the conventional approach [noise]\nWell we're looking for folks that you know believe that they can do better you know they've gotten to where they've gotten in life through hard work\nThrough their brain power and what we want you to do is bring that hard work bring that brain power and apply it to your own financial assets so instead of making money for someone else we want you to use your hard work and use your assets to make money for you\nOkay and that's really the core being do yourself investor is taking a hard look at you know what have you been trained to do and most people have been trained to be an employee\nAnd most people have been trained to work for someone else and that's certainly where I started and you know there's some benefits to working for someone else as far as responsibility and focus but at the same time\nEveryone should also have an aspect of their life of their financial life that they have control over I think that's part of the allure of a lot of the personal finance ... personal finance approaches that you know you may work for someone else but here's some things you can do to manage your own money\nAnd my concern with most of it is it is like most of the personal finance advice assumes that you're in a static world assumes you only have one stream of income\n[noise] it assumes that you're not getting a raise it assumes that you know wherever you are as good as it gets and then you just have to hope and pray that nothing happens between now and the time you turn a hundred and maybe you'll have accumulated enough um that you will run out\nAnd to me the whole accumulation model is you know it works if you've got multiple millions of dollars but for most people\nIt's not the best way for you to use your money and maybe maybe it is when you're busy maybe it is when you don't have time to focus on your money maybe it's important when you don't care enough about your money but when you realize the power of your capital\nAnd realize that your capital can provide for you right now it's our supplement your income or replace your income\nOr that your capital can generate income for the rest of your life than if you started appreciating the power of the capital then you have to realize what you're doing following the personal finance monitors are really kind of selling your short and particularly if you're a smart person who's made their way with hard work\nIsn't it worth it to learn about how do you take that intelligence how do you take being a smart person\nCouple that with your hard work and applied in the financial markets\nAnd you know with that so we're looking for folks that are willing to learn a new way of thinking about their money there will be comfortable\nAnd significantly are motivated to make a change in her motivated to take control of their income and I recognize there's times in life where you're really busy right you're starting a new career you're starting a family but there's also times in life where you can carve out a couple of hours a week\nOr a couple of hours a month and use that time more productively and if you could do that and do it in a way where you're building income for the future and build a more important building your hope and confidence that you'll be able to generate the income you need for the rest of your life\nThan that as a a good way for the use your time energy and effort\nAnd if you're willing to learn that then we want to meet you\nAnd if you want to start getting the perspective of becoming a dual yourself investor then give yourself a opportunity open yourself up\nYou know specifically how to start treating\nBecome when you do yourself investor then give yourself a opportunity open yourself up\nTo learn about you know specifically how to start treating your capital with respect to how to get out of harm's way\nAnd more importantly how you can start giving some returns that aren't based on the stock market you know the stock market\nIs a high risk adventure normally it's absolutely a high risk venture right now [noise] and\nYou don't have to be there there are alternative place for you to generate income and do it so he can sleep at night and do it so in a safer smarter way than what everybody else is doing and you know and it got to ask yourself of everybody else is doing it\nBoard it did and so you know about Thirteen Years ago you know I was faced with this choice and I didn't know really where to turn to um [noise] uh I Know you know Michael Young is a good friend of mine's ... years together on the trading floor is now a great instructor for online training academy\nI'm he called me up one day so did you ever hear about this company online training as I Know he says well than these seven day classes out in her mind and they claim they can teach you how to a trade electronically and I I I got to be honest with the ... when I heard that initially I was highly skeptical [noise] um\nAbout six months later I became so desperate but you know just\nWas at this crossroads either decided to\nGet on a plane and go to class and um the difference between on online training academy Thirteen Years ago you know versus what it is now there were three [noise]\nWere three locations and I'm a versus the forty plus locations we have now and I did go out there and uh spend seven days a learning how to trade equities sounds um\nGet rejuvenated me and I I learned a little bit about technical analysis and a ban after I came back I just ... immersed myself in that now\nThe interesting thing about it for me was a bad um you know online training academy a version one point oh uh when I walked out of the class there was no online support uh never talk to my instructor again\nAnd it's basically a left there to do it myself a\nCompared to where we are today and all the online programs and all the online classes and all the support the students get and the ability to come back to the class and now instead of having to\nGo up and fly two thousand miles ah you know there are centers within driving distance of most major locations in the country\n... in your class this week you had a student from two thousand ten bright and she'd gotten busy she built a business and now she had an opportunity so she came back to take advantage of her lifetime education\nI Know for me I I I went out to fly to Texas to take my on my training academy class and I said well why don't we bring that back here set of flying all over the\nPlaywright and uh so that that's how I was born and so from that\nMoment on um you know I immersed myself in it and I learned how to adapt to the new way of doing business and thank goodness but I did\nOr I or you know I see something on my and this is no slam on any other vocation at all but I see a lot of people now around town and Chicago than it used to stand in the pit and made thousands and thousands of dollars a month\nNow doing things that are are like selling insurance are working at Wal Mart or [laughter] you know and uh you know I I was able to survive and thrive and and the and I love it I still love trading I still am enthusiastic getting out of the bed every morning and excited\nAnd we're seeing a lot of people that are looking for that purpose and they've had successful businesses they've had a career they're ready to make a transition and all of a sudden they need a place to comments a lot of those folks come online training academy\nYeah and that's the beauty of of this uh experience and the skill set because all it is is learning new skills I tell my students all the time I said yeah you may from thirty thousand feet and may look complicated and this and that it's really not\nAnd uh it's just a matter of learning the skill sets a I couldn't learn what they do for a living very quickly um\nAnd the good news it's you know there's nothing I'm teaching them that none of them you know they all have the capacity to learn there's nothing I deliver that is you know over the top but as far as being able to absorb the simple math and uh just recognizing the opportunities they present themselves\nUh as far as being able to absorb those simple math and uh just recognizing the opportunities they present themselves in the market to based on um a historical price\nWhat's so funny my twelve year old took the course when he was eleven and I said Thomas how was it and he said oh it was great\nAll I have to do is follow the steps but the funny thing was he was in there was a lot of fifty sixty Seventy year old and he said I Can't understand why they can't do it they just have to follow the\nStamps when he took it again this year and he was basically like an ... assistant instructor with another twelve year old that was helping everybody to just implement put into action\nAnd just take advantage of the opportunity yeah\nI think you know the young kids get a\nAnd easier uh not just the the software challenges a which are so great but again it's learning new systems I couldn't go into any business and learn you know the system is very easily but um it's also that\nPeople of a\nR even though the ban stage of age thirty on on up they've been poisoned their whole life they've been taught all the wrong things from Wall street that the\nWall Street somehow managed to convince people they should do things counter to what they do for themselves\nA as consumers in other words\nThey they talk about buying things when they're going up in price and be fearful of buying when they go down now what business could possibly make money doing that and so people yelling at the [noise] yeah exactly and so you know people believe that uh they need to know a lot about a particular company and to buy things when they're going up a that's not what we teach\nAnd let's go back to what you just have a minute or so votes go back to them when I first met in two thousand seven the market was getting to all time highs at the time and that was the beginning of a pullback so what do you see similar today that you saw from two thousand\nI've seen a number of this thing or over the years and then two thousand miles south on on a new recall the sub prime time uh information was out there they're\nUm ah the market is interesting because it doesn't pay attention to certain things until it's done and I'm you know it wasn't until ... or a little while the law that all the sudden\nEverything went into freefall and and so we know of something like this is only going to happen again we we'd be either be re runs a year and I and you're you're a bull market are excellent so at some point we're going to backtrack no one can predict when but it will happen and\nI think it was interesting I had a call last night from students so\nI'm a I hadn't talked and talked and seeing for over a year year and the last thing they said to me it was talking about going on in the mastermind community and which is our highest level of education dish and he said I have to tell you sell you something that most of the ... thing\nI'm pulling out and miss education and the issue is not necessarily how to take advantage of his moves up and down but the risk management skills you said that's worth the weight in gold it's worth every penny up for the education of fire and I couldn't agree with them more because of you know\nWe know to be an effective do yourself investor you need to get educated so called eight seven seven zero eight seven to three seven seven three zero for trade horrendous drama free OJ class dot com that's free okay class dot com\n[noise] and\nHad online training academy our mission is to offer exceptional financial education so you could live the life you've always wanted maybe it's just having that peace of mind so you don't have to worry so much about the bills or even just having the luxury of not working so hard\nTo have more time to spend with the family graduates of online training academy share it with us all kinds of stories here's what one racing graduate had to stay\nHigh bar tended at a casino basically they're open twenty four hours a day seven days a week and so I hadn't had a Christmas often maybe eight years I hadn't seen my mom for Christmas and she abruptly passed away and that's when I you know I knew I needed to do something different I needed I time I needed my life\nAnother student says ... happy and career and try to something that I had always wanted to death and now is that a guy that had to give us a call our ... that changed my life to\nLearn more visitors on line that free O. T. A. clamp down Tom that's free OTC a class dot com [noise]\nIt's not just your life in something that\nA new path onto your children your friends and their kids\nTo the duty herself investors show and Craig give us some pretty valuable by about important submarine making yourself and recognizing when changes upon us\nAnd right now in the market you know changes upon us and we can do nothing and see what happens and we we've seen that happen before and the results for instance\nUs and we can do nothing and see what happens and we we've seen that happen before and the results weren't so good or we can learn how to evaluate opportunities and be able to shift our focus to take advantage of the opportunities presented to us\nYou know the market is always moving and as a do it yourself invest or you know you can allow allow yourself to ride the roller coaster or more importantly you can get yourself out of harm's way and still focus on finding safer and smarter ways to generate income and so\nYou know Craig was involved with the markets for years [noise]\nAnd it's all about you recognizing that you're the one responsible for your future and the you're the one that needs to take the action\nAnd care about the results and stop accepting these mediocre results uh there's never been a better time for you to be managing your own money there's never been a better time for you to be self correcting your future\nAnd breaking free from living paycheck to paycheck and George Foreman told us you know it\nIt's not what age I Want to retire its out what income\nAnd to ... as a do it yourself investor you can have some control over what income you're going to retire at but you need to get educated to our sponsor um on training academy who's making ten seats available to a free half day class or you can learn how to become a dude herself investor\nListeners are calling right now callers five to fourteen row seat free admission to a half day class so you can learn how to become a do yourself investor call eight seven seven three zero for eight seven to three that's eight seven seven three zero for trade wars you register online that free OJ class dot com\nThat's free OJ class dot com call now to claim your seat and you're free half day class\nFor those who attend after class receive a free home study course\nValue that two hundred and forty seven dollars to help you learn the skills to become a do yourself investor eight Seventy seven three zero for eight seven to three calls ... claim your seat in your pre half day class [noise]\nThe preceding program was provided for entertainment and general informational purposes opinions express are those are the presenter ... we make no promises of guarantees of investment performance ... training academy is not a broker dealer certified financial planner or registered investment advisor they all if it were rich WMA awash\nUn cumulus [noise]\nA male news that eleven I'm Heather Curtis thousand Central American migrants are not being deterred by efforts to stop them from coming into us correspondent Patrick ... sat with Mexican authorities prevented them from crossing a bridge from Guatemala into the country they found other ways to get there\nSome cross into Mexico who bought among\nCourse well dressed\nFor thousands of migrants mostly Hondurans said they were fleeing poverty and violence many you're listening to reunite with loved ones\nPresident Trump has said they will be turned back when they reached the border between Mexico and the U.S\nLots of people are not buying Saudi Arabia has claimed that Washington Post columnist ... she died in a fistfight Saudi officials that they're constantly at an Istanbul, Turkey because of genes editor at the post Karen ... weighs in on ABC's This week\nI still believe and ... says this is not an explanation is having to add a cover up\nPresident Trump says he'll meet with the Saudi crown prince soon to talk about the damp\nStudents ... Walter Johnson high school alerted belief took the rats say say their classmate made on Snapchat and now an Eighteen year old is under wraps Montgomery County police St Louis ... posted a picture on social media up in South holding an AR Fifteen but a caption reading school shooter he\nAlso posted that he hates the W. J. and plan to shoot it up he\nWas arrested Thursday and charged with one count ... threat of mass violence ... being held without bond and this skins or at home today buying the Dallas Cowboys at four twenty five boys have the red skins Larry Michael W. I. ALS mornings and the mall\nNeither team as well to strike this year for these two teams left right and and whoever wins this game's going to have a pretty good start the season of the division\nYou can hear all the action right here on WMA now starting with pre game coverage at three twenty five\nPresident Trump says the U.S plans to withdraw from a landmark treaty on nuclear weapons control the geo me chairman and the Senate Foreign Relations Committee Bob Corker told CNN's State of the union that President maybe using rhetoric to bring Russia back into compliance but other arms treaty move to be unwise\nHope we're not moving down to\nAnd then state of the union that President maybe using rhetoric to bring Russia back into compliance but other arms treaty move to be unwise\nHope we're not moving down the path to to undo a much of the nuclear arms control treaties that we put in place but look there's no question Russia's violating\nAt top Russian diplomat said Mr Trump's brand is up her let's move a meteor shower made by Halley's Comet speaking tonight that you probably won't be able to see it\nUnfortunately the moon is about Ninety seven percent full which means that you have this natural source of bright light in the sky which will wash out all but the brightest of the shooting stars\nEnable observatories chap chapter said your best bet is getting a glimpse of the ... meteor shower is to leave the city and go to earlier yeah\nHoward county wants to turn gr unwanted leftovers into landscaping gold the county's expanding compost facility county executive Alan ... by next year thirty thousand homes will be sending food scraps facility to be recycled instead of being thrown in a landfill next traffic him either on ...\nWashington when\nWe can we do find a a level by three or five and six Ofeibea the national keyboard in Texas a nine five they want you\nOne thousand chances every weekday rules that info checkout W. N. A. O. L. dot com remember don't act and dry for K. U. D. name is Margaret and Allison dollars richer\nA el ... a select quote agent with a true story that could save you hundreds of dollars a year a woman named Linda just called her husband re has a three hundred thousand dollar group life insurance policy but it's changing jobs and can't take it with him\nWell I shocked the many highly rated term life insurance companies we represent\nAnd found re who was forty one and takes medication to control his cholesterol a tenure five hundred thousand dollar policy for under twenty seven dollars a month that's almost twice the coverage for less than half of what he had paid if select quota hasn't shop for your life insurance you're probably paying too much\nFor your free quoting called eight hundred for two three forty five fifty seven and eight hundred for two three forty five fifty seven\nEight hundred for two three forty five fifty seven or go to ... dot com and since Nineteen eighty five we shot you save\nGet full details on the example policy of political ... commercials or price could vary depending on your health issues company number five on on\nYour carpets cleaned then you need to go to Joe ... dot com [noise]\nEleven and five one five point nine ... truck and weather here's Michelle Mary in the deep carpet cleaning shopping center\nWe've gotten so don't traffic on Ninety five north bound McCain Pennsylvania Avenue and he's capitals free\nAnd also we have slow traffic Eleanor than three Ninety five between boundary channel drive and the George Washington parkway office and very slow traffic on and off on the south and lanes of Ninety five between Martin headed\nTowards would rich and the office one also be aware of some traction on ... unless spend sixty six of the Fairfax County parkway in the left lane and I'm west south seven between twenty eight and ... Fifteen followed the D. towards their garage to repair dot com is on the weather Channel's forecast\nToday mostly sunny are high and low fifties right now fifty degrees in Washington and Heather Curtis ... six thirty Washington ...\nFollowing program is paid for by sponsors who are solely responsible for its content bused expressed on this program or not the abuse of one oh five point nine ... am six thirty W. M. A. L.\nThis is the underwriters corner with Bill breezy ... by first preference mortgage\nAnd welcome to the underwriters quarter\nIf you're a new listed a two hour show my name is bill ... and I am one of the underwrite as one of the former underwriters over at first preference mortgage every week I Try to let you know everything I've learned about the mortgage abuses in the past thirty five years\nBut the best thing I Do for you is I have invited all of the loan officers of first preference mortgage\nTo come back into the office put away their cell phones for just a couple of minutes\nAnd sit in the office and take your calls I've even given them an eight hundred number\nSo that you can call them from wherever you are listening to me you can call them and and find out more about your situation there eight hundred number is three two one\nFive ... five five how's that for an easy eight hundred number three two one five ... five five they don't want any money from your they don't want to credit card there's no pressure on you\nThree two one five five five five they don't want any money from you or they don't want to credit card there's no pressure on you they here they are under no obligation they they adjust to get you started I promise you no one's going to call you and say well what do you do and\nThey're very busy every one of these loan officers have forty or fifty people they're working with right at the moment [noise] everybody's trying to get in before these interest rates stock to spike and they're going to\nCome November I'm sure these interest rates you you can hear Trump yelling and screaming about the Fed's raising his interest rates but that's going to happen because the economy is so strong\nAnd it's so jittery look at that stock market down eight hundred points one day up five hundred points on the other day\nThe stock market is going crazy and so we're going to the interest rates as long as this economy keeps going strong as it is these rates are going to go up\nCall select vote now no hassle no obligation in minutes you'll have a choice of your best raised from up there ten highly rated life insurance companies\nRichard forty years old takes meant controls cholesterol still so that quote kinda my tenure five hundred thousand dollar policy for under twenty five dollars a month under a dollar a day don't risk your family's security another minute get your frequent now just called\nEight hundred six nine for Penn Penn that eight hundred six nine for ten ten eight hundred six nine for ten ten ...\nGo to select quote dot com since Nineteen eighty five we shop you say you're full details on you have a policy of hotel complex commercials are depending on your health issue and company another factor on all said\nOh you\nTo the underwriters quarter with Bill breezy [noise]\nWelcome back to the underwrite us going\nI Want to talk just a moment about refinancing I think almost everyone knows that these interest rates are starting to move up\nAnd if you have an adjustable loan whether it's on your first mortgage or on your second mortgage this is the time that you're running out of time but this is the time to put the two of them together put your first with your second put it under one loan and get a fixed rate\nAnd is it better for you find out you have all of the loan officers are first preference mortgage in the office I promise you you don't get voicemail just make a quick call and say it loud officer that much I oh this is what my payment is this is what my second mortgages that's an adjustable\nIf I put them together under one lone in a fixed rate but with my payment be what would happen if I went down to a twenty year term instead of a ... only have I been in the house for five years or seven years I have twenty five or twenty three more years to go what if I go down with twenty year alone\nOr if I'd been in the house for maybe eight or nine years\nAnd I have Twenty one or twenty two more years to go what would happen if I go down to a Fifteen year fixed rate what would happen in my payment\nAnd if it's worthwhile to you have your payment stays the same goes down certainly why wouldn't you do that\nI'm telling you you're going to kick yourself and say I shouldn't listen to that guy on the radio I'm telling you\nThis is the time to do it you have them all in the office there eight hundred number is three two one five ... five five they want no money from you know there is no obligation on your part find out if it's worthwhile\nNow the other reasons that you would refinance number one if you look at a poll some cash out and refinance by pulling some cash out\nIf you're a veteran you can go up to a hundred percent of the value of your home [noise]\nSo if your house is worth three hundred thousand and you owe to twenty five you could actually pull out up to Seventy five thousand dollars\nAnd you can you can refinance you take the cash and do anything you want with it home improvement pay off a bill pay off a credit card pay off a hostile alone that you have anything you want to take that trip to the Haiti you've always wanted to take\nA movie a as a veteran you can go up to a hundred percent everyone else is stopped that eighty percent\nSo a lot of people don't refinance and pull cash out and then they wanted to do some home improvement because that eighty percent of the house is worth three hundred thousand but your oath to thirty five well eighty percent of three hundred is to forty they're not going to give you much [noise]\nThere is a program it's called the F ha renovation loan [noise]\nIf you want to do home improvement now it's not to pay off credit cards or take the trip that you've always wanted to take or pay off a car loan that you have it's only to pull out money to do home improvement\nAnd I mean anything new roof new windows new siding put in and the fireplace put it in central air politic put a new kitchen and pull out an old bathroom and put a new bathroom and add a bathroom and a deck on the back of your house or anything you want to do even landscaping I had one lady\nAn old bathroom and put a new bathroom and add a bathroom and a deck on the back of your house or anything you want to do even landscaping I had one lady she had a little two bedroom one bath one story house she cut the roof off while she and her contract to cut the roof off\nAnd she added three bedrooms a bathroom upstairs and a two car garage attached she changed a little two bedroom one bath one story house into a two story five bedroom two bath and a two car garage\nYou can do a large job like that or just a small job maybe you just need new appliances in the kitchen and new carpeting and throughout the house maybe you just need to borrow like ten thousand dollars Fifteen thousand dollars\nA year over the eighty percent what's so great about the F ha renovation loan you have this couple of restrictions you have to use a contractor you can't do the work yourself\nBut if you give me a contractor bed I Will give the contractor bed to the appraiser and say appraiser here's their contract ... they're going to put a brand new kitchen and for Fifteen thousand dollars they're going to put all new carpeting and the house they're going to put a deck off the back and they're going to put a new bathroom and\nHow much is the house is going to be worth when they do all this work [noise]\nNow maybe it doesn't go up to exactly what you're putting into the house but I bet it goes up some new ... new bathroom a deck on the back of new carpeting okay maybe that'll come so forty five thousand dollars maybe the house doesn't go up forty five thousand maybe only goes up twenty or thirty thousand [noise]\nBut here's the beauty of the F ha renovation loan I can go up to a hundred percent of what the house is going to be worth not even what it's worth right now [noise] so you can borrow as much as you want to do as long as you're doing home improvement [noise]\nNow here's the reason I can do that I just don't hand you the forty or fifty thousand dollars and hope you put the new kitchen and on the deck and the carpeting and the bathroom [noise] I put the money in an escrow account [noise]\nYour your contractor has six months to get out there and as he starts to do the work we pay him and draws from the escrow account so we know the work is going to be done or you don't get the money\nBut this allows you to to borrow as much money as you need to what the house is going to be where you can jump over that eighty percent\nIt's called the F ha renovation loan if you want to get more information call the office you have all of the loan officers in there for this hour that I'm here on the show [noise]\nThey're eight hundred number again is three two one five ... five you had them all in there we even have a book on the program\nI wrote this book a few years ago it's written in plain English it has pictures in it it's only about Fifteen pages it tells you all about this loan and how it works it's free\nGet a copy of the book tell the loan officer to throw a book in the mail to ya ya have it in two days\nBut it tells you exactly how this loan words and it's terrific if you're gonna do home improvement and you don't have enough equity in the house that that eighty percent stopped you\nNow you can jump over the eighty percent not only up to a hundred percent like the veteran but you can go up to what it's going to be worth asking you do the home improvement\nYou can put new you could put central air in the house you could put new windows new siding new roof\nFinished the basement finished the attic anything you want to do a small jobs or a very large job I've had people borrow just ten Fifteen twenty thousand dollars by that other people borrow a hundred and eighty thousand dollars and completely redo the house\nOr anything you want to do it's called the F ha renovation loan call the office get a copy of the book but why you have the loan officer on the phone [noise] seeing this was an F. ha loan normally on an F ha loan you have to have a minimum score up six hundred\nBut with this lone you have to have a six forty credit score\nSo ask the loan officer to run your credit make sure your credit score six forty if it's not let's say six twenty eight [noise] they'll tell you what you have to do to get your credit score up twelve points anybody can change their credit by twelve point you just got to know what to do sometimes just paying down a visa\nSo tell them a little bit about your income and they'll tell you what you would be approved for if you wanted to use the F ha renovation loan\nYou have them all in there if you will also like to go to our Web page for our Web pages are name\nFirst preference dot com S. I. R. S. T. preferences P. R. E. F. E. R. E. N. C. first preference dot com the whole book is there on our Web page how'd you get a copy of the book I make great bathroom reading\nBut if you want to go to our Web page the whole book is there also on the Web pages of little mini application it takes about a minute and a half to fill it in its just basic information if you send that and I promise you\nThe Web pages of little mini application it takes about a minute and a half to fill it in its just basic information if you send that and I promise you one of the loan officers will get back to your within hours and if they're too busy I personally will get back to you\nI Want you to be able to be in touch with the loan officer and again there's no obligation on your part there is no cost on your part [noise] find out if this was something that benefits you and I'm telling ya so many people want to do home improvement but don't have enough equity this is the way to do that\nAnother way to go to our Web page if you want to don't want to use our name you can use the number I keep giving out\nYou can go to W. W. W. dot\nEight hundred three two one five five five five dot com and metal throw you into our Web page but I'd like to get a copy of the book called the office they'll throw it in the mail to you have it in two days it's free [laughter]\nIt is a terrific terrific program if you're looking to do home improvement again\nThat's fine just give me the contractor beds I Will put the twenty eight thousand dollars in the escrow account\nYou buy the house just the way it sets\nAnd again I don't care if it's things that you want to do to it or things that it needs maybe the roof is leaking who was gonna give you a loan on a house and the houses in great shape except the roof weeks there's water in the basement\nNobody's gonna give you a loan on a house that the roof leak or there's water in the basement I can as long as you get me a contractor bed saying I'm going to fix the roof of ten grand I'm going to put a French drain in the basement for a thousand dollars\nThat's fine I can settle on that house just the way it's it's just like you're a cash bar where\nAnd I will put that Eighteen thousand dollars in escrow account after you buy the house you have six months to do what you told me you were going to do with this contract to bed at as the contractor starts to do it I pay him and draws from the escrow account\nTo tell you something else even with this lone here let's say you're doing a big job so you're putting a new kitchen or new bathroom and new carpeting and a deck off the back\n[noise] okay that's if you don't want to be in that house while the contractor is ripping out the catcher in the bathroom you want to stay in your apartment until the work is done again you a contractor has six months to get this work done [noise]\nOkay you don't want to have to make two payments the new house and you had your apartment you can even put in this loan the next six months of mortgage payments so that you can stay in your apartment and not have to payments to make\nIt is a terrific program whether you're refinancing and want to do home improvement or out when you're buying a house [laughter] you know what this does for you it opens up a lot more houses that you didn't think you could look at before you know you're somebody who's just barely scraping together the three and a half percent down payment\nOkay you got to sell to pay your closing costs in pre pays you have just enough money for the three and a half percent down payment [laughter] in fact\nThe house is three hundred thousand dollars and so you would need ten thousand five hundred dollars that would be your down payment three and a half percent and you don't even have the ten thousand five hundred all you have is seven grand\nGotta get get letters from a relative mom and dad are going to give you a thousand brother or sister aunt or uncle is going to give you another thousand or five Fifteen hundred dollars so that you can show the loan officer that you're going to have your ten thousand five hundred dollars on this three hundred thousand dollar house so you say bill\nI don't have any more cash to put out but this house needs a new kitchen a new bathroom a new carpeting\nOkay just give me contractor beds I Will put that extra money ten thousand for the kitchen ten thousand for the bathroom eight thousand for the carpet put that extra twenty eight thousand dollars in an escrow account\nYou oh you're still only need the three and a half percent down payment\nAnd then you a contractor has six months to get the work done\nSo now you could look at the house maybe the house that was inherited by these three kids ages need some work that you're going to get a great deal on this house but it and because it needs some work nobody you know it looks like the carpeting is as old as the house it stinks or the kitchen is from Nineteen forty [noise]\nThe kids know that they don't have the money to fix it up they just inherited this house I just want to sell it and and divvy up the proceeds okay that's a house you can look at it now and yes you can make them a lower offer because it needs a new kitchen or new bathroom a new carpeting [noise]\nI'll give you the money for that I'll put it in the escrow account it's called the F ha renovation loan Coley office there eight hundred number again is three two one five five five\nF ha renovation loan Coley office there eight hundred number again is three two one five five five called them up and say hey loan officer throw one of those books in the mail to make their fates free who else gives away free books [noise]\nIt's a small book it has Fifteen pages in it it has pictures tells you just have and that and it's written in very plain English I Want you to get it it's a you know you don't know if you're going to even need this low and you're out there looking at houses and you happen to stumble across the house that you say you know I buy that house if it had central air\nI buy that house yeah I've always wanted a fireplace and this house has a great wall for it but it has no fireplace make the cellar and offer\nAnd give me a contractor base for the central arrow the fireplace or whatever you want to do to this house and I'll put that extra money in an escrow account you buy the house just the way it's it's it's a great program and you know you don't know if you're going to use it until you stumble across the how do you think I buy that house if\nIf it had this or if an ad that\nHe was a way to buy it\nAgain if you want to go to our Web page a Web pages are name first preference dot com F. I. R. S. T. preference P. R. E. F. E. R. E. N. C. and the whole book is there as well but called the office get a copy of the book there eight hundred number three two one five ... five five we'll be right back after a quick break\nWhat would it take for you to get a tattoo you didn't want a million dollars\nHow about a million sucks I'm Randy from bombers when me and my business partner Dave how's it going critter jobs to start a stock company about this we wanted to make the best socks and the history of feet no more knowing theme number falling down your leg added our support the idea\nAnd what's better than creating the best socks and the history of feet sharing them\nThis is what we do one pair purchased equals one pair donated to those in need our dream was always to donate a million pairs we thought it would take ten years that's what they said when we don't need a million pairs of suck I'll get attached to to celebrate but then something happened people loved our socks and instead of ten years and only took two and a half\nA million pairs and one bombers tattoo on my own\nField the most comfortable socks and the history of beat by going to bomb is dot com slash W. N. A. L. and get twenty percent off your first order that will be L. N. B. A. S. dot com slash W and am\nCounting creek windows can lower your utilities improve your country and they need fifty percent Mary Walter here and you've heard me feeling you in on the fact that Thompson creek does it all the design build and didn't sell replacement windows and you will never paid the mailman Mark I'm\nMost window dealers are just brokers ending mark up with no value ... window company is different because they are the manufacture and they sell directly to use the homeowner with no middlemen\nBuying directly from Thompson creek means you get high quality windows of portable pricing and now is the best time to call for a price for for the cold weather sets in\nIts they're incredible fall half on sale might kill windows get one\nFifty percent off last zero interest until may twenty twenty Paul eighth I five fifty seven creek today and ask about their incredible fall have thoughts out the counting creek dot com for details you get more for your money Thompson creek called eighth I did the seven creek today\nBut it'll be screened sores warehouse clearly see that we need more space so we're moving to a bigger warehouses\nMe big savings ones have no interest in until twenty twenty say big on all over the all clear impose audio system all t._v. and fire plays console at all\nOffice section all them theater seating don't miss this one's a lifetime big savings opportunities in the big screen stores\n... warehouse clearing the ban ... locations in Maryland and Virginia we are the\nBig screen door and we are the big screen next first period our prices beef best ally in online\nGuaranteed plus we felt a little more you get taxed for life free delivery there's still a second to none and get this whole and your schedule trusted advisor in top notch service for over Twenty years hundreds of five star reviews prove\nStill why buy anywhere else big dream store\nSo your doctor says you need an MRI granted it's a marvel of science in modern medicine but hardly a convenient are comfortable prospect listen are you going to submit to the discomfort of being run through it to put your foot down put two feet down and experience the most revolutionary way to have an MRI anywhere\nWashington open MRI now has the world's first type field strength up right weight bearing open MRI with lower out of pocket costs for you choose Washington open MRI had one eight six six MRI ASAP that's the one eight six six MRI ASAP\nMegawatt how why lower my Novak electric bill according to the savings tips on no fix dot com you could save up to three hundred dollars per year by using a smart thermostat\nHow do I lowered my Novak electric\nBill according to the savings tips on ... dot com you could save up to three hundred dollars per year by using a smart thermostat\nKeep et cetera sixty eight degrees per heating when you were home and lower as several degrees when you were away\n... have you know I depend on electricity\nBut wait to shake your electric bill go to know that dot com won all five point nine FM and am six thirty W. N. A. L. now back to the underwriters quarters with Bill for easy\n[noise] welcome\nBack to the underwriters Carter just one final thought on the F ha renovation loan or not to things really number one there is a assistant program called the Fannie Mae home style it's the conventional answer to the F ha renovation loan\nAnd what's the difference between the two well with the conventional loan you have to have much better credit your credit score has to be well over seven hundred okay that's number one number two the benefit of the convention alone though is that you can use it on a second home or on an investment property", "year": "2018", "show_name": "The Chris Plante Show", "city": "Washington", "day": "21"}