{"month": "10", "state": "GA", "station": "WABE", "content": "Here's how to pledge\nPledge by calling six seven eight five five three Ninety Ninety or pledge on line at W. A. B. E. dot org\nOr if you value it we need your help we need your support or you make it thrives I really I really just a little bit last line three dimensional a radio you know to make you feel when what a great thing to have what a great thing to have for the community of Atlanta and um you know public radio in general what a great thing to have\nYou know what a fundraiser like this that's why we need your support you know your support pays for this kind of great product\nSix seven eight five five three Ninety Ninety or W. A. B. A. dot org I'm Dave Berry sweet joined by my Johns and we are we need six pledges to go in this hour to stay on track we need you six seven eight five five three Ninety Ninety or W. A. B. E. data words\nWere so close we are so close to to meeting our goal this hour and it's it's it's exhilarating\nUp I really yeah what what are you so hard like you were saying earlier and you know it's so hard to just to piggyback off of what I ... I mean he's like what iris said a is I mean it really says it all but like ... particular to Atlanta we have um\nNot only shows like you know we we bringing this American Life we bring you shows like radio lab and and these really thoughtful are enriching shows but we also each day bring you a\n... our local shows like city lights and closer look with Rose Scott in our own or the work of our own newsroom um and as well our ah our podcasts are buried truths and political breakfast\nAnd one thing that they may not seem obvious at the outset because I mean the entire thing with those shows were pointing microphones of people and amplifying their voices and letting you hear them but\nAh beyond just being a place for people to like you know to to speak very loudly at a lot of people at the same time uh\nWhat NPR does would W. H. B. E. does is it provides a place where we can listen where we can listen to each other and hear each other and I think that that's sort of the crux of where that emotion comes from because I mean the human voices incredibly intimate you know we\nI think I've heard this story before I knew it was coming up I heard it before and I'm Still listening listening listening I mean it was just yeah I'm so glad to have heard you know it was a true voice a from a from a from a jail from a juvenile detention center and it created this you know we we may be say it too often but it\nCreated this bridge of empathy between here and there\nAnd a place that you did not expect to discover on public radio and we got about five pledges we need to stay on track in this hour by the way when we're talking about\nNumbers like a number like six seven eight five five three Ninety Ninety or or W. A. B. A. dot org that's how you pledge six seven eight five five three Ninety Ninety or W. A. D. dead or the individual numbers in the hour are designed for us to to chip away at a an hour's goal\nAnd once we get that our you know will be in a better position in the next hour and the next\nBecause one thing that we're doing with this uh this is the Seventy eighth anniversary of W. H. B. E. and an honors that ah one thing that we're doing during the school was once we've set ourselves the goal seven thousand Seventy people\nWe want to hear from seven thousand Seventy people before the end of the drive Seventy Seventy and once we do we could end the drive so ... so on that thank you so much Judith Wald thank you friend Solomon for bringing has ever closer to the ... flu that goal\nA six seven eight five five three Ninety Ninety have we heard from you that's really the most important thing we we've been reading names and saying thank you but have we thank you have have you given us the opportunity to thank you for your pledge of sport and he wants to read\nYour name six seven eight five five three Ninety Ninety or W. A. B. E. dot org\nFor this our school we are for a way and if we heard from you if you started the process right now here at twelve fifty nine it you will still be included in this hour's tally please help us out six seven eight five five three Ninety Ninety or W. A. B. E. dot org [noise]\nSupport for WABC comes from taste of Atlanta a three day food beer or wine and cocktail experience friday through Sunday October nineteenth route twenty first in historic fourth ward park at laughter restaurants cooking stages live music and more taste of Atlanta dot com\nAnd from the ... museum presenting bearing witness remarkable stories from the Holocaust featuring survivor Helen Weingarten telling her story of resilience admission is complimentary this Sunday at two more agreement dot org\n[noise]\nThis is not the point one W. A. D. E. Atlanta still looking for about three calls to go to stay on track in this hour if you value public radio and all the great things we do and are trying to do and the consistency that you get from listening\nPlease be apart six seven eight five five three Ninety Ninety or W. A. B. any debt or six seven eight five five three Ninety Ninety or W. A. B. E. downward thank you\nLive from NPR News in Culver City California I'm Barbara fine\nFour days after hurricane Michael slammed into the Florida Panhandle cruiser delivering badly needed food and water the storm left at least Fifteen people dead but authorities sphere that number will rise NPRs Amy held reports Michael is claimed victims in Florida where it made landfall at its most powerful\nAs well as in Virginia and Georgia\nCadaver dogs and drones have been assisting search and rescue teams here's Florida State fire marshal Jimmy Neutron is\nEighteen hundred men and women since nine o'clock the night or Wednesday the storm as hips have inspected over twenty five thousand boiling and they're literally physically going door to door and verify and whether or not there's anybody in there that they can help for say\nOver the weekend Reuters reports cruise responding to cries for help in Panama City crow bar through a mobile home freeing a mother and daughter trapped inside emergency officials say they feel that thousands of calls about missing people but with power down and cell service still spotty many may be simply unable to get in touch\nPresident Trump is expected to visit the storm damaged region this week and he held NPR News\nSaudi Arabia stock exchange fell by as much as seven percent\nDuring this first day of the trading week there as a rhetorical tensions with the U.S rise Riyadh says it will respond to any threats after President Trump warned he's severely punished Saudi Arabia over the disappearance and suspected murder of journalists ... if it's approved the Saudi regime was behind it\nThe Saudis are under additional pressure today as Germany France and Britain issue a joint statement\nCalling for a credible investigation to establish what happened to ... and the complete and detailed Saudi response\nIn Sweden the opposition leader tasked with forming a new coalition is giving up leaving the country without a government as Teri Schultz reports it's been more than a month since elections left the traditional parties on the right and the left evenly split\nAnd a far right nationalist party as kingmaker in Sweden\nSweden's moderate party leader of Christmas and says he done everything he can to try to put together a center right government but his failed\nLast month's elections made coalition building extremely tricky sixty two or three hundred and fifty nine parliamentary seats went to the far right anti immigrant Sweden Democrats party\nTwo of the opposition parties partnered with Christ or send the center and liberal parties refused to work with the Sweden Democrats Christians moderates reject teaming up with the former ruling Social Democrats so the process is stuck\nThe speaker of parliament will now offer another politician the chance to try that's likely to be outgoing social democratic prime minister Stephan listening who stayed on as a caretaker prime minister for NPR News I'm Teri Schultz\nThis is NPR News from Culver City California\n... one W. A. B. E. Atlanta we are taking just Ninety seconds to tell you of one thing\nWe know that we can programs mean a lot to our numbers show that we have a lot of tune in over the weekend because we have a lot of great programs throughout the afternoon and we wanted to appeal to you to help us out with a contribution because you've value these programs\nWhy not supported at six Seventy five five three Ninety Ninety or W. A. B. E. dot org and it's not just the weekend programs in the weekly programs it's other things we do inside the community\nOr you might know of some of our community engagement events you might remember the journalist notebook event we held back in September um we're also having an affordable housing um community event\nThat's coming up with a reporter Stephanie ... that's in mid November a lot of things we do for the community which has to say a lot of things we do for you why not help us out you'll to further cause with your contribution at any amount you feel comfortable with\nA lot of people do pledge ten and Fifteen dollars a month\nSustaining membership is best for us it really is the best way to give\nBecause then we know we can count on a reliable stream of income because most donations continue to come in a month to month or until you decide to stop or changing so if you make a donation to W. A. B. C. dot org please join us as a sustaining member that's at six\nSeven eight five five three Ninety Ninety or you can pledge at W.\nGrade a great story right so that when people say coming out I'm like what do you mean like get the damage was but it really gets popularized is is a show you know is in actually in the seventies when Harvey Milk says you've got to come out\nImportantly you've heard\nCome out [noise]\nAnd it was first stopped id are\nOpenly gay member of the school board of supervisors [noise]\nAh but the state is him from Nineteen Seventy eight I was [noise]\nMarking the defeat of props six and ... that were banned gays and lesbians from teaching in schools\nThere [noise]\nMuch tell your immediate family much\nGoing to be they are your people you're\nSo interesting hearing that ... I think when I hear that they didn't have time for that [laughter] [noise]\nWe are in the children are we are indeed everywhere\nEvery every anywhere to do\nHe's right I think he was right about the more we were up front about who we were the more it would\nShake up the misconceptions and to start on the personal level with family and friends and coworkers that had to start to break down some of the stereotypes about you know six sinful crazy kind of stuff that was very much attached to gay people still and so you know\nTen years after that speech we see the ... the first coming out day this is October eleventh Nineteen eighty eight or what has changed in those ten years and what has made coming out they become formalized by that [laughter] [noise]\nYeah well that's a ... a lot uh [laughter]\nI'm wanting courses that he's murdered shortly after giving that speech and um that probably encouraged even more people to stand up and say ha yeah I'm gay and lesbian um the other thing is that in the national movement\nStarted [noise]\n\nBy Nineteen eighty seven when there's the second national march on Washington [noise]\nThere's an actual game I've been writing for gay and lesbian micro an actual combat action\nThat that people engaging thousands of gay and lesbian activists march past the White House today demanding protection from discrimination and calling for more federal money for AIDS research\nMost miles I mean it was a huge march the official figure recorded by CBS News the day after the event six hundred and eighty thousand people a figure was greater than Martin Luther king's famous march for civil rights back in Nineteen sixty so largest gay rights march\nHow was it was great it was it was so much fun and that's when my brother and sister in law came down and he joined in now is terrific [noise]\nIn Nineteen eighty eight coming out got its own day\nOctober eleventh in March the one year anniversary of that big march march he says it was born out of intense activism by the algae to community over the AIDS crisis and the government and different to that crisis so in different that President\nRonald Reagan didn't even say the word aids in public until September Nineteen eighty five that was a few years after the federal government first acknowledge that disease\nThere was a hard time to be gay and a hard time to come out but not quite ten years later America would witness maybe the biggest coming out story it had seen ...\n[noise] [noise] are you [noise]\nWhen you're coming [noise]\n\nComing out in Nineteen Ninety seven ... James and then plus more with professor Marci Gallo after break I'm Sam Sanders you're listening to it's been a minute for NPR\nAndrew listening to it's been a minute on Ninety point one W. A. B. E. Atlanta if you appreciate\nThis ... nearly a brand new program with Sam Sanders a we invest in a lot of programs and some of them like we just heard this American Life\nOur main stays with public radio but some of them are brand new and emerging and they need and deserve your support and want to make a contribution to fund the show and every great thing you hear a Ninety One just call us at six seven eight five three Ninety Ninety\nBasic membership starts and just five dollars a month or sixty\nDollars a year you can also make your contribution online or on your smartphone W. A. B. E. dot org thank you\nSupport for WABC comes from flat iron school a coating boot camp with a curriculum and career support designed to help students get jobs once they graduate applications for flat aren't Smithtown campus or now open more at flat iron school dot com\nSupport for NPR comes from this station and from the NPR One club everyone comes with a story including NPR inspired bottles like weekend edition cabernet available to adults Twenty one years or older learn more at NPR wine club dot org\n[noise] from the corporation for public broadcasting and the state of Joan crock who's ... serves as an enduring investment in the future of public radio\nAnd from the William T grad foundation at WTC grant foundation dot org\n\nWe are back you're listening to it's been a minute for NPR I'm Sam Sanders\n[noise] this week we're talking about national coming out this past Thursday October eleventh we're looking at some big moment in coming out history ... coming out stories from listeners I've been talking to Marcy Gallo she's a professor at University of\nNevada Las Vegas just talking to me through the history of coming out and you can't really talk about that history without talking about this one big moment\nYeah it was a big deal uh she took a big big big risk and we'll her a lot\nThat's Marcy discussing Ellen in Nineteen Ninety seven on her ABC sitcoms\nYou kinda [noise]\n\nBut you're going to come\n[noise]\nI remember this year I was like Thirteen ... and I remember I don't think my parents told me not to watch but I knew that I shouldn't watch lab that make that ... and I and I probably thought later or not to to see it but I remember how they're given\nIt was for this woman to come out on her prime time TV show to her therapist who was at that time played by Oprah [laughter] oh God I remember that old I remember right\nRight exactly and it's not like I'm looking for perfection you know I just I just want somebody special somebody you know that I I click with and obviously you didn't\nClick with Richard has there ever been any one use cells Euclid was\nSimple it was his name scissors [noise]\nThey both have the younger much [laughter]\nI don't know I as I thought if I just ignored it and I'll just go away and I can just live a normal life\nAnd what is a normal life Ellen no normal\nI mean just the same thing everybody wants to my house and picket fence you know a donned the cat Sunday barbecues someone to love someone loves me when I can build a life with just I just want to be happy and you think you can't have these things with a woman\nWell society has a pretty big problem with it you know there are a lot of people out there I think people like me are sick\nSo I mean coming out it's been a thing at this point for a few decades and run the backlash that she face was pretty it can last a show all these conservative groups urged companies to not buy\nAds on the show ABC actually put an adult content warning on episodes of Alan that showed a woman kissing a woman [noise]\nThere was even coverage that if you listen back to you from NPR that I find it hard to imagine area and I'm so in April in Nineteen Ninety seven [noise]\nThe afternoon before that episode aired of Alan a Robert Knight who was then the head of the family Research Council he talked to NPR about this and you just got to hear\nSo you see there is an agenda here to normalize homosexuality all the good characters are upbeat you know free spirits wonderful people of course a lot of gay people are like that but not all of them and and yet it it seems to me that they are doing their best present homosexuality or something desirable normal something you ought to try kids\nOr you don't have to worry about any morality since we've decided there is no right and wrong in this issue\nOf the only right thing to do is embrace it normalize it and anyone who says otherwise is a terrible bigger\nWow wow [noise] it's so funny he says there's an agenda here to normalize homosexuality it's like yeah yeah yeah there is a partner\nAnd I don't know how it happened but I put on Brokeback Mountain when it was like happening while and I was like I'm going to hear from her and I'll never forget she watched the whole movie\nHouse I might ... the movie and I look over she is co Ryan ... and I look at her and I was like what's the matter in this Pentecostal church organist like so saved looks men says and through tears like choking back\nWell I just don't get why those who can't be together ... uh so strange it was so strange anyway ... people contain multitudes even church absolutely\nHearing Patrick gel his story thinking about my own story it made me wonder why the idea of some grant coming out as always felt to me at least like a thing that's just for white people\nEspecially given what we heard from Dr Marcy Gallo earlier how the gay rights movement really grew out of the civil rights struggle of people of color and this post World war two activism also led by people of color\nGiven those roots why it's coming out felt so white\nTo speak to that question you have to go back to slavery\nWhen you think about black women being raped and made to bear their masters children or having their own children taken away from them or a black man being lynched or\nA limb being cut off for just a suspicion of looking at a white woman\nYou have the ingredients for some pretty messed up psychological and emotional trauma around once body where your sexuality\nIn particular is always under surveillance or doesn't even belong to you yeah\nWell and and and like that could lead to obviously black people feeling as if their sexuality and owning their sexuality isn't really there on\nExactly so if you think about coming out of slavery into post reconstruction there was a a movement among the black middle class in particular to counter the images of black people as savages as\nThere was an adoption of Victorian mores and values\nBut what that meant was adopting what is now known in in mostly academic circles as the politics of black respectability\nWhere a women for instance with you know wear gloves and long dresses and um there was a whole sense of propriety a gambling and drinking and those kinds of things were just about [noise] uh\nI mean is still like yes that that always gives me pause is like black people consume cleaning products writ large more than other demo yeah because you want to make sure that you look and smell and feel clean to the wife of all of that you know as\nIf you think about the historical context is about you know making sure you present yourself in a respectable way [noise]\nThat would eat Patrick Johnson he's chair of the African American studies department at Northwestern university [noise] more of our conversation after a brand new black men and being on quote the down [noise] was coming out story from a transgender listen [noise] I'm Sam Sanders you're listening to it's been in the hour we'll be right back\nAnd you're listening to it's been a minute with Sam Sanders on member supported nutty point one W. A. B. E. Atlanta if you value W. A. B. E. we are asking that you become a member because it is our full\nMembership drive you can do on line or with your smartphone at WABC data word or call six seven eight five three Ninety Ninety another great day to day partly cloudy Hines at Seventy eight an overnight down to fifty nine degrees this evening\nSupport for WABC comes from Dr roof serving Atlanta for Thirty years Dr roof offers roof installation roof repairs siding windows ... almost everything you hold dear as under your roof when you're home needs a house call Dr roof\nAnd from Atlanta history center presenting the CIA obesity private wealth management author series Pulitzer Prize winning author Joseph Ellis discuss was American dialogue the founders and us on October twenty third at eight PM Atlanta history center dot com\nSupport for NPR comes from this station and from life lock life luck with Norton works to help protect identities and the information on devices from cyber criminals learn more at life lock dot com from the corporation\nFor public broadcasting and the state of Joan crock who's requests serves as an enduring investment in the future of public radio\nAnd from American Jewish World Service working together for more than Thirty years to build more just an equitable world learn more at age eight W. S. dot ORG\nYou're listening to it's been a minute from NPR's Sam Sanders [noise] this past Thursday October eleventh was dirty national coming out day [noise] mark that day we are exploring coming out [noise] that was never just one day\nAnd how it's different for different people born in in this next segment you'll hear a gay slur I've been talking with e Patrick Johnson you the head of the African American studies department at Northwestern university and he told me how coming out can change when you're from a marginalized background\nI'm Talking about black people brown people and there's people whoever\nWhere you live a gay life\nBut you don't talk about it and maybe there isn't a coming out day where you tell everyone hopes no and and and like other folks don't [laughter] this feels to me to be a thing but it's much more of a thing for gay people who are not white Americans and\nYes yeah and yeah and if you are already hailed as and you fill in the blank in terms of ... a a a black person I'd like to next person an Asian person\nAnd that brings with it a whole set of responses to who you are as a person and so you in some ways don't have any choice but to\nLive with that because you you can hide it and I especially feel that way I'm for\nAfrican Americans in particular because of the connection to the church [laughter] you couldn't go to any black church in the United states and not find\nA gay man ... a whole ... of them\nYes um and it's a complicated place because I grew up in the church and the church is actually where I feel I came into my own\nOr work I mean like I felt safe there like as a young black boy in the church was the one place I knew I wasn't going to be made fun of correct but it was also the one place where I knew that I might hear the word faggot over the pulpit mhm there was this weird dichotomy but I always felt in this weird way safe there\nYeah I mean the church is where I was encouraged to um express myself which you know I was a big old clean love 'em and and the choir stand a singing soprano the only way over the Sopranos section\nI'm sure they ended up I'm sure they loved it they should be in that yet at the same time the pastor was talking about gay folks going to hell in God gave you age because you've sent yet ... not\nIn my church that I thought okay [laughter] but many charges were doing many a\nAbsolute and still do and still do and so yeah it it's a really a constant [laughter] right yeah no but that that's part of the other thing but also you know we also had the whole down low\nPhenomena and also we should stop to define with the downloads for those who might not know\nYes so men who are on the down low are men who sleep with men but who do not attend to fight as gay\nAnd they're usually black they only allowed to yell for men other than black men\nYes I'm even though that's not true [laughter]\nWell I mean like ... for like white men but they were living another life you know the lead a double life yeah\nWhy does it say about what coming out has become where you move from Harvey Milk in the seventies coming out day in the eighties to acceptance for folks like Alan by the nineties yet at the same time the subset of the community black man they're still being labeled with this term deal\nSo at the same time that yes there was a part of the community that we're not being open there was another part that was actually being very open in the seventies in particular there were a radical\nOf of black in Latin next lesbians were open and pushing things forward in ... and it was that we are pushing back against the second wave feminist movement was white straight middle class women\nAnd these black can lead to next lesbians like hello I'm we're here as well and so people like Audrey lowered a serene erotica Gloria and so do uh I could go on and on and all these black lesbians yeah and like lesbians\nSo it's a complicated history is not just that black folk sort of disavow coming out of being open about their sexuality or in total some make that decision but then there was a whole other set who made another choice", "show_name": "It's Been a Minute", "year": "2018", "city": "Atlanta", "day": "14"}