{"month": "10", "state": "PA", "station": "WVYA", "content": "W ... Ninety One point five FM streaming live a W. B. A. dot org where ... ... ... three any Bethlehem at what five point seven members supporting public radio W. V. I.\nWTO eighty eight point three of them and at like wall and pop back W. P. A. U. Ninety One point five FM streaming live at W. B. A. dot org we're in Allentown in Ninety nine point three and in Bethlehem at what a five point seven member supportive public radio W. V. I. S.\n\nEvery hour of every day the programming you've come to expect on WB I is paid for through the financial supportive listeners like you think so much for your membership learn more about membership and sign up today at W. V. I. A. dot org\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. ...\nUnacceptable nope no one is going to defend\nActivity of amid uproar\nOver their parents killing of a Saudi journalist Michael ... says the U.S will reserve judgment until investigations are done for Wednesday October Seventeen fits all things considered and\nI'm Mary Louise Kelly and I'm Ari Shapiro has this hour the latest from Istanbul which I'm all for show was last seen also our colleague Tom Bowman reports from school and the Syrian city of Raqqa\nThe children had been so traumatized they couldn't even recognize number the letter that we had to work through that before we could actually start educating them\nAnd the rocks really old rocks ought to be the oldest evidence of life on earth turns out maybe they're not fossils after all that kind of look like whoa we're on bars they're stretched out bridges that extend deeply into the rock after the news\n\nLife from NPR News in Washington I'm Lakshmi Singh President Trump is warning against rushing to judgment in a case surrounding Jamal ... disappearance cause show was last seen weeks ago walking into a Saturday consulate in Istanbul but never walking out\nThe Washington Post columnist you with us resident was critical of Saudi crown prince Mohammed bin Salman Turkish authorities think he was tortured and killed by Saudi hit men which the kingdom to night NPR's Mara Liasson reports it for now President Trump seems to be giving the Saudi royal family the benefit of the doubt\nThe president said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nIs that given caboodle would that being said Saudi Arabia is in a very important ally of ours in the middle east\nThe president also said he thinks audio tapes of what could be ... torture and dismembered meant at the hands of Saudi Government officials probably exist and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House the death toll from a mass\nShooting at a vocational college in Crimea is now up to Nineteen and Russian investigators on the scene scene Eighteen year old student was the gunman they say the assailant open fire at the college encourage before he took his own life more than forty people were wounded officials say they're no longer characterizing the attack as an act of terrorism\nIt has been another difficult day for residents in those states batter by hurricane acclaimed at least twenty nine lives and left dozens of people on accounted for\nMichael made landfall with one hundred and fifty five mile per hour winds on Florida's panhandle last week residents in parts of the panhandle are still waiting for power and cell phone service to return NPR's Hansi Lo Wang reports some rural communities are just starting to receive help FEMA has been sending\nStill waiting for power and cell phone service to return NPR's Hansi Lo Wang reports some rural communities are just starting to receive help\nFEMA has been sending teams of search and rescue specialist like Adam sheets of Virginia task force one in Jackson County sheets them multiple trailers damage from the storm on the same property where a brick house still stands\nWas all families and their own at home or a third of all of them are okay in order to get assistance from medically they have some medical issues\nHundreds of families are still sheltering in school buildings around the region as you along NPR News Jackson County Florida and\nAs it figuring out a way to rebuild from the storm were not difficult enough survivor's all they have to guard against losers\nThe Panama City needs herrell close to bay county sheriff's office saying officers have been arresting roughly ten people every night on suspicion of stealing from homes and businesses that are still without electricity some areas of ... county or putting looters on notice with spray painted signs that read losers will be shot [noise]\nBefore the clothes the Dow is down Ninety One points at twenty five thousand seven hundred six this is NPR\nSupport for NPR comes from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nGood afternoon I'm policies are for W. V. on a news Pennsylvania's about a change its standards for high school graduation but the change won't be as traumatic as initially laid out years ago W. V. ice Ali movement Aaron gives us the backstory\nThe push to change the graduation requirement started with this argument\nThere are Pennsylvania students graduating or simply not prepared and not ready for that next phase in their life\nThat's why many including Alex helper of the Pennsylvania chamber of business and industry asked for reforms\nAlmost a decade ago the state passed a law that would have required students to pass a trio of tests known as the Keystone exams if not they have to take remedial classes and pass in alternative quote unquote project based exam\nBut lawmakers kept delaying the implementation of that law Stephen to more of excellent schools PA points to a couple of reasons for that\nI think you are a parent in the suburbs are complaining about over testing of their children you know they held or she got clinical sway\nHe says policymakers also realize that tens of thousands maybe hundreds of thousands of students weren't going to pass these exams so Pennsylvania pivoted\nStudents can still qualify for a diploma bypassing the three Keystone exams but now there are a bunch of other options including industry certification college except ... full time job offer and more\nBoth houses overwhelmingly approved the changes and governor Tom Wolfe has said he'll sign the measure\nBig picture this means students will have to clear some sort of extra hurdle before getting their diplomas but that hurt or might not necessarily be a standardized test\nThat was all the ... ... ... reporting for W. V. I. A. news in our regional whether we'll see a freeze warning in effect for our listening area from midnight tonight until ten am on Thursday for tonight it'll be partly cloudy with lower and lower thirties\nThursday looks mostly sunny with highs and the upper forties and Thursday night looks mostly clear and cold was lows in the lower thirties I'm Paul is our for W. V. I'm like a news\nSupporting W. V. I. A. F. N. C. bank offering solutions to grow your business F. M. C. be simply a better business back member FDIC equal housing lender this is all things\nConsidered from NPR News I'm Mary Louise Kelly and I'm Ari Shapiro the U.S turkey and Saudi Arabia or each maneuvering as more information comes out about the disappearance of Saudi journalist here's what happened today\nShapiro the U.S turkey and Saudi Arabia or each maneuvering as more information comes out about the disappearance of Saudi journalist here's what happened today Turkey's foreign minister said he wants more cooperation from Saudi Arabia\nUs secretary of state Mike Pompeo met with Turkey's president and said the Saudis are committed to a full transparent investigation pump hair was in Saudi Arabia yesterday\nAlmost daily leaks from the Turkish government strongly indicate the Jamal ... was murdered NPR's Peter Kenyon joins us now from Istanbul Hi Peter hey Ari tell us what's been happening stay with palm pilots visit to turkey just today after he was in Saudi Arabia\nRight well this was billed as a fact finding mission and the Turks seemed pleased that Washington is showing not just an involvement here but support for Turkey's investigation\nOr there was a delay in searching the consul general's residence that Saudi consul general's residence er and that's what caused the foreign minister to say we need some more cooperation here but that surge then did begin today\nA Pompeo told reporters that the administration is not going to get ahead of the investigations and draw conclusions but he denied the U.S would downplay or gloss over the killing of a journalist if that's what happened here's what he said\nI'm not I'm not going to speculate that obviously if someone\nCan gauge as an activity that is a lawful [noise]\nNo no one is going to defend\nBut at the same time make clear that the Turks should be mindful of the many important partnerships that bind to us in Saudi Arabia and Donald Trump is said much the same thing\nThat would have been some new details coming out today about what happened in that conflict and we should warn listeners that some of these details are graphic tell us what this investigation has revealed\nTurkish and Saudi investigators did enter the consul general's residence today with Saudi permission continuing their search of Saudi diplomatic buildings and property a the constantly building was surge Monday and apparently evidence was found pointing to a killing their at least according to the sushi ate at breast\nTurkish authorities have also said they intend to search Saudi diplomatic vehicles but to get to your point of pro government newspaper has published very graphic details of the torture and killing allegedly of Mr ... including him having his fingers cut off before he was killed\nAnd forensics expert putting on music to drown out the sound of the dismembered him into the body\nAre now it's not clear how long are the Turkish investigation or the Saudi internal investigation for that matter will go on a secretary of state bump a oh today said we should give them a handful of days to get this over with sooner is better than later he said\nAnd thank you for your support for W. V. I. A.\nSupporting ... the pine senior living in a large sum of providing solutions for seniors wishing to remain independent but eating some assistance with daily living the pines locally owned managed by its hands on care focused on the need the beach resident applied to collect some a dot com or our family cares\nFor you or it's taking a look now at the forecast will see a freeze warning in effect for our listening area for midnight tonight until ten am on Thursday for tonight or be partly cloudy and cold with lower and lower thirties will also see wind gusts up to thirty miles an hour it will be mostly sunny on Thursday with highs and the upper forties\nThursday night looks mostly clear with Lowes in the lower thirties friday we'll see sunny skies with high in the mid fifties and friday night looks mostly cloudy along with the fifty percent chance of rain with lower and lower forties\nThis is W. V. I. F. M.\nSupport for NPR comes from the station and from Hitchcock's\nInsurance providing customized insurance for small and medium businesses so they can do more and be more learned more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learn more at the three ...\nThat a guy and from Americans for the arts\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly now to Syria for a look at a U.S back to school for children traumatized by war and by ISIS the program is in danger it might not survive the Trump administration's cuts in aid for Syria\nAnd it could come down to donations from other countries or private individuals to keep it going NPR's Tom Bowman visited the school and spoke with the children while he was traveling with the U.S military in the Syrian city of rock\nUnderneath the skinny boys says he's twelve years younger people into a crayon drawing he created this summer when he arrived at this childcare center is mostly colored and black there's attack an aircraft accrued figure of them in with a wispy beard holding an oversized gun\nAnd make more than I Am now my sister and me were killed just like that to missiles\nAnd then I shall now my sister in the ... just like that to myself\nThis is a red telling a flame rising from the roof of his home\nIn may in fact when the House's Head smokers that like this\nThere does have known for decades a primary where young children communicate comprehend trauma is by drawing pictures\nIf that is true these drawings in the wall or one collective scream there were a childish scrolls of beheadings corpses planes dropping bombs one small boy gestures to the picture he made his eyes or pinched by burns\nThe school and others like it is designed to ease the kids back into something like a normal life\nEverything some art music just for\nThe new holders the state department official who helped oversee the childcare centers in northeast Syria an area controlled by U.S forces in its Kurdish and Arab allies\nWe found is that the children had been so traumatized they couldn't even recognize number than letter that we had to work through that before we could actually start educating\nThe school's outer walls are paid to with colorful toy beers in balloons it's it's just a block or two from piles of rubble and skeletons of buildings destroyed by ISIS booby traps in American airstrikes\nThere are about five hundred kids here with space for hundreds more we're not it didn't find any of the Syrians for security reasons [noise]\nSyrian teacher instructor small classroom just seven boys and girls who never went to school during the years of war she says the children were afraid to be inside any building or even on the roads\nThey just didn't feel safe because of the bombings and destruction they witnessed asking\nIs that ... the\nActor first they were still carrying memories of the war and they have lots of people close to them some have lost their fathers some had lost their parents\nShe points the two girls in the back of the room one steers blankly at the floor thumbing the pages in her book the other covers her face with their hands peering through a Web of fingers at the visitors in the room\nAnd get a lot having ... they had an obvious case at social isolation\nIn the beginning she says they didn't talk to anyone at all\nYou have the Manhattan thankfully\nThey've recovered they've adapted to a new place added that to your friends\nOne boy in the class lost both his legs and sits in a wheelchair another is Thirteen and lost his left hand that get anything he into other children were playing with a bomb when it exploded that killed both his friends\nDeanie holder says the schools like this in the area hoping these kids are part of a program that costs about Thirteen million dollars in us funds put the money will run out and just four months\nAre working very hard for the international community to explain his hand that many different ways that they could be involved in the education sector\nPresident Trump cut two hundred million dollars in a what impact that they have in Europe\nFor a part of the education any money was tied up in the money that was so instead of having a full year coming up on our basically in finding at the end of January\nHolder said there's hope from other countries who are kicking in aid money the United Arab Emirates gay fifty million dollars but prefers the money is spent on projects like water and electricity Saudi Arabia is providing a hundred million dollars but it's uncertain whether it can be used for the schools\nPrivate donations officials say can also help fill the gap for one and a half million dollars holder says she can renovate one hundred schools for about five million dollars the care centers could continue for another\nAbout five million dollars here as soon as I could continue for another year [noise]\nWhatever the fate of the schools are signs of hope girls in red and white uniforms perform a dance routine on stage\nThe boy who lost his hand in it or ... chose a picture he just drew in his notebooks\nBouquet of flowers and that boy who's black crayons pictured an ISIS fighter and the burning home the family left to flee to Lebanon that one of the new and more vibrant drawing of his home\nAnd then then\nI'm happy I drew that interest me the ... only ... are ... and now we have a happy\nHe draws the host and bold and bright colors\nAll yellow orange blue and red Tom Bowman NPR News Rocco Syria [noise]\nCouple of years ago scientists announced that they had found the oldest evidence of life and rocks that are three point seven billion years old separate group of researchers found that hard to believe they think that the rocks might just be old rocks NPR's Nell Greenfieldboyce reports\nWhen and how life emerged on our planet is a mystery but some fossils are incredibly old\nThe most widely agreed upon evidence for the earliest fossil life on earth is found out in Western Australia\nJoel Horowitz is a geo chemist at Stony Brook University in New York he says the rocks in Australia date back about three and a half billion years they contain cone shaped structures created by masses of microbes growing up from the floor\nWe're actually seeing sort of the total community that has basically been turned into a bunch of minerals\nBack in twenty sixteen researchers revealed they'd found similar mineral structures in Greenland that was a real shocker because the rocks in Greenland where even more ancient two hundred million years older and they've been more cooked and tortured by geologic processes\nThat should have destroyed any signs of life you know my thought was boy someone should follow up on that [laughter]\nHer ... and some colleagues did follow up and now in the journal nature they say there is no way these things are fossils a deeper look into the rock shows that the structures are really shaped like the cones that microbes would make\nInstead what they look like our for lack of a better word that kind of look like tow behind bars they're stretched out ridges that extend deeply into the rock\nThe scientists also studied the rocks chemical composition Abigail all would an astrobiologist\nAt NASA's Jet propulsion lab she says they use the proto type of an instrument that NASA is planning to send to Mars to look for signs of ancient life she says the chemistry of the Greenland rocks did not support the idea that microbes had left their mark\nIt planning and it's all good morning from may happen in the\n... main such a lock on on\nShe says if life could have gained a foothold so soon after the earth formed that would have suggested that life can arise and take hold quickly anywhere it's given half a chance\nNow the researchers who made the original claim about the Greenland rocks are vigorously disputing this new analysis they still maintain that they have found the world's oldest fossils so\nFar relatively few scientists have studied these rocks that means it's a pretty sure bet that this won't be the last word Nell Greenfieldboyce NPR News [noise]\nAnd you're listening to NPR News\nNell Greenfieldboyce NPR News [noise]\nAnd you're listening to NPR News support them from customs container solutions a manufacturer of customers standard roll off front and we're dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com\nA hundred and Fifteen billion while and parish rats are hurting and reporting from Brussels thank you sir oh You're welcome Mary Louise\nSo what would a hard Brexit means for the British and European economies and for the U.S George Parker has written about this she's a political editor at the Financial Times joining us from Brussels where he is following those negotiations welcome back to the program polar if there were to be no deal at all what immediate changes would take effect on march twenty nine when the u._k. leaves you\nWill that could be caught ... kind of no deal we actually end up with if it was a totally chaotic an acrimonious no deal where\nEverybody ended up throwing places with each other in person left to you in very but don't you and indeed than you could see some very serious impacts of the border so you would have a ... you'd have checks on all groups coming in and also the case we're supposed to talk of the moment that will quickly to choose choose the pools coming into person I'm very quickly\nSome old goods coming in and also the u._k. which doesn't happen at the moment that will quickly to she's accused of the ports coming into person and very quickly the companies in person which rely on seamless flow of goods across the borders in Europe they would run out parts factories were closed down\nOn the bank of England is focused this could be actually a very tail second damaging EPA say for the British Academy which could last for months there's all sorts of contingency planning guy on the u._k. in case it happens talk of stockpiling of medicines\nFairs the fresh food wrote could run out very quickly there are ways you could try to mitigate the effects of that by having some sort of informal agreements but nevertheless if there's no deal a tool it will be quite bad and the pursuit calling me we'll take a very big ...\nSo you're saying that in the worst case scenario there is a lack of food on the shelves the lack of medicines and pharmacies\nYeah I mean there's been some talk of stockpiling some certain types of medicines\nOnce you ... for the checks the place where there are ... for the moment you can have she's running for miles and miles and miles twenty thirty mile cues things just wouldn't be coming through so so there are concerns that they will be shortages certainly in more distant from the port so\nPretty serious sets us in our series of being considered by ministers\nWhen you look at the longer term economic impact what's the best than people have of what the effect would be\nWell the treasury UK treasury has made an estimate of what was happening in the medium term if Britain was to leave without a deal and that would basically once the initial shock it cost you would end up with just a lot more bureaucracy in red type ... and that without to business costs\nYou will make it ... percent or less attractive place to invest because if you have less access to the European market the potential for terrorists as well so the Treasury's estimated that within about Fifteen Years UK economy would be about eight percent smaller than I otherwise would have been the case which is a pretty big\nHits and spit out into sort of an aircraft crunchy losing height you wouldn't necessarily know to immediately but over time person will be a poor place and otherwise it would be\nSo if those are the potential consequences for the u._k. what about for the rest of Europe if UK leaves with how to deal\nWith for the rest of your this has always been something that you're skeptics in person of clung to the idea that Europe wouldn't allow such a scenario to play out because a person as a major destination for European ... say they will be an effect on all manner of European produces whether some and they won produces in France cop she says in Germany\nUm you name it they will they will be effective because you pay off the breaks it will become the biggest single export destinations for all the all the European Union countries but the point is is an asymmetric shock waltz it's true that the other European countries would suffer as a result of new deal the biggest losers will be the u._k.\nThe Brexit vote was more than two years ago and here we are less than six months from the deadline and does the idea of going crashing out without a deal now seem almost inevitable or this is sort of thing where you're only going to get a deal when you're pushing right up against it\n[noise] I think it's more of a lesson to be honest I I mean we all question why yes I think the wire will be really just before Christmas this year so there's another couple of months ago the differences between the two sides are not really as big as they are often presented a by the politicians\nThere was another potential problem which is that if the reason why the British prime minister does a deal in Brussels she then has to sell it to have very divided policy back in London and I think actually negotiating a deal inside the British Government could actually be the positive then negotiating a deal with our European partners so\nAnything could happen but I think my ... still despite all the negative noises around is that common sense will prevail and that will be a deal at the end of the day\nGeorge Parker is a political editor of the Financial Times thanks for joining us as always a pleasure peas\nAnd there will be a deal at the end of the day George Parker is a political editor of the Financial Times thanks for joining us as always pleasure\nMm Mm Mm [noise] [noise]\nYou're listening to all things considered from NPR News\nWhen most people make a mistake they say\nI'm Sorry but what should accompany do when it makes a mistake a recent study looked at the economics of apologies Stacey Vanek Smith host of the podcast the indicator from Planet Money spoke with Benjamin whoa he's an economics professor at Vassar about why saying sorry is not as easy as it might seem\nYou know it's like really really interesting study at the way to study apologies\nSo the study was partnered with Hoover we look we focus on the Ninety five percent pile of late and that's the most extreme ... late ... there's about a five percent chance that you never come back to where again\nAnd the question is how can we repair this relationship how can repair said the trust between Wilbur and its broader we tested different kinds of apologies and we found the right kind of apology could basically increase revenues that went to two percent\nBut the wrong kind of apology could decreased revenue so I went to two percent which we accepted apologies in of all sort of commitments to do better or or not what we saw is that a commitment to do better in the future it's it doesn't seem to matter much right away but we track these writers for three months after the apology and we found that basically two or three months later these commitments to do better in the future\nActually backfired against the company\nI'm In part because you might commit to do but in the future and then the miners who didn't do better because then maybe maybe for some of them had another bad experience and I as a result those those people punished but more than than the control group that got no apology at all\nDid they ever have a good effect I'm\nNot in our data so [laughter]\nI think they they they they temporarily had a good effect right but I think there's this idea that once you've apologized we're going to hold you to hire a higher standard and sort of by the end of the three months three months of observation it seemed like they either had no effect or or or a negative effect\nIt interesting that we expect remorse from a company like it's like minimizing human interaction yet still seems like we don't want the same level of trust and accountability\nI think part of it is that our brains when it works on script singer aesthetics and so you know when we enter in a relationship with a company we sort of like the same sort of scripted risks triggering our brain and so because we expect remorse in real life we sort of expect it from a company\nSo what what are the what would the apologies that really worked for ... like what was the magic\nThe magic was money [laughter]\nYeah um show me the money basically yeah yeah yeah um\nThat we tested apologies with or without a coupon and we we which and we found basically the most effective apology the ones who sort of increased revenues was uh just with a five dollar coupon\nWithin just money or with their certain language that people responded well to\nSo we were we were hoping to figure out the the best language but we found that there is no difference between the different language to his money it seemed to be just money and in fact the message that she might may have backfired a bit what the message that sort of committed to be more in the future\nDo you think that's like carries over into personal relationships so sorry that I like whatever was late meeting for ten bucks [laughter]\nYou know here's a box of chocolates right or here's your ears and flowers and flowers and candy to\nTake on a whole new significance um does it hasn't changed the way like you apologize\n[laughter] I mean people don't always wanted to ask you this question they do I was curious I think the main way change that because all my friends and my family know that I study apologies than they would always it's awfully skeptical whenever I Apologize so I have to like go an extra mile to sort of sound like Ernest insincere and re morsel because people are always just like oh you're just doing that because of your ...\nThat's the goal whenever I Apologize so after like go an extra mile to sort of sound like Ernest insincere remorseful because people are always was like oh you're just doing that because of your paper\n[noise] no apologies for telling you that was professor Benjamin Hope speaking their Planet Money's Stacey Vanek Smith [noise]\nSupport from Planet Money comes from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\nAlliance a lifetime income dot org [noise]\nYou're listening to all things considered from NPR News\nSupport comes from is recording university were geosciences Richard Alley will discuss the efficient use of energy and the impact his hat on the climate in a lecture on Monday October twenty seconds at seven PM and then the gallon room with American Library on the campus in Dallas more miserable ... dot edu\nOr you were ducks in a row\nAlmost half of Americans do not have a proper stage planned\nPlans are more than matters of money and inheritance\nHe can guide your future health decisions and revise special instructions for loved ones in your care and put your mind at by getting your ducks in Rio today [noise]\nTo request to free planning guy content Joe ... W E young [noise]\nAnd the next ...\nThe creator of the net flicks comedy series bow jak horsemen ... by black or jak as an animated comedy with cast of humans and animals do jak as a horse ... alcoholic sexist former sitcom star satirizing\nHollywood and pop culture and the new season is set in the era of the me too movement during\nI O eighty eight point three of them were like well I'm ... Ninety One point five of them streaming live a W. V. I. A. dot org we have a translator and collect some it at Ninety point three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise] some and adding that to the cutting edge of Celtic music absorb influences in style from the Celtic hotlines and around the world like some of the\nMusic made it takes me a ... [noise]\nSaturday evening at eight on WB I asked them [noise]\nMm [noise]\nHe will [noise]\nRecently new details emerged about how Jamal could show you likely met his end of the Saudi consulate in Istanbul, Turkey will get\nThe latest on the investigation and look at what the international community could do to hold the Saudis accountable\nToday is Wednesday October seventeenth and this is all things considered from NPR News\nI'm Ari Shapiro and I'm Mary Louise Kelly this hour we'll visit Florida where people's recovering from hurricane Michael are asking whether stronger building codes could have prevented some of the worst\nDamage as like somebody's trying to get in and the inside door was shaking I knew the rough had gone and I thought just hang in there and I'd say that everything was going to be okay\nAnd in Boston Harvard students are divided over an admissions policy that's on trial this week\nWhen we focus on something like race I think it creates a third of division and said if they've actually for the sake of ...\nWell that's what the legal type in Canada I mean for the U.S border first listeners\n\nLive from NPR News in Washington I'm ...\nAfter turkey claims it has evidence that missing Saudi journalist ... ... was killed inside the Saudi counseling is didn't bowl U.S officials say they want a thorough investigation into what happened something us secretary of state Mike Pompeo made clear reporters during the refueling stop in Brussels today\nI'm convinced the Saudis understand that America is taking this seriously\nHopeful that the Saudis sacred to seriously they indicated to me yesterday that they would [noise]\nTime will certainly tell we'll get to see the investigation and we'll see the results of\nPresident Trump meanwhile says he's asking turkey to provide audio or video to the U.S if it exists Trump says he's not sent the FBI since the journalist walk contributing comes to the Washington Post is not a U.S citizen president again called for Saudi Arabia and an important ally noting the country is a customer of US military exports\nDropped administrators and says America's greenhouse gas pollution felt like to point seven percent last year but as NPR's Scott Horsley explains the west is still expected to fall well short of the climate goals that were set under former President Obama coal fired power plants continue to lose ground in the U.S to cheap natural\nUs still expected to fall well short of the climate goals that were set under former President Obama\nCoal fired power plants continue to lose ground in the U.S to cheap natural gas and renewable energy the EPA says that help to reduce greenhouse gases from the electricity sector by four and a half percent last year\nBut while smokestacks are getting cleaner tail types of not improve so much Kate Larson of the research firm ... group says it is right at the U.S is not likely to meet the pollution control targets needed to fight climate change\nShe played more and they had that ... ... ... cheating lied you're heavier yet\nThe drop administration has announced plans to roll back Obama era fuel economy standards and withdraw the U.S from the Paris climate agreement Scott Horsley NPR News Washington\nA bomb blast killed an Afghan parliamentary candidate just days before elections are being held in that country Reuters reports the Taliban is claiming responsibility NPR's ... reports from Islam about the boneless\nConcealed in ... in the campaign office of up till ... he was a candidate in uh southern Afghan province\nCome on it's the seventh parliamentary contender to be killed in a militant attack another two had been abducted the Taliban and ISIS have targeted candidates and rallies ahead of Saturday's election most recently though with a bum law at a political gathering it kills twenty two people\nAfghan security forces and the international community are under pressure to ensure these elections are relatively peaceful there were seen as a driver on next year's presidential race did date NPR News Islamabad\nUs home building slumped in September assigned rising mortgage rates are starting to weigh on the market the Commerce Department says housing starts fell to a seasonally adjusted annual rate of one point two million down from one point to seven million in August modest losses on Wall street today the Dow was down Ninety One points this is NPR\nSupport for NPR comes from progressive insurance comparing car insurance rates for multiple insurers so shoppers can evaluate options in one place now that's progressive comparisons available at progressive dot com or one eight hundred progressive\nGood afternoon I'm Paul those are for W. V. like a news Pennsylvania's legislature starting it's final scheduled voting day in twenty Eighteen with no resolution to legislation responding to a state grand jury report accusing hundreds of Roman Catholic priest sexually abusing children over decades\nThe Senate began Wednesday with legislation and its chamber where the Republican majorities opposing a provision recommended by the grand jury and backed by attorney general Josh Shapiro governor Tom Wolfe the house of representatives Senate Democratic leaders and victim advocates\nThat provision would give now adult victims of child sexual abuse a two year reprieve from time limits in state law that otherwise barred them from suing perpetrators and institutions that covered it up current law bars lawsuits when a victim turns thirty before two thousand two state law require victims to sue within two years of being victimized\nOne state senators introduced legislation that would guarantee health insurance in Pennsylvania will cover pre existing conditions W vi age Don Rooney has the story\nSenator Ensign who says that although the federal Affordable Care act guarantees that insurance companies cover pre existing conditions\nThere have been numerous attempts in recent years in Washington to allow states to opt out of that coverage so he's introducing legislation that would prohibit health insurance companies in Pennsylvania from using an individual's preexisting medical condition to deny or exclude coverage for over five point four\nMillion Pennsylvania citizens deserve to have\nThis coverage for pre existing conditions ability to to rein in um potentially skyrocketing increases are in healthcare covers the costs of health\nCare bill is being considered in the Senate banking and insurance committee\nJohn Rudy W vi news\nScare covers the costs of health care bill is being considered in the Senate banking insurance committee John ruining W vi news\nIn our regional whether we'll see a freeze warning in effect for our listening area for midnight tonight until ten am on Thursday for tonight it'll be partly cloudy with lowest in the lower thirties Thursday looks mostly sunny with highs and the upper forties and Thursday night looks mostly clear with lower and lower thirties I'm policies are for\nW. V. like a new ... support for WBAI comes from lower than McCain incorporated providing traditional printing to the business community for over fifty years on and McCain is now offering state of the art digital printing for print on demand books catalogs brochures and more a little while and then the ... five seven zero eight two to eight one eight one from NPR News this is all things considered\nI'm Ari Shapiro and I'm Mary Louise Kelly how much of the blame for whatever happened to Jamal ... should land at the feet of Saudi crown prince Mohammed bin Salman\nThis is a key question in the disappearance it appears the likely murder of the dissident Saudi journalist Turkish officials have identified Fifteen men who they say were present at the consulate in Campbell the day that cause she'll she disappeared\nThe New York times has now linked several of those men to been summoned security detail and tube and timeline himself Maliki brown is one of the journalists on that times story he joins me now and I should warn listeners some of the details that we may be about to discuss maybe ... brown welcome\nThank you very lays out first how you made these links you were coming through publicly available records also coming through photographs doing what just trying to match face to face\nUm yeah we were doing the matching names I'm trying to find social media profiles a finding email addresses and phone numbers that were related to these people through a phone databases\nThat allow us to see how their phone numbers are are saved in um in various different ups\nUm and then you know link using those email addresses and phone records phone records are finding social profiles that are registered using a those numbers and addresses are looking at the biographical details that are um that those people shared\nUm and then we also you know\nWe had information that several of them in a word in the royal guard on so we retraced um Mohammed bin Solomon's movements over the past year or two um and yeah it's gone to like lots of archival reports\nLots of archival reports and lots of archival footage you published several of those photos of one of the Fifteen men who appears to be a frequent traveler companion if the crown prince who is a\nFuss right Mara ... I mean he's a he worked in London in two thousand seven I'm as an intelligence officer for the investor they're um we understand from wiki these ah information published by the Washington Post as well that\nHe um he went under once I'm training as an intelligence officer or as a security officer\nAnd he's been he's been photographed the princess side on visits this year to the U.S to Houston to Boston to the U.N General assembly I mean that was just three weeks ago\nThat's right I mean he's on his shoulder at all of these places as you know the crown prince is\nSupport comes from a while for say in October is national seafood ... a meal plan that includes fish has a heart healthy one while for salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com\nTaking a look now at the forecast will see a freeze warning in effect for our listening area for midnight tonight until ten am on Thursday fortune either be partly cloudy and cold with lower and lower thirties will also see wind gusts up to thirty miles an hour it'd be mostly sunny on Thursday with highs and the upper forties\nThursday night looks mostly clear with Lowes and the lower thirties friday we'll see some of these guys with high in the mid fifties and friday night looks mostly cloudy along with a fifty percent chance of rain with lower and lower forty is\nThis is W. V. I. F. M.\nSupport for NPR comes from the station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more infidelity dot com slash wealth fidelity brokerage services healthy\nFrom log me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learned more it go to meeting dot com\nAnd from the sustaining members of this NPR station\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly and as of today marijuana is legal throughout Canada\nFrom NPR News this is all things considered I'm Ari Shapiro\nAnd I'm Mary Louise Kelly and as of today marijuana is legal throughout Canada which raises a question what happens when Canadians want to enter the U.S given that marijuana is illegal in the U.S under federal law yesterday customs and border patrol official Todd oh and held a conference call with reporters\nWho had a whole lot of questions such as this one\nIs it possible to be not let into the state by saying yes I did smoke a joint has smoked in the past\nYes and mission of illegal drug use our arms around you found in the midst of all and in the United states so yeah that's awful\nReporters posed many scenarios and Owens answers were largely the same\nThat border agents have wide discretion and decisions will be made on a case by case basis I reached out to Lynn Saunders is an immigration attorney in Washington state and he had clients who've been denied entry into the U.S because of past campus use when founders welcome to the program thank you for having me on who you listen to that whole\nConference call yesterday what struck you\nWell what struck me was even though it was the day before legalization of cannabis in Canada CBP still has not given a straight answer on whether they will admit to the United states Canadians who admit to purchasing and using cannabis legally in Canada as of today\nTo be crystal clear on what the situation is and maybe that's part of the challenges it's not crystal clear at the situation is here but there's going to be a huge discretion given to individual border agents to decide how they want to proceed\nBottom line if somebody has smoked pot legally in Canada that's going to be an issue for them when they're if they're asked about trying to come into the U.S\nAbsolutely because even though it's legal in Canada and legal in Washington state where my offices the officer has the discretion to determine that individual could be a drug user or an abuser and denied the matrix based upon that\nSo just to parse that sat there would be an issue about whether\nThey have used marijuana even if they were using it in a place that was ... there would be questions potentially being asked if they have ever used marijuana and that can be grants from orange somebody from coming into the U.S\nAbsolutely in a great example is prime minister Trudeau he has admitted very publicly or in the past that he has used candidates prior to legalization so he could be denied entry into the United states when he's no longer prime minister because right now he has a diplomatic passport\nAnd be deemed in admissible even though it's legal as of today in Canada\nAnd again just to try to drill down on that we're talking about a situation where it's legal in Canada it's legal under where you are in Washington state under state law but because federal us federal law prevails at the border that's where we have the sticking point\nExactly and it's kind of a hypocritical situation by the federal government where they've taken a hands off approach to states legalizing marijuana like Washington state but they use the full force of the U.S government and immigration laws to keep out undesirable\nYou know people who have used cannabis whether it's legal or not in Canada\nI suppose from the sea BP's point of view they don't make federal law they're tasked with enforcing federal law at the border and marijuana is illegal under federal law taking that ... what do you think that they should be saying what role should be put in place that would make the situational less chaotic going forward\nWell I think the federal government has to have some commonsense so they need to have a consistent approach with the enforcement of federal laws either\nOutlawed in every state and be consistent with what you're doing at the border or do what you're doing at the border with what you've done in many states which should take a hands off approach unless it comes to your attention and\nYou have let's say you know a huge amount\nIf you're doing at the border with what you've done in many states which should take a hands off approach unless it comes to your attention and you have let's say you know a huge amount of contraband on your vehicle around you who cares if a Canadian admits that they use marijuana legally in Canada who cares\n... he's an immigration attorney in between Washington talking about the legalization of marijuana today in Canada and what problems that might cause at the U.S Canada border ... time thank you very much\nThe state of Florida has some of the nation's toughest building codes at least most of the state the rules are less stringent in the panhandle that's where Mexico beach is and that's where hurricane Michael made landfall with one hundred fifty five mile an hour wins a week ago entire blocks were flattened\nNPR's Greg Allen reports many are now calling for revised stricter building codes on Florida's panhandle\nIn Mexico beach Lance Irwin is one of the lucky ones his house is still standing he rode out the storm in his home several blocks from the beach\nThat arrived or say come as like somebody's trying to get in in the inside door was shaking I knew the rough had gone at that point because everything was shaking I thought\nJust hang in there and I said everything was going to be okay for when last\nDoors windows part of his roof but his home is largely intact the same can't be said for many other residents Mexico beaches Mayer says Seventy five percent of the town is gone the storm surge washed houses on the beach off their foundations to the other side of the coastal road\nHigh winds lifted off roofs and knock down walls quite a few gates is the former head of FEMA and a long time urgency management official in Florida he points to one reason for the extreme destruction in Mexico beach and other communities in the panhandle in many cases it's old construction that predates the building code\nThey just as a part of Florida that's what I called the Florida it's not a bunch of high rises is not a lot of construction this is all generational of Florida families many of them or just said that Trump folks that fish the area's\nAfter Hurricane Andrew in Nineteen Ninety to Florida took a hard look at his building codes in South Florida Miami Dade in Broward County is adopted strict standards requiring storm shutters and reinforced concrete block construction for all buildings structures must be able to withstand winds up to one hundred and Seventy five miles per hour\nSeveral years later Florida revised it's state wide building code John ... to Reno a structural engineer in Miami says officials decided not to require South Florida is one hundred and Seventy five miles per hour winds speed standard throughout the state\nUnfortunately because it is based on probability of storms in the past and all of that it's sort of a goes down as you go further north in Florida\nHistorically there have been fewer intense hurricanes on the panhandle but elsewhere in the state and some north Florida communities new construction need only withstand when speed one hundred and thirty miles per hour or less far below the one hundred and fifty five mile per hour winds scene in hurricane Michael\nIn the aftermath of the storm as local state and federal officials assess the damage a consensus is emerging that building codes along Florida's panhandle need to be stricter\nDavid provide is a professor of civil engineering at the University of Florida he's part of a team that's been the weekend on the panhandle gathering data on Michael's impact\nWhat we were damaged to pretty much all types of construction all types of materials and all types of what was not damaged houses that were well engineered\nFormer FEMA ahead Craig view gate has long believed wind speed standards along Florida's panhandle were too low he says when policymakers develop them they left out information about a powerful hurricanes that hit the area in the nineteenth century before accurate record keeping\nIt yeah that store back in and out particularly yet Michael back in is going to force a much higher in ... ... or the coast well\nBeing a jihadist store back in and out particularly yet Michael back and it's going to force a much higher in global warming or the coast well inland based on those two storms\nFlorida's building commission is now in the process of revising the state code and as a wedding recommendations from the University of Florida team led by David ... of robots as understanding how to build resilience structures is just the first step\nWe know what can you treat the suit you it is way the computer cheese willing to adopt it or not\nRealtors home builders the insurance industry and many others will have a voice as Florida considers how to prepare the panhandle for the next storm like hurricane Michael ... NPR News Mm\nThis is NPR News support for WBAI comes from allied services hospice care\nIt focuses on easing symptoms and attending to emotional and spiritual needs allied services now offers hospice care at home in any home setting including personal care or skilled nursing facility any place where memories begin and where lasting memories reside\nThey'll go to them it's really important but I think that when we look at it we shouldn't just be looking at night in the context of race but again like I said married in the context as economic status or something that speaks more to someone's opportunities and resources is really important and\nIt sounds like you both agree that there are things about a person's application that cannot be quantified in grades and test scores you just disagree about whether that list of things including race or not\nYeah I Would agree with that I Would say that all of that sort of had the same goal of diversity on a college campus whatever sort of benefit to that are but we just don't believe that we have to resort to realizing admissions um and he said focus on something like poverty because when we focus on something like race I think it\nCreates a sort of division and sort of diversity for the sake of diversity and I think chief justice John Roberts said it best when he said the only way to stop discrimination on the basis of race it's a start discriminating on the basis of race\nWell Kelly ... thank you so much for talking with us today Thanks for having me she's a junior at Harvard\nAnd you are listening to all things considered from NPR News\nNext month's thirty six states will elect a governor nine of those races where Republicans are in office are so competitive some analysts say they're a toss up even though a Republican in office now the winner could come from either party\nOne example Iowa where the Republican governor can't seem to ... past her democratic challenger here's Clay Masters of Iowa Public radio [noise]\nThere was barbecue and live music harvest seemed fundraiser Iowa's Republican governor Kim Reynolds this weekend in the morning for the kids there were balloon animals and face painting White House press secretary Sarah Sanders was the keynote speaker\nFor taking to the podium she signed autographs to throw\nOut\nThe daughter of former Arkansas governor Mike Huckabee felt the crowd they need to keep the state's top officer in Republican control\nTrust me I've seen one little girl Democrat running the state looks like a member I'm from Arkansas and it lived under the Clinton for a long time\nThis is the first time Reynolds has run for the office she ... she was lieutenant governor and took over for former Governor Terry Branstad when he became US ambassador to China last year\nReynolds tells the budget surplus of one hundred and twenty seven million dollars and a state unemployment rate of two and a half percent has a couple of reasons voters should keep her as governor that resonates with Carol ... Burlington who was at the\nFundraiser registered Democrats thinks Republican policies are working\nWith rent and we would have stayed within two if he hadn't gone to China were staying with him we think he was a parent or for this\nAs a rental stepped out of the shadows of her predecessor she's walked into the light of president Donald Trump last week she appeared on stage with the president in front of a packed arena in Council Bluffs Iowa and praised him\nFor\n\n\n\nDemocrats here are hoping governor Reynolds close alignment with the president works in their favor\nImmediate effects of Trump's tariffs have not been good for farmers and while Iowa when big for President Trump twenty sixteen\nTwo years later with less than stellar approval ratings in the state Democrats see an opportunity there Kennedy it spread Hubble the former board member of Iowa's Planned Parenthood has some name recognition and the state he's a wealthy retired businessman it is getting help from Democrats all over the country\nTo things or you know\nI was Planned Parenthood has some name recognition in the state he's a wealthy retired businessman it is getting help from Democrats all over the country\nTo things or you're just you know\nNumber one friend who is going to be there you go\nThat's Washington governor Jay Inslee he's the chair of the Democratic Governors Association and it's talking with volunteers getting ready to knock doors in the small Iowa college town of ... [noise]\nA Donald Trump is just a blip in history and we're going to rescue this country are you started right\nAnd polls show the rate is close between Hubble and Reynolds Hubble has spent millions of his own dollars on his campaign which has primarily focused on what he sees as Reynolds mismanagement of Medicaid and the state budget\nWe shouldn't be taking money out of education out of health care out of public safety out of our judicial system and then come up with a budget surplus that was a lot bigger than they thought it was and they can explain why\nArtist and democratic volunteered Tara Shukla Jones says she's voting for Hubble even though he wasn't her first pick in the primary\nVoting and glamorous no not really in that you it doesn't always make you feel like if you don't do that for a long time their problem right no no I think and how long is that\nBetter choice for governor with early voting underway some Iowans have already cast their decision in a contest that quickly become one of the country's most\nCompetitive governors races for NPR News I'm Clay masters in Des Moines [noise]\nYou're listening to all things considered from NPR News\nSupport comes from books university you may have a bachelor's degree in one field that are thinking about pursuing a nursing degree what the will university accelerated BSN a bachelor's degree can be heard was one year a fulltime study more Wilkes dot edu slash accelerated BSN\nSupport for WB I come from Poland ... Jackson offering innovative energy efficient and humane architectural design with fifty three years of experience information at B. C. J. dot com and on bones whiskey Jackson's Facebook and Instagram\n[laughter]\nWhen your business becomes a WBAI sponsor you helpless share the world within ... NPR News classical jazz in contemporary music and other favorite radio programs we're proud to thank the many civic minded businesses arts and education organizations\nThat support or non profit public service mission and we invite your business to join engage the w._b. I audience these color corporate sponsorship team five seven zero six zero to eleven thirty seven and thank you [laughter]\nNow that your kids have their own car maybe it's time to get rid of that unwanted one that's just taking up space donate a car to W. V. I Will pick it up", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Williamsport", "day": "17"}