{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live a W. B. I. A. dot org we have a translator in clock so much at Ninety three up in your arts and information station listener supported\nAnd if you can use WBAI dot org and click on mice healthy by\n\n\nThis was WBRC eighty nine point nine of M. W. B. I. H. D. ones granted Wilkes Barre who were in Williamsport at W. B. Y. U. eighty nine point seven FM you'd Mansfield a W T I O eighty eight point three of them were like well I'm pocket W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in clock so much of ... three of them you're arts and information station listener supported public radio W. V. I. S.\n[noise]\nThe Williamsport simply conducted by ... it'll Stein opens October sixteenth works by Racine each ... and Brahms\nGrammy nominated and chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth other community art center five seven zero three to six twenty four twenty four or ... dot org sponsors with a couple of groups that might come in college\nI Will vote\nJudge\nBrett Kavanaugh appears to have enough support in the U.S Senate to be confirmed as a Supreme Court judge to today's friday October fifth and this is all things considered from NPR News\nI'm Mary Louise Kelly and I'm Ari Shapiro has this hour full coverage of the protest for politics and the vote on Brett Kavanaugh also will take a break from Washington politics to consider politics in Brazil where they are gearing up for the most divisive presidential election in decades\nWe've had enough with male politician and Brazil who think they\nCan say whatever they want and there are no rubber question\nAnd a new memoir about growing up surrounded by love and laughter and a mother who use drugs\nAre definitely always felt that my mother love me but I also felt total abandonment those stories ahead after the news headlines [noise]\nLive from NPR News in Washington I'm Louise give on a Republican Senator Susan Collins of Maine has broken the suspect she says she will be a yes on the nomination of judge Brett Kavanaugh to the U.S Supreme Court\nMy fervent hope\nIs that Brett Kavanaugh will work\n... less than the ... in the Supreme Court so that we have far fewer five four decision and so that the public confidence in our judiciary and our highest court is reached or\nMr President I Will\nVote chicken from judge cabinet\nOne Senate Republican who voted to stop the nomination in a closed procedural vote this morning Lisa Murkowski of Alaska\nI made me\nVery very difficult but I did I Believe that Brett Kavanaugh\nThe American bar association has announced it is revisiting it's a valuation of Kavanaugh after last week's Judiciary Committee hearing a final Senate vote expected tomorrow evening\nThe jury has reached a verdict in the murder trial of Chicago police officer Jason Van Dyke guilty second degree murder he was accused of shooting Seventeen year old ... McDonald's who was holding a knife sixteen\nMeanwhile the American bar association has announced it is revisiting it to valuation of Kavanaugh after last week's Judiciary Committee hearing a final Senate vote expected tomorrow evening\nThe jury has reached a verdict in a murder trial of Chicago police officer Jason Van Dyke guilty second degree murder he was accused of shooting Seventeen year old Laquan McDonald who was holding a knife sixteen times in October of two thousand fortune [noise]\nThe release of police dash cam video the shooting sparked massive protests three years ago that guy was also found guilty of sixteen counts of aggravated battery with a weapon not guilty of official misconduct\nThat soaking grains of Hurricane Florence appear to gambling job growth last month but it's NPR's Scott Horsley reports on unemployment continue to fall to its lowest level in nearly fifty years\nUs employers added one hundred and thirty four thousand jobs in September well below the reason average but much of that slow down is likely to be temporary as hotel shops and restaurants reopened after Hurricane Florence\nThe unemployment rate compiled from a separate survey continue to drop to just three point seven percent what else economist Kevin Hassett says in some cases there are more job openings than there are workers to fill the\nIf you look at things like the the surveys of businesses that may be a list finding workers is one of their main challenges right now that\nDemand for workers is so far but only modest upward pressure on wages early wage growth over the last year as average less than three percent Scott Horsley NPR News the White House\nOn Wall street at the close the Dow Jones industrial average off one hundred eighty points at twenty six thousand four hundred and forty seven ... Ninety One ditches anti\nSupport for NPR comes from progressive insurance committed to offering a streamline shopping experience were home an auto can be bundled together now that's progressive learn more progressive dot com or one eight hundred progressive\nGood afternoon I'm policies are for W. V. like a news a house committee is taking up a bill next weekend and helping people who are alleged they're being cheated out of royalty money from natural gas drilling but its WBAI is Marie Cusick reports the measure is not what land owners have been pushing for\nThe bill that's being voted on would allow people to inspect gas companies records which could help we told her to verify proper royalty payment it comes amid many years of landowner allegations that some drilling companies miss report royalty information and underpaid people for the gas they're producing on their properties\nA group representing Pennsylvania's mineral owners however\nHad spent years asking for something different a bill that would clarify Pennsylvania is guaranteed minimum royalty act in Nineteen Seventy nine law which states oiling athletes is aren't valid unless we soldiers receive at least a twelve and a half percent royalty\nThe natural gas industry has lobbied against those efforts arguing they would unconstitutionally rewrite contracts\nWas Marie Cusick reporting for W. V. I. A. news Pennsylvania prison officials say they're seeing positive results from changes to mail and visiting policies imposed after dozens of corrections officers and other employees how to seek medical help for suspected exposure to synthetic marijuana\nThe agency says cases of suspected staff exposure have plummeted in the months since new policies were announced drug overdoses among prisoners have fallen and investigators believe illicit drugs have become scarce or the price of drug contraband has jumped suggesting to supply is lower\nThere's also been a recent increase in visitors caught trying to smuggle in drugs which officials believe is the result of changes and mail handling\nTaking a look now at the forecast for the W. V. I. A. listening area I'm going to be mostly\nIt's just a male and visiting policies imposed after dozens of corrections officers and other employees how to seek medical help for suspected exposure to synthetic marijuana\nThe agency says cases of suspected staff exposure have plummeted in the months since new policies were announced drug overdoses among prisoners have fallen and investigators believe illicit drugs have become scarce or the price of drug contraband has jumped suggesting that supply is lower\nThere's also been a recent increase in visitors caught trying to smuggle in drugs which officials believe is the result of changes a male handling\nTaking a look now at the forecast for the W. V. I. A. listening area I'm going to be mostly cloudy this evening along with a slight chance of rain after midnight with Lowes in the lower fifties\nSaturday looks mostly cloudy with highs and the upper sixties\nWill see mostly cloudy skies in a Saturday Night with ... and the upper fifties Sunday looks partly sunny and very nice with highs and the upper seventies Sunday night we'll see mostly cloudy skies with Lowes and the lower sixties and Columbus Day looks partly sunny along with a forty percent chance of showers and thunder storms with highs and the upper seventies I policies are for W. V. on a news\nSupporting W. V. I. A. F. N. C. back member of FDIC with sixteen branches throughout Lucerne Lackawanna and Wayne counties\nFrom NPR News this is all things considered I'm Ari Shapiro\nAnd I'm Mary Louise Kelly and judge Brett Kavanaugh is now one step away from my seat on the Supreme Court looks like he has the votes he needs to be confirmed in a final vote\nTomorrow this afternoon the last undecided Republican Susan Collins of Maine delivered a lengthy for speech she talked about Kavanaugh's qualifications for the Supreme Court before she turned to the allegations of sexual assault against him and said this\nIs the presumption of innocence and fairness do bear on my thinking and I cannot abandon them\nThen for the next twenty minutes she walked through why she ultimately believe the charges against Kavanaugh should knock to prevent him from serving on the Supreme Court her conclusion\nMr President\nI Will vote chicken for judge cabinet\n[noise] then it's after that West Virginia Democrat Joe Manchin said he would also support the nominee All right we're going to bring in NPR's Kelsey Snell she is on Capitol Hill she has been tracking all of this back and forth today Hey Kelsey either high so I Would ask and just a second a little bit more about what senator Collins said but first the headline\nIs there any suspense at this point how the confirmation fight is likely to shake out\nWell now that mansion has said that he remains I guess this is essentially they had the fifty one goes to the fifty on people who voted yes before our very likely now to vote yes tomorrow when the final confirmation vote comes up\nNow that's not to say that some crazy thing could happen but now in that it happened you know we have to keep those catty outgoing but this means that the support that that we saw earlier today it seems to stand and it means that vice president Mike Pence did not appear to be needed to break any ties writes\nA role that he might have had to play had it had it not checking out quite this way today okay senator Collins as she laid out her position and the links for speeches origin fed a did appear to have been undecided anytime that recently I'm and she was from start to finish it was pretty clear how she was wanting to vote\nYet she basically used her speech at the kind of closing argument was as much of that a closing argument for Kavanaugh as anything else\nTo finish it was pretty clear how she was wanting to vote yet she basically used her speech at the kind of closing argument it was as much of that a closing argument for Kavanaugh as anything else\n\n\n\nBombing every disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDumped form of lung disease including asthma\nBronchitis and busy and long\nSmoking genetics and inspections are long factor\nFor why someone may develop one or more disease\nCount on the natural color Dr\nWednesday night at seven thirty on WB I a TV [noise]\nTaking a look now the forecast for the W vi listening area will see mostly cloudy skies this evening along with the slight chance of rain after midnight with lower and lower fifties Saturday\nLooks mostly cloudy with highs and the upper sixties will see mostly cloudy skies Saturday Night with Lowes in the upper fifties Sunday looks partly sunny and very nice with highs and the upper seventies and Sunday night we'll see mostly cloudy skies with Lowes in the lower sixties\nThis is your arts in information station W. V. like a a family\nSupport for NPR comments from this session and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from zoom zoom offers cloud video conferencing online meetings and the video conference room solution and one platform featuring digital video and audio with screen sharing account registration and more eggs zone dot us\nFrom NPR News this is all things considered I'm Mary Louise Kelly and I'm Ari Shapiro in Chicago today jurors convicted city police officer Jason Van Dyke of second\nDegree murder in the shooting death of Seventeen year old ... McDonald the incident occurred four years ago this month\nChicago has been on edge during three week trial the high profile case central largely around a dash cam video of the shooting that sparked protests and lead to civil rights probe\nWB easy reporter Shannon Heffernan has been following the trial and joins us from the courthouse Hi Shannon hello this is a striking verdict and the jury only began deliberating yesterday remind us what options they were considering\nWhat did you talk with actually charged with first degree murder by injury instructors they were told they could also considered second degree murder and that's what they decide here's a different basically they have to find that he was guilty of murder but they're like a factor that charge and that that\nHe believed the shooting was necessary but all eat when I'm chef\nThe jurors also had the option of finding who killed the I think she knew how that aggravated battery\nThat one how for each shot Jason Van Dyke fired\nThe murder [noise] easier I ate\nA little difficult to make out there but that some tape from the court room with the jurors reading out the verdict there I Know that during the ...\nSo have the option of finding him guilty on six to ... counts of aggravated battery\nFat one count for each shot Jason Van Dyke fire [noise]\nWe have to be murder [noise] easier I think that there\nAre a little difficult\nTo make out there but that some tape from the court room with the jurors reading out the verdict there I Know that during the trial many were surprised at the defense put Jason Van Dyke on the stand how did his testimony compared to what was shown repeatedly on on a video of the shooting\nWell he has to fight ... Donald raised a knife to his shoulder and that video looks can't see that happening\nHe also testified that at some point look phonic Donald after he was on the ground tried to push himself up you also cannot he sat on the video when push on that point chicken Van Dyke said that he had a different perspective and where the video camera was\nSo that get represent what he saw\nThat prosecutors had him on a pretty heart basically saying your cats money isn't an actual reality\nAs we said there were significant protests after the dashcam video was initially released how is the city been preparing for this verdict and how do you expect the community to react to it\nWell today there were a lot of preparation police were told they'd have to work long hours they had police and parking lots nearby ready to point if you eat at 'em and watch a lot of people down town were allowed to go home from work early expecting that that may be protests downtown in the loop um but\nFrom what I'm saying so far it's been pretty quiet and most of the actors that we've talked to has said that while they were hoping for a first degree murder conviction they are celebrating this conviction on a second degree murder charge\nThe w._b. easy reporter Shannon Heffernan who has been following the trial of police officer Jason Van Dyke in Chicago thank you very much thank you\n[noise] to Brazil now where Brazilians will vote on Sunday in what is considered their most divisive presidential election in decades women are mobilizing against the front runner in unprecedented numbers he is a far right congressman with a reputation for much Janine\nHomophobia and racism NPR's Philip Reeves has this report\nHuge crowds chanting and he know that means no hint hint versus too shy to NATO retired army captain is leading the polls that\n\nWe're really demonstrate convene but I'm going to lose she's Eighteen and moved here\nJust to stand up and say that we've had enough with the patriarchal ism in our society especially with male politician and rebuild who think they can say whatever they want and there are no representation\nHas a record making sense to promote women black and indigenous Brazilians and the GDP [noise] people from these groups this protest to try to ensure that there\nIs no\nMen who says he admires pursue pasta and wants to put his government generals who the idea is to the ... business administration\nI think did this I I think like I I think there's room on gay black people they are talking more they are trying to [noise]\nBlack and indigenous Brazilians and the algae boutique people from all these groups of this protest to try to ensure that next\nIs a man who\nSays he admires Brazil's pass dictatorship and wants to finish government with generals ... is the tea and works in business administration\nI think it is I I think like I I think they're well mom game like people they are talking more they are trying to get the right [noise]\nThat ran it was in Rio on Saturday there were many others against votes out of that day including a boss crowd in the city of Sao paolo likes the me too movement the not hidden hashtags has gone borrow speaking out isn't easy systematic Libya I Walk\nWith a lot of people and I have no say in my family people as possible so now what makes me really sad is that we cannot talk\nAs a clinician as a psycho analyst um scenes for the first time in all my career people discuss things or politics in the everyday lives I mean families are divided\nThan old friends from school not speak to people who are suffering more than ...\nChristian ... is professor of psychology at the University of Sao paolo he thinks Brazil's becoming a different place\nThis is the kind of a new face and the shoes of the country because our image around being friendly people being the core geo to each other collapse\nNearly a month ago both NATO was stabbed him badly injured a rowdy he left hospital a few days ago Brazil's political rhetoric cooled\nDown to [noise]\nFor [noise]\nSome of those women supporters at a rally only a couple of combined the beach hope the stations says he thought the center for those pleasures I roll intend to choose both NATO\nCountries on women is several points lower although this has recently grown significantly many women here say they support both not a whole slate\nEspecially his hardline approach to Brazil's fathers crime epidemic others have agonized over whether tobacco boats and lemons just touchy one study I called\nIt makes me think that my dog is I Believe on male chauvinists and homophobic like either politics he's the only candidate in seems to have a strong plan to begin to leave for sale out of chaos typically\nBrazil's in chaos is a big part of\nThe countries emerging from its worst recession\nA massive corruption investigation\nHas landed ... politicians in prison including former presidents Luis and looted so those are not as supporters on the rise blamed Lula and just let this workers' party for these was Louis chosen candidates than and now she\nIs polling second of people in this feverish climate Amanda lentils finds it tough talk to people\nThat they miss so much freedom telling people and I'm also not a sport because of losing friends and my friend\nIs no candidate gets moldy fifty percent on Sunday there'll be a second round on October twenty eight medal finally decided both so now those to be president yet says psychoanalyst\nChristian to cook it won't heal the painful divisions among Brazilians goals by making that choice I'm afraid we will never recover Philip Reeves NPR News Rio de Janeiro\nSo they feel somewhat afraid of how many people and I'm also not because of losing friends and lots of friends he's\nNo candidate gets more than fifty percent someday there'll be a second round on October twenty eight medal finally decided both so now those to be president yet says psychoanalyst\nChristian Duke uh it ... the painful divisions among Brazilians cools by making that choice I'm afraid we will never recover Philip Reeves NPR News Rio de Janeiro\nBack in July when Kavanaugh was named as the nominee among\nPeople gathered at the White House for the big announcement which John Malcolm Malcolm is with the Heritage Foundation that's a conservative think tank here in Washington a think tank which President Trump has credited with helping to inform his thinking on judicial nominees John Malcolm joins me now welcome it's a pleasure being with you\nAnd my right in thinking you were pleased with how the confirmation vote appears to be shaping up\nYes I'll be more pleased after it's done tomorrow now creating the likely that Brett Kavanaugh will be an associate just some Supreme Court and I'm very pleased about\nThe numbers are there I Would let you address some of the questions that have been raised that will continue to be raised in light of his testimony I'm insured questions about his temperament I'm more than twenty four hundred law professors from across the political spectrum have signed a letter arguing\nThat he demonstrated a lack of judicial testament temperament when he when he was testifying that there should be disqualifying and then I Want to play you a little bit of John Paul Stevens the former Supreme Court justice\nWho we didn't last night and said he no longer believes Kavanaugh should be confirmed here's Justice Stevens\nIs the thing that the road and they should have been in a from a when he was nominated but I think that his performance during the hearings cause me to change my mind\nJoe Malcolm so these are not he said she ... she said questions there that are being right these are serious questions about his temperament what do you think sure\nWell we don't have to guess about a judge Kavanaugh's temperament we have twelve years of experience with him being on the DC circuit court of appeals to bar\nWho know him well say the justice that they've known before was not the man on display last week will testifying\nWell that is certainly true I think if there were some people that would have preferred that Brett Kavanaugh in the midst of an incredible onslaught\nAgainst him his reputation as family that he would have acted like comment on\nI'd had by the way he acted like in ...\nI think that response what had been well clearly he must be guilty because they truly innocent man would have expressed righteous indignation at the at the charges that he was facing so I think that Brett Kavanaugh was put into a position where he was damned if you did and damned if you did at the American bar association of course interview well over a hundred of his fellow judges and lawyers\nAnd said that he has an outstanding judicial temperament and he will as the Supreme Court justices well\nPeople wing and then continuing to weigh in on both sides of this absolutely right let me let me ask you this why should we have confidence that a man who said under oath with no evidence that he was the victim of a revenge plot on behalf of the Clinton that he was the victim of a big left wing conspiracy\nThat this man will be able to serve as an impartial nonpartisan justice forward\nOne Brett Kavanaugh has a history of caring about the rule of law and not base he leaves based on any political or personal bullies and he is not about the sacrifice that wealth is er reputation for integrity by throwing it all the way on the Supreme Court\nDue to grow their companies and put a drag on the overall economy but how says that's historically low jobless rate is a positive for many workers\nIt off of course ... implications for wages\nThere are signs that wage growth is finally picking up as employers are being forced to boost pay to attract and keep workers\nEconomist Dean Baker says low wage workers are among those benefiting partly because many cities and states have raised minimum wages to September jobs data showed average wages growing at just to point eight percent over the past year but lower income workers experienced much bigger gains\nFor twenty three percent of last year so some of the minimum wage law but I think some of that is the tightening labor market\nAnd Baker says the super low unemployment rate is helping those at the bottom of the economic ladder finally get a toehold in the first wrong\nWhen you start to get the unemployment rate down to slow the people who benefit disproportionately those bottom so you're seeing people that historically not been able to get jobs at least recently not been able to get jobs the markets opening up to them\nBlack teenagers are a good example the black teen unemployment rate hit a record low in September that's the good news bad news is that it's still above Nineteen percent\nAnd that's why Baker believes the Federal Reserve should not panic and start raising interest rates more rapidly to keep the economy from overheating\nSo who should get the credit for engineering this low unemployment rate the White House took some credit today touting President Trump's policies on deregulation tax cuts and trade\nFormer President Obama also get some credit for reducing the unemployment rate by more than half during his administration Baker who's senior economist at the center for economic research and policy says both administrations have a case but\nThe fed is really a hero\nBaker says remember that just four years ago the consensus among fed policymakers was that once the unemployment rate fell below five and a half percent inflation pressures were built\nA lot of them wanted to raise interest rates that said you know look down upon makes getting too low you have a problem with inflation\nBut former fed chair Janet Yellen said let's wait and see what happens and that's what the fed did finally it began raising rates gradually and has continued that pays under the Fed's current leader Jerome Powell\nIf you followed the view many people on the fed and many other economists they will start to slam on the brakes the unemployment rate got around five percent and they never would've allowed it to get this low\nAnd Baker says that would have meant millions of people might not have gotten the jobs they now have John Ydstie NPR News Washington [noise]\n\n[noise]\n\nYou're listening to all things considered from NPR News support comes from Bloomberg children's museum where you and your children can meet your favorite superhero suddenly heroes alliance this Saturday costumes are encouraged with games crafts and more this Saturday October ... tend to to to lose our children's museum more five seven three eight nine nine two oh six\nOpioid epidemic isn't a men's public health crisis of our time\nNow WB I as a proud partner with family services association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer\nYou're listening to all things considered from NPR News\nSupport comes from Bloomberg children's museum where you and your children to meet your favorite superhero suddenly heroes alliance this Saturday costumes are encouraged with games crafts and more this Saturday October sixth from tend to to what the blues gr children's museum more five seven oh three eight nine nine two oh six\nOpioid epidemic using a men's public health crisis of our time now WB I as a proud partner with families service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel in conference center in books very\nTwelve workshops focusing on different aspects of the opioid crisis details in registration essay\nAnd he'd be a dot org\nVisitors W. V. I. A. eighty nine point nine up out W. V. I. H. D. once quieted Wilkes Barre Hazelden in Williamsport W BYA eighty nine point seven I found in Mansfield WTO eighty eight point three of them and add like while in pop back\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. I. dot org we're in Allentown ... point three and in Bethlehem at one of five point seven member supported public radio W. V. I. S.\n[noise] joined\nMe put an out of my eyes friends both sides of the Atlantic neither had actually be time\nIt fly find it that if this is Sam [noise] joined\nThe owner richer you Saturday evening at age ... [noise]\n[noise]\nKnows are forty nine the motion is agreed to\nBrett Kavanaugh moved one step closer to the Supreme Court with a final vote scheduled for tomorrow\nToday is friday October fifth and this is all things considered from NPR News\nI'm Ari Shapiro and I'm Mary Louise Kelly this hour we'll look at the consequences of this confirmation fight for the Senate and the Supreme Court\nAlso to people who fought against sexual violence when the Nobel Peace prize these Brussels recognizes Gump was these things that only will we have to walk and be stigmatized even ... years\nLater the state of the me too movement one year after the Harvey Weinstein story broke we knew that this part of the system and it wasn't just about ... or reporting on Bill O'Reilly it'd be a little appointing on ... factory workers and recovery efforts\nContinue after the Indonesian tsunami first new it's\n\nLive from NPR News in Washington I'm Janine hurt on the Senate floor this afternoon Maine Republican Senator Susan Collins took away any doubt on where she stood on Supreme Court nominee Brett Kavanaugh thinks she will vote to confirm him\nTalent says she did fine Christine Blasey Ford testimony compelling but she says without cooperating evidence the allegations of sexual assault shouldn't prevented confirmation\nI Do not believe that these charges Ken fairly per bad\nJudge cabin uh friends surfing on the court\nJanine hurt on the Senate floor this afternoon Maine Republican Senator Susan Collins took away any doubt on where she stood on Supreme Court nominee Brett Kavanaugh saying she will vote to confirm him\nColon says she did fine Christine Blasey Ford's testimony compelling but she says without cooperating evidence the allegations of sexual assault shouldn't prevented confirmation\nI Do not believe that these charges can barely heard bad\nJudge cabin uh friends surfing on the court\nEllen's praised having a judicial record saying he received rave reviews for his twelve year track as a judge West Virginia democratic Senator Joe Manchin says he will also though to confirm the judge a vote is expected to take place tomorrow\nWe will President Trump says he is very proud to the U.S Senate cast a procedural vote moving cabinet one step closer to ... confirmation as NPR's Scott Horsley reports a final Senate vote is expected this weekend\nThe president's nominee cleared friday's vote by a narrow margin fifty one forty nine leaving some suspense over the final outcome but with Republican swing vote Susan Collins and Jeff Flake announcing their support for Kavanaugh he appears to have the backing you needs for confirmation at least that's the hope ... spokeswoman Sarah Sanders\nSays having all has demonstrated exactly what you would want out of a Supreme Court justice he said over the last several months and I think that I'm moving into the weekend we certainly hope that the Senate will vote if\nConfirmed Kevin I Would be the second justice Trump was installed in the high court in less than two years the president is also put dozens of conservative judges elsewhere on the federal bench Scott Horsley NPR News the White House\nA jury has found a white Chicago police officer guilty of murder and the shooting death of a black teenager NPR's Cheryl Corley reports it's the first time in decades set of Chicago officer has been found guilty of murder and an on duty shooting\nIt took the jury just a few moments to announce a verdict\n[noise] murder\nGuilty of second degree murder guilty of sixteen counts of aggravated battery with a firearm and not guilty of official misconduct\nAt the center of this case was a dash cam video of the twenty fourteen incident which showed Van Dyke shooting Seventeen year old ... McDonald's sixteen times as he held a knife that aside the release of the video the shooting sparked widespread protest\nMayor Rahm Emanuel said the jury reached its verdict and now the effort to build bonds of trust between residents and police must carry on Cheryl Corley NPR News Chicago\nI'll treat was lower by the closing bell today the Dow falling one hundred eighty points dead at twenty six thousand four hundred forty seven it was done more than six tenths of a percent\nAnd as I fell Ninety One points to gloat at Seventy seven eighty eight that's done one point one percent and the and the five hundred dumped sixteen points of twenty eight fifty five this is NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring where employers can post jobs and your screener questions to do their short list for candidates learn more and indeed dot com slash hire\nGood afternoon I'm policies are for W. V. on a news Republican Jeff Bartos and Democrat John federal men are scheduled to debate this weekend W. V. I. is Lucy Perkins reports the two candidates for lieutenant governor will meet in Pittsburgh on Saturday\nWe governors don't have a lot of power but they do take over if something happens to the governor that's why this debate matters that Franklin and Marshall College professor Terry Madonna\nWhat you don't want is the lieutenant governor who has watched the negatives that the biggest problem\nBut Medina says voters will still cast their ballots for the gubernatorial candidate they support not they're running mate\nThe issue at hand is essentially one\nDo some Democrat John federal men are scheduled to debate this weekend W vi is Lucy Perkins reports the two candidates for lieutenant governor will meet in Pittsburgh on Saturday\nWe haven't or don't have a lot of power but they do take over if something happened to the governor that's why this debate matters that Franklin and Marshall College professor Terry Madonna\nWhat you don't want is the lieutenant governor who has a bunch of negatives that the biggest problem\nBut Medina says voters will still cast their ballots for the gubernatorial candidate they support not they're running mate\nThe issue at hand is essentially one thing will the voters decide that Governor Walker me a second term\nGovernor wealth and his Republican opponent Scott Wagner met for the only scheduled the gubernatorial debate on Monday\nThat was Lucy Perkins reporting for W. vi a news legislation is passed the state Senate that would make sexual extortion illegal W vi used on ruining explains\nSexual extortion Norris extortion occurs when someone insists on payment of sex or sexual images instead of money or other valuables senator ... says with the Internet and social media so extortion is becoming more prevalent\nIts uses grown in both intensity and frequency in the digital age outpacing our current laws and mechanisms and leaving victim was an adequate recourse and perpetrators accountable\nShe says her legislation will correct that\nThis bill will established extortion at the specific criminal offense with consequences comparable to others sexual offenses\nThe bill is now in the house for consideration John Rudy W vi news\nIn our regional whether it'll be mostly cloudy this evening along with a slight chance of rain after midnight with Lowes in the lower fifties the times five or six and I'm Paul is our for W. V. I. A. news\nSupport for WBAI comes from lower than McCain incorporated providing traditional printing to the business community for over fifty years well and then McCain is now offering state of the art digital printing for print on demand books catalogs brochures and more luau in the McCain five seven zero eight two to eight one eight one\nFrom NPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly\nAfter weeks of bitter partisanship after emotional and angry testimony after impassioned speeches for the nominee against the nominee Brett Kavanaugh now appears to have the votes to become the next Supreme Court justice it happened close to four o'clock today on the Senate floor with this declaration\nMr President I Will vote chicken for judge cap and that\nWas Senator Susan Collins of Maine a Republican who laid out her case in a speech that lasted more than forty minutes she began with a review of Kavanaugh's qualifications unspoken why she believes he has more moderate than he has been portrayed finally she turned to the allegations of sexual assault against him\nSenator Collins said she believes that Christine Blasey Ford is a survivor of sexual assault but she said the allegations against Kavanaugh for her fail to meet a standard of more likely than not\nIn value waiting any given claim the bits contact we will be ill served in the long run if we banned and that person is an innocent and fairness tempting though it may be\nWe must always remember that it is when passions are most in plain that hair and that is the lowest in jeopardy\nCollins was the last of the Republican holdouts to announce her decision\nShortly after she spoke Senator Joe Manchin of West Virginia the only Democrat to vote yes in a ...\nDidn't on line rhyme if we can then that person is an ad in and and the air that tend to think though it may be\nWe met always remember that it is when passions are lower in that area that is low in jeopardy\nCollins was the last of the Republican holdouts to announce her decision shortly after she spoke Senator Joe Manchin of West Virginia the only Democrat to vote yes in a procedural vote this morning that he will vote yet again tomorrow when the Senate is expected to hold the final vote mansions spoke to reporters over the shouts of protesters\nDuring the surveys with it such that people do indoors and very much and we have something to deal with this hadn't from\nAnd we're joined now by one of the senators who voted no this morning Dick Durban as a Democrat from Illinois and member of the Senate Judiciary committee thanks for joining us this afternoon good to be with you to start how are you feeling about today's development\nWell I'm disappointed I respect Susan Collins very much we're friends but I respectfully disagree with her I was one of the few Democrats said on the floor for entire statement out of respect for her\nWeekdays tend to who WB I celebrate hundreds of regional up in ...\nThe details on many more events check the w._b. I ate a scene calendar and catch up on ... at some easy I ain't don't belong gee slash and listen to a scene with Erica funky weekday mornings after the news it eleven on WB I Am Sam\nMisery recorded university where there is a recording of players will present Nicholas Nickleby a dramatic adaptation of the iconic Charles Dickens novel November eight fifty eleventh in the lemon theater four times in ticket information Mr accordion dot edu slash nickleby\nTaking a look now the forecast for the W. V. I. A. listening area will see mostly cloudy skies this evening along with a slight chance of rain after midnight with lower and lower fifties\nSaturday looks mostly cloudy with highs and the upper sixties will see mostly cloudy skies into Saturday Night with Lowes and the upper fifties Sunday looks partly sunny and very nice with highs and the upper seventies and Sunday night we'll see mostly cloudy skies with Lowes in the lower sixties\nThis is your arts and information station W. V.\nLike a a family\nSupport for NPR comes from this station and from a zoo zoom offers cloud video conferencing online meetings and the video conference room solution and one platform featuring digital video and audio would scream sharing account registration and more ebbs zone dot us\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cat series inside Trader Joe's\nAt apple pie cats or where pod cats are available more at Trader Joe's dot com\nFrom NPR News this is all things considered I'm Mary Louise Kelly\nAnd I'm Ari Shapiro a Congolese OBGYN at a woman who was once held captive by ISIS are now winners of the Nobel Peace prize the million dollar award goes to them for their fight against sexual violence during wartime un secretary general Antonio ... praised the pair today as defenders of human dignity\nThese price also recognizes countless victims ... we have to often be stigmatized even I'm so go up to them\nAs NPR's Soraya Sarhaddi Nelson reports the Nobel committee's choice this year was also a nod to the me too movement this year's winners\nAre Dr ... who is renowned for his treatment of gang rape victims in the Democratic Republic of Congo\nISIS are now winners of the Nobel Peace prize the million dollar award go to them for their fight against sexual violence during wartime un secretary general Antonio ... praised the pair today as defenders of human dignity\nThese fossils worth of Mars is golf was victims that only will we have to often be stigmatized even some of them\nAs NPR's Soraya Sarhaddi Nelson reports the Nobel committee's choice this year was also an odd to me too movement\nThis year's winners are Dr Denise ... who is renowned for his treatment of gang rape victims and the Democratic Republic of Congo and ... a former I said ... from the ... religious minority in Iraq who campaigns for survivors like herself\nBuried rice on her son who chairs the Norwegian Nobel Committee that hands out the prize praised the pair for shining a spotlight on wartime rape\nWe want to send a sense of awareness that\nWomen who comes to to talk of the population in most communities actually are used as a with the war and that they need protection under the perpetrators have to be prosecuted and held responsible so that actually is we believe that this is some of the men so\nPrerequisite for last thing piece to also include the rise of there when the ... of women\nSpeaking out comes at a price ... told NPR's tell me more in November twenty Thirteen gunman tried killing him and his family in their home a year earlier\nAutumn much tougher cause we refer ... and a woman for our most was abducted torture before being removed\nThe sixty three year old is the founder of the hospital and the Democratic Republic of Congo were armed groups have clashed for decades ... has treated thousands of survivors of wartime sexual violence\nMost of the time or reject funding is a project by communities to cause us to buy time so we have a cold I'm always Cornel just turned ... have been women why some folks are you ...\nBefore to talk to some of his\nFellow Laurie at ... is one of about three thousand is ET women and girls who were raped and abused by ISIS fighters mirage managed to escape her captors after three months two years ago at the age of twenty three she was named the UN's first goodwill ambassador for the dignity of survivors of human trafficking\nTo us and a ...\nTotally un Hannah last November that testifying against ISIS militants in courts in Iraq in Europe and seen them brought to justice has brought hope to victims like herself\nShe is the seventeenth woman to receive the Nobel Peace prize and a ton of Seventeen year history Dan Smith of the stock home international peace research Institute says he's pleased with the Nobel Committee selection\nYou go to most of most of them were to go to Britain\nThe committee's choices being linked to the attention fostered by the me too movement\nMeanwhile no Nobel literature prize is being awarded this year by the Swedish Academy due to a sex abuse scandal involving the husband of one of that committee members John Claude are no with sentences in stock home this week to two years in prison for rape psoriasis or how do you Nelson NPR News Berlin\nOkay if you went looking to trace the arc of that's me too moment we're living through you'd be hard pressed to come up with better bookends than the following today the U.S Senate voting to cut off debate on Brett Kavanaugh's nomination\nBy the me too movement meanwhile no Nobel literature prize is being awarded this year by the Swedish Academy due to a sex abuse scandal involving the husband of one of that committee members John ... are no with sentences in Stockholm this week to two years in prison for rape\nPsoriasis or how do you Nelson NPR News Berlin\nOkay if you went looking to trace the arc of the me too moment we're living through you'd be hard pressed to come up with better bookends from the following today the U.S Senate voting to cut off debate on Brett Kavanaugh's nomination to the Supreme Court and moved to a final vote\nDespite allegations of sexual assault in his past\nAnd one year ago today with the New York times broke a bombshell story\nThe times headline on October ... twenty Seventeen read Harvey Weinstein paid off sexual harassment accusers for decades or one of the two reporters who broke that Weinstein story was Jodi Kantor and she joins me now hey there\nHi how are you I'm well thank you I started here you get treated out today a picture of what you were up to a year ago today and it's it's a bunch of you all crowded around to the computer and the New York Times' newsroom about to hit ... on the Weinstein story and you write none of us knew what was going to happen on me some thought out into the world\nWe didn't my partner Megan too and I we certainly felt the power of the story as we were reporting it and because of the times was doing bigger investigation of sexual harassment me knew that this was part of the system and it wasn't just about Harvey Weinstein we were reporting on Bill O'Reilly and we were reporting on Fort factory workers\nBut you never know what's going to happen to an investigation wet it's when it's published and you know one of our editor it's I'm Matt party like to say as we were working on it he said hurting winds dean is not that famous and that is true aside from New York and LA and maybe D.C he really was not\nA household name 'em and and what we've seen happen is that not only did the me too movement which was founded years ago by trying to bark\nTakeoff globally but it just kept going and going\nAnd going there were so many times in the past year when I saw productions that this was going to burn out or you know the women were all than a simmered down or the news was finally going to stop and it never did and what's happening with judge Kavanaugh I think is representative of that there's a feeling that this reckoning only continues and grows bigger let me\nAsk you this if if Kavanaugh is confirmed a with a full Senate vote this weekend [noise] do you see that as a step back to the momentum of me too\nI think if he's confirmed it will be massive debate about what this means for me too movement and I think there are two contradictory answers both of which\nProbably have some validity I'll give you the ... the obvious one is that people will say this as a setback he was confirmed anyway ah these really serious allegations of sexual assault didn't matter um women were\n... you know ignored yet again this is a replay of any of the hell\nThe other argument however is that\nWhat especially what Dr Christine Blasey Ford did was really important uh that she spoke up in front of the entire country\nShe put high school on the table\nRight she made a case that these things that that happened in our collective you do have a bearing on the president and we also saw moments like with um the two protesters in the elevator with Jeff Flake where they were able to literally stop a national conversation for a second and say listen to these stories\nFootnote to this conversation before I let you go Jody we just heard there from our reporter psoriasis are hurting often but today also marks the order of the Nobel Peace prize\nUh that she spoke up inside of the entire country\nShe put high school on the table\nRight she made a case that these things that that happened in our collective you do have a bearing on the president and we also some moments like with um the two protesters in the elevator with Jeff Flake where they were able literally stop a national conversation for a second and say listen to these stories\nOne footnote to this conversation before I let you go Jody ... we just heard there from our reporters who writes are hurting also that today also marks the award of the Nobel Peace prize that prize is often Xena sending a political message\nUm and the word went to people working to stop sexual violence as a weapon of war I Wonder if that's one more book and if you like to the the global scope of this me to\nMoment that you hope set in motion a year ago\nI look up to the same news and had the same side I think it's a reminder scale I think it's a reminder of the global reach that and also media reminder perspective at a moment when we're all so immersed in the cabinet or news media this as a reminder that this topic is is even bigger than that in a way\n[noise] Jodi Kantor she broke the Harvey Weinstein story for the New York times one year ago today ... thank you thank you how much [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nBut if I'm up on me I felt panic ocho says I couldn't think clearly we couldn't help anyone but ourselves ocho turned saw a twenty foot wall of water and ran I didn't even think to save my father he says I chose father died praying in his home\nFifty yards from the windswept shell where I met a show and elected neighborhood advisory leader who lived here with some two hundred families\nThey're strip of beach is now a landscape of splintered wood and debris\nCorrugated metal up to your knees and huge slab of concrete and your the clothing and strewn\nAround the smell of dead bodies rises around the\nMall in tears search and rescue teams pokes through the devastation looking for victims of the sue now make\nFirst lieutenant a reef it's even moral says he and other Marines assist when the volunteers locate a body of a new ... speaking through an interpreter he memorial with our money assistance of sniffer dogs he and his team walk to the beach and smell\nWe smell with mouth\nBecause they already know who these men he smelled lesson animals and human bodies and if we want to smell and then we found bodies we will treat you did you discover anything here today [noise] ...\n...\n... to ... and now due to their\nEarlier do well in this in if they do with their bare hands they mutilate the newly discovered bodies or says ... heavy equipment residents from this area blanketed\nIn hopes of flattened homes are dismayed at these modest operations to salvage the dead one resident put it you need heavy equipment to really discover the death toll here and there jumped has seen repeated a pass policy [noise]\n\nOcho casual high roller just the lack of earth movers is just one of many short he and sounds like him have no drinking water one week after disaster struck he runs around town when he hears there's a food bank where he can eat\nThe beach that provided a livelihood two owners of many small cafes like himself is gone\nThis father of two ocho has lost everything including face that the government will help them in the hour of nice\nGot along well ... ... to ... I ...\nFeel slightly mounted he says because he got up until today we've had no help from the government as for grieving ocho says eyes let's go what happened to my father because I Know God loves him\nBut I Will get up again and start from zero Julie McCarthy NPR News Sao paolo Indonesia [noise]\nListening to all things considered from NPR News it's based on time the playoffs have begun and this year baseball's at the ancient rivalry is back the New York Yankees and the Boston Red Sox playing each other and the American league division series first time they have\nYou're listening to all things considered from NPR News\nIt's based fulltime the playoffs have begun and this year baseball's ethic ancient rivalry is back the New York Yankees and the Boston Red Sox playing each other and the American league\nDivision series [laughter] first time they have faced each other in the postseason since two thousand four\nAnd adding to the excitement both teams inter this postseason with a hundred or more wins well let's bring in ESPN baseball analyst Jessica Mendoza she is in Boston she is calling game one tonight for ESPN Radio hey there Jessica\nOh my gosh I'm Sorry Saturn already this town if you don't [laughter] I Am\nI'm guessing by the way it is not a quiet place to be today now so I've got to inject immediately just to give people a little sense of this rivalry there weren't you hear a little bit of this was a Yankees fan chanting right after advancing to play the red Sox\nJust coming to the safe to say this is a game back which are excited to be an\nOh absolutely I mean honestly they've played each other still not much throughout the regular season a narrative with this I mean you knew that the Yankees pretty much halfway through the season working at the end that walk I gained the red Sox were gone this historic winning pace to win the division\nAnd the hook for every baseball families that they meet in the division series are really like what you could argue two best teams in baseball plus the rivalry plus the fact that there's so many stars I mean yeah names on both of these teams\nIn Finland jet boil off the list for us of who you're watching for\nWell Chris Sale the big picture for the red Sox I mean everything lies on his shoulders and ... he could win a young with how good he's one of the best pitchers\nIn both lake then you've got the MVPs in ... marching is going on the red Sox who were the two best hitters you could argue in American League and in all of a school and then over the Aaron John and John Carlos stand you're going to get these two massive you're going to blink and be like are they football players that they baseball players\nAre you're seeing Goliath on one side and not even David and Goliath versus Goliath the two best teams that you could argue in baseball with the biggest names going head\nTo head and meanwhile you're talking players but let's check managers first second boost these teams are led by first time managers who used to play for their organizations\nSo Aaron Boone with my partner for the last three years of my closest friends you fat right next to him he every game on baseball now he's managing the gang he went from literally yes in analysts now managing one of the best teams in baseball and the alec Cora last worked with me any SPN with the bench coach the\nWorld they're winning Houston Astros in his first year the bench coach then goes manage that the red Sox have yeah first time managing but watch how they manage\nWhen their hearts are pounding you talk about that with players but imagine these two ex players they were doing something completely different now here they are and the biggest theories of their lives and they're at the helm\n[noise] and then talk to me about fans are we expecting to see Greek generous to the\nVoice of sportsmanship actually watching for bravo\nYou think they're yelling loud when the Yankees beat the AIDS green on Boston New York ... here in Boston I mean you hear it I mean people are talking smack left right I mean you're brave person just to walk around town\nHe talked about that with players could imagine you ... they were doing something completely different and now here they are in the biggest theories of their lives and they're at the helm\n[noise] and then talk today about fans are we expecting to see Greek generous to waves of sportsmanship ... actually watching for\nWere oh you think they're yelling loud when the Yankees beat the aide green on Boston New York ... here in Boston I mean you should hear it I mean people are talking Mack left right I mean you're brave person just to walk around town with\nAnything you know people are going to jump the army didn't it didn't happen [laughter]\nIt'd be very brave or just given a SPN jets given does that she is calling tonight ... Yankees Red Sox game from Fenway thanks Jessica thank you\n[laughter]\nYou're listening to all things considered from NPR News\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees and exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about ten college degrees that work\nJoined us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nSunday October fourteenth the three you get reimbursed that goes with which we don't\nResent a program that includes excerpts from his age works on the west Side Story as well as in the early ... ... ... like you to enjoy the contributions so don't need to make reservations", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Williamsport", "day": "05"}