{"month": "10", "state": "PA", "station": "WVYA", "content": "That helps people send money internationally three million people and businesses you transfer wise to send or receive and convert currencies and more than Seventy countries more at transfer wise dot com or from there and\n[noise] [noise]\nYou're listening to all things considered from NPR News supporting ... senior living in large summit providing solutions for seniors wishing to remain independent but eating some assistance with daily living the pines locally owned managed provides hands on care focused on the beach resident applied to collect some of the dot com or our family cares for yours\nThe opioid epidemic using a men's public health crisis of our time\nNow WB I as a proud partner with families service association of northeastern Pennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel in conference center in books very\nTwelve workshops focusing on different aspects of the opioid\nCrisis details in registration essay\nAnd he'd be a dot org\n... honey high can't pass the decision to make sushi support Kavanaugh will improve she's on the side of the president and you\nNeed in pro Trump North Dakota democratic senator up for reelection is under pressure over the Brett Kavanaugh nomination will she stay aligned with the president and vote to confirm Supreme Court nominee that's on the next MORNING EDITION from NPR News\nTomorrow morning from five to nine on W. V. I. A. F. out\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. I. dot org we're in Allentown Ninety nine point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n\nIs seven and that will give you a little bit you will be ... new jazz recordings including one from guitarist John Schofield\nBeen mixed bags starts a date with a set of eclectic Celtic music at eight thirty it's the weekly venerable music set this time some Jim ... recordings from decades past ended nine it's mixed bag new releases [noise] this is George Graham joined us tonight starting at seven of the [noise]\nFor the highest court on the line with a lifetime appointment I don't know what the rush\nIs Senate Democrats call fouls on how quickly Republicans want to push through Brett Kavanaugh's confirmation today's\nThursday October force and this is all things considered from NPR News\nI'm Mary Louise Kelly and I'm Ari Shapiro coming up President Trump argues that his Supreme Court nominee is being treated like he's guilty until proven innocent\nLater the Justice Department said Russia launched a cyber attack on us because it was embarrassed about allegations that it's athletes for doping\nEmbarrassed by that truth Russia fought back by retaliating against the truth tellers and against the truth itself and planetary scientist Sarah Stewart on her research into how the moon was formed it was a mental block to realize that China impacts could explain one of the biggest mysteries in the solar system NOW News\n\nLive from NPR News in Washington I'm ...\nSenators have big guns they review of the FBI's report into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh\nRepublican Senator Bob Corker says he's satisfied with the results of the probe and confident cabinet I Will be confirmed Senator Corker also said he's not upset by the fact that another judge Kavanaugh or doctor Blasey Ford were questioned the latest investigation\nI think they were playing I have no issue with that I Know the other side of the house trying to make that an issue I think the American people feel like they were\nPretty well interview one Democrat who have been undecided North Dakota Heidi Heitkamp now so she will vote no on the cabinet nominations\nMeanwhile demonstrations for and against the confirmation were taking place on Capitol Hill today police report about three hundred arrests NPR's Windsor Johnston reports the protests comes with Senate prepares to vote on Kavanaugh's nomination which has been marred by allegations of sexual misconduct [laughter]\nArrows Hector lately she'll bond says ending calving off to the Supreme Court sent the wrong message especially to young women\nIf we're leading agitated for one second that they\n\nAdd in nearby counter demonstration Francis Rogers says cabin always treated unfairly and ...\nAnd in nearby counter demonstration Francis Rogers has cabin always treated unfairly and deserved to sit on the court\nBy Texas has hit he suggests cabinet very similar to how there was a hit with us from the same time that procedural\nVote on Kavanaugh's nomination is scheduled for friday when Johnson NPR News Washington\nThe Trump Administration is accusing China of meddling in America's political process NPR's Scott Horsley reports vice president Pence delivered a sharply worded indictment of China's activities today\nVice president Mike Pence still doesn't Institute China wants to undermine President Trump has accused the Chinese government have using covert actors and propaganda to sway us public opinion before the November midterm elections as well as the presidential contest two years from now\nThat the senior member of our intelligence community told me just this week with the Russians are doing pales in comparison to what China is doing across this country\nFences charge of election interference was part of a broader critique ... growing power and assertiveness fences administration has responded with terrorists investment limits and the build up of the U.S military Scott Horsley NPR News the White House\nMember of people finally weekly claims for unemployment benefits at a nearly forty nine year low last week when what has been a relatively strong jobs market labor department's those initial claims for state jobless benefits fell by eight thousand to a seasonally adjusted two hundred and seven thousand the weekend in September twenty ninth\nA major sell off on Wall street today the Dow dropped two hundred points the NASDAQ was down a hundred and forty five points today you're listening to NPR\nSupport for NPR comes from an exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home by prescription only information at ... dot com good afternoon I'm policies are for W. V. like a new ...\nThe Pennsylvania state police say they regret any damage that occurred last weekend when one of their helicopters flew low over a tailgating crowd before the Penn State Ohio State football game sending tense and other items flying\nThe agency released a statement Thursday that says it's fully cooperating with an investigation of the incident by the Federal Aviation administration and it's doing its own review of what occurred videos posted on social media show people's astonished reaction if the chopper loomed over a revolution the deeper stadium parking lot Saturday hours before kickoff\nThe pilot apparently was attempting to get low enough that an unruly crowd could hear dispersal border state police say the pilot and supervisors didn't mean to disturb property the state Senate has passed and sent to the governor of bill designed to get guns out of the hands of domestic abusers W vi age Don Rooney has the details\nOne of the most important I think I take it in my career Pennsylvania state senator\nSenator Judy shrank joining with forty two of her colleagues to pass a bill that requires those convicted of domestic abuse or served with the protection from abuse order to surrender their guns\nSenate Democratic leader Jay Costa says the guns must be headed over to a law enforcement officer gun dealer armory or attorney within twenty four hours\nLegislation that really enhances the ability to remove weapons from domestic violence situation in the end it's gonna save countless lives senator\nOr hate what adds that the law will save the lives of more than just the people involved in the abuse\nAnd protecting law enforcement as she was\nJohn Rudy W vi news\nIn our regional whether it'll be mostly cloudy this evening along with the chance of showers and thunderstorms with Lowes in the upper forties or chance of rain is forty percent friday looks mostly sunny with high in the upper sixties it'd be partly cloudy on friday night and becoming\nIt's our chance of rain is forty percent friday looks mostly sunny with high in the upper sixties it'd be partly cloudy on friday night and becoming mostly cloudy overnight lows in the lower fifties and Saturday looks partly sunny in the morning then becoming mostly cloudy with high is in the upper sixties I'm paws are for W. V. on a news\nSupporting W. V. I. A. F. N. C. back offering solutions to grow your business F. M. C. be simply a better business Mac member FDIC equal housing lender\nFrom NPR News this is all things considered I'm Ari Shapiro\nAnd I'm Mary Louise Kelly the fight to confirmed Brett Kavanaugh Supreme Court could be over soon and the Senate prepares for a procedural vote tomorrow and possible final vote on Saturday\nAll today senators have been taking turns viewing one copy of the FBI report its latest investigation into Kavanaugh following allegations of sexual assault against\nThe nominee Democrats have criticized the investigation as incomplete an rushed Republicans including Susan Collins and Jeff Flake who could decide Kavanaugh's fate have described it as thorough we're joined now by Senator Patty Murray Democrat of Washington who has said she'll vote no on Kavanaugh welcome back to all things considered\nWhen they said talk today I understand you've seen the report can you give us your reaction\n[noise] well I was really frustrated and disappointed by the report that we were given a clearly the FBI was told to very narrow the scope of people that they talk to I Can't tell you what is in the report but I can tell you that a credible number of\nPeople that both I'm Dr Ford and Mr mirror gave to the FBI or that could corroborate their stories were not interviewed you say\nYou should be up there was clearly told to narrow the report the White House and Republicans in the Senate have said the FBI was given no restriction\nWhen I Know from the FBI that they are when they're told debate and allowed to be very thorough following leads wherever they are to take them to conclusions and from what I saw today in the narrow scope that they've given um that that could not have been accomplished particularly because we know\nThat the names of people that both ... and Dr Ford gave them were not followed up nor were a number of tips that came into the FBI\nSo Republicans have said today that there is nothing in the report corroborating the allegation of get a gal allegations against Kavanaugh sounds as though you're saying true but only because they didn't look for them\nWell I mean that's part of it and and what we do know about um situations like this where someone is a victim of sexual assault\nThat they often do not tell anybody in the room I I've talked to so many people say it is absolutely no surprise that Dr Ford didn't tell anybody at the time in fact she told us that how traumatized she wasn't it wasn't really until years later\nOr where she told a therapist or her husband talked about it I've had so many women tell me their stories in the airport in a grocery store over the last week or so\nThat that's exactly what happened to them and I think don't have to be credible and understood that ... if you want to get a correct response and understand the full story you can't just ask someone who is in the house at\nSupport for WBAI it comes from a new super a family owned and operated Subaru dealership since Nineteen Seventy ... super who's committed to your satisfaction but you're purchasing ownership experience mucus super rooted weapon was for more information maneuver Subaru dot com here's a look now at\nThe forecast it'll be mostly cloudy this evening along with the chance of showers and thunder storms with Lowes in the upper forties or chance of rain is forty percent will see mostly sunny skies on friday with highs and the upper sixties it'll be partly cloudy on friday night that'd be coming mostly cloudy overnight with lower and lower fifties Saturday looks partly\nSunny in the morning then becoming mostly cloudy in the afternoon with highs and the upper sixties and Saturday Night looks mostly cloudy with Lowes in the upper fifties this is W. V. I. F. M.\nSupport for NPR comes from the station and from Amazon Prime video presenting their return of the man in the high castle where America's history is under siege but the resistance rises to fight for the world they want the new season premieres this October on prime video\nAnd from staples with printers printer ink and toner cartridges for home in business and in store print shops for customized presentations booklets and manuals more at staples stores or staples dot com staples\nNPR News this is all things considered I'm Ari Shapiro and I'm Mary Louise Kelly\nThe U.S joined European governments today in accusing a group of Russian military intelligence officers of more cyber mischief the indictment from the U.S Justice Department describes hacks against sports stars and against anti Doping Agency in the U.S and and\n... the indictment from the U.S Justice Department describes hacks against sports stars and against anti Doping Agency in the U.S and in Canada\nIt also says Russian targeted a Dutch group that was studying the poison used to try and kill a former Russian spy\nAnd beer national justice correspondent Carrie Johnson was asked the Justice Department today she is most days and she is back here in the studio now with the tail to carry I'm Mary Louise okay so tell me more about the Russian intelligence officers being charged unwind now it's time yeah the defendants are setting current Russian military officers today's charges include conspiracy\nAnd money laundering a few of the defendants are also charged with wire fraud or identity theft\nCourt papers say some of the cyber activity here started in twenty fourteen when allegations about Russia cheating to avoid drug tests for the Olympics first came to light\nBut some of the behavior extended up till this summer in twenty Eighteen oh so it's just a very ... yeah when the hackers were in touch with reporters who wanted access to documents these hackers got their hands on and I gather all\nOf these seven Russian officers are in Russia a and there is no us extradition treaty in place so why bother charging them well FBI\nOfficials point out sometimes they get lucky these guys traveled to European countries where there are extradition treaty is in place but even if that doesn't happen that the OJ says its practice of naming and shaming does make a difference because it shows the hackers\nAmerica knew how to find them and describe what they did and sometimes other parts of the government imposed sanctions on individual hackers or the people who fund them\nThe assistant attorney general for national security John ... told reporters that Russia launched the cyber effort because it would embarrass by allegations than it's athletes were of eating drug test\nEmbarrassed by that truth Russia fought back by retaliating against the truth tellers and against the truth itself\nNow Mary Louise the Justice Department says it's exposing those activities and that this indictment tell the real story\nI was asking you earlier about the timing of these charges carry and I have another question along those lines the U.S announced these charges just hours after Britain and another ... announced their own accusations against Russian is that coincidence or coordinated\nVery much coordinated the Justice Department actually think it's international law enforcement partners for their help\nAt the press conference here in D.C today they highlighted how the Dutch were actually able to disrupt the hacking plot in April where for Russian men carrying diplomatic passport traveled to the Hague and rented a car and then fill it with electronic equipment they parked that car next to the organization for the prohibition of chemical weapons\nThe goal was to penetrate the wife fi networks there but the Dutch we're on to them for the men abandoned the car and left the country and this was at the same time this organization the O P cw was examining of substance use to poison a former Russian military intelligence officer and his daughter and the u._k. this year\nSo the ... exact okay\n... I mean here's here's my big question which is what to these charges tell us if anything about the ongoing effort to protect us elections I mean this is all you know something we're talking about still because of twenty sixteen and hacks against democratic ah servers and institutions\nAre we any closer to knowing about efforts to protect the upcoming midterm ... further Russian interference\nVideotape wouldn't touch that question today but there is something worth pointing out here the new indictment does include three of the same people accused earlier this year of hacking the twenty sixteen presidential election which makes the question or they added again if so the U.S government is just single them out all over again\nAnd one unusual things stood out this morning the DOT actually had a warning for news media both here and around the world be careful\nUS government is just single them out all over again and one unusual things stood out this morning that the OJ actually had a warning for news media both here and around the world be careful they said about using material that comes from these hacks it can be false are misleading or the hackers can have a sinister motive at the Russian government allegedly did in this\nCase NPR's Carrie Johnson thank you my pleasure\nBrett Kavanaugh's confirmation to the Supreme Court could come down to the votes of just a handful of senators they are weighing that decision after getting look today at the FBI's report on the sexual assault allegations against capital what are the most watched senators and that group is Joe Manchin of West Virginia He's a red state Democrats who have touted his working relationship with the president\nAnd he's fighting to keep his seat in a state that Trump won overwhelmingly NPR's Sarah McCammon has been talking with voters in Charleston West Virginia\nAcross the street from Senator Joe Manchin Charleston campaign office several dozen activists gathered in a park last night standing in a circle and lighting candles [noise]\n\n\nThey help signs with slogans like junk they know Joe and cabbage knew that you know ... some more light green armband assigned they've\nSurvived sexual assault local activists carry Joe grace was arrested this week during a sit in at mansions office here she says she's tired a lot of it is I'm exhausted because I sat in that office over there and so almost two o'clock in the morning\n\nActually kind of imagine to get off the fence about judge Kavanaugh across town at the county Republican headquarters volunteer Nancy ... sees having a in a totally different light I like him\nI think he's an honest\nIndividual and I think he has suffered his family has suffered [noise]\nThat perhaps some time in this woman's life something has happened\nBut I don't believe that Brett Kavanaugh was involved in\n... late afternoon stuffing envelopes for mansions Republican opponent West Virginia attorney general Patrick Morrisey mansion is a long time figure in West Virginia politics who's sided with President Trump on several key votes including his first Supreme Court nominee Neil Gorsuch\n... said she wants to elect a Republican who will back Trump more reliably than mansion she's wondering where he'll land on cabinet and\nI think well I think he'll do what Chuck Schumer tells him to do\nThe confirmation fight may be firing up each party's people grassroots activists but in downtown Charleston as workers stepped out for lunches and smoke breaks other issues with all of mine\nAt a diner Eddie clean says he's skeptical of the allegations against cabinet and he's more worried about issues like the opioid epidemic and jobs queen describes himself as a Democrat but supports Trump\nAnd see the barges going down the river was gold gold ... Israeli cold [noise] just they live in\nQueens says he's leaning toward voting for more is the but he's watching how senator Manchin vote on Kavanaugh\nAt a nearby farmers market Jennifer ... says she's supporting mentioned because she aligns with him on other issues and she wouldn't want to be in mansions shoes right now the situation I Would not want to ban\nMentioned supported calls for an FBI investigation into the cabinet allegation and said he would announce his decision after seeing those results [noise]\nHe's no doubt also seeing the results of polls one this week from great television favored mentioned by several points\nMore popular than Morrissey or mentioned here in West Virginia\nSpeak from great television favored mentioned by several points\nMore popular than more in the or a mansion here in West Virginia Brett Kavanaugh and Donald Trump Sarah McCammon NPR News Charleston [noise]\n\n\n\nThis is NPR News\nIs a recording university or high school students with their parents can learn what makes ms recording of special at an open house on Saturday November ... tour campus and learn about the challenging academic programs financial aid and award winning sports programs registered ms recorded dot edu slash open house\nSarah Stewart likes to think about what happens when planets collide she uses to actual cannons to simulate those massive impact here's one firing in her lab at UC Davis\nTo simulate those massive impact here's one firing in her lab at UC Davis\nHer work earned her a spot in this year's clash of MacArthur fellows many let's call it the genius grant for years experts of thought the earth's moon formed after a large collusion knocked off a bunch of rock Stewart told me her research suggests a different story\nDuring planet formation when two bodies collide there's so much energy released that most of these bodies are vaporized that means that a rocky planet like earth is mostly rock vapor\nWhat his rocket vapor and and what does it have to do with our moon\nRocks paper is taking the rocks that we stand on end heating it up to the point where it becomes the gas\nAnd when that occurs the earth becomes much larger because vapor is much less dense ... and it extends out into this enormous object hundreds of times larger than the earth today and we proposed that our moon grows within the rock vapor of the earth after a giant impact\nSo the moon actually came from the earth\nThe moon grows within the rock vapor of the earth and that gives the moon the same chemistry as the earth\nHow much of a revelation was that I mean how different was that from what scientists used to think about where the moon came from\nIt was hard to imagine that things could be so different and it was a mental roadblock to realize that giant impacts transformed a planet into an entirely new type of object and that could explain one of the biggest mysteries in the solar system\nDid you have to overcome some mental road blocks of your own given what you've been taught coming through academia\nAbsolutely and this is when we had a bona fide eureka moment my graduate student and I are sitting in front of a computer looking at the calculations that we had done and realizing that all the assumptions are actually violated by what we're looking at I think\nIn any field there's a degree to which people have to be taught to trust themselves and maybe women even more than men are taught not to trust themselves was it difficult for you to have confidence that yeah ... I've demonstrated here actually is real\nScientists are terrified of being wrong [laughter] of course I didn't want to put something out there that was really a crazy idea and so we did have to convince ourselves first\nHow long did that take you to convince yourself well\n[laughter] from the eureka moment to the published paper was four years so I think we had a lot of internal debates are amongst the co authors and a lot of debates at conferences on the origin of the men\nSo do you expect if ten years from now I pick up a high school textbook it's going to have the results of your research there in the chapter on how earth's moon was formed\n[noise] I certainly hope so I Am very excited about this idea and I hope that it leads to test where we can prove whether or not the moon actually formed in the earth vapor\nWhy are these kinds of questions relevant to ordinary people who are not scientists why does it matter where the moon came from\nFor example the creation of the men was the last major event and the creation of the earth and it was such a violent act it left the earth and the state very different from today\nUnderstanding how earth became the habitable planet that it is is directly linked to this final event and its creation\nYou're saying it's part of our story absolutely\nHow did you get interested in planetary collisions\nI wanted to study planet formation and in the process I learned that collisions were the major physical process to grow planets and I had the opportunity\nTo study planet formation and in the process I learned that collisions were the major physical process to grow planets and I had the opportunity to study them in the lab and I've been doing it ever since\nWe've kind of kid who was always going in the backyard staring at the stars\n[noise] I had my nose in books imagining space travel I very much enjoyed science fiction\nSo for you is studying plan up to fall back to actually traveling through space\nI might be too terrified to actually go up in space [laughter] exploration and our imagination and through the laws of physics has been exciting enough for me [noise]\nSarah Stewart is a planetary scientist at the University of California Davis and two days she was named to the new class of MacArthur fellows congratulations and thanks for talking with us thank you\n\nAnd\nYou're listening to all things considered from NPR News\nDairy farmers are gathering in Madison, Wisconsin this week for the world dairy expo\nThey're meeting comes on the hill on the heels of the new we negotiate a trade agreement between the United states Canada and Mexico the one that replaced NAFTA\nAnd fixing the U.S dairy market was a priority in that agreement Wisconsin Public Radio's her hope curbing caught up with dairy farmers to ask how they're feeling about the new trade deal\nIn the exhibition hall at the world's theory X\nHundreds of people from across the country are checking of loose with everything from robotic milking machine to cow seemed are where the dairy industry has the latest and greatest on display today for dairy farmers are still facing the fourth straight year of low low prices is the biggest\nShow where Syrian candles on the other set\nTheory farmer ... she just this year's ... dairy farmers are facing the fourth straight year of low price\nIt it's um what's going to make or break us and hopefully with this new train at all not breakouts it'll help us keep engineering farming C. average dairy farm has struggled\nTo make a profit for years the price farmers are paid for their milk drop from twenty six dollars for one hundred pounds of milk and twenty fourteen she just sixteen dollars now\n... and others here say the opportunity to some more theory to Canada\nUnder the new U.S Mexico Canada agreement could help us farmers do marginally last year in Wisconsin dozens of farmers were left without a milk buyer when a regional company suddenly lost sales to Canada that's because candidates dairy industry implemented a new pricing policy it called class seven\nThe goal was to boots domestic sales and that hurt competition from the U.S imports well do sales only represented about one percent of Wisconsin's annual milk production the shock obscene farmers lose their buyers overnight sparked national efforts to oppose candidates move\nBy the time the Trump Administration open NAFTA negotiations\nFixing the dairy market was a top priority and it wasn't until Canada agreed to end the controversial policy the new trade agreement was reached mark Stevens had had steering policy analysis at the University of Wisconsin Madison he testified wasn't really about trade between the two countries it was about other markets to\nJanet of began to produce more skim milk powder under the class of them and sell that product overseas and that began to compete directly with us exports sales\nBut David Greene with the group dairy farmers of Canada argued that over production by us dairies is a bigger issue\nYeah Wisconsin usually more milk than them all out at ... and so whatever access you know\nIt's a bigger issue yeah Wisconsin which is more milk than them all out of it does and so whatever access you know has been given to our market ... it's not going to really change the surplus milk situation to us\nAnd some American farmers are starting to question whether the new trade agreement will really be all that helpful Wisconsin dairy farmer mark Heinz lost his firing last year because the candidates new but he says fixing trade with Canada will really help make its financial situation better\nThere's some pretty major problem in the dairy industry and an agriculture in general right now so this is certainly a band aid and not affects\nHindsight's issues like the nonstop growth of us know production and the disconnect between what farmers received their milk and prices at the grocery store\nWith the Trump Administration calling the new trade agreement a big win for farmers he where he said the systemic issues will be overlooked again once the trade deal is signed for NPR News I'm hope Kerwin in Madison [laughter]\n\nYou're listening to all things considered from NPR News support for NPR comes from Pennsylvania was October SPA one month celebrating Pennsylvania's locally grown and crafted watch with special things to do taste and discover all across the state more\nInformation can be found P. A. Y. months dot com support comes from a while for say October's national seafood ... a meal plan that includes fishes heart healthy one while for salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for seven dot com\nWB I we believe our society needs independent enterprising in depth journalists\nWe believe are regional community needs a well informed civically engaged public\nWe believe our area needs public media to highlight our local cultural scene and keep in touch with the world\nIf you believe also there are many ways you can help us with this public service mission\nGet your business to sponsor WB I make a memorial gift donates stocks bonds or mutual funds for a tax advantage include WBAI in your will and leave a legacy", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Williamsport", "day": "04"}