[{"month": "10", "state": "NY", "station": "WAMC", "content": "To businesses government and not for profits serving the capital region for over fifty years U H y dash us ... pounds [noise]\nThis is Northeast Public radio WAMC F. M. H. D. Ninety three Albany W. R. UNH the Ninety points reruns from Utica W. M. K. E. H. D. nine point nine Kingston W. O. F. R. H. D. Ninety One point seven Middletown WC yell each dean Ninety One point nine Plattsburgh WC A. N. H. D. Ninety three point three ... three nine ...\nW am cue HD won all five one great Barrington W. W. E. S. H. D. eighty nine up just go to U. N. D. H. D. Ninety point one Stanford W and our eighty eight point five rooster WAMC am fourteen hundred Albany [noise]\nFrom public radio international this is living on her and\nAmid constant conflict between Palestinians and Israelis lack of water the Gaza Strip causing a humanitarian crisis it's a ticking time\nCondemning disease spreading gossip [noise] people will stop moving to the census was stone rockets still be moving with empty pockets desperately calling out the clean water also a new study shows compelling evidence of a relationship between eating organic foods and lower cancer\nRisk what this study tells us is that when it comes to the risks for cancer an organic diet makes ...\nA cleaner set of ingredients closer to nature fewer additives less processing is probably in general playing a role here on those stories and more this week on living on her around [noise]\n\nFrom NPR News in Washington I'm nor rom President Trump is accusing reporters of trying to use the sinister actions of one individual to score political points uh fifty six year old Florida Man it's in custody charge with sending bombs two prominent Democrats this week\nThe president was campaigning for Republican candidates in North Carolina hours after Caesar say ox arrest yesterday before he left Trump said\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com that prevented\nTalk about was that had rightfully so it was a big thing rightfully so but now we have to start at the moment\nThe president also said he doesn't plan to contact former President Obama or anyone else targeted by the pipe bombs Obama campaign for democratic candidates in Michigan and Wisconsin yesterday when Kleinfeld are of member station WBUR ... reports\nObama told a crowd of thousands that Detroit's Cass technical high school that Republicans are following a familiar play book he says a GOP wants to scare people into voting for them by stoking fears over the Honduran migrant caravan heading towards the U.S and Obama says President Trump is continuing a pattern of making false promises\nThat he he was going\nElection in fashion before they're like [noise] the\nDemocrats hope Obama will energize voters especially in urban areas that failed to turn out during the past presidential election for\nNPR News I'm Quinn Klinefelter in Detroit\nSeveral thousand Central American migrants continue to walk north through Mexico saying they intend to seek asylum in the U.S many of them have rejected Mexico's offer to apply for refugee status in Mexico's southern most states\nSince early October federal authorities had been releasing hundreds of asylum seekers and families who cross the border illegally in Arizona\nFrom member station ... in Phoenix\nMatthew Casey reports setting volume in a court settlement that limits how long children can be detained federal immigration authorities started releasing families to churches and activists in Arizona\nNow the releases are also happening in Texas and California pastor bell Jenkins founded a San Diego based coalition that can provide about one hundred shelter but he says the group may need five times that number\nIf we could turn over the ... you know every two nights we probably could handle it we're we're going to happen if people are going to get stuck in the system so to speak\nJenkins says families stay at the shelter longer when sponsors back out his coalition is trying to find more beds for NPR News I'm Matthew Casey in Phoenix and this is NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting and the state of Joan crock who's request serves as an enduring investment in the future of public radio and the Robert Wood Johnson Foundation and R. W. J. F. dot org\nThis is WAMC regional News I'm Lucas Willard former vice president Joe Biden was in Kingston friday to stump for nineteenth congressional district candidate Antonio Delgado as part of Biden's effort to turn out and vote for democratic candidates across the country more from Hudson Valley bureau chief Alison done\nBiden addressed a large crowd of Delgado supporters saying the November ... mid term elections are like no other Bush is about\nThe character of the nation [noise]\nI appreciate the fact\nLong as I'm deadly earnest about this Delgado faces freshman Republican John Faso in a statement said he is pleased to welcome tied into the district adding quote I appreciate his contribution to American political life over the past forty years and his ...\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog for his dot com\nThe federal receiver overseeing to Vermont ski resorts after the owner was accused of massive fraud has built over five million dollars\nA Caledonia and record reports us district court judge daring Gales approved Michael Goldberg fifth expense report which built over a one million dollars for a seven month period the receiver says you reduce billing rate for himself and his employees in the case\nThe forecast rain today highs and the lower forties rain likely tonight with temperatures around forty degrees and cloudy with a chance of showers tomorrow hides in the upper forties support comes from the ... annual Woodstock invitational ooh the or showcase\nHandmade acoustic guitars and string instruments concerts clinics and more through tomorrow at the ... theater and utopia sounds stage Woodstock invitational dot com\nWe now return to living on earth it's six minutes after six o'clock [noise]\nFrom the Jennifer and Ted Stanley studios at the University of Massachusetts Boston this is living on Earth I'm Steve her with a major study published in the journal if the American Medical Association has found what many people have long suspected eating organic food appears to reduce the risk of cancer\nAmong some sixty nine thousand people tracked by French scientist over several years those whose diets contained more organics had about twenty five percent fewer cancers overall with thirty five percent fewer breast cancer as an older woman and the more than Seventy percent reduction in focus\nThis study suggests but does not prove that pesticides and other chemical residues in foods cause cancer but there's no reason to wait for more research when it comes to making food choices advocates say including the president of the environmental working group can cook Ken welcome back to living on earth thanks Davis great to be here\nSo when this study came out it showed strong evidence in support of the long held beliefs that organic food is better for us how do you feel now that the study is out there\nWell you know I guess I feel as if we should have been doing studies like this a long time ago we really do need to be much more careful about the low levels of carcinogens that we still have in our diet the fact that several cancers here\nDid show or a market decrease to me tells me the organic food is probably targeting the mechanisms that are associated with those cancers and the other thing that's interesting\nWhile they speculated about pesticides there are other chemicals in non organic foods that are not allowed in organic certain chemical dies a certain color rings a certain flavorings that simply are not allowed in organic food manufacturers\nThat in addition to pesticides may be another reason why there's lower cancer rates amongst these are mostly women who are eating more organic food\nAnd of course if the product is made from genetically modified organisms it's not allowed to be labeled as organic\nIs true as well and there really are not very many chemicals that are allowed in organic manufactured are packaged food compared to conventional where there are thousands so there are lots of questions raised by this study but to me it goes back to the basic point\nStreaming support for WAMC comes from my dog harness dot com and no ... no ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nWell how how 'bout remark that cliche for extinction fair enough Peter Peter doctors with environmental\nHealth News at the age of ... Oregon daily climate or we'll talk again real soon\nAll right Steve thanks a lot to talk to you soon\nAnd there's more on these stories at our website eh Lolita or G. and if you have a joke about climate change tell us about it right is it comments at eh Lolita or gee that's comments at ... dot org\nComing up trying to make do with little freshwater in the Gaza Strip that's just ahead on living on earth to\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend of St Louis for the the worst\nStreaming support for WAMC comes from my dog harness dot com and no choke ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog for his dot com\nOf miles of trails for hiking ... outdoor exploration L. O. G. L. C. dot org\nSteve Lewis Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford in Springfield offering new sue Bruce plus used cars trucks and SUVs Steve Lewis Subaru dot com\nSupport for WAMC comes from leads to lock the passage scenic by way of supporting the war and burg Historical Society graveyard walks down to dinner with the dead\nToday through Monday in Orangeburg passage poor dot org I Love New York and from Adam spare acre farms became sea Kingston Newberg ... local apples pumpkins and squash Adams grown moms plus Moore may groceries meets ... deli bakery and seafood Adams forums dot com\n\nIs living on Earth I'm deeper would\nKnow where is the seemingly endless crisis between Israelis and Palestinians more acute than the Gaza Strip a hotly contested piece of land just twenty five miles long and roughly five miles wide\nThousands of buildings were destroyed and more than twenty two hundred thousands were killed by Israeli forces and the twenty fourteen war with Seventy one death on the Israeli side\nTwenty one years ago we sent reporters Sandy ... to ... to document the acute shortage of drinking water there and back then he found that eighty five percent of wells were to contaminated for human consumption\nHe recently returned and now that figures up to Ninety seven percent\nThe shot the refugee camps stretches for about a mile Gaza's Mediterranean coast ... beach in Arabic\nBut it's hard to find a pool ocean breeze here\nThe eighty seven thousand people squeezed into half a square kilometers cement block dwellings or all refugees and their dissent [noise] of Gaza's nearly two million people three out of four\nRefugees families forced to flee their towns and villages during the creation of Israel in Nineteen forty eight\nAnd an anti again back to them and then there was three when her family was driven out of the village of for momma\nShe doesn't remember much besides the refugee camp which she now lives with three younger generation they share three small rules\nAnd all that if he said no matter\nWhere you meet you may God give you\nCan do today the entire family greets us in the front room Nineteen members of the named them family most sit on the floor ... checked walls they introduce themselves\nNow on the man and\nA half was\nToday it's Ninety four degrees and with\nSo and then again if I could have had it gets\nHot suffocate [noise] there isn't enough space to sleep\nThere's no space to do can you see\nThere is no fan because electricity in Gaza comes just four hours a day\nTo ... to ...\nMy mother got Owens water\nIn the city forget about it there isn't any is [noise]\nWater that comes out of the tap is way too salty to drink\nThat's because the aquifer below our feet has been over pumped so badly that sea water is flowing is\nSort of ... families there\nStreaming support for WAMC comes from my dog harness dot com and no choke nope ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tell you what your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com [noise]\nFor most people in Gaza it's not quite as dire [noise]\nTwo thirds of guys let's get water delivered by truck desalinate water is pumped into roof top picks fire hose [noise]\n\nBut when it comes to water and got the better off is only by degree the dissemination of water is unregulated and because of this water has virtually no salt it's probably just tickled contamination says former Palestinian deputy water minister rep he al ...\nAnd when does this door at the a household would have done for more than the indies didn't this liberal diminishing at each of the ...\nThat seven and ten people basically drinking poop or ... if you prefer and in terms of parts per million UNICEF Gregor ... says the only really safe\nLevel is zero already the presence of one is too much wind because of the moment you have one you actually have a potential to gross depending then how long you've got your will just sitting in the tanks\nI caught up with Greg or is he rode out to inspect new water project than southern cause\nThe longer they all that the more you could then produce all you've got all sorts of other than a little uh animals that actually start growing in your water and it just gets worse when children drink this water they start getting the runs switched you have repeated diarrhea the end result is actually your child would not grow\nTo its full potential you actually see children being stunted what it also means is actually put them in in terms of brain development you would actually have a measurable impact on the issue of those children as they as they grow up\nLate last year a British medical journal found an alarming magnitude stunted among gossip as children\nGossip pediatrician Mohammad Abu ... says there are so many other\nYeah how'd you how what is in the summer to be\nThe host but the debate it of course but there is very very very busy\nDoctor a boost ... takes me through the children's ward and hold Nasir hospital in Gaza City structures sawdust and touching a baby girl hooked up to a respirator\nShe looks even tiny or some of these children have recently had heart surgery\nOverwhelm doctor says he's seeing a sharp rise he's ... children like gas to enter right from the dirty water\nBe suffering from the division of for one more thing from day out of here from fever\nAnd because of the extremely high nitrate levels of water the doctor is seeing other effect\nWe have and should have been getting is not working\nBefore he tells me they had Fifteen or twenty cases any given time now it's forty\nIf it did we have and that was but that didn't baby and machine in him ... and the number is ...\nSo our cases of something called blue baby central\nThe high nitrate levels deprive the blood of sufficient oxygen\nStreaming support for WAMC comes from my dog harness dot com and no choke nope ... dog harness invented to make it easier for both dogs and humans no need to pull no need to tug walk your dog with love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com yeah five kids is in one ear\nSo sharp prices know Castro into writers stunted growth renal failure and hypertension from those high nitrate levels blue baby syndrome and Dr ... says he's seeing big increases in pediatric cancer whether from water effects of three wars he doesn't know\nBeyond the lack of water he's seeing the effects of malnutrition which he blames Israel economic blockade\nNutrition is very bad [noise]\nDoes afflicted baby before series is we don't have any bishops lived in London a division now is so big it was ... you know ...\n... is severe malnutrition sometimes a newborn infant just skin and bone doctor says the law do you think losing more and more [noise]\nPalestinian health ministry data backed up Dr ... some years observation they know a doubling of severe cases of diarrhea especially in children and serious increases in kidney disease\nAnd and food and water borne diseases including hepatitis a salmonella and typhoid fever\nThe British medical journal Lancet corroborate the shortage is a clean safe water has contributed to a sharp rises and diarrhea among young children in the Gaza Strip\nDiarrhea is the world's second biggest killer of children [noise]\nIn the distance we hear an explosion\nMuch pauses for a short moment that ignores it he says I come here just forget everything [noise]\nLiving in I'm Sandy Toland in the Gaza Strip\n\n[noise]\nComing up the necessity defense for climate civil disobedience that's just the head on living on earth\nFunding for a living on earth comes from you our listeners and United Technologies combining passion for science and engineering to create the illusion designed for sustainability in aerospace building industries in food refrigeration\nUPC companies such as Otis carrier Pratt Whitney and teach the Arab states to students are helping to move to world forward\nYou can learn more about the United technologies by tuning into the race to nine billion hot cast listen at race to nine billion dot com that's raised to nine billion dot com\nThis is P. R. I. public radio international\nSupport comes from Saratoga bridges Boston Spa community resource for people with disabilities and their families supported employment data services and more Saratoga bridges dot org\nThe center for natural wellness school of massage therapy offering fulltime at part time massage therapy programs classes begin this February C. N. W. S. T. dot com for more information\nFulton County Center for regional growth seeking development companies to execute retail end housing development projects in Fulton County S. C. C. R. G. dot org\nStep up presents experience Hendricks the music and the legacy of Jimmy hendrix at the palace theatre April third tickets on sale now at ticket master dot com\nAnd from South ... spirit shop located in the southwest corner of the Berkshires specializing in curated small production wind and regional handcrafted spirits and beer real wine for the people south ... spirits dot com\nIs living on Earth I'm speaker would on October eleventh with twenty sixteen climate activists Emily Johnston and that clap steam took bolt cutters to chains on to enrich pipelines in northern Minnesota [noise]\n\nThen they turned emergency shut off the shelves for lives for and sixty seven [noise]\nWhy don't they have the two women and three other so called valve Turner's temporarily stop the flow most of the oil coming from Canada's tar sands that day a protester who acted in North Dakota spent months in prison at the pair who acted in Minnesota also face\nStreaming support for WAMC comes from my dog hardest dot com no choke no poll dog ... invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog Curtis dot com\nOctober ... in the middle of the trial or Minnesota judge abruptly acquitted them of all charges and they joined me now from Seattle, Washington welcome to living on earth thank you thank you very much Dave\nHow does it feel to have these felony charges thrown out on a\nI think we all have mixed feelings about that I've been feeling guilty with you know happiness that we are not going to jail and quite frankly that I'm off bail and may have the opportunity to do several disobedience again because I\nHad to be very careful while out on bail because if I got arrested it could be revoked and I could spend all of my time in the Clearwater county jail awaiting trial\nBut um you know we're disappointed that we did not get to put on the climate necessity defense that we wanted to with you know the very well respected experts that we had lined up to testify for like Dr James Hansen you know former climate scientists from Nassau and Bill McKibben so it's a mixed bag\nEmily yeah I I'll go being stronger about it than that and say that you know I was really heartbroken not so much by the acquittal of course which is a good thing it was the sort of second best scenario we could have had\nBut by the denial of our expert witness testimony on climate change and on civil disobedience you know it would have been the dream trial it could have made a really big difference so that thought that this kind of trial might happen\nIn that courtroom in front of those jurors and that might make set a precedent that would really have an impact nationally on the climate change debate seemed like a really important thing to me and of course until four days before trial began it looked very much like it was going to happen\nSo you know it's it's a real shame that that it did not\nKnow as I understand that you heard the judge to let you use the necessity defense\nYes and he had granted that to us back in October of twenty Seventeen and in fact he had copies of our expert witness list for a for about the last year and a half\nSo at any point in that time period he could have constrained us constrain the number of witnesses said you can't talk about this or that and he chose not to the fact that he did that for days before trial began with stunning at the lawyers who couldn't have been more surprised we couldn't have been more surprised\nThat moment he'd been very very reasonable and it seems like all systems were go and to be clear the thing about that that was so striking apart from its sudden his was the fact that normally speaking defendants do not have any burden of proof it's it's the prosecution that has a burden of proof normally\nBut because we were going to use a necessity defense and say that what we did you know was essentially a necessary under these circumstances that we find ourselves in to prevent the greater harm of climate change\nWe did have the burden of proof and all of a sudden he knocked out our ability to defend ourselves essentially because who is going to listen to a poet a retired lawyer and a software engineer from Seattle\nOn climate change you know we're not scientists we have no authority so no matter how articulate we had been it wouldn't have had anything like the same impact as the former head of the NASA Goddard Space Center talking about climate change and how urgent it is or about Minnesota scientists talking about how urgent it is and how much is already changing in Minnesota\nSo you know again we had no ability to defend ourselves without experts to testify to those things\nAnd the software engineering or co defendant was\nWas ... a young father of three who was our support person or support people were all arrested they win\nStreaming support for WAMC comes from my dog hardest dot com and no choke no poll dog harness invented to make walks easier for both dogs and humans no need to pull no need to tug walk your dog would love crafted in the Berkshires since two thousand six\nThousands of reviews at my dog's heart is dot com\nPersonally am very sorry he didn't get to testify in the necessity defense hearing or in August a year ago when he testified there was not a dry and there were um\nYou know when he talked about his young children and what they were facing\nAnd then the case becomes even more confusing I guess because the judge was in the one hand you can have witnesses to make your case and then he proceeds to go ahead to quit you of the charges\nRight that was after the prosecutor had presented his case which was only two witnesses the sheriff who arrested us and local Enbridge employee\nAnd all he proved was that we had broken some chains that were holding the log into the enclosure where the emergency shut off valve was and we never disputed that\nSo we were charged under a statute which was one of the sort of enhance penalties statutes that are being shoved through state legislatures right now by the fossil fuel industry to give them you know further penalties against protesters\nAnd the statute we were charged under was specifically damage to pipelines\nAnd the judge ruled and he was correct that the prosecutor had not prove that we had damaged the pipeline and anyway\nYeah in the ... century he was ruling that there wasn't evidence for a reasonable jury to convict that space like write it as a matter of law then that was because of course we hadn't damage that pipeline right\nI'm going to ask you to speculate about both of you in a ... about judge Robert Tiffany and the decisions that you made in your case how do you think the judiciary might have been influenced by outside forces politics sentiment the fossil fuel industry\nThis is Emily in terms of you know what kind of pressures he may have been under or what he may have been I'm thinking you know whether his mind might have changed\nAbout what kind of precedent he wanted a sad and so forth you know it's it's impossible to know and and it's you know distressing and it certainly something we've been wondering about he seemed like a very reasonable guy he gave us a necessity defense he wanted to hear what we had to say\nAnd he wanted to let the jury hear it so you know the about face was quite extreme\nWe know for sure that Enbridge provide something like two thirds of the budget that county so I you know they obviously have some influence direct or indirect we don't know I mean we have no way to know what may or may not have happened behind the scenes but\nThe fossil fuel companies have terrible amounts of influence and power in this country and you know that's why we have to fight them and the ways that we have to fight them because they do on and control our political system all on all levels\nTo what extent did you understand what you did this direct action the law enforcement could bring felony charges against you know\nAbsolutely knew that that was not only a possibility but it's strong probability and we accept that risk", "year": "2018", "show_name": "Living on Earth (PRI)", "city": "Albany", "day": "27", "locations": [["U H", -72.36667, 0.66667], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Florida", 28.75054, -82.5001], ["North Carolina", 18.38078, -65.95739], ["Michigan", 44.25029, -85.50033], ["Wisconsin", 44.50024, -90.00041], ["Kleinfeld", 48.82361, 15.73611], ["Detroit", 42.33143, -83.04575], ["Cass", 46.87719, -96.7898], ["U.S", 39.828306, -98.5795], ["Obama", 17.04483, -61.86117], ["Detroit", 42.33143, -83.04575], ["Mexico", 23.0, -102.0], ["U.S", 39.828306, -98.5795], ["Mexico", 23.0, -102.0], ["Mexico", 23.0, -102.0], ["Arizona", 34.5003, -111.50098], ["Phoenix Arizona", 33.44838, -112.07404], ["Texas", 31.25044, -99.25061], ["California", 34.68743, -116.78467], ["San Diego", 32.71571, -117.16472], ["Phoenix", 33.44838, -112.07404], ["Washington", 38.89511, -77.03637], ["Joan", 41.36718, 2.0574], ["Kingston", 17.99702, -76.79358], ["Vermont", 44.00034, -72.74983], ["Handmade", 29.70495, -98.09945], ["Oregon", 44.00013, -120.50139], ["Lolita", 22.29278, -79.15167], ["Lolita", 22.29278, -79.15167], ["St Louis", 16.01793, -16.48962], ["Massachusetts", 42.36565, -71.10832], ["Hartford", 41.76371, -72.68509], ["Springfield", 39.80172, -89.64371], ["Orangeburg", 33.49182, -80.85565], ["New York", 40.71427, -74.00597], ["Adam", -51.5818, -60.06575], ["Gaza", 31.50161, 34.46672], ["Gaza", 31.50161, 34.46672], ["Israel", 31.5, 34.75], ["Gaza", 31.50161, 34.46672], ["Gaza", 31.50161, 34.46672], ["Gaza City", 31.50161, 34.46672], ["Israel", 31.5, 34.75], ["London", 51.50853, -0.12574], ["Boston", 42.35843, -71.05977], ["Minnesota", 46.25024, -94.25055], ["Canada", 60.10867, -113.64258], ["North Dakota", 46.80833, -100.78374], ["Minnesota", 46.25024, -94.25055], ["Minnesota", 46.25024, -94.25055], ["Seattle Washington", 47.60621, -122.33207], ["Seattle", 47.60621, -122.33207], ["Minnesota", 46.25024, -94.25055], ["Minnesota", 46.25024, -94.25055]], "not_found": ["the Gaza Strip", "the Gaza Strip", "the Gaza Strip", "the Gaza Strip", "Diarrhea", "the Gaza Strip", "Fulton County S. C. C. R. G. dot org"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Washington", "Florida", "Michigan", "Wisconsin", "Detroit", "Cass", "U.S", "Detroit", "U.S", "Arizona", "Phoenix Arizona", "Texas", "California", "San Diego", "Phoenix", "Washington", "Vermont", "Handmade", "Oregon", "Massachusetts", "Hartford", "Springfield", "Orangeburg", "New York", "Boston", "Minnesota", "North Dakota", "Minnesota", "Minnesota", "Seattle Washington", "Seattle", "Minnesota", "Minnesota"], "out_country": ["U H", "Utica", "North Carolina", "Kleinfeld", "Obama", "Mexico", "Mexico", "Mexico", "Joan", "Kingston", "Lolita", "Lolita", "St Louis", "Adam", "Gaza", "Gaza", "Israel", "Gaza", "Gaza", "Gaza City", "Israel", "London", "Canada"], "in_state": ["Albany", "Albany", "New York"], "out_state": ["U H", "Utica", "Washington", "Florida", "North Carolina", "Michigan", "Wisconsin", "Kleinfeld", "Detroit", "Cass", "U.S", "Obama", "Detroit", "Mexico", "U.S", "Mexico", "Mexico", "Arizona", "Phoenix Arizona", "Texas", "California", "San Diego", "Phoenix", "Washington", "Joan", "Kingston", "Vermont", "Handmade", "Oregon", "Lolita", "Lolita", "St Louis", "Massachusetts", "Hartford", "Springfield", "Orangeburg", "Adam", "Gaza", "Gaza", "Israel", "Gaza", "Gaza", "Gaza City", "Israel", "London", "Boston", "Minnesota", "Canada", "North Dakota", "Minnesota", "Minnesota", "Seattle Washington", "Seattle", "Minnesota", "Minnesota"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Support for WAMC comes from the Albany whiskey writes festival Sunday October twenty eight that the Desmond in Albany between over Ninety whiskey types available for settling ticket information at whiskey right festival dot com\nThe button box Sunderland, Massachusetts makers of our more concertina is also selling new and used ... and accordion at providing repairs and accessories button box dot com\nAnd let's false hospital or regional health care system was twenty four locations across eleven communities let false hospitals dot org for more information in Studio ... red hook specializing in all stages of cut organic color from corrective to fashion by stylish Christian Marquette studio Katie ... dot com\nThis is Northeast Public radio WAMC F.\nM. H. D. Ninety point three Albany W. R. UNH the Ninety point three ramps and Utica WAMC ... point nine Kingston W. O. R. H. D. Ninety One seven Middletown WC yell HD Ninety One nine Plattsburgh WC again ac\nNinety three three ... W. A. N. C. H. D. one of the three ... WAMC wage the one of the five one great Barrington WWE S. H. D. eighty eight nine mount Kisco W. A. N. D. H. D. one Stanford W ANR idiot\nFive Brewster WAMC um fourteen hundred Albany [noise]\nFrom public radio international ... living on her [noise]\nJustice Brett Kavanaugh has long history of ruling on environmental issues but good tip the balance on the Supreme Court\nKevin off one of those judges that requires really clear explicit direction from Congress when it comes to rules that impose costs on American business and he's quite right when it comes to interpreting environmental laws again broad protection\nAlso just as a major hurricane hits the U.S a new with dire climate report from the United nations the reports fine that the challenges are not primarily technological they aren't even primarily economic\nBought a real obstacle is a social and political one how do you get societies organized to actually reinvent\nThemselves to be independent of fossil fuels that in more this week I'm living on her rather than\nJust the parents of a Saudi journalist ... was killed when he went to the Saudi constantly in Istanbul they'll do Saudis denied any knowledge of that word meant\nStreaming support for WAMC come from birch are Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nDenied any knowledge of what took place at their consulate in its Danville\nHis statement says there is a serious commitment to determine all the facts and ensure accountability President Trump spoke by phone that Saudi crown prince wildlife day over there and came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened\nTrump goes further in an interview with the Associated Press saying he sees it as an attempt to declare the Saudis guilty until proven innocent\nMichele Kelemen NPR News Riyadh Democrats have\nContinued and even strengthen their financial advantage in the fight to control the house of representatives NPR's Peter Overby says the numbers tell the story in third quarter reports just filed at the federal election commission\nIn sixty two races that will determine the house majority Democrats have consistently and dramatically outraged Republicans last quarter the Democrats collected a hundred and forty million dollars for Republicans fifty one million\nA couple of specifics outside Austin, Texas Democrat and Jay Hagar raised one point nine million compared to not quite six hundred thousand for a long time Republican incumbent Jon Carter\nSome races are closer than that in Wisconsin district that's been represented by house Speaker Paul Ryan Democrat Randy Bryce pulled in one point four million or Republican Brian style wasn't far behind it just over a million as for the polls the races are generally tighter\nPeter Overby NPR News Washington [noise]\nCuban diplomats and their supporters disrupting the un meeting called by the U.S the spotlight the islands treatment of political prisoners protesters loudly banging tables and shouting and Spanish too but he asked us blockade no the\nProtesters rounded out us deputy investor Kelly curry senior Trump a bit of tracing the visuals or the secretary general of the American organization of American states above the noise in the U.S chamber was aware protests by accredited diplomat to have a right to attend any open un meeting\nAlso shows deterioration of us Cuban relations or the Trump Administration but when the restoration of ties with the island nation under then president Brock Obama in two thousand Fifteen\nNumber of help wanted ads went up in August Labor Department says job openings rosy tens of percent the seven point one for a million that's more than a six point two million people on the unemployment rolls last month\nOn Wall street a strong day the Dow jumped five hundred and forty seven points you're listening to NPR\nOf federal judges approve the settlement between Tesla CEO Elon Musk and securities regulators over his infamous message on Twitter about taking the company private\nThe SEC to argue the message must posted was misleading and harm to investors who bought stock in the electric car company the company letter announced it was not going private the FCC find mosque and the company a total of forty million dollars and settlement agreement allows him to hold onto a CEO posed but he's given up his seat is company chairman for three years\nAnd NPR News investigation finds women in prison get disciplined more than men for smaller infractions Here's NPR's Joseph Shapiro women get punished at higher rates often two to three times higher for those lesser and non violent violations of prison rules\nFor things like insolence disrespect for cursing or disobeying an officer\nNPR in the ... school of journalism at Northwestern university analyzed data from Fifteen states and found punishments even for small infractions can have big consequences women go to solitary confinement they lose good comic credits that would reduce\nPunishments even for small infractions can have big consequences women go to solitary confinement they lose good conduct credits that would reduce time in prison and they lose phoning visitation privileges that cuts off mother's from children more than half of women in prison or the mothers of children under the age of Eighteen\nJoseph Shapiro NPR News us astronaut or survive last week's failed launch an emergency landing after problems with the Soviet liftoff says he knew we needed to remain calm us air force colonel Medicaid and she'll be cosmonauts were on their way to the international space station will show years rocket failed their capital ripped away and has designed plummeted earth\nBoth men are okay I'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include life lock life lock with Norton works to help protect identities and the information on devices from cyber criminals learn more at ... dot com\nAnd the ... foundation at ... dot org [noise]\n\n... and the Jennifer ... studio at the University of Massachusetts Boston this is living on her I'm Steve her what would the solid five to four conservative majority now on the U.S Supreme Court parties looking to broaden environmental protections under the law can expect plenty of push back\nThe bruising and bitter battles are confirmed Brett Kavanaugh as the newest associate justice center more and allegations of sexual assault and temperament and his judicial record\nBut a close look at justice Kavanaugh's rulings during his dozen years on the DC circuit court of appeals reveals strong and well crafted opinions that restrain government action on pollution and habitat safeguards\nTo discuss the influence justice Kavanaugh's likely to have on the high court's environmental docket we turn now to promote law school professor ... parental welcome back to the program Patt thanks tape good to be with you\nKnow justice Brett Kavanaugh has been closely related to a number of environmental cases why why is that\nWell he's been on the DC circuit court of appeals which is the second most important court to the Supreme Court in the country for going on eleven or twelve years he's written three hundred different opinions of which\nProbably for the navy and dealt with either environmental law directly or administrative law issues that relate to environmental laws so he has quite a track record of writing opinions and environmental cases\nSo typically how has justice Kavanaugh ruled on these regulatory cases involving environmental law\nWell he styles himself in the manner of uh the late Justice Scalia who was attached to a less strict construction is and what that means of course is that he looks to the text of a statue when he was asked to interpret it\nAnd if the text isn't clear enough oftentimes he will rule against an agency's interpretation and an environmental arena that oftentimes means\nThat rules which are trying to increase the level of protection for public health and the environment don't often fit squarely within the plane tax of a statute the statutes are general and vague often\nAnd the environment don't often fit squarely within the plain text of a statute the statutes are general and vague often agencies try to interpret them as best they can\nKevin ... one of those judges that requires really clear explicit direction from Congress when it comes to rules that impose costs on American businesses he's quite pro business\nSo what happened in that the north Carolina put the toxic waste dump there or not\nUh the protest came together with a icons from the civil rights movement from all over the country one of those icons Floyd ... was from Warren County they came together and began to realize\nThat dumping on poor and minority communities across the country was commonplace governor Jim Hunt responded to the protests by canceling plans for the toxic waste dump Warren County became the first the environmental justice movement was born\nThanks Peter Peter dice there is an editor with environmental health news at the age that Oregon David climate dot org thanks so much to talk to you again next time\nAll right Steve thanks we'll talk to you\nThere's an editor with environmental health news that the agent at Oregon State of climate dot org thanks so much will talk to you again next time All right Dave thanks we'll talk to you soon and there's more on these stories at our website L O ... O R G\n\n[noise]\n[noise]\nComing up little known and in trouble our breasts race to save the butter not tree just hours ahead on living on her\nSupport for a living on earth comes from the Gordon Betty Moore foundation and from a friend sailors for the the working with voters to restore ocean health [noise]\nSupport for WAMC ... son would builders Amherst, Massachusetts over Thirty years of greed and custom home building now offering energy efficient apartment rentals and introducing village called housing both located in Northampton son what his desk builders dot com\nHome brew emporium wrestler New York announcing the new emporium farm brewery offering twelve caps of its own British style beers farm beer wind cider and meat from all over New York state emporium firemen brewery dot com for details\nSteve Lewis Subaru Hadley, Massachusetts a new and used Subaru dealer serving the pioneer valley Hartford and Springfield offering conducive Bruce plus used cars trucks and SUVs Steve Lewis Subaru dot com\nThe Eric ... museum of picture books are ... Massachusetts celebrating the golden anniversary of the very hungry caterpillar with a new exhibition and activities ... museum dot org\nAnd capital roots making fresh local produce accessible to Capitol origin neighborhoods healthy affordable food should be a right not a privilege capital of roots dot org for more\nLiving on earth I feed her with\nHurricane Michael quickly blew up into a devastating category for storm as it entered warm waters in the northern part of the Gulf of Mexico it's yet another example of the increasing number of major weather events linked to climate disruption\nAnd according to a recent report from scientists with the inner governmental panel on climate change the IPC see we can expect more and more dire events such as Michael with only seemingly small increases in the globe's average surface temperatures\nThe twenty Fifteen Paris climate agreement calls for no more than a two degrees centigrade increase from pre industrial conditions and suggested limiting the rise to one point five degrees will be beneficial but this new report finds that after three different poses huge risks\nKeeping below that one and a half degrees centigrade goal was going to be tough but the impact of failure will be even tougher says Princeton professor Michael Oppenheimer professor Oppenheimer has been a lead author for high PCC reports for years and joins us now welcome back to living on earth Michael\nGlad to be here again let me cut to the chase how scared are you by this latest report from the IPC see\nI don't get scared about this issue because I've been living with it for thirty five years and uh if it scared me I Would have gone crazy a long time ago however any sane person would take away a very very sobering message apart and reading this report\nThe effects of climate change are already here\nThey are projected to worsen over time and the point at which the risks are related to climate change that is the possibility of very big impacts starts to increased markedly is not toward the end of this century but very close to a matter of\nA decade or two away\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills in support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nThe premise of this report it and and why was it issued in the first place\nThis report has an unusual origin the Intergovernmental Panel on climate change produces thorough assessments of all our knowledge on climate change\nEvery six years or so and then in between those major assessments that produces very quick and pointed assessments of pieces of the problem\nFor instance I'm working on the next these are called special reports and I'm working on the next special report which is on the oceans and the icy parts of Earth like the ice sheets\nThe report that just came out is on the question of what is the level at which we should restrain warming in order not to enter a danger zone where the risks are just so high\nThat we may just as a group of societies not be able to cope with it\nThat's unusual because it's pointed it at single very specific issue that has high policy relevance\nNow what are the headlines from this latest I PCC report is that we have just a dozen years twelve years or they'll twenty thirty or so to get our act together to reach a net zero output in carbon emissions to what extent do you agree with that finding and how do we possibly get there\nTo be Frank about it I don't think we're going to get there\nAnd I also think that partly because of that\nThe framing that we have twelve years left or else is wrong it's counterproductive it'll just scare people and the report they frame it that way that's been a framing that the media has has put on it\nIs sort of like twelve years ago we don't do we should do the world comes to win and that's not the case reality is at every step you do the best you can and if you don't quite make\nThe target you try to do a little better in the next decade or the next couple of decades the world doesn't come to win and costs that is the risk just increased markedly and it becomes very very hard to cope eventually\nThat doesn't mean that society's will completely disintegrate some well I can tell you that sea level rise is going to destroy some coastal societies particularly on small islands states but it'll make life just miserable extensive\nAnd uncomfortable for the rest of us\nSo what are the biggest challenges in this report or in terms of limiting warming to a degree and a half centigrade\nContrary to what most people think ah the report finds that the challenges are not primarily technological the costs are going to be decreasing overtime although they're never going to be entirely negligible but\nThe real obstacle is a social and political one how do you get societies organize to actually reinvent themselves to be not independent of fossil fuels\nYou're saying the primary challenge to limit warming to one and a half degrees centigrade is us what in fact do we need to do then as society is as governments to to limit this warming I I Know there are many many aspects to it but but briefly what do we need to do\nThe most general level what we need to do is abandon using fossil fuels as primary energy sources that means getting rid of coal the primary source of carbon dioxide from electric power production for instance as soon as possible\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nAnd probably the biggest challenges that there's so much carbon dioxide already in the atmosphere\nThat even if we slow down markedly are ... and ... eliminated dependence on fossil fuels we need probably need to find a way to remove some of that carbon from the atmosphere eventually not immediately but as we get towards mid century\nIt seems we go in and need a way to suck the carbon dioxide out of the atmosphere and people are working on that so that those are two things\nThe third thing is becoming more efficient and that means not just efficiency and production it also means societies organizing themselves efficiently for instance in the United states we have a very spread out\nPattern of development and that pattern automatically guarantees high energy use\nSo tell us why two degrees centigrade will be even worse than they already ambitious goal of one and a half degrees centigrade why does just half a degree make such a difference according to this particular report\nSo when the report was\nCalled for two thousand and Fifteen a lot of\nScientists were skeptical that there would be much of a difference in the impacts between one and a half and two degrees but because the government's called for the report a lot of scientists went out\nAnd started doing research focused specifically on the difference between one and a half to two degrees it's become clear that particularly with regard to extreme heat\nAnd flooding that they were big differences between one and a half and two degrees I mean give me an example already by one and a half degrees there are places are particularly islands in the Pacific and megacities all around the world for which the incidence of the benchmark hundred year\nRule rural or\n[noise] [noise] oh\nIt is hard to figure out exactly where it's coming from and that's the point of it only the lions and the lion has now and the hunted in their panic will run right into one or the other\nLady didn't the night the ... goes on barking and barking\nThe lenders living on earth explorer in residence for more including photos go to our website Ella we dot ORG and [noise]\n[noise]\nComing up former secretary of State John Kerry on the dividends of environmental conservation keep listening to living on earth\nEnding for a living on earth comes from you our listeners and United Technologies combining passion for Science Engineering to create solutions designed for sustainability in aerospace building industries in food refrigeration\nUT the companies that your oldest carrier ... me and you see the Arab states to students are helping to move the world forward\nYou can learn more about United Technologies by tuning into the race to nine billion pod cast lifting at rates nine billion dot com that's raised to nine billion dot com\nSupport for WAMC comes from hospice of the Fisher home Amherst, Massachusetts providing comprehensive end of life care at thirty nine bed residents or where patients live in their local community information at Fisher home dot org\nThe blue marble or world of gifts on north plus history in Amherst and thorns marketplace at north Hampton offering a hand selected collection of jewelry scarves pottery Wal Mart and gifts the blue marble that business\nCommunity advocates for sustainable energy presenting the renewable energy as sustainable living fair Saturday October twentieth from ten to four at don't steward school for more information stop NY pipeline dot org\nOpposite falafel restaurant right back now year round lunchtime homemade Peter falafel salads Tahiti hummus roasted eggplant and more gluten free options eat it or take out a bus falafel dot com\nAnd shut me in backyard sheds Ngozi bows deliver throughout the WAMC listening area in Brunswick and the new new Lebanon location inventory online at ... dot com\n[noise]\n\nDarling famously travel in massive blocks up to one hundred thousand birds drawn at times [noise] they got almost resemble the school of fish moving together squeak\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine an anterior hip surgery for one three for nine nine six six zero zero\n[noise]\n\nEuropean starlings are a common sight in suburban yards ... through the grass to dig for grubs in other tasty bits watch law enough though\nAnd you may see a starling pause in the hunter Jimmi lead pluck of marigolds or other bright flowers and then fly up to deposit the bloom and then asked how romantic but there's more to it ornithologist to found that starlings regularly adorn they're tweeting nests with fresh vegetation\nTo more frequent the better marigolds of course but also elder Barry flowers Yara leaves and even willow bark all of which is your nose will tell you are full of aromatic chemicals\nThe starlings are actually fumigate into their nests\nFly the chemicals have been taught to help discourage pass some parasites [noise] scientists have discovered that the smelly plants may offer an even more direct benefit ... slings\nBy stimulating their immune systems that turns out that starlings hatched in wealth fumigate it nests tend to weigh more and live longer than those raised without benefit of fragrant herbs the gift of flowers romantic\nAnd practical all at once [noise]\nI'm Michael sign\nFor photos walk over to our website at ... dot ORG\nMm\nWe continue our conversation this week with John Kerry this memoir is called every day is extra in it the former secretary of state and democratic presidential nominee writes about his formative childhood years and his legislative and diplomatic work on climate change acid rain and much much more\nAnd if you missed the first part of our conversation you can hear it at our website and Louis dot O. R. G.\nI began the second part of our talk by asking Secretary Kerry to consider the issue of stranded assets as it applies to climate change\nLet me ask you just to think reflect on this for a moment looking at American history in Eighteen sixty\nIn the south there was more monetary value in slaves than there was in the land or Eighteen sixty five that was a classic stranded asset all that value disappeared\nTo what extent today do you think we're being held hostage by folks who think that all that fossil fuel in the ground which is on balance sheets at billions and billions and billions of dollars\nAnd it can't all be burned if we understand the science correctly\nTo what extent are we headed down a path I mean to solve the problem that we had was slavery I mean does the moral question there just like we have today with climate as well as the economic question to solve that problem we wound up in a pretty in a very bloody war yeah idle at I mean I don't\nThink that's the choice for for America now I think that I think uh most of the executives I Know at the higher level of the oil industry are all diversifying\nA Shelby pay their all investing in New energy they're ready to move where the market we'd go and uh\nI mean we're not going to be able to transition fast enough that you suddenly dry up and not have oil or gas and ... there's going to be oil and gas for a while it's just the nature of the beast we've got to try to guarantee is not for too\nStreaming support for WAMC come from ... Center for weight loss surgery with a focus on life skills and support for a long term success with we've ... in gastric bypass surgery monthly seminars open to the public for when three three nine five seven five one zero to register\nIf we don't move off fossil fuels fast enough\nWe could reach what's called a tipping point\nWhere things begin to cascade\nDown words in a spiral of destruction and dying of dying sees dying trees dying species of various kinds because it's not sustainable\nAnd if you get into that kind of a spiral nobody knows nobody can tell you how you break out of it I'm just applying the precautionary principle of the idea of governing\nMean we buy insurance to make sure our of our home burned down will get to be able to rebuild it we buy a car insurance to fix the rack and hope in our life insurance and then somebody lost a life\nThe family's okay why are we buy insurance against the death and destruction that will come with increased storms and increase climate change\nIs beyond my understanding why are we going to have a president who is in the ... of the science\nNinety eight percent of all the scientists in the world who ever watch this and looked at it with peer reviewed studies peer reviewed studies all say this is happening happening now and it's caused by not exclusively but largely by human beings\nAnd we don't respond to this whoa whoa to sending them we're entering into the sort of suicide packed\nIt could be worse than the United states civil war that right now we are heading I you know the goal in Paris was to keep the rise of the earth's temperature to two degrees centigrade\nAnd we were going to try to excite enough nations to become involved that we could meet that standard we now know at the current rate we're not meaning that standard we are heading now towards four degrees centigrade rise and the temperature of the average temperature of the planet that's catastrophic\nYou'll have water battles you'll have refugees moving do you think we have tough migration challenges today where people can't produce food and various parts of the world boil their water dries up and they're not able to live what happens when the oceans change and you have a migration away from certain stocks that people have relied on for food and so forth\nAnd they're just so many unknowns here I'm not willing to just throw up my hands and sail someone's going to take care of this\nBecause that's just not responsible given the input back in the day as lieutenant governor of Massachusetts which is not exactly ordinarily a very exciting position\nYou made your mark jumping on the acid rain but tell me what did that teach you about the politics of environmental protection\nThat reasonable people with a reasonable purpose in public life\nAre able to work together Republican and Democrat in order to do things that are good for American citizens I was a lieutenant governor but Michael Dukakis are allowed me to be the chair of the governors task force for him I worked with Governor John Sununu in New Hampshire I worked with Governor addicts Alaska Ohio\nAnd we put together the three of us a an approach drawn up by the way by the American Enterprise Institute is conservative approach to how you use the market to be able to", "show_name": "Living on Earth (PRI)", "year": "2018", "city": "Albany", "day": "17", "locations": [["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Sunderland", 54.90465, -1.38222], ["Massachusetts", 42.36565, -71.10832], ["concertina", -20.15694, 33.72389], ["Studio", -38.14644, 145.17931], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["U.S", 39.828306, -98.5795], ["Istanbul", 41.01384, 28.94966], ["Danville", 36.58597, -79.39502], ["Austin Texas", 30.26715, -97.74306], ["Wisconsin", 44.50024, -90.00041], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["U.S", 39.828306, -98.5795], ["Washington", 38.89511, -77.03637], ["north Carolina", 18.38078, -65.95739], ["Warren County", 42.49044, -83.01304], ["Warren County", 42.49044, -83.01304], ["Massachusetts", 42.36565, -71.10832], ["Northampton", 40.62593, -75.37046], ["New York New York", 40.71427, -74.00597], ["Massachusetts", 42.36565, -71.10832], ["Hartford", 41.76371, -72.68509], ["Springfield", 39.80172, -89.64371], ["Massachusetts", 42.36565, -71.10832], ["the United states", 39.828306, -98.5795], ["Massachusetts", 42.36565, -71.10832], ["Brunswick", 45.94541, -66.66558], ["Lebanon", 33.83333, 35.83333], ["America", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["Paris", 48.85341, 2.3488], ["Massachusetts", 42.36565, -71.10832], ["New Hampshire", 43.20814, -71.53757], ["Alaska", 64.00028, -150.00028], ["Ohio", 40.25034, -83.00018]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Massachusetts", "Albany", "Albany", "U.S", "Danville", "Austin Texas", "Wisconsin", "Washington", "U.S", "U.S", "Washington", "Warren County", "Warren County", "Massachusetts", "Northampton", "New York New York", "Massachusetts", "Hartford", "Springfield", "Massachusetts", "the United states", "Massachusetts", "America", "the United states", "Massachusetts", "New Hampshire", "Alaska", "Ohio"], "out_country": ["Sunderland", "concertina", "Studio", "Istanbul", "north Carolina", "Brunswick", "Lebanon", "Paris"], "in_state": ["Albany", "Albany", "Albany", "Albany", "New York New York"], "out_state": ["Sunderland", "Massachusetts", "concertina", "Studio", "U.S", "Istanbul", "Danville", "Austin Texas", "Wisconsin", "Washington", "U.S", "U.S", "Washington", "north Carolina", "Warren County", "Warren County", "Massachusetts", "Northampton", "Massachusetts", "Hartford", "Springfield", "Massachusetts", "the United states", "Massachusetts", "Brunswick", "Lebanon", "America", "the United states", "Paris", "Massachusetts", "New Hampshire", "Alaska", "Ohio"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "October seventh explore Adams dot com slash Rambo fat and from the underground railroad history project announcing seeking sanctuary exhibit now through June of two thousand Nineteen at the Steven and Harriet Miers residents\nOne Ninety four Livingston avenue Albany underground railroad history that or it's for information\nWhich was Northeast Public radio WAMC up\n... points we all money W are you in a ... point three rump some Utica W William ... Ninety nine ... WLS outrage the only one seven Middletown WC EL each day you know the one nine Plattsburgh W ... Ninety three three Kevin\nHarry ... WAMC wage do you want to find one great Barrington W W E S H the idiot my my kids go it'll be ... point one Stanford W winning in our eighty eight by\nBrewster WAMC yang I'm fourteen hundred Albany [noise]\nFrom public radio international business is living on\nMy speaker\nJohn Kerry has led climate action with secretary of state and presidential nominee and he says don't give up there's no mystery to how we reclaim the direction and future of our country it's by going out and working in our democracy make your work and you can't do it on your button preventing somebody else is\nGoing to do it or not involved you know we can change those but we have to do it now because ... [noise] also using hard to tell the story of losing the eastern them on our forests are not [noise] that\nAnd then as we do need to keep in mind as he walked through the the extradition that the ... day in\nBars is Morrow in the bars and a hundred years ago or ... years ago are all very different markets [noise] those stories and more this week on living on her [noise]\nLive from NPR News in Washington on trial Snyder with the Senate ready to hold a final vote on Supreme Court nominee Brett Kavanaugh today justices Elena Kagan and Sonia Sotomayor are raising concerns about partisanship so to appear to Princeton University\nWhere Kagan said it's important to keep the Supreme Court out of partisan battles\nAn incredibly important thing for the court to guard is this reputation fanfare\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nThan simply an extension of that terribly polarized political process had environment than we let that\nTo the Senate vote on Kavanaugh seems to be a formality after weeks of hardball politics on Capitol Hill protests\nIn Tokyo\nSecretary of state Mike Pompeo shook hands with Japanese prime minister Shinzo Abe's cameras flick I'll be thankful for stopping in Japan\nBefore meeting tomorrow with North Korean leader Kim Jong on\nI'll pay a pledge to have a unified view of how to proceed and the push to get young young to give up its nuclear weapons Pompeo also has stopped scheduled in South Korea and China before returning home on Monday\nFood and Drug Administration says it will banned the use of seven food additives that have been used in a variety of foods and beverages NPR's Allison Aubrey reports the decision comes in response to legal action brought by environmental groups\nThe additives can be used in a range of foods from ice cream to baked goods to gum they infused with cinnamon meant and other flavors you would not know if they're in the food you buy because food manufacturers are allowed to label them simply as artificial or natural ingredients\nAnd natural resources Defense Council and other groups petitioned the FDA to remove them pointing to cancer risks\nThe FDA concluded that the ... do not pose a health risk when they're used as intended in very small amounts nonetheless the agency will give manufacturers twenty four months to formulate their foods and find suitable replacement Allison Aubrey NPR News\nSan Francisco where federal judges blocking the drop another ... administration from time law enforcement grants to local cooperation with immigration authorities NPR's Richard Gonzales explains\nUs district judge William Oric said that San Francisco so called sanctuary city ordinance is lawful and that the federal government can't withhold about twenty eight million dollars in federal funds from it and other California jurisdictions\nThe judge also declared a law requiring local officials to share information with the feds about immigrants and local jails as unconstitutional judge or issued a nationwide injunction blocking the Trump Administration but he also place to stay on it until the Ninth Circuit court of appeals has a chance to pick up the case\nA spokesman for the Justice Department did not respond to requests for comment\nRichard Gonzales NPR News San Francisco and this is NPR News\nSupport for NPR comes from NPR stations other contributors include the Pew Charitable trusts celebrating Seventy years of serving the public learn more at ... dot org slash Seventy and the ... foundation at ... dot org\nIs WAMC regional News I'm Lucas Willard saying it has confronted serious misconduct by fraternities and sororities the university at Albany is reminding students of its stance regarding a number of campus groups\nAnd the letter friday the school detailed twelve fraternities and sororities that are no longer recognized by you Albany school leaders have suspended to fraternities until further notice and half prohibited multiple organizations from taking on new members this semester\nOver the past six years you Albany says more than eighty students have violated the university student code of conduct for hazing or from being affiliated or attempting to affiliate with an unrecognized organization the school says more than thirty of the students were suspended or dismissed\nThe town of Adam's Massachusetts has the\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu Joshua Wendy's\nThe Adam select board approved the declaration in an effort to attract state money to address almost two million dollars and flooding damage from heavy mid September rain John ... is the town's fire chief\nWe have here is a foot out on a regular basis and these were a couple of 'em that [noise] have been more evolve over the last year ...\nAdams a town of roughly a thousand is the only ... community to make such a declaration after last month rain Josh Landis WAMC news\nThe forecast mostly cloudy today with a slight chance of showers in the afternoon hides in the upper sixties mostly cloudy tonight with the chance of showers after midnight not as cool and humid lows in the lower sixties\nTomorrow a chance of showers hides in the upper sixties support comes from the lake George Land conservancy Bolton landing working on land protection projects that safeguard the water quality of lake George hiking maps public events and more at L. O. G. L. C. dot O. R. G. [noise]\nLiving on earth continues its six minutes after six o'clock [noise]\nFrom the Jennifer and Ted Stanley studios at the University of Massachusetts Boston this is living on Earth I'm Steve her with just as the Trump Administration announced plans to roll back mercury regulations for coal fire power plant the\nTrump BPA also placed ahead of its office of children's health protection on administrative leave mercury can lead to brain damage in children and the Obama era mercury rule also reduces enough so it and other pollutants to prevent more than ten thousand excess deaths a year among adults\nWith its director gone the office of children's health protection is at risk of being closed altogether and ETA has already said it will close its office of scientific advisor pediatrician and epidemiologist Phillip ... is the founding director of the global health initiative at Boston College and he joins us\nNow Dr Landreth and welcome back to living on earth Steve it's good to be back with you thank you Dr ruth at so ... been placed on administrative leave at the environmental protection agency's office of children's health protection what can we expect now that she's been placed on leave\nWell she's a deeply knowledgeable person who brings an enormously deep skill set to this position I'm afraid that um the decision to place for it and on and then there's probably\nMay signal a decision by the environmental protection agency and the present administration to de emphasize the protection of children's health\nOften and the bureaucracy when some executive is put on administrative leave it to signal that they're concerned about wrongdoing what's being said about Dr Ethel in this case\nNothing has been said about wrongdoing she was placed on administrative leave and no reason has been given\nRecently the EPA announce that he wants to loosen restrictions on the amount of mercury that can come out of coal fire power plants has me wondering if Dr SOLs being pushed to the side of the same time they made this decision\nWell in recent weeks the office of children's health protection Audi PA has been arguing against the rollback of mercury emissions standards of\nThe story years though all cold can change a little bit of mercury and when you burn coal that mercury vaporize is kind of you burn a lotta call\nThe little bit of ... that's in each time adds up to us\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nFrom the oceans it gets into fish and then when a pregnant woman or a young child each that fish that is contaminated with mercury the mercury goes right through into the baby and has been well documented cause brain damage it reduces the child's IQ it can disrupt the child's behavior this can be lasting injuries that\n[noise] but then a million years until ... trillions of tons of carbon dioxide from the atmosphere in fact there's a little garbled up so much carbon dioxide nearly half the CEO to available at the time that it helped cool the planet from an intense hot house to the temperate climate we have today\nNow scientists are researching the potential for ... to alter the climate once again\nAnd it's a very catastrophic climate change wasn't enough as it has another trick up at sea it's an excellent natural fertilizer in fact as has been used to fertilize rice patties in Asia for over a thousand years and researchers believe it could be used on other crops to decrease the need for toxic synthetic fertilizers\nAnd the list doesn't end there adult has the potential to be a natural insect repellent and even a sustainable food source in any case it seems as though that may be able to lend us a hand I'll be an extremely tiny one\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nAn idea for a cool fix for our hot planet please send it our way and we might put it on the air our email address is comment\nAt L. away dot ORG that comment at Eli data [noise]\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend of sailors for the the working with voters to restore ocean health\nSupport comes from the tank teaching museum and art gallery at Skidmore College providing exhibits public events and educational programs for audiences in the capital district and beyond Skidmore dot edu slash tank\nRupture orthopedic associates an affiliate avert your health systems\nProviding orthopedic services in the Berkshires including make a robotic surgery sports medicine and interior hip surgery for one three for nine nine six six zero zero Hadley garden center Hadley, Massachusetts locally owned and operated for over fifty years with indoor and outdoor plants\nGardening supplies bird feeders and seeds organic fertilizer and advice Hadley garden center dot com\nAnd from the ... island the jazz festival at the Woodstock playhouse presenting the bop island big band with guest vocalist Polly givens Sunday October twenty first at four Woodstock playhouse dot O. R. G. for more information\n[noise]\nIt's living on Earth I'm the car with the death toll keeps rising from the tsunami that recently struck ... the deadly wall of water was generated by a seven point five magnitude earthquake offshore\nThe Indonesian government installed a system of twenty two boys to help detect pressure changes related to the formation of a sue nominee but\nThey haven't been functional in years and the new system to be anchored to the ocean floor and less vulnerable to vandalism was awaiting the green light for deployment when it was rejected for lack of funding just days before the most recent disaster struck\nUniversity of Pittsburgh political science professor Louis comfort worked with teams of researchers in the U.S and Indonesia to develop and under the sensor network to detect some nominees professor comfort joins us now welcome to living on her thank you for having me\nSo what are the challenges that ended in Asia has faced in preparing for extreme events like Saddam is\nIndonesia is in a very risk prone environment Seventeen thousand islands and counting it has a major earthquake over seven point\nMagnitude on the Richter scale every year at least every year it's vulnerable also choose to nominees and volcanic eruptions so this is a major challenge for the country\nAnd of course I'm what little more than a decade ago there was a huge catastrophic tsunami event there and Indonesia\nYes two thousand for a sit down I mean at the tip of northern Sumatra ... and ... literally one in three people in that city were killed\nI was there two and a half months after the ... that seeing the devastation and still\nIt was the stench of dead bodies two and a half months it's just sobering and it's this kind of experience that has made me so intent on trying to do what is possible to support decision making\nFor the public managers that face these horrifying situations\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu oh\nIn fact just a few days before this latest sue nominee hit a I guess it was due to funding concerned how did you react when you heard the news\nI was profoundly disappointed profoundly disappointed\nSo there were two parts to this project one is the undersea network that provides the initial near real time warning and then the second is the network of electronic devices essentially\nA cell phones handheld cell phones that enable people in the community to communicate as they evacuated or move to safer ground\nWe had planned to do the deployment this fall September October the Indonesian agency the M cagey was very interested in this proposal you know unfortunately the project is currently on hold until more funding comes in\nSo it's like that everybody agreed that people should wear seatbelts for that wasn't enough money for everyone to have one\nUnfortunately that's exactly the case\nAs I understand that there was a system of booties there to warn people about Saddam is what happened to them\nThat's one of the painful part of this project um Indonesia supported by the U.S in Germany had twenty two movies\nThat were operating and designed actually to provide a similar data from the ocean floor change in the water pressure in the water column\nBut those buoys actually had been vandalized and we're not functioning and as a matter of fact the Marines survey agency BP T that managed to movies actually cancelled that program\nBecause they were not able to keep them operational so the ... had not been operating since two thousand sixteen\nNow what are the advantages of the system that you've helped to develop over the now defunct system of bullies\nThe major difference is it is anchored to the ocean floor so it cannot be vandalized and it uses a very interesting scientific phenomenon of the thermal kind of warm equatorial waters\nTo enable who's the communication that is underwater communication where the data is transmitted from the sensors to another communication center\nTo another communication sensor and then picked up and transmitted via cable to land station\nThat transmits the data via satellite\nAnd of course the Quds the communication and the water is what the whales ... so\n... that's exactly right\nTo what extent has the prospect of now the Indonesian government changed given this recent disaster\nWell I Hope that his change right now I'm certain that they're full attention is on the immediate recovery but you know I Do hope that the agencies will reconsider is as a very important part of their overall sitting on the early warning system\nThat we've covered it is a professor at the University of Pittsburgh thank you so much for taking time with us today thank you it's been a pleasure [noise] [noise]\nOh ooh ... archipelago\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nOr bears reindeer and walrus as living on earth explorer in residence marks a lender explained he recently had an up close maybe to close for comfort encounter with a three thousand pound walrus\nA finger of glacial till points since the fjord unsolved barred that put the pin thin point where\nThe ... the place is low but the slowest steep for a walrus and once the effort is made the herd prefers to stay there\nDo not disturb that is all they want\nThey draws and stretch of flipper like an open hand reaches into the air is just making shadows on or non existent wall\nScratches the chin the cheek than let's the hand fall the walruses\nAnd there are tens and bounds or blending into the land where they recline\n\nOut in the frigid water a walrus had appears tooth Walker is walking teeth strong what they show up above the water and line along the lines of them with crevices and I are very bright\nHis wrinkled skin like a parliament map of all the places he has been shows his age and the bulk of him a measure of his station\nHe paddles on concerned towards ... and\nYou teach the company's ... oldest carrier Pratt Whitney and ... the Arab states distance are helping to move to world forward you can learn more about the United technologies by tuning into the race to nine billion pod cast lifting weights to nine billion dot com that's raised to nine billion dot com\nThis is P. R. I. public radio international\nSupport for WAMC comes from a mega Center for sustainable living presenting drawdown learn a solution based approach to climate change with activists Paul hawking October nineteenth to twenty first you'll make a dot org\nAmherst copy and design works offering printing and copying signed making designs services firm booklets stationary and labels to lawn signs\nIn downtown Amherst, Massachusetts Amherst copy dot com capital wine corner of stay in large streets in the heart of Albany offering local domestic and international winds spirits had special orders tastings friday's from six to nine capital wind Albany dot com\nAnd from feeling hides in Morris house and studio Lennox clues behind the paintings by Picasso rock and greed mounted on pedestals for visitors to the historic labels and stamps had non museum Walt ... dot O. R. G.\n[noise]\nIf living on Earth I'm Steve Gerber what John Kerry is looking confidently into the future even as he looks back at his life of public service which ranges from being the face of the Vietnam veterans against the war to a democratic nominee for president and secretary of state\nSecretary Kerry writes about challenges facing the world focusing on climate change in the final chapter of his six hundred page memoir titled every day is extra and even in the face of President Trump's opposition to climate action John Kerry remains optimistic\nHe spent is useful summers in and on the waters of ... Massachusetts which gave him a lifetime attachment to the sea over the decades these played key roles in legislation an international negotiations on climate change acid rain an ocean health Secretary Kerry welcome to living on her\nHappy to be here thank you so you know if there's one thing from your book every day as extra it is your love of the ocean why does the ocean called in such a strong way\nI'm a southern Massachusetts I think it costs to all of us have sons and daughters we are a\nBlessed to be people of the sea here in the state of Massachusetts and we love Cape Cod we love the islands [noise]\nAnd I learned as a kid you know I was raised out on the ... bay and I used to just clam and fish and play in the water learn how to sail do all these wonderful things but I learned about under the water and I was a big Philippe Cousteau fan\nAnd just the two and my mother was an enormous conservationists environmentalist\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu is fragile\nIt's not impervious to the things we humans do it\nAnd as as I recall from your book in you're fortunate childhood you were on when I Lived been islands you on the ... yeah you come out of Woods Hole and you can see it on your way to Martha's Vineyard if you like ... it's a great place to have your toes\nIn the sand is yeah it's uh but I mean it's a it's a gift beyond description and it was wonderful to be able to be there but I think that\nEverywhere on our Cape uh people that get to experience the beauty of our sand dunes are low tides of the enormous beaches or the remarkable vision that President Kennedy had the great the Cape cod seashore national monument so we're we're very lucky people and uh\nOur history goes way back obviously made everybody during the Arab Seventeen hundreds Eighteen hundreds early sixteen hundreds came here on a boat\nAnd we have always had a tie our history to the sea and in our merchant efforts or the China trade the caught on top of the state huh cod wailing a and\nYou know we don't have cod though I mean this ought to be a message to everybody it's Cape Cod that they're no cod\nOr very very few and precious few and it's a it's a tragedy if we don't start paying attention to how we manage these kinds of things we could see an economic impact on our state\nSo what do we need to do today to take care of our I think there are three primary\nChallenges a number one\nClimate change which is caused by greenhouse gases which fall in the ocean and the ... the ocean which has a negative impact on the growth of clams crustaceans shells and bleachers out spawning grounds and coral reefs and so forth around the world\nAre we don't know all the impacts we know it has an impact we don't know the rate of impact we don't know where you could have a precipitous catastrophic\nImpact and so that's why we all at particular respect and concern\nThe second grade impact is pollution general pollution\nPeople build the bill near the ocean there is what we call non source point pollution\nView I've run off the of gasoline runoff from stations you have oil rental if you have pesticide runoff you have high nitrate runoff which affects the level of oxygen and water and therefore the fashion plants a foreigner in the ocean\nAnd we have five hundred dead zones around the world and the ocean's today ... nothing grows because of what has happened with this overload\nAnd also pollution generally it affects the fish you have plastic getting in the marine mammals are into birds I've seen film of a shark send or ... or whales dragging nets around and dragging plastic around it's crazy\nAnd then finally we have over fishing\nWe have too much money chasing too few fish\nAnd that's one of the reasons we don't have any cod anymore here eight of the top fisheries of the world are now over fished out of this sort of Eighteen or so fisheries principal ones and the others or at or near\nMax so with four hundred and fifty million Chinese who've come out of poverty into the middle class who now have discovered blue tuna and sushi or with four hundred million Indians likewise and people around the world gaining in income and\nTherefore appetite we have a huge challenge at all\nStreaming support for WAMC comes from Albany med now open the mastery family children's emergency center a place for ill and injured children more information at AMC dot edu\nHuge demand for fishes food stock and increasingly we're going to see pressure on that so those are the Big East but the pollution is just stunning I mean if we continue at the rate we're going there will be more plastic than fish in the ocean and twenty Thirty years\nNow of course you've had a storied career most recently as a diplomat and your background I think you spent some time in France and Switzerland as a kid and your dad was a diplomat\nBut when it comes to the ocean you've had some special concerns and I just want to quickly ask you about ... about to\nOne there's something called the law the sea treaty was something that the United states and the folks from Massachusetts like Ellie Richardson worked on years ago which we never ratified and now there's talk of having some sort of a high seas treaty um that would govern what is it half of the world is not in any dress to correct\nIt's called the high seas and the high seas do not belong to any particular nation but they get egregiously overfished by renegade fishers pirate fisherman and years ago Senator Ted Stevens and I went to the United nations to try to ban the drift Annette fishing\nWe succeeded it was banned\nBut today you have pirates fishermen renegade fishermen who go out with addressing that addressed net is literally thousands of miles a model filament netting that they dropped behind the boat dragged along it kinda strip mines the ocean and as much as two thirds of the catch\nCertainly fifty percent is called waste cash they just throw it overboard so it's changing the ecology of the ocean by imagine the division of a UC a strip mined coal or in the land you see it just ravaging everything around that this is what address that will do\nAnd then sometimes it breaks off and it becomes what we call the ghost in it because it just fishes on its own mind it's weighted down with carcasses it sinks to the bottom scavengers clean it off it rises to the topic and an till it gets tangled in a whale or tangled in the propellers of some boat\nIt's a scourge and we have no enforcement on those high seas or very little enforcement I should say occasionally someone's military ship goes through it and you can check on who's who and what's happening and you can certainly mark what chips or their fishing\nSo we're over fishing talked to me about the climate and your concerns about climate change\nWe face a massive challenge of dealing with climate refugees the prime minister of the Fiji Islands\nI I just met with him the other day or an event in California where he pointed out that they're literally taking refugees from other islands and they themselves are now planning how to move where can they go to be safe\nThey'll lose their nation state which is these islands increased fires increased floods more moisture in the air because of the warming of the ocean more intensity and the storms because of that moisture we're seeing it in a hurricane's we've seen last year", "year": "2018", "show_name": "Living on Earth (PRI)", "city": "Albany", "day": "06", "locations": [["Livingston", -17.84194, 25.85425], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Washington", 38.89511, -77.03637], ["Albany", 42.65258, -73.75623], ["Tokyo", 35.6895, 139.69171], ["Japan", 35.68536, 139.75309], ["South Korea", 36.5, 127.75], ["China", 35.0, 105.0], ["San Francisco", 37.77493, -122.41942], ["Us", 45.99696, -118.49854], ["San Francisco", 37.77493, -122.41942], ["California", 34.68743, -116.78467], ["San Francisco", 37.77493, -122.41942], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Adam", -51.5818, -60.06575], ["Massachusetts", 42.36565, -71.10832], ["Albany", 42.65258, -73.75623], ["Adam", -51.5818, -60.06575], ["lake George", 0.04389, 30.14944], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Hadley", -68.49017, -66.50523], ["Massachusetts", 42.36565, -71.10832], ["U.S", 39.828306, -98.5795], ["Indonesia", -5.0, 120.0], ["Indonesia", -5.0, 120.0], ["Indonesia", -5.0, 120.0], ["Albany", 42.65258, -73.75623], ["Indonesia", -5.0, 120.0], ["U.S", 39.828306, -98.5795], ["Germany", 51.5, 10.5], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Morris", 33.11348, -94.73265], ["Vietnam", 16.16667, 107.83333], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Massachusetts", 42.36565, -71.10832], ["Cape Cod", 41.97324, -70.0384], ["Albany", 42.65258, -73.75623], ["China", 35.0, 105.0], ["Albany", 42.65258, -73.75623], ["France", 46.0, 2.0], ["Switzerland", 47.00016, 8.01427], ["the United states", 39.828306, -98.5795], ["Massachusetts", 42.36565, -71.10832], ["California", 34.68743, -116.78467]], "not_found": ["Middletown WC", "sanctuary city ordinance", "kinda strip"], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Albany", "Washington", "Albany", "San Francisco", "Us", "San Francisco", "California", "San Francisco", "Albany", "Albany", "Albany", "Massachusetts", "Albany", "Albany", "Albany", "Massachusetts", "U.S", "Albany", "U.S", "Albany", "Albany", "Albany", "Morris", "Massachusetts", "Massachusetts", "Massachusetts", "Cape Cod", "Albany", "Albany", "the United states", "Massachusetts", "California"], "out_country": ["Livingston", "Tokyo", "Japan", "South Korea", "China", "Adam", "Adam", "lake George", "Hadley", "Indonesia", "Indonesia", "Indonesia", "Indonesia", "Germany", "Vietnam", "China", "France", "Switzerland"], "in_state": ["Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany", "Albany"], "out_state": ["Livingston", "Washington", "Tokyo", "Japan", "South Korea", "China", "San Francisco", "Us", "San Francisco", "California", "San Francisco", "Adam", "Massachusetts", "Adam", "lake George", "Hadley", "Massachusetts", "U.S", "Indonesia", "Indonesia", "Indonesia", "Indonesia", "U.S", "Germany", "Morris", "Vietnam", "Massachusetts", "Massachusetts", "Massachusetts", "Cape Cod", "China", "France", "Switzerland", "the United states", "Massachusetts", "California"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "Support for WAMC cups of the New York state health department reminding overseas travelers there were a measles outbreaks in many parts of the world including Europe vaccines that should be updated before travel like health dot at why that G. O. V. slash travel\nAnd all the barrier wolf wrote Albany New York newly renovated hotel with flexible meeting space it features such as it re better taping system but we'll check in a bar Albany Mariette dot com\nThis is Northeast Public radio WAMC if that\nMakes the Ninety point three Albany W. R. U. N. H. D. Ninety point three runs in Utica WAMC ... Ninety point nine Kingston WLS sorry she Ninety One seven Middletown double UCLA HD\nNinety One Ninety ... Ninety three three candidates Harry WAMC HD one or two nights ... WAMC ... five one great Barrington W W E s each da da da da da da da and one stamper W. A. N. or eighty eight\nBy Brewster and WAMC am fourteen hundred Albany [noise]\nPublic radio international business is living on earth [noise]\nMight be why me green algae and the red tide in Florida may scale of the upcoming midterm elections\nBut this is the right time for Governor Scott or it is now becoming known on social media they're calling him red tide ... generally when you're a politician you don't want to be a mean and you definitely don't want that name\nToo involved in golf although acclaimed novelist Barbara Kingsolver has a new book out looking at the social and environmental issues of our day and ... century pattern it's called on shelves\nAnd I think we're in the moment when so many things that we've always believed in ... starting to feel not true anymore it's a moment that the crisis\nThose stories and more this week on living on earth to [noise]\nLive from NPR News in Washington I'm ...\nPresident Trump acknowledged today there is no proof that middle Easterners have infiltrated the caravan of Central Americans now making their way to the U.S border NPR's Scott Horsley reports Trump has been issuing dire warnings about the caravan for several days now as you stumped for votes ahead of a mid term elections reporters traveling with us\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine an anterior hip surgery for one three for nine nine six six zero zero\nUnfounded but he continues to insist the caravan and illegal immigration more generally pose a grave threat to the United states certainly you have people\nComing up through the southern border from the middle east and other places that are not appropriate for our country and Tom not letting them in\nWell it's not unheard of for people from the middle east to try to cross the Mexican border it's very rare out of more than three hundred thousand border crossers apprehended last year fewer than a hundred were from the middle east Scott Horsley NPR News the White House\nAnd the strongest response yet to the death of Washington Post columnist or melt cause showed gee the Trump Administration says ... the visas of some Saudi individuals suspected of being involved in his death secretary of state Mike Pompeo speaking at the state department today noted the horrific nature what appears to have gone on inside the Saudi constantly ...\nWe want to make sure that everyone understands that the United states doesn't believe is that the killing of democracy was ah was anything other than a horrific act we hope that we can work together both with Congress and our allies to hold those responsible accountable\nThe Saudis have claimed to show ... inside the consulate after a fire broke out her or fight while they're broke out whoever Turkish authorities said ... was murdered by Saudi operatives\nA law firm representing Roman Catholic sex victims published a report today naming more than two hundred priests from diocese in the San Francisco bay area as Rachel ... reports from member station KCUR ... D the clerics have all been accused of sexual misconduct involving children\nBut we were compiled it part of a lawsuit brought by a Southern California plaintiffs he's demanding a full public accounting firm the entire confines of bishops in the state and eleven diocese attorney Jeff Anderson represents the point is\nThat the you know policy you see in\nThe existence that are suspicious no\nThe archdiocese San Francisco and the guy to San jose say they will review the facts to praise the diagnosis of Oakland which has promised to release its own this next month says it prefers to focus on that task for NPR News I'm Rachel Myra\nStocks after being down sharply earlier in the day recovered a good bit of their losses technical training programs kicked in the Dow ended up down a hundred and twenty five points to twenty five thousand one Ninety One the NASDAQ dropped thirty one points yes it'd be five hundred fell Fifteen points today you're listening to NPR\nForecasters now say that hurricane will has made landfall on Mexico's posted the town of Islam they'll boss in the state of sin to lower the media reports on damage though will up despite weakening to a category three hurricane so headwinds of a hundred and twenty miles an hour when it came ashore Mexican\nAuthorities had already evacuated more than forty two hundred people in towns along the Pacific coast before the storm's arrival\nIndiana's attorney general will not face criminal charges after four women say he inappropriately grow them as Brandon Smith from Indiana Public broadcasting reports a special prosecutor decided not to move forward with the case against the Republican state officials\nFor women a state lawmaker and three legislative staffers say attorney general Curtis Hill grope them at a party in March and investigation describes hills behavior as quote inappropriate creepy an unwelcome Hilda nice touching anyone inappropriately\nA special prosecutor assigned to the case says he wouldn't be able to prove hill committed a crime\nHills attorneys say he's exonerated and absolve the four women are exploring a civil case against tail for NPR News I'm Brandon\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including ... robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nWhen companies such a three year old restaurant delivery service now serves upwards of Ninety eight metropolitan areas in the west that number expected to grow it about two hundred and forty three by year's end reaches a service allows consumers to order food online deliberate costs range from a dollar Ninety nine two seven dollars based on the travel time from the restaurants\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\n[noise]\n\nFrom PR I end the Jennifer and Ted Stanley studios at the University of Massachusetts Boston this is living on Earth I'm Steve her what in Florida large swaths of toxic green algae blooms in so called red tide bloom have been tested shorelines killing marine life harming humans in stifling the tourism industry\nAnd there's a fourth wave that could alter the future of the sunshine state and that's in the twenty Eighteen mid term elections Republican governor and us senatorial candidate Rick Scott has been praised for his handling of hurricane emergencies but he's being blamed by protesters for the massive algae problem\nRick Scott holds a narrow lead in most polls over his Democratic opponent incumbent Senator Bill Nelson but\nAnti algae activists could influence turn out for a look at how the algal blooms might influence Florida politics to November we turn to political senior reporter Michael Grunwald welcome to living on earth thanks for having me\nSo briefly ... just may not be up to speed on this issue what are these red and green toxic algae blooms and why are they impacting Florida's coastline and the first place\nWell as you mentioned we have two different types of algae blooms one is this kind of neon green walk moldy ...\nThat it's toxic and has been linked to cancer and various testicular problems and then you have these sort of rust colored red tide and that's where you've probably seen on TV done millions of fish\nAre rolling up dead on the white sand beaches up the west coast and essentially a you know you're talking about micro organism that\nAs a Rick Scott administration is always pointing out they are\nNaturally occurring but they feed on nutrients the crud that human beings put into the water and that's what really super charges them and make them bloom\nAnd right now we've got a real nutrient problem and that's why you've seen it really you know taking off and destroying the tourist economy on ... ...\nHow important is the health and safety of Florida's waterways to its citizens [laughter]\nWell you know it's that generally that when the the water that's all around that is kind of destroying our health and and I remember I mean most of us\nStreaming support for WAMC comes from my dog ... dot com I no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nThat's right there's a big initiative in Washington state dealing with climate change that also hopes to put a carbon tax within the state is opposed by a lot of fossil fuel introduced a western states petroleum association is the biggest one\nIn Alaska and Montana they're clean water initiatives on the ballot and clean energy initiatives in the states of Arizona and Nevada\nAnd Arizona Nevada also have some pretty close Senate races what else do you have for us today well\nImran Khan was a provincial politician in Pakistan\nHis province had seen huge environmental degradation from deforestation from timber theft\nAnd as a provincial official he proposed the planting of one billion trees in his\nWell that's a big deal\nStreaming support for WAMC comes from my dog hurt is dot com I Know choke no poll dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to Todd walk your dog would love thousands of reviews at my dog hunt S. dot com\nPakistan the fifth most populous country in the world with two hundred and twelve million people and growing fast\nAs it grows the land use issues the deforestation issues become more critical and he's now proposed planting ten billion trees\nHey what do you have from the history of all it's for us this way\nLet's go back to Nineteen twenty nine another instance of draining the swamp from the White House do Warren G heartening administration short lived because Harding died in office but they managed to put together a boat ... his reputation for corruption\nAlbert Fall was be interior secretary and long after Harding died in the administration faded away in Nineteen twenty nine and October Albert Fall was convicted of bribery in an oil scandal that became known as teapot dome\n... and I gather he uh he went to jail huh\nA year in prison plus a hundred thousand dollar fine that was a lot of money back in those days and the hundred thousand dollars ironically exactly match the amount of the bribe each took\nPeter dextrose with environmental health news at each end out Oregon daily climate thought or we will talk to you again real soon Peter\nLooking forward to it Steve thanks a lot\nAnd there's more of these stories at our website L O ... O R G [noise]\nComing up good news for one of the best fly fishing destinations in the U.S that's just a heady around living on her\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend sailors for the the working with both parents to restore ocean health\n\nSupport for WAMC cups and track fall foliage trips aboard the Adirondacks great domed car with with those all sides that overhead Albany to Montreal with stops throughout New York's North Country and track dot com big el brewing\n... open Thursday through Sunday new to seven PM ethic Ailsa loggers ... Massachusetts since two thousand twelve big el beard dot com\nAnd the Empire State plus a performing arts center present take our little Guthrie performing else's restaurant that poor with his band at special guests Sara Lee ... three October twenty six and seven thirty PM the eggs stuff or [noise]\n\n\n\nIs living on Earth I'm Steve her what when hurricane Michael came ashore in the panhandle of Florida on October tenth it shredded buildings with the sheer force of its category for wins and swept away entire neighborhoods with an eight to twelve foot storm surge\nMichael is the third strongest hurricane ever to make landfall in the continental United States it pass through quickly though and dropped less rain and other recent major hurricane such as Laurence Harvey Irma and Maria [noise] only the Labor Day hurricane of Nineteen thirty five and hurricane coming\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\n[noise] and\nEven some storm experts were surprised by how hurricane Michael intensified from a category one to a category four in just twenty four hours\nHere to talk about this unprecedented storm and it's possible Climate Connections we welcome another Michael back to the show Michael Mann is a climate expert at Penn State University Welcome back to living on earth Michael\nThinks the if it's good to be with you so why did hurricane Michael intensify so quickly\nSo it encountered warm a sea surface temperatures I'm In the low eighties in the region where it intensified and became a major hurricane those temperatures are between two to three degrees Celsius above pre industrial temperatures\nWhy is that why was the water so warm there there's just a fluke or are we looking at a trend\nSo there's been a degree Celsius of warming globally the oceans of warmed up and it's an ocean heat waves and an ocean heat wave just like a normal heat wave is made much more likely with even a modest warming of the planet\nA hurricane Michael brought some pretty intense storm surges eight twelve feet and some of the coastal areas there how much the sea level rise factor into the storm surge these days well\nYou know sea level rise depending on where you are in the Gulf Coast or the U.S east coast or has been somewhere between half a foot and a foot and that's the warming of the planet the melting the ice that's us sea level rise adds to the storm surge of every single storm that makes landfall in the case of Sandy a Superstorm Sandy and twenty twelve at at at a foot\nTwo that are Thirteen foot storm surge might sound like a modest amount or one foot well it meant twenty five more square miles of a coastal flooding they've been several\nBillion dollars worth of additional damage um same thing with Florence making landfall in North Carolina again about a foot of sea level rise added to that storm surge\nHow much more frequent will be storms be particularly the hurricane Michael type this sort of intense quick pop up\nOne of the things that we're seeing with warming warmer ocean temperatures you're more likely to see what we call rapid intensification and we we've seen this now so many times where a storm balloons from a minor tropical storm to a major hurricane over the course of a day or two\nAnd that only happens over very warm sees and are we getting more\nOf these very intense storm these categories you know three four five storms and that's where the science is actually the strongest in fact there's a relationship for\nA category five storm you get an increase of roughly seven percent in the maximum wind speeds for each degree Fahrenheit warming of the ocean now that seven percent increase in wind speed might sound modest but the destructive potential of a storm\nGoes as the third power of the wind speed so with seven percent increase in wind speed is it Twenty one percent increase in the destructive potential of the storm that's for one degree Fahrenheit well with Michael those temperatures were two to three degrees Celsius above pre industrial temperatures if\nYou do the math that means it was probably twice as destructive as it would have been in the absence of human caused warming\nNow the latest inter governmental panel on climate change report is saying that the world faces perhaps more severe climate impacts of global ever surface temperatures rise more than one and a half degrees Celsius both the pre industrial temperatures\nStreaming support for WAMC come from Tom ... what's the warmth in homes and businesses throughout the northeast today's self stoking automated would heat would boilers dot com\nThe world it's more than one and a half degrees warmer than before the industrial age\nYeah so for each you know half a degree Celsius the better part of one degree Fahrenheit right there that's the Twenty one percent increase in the destructive potential the storm that means noticeably more damage it also means for each half a degree Celsius you have a about four percent\nMore moisture in the atmosphere so you're going to increase the potential for those flooding rains and of course it's impacting uh lots of other weather extremes and global sea level rise and all of these other attributes of climate that we are sensitive to\nIn the past or the PC has been the conservative that when the data comes into the projections have been uh been lower than the actual uh numbers how do you think this report will fare or when the actual data comes in\nYeah so I I criticize this latest report or for once again being overly conservative and its portrayal of the science and and I'll tell you it has to do with a very specific criticism in this case it's the way that they measured the warming that has happened and the PCC has chosen\nTo measure the overall warming that's taken place\nUsing a baseline that starts in the late Eighteen hundreds and and the reason for that is well that's how far back to their mom and her measurements go here's the problem human caused warming began back in the Seventeen hundreds when you know industrialization began so every tenth of a degree Celsius\nOf warming that's happened makes it that much more difficult to stabilize below one point five maybe it's impossible now one point five\nSupport for WAMC cups of the discovery center present the October programs ... guided by hikes and exploration of the worlds of ALS coyotes Albany pie Bush dot org\nThe blue marble a world of gifts on most plus history it adverse to imports marketplace Northampton offering their heads elected collection of jewelry scarves pottery well art and gifts the blue marble duck biz\nIntrusive expect musical presenting the cosmetics performing Woody Guthrie's joy is happy Hanukkah three holiday songs intermingle ... with American Folk and bluegrass Saturday December first Troy musical dot org\n[noise]\n\nLiving on Earth I'm Steve her what\nThe more things change the more they stay the same goes the French aphorism popular author Barbara Kingsolver has a brilliant take on these unsettling time in her new novel on sheltered\nIt's a creative look at a family crisis in modern America Laird over the narrative of a story that unfolded in the same New Jersey town over a century earlier\nVineland New Jersey was first settled in the late Eighteen hundreds that's utopian experiment and the social issues there as a magic than Barbara Kingsolver book on shelter resident equally with America's reality back\nThen and today she joins us now welcome back to living on her Hi thanks for having me\nBarbara Kingsolver this is your first novel and what six years so what brought you the idea of writing what became an sheltered now\nWell it's one of those books that took a while to ... I spent several years thinking about\nHow to write about paradigm shift that's what I think\nWe're doing right now I think we're in the moment when so many things that we've always\nBelieved in as truth unquestionable are suddenly starting to feel not true anymore it's a moment that feels like crisis like the end of the world as we know it and when I say permanent truth thing it's like\nWell like there will always be a job at the end of the college degree or tenure at the end of the track or or a a pension at the end of a career or good health care or even things like ice on the poll\nThat will stay frozen or that there will always be more efficient messy we're reaching a moment in history when\nAll those shelters are failing us\nSo your device if I can use that word of course is to have to families yeah living more than a century apart yeah in the same house right\nStreaming support for WAMC comes from my dog ... dot com a no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nBoom hurricane or maybe there's going to be a huge forest fire or or whatever but you yourself you move from the southwest back to Virginia because you could see that they're going to be too much water there is an exactly\nExactly that it was already functioning kind of like a spaceship that everything people use their needed to be brought in from the outside and in fact we are kind of living\nOn a spaceship and we've been\nLiving on it for so long well I mean not in terms of\nYou know human evolution but in terms of presents civilization we've been just operating on the presumption that our culture and our economy can grow infinitely just the presumption of infinite gross I'm\n... and somewhere and\nWe just keep throwing more more of the same old request\nAt the world of give me more give me more let's grow more or less um growth in consumption are are the answer a seemed to be the answer to our prayers so what happens when it seems like you're praying the wrong prayer\nSo if I were to go through the various issues that are confronting people to the side from\nThe fact that it does seem kind of falling apart just sort of randomly you address parenting romance among grownups women and science of evolution climate feral cats bought me fresh local food suicide tenure boat and did I leave out Trump [laughter]\nI Hope [laughter] I Know he's not he's not mentioned by name any resemblance to people living or dead is a pure coincidence\nOh so you're a lawyer told you to say [laughter] I don't want to get those tweets [laughter] [noise]\nNo without giving too much away let's talk let's talk more about the historical aspects of this book [noise] the next door neighbor married ... very much a a real scientist what lured you to include Mary Treat and the story\nThe twenty first century story of either all characters of my invention living through very real uncertainty however the character's living sort of at the corner of six street and disaster in Eighteen Seventy five\nAre real they're mostly real people so Mary Treat the naturalists who is that the next door neighbor who becomes a\nKind of a larger than life figure she was real she's a real person who I found it fascinating to research she really was the lightning rod for this novel but it took me to find land\nI as I said I was thinking for a\nCouple of years about how to get into this big question about\nHow people behave in times of crisis and I had chosen\nI knew that I wanted to set it in two different centuries and my historical story around the time of the release of Darwin's two bucks which is\nPretty much blue everybody's mind not generally in a good way mostly for the worse it was really unsettling powerfully disorienting for people to encounter the proposition that possibly humans were not put here to rule the\nStreaming support for WAMC come from Berkshire orthopedic associates an affiliate of Berkshire health systems providing orthopedic services in the Berkshires including may go robotic surgery sports medicine and anterior hip surgery for one three for nine nine six six zero zero\nNow so I wanted I wanted to set\nThe earlier part of the novel in the middle of that that moment when Darwin had released his books and I wanted to find a champion of Darwin who lived in the U.S [noise] and I looked\nI looked at Darwin himself I read a lot about his correspondents in the U. S. I read a lot about aids and gray Iran across the name\nMary Treat a woman I never heard mentioned before she's not very well known I looked a little deeper and discovered\nShe had a really interesting life and she lives in Vineland that's utopian community and so I went there I read her archive I walked around find land and discovered that the place that's exactly the place I wanted to set this book\nNot to mention that she was a woman and science yeah we did a great job the when markedly unrecognized she has a personal correspondence with Charles Darwin\nNobody knows about her she wrote a lot about nature for people who are not scientists a lot of her work was published in the Atlantic monthly and Harper's so she was ... she was really interesting woman who could\nTalk to people at every level from Charles Darwin to the ladies botany clubs that she founded in her town so she had this\nI like to think of as a particularly wall mentally\nCapacity to be acceptable to really make her science comprehensible\nYou know what the way into her story reminds me of the story Barbara McClintock roads\nYou know she gets in a Nobel Prize in physiology and yet she wasn't taken seriously for what you do them with genes and corn and all that if you had to stop publishing at one point um so I have a question for you along these lines about how women are\nBoth ignored and the work that they do but also in education\nHow different do you think the American discussion about climate change climate disruption today would be if in fact women overtime had been well integrated into science and technology and such\nWell that's a fascinating theoretical question and I can't\nReally imagine how I Would\nAnswer it and in a scientific way because there's no control group there's no alternate universe where women were allowed to be scientists freely but I think so much about Rachel Carson she's the person I I really admire\nThe first person in the United states to speak to to speak beyond scientific circles to everyday people if you look at Silent Spring\nIt's an amazing document it with a best selling work of non fiction it was very readable very accessible and the years of its publication and if you look in that book it has chemical formulas in it it doesn't drawings of carbon Adam and I think", "year": "2018", "show_name": "Living on Earth (PRI)", "city": "Albany", "day": "24", "locations": [["New York", 40.71427, -74.00597], ["Albany New York", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Albany", 42.65258, -73.75623], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["U.S", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["the United states", 39.828306, -98.5795], ["San Francisco", 37.77493, -122.41942], ["San jose", 9.93333, -84.08333], ["Oakland", 37.80437, -122.2708], ["Mexico", 23.0, -102.0], ["Islam", 30.30276, 67.08982], ["Indiana", 40.00032, -86.25027], ["Indiana", 40.00032, -86.25027], ["Washington", 38.89511, -77.03637], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["Alaska", 64.00028, -150.00028], ["Montana", 47.00025, -109.75102], ["Arizona", 34.5003, -111.50098], ["Nevada", 39.25021, -116.75119], ["Imran", 30.65528, 66.42745], ["Pakistan", 30.0, 70.0], ["Pakistan", 30.0, 70.0], ["Oregon", 44.00013, -120.50139], ["U.S", 39.828306, -98.5795], ["Albany", 42.65258, -73.75623], ["Montreal", 45.50884, -73.58781], ["New York's", 40.77205, -73.93014], ["Massachusetts", 42.36565, -71.10832], ["the Empire State", 40.71427, -74.00597], ["Florida", 28.75054, -82.5001], ["United States", -14.60485, -57.65625], ["Maria", 16.59796, -22.90509], ["U.S", 39.828306, -98.5795], ["North Carolina", 18.38078, -65.95739], ["Albany", 42.65258, -73.75623], ["Troy", 18.24924, -77.60978], ["America", 39.828306, -98.5795], ["New Jersey", 40.72816, -74.07764], ["Vineland New Jersey", 39.48623, -75.02573], ["America", 39.828306, -98.5795], ["Virginia", 38.34982, -81.63262], ["U.S", 39.828306, -98.5795], ["the U. S.", -14.60485, -57.65625], ["Iran", 32.0, 53.0], ["Vineland", 39.48623, -75.02573], ["the United states", 39.828306, -98.5795]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["New York", "Albany New York", "Albany", "Albany", "Albany", "Florida", "Washington", "U.S", "the United states", "the United states", "San Francisco", "Oakland", "Indiana", "Indiana", "Washington", "Florida", "Florida", "Florida", "Florida", "Washington", "Alaska", "Montana", "Arizona", "Nevada", "Oregon", "U.S", "Albany", "New York's", "Massachusetts", "the Empire State", "Florida", "U.S", "Albany", "America", "New Jersey", "Vineland New Jersey", "America", "Virginia", "U.S", "Vineland", "the United states"], "out_country": ["Utica", "San jose", "Mexico", "Islam", "Imran", "Pakistan", "Pakistan", "Montreal", "United States", "Maria", "North Carolina", "Troy", "the U. S.", "Iran"], "in_state": ["New York", "Albany New York", "Albany", "Albany", "Albany", "Albany", "New York's", "the Empire State", "Albany"], "out_state": ["Utica", "Florida", "Washington", "U.S", "the United states", "the United states", "San Francisco", "San jose", "Oakland", "Mexico", "Islam", "Indiana", "Indiana", "Washington", "Florida", "Florida", "Florida", "Florida", "Washington", "Alaska", "Montana", "Arizona", "Nevada", "Imran", "Pakistan", "Pakistan", "Oregon", "U.S", "Montreal", "Massachusetts", "Florida", "United States", "Maria", "U.S", "North Carolina", "Troy", "America", "New Jersey", "Vineland New Jersey", "America", "Virginia", "U.S", "the U. S.", "Iran", "Vineland", "the United states"]}, {"month": "10", "state": "NY", "station": "WAMC", "content": "With a showcase for their jewelry gifts and women's fashion handmade and more on Facebook\nAnd from Laurie Donovan designs Lenexa creators of handmade jewelry for over forty years offering contemporary end estate jewelry colored gemstone plus repair fussing and repairs of fine jewelry Laurie Donovan dot com\n[noise]\nThis is Northeast Public radio WAMC if that makes the Ninety point three Albany W. R. U. N. H. D. Ninety point three rooms in Utica WAMC ... Ninety point nine Kingston WLS our age the Ninety One seven\nMiddletown double UCLA ... Ninety One Ninety ... Ninety three three Kennedy Harry WAMC age do you want to pre nine taekwondo rogue of WAMC wage do you want to five one great Barrington W W E s each da da na na na Kisco W. A. N. D. H. D. Ninety point one stamper W. A. N. or eighty five\nBrewster and WAMC am fourteen hundred Albany\nPublic radio international business is living on her and\nHer ... why me green algae and the red tide in Florida may be scaled the upcoming midterm elections but\nThis is the wrong time for governor God or is he now becoming known on social media they're calling them red tide ... generally when you're a politician you don't want to be a mean and you definitely don't want that seem\nTo involve golf although acclaimed novelist Barbara Kingsolver has a new book out of being a social and environmental issues of our day and ... century pet\nIt's called on shelves [noise]\nI think we're in the moment when so many things that we've always believed in our suddenly starting to feel not true anymore it's a moment that feels like crisis [noise] those stories and more this week on living on her around [noise]\nBlood from NPR News in Washington I'm ... President Trump says he accepts Saudi Arabia explanation for how Washington Post writer ... died after two weeks of denial Saudi Arabian ounces ... was\nKilled in the Saudi conflict in just stumbled supposedly after a fight broke out Eighteen people under arrest including to advisors to the Saudi crown prince Peter Kenyon reports from Istanbul\nStreaming support for WAMC comes from my dog harness dot com no joke no poll Doug harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog would love thousands of reviews at my dog ... dot com\nBrie and making it look or less and less tenable and now a very late at night the Saudis have come out with an official statement admitting yes he's dead we have these people under arrest and we'll just have to see where it goes from here\nPresident Trump says the Saudi explanation is a good first step though some us lawmakers are skeptical\nAfghans heading to polling stations to cast their vote in the first parliamentary elections to be held in eight years are voting today in defiance of the Taliban and ISIS which of attack candidates and the election rallies and they threatened to disrupt today's voting\nImpairs the deed reports from Muslim about\nThe police chief was assassinated by his buddy got in a brazen Taliban attack\nIn ... during a high level meeting in Kandahar to discuss security plant a parliamentary elections expected the Saturday now voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been beset by deadly militant attacks and controversy\nTo the Indian our officials have declared a state of mourning today after yesterday's train accident at least fifty nine people are dead dozens were injured when the training crab ran into a crowd goes on to gathered on the tracks up or a festival in northern India\n... only independent governor Alaska's bill Walker has ended his reelection campaign from member station K T O O Andrew kitchen been reports\nWalker shocked the audience at the convention of the largest Alaska Native organization the Alaska federation of natives effective today\nBy excess spending campaign [noise]\nFor the re election as Governor Walker through his support to democratic former U.S Senator Mark baggage Walker expressed concern that the Republican candidate former state senator Mike Dunn wavy could reverse the state's Medicaid expansion\n... has been leading in polls the decision comes days after walkers lieutenant governor Byron ... resigned over what Walker says was a quote inappropriate overture and quote to an unnamed female for NPR News I'm Andrew kitchen ... in June out\nA mega millions lottery jackpot climbing again the lottery now says it's up to one point six billion dollars after no winning tickets sold for last night's drawing this is NPR News\nSupport for NPR comes from the NPR stations other contributors include ISI empty foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the emcee foundation dot org\nThis is WAMC regional News I'm Luke ... two congressional candidates in New York's nineteenth districts have been reaching out to veterans W AMC's Alison done reports\nAntonio Delgado on October Eighteenth launched a veterans advisory council pat Ryan in Iraq War combat veteran who had run against all got away and five others and a Democratic primary led the first meeting\nDelgado says if elected he would push back against efforts to privatize the department of Veterans Affairs making sure that all veterans receive access to the highest quality healthcare\nMeantime Republican Congressman John ... I was holding a veterans' resource fair Saturday October twenty at from ten thirty to twelve thirty a pleasant valley town hall in Dutchess County it's hosted seven other such fares throughout the district I'm Alex ... W. A. M. C.\nStreaming support for WAMC comes from my dog harness dot com I Know choke no poll dog harness invented to make it easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to Todd walk your dog with love thousands of reviews at my dog harness dot com\nBench at the Massachusetts state trooper sustained to stab wound to the head and neck shoulders hand arm on friday well trying to apprehend an Eighteen year old\nWho had earlier flood a traffic stop authorities say the teenager was shot in the torso by the trooper and both were taken to the hospital with serious injuries the confrontation occurred in New Salem\nThe forecast today\nPartly sunny where the chance of showers hides in the upper fifties and lower sixties support comes from the window WAMC is performing arts studio presenting a range of concerts film theater and discussions for the capital region build into dot ORG\nLiving on earth continues its six so six\n[noise]\nFrom PR I Am a Jennifer and Ted Stanley studios at the University of Massachusetts Boston\nIs living on Earth I'm Steve ...\nIn Florida large swaths of toxic green algae blooms in so called red tide bloom have infested shorelines killing marine life harming humans in stifling the tourism industry\nAnd there's a fourth wave that could alter the future of the sunshine state and that's in the twenty Eighteen mid term elections Republican governor and us senatorial candidate Rick Scott has been praised for his handling of hurricane emergencies but he's being blamed by protesters for the massive algae problem\nRick Scott holds a narrow lead in most polls over his Democratic opponent incumbent Senator Bill Nelson but\nAnti algae activists could influence turn out for a look at how the algal blooms might influence Florida politics in November we turn to political senior reporter Michael Grunwald welcome to living on her thanks for having me\nSo briefly for our listeners just may not be up to speed on this issue what are these red and green toxic algae blooms and why are they impacting Florida's coastline and the first place\nWell as you mentioned we have two different types of algae blooms wanted this kind of neon green walk moldy ...\nThat it's toxic and uh it's been linked to cancer and various testicular problem and then you have this sort of rust colored red tide and that's where you've probably seen on TV the millions of fish\nAre rolling up dead on the white sand beaches up the west coast and essentially a you know you're talking about microorganisms that\nAs a Rick Scott administration is always pointing out they are naturally\nOccurring but they feed on nutrients the crowd that human being put into the water and that's what really super charges them and make them bloom\nAnd right now we've got a real nutrient problem and that's why you've seen it really you know taking off and describing the tourist economy on both coasts\nHow important is the health and safety of Florida's waterways to its citizens [laughter]\nYou know it's that generally bad when the water that's all around that is kind of destroying our health and I don't remember I mean most of us came down here because it's not Florida is environment\nStreaming support for WAMC comes from my dog ... dot com I no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog harness dot com\nThat's right there's a big initiative in Washington state dealing with climate change that also hopes to put a carbon tax within the state it's opposed by a lot of fossil fuel introduced the western states petroleum association it's the biggest one\nIn Alaska and Montana they're clean water initiatives on the ballot and clean energy initiatives in the states of Arizona and Nevada\nAnd Arizona Nevada also have some pretty close Senate races what else do you have for us today\nWell Imran Khan was a provincial politician in Pakistan\nHis province had seen huge environmental degradation from deforestation from timber theft\nAs a provincial official he proposed the planting of one billion trees in his\nProvince well that's a big deal how well did it work\nDidn't get anywhere near a billion but they still manage\nStreaming support for WAMC comes from my dog harness dot com and no ... no poll Doug harness invented to make a lot easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog with love thousands of reviews at my dog hunt S. dot com\nWorld with two hundred and twelve million people and growing fast as it grows the land use issues the deforestation issues become more critical and he's now proposed planting ten billion trees\nHey what are you from the history of all it's for us this way\nLet's go back to Nineteen twenty nine another instance of draining the swamp from the White House do Warren G heartening administration short lived because Harding died in office but they managed to put together a boat ... reputation for corruption\nAlbert Fall was the interior secretary and long after Harding died in the administration faded away in Nineteen twenty nine and October Albert Fall was convicted of bribery in an oil scandal that became known as teapot dome\n... and I gather he uh he went to jail for\nA year in prison plus a hundred thousand dollar fine that was a lot of money back in those days and the hundred thousand dollars ironically exactly match the amount of the bribe you took\nPeter ... is with environmental health news at each end out Oregon daily climate thought or we will talk to you again real soon Peter looking forward to it Steve thanks a lot and there's more on these stories at our website that Lolita oh Archie [noise]\nComing up good news for one of the best fly fishing destinations in the U.S that's just a heavier on living on her\nSupport for a living on earth comes from the Gordon and Betty Moore foundation and from a friend of St Louis for the the working with both parents to restore ocean health\nSupport for WAMC comes from buttermilk falls in and spawn Milton taking reservations for mid week fall states tonight's apple picking and picnicking at two boys farms through October thirty first buttermilk falls in dot com\nHoliday Inn express downtown Albany New York newly renovated hotel just blocks from the state capital offering accommodations including shuttle parking and breakfast\nH. G. dot com for bookings\nDr Lucy ... them a plastic surgeon dedicated to instead of cosmetic surgery procedures including fat transfers facial rejuvenation breast augmentation ... skin care since Nineteen Ninety six five one eight seven eight six one seven zero zero\nAnd from the nineteenth animal film Columbia festival with feature and independent films from around the world plus filmmaker events parties and the sneak peek through October twenty eighth inch out of New York film Columbia dot org for\nIt's living on Earth I'm Steve her what when hurricane Michael came ashore in the panhandle of Florida on October tenth it shredded buildings with the sheer force of its category for when and swept away entire neighborhoods with an eight to twelve foot storm surge\nMichael is the third strongest hurricane ever to make landfall in the continental United States it passed through quickly though and dropped to less rain and other recent major hurricane such as Laurence Harvey Irma and Maria\nOnly the Labor Day hurricane of Nineteen thirty five and hurricane Camille in Nineteen sixty nine had lower their mess\nStreaming support for WAMC comes from my dog harness dot com I no ... no poll dog harness invented to make a lot easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tag walk your dog would love thousands of reviews at my dog hunt S. dot com\nHere to talk about this unprecedented storm and it's possible Climate Connections we welcome another Michael back to the show Michael Mann is a climate expert at Penn State University Welcome back to living on earth Michel thanks deep it's good to be with you so why did hurricane Michael intensify so quickly\nSo it encountered warm a sea surface temperatures I'm In the low eighties in the region where it intensified and became a major hurricane those temperatures are between two to three degrees Celsius above pre industrial temperatures\nWhy is that why was the water so warm there there's just a fluke or we're looking at a trend\nSo there's been a degree Celsius of warming globally the oceans of warmed up and it's an ocean heat waves and an ocean heat wave just like a normal heat wave is made much more likely with even a modest warming of the planet\nA hurricane Michael brought some pretty intense storm surges eight twelve feet and some of the coastal areas there how much the sea level rise factor into storm surge these days well\nYou know sea level rise depending on where you are in the Gulf Coast or the U.S east coast or has been somewhere between half a foot and a foot and that's the warming of the planet the melting the ice that's us sea level rise adds to the storm surge of every single storm that makes landfall in the case of Sandy a Superstorm Sandy and twenty twelve at at at a ... foot\nTwo that are Thirteen foot storm surge might sound like a modest amount or one foot well it meant twenty five more square miles of a coastal flooding they've been several\nBillion dollars worth of additional damage um same thing with Florence making landfall in North Carolina again about a foot of sea level rise added to that storm surge\nHow much more frequent will be storms be particularly the hurricane Michael type this sort of intense quick pop up\nOne of the things that we're seeing with warming warmer ocean temperatures you're more likely to see what we call rapid intensification and we we've seen this now so many times where a storm balloons from a minor tropical storm to a major hurricane over the course of a day or two\nAnd that only happens over very warm sees and are we getting more\nOf these very intense storm these category ... you know three four five storms and that's where the science is actually the strongest in fact there's a relationship\nFor a category five storm you get an increase of roughly seven percent in the maximum wind speeds for each degree Fahrenheit warming of the ocean now that seven percent increase in wind speed might sound modest but the destructive potential of a storm\nGoes as the third power of the wind speed\nSo it was seven percent increase in wind speed is it Twenty one percent increase in the destructive potential of the storm that's for one degree Fahrenheit well with Michael those temperatures were two to three degrees Celsius above pre industrial temperatures if you do the math\nThat means it was probably twice as destructive as it would have been in the absence of human caused warming\nNow the latest in a governmental panel on climate change report is saying that the world faces perhaps more severe climate impacts of global ever surface temperatures rise more than one and a half degrees Celsius both the pre industrial temperatures what do we know now about how hurricanes could behave\nStreaming support for WAMC comes from my dog harness dot com I no ... no poll dog harness invented to make a lot easier for both dogs and humans crafted in the ... since two thousand six\nNo need to pull no need to tug walk your dog with love thousands every means at my dog hunt S. dot com\nThere that's a Twenty one percent increase in the destructive potential the storm\nThat means noticeably more damage it also means for each half a degree Celsius you have a about four percent more moisture in the atmosphere so you're going to increase the potential for those flooding rains and of course it's impacting\nUh lots of other weather extremes and global sea level rise and all of these other attributes of climate that we are sensitive to\nIn the past or the PC has been the conservative that when the data comes into the projections have been uh been lower than the actual uh numbers how do you think this report will fare or when the actual data comes in\nYeah so I I've criticized this latest report or for once again being overly conservative and its portrayal of the science and and I'll tell you it has to do with a very specific criticism in this case it's the way that they measured the warming that has happened and the PCC has chosen\nTo measure the overall warming that's taken place\nUsing a baseline that starts in the late Eighteen hundreds and and the reason for that is well that's how far back with their mom and her measurements go here's the problem human caused warming began back in the Seventeen hundreds when you know industrialization began so every tenth of a degree Celsius\nOf warming that's happened makes it that much more difficult to stabilize below one point five maybe it's impossible now one point five\nSupport for WAMC comes from the arts had Hodgkin's like ville Connecticut presenting forests field in water history of the hodgkiss landscape through October twenty first for main art gallery hodgkiss dot org slash arts\nThe V. in a hospice of the southwest region providing home health care and hospice care since Nineteen forty six throughout Bennington and ... counties\nVermont visiting nurses dot org Norman Rockwell's museum Stockbridge presenting the final days of parish Wyeth and rock well an scratch board illustrator breed hermanson today if I ... and our em dot org [noise]\nAgricultural stewardship association helping people can serve farmland in the upper Hudson Valley we conserve good farmland for good forever A. G. stewardship dot org and from Hancock shaker village a place to explore the legacy of the shakers heirloom gardens historic buildings are seasonal festivals\nFarm to table concerts inhale off hand cake Hancock shocker village dot org\nThe more things change the more they stay the same goes the French aphorism and popular author Barbara Kingsolver has a brilliant take on these unsettling time in her new novel on sheltered\nIt's a creative look at a family crisis and modern America Laird over the narrative of a story that unfolded in the same New Jersey town over a century earlier\nVineland New Jersey was first settled in the late Eighteen hundreds of utopian experiments and the social issues there as a magic wand and Barbara Kingsolver book on shelter resident equally with America's reality back then\nAnd today she joins us now welcome back to living on her Hi thanks for having me Barbara Kingsolver this is your first novel and what six years so what brought you the idea of writing what became an sheltered now\nWell that's one of those books that took a while to ... I spent several years thinking about\nHow to write about paradigm shift that's what I think\nWe're doing right now I think we're in the moment when so many things that we've always\nBelieved in as truth unquestionable are suddenly starting to feel not true anymore it's a moment that feel like ... like the end of the world as we know it and when I say permanent truth thing it's like\nWell like there will always be a job at the end of the college degree or tenure at the end of the track or or a a pension at the end of a career or good health care or even things like ice on the poll\nThat will stay frozen or that there will always be more efficient at sea we're reaching a moment in history when all those shelters are failing at\nSo your device if I can use that word of course is to have to families yeah living more than a century apart yeah in the same house\nRight and of course it's falling\nStreaming support for WAMC comes from my dog ... dot com a no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nGoing to be a huge forest fire or or whatever in fact you yourself you move from the south west back to Virginia because you could see that they're going to be too much water there in Arizona\nFactly exactly that that was already functioning kind of like a spaceship that everything people use their needed to be brought in from the outside and in fact we are kind of living on a spaceship and we've been\nLiving on it for so long well I mean not in terms of\nYou know human evolution but in terms of presence civilization we've been just operating on the presumption that our culture and our economy can grow infinitely just a presumption of infinite gross I'm\n... and somewhere and\nWe just keep throwing more more of the same old request\nAt the world of give me more give me more or less grow more or less um growth and consumption are are the answer a seem to be the answer to our prayers so what happens when it seems like you're praying the wrong prayer\nSo if I were to go through the various issues that are confronting people to the side from\nThe fact that it does seem kind of falling apart just sort of randomly you address parenting romance among grown ups women and science of evolution climate feral cats bought me fresh local food suicide tenure boat and did I leave out Trump\n[laughter] I Hope [laughter]\nI Know he's not he's not mentioned by name any resemblance to people living or dead is a pure coincidence\nOh so you're a lawyer told you to say [laughter] I don't want to get those tweets [laughter]\n[noise] no without giving too much away let's talk let's talk more about the historical aspects of this book [noise] the next door neighbor married ... very much a a real scientist what lured you to include Mary Treat in the store\nThe twenty first century story of either all characters of my invention living through very real uncertainty however the character's living sort of at the corner of six straight and disaster in Eighteen Seventy five\nAre real they're mostly real people so Mary Treat the naturalist who is the next door neighbor who becomes a\nKind of a larger than life figure she was real she's a real person who I found it fascinating to research she really was the lightning rod for this novel but it took me to find land\nI as I said I was thinking for a couple of years about how to get into this big question about how people behave in times of crisis and I had chosen\nI knew that I wanted to set it in two different centuries and my story I'll call story around the time of the release of Darwin's two bucks which just\nPretty much blue everybody's mind not generally in a good way mostly for the worse it was really unsettling powerfully disorienting for people to encounter the proposition that possibly\nHumans were not put here to rule the earth that we actually\nStreaming support for WAMC comes from my dog ... dot com a no ... no ... dog harness invented to make walks easier for both dogs and humans crafted in the Berkshires since two thousand six\nNo need to pull no need to tug walk your dog with love thousands of reviews at my dog ... dot com\nThe earlier part of the novel in the middle of that that moment when Darwin had released his books and I wanted to find a champion of Darwin who lived in the U.S [noise] and I looked\nI looked at Darwin himself I read a lot about his correspondents in the U. S. I read a lot about a third grade I ran across the name Mary\nTreat a woman I'd never heard mentioned before she's not very well known I looked a little deeper and discovered\nShe had a really interesting life and she had lived in Vineland that's utopian community that's how I went there I read her archives I walked around find land and discovered that the place that's exactly the place I wanted to set this book\nNot to mention that she was a woman in science yeah we did a great job the ... um recognize she has his personal correspondence with Charles Darwin\nNobody knows about her she wrote a lot about nature for people who are not scientists a lot of her work was published in the Atlantic monthly and Harper's\nSo she was ... she was really interesting woman who could talk to people at every level from Charles Darwin to the ladies botany clubs that she founded in her town so she had this\nI like to think of as a particularly woman Lee\nCapacity to be accessible to really make her science comprehensible\nYou know what the way into her story reminds me of the story of Barbara McClintock roads [noise]\nShe guessing a Nobel Prize in physiology and yet she wasn't taken seriously for what you do them with genes and corn and all that if you had to stop publishing at one point um [noise] so I have a question for you along these lines about how women are\nBoth ignored in the work that they do but also in education\nHow different do you think the American discussion about climate change climate disruption to do would be if in fact women over time have been well integrated into science and technology such\nWell that's a fascinating theoretical question and I can't\nReally imagine how I Would\nAnswer it and in a scientific way because there's no control group there's no alternate universe where women were allowed to be scientists freely but I think so much about Rachel Carson she's the person I I really admire\nThe first person in the United states to speak to to speak beyond scientific circles to everyday people if you look at Silent Spring\nIt's an amazing document it with a best selling work of nonfiction it was very readable very accessible and the years that publication and if you look in that book it has chemical formulas in it it has been drawing of carbon Adam and I think", "show_name": "Living on Earth (PRI)", "year": "2018", "city": "Albany", "day": "20", "locations": [["Albany", 42.65258, -73.75623], ["Utica", 5.16977, -74.50134], ["Middletown", 39.51506, -84.39828], ["taekwondo", 51.04623, 6.99337], ["Albany", 42.65258, -73.75623], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["Saudi Arabia", 25.0, 45.0], ["Istanbul", 41.01384, 28.94966], ["Kandahar", 31.61332, 65.71013], ["Kandahar", 31.61332, 65.71013], ["India", 22.0, 79.0], ["Alaska", 64.00028, -150.00028], ["Alaska", 64.00028, -150.00028], ["U.S", 39.828306, -98.5795], ["New York's", 40.77205, -73.93014], ["Dutchess County", 41.70037, -73.92097], ["Massachusetts", 42.36565, -71.10832], ["New Salem", 44.9429, -123.0351], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Florida", 28.75054, -82.5001], ["Washington", 38.89511, -77.03637], ["Alaska", 64.00028, -150.00028], ["Montana", 47.00025, -109.75102], ["Arizona", 34.5003, -111.50098], ["Nevada", 39.25021, -116.75119], ["Pakistan", 30.0, 70.0], ["Oregon", 44.00013, -120.50139], ["Archie", 50.45969, -101.28216], ["U.S", 39.828306, -98.5795], ["St Louis", 16.01793, -16.48962], ["Albany New York New York", 42.65258, -73.75623], ["Florida", 28.75054, -82.5001], ["United States", -14.60485, -57.65625], ["Maria", 16.59796, -22.90509], ["U.S", 39.828306, -98.5795], ["North Carolina", 18.38078, -65.95739], ["Connecticut", 41.66704, -72.66648], ["Bennington Vermont", 42.87813, -73.19677], ["America", 39.828306, -98.5795], ["New Jersey", 40.72816, -74.07764], ["Vineland New Jersey", 39.48623, -75.02573], ["America", 39.828306, -98.5795], ["Virginia", 38.34982, -81.63262], ["Arizona", 34.5003, -111.50098], ["U.S", 39.828306, -98.5795], ["the U. S.", -14.60485, -57.65625], ["Vineland", 39.48623, -75.02573], ["the United states", 39.828306, -98.5795]], "not_found": [], "ep_coords": ["Albany, NY", 42.65258, -73.75623], "in_country": ["Albany", "Middletown", "Albany", "Florida", "Washington", "Alaska", "Alaska", "U.S", "New York's", "Dutchess County", "Massachusetts", "New Salem", "Florida", "Florida", "Florida", "Florida", "Florida", "Washington", "Alaska", "Montana", "Arizona", "Nevada", "Oregon", "U.S", "Albany New York New York", "Florida", "U.S", "Connecticut", "Bennington Vermont", "America", "New Jersey", "Vineland New Jersey", "America", "Virginia", "Arizona", "U.S", "Vineland", "the United states"], "out_country": ["Utica", "taekwondo", "Saudi Arabia", "Istanbul", "Kandahar", "Kandahar", "India", "Pakistan", "Archie", "St Louis", "United States", "Maria", "North Carolina", "the U. S."], "in_state": ["Albany", "Albany", "New York's", "Dutchess County", "Albany New York New York"], "out_state": ["Utica", "Middletown", "taekwondo", "Florida", "Washington", "Saudi Arabia", "Istanbul", "Kandahar", "Kandahar", "India", "Alaska", "Alaska", "U.S", "Massachusetts", "New Salem", "Florida", "Florida", "Florida", "Florida", "Florida", "Washington", "Alaska", "Montana", "Arizona", "Nevada", "Pakistan", "Oregon", "Archie", "U.S", "St Louis", "Florida", "United States", "Maria", "U.S", "North Carolina", "Connecticut", "Bennington Vermont", "America", "New Jersey", "Vineland New Jersey", "America", "Virginia", "Arizona", "U.S", "the U. S.", "Vineland", "the United states"]}]