{"month": "10", "state": "TX", "station": "KUHF", "content": "And researching for this I think he's soundscape or sound quality that you can't really tell what is the source of the\nSounds but that could be really chaotic couldn't it yes it is also sometimes it's sort of in between organic and machine and it's really interesting I think that\nThe audience they don't know if they're in a forest or they're in like I'm In a context where it's like ... music so there's a lot of ... and it allows you to kind of have these illusions and it's open for you know your imagination to kind of shift gears\nTo for the ... and ... do you want them to feel experienced take away with no ... sealed dream audience ...\n... um well I guess this you know what I had to say no displacement that these sort of like to transport them in a way I mean it's hard to talk about this without using\nUm cheesy words that she was ... I don't know they sort of like these magic that happens between days like the organic and the machine and and it's sort of\n... when you listen to it you can never understand really where it's coming from what the person is is it's sort of just um yeah it's sort of the\nCenter essence of all these different things that hopefully create something years\nHe's that anything specific play a cute actually knew we each in in terms of your staff take what you bring to this project to native instruments\nWell I guess I Would say so same so um maybe generally just be you know being region but it's a very a concrete example is the sound of the song called ... it's a little high month it's a title\nOr where the main base is from a Norwegian bumble bee from the mountains\n[noise]\n\n\n[laughter]\n[noise]\n\n\n\n\n[noise]\n\n\nNature instrument that ... backstage at at let's say sending nukes will to privilege to be able to talk to such a chip disrupt his young living composes what did you think whose music would you like to hear again here's what some of the audience here in London thing\n[noise] I did enjoy my first one would be ... for us I mean what do you live in New Jersey the stone age from ... from what you've been reading the view from I Would I Would ever to\nRead [noise] hold on to you know I really close to ... to blend of instruments in first place with a lot of concern real pressure on him was very interesting ... make choose I really enjoyed the folks who thinks\nI'm really really nice sounds well she writes a mix of electronics are those are the larger former [noise] freelance for really enjoy [noise]\nJoin the conversation like emailing the talent\nYou don't pay the u._k. or if you're using\nSocial media ... or if you're on social media is the hash tag BBC uh south [noise] thing to think you'll is on the far back\nSteak our thanks also to face and live and I fully ... three Nicki the ... the show and you can join me Nikki faith faith Wendy off our two isn't just kind of fat South Africa next week for you [noise]\nConsider Amazon dot com and shopping online Amazon contributes a portion of each purchased to Houston Public media when you access the Amazon website from Houston Public media dot org slash Amazon\nElection day is November six but the midterms are already here with control of the U.S house and Senate\nHanging in the balance early voting is going on right now and it continues through friday November second\nTexas standard in public radio stations across the Lone Star state are\nTrying to make sense of the mid term elections through our Texas decides products\nAnd David Brown from the Texas standards you can visit our interactive voter guide right now\nAt Texas decides dot\nORG this is your NPR station Houston Public media news eighty eight seven K U H A few ... K. U. H. T. T. V. eight point six used on a service of the University of Houston partly cloudy sixty seven degrees at the University of Houston it's ten o'clock [noise]\n\nAround sixty percent of registered Latino voters nationwide or not even being contacted by these campaigns and when they are it's largely focused on President Trump and his comments which didn't motivate them to turn out in twenty sixteen and about immigration policy which we've been hearing about for decades\nI'm Michael Moore that's coming up on the team from the New York times\n\nThe daily it's supported by Baird employee owned and independent bad has kept clients financial interests first since Nineteen Nineteen\nI W Bayer to dot com has more information and by you lie to crack bourbon handcrafted at small batches for a full flavor slipping experience forty seven percent alcohol by volume you lie to crack Kentucky straight bourbon whiskey bart town Kentucky thank wisely drink wisely\n\nI'm Stuart Macintosh with the b._b._c. news hello\nPresident Trump has called on the nation to you nice in response to what he called despicable terrorizing acts but he tempered that cool by accusing the media of using a series of veteran bumps into leading Democrats to score political points against him\nThe president was addressing a campaign rally in North Carolina I'm a registered Republican safe to say I was just in Florida with five federal crimes in connection with sending the bums ...\nI was after the arrest of face on file Donald Trump totally support is the political vitamin ... never be tolerated under he would do all he could to stop it\nHe said the politics of personal destruction must and he's in return to a familiar theme attacking journalists and blaming news coverage for driving people to pause and undermining healthy debate he said there'd been an effort by the media to use the sinister actions of one individual to school political points\nThe chief prosecutor in Istanbul has demanded the extradition to turkey of Eighteen Saudis held by Riad didn't connection with the murder of the Saudi journalist ... ... the senior Turkish officials had to he was better equipped to genuinely serve the cause of justice\nMr Grisham jeep was killed at the Saudi comes she lived in Istanbul, Turkey is president of devine has again demanded that Saudi Arabia come clean on the affair\nHim near she bought up they ought to do that as a result of the meticulous were carried out by a police judicial intelligence the incident has been lying to a large degree you see these poor and Saturday official uses an expression\nAnd we say it's now evidence that he was killed but where is the buddy you need to share with\nMystic showed his fiance has said she doesn't believe the United states is sincere in trying to get to the both of them is the case she was speaking in her first television interview since his murder\nThe odds going Mexican president Enrique Pena Nieto has offered members of my current ... traveling towards the U.S border a package of benefits including temporary jobs\nThis is to try to discourage them from traveling going towards the United states missed opinion yet to said migrants who registered for refugees they just into southern Mexican states would be housed in hostels and could send their children to school\nConservative policies were going to help improve their lives then you know in the future they could wear away at the sort of democratic Obama coalition that had cost them two presidential elections already\nSo once Republicans see that there are potential inroads what did they actually do to try to win Latino voters back\nSo after that twenty twelve election after this autopsy report boom boom you have you know Jeb Bush George W Bush's brother of course running for office showcasing his bicultural family\nI'm married to a Mexican American United States citizen I'm immersed in the culture I'm bilingual I feel like I'm bi cultural I'm proud of of the diversity of my own\nFamily speaking Spanish and a lot of campaign stops\nLawyer you go to these bottles me well George Bush they didn't give this morning I don't know\nYou have Marco Rubio running on the strength of his support in Florida and on the fact that he had you know tried to cooperate on a comprehensive immigration reform bill\nAnd when we talked about illegal immigration is not about demanding right it's about appealing to the passion of the passionate nation in history of the world\nYou have even Ted Cruz senator of Texas at times attempting to speak Spanish at debate\nAnd I don't I don't know how he knows what I saw it on Univision the Spanish and second of all the other but they don't get it [noise]\nAnd so you really start to see that the Republicans are taking seriously the idea that they need to reach out to Hispanic voters really trying to meet them where they are\nRight and what could be a greater testament to this kind of cultural changes in the party and the fact that two of those candidates you just mentioned crews and Rubio are themselves which you know it goes\nBeyond political pandering it's true representation have Jeb Bush's bicultural family prominently featured on the news to have him bragging about his ability to speak Spanish fluently that sounds really positive signals of inclusive at the end of support\nTo Hispanic voters and I really think that that can't be overstated\nAnd then came Donald Trump\nWhen Mexico sends its people they're not sending their best they're not sending you they're not sending you they're sending people that have lots of problems that they're bringing those problems with us\nWhat we see is Trump is um and in particular Trump's controversial immigration related rhetoric slowly\nCreep into the mainstream of the Republican Party during the campaign during that campaign button in twenty Fifteen when he first announced candidate B. I think that Republicans were aghast at\nHis remarks and we're trying to figure out how to marginalize him but did not imagine that he would become the nominee for their party and eventually the president\nI think I'm going to do very well either legally or why I'm going to do well with Hispanics because I'm going to bring back jobs and they're going to get jobs right now they're going to get jobs I think I'm going to do very well with Hispanics but\nObviously we know how the election turned out in twenty sixteen how exactly did the Latino vote shake out in that election\nWell this is where there was a bit of a shock exit polls at the time showed that around thirty percent of Hispanic voters actually supported President Trump during the twenty sixteen election he actually did a little bit better than Mitt Romney did\nAt the ballot box better then Romney better than Romney that feels genuinely\nYou know when I saw the exit polls yeah my first instinct was surprised I thought that he would get a lot fewer voters Dan Romney did in twenty twelve ... but then when I started looking at the numbers as they became available my realization was that it wasn't\nSo surprising that Republican leaning Latino showed up at the same rate that they did in previous campaigns what was surprising to me is that a record number of Latino\nDidn't vote fourteen point three million Hispanic voters did not cast ballots in twenty sixteen despite a race that seemed like it\nVery much anime Latino voters theoretically against Donald Trump and what\nThat indicated to me than what I think it's been born out in conversations I've had across the country since then is that Trump alone was not enough to motivate a lot of voters immigration policy alone was not enough to motivate\nSome of these voters mhm what I concluded and I think what a lot of other people are starting to see is it the Latino vote is just much more complicated much more nuance than we understood before and they care about a lot more issues\nThan they are being spoken to about [noise]\n\n\nWe'll be right back the daily supported by ... online test prep for the A. C. P. S. A. T. G. R. E. N. G. mat that's designed to improve scores\nStudents can get video lessons practiced question an expert support one line prep smart go far and enjoy the ride at ... dot com\nAnd buy T Rowe price offering a strategic investing approach that examines investment opportunities first hand institutions advisors employers at individuals choose T Rowe price T Rowe price invest with confidence\nSupport comes from the museum of fine arts east and the only us stop for tutors to Windsor is British royal portraits from ... to Warhol showcasing five hundred years of historical British royal portraits are now I'm deal more at an F. A. H. dot org slash royals\nParty loyalty will compel millions of voters to the polls in November sick but there's an even more powerful force that anger the rise of political anger and what is it does to democracy this week on day six\nDays six Saturday one PM and eleven PM on Houston Public media will support comes from interface ministries presenting the dialogue project unrelated to learn about Houston's diverse faith community October twenty eight five too humid first Christian Church\nMore red M. G. H. dot org slash the dialogue\nProject [noise] all of us on Facebook\nAt Houston Public media tweeter said Houston pope media\n[noise] I'm from the New York times yeah I actually am based in LA I'm a correspondent and we have a ... year olds all over the country so I'm\nNot not too long of a tractor [laughter] um my first question\nIs what does twenty sixteen tell us about the Latino vote that we didn't understand before if a Republican presidential candidate being so openly anti immigration doesn't turn the Latino vote out what does that mean in twenty eight team\nYou know that question as we're heading into the mid term election was really tantalizing to me so I decided to just go to Nevada where there is a competitive Senate race\nAnd according to political strategy is the difference between you know Fifteen Percent of Latinos showing up and Seventeen percent of Latinos showing up could flip the rate\nThan that I thought that you know\nI keep thinking to a woman named Sandra out of Idaho who I met outside of a store called ... it's a Hispanic market in Las Vegas and Misurata was telling me you know I have voted every election for years and years and years\nYou know I'm going to finance [noise] eat 'em and\nNothing changes for me or my community ...\nShe said I care about mental health issues I care about education for my kid I care about how much money or able to bring home and it just feels like every two to four years we hear these candidates come out\nAnd talk about how they're going to help us and then the election passes and they forget about a ... and she said I'm basically nonpartisan at this point because I just don't see the point\nWhen I'm going to put the gym [noise]\nAnd the issue of immigration just from having conversations with people is itself quite divisive and people feel differently about it based on their own recent ancestry based on whether they have recent family members who are immigrants\nOr whether they've been here for generation their income their age\nWithout much from the observation I don't want to be forty one more to arguments for drugs and every one of my life I Know I mean\nI had a conversation with the young man named Jose Oliver as he's Twenty years old and I just asked him you know where you're going to vote are you following the election", "year": "2018", "show_name": "The Daily", "city": "Houston", "day": "27"}