{"month": "10", "state": "MS", "station": "WMPN", "content": "\n[noise] the triumph of march from ... opera I eat out that's the Philadelphia Orchestra this morning with conductor Eugene arming the\nAttention all educators NPD has partnered with the secretary of state's office to host this year's\nPromote the village initiative to help your students learn important lessons about civic engagement wow having fun in the classroom this opportunity it's tricky through twelve students across\nMississippi gets engaged with the ... election plus are an essay contest for more information about promote the boat or just sign up your class or school visit\nMTV on line ...\n... music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. B. in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. ... check out what's happening on MTV music radio and listen online at him Bebe on line or gee\n[noise]\nHere's the definition of irony the expression of one's meaning my using language that normally signifies the opposite [noise]\nHiring event is the definition of one critics response after you heard this high end art green\nGreek is striking out here it's a critic wrote he's going in a whole new musical direction\nOur Greek was not going in a whole new musical direction not really any way he was looking back to the time of bonds and handle and whole Berg I'll tell you more and you'll hear more to tip the minutes\n\nThis is guitarists Richard to be no playing one movement from a guitar sonata by ... really\n[laughter]\n[laughter]\n[laughter]\n[laughter]\n[laughter]\n[laughter]\n\n\n\n\n\n\n\n[laughter]\n\n[laughter]\n[noise]\n\n[laughter]\n[noise]\n\nAnd if you kill ... performing the eight to ... number fine fine Frederick Chopin that's the key to known as the black keys Eighteen you'll hear a concerto this morning a concerto known as the rustic one that's on the wane about twenty minutes\n[noise]\n[laughter] [noise]\n[laughter] [noise]\n[laughter] [noise]\n[laughter]\n[noise] [noise]\n\n\nOh\n[noise] [laughter] [noise]\n\n\nAfter she heard Edward Greeks new sweet one critic road that Greek struck out any new musical direction which is a little ironic since it's our Greek actually looked back about two hundred year when he wrote this next piece he was inspired by the dance music\nPopular in the time of the Norwegian born writer named we'd be cold dark\nAnd when ... came around the leading creative figures of the day were asked to help celebrate invites greed celebrated with a new suite his whole Berg\nSweet here's conductor name yeah redirecting the Gulf and burg symphony orchestra [noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nFirst performed in its original piano version by its are Greek himself that the ... whole Burke celebration in December of Eighteen eighty four that's sweet was very very well received\nAnd that probably explains why it's our great decided to transcribe it for orchestra so soon after he finished writing it for piano that's emerging you heard the Castro version of Edward Greeks who works sweet name a year be conducted the comic books in the orchestra\nMm\n\nThe performance by the group hopes dreams itself rustic could chaired elegy major next by Antonio we've only [noise]\n\n[noise]\n\nBut to have a while I'm structured and calculated feel to it that's why it's called a rush ... concerto which that can chair to the gym major by Antonio they've all the performance from the guilt hope street this morning\nHis performance by food is Christian Gardner joining the Vienna academy for the flu concerto in D. C. P. E. by\n\n\n\n[noise]\n", "show_name": "Deep South Dining", "year": "2018", "city": "Jackson", "day": "01"}