{"month": "10", "state": "TX", "station": "KTDH", "content": "Thanks for paying for this service I think for keeping real music alive every contribution is crucial please give today at H. P. P. R. dot org and again thank you [laughter]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere on line at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\n[noise]\nWherever they feel like they belong go right but we'll get it done but we do everything they can to help each other out and\nThey've asked rescue and recovery effort is underway in Florida as tropical storm Michael sweep snow Thursday October eleventh and this is all things considered\nI'm Mary Louise Kelly and I know that chain hundreds of thousands are without power in Florida well here from two towns on the panhandle where the devastation is the worst also how did the Kavanaugh fight change Republican strategy heading into mid term election when\nActivists are yelling at senators in the halls and harassing Republicans in restaurants but really antagonize was beef\nAnd Elvis Costello on what kind of album he does not want to make one that would have people things is remember this guy\nWill disreputable remind you when you liked him immediately about proposition ... than you live\nFrom NPR News in Washington I'm jak sphere\nForecasters say what is now a tropical storm Michael is moving quickly over the Carolinas before it starts to head out to sea\nThey say the storm's winds about falling from a hundred and fifty five miles an hour to fifty miles an hour but the storm is still dropping up to seven inches of rain causing flash flooding across parts of North Carolina and southern Virginia\nNorth Carolina governor Roy Cooper says problems from the storm developing his state's\nAlready several water rescues are occurring in the west this morning at least sixteen roads have already been closed due to Michael and the storms rain and wind or nails spreading he's\nMichael came ashore yesterday along the Florida Panhandle as a powerful category for storm devastation left in Michael's wake was readily apparent this morning at least five people were killed in Florida and Georgia by the storm\nThe Supreme Court of Washington state is striking down that state's death penalty law as unconstitutional from K. U. O. W. in Seattle page browning has more Washington\nSupreme Court ruled unanimously devastate the death penalty law is it\nPenalty law as unconstitutional from K. U. O. W. in Seattle page browning has more\nWashington Supreme Court ruled unanimously devastate the death penalty law is administered in a racially biased manner the court is immediately converting all eight capital punishment sentences in state to life in prison without parole\nGovernor Jay Inslee has been forced a moratorium on execution since two thousand fourteen\nNow Washington is the twentieth state to abolish capital punishment joining Delaware and other states that outlawed it in recent years\nThe ruling leaves open the possibility for the legislature to reinstate the death penalty if it can craft a system that quote did not offend constitutional rights for NPR News I'm Paige browning in Seattle\nMany with rapper Kanye West of the White House today President Trump says he is open minded about what is known as the stop and frisk policy Trump's comments come after remarks he made in favor of the idea earlier this week to deal with crime in the city of Chicago\nPresident is blaming the Federal Reserve and rising interest rates for this week's stomach turning moves and the stock market as NPR's Scott Horsley explains the White House insists the president is not trying to interfere with the feds independence\nFor the second in a row President Trump PIN responsibility for the stock market's gyrations on monetary policy from the Federal Reserve even though the fed has carefully telegraphed it's gradual move to boost interest rates Trump claims those rates are rising faster than he and others expected\nI think the fed is out of control I think what they're doing is wrong\nTrump complained that said get interest rates low during much of the Obama administration during the early days the recovery he was equally critical of the fed easy money policies despite his concerns about interest rates Trump says he has no plans to remove fed chairman Jerome Powell Scott Horsley NPR News\nWashington tracking the numbers the Dow dropped five hundred and forty five points today you're listening to NPR News\nSupport for all things considered come from red wing shoots or in Amarillo offering weren't boots featuring iconic style with classic triple stitch in hand crafted red wing original leather for construction transportation manufacturing and other industries more at red wing dot com\nAnd I'm Angie have layer hosts for all things considered in the studio here with Dale boating and Valerie Smith I guess\nThe good afternoon great to be here this afternoon a bird to talk about your support for all things considered on high plains public radio it's a civil process you know what the news is like you know what a brings you every day that's why they call on all things considered it's a chance to\nSee things from many different perspectives or we're going to hear more about a hurricane Michael and the after effects of what's happening in Carolinas North Carolina's are getting hit again from the same hurricane so that's coming up lots of good news and information come your way because listeners make the effort they\nGo to the phone and dial eight hundred six seven eight seven four four four and they make a pledge of support\nHigh plains public radio is celebrating a very successful second day of the fall membership campaign thank you so much to all of the listeners and the contributors who have called in and displayed their passion for public radio with the pledge and support\nTheir value behind the service and there are over Fifteen hundred members who are backing up the service and their inviting you to participate and display your passion today with the pledge of support at one eight hundred six seven eight seven four four four and\nThey need it has value to our region dealt with talking about the perspective of all things considered not only does all things considered\nAnd it has value to our region dealt with talking about the perspective of all things considered not only does all things considered give you a global perspective of things but it also gives you a regional perspective of events happening in our backyard\nBooks into what your contributions supports there is a girl this hour and a three hundred dollars\nIf you can be the first caller this this afternoon that one eight hundred six seven eight seven four for for going to be a great way to start out all things considered\nJust takes a few moments and we're not talking about the huge sums of money yes with the three hundred dollar goal but if you could do thirty dollars or thirty dollars a month for public radio that would go away very quickly ... hundred six seven eight seven four four four go on line at H. P. P. R. dot org\nIs all things considered from NPR News ... Chang and I'm Mary Louise Kelly\nAt least six people have been killed since hurricane Michael blasted a short yesterday the category for storm left a huge trail of destruction along the Florida Panhandle including in the coastal community of Mexico beach which is where we find\nNPR's Greg Allen enough on line in Mexico beach are understandably not great but we think we've got you hey there Greg\nHi Mary Louise how bad is it [noise] [noise] well\nIt's what you would expect to you know the category for storm nearly a category five which came ashore right here the I passed right over that area in Mexico beach which is a very small community you know the storm surge came in and you can see signs of every of every where there's still lots of standing water here most of the water went out but there's still plenty of it around\nBut it was those wins in a hundred and fifty five miles per hour winds just tore carts many buildings here lifted up entire buildings through them down on the other ones you saw roofs off you know siding off sides off um luckily though most people who had left them weren't here to Seattle\nAnd are you able to drive around them into the streets relative it clear of water\nYeah here it's a very small community and the through the streets themselves are not too bad getting here is another matter you know we came over from Tallahassee day it should be a couple of hours my producer Becky Sullivan and I took a nine hours to get here because you just don't know what roads are open and the roads are open they're just barely open you have to drive around this round down trees\nYour power crews out and in in ... and good Samaritans doing what they can but it's still very hard slog get in or out of this\nArea and when you say it took him nine hours to drive that would normally take you how long two hours right what about the impact on people I mean as always with the storm some people said they rode out the storm I assume you've been out talking to them what are they saying\nYeah I mean it's a it's a tough one I talked to him a man here who stayed and he said he left in hurricane oval which was in Nineteen Ninety five and the always regretted it so hard to get back into the community later he always where he'd states we stayed\nAnd he said the storm is like anything he was prepared for it or at ever experienced before\nYou know the the sound the noise the the windows the walls flexing and he had a little safer and built for himself and his path at one point he said it became so he's something told him that this was no longer safe and they moved to an inter a bathroom and that happened the windows shattered glass blasted and he said they certainly would have been injured if they had been the case\nAnd he has struggled to patch of his window and rode out the rest of the storm and ah today's here repairing his house with a neighbor and I asked him if he was sorry that he stayed he says no he'd do it again because he says if I didn't stay there all my mature all my possessions everything we get ruined by the rain and the other stuff coming in\nFour if all things considered has become an integral part of your afternoon of your drive home if you hop in your car and you know that all things considered is going to be there to keep you up to date and informed on what is what is transpiring around the world and what has happened throughout your work day\nThan please consider contributing to the source so that this type of news can continue here at that number one eight hundred six seven eight seven four four four now certainly if you're driving we don't want you texting and driving and entering all the stuff\nI felt so please do pull over and and call when convenience but we do at that you call today one eight hundred six seven eight seven four four four and thank you\nSupport for NPR comes from the station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com [noise]\nFrom zoom zoom offers cloud video conferencing online meeting at a video conference room solution in one platform featuring digital video and audio was screened sharing account registration and more at zoom dot U. S.\nAnd from Americans for the art\nFrom NPR News this is all things considered ...\nAt them that us and from Americans for the art\nFrom NPR News this is all things considered ... Chang and I'm Mary Louise Kelly President Trump and rapper Kanye West met for lunch today\nOne topic on their agenda was gun violence in Chicago and what to do about it every ... ideas on the environmental protection from ... to ... a difference that was on full display this week as NPR's Martin Kaste reports Chicago's had a rough few years\nIn twenty sixteen murders jumped to the highest rates in two decades something Trump talked about a lot during his campaign since then the murder rate there has fallen dumb but gun crime remains a stubborn problem and this week the president said he wants to help\nI have to record the attorney general's office to immediately go to the great city of Chicago to help straighten out the terrible shooting wave to straighten it out on a straighten it out fest is no reason for what's going on there [noise]\nBut what that means that turns out the opposition\nThe administration is filing a brief with a federal court saying it opposes a package of police reforms in Chicago that's known as a consent decree the decree aims to improve police training and rebuild trust between cops and the public Trump does not like consent decrees he says the real cure for Chicago is more intense of policing\nStop and frisk it works and it was meant for problems\nLike Chicago [noise] it was meant for stop and frisk [noise] from says\nThe widespread stopping and frisk and potential criminals reduce crime that conclusion is contentious though and stop and frisk can also turn into racial profiling under twenty Fifteen court settlement Chicago police have had to fill out extensive formed justifying their stopped which has led to fewer stops\nThe administration believes that sort of court ordered limitation on policing can make crime words and that this new consent decree is more of the same\nBut Lisa Madigan says it's a little late for them to be weighing in only really\nHadn't had any keep from them and count now\nMadigan as the Illinois attorney general last year in an unusual move she sued the city for a consent decree doing the job that the Trump Administration would not\nOr if they wanted to have a role a guy had that opportunity they decided that they are getting out and therefore ... nothing\nShe regards the consent decree as unnecessary reform but that word is not reassuring to former cop Peter Moskos\nYou know reform as a word of justice William loses stop and frisk\nHe's a professor at the John Jay College of criminal justice in New York and host of a podcast called quality policing\nIt called him to agree with the Trump Administration on something but he says the evidence from places such as Baltimore is that federal consent decrees can sometimes make crime words by limiting the intensity of policing in the places where young men carry guns and shoot each other\nIf we're going to reduce murders we have to go to places where murders happen there's going to be racial disparity but that is separate from racial bias and racial bias has to be attacked but certain neighborhoods need more policing\nMany policing experts these days lament what they see as a false choice between the strictures of Obama era consent decrees and Trump's unquestioning support for tens of policing\nIn Chicago's city leaders are digging in against Trump's rhetoric asked about it yesterday Mayor Rahm Emanuel lashed out at reporters for taking the administration's opposition seriously\nYou guys even in the stories acknowledge it has only symbolic value you guys got to stop acting like have loving little mice chasing every time Donald Trump said something it doesn't have any value\nOpposition to Chicago's consent decree probably is\nLike have little the little mice chasing Everytime Donald Trump said something it doesn't have any value\nTrump's opposition to Chicago's consent decree probably is symbolic the administration's brief is not likely to stop its approval in court but on Monday when Trump called for stop and frisk the applause from the police audience was very real highlighting the ongoing tension between them and the reformers\nMartin ... NPR News\nThank God the crew is alive and those were the words from spokesmen for Russian President Vladimir ... after a Russian lawyer you rocket carrying two astronaut to the international space station failed during and today\nAt liftoff had proceeded to leave for about two minutes then came in real life drama\n[noise] up\nHere and it's like five times they have it on my family out of the [noise]\nThe crew American the tank and Russian Alexei option in our space after an emergency landing in context on three other astronaut are currently on board the space station and now they're returned home might be delayed\nFor more on on the than we are joined by Canadian astronaut Chris Hadfield he served as commander of the international space station and twenty Thirteen and flew up there and back any Russian ... capital welcome\nThank you nice to be talking with you also\nWho this was going to be American Nick hates the first time into these ... seconds for like the ocean and what kind of training would they had had to handle a situation like that\nBoth of them and training for decades Alexei as a cosmonauts for quite a while as you say with space flight experience nip prior to being an astronaut was\nA test pilot in the U.S air force so that's an extremely risky complex job so they've been getting ready for this for many many years and then specifically for this launched\nWorking together for a couple of years we've ran out every last thing that could possibly go wrong and the way the crew behave there was so Chris and professional right on top of their game you would never know the vehicle was behaving so badly if you listen to al Alexei ... which dealing with things bringing them both safely back to her\nWhen would be the next chance you could go on a mission like that again I mean I Can't imagine a psychological blow\nYeah you're you're right you know the crew at first will be super focused and professional and doing their job but afterwards\nThey're just going to be kinda mad because they didn't get to go to based today you know a kind of\nLike gosh all that preparation and at the ... but neither of them got hurt and they're they're back in the game and they'll have a chance to fly again anybody and I don't know who will fly next it's way too soon to tell it's going to be a long time to figure out what went wrong\nAnd then we'll have to start thinking about who should fly next what's skill sets should we need one is that going to be all of the repercussions that come from an event like today\nTell me what it will take all kinds of conversations are going to have to happen to figure out how to move forward the\nFirst thing we need to do is find out what went wrong what failed in this rocket there's a lot of information people be able to sift through video of it but also the sensors on board then we need to see how can we fix it was it a design problem or manufacturing problem who knows\nThat and once you know that you can fix it then you can set a timeline if that in three months from now than no big deal but if it's gonna take a year or two years\nThen we need other plants Boeing is building a rocket that can take people to the space station or ... or a spaceship SpaceX is building a ship that can take people to the space station maybe they could be accelerated maybe they could fly before the Russians are going to be ready to fly again and window we bring the crew back from the space station all of those questions need to be analyzed\nThe way I understand they were expecting to return home and now\nTo fly again and when do we bring the crew back from the station all of those questions need to be analyzed\nThe way I understand they were expecting to return home and now that return could be delayed correct\nThey flew up in a different show us that stocks to the space station it's sort of like a lifeboat or their their their ride home if they're they can come home anytime they want ah okay but if they ... to come home and they are basically abandoning ship the space station would be empty and it's a big enough and complicated on a ship\nThat after a little wild things start to go wrong and there'd be nobody there to fix them so it really causes a lot of risk for the space station to leave it on a man\nSo people will be look really hard at all of the limits and asked to decide what the right trade offs are we don't know the answers yet but it's going to be a really complicated decision making process coming up\nChris Hadfield was the first Canadian commander of the international space station thank you very much for joining us today\nI've stopped they also thank you [noise]\nThat is NPR News\nSupport for all things considered comes from the farmers and ranchers of Kansas Farm Bureau providing food fuel and fiber for their neighbors down the road across the state and around the globe detail that K. F. B. dot org\nThen it's different because he's speaking from within the family does it strike you as puzzling\nThough I mean the reports are being source to Turkish officials Turkish investigator saying that the team of Fifteen people flew in on private planes with the express purpose of targeting ... that just seems like a massive operation to take out one editor\nIt sounds so crazy that it's hard to get your head around it\nThat Saudi Arabia would go this far to allegedly killed one of their critics can you imagine that this actually happened in the way the Turkish officials say it did yes I think it's the most um persuasive and plausible scenario right now I I think many people\nHave been waiting for the Saudis to offer evidence to the contrary they haven't but not only that they've shown I think it's surprising level of indifference ... almost as if\nYou know their taunting the international community in a sense and if they really didn't do it then there's a way for them to demonstrate that but I think that the evidence is building and also sources from different intelligence agencies are moving in this direction it seems that this is the most plausible scenario\n[noise] Shadi Hamid thanks so much for having me my pleasure Shadi Hamid is a senior fellow at the Brookings Institution we have been talking about Saudi journalist and dissident Jamal ... now 'cause she'll get\nAppearance and possible murder is draining relations between Washington and Riyadh and it comes at a time of heightened tensions between the UN in Turkey where she'll be was last seen\nThe Trump Administration says it is giving the disappearance high level attention but the U.S had noon back door and either Saudi Arabia or turkey NPR's Michele Kelemen reports\nRobert Jordan was the Bush administration's ambassador to Saudi Arabia in the wake of the September eleventh attacks and he says in times like this it's crucial to have an ambassador someone who's appointed by the president and confirmed by the Senate\nYou can't really deal with the highest level or government on the ground\nWith our and brush her career and without someone who is constantly ground American in\nJordan now a diplomat in residence at Southern Methodist university and an ambassador would help coordinate us effort on the ground in Turkey and in Saudi Arabia to find out what happened to Jim ... show again and would be making clear to Saudi official how one settling this is\nA threat to the relationship I got to have people rush rush ... and an experience freelancer like you're a Christian or show the world that we're ... we're\nPushing her Trump's son in law has close ties with the Saudi crown prince Mohammed bin some on a powerful figure who's accused of being behind the disappearance of the journal that questioner is relying on Saudi help for Middle East peace plan he has yet to unveil\nFormer ambassador Jordan says it's possible that the crown Prince Fielder embolden by this relationship with Trump stone and loan\nAs for the president he says he wants to get to the bottom of the ... but he's not ready to cut off lucrative arms deal\nIf we don't sell it to them they'll say well thank you very much worldwide from Russia or thank you very much will buy it from China that doesn't help us not when it comes to jobs and not what it comes to our house is losing out on now where\nTrump was speaking a day after a group of senators sent him a letter\nThat doesn't help us not when it comes to jobs and not what it comes to our government is losing out on them where\nTrump was speaking a day after a group of senators sent him a letter requiring him to consider sanctions against Saudi Arabia am Senator Chris Murphy is don't know calling on Trump to dump supporting the Saudi military campaign in Yemen\nBombing campaign in our participation in a is predicated on our belief that the Saudis are telling the truth but they are not intentionally trying to kill civilians given the fact that it is likely they are not telling the truth about what happened to drop the show you why would we believe them that they are not intentionally getting civilians inside\nJordan the former ambassador to the private sector should all speak out and boycott an upcoming investment conference in Saudi Arabia\nOr whoever really there is a universal reaction or orange gr the truck and bring the agree markers crack ran\nAground print to eat that played a lead role in that disaster it's war in Yemen a botched political intervention in Lebanon and a purge of its critics at home Michele ... NPR News the state department [laughter]\n\nReport for us to be a market report comes from empty seat of healing Kansas fourth generation farmer providing we credit Kaylee and rice seed to farmers and ranchers across the high plains more information that empty seat dot com\n\nThis is Sharon Smith with the with the aim marketing service in God's City Kansas the Kansas daily direct fought our cattle negotiated purchases for Thursday Afternoon negotiated cash sales confirmed Seventeen thousand nine hundred sixty four head we today at Eighteen thousand Seventy nine\nLives stairs nine thousand five hundred thirty to head fourteen twenty four pound average traded out one eleven live heifers five thousand eight hundred eighty eight head twelve Ninety two pound average also I Want to let us know great based sales for the day we today sixty eight head [noise]\nTexas Oklahoma and in Mexico on Thursday negotiator cash sales confirmed for the day on the week the date seven thousand four hundred and forty five head lice stairs two thousand four hundred thirty five had Thirteen forty five pound average at one eleven dress stairs delivered two hundred sixty five head nine hundred seven pound average at one Seventy six [noise]\nLive heifers one thousand nine hundred and fourteen heads twelve fifty four pound average at one oh nine to one eleven averaging one ten Ninety dressed heifers delivered three hundred eighty had seven hundred twenty two pounds at one Seventy six\nGrade based sales for the day and the way to date six hundred thirty had\nIn Nebraska on Thursday negotiating cash sales confirmed twelve thousand two hundred thirty wasted Eighteen thousand six hundred and sixteen [noise] lives stare six thousand five hundred three head fourteen sixty one pound average at one oh nine to one eleven fifty averaging one tenth Seventy eight [noise]\nDressed stairs delivered one thousand two hundred and Seventy seven had nine hundred twelve pounds average of one Seventy four live heifers\nTwo thousand five hundred and Seventy one had Thirteen thirty six pound average at what our nine to one eleven fifty averaging one ten Ninety six dress staffers delivered five hundred Seventy four had seven hundred eighty eight pound average at one Seventy four [noise]\nGrid based sales for the day two hundred Ninety nine week today one thousand nine hundred Seventy four [noise]\nCattle sold on a formula basis around the nation a can of twenty three thousand four hundred weighted average weight eight hundred Seventy four pounds weighted average price of one Seventy seven\nEight teams the western Kansas grain market for Thursday October the eleventh wheat is two and a half lowered diets idiot for sixty nine Kobe for fifty nine Garden City for sixty four to four sixty nine gun for fifty four\nAnd a half lowered dodge city at four sixty nine Kobe for fifty nine Garden City for sixty four to four sixty nine Gulen four fifty for protection for sixty four Scott city for fifty four split Syracuse and Ulysses at four sixty nine [noise]\nCorn is mostly six and a half ... eleven higher density at three sixty to Kobe three thirty one Garden City three sixty one to three sixty six Dylan three twenty nine protection three fifty nine it's got city three forty nine so blood at three Seventy four searches three sixty four and you it's the three Seventy two [noise]\nMilo is eleven to twelve hired dodge city at five forty three Kobe five fifty to Garden City five fifty two to five sixty one Glenn five twenty five protection five seventies got city five thirty four ... five Seventy searches five sixty seven and ... says five Seventy\nSoybeans are six tier Dutch city at seven twenty eight Kobe seven LA Garden City seven twenty three to seven twenty eight protection seven thirty three Scott said he's seven twenty eight ... seven twenty eight or seven thirty three list is seven Eighteen\nThe Milo feed melted Ashland is six twenty four west Texas cotton base prices Seventy point oh eight one cents per pound it'll be\nJust to share and that's what the USDA market news service in dodge city Kansas\n\nHi this is Gloria good when and I listen to a high plains public radio\nAgainst it so much and emerges with so much that I think supporting it and is crucial that why I support it is it in so many ways to enrich our lives and makes it better and entertains\nAlong the way as well which has always been a in a in a really unique way that nothing else offers it is a one of the kind\nThat listener member from liberal Kansas thank you so much for those kinds of sentiment towards high plains public radio more you mentioned that high plains public radio give so much\nWhat can you give back to your public radio station if you have received something joined the other listeners who are giving back to the service they give to them listeners like an from similar on who called in with the pledge of support she says she absolutely loves classical music\nAnd she loved hearing all about the news she says so far I think public radio superior to anything else out there so and thank you so much for calling your public radio station [noise]\nWe do have a goal this hour and has certainly helped us along that way there is still some money on the table so if this is of value to you and if you have gained from listening to high plains public radio please consider right now giving back to the service\nIf you're looking for a unique way to support H. P. P. R. and consider donating your car trip motorcycle or both were able to continue to make a difference in public radio on the high plains because of donors like you did H. P. P. R. dot org today [noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\n[noise]\nSo many families have lost their\nBusinesses are gone we track the devastation led by hurricane Michael beginning our coverage today on the Florida Panhandle is Thursday October eleventh and this is all things considered\nI Know that change I'm Mary Louise Kelly today are congressional reporter sits down with Senate majority leader Mitch McConnell who says he is optimistic about the midterms\nIn ... on the Republican comes close to ... the Democratic shot and given the shapes your computer you know that's really the main road\nThan to Indonesia where parents and children separated after the tsunami struggled to locate each other mostly ...\nBabies vicar of say what his name was your father or whether you leave\nAnd a racially charged political ad shakes up a congressional race in New York now he's [noise]\n\nLive from NPR News in Washington I'm ... thousands of National Guard troops along with law enforcement and the other rescuers are making their way into areas along the Florida Panhandle devastated by hurricane Michael NPR's Debbie Elliott in Panama City\nForce men in other rescuers are making their way into areas along the Florida Panhandle devastated by hurricane Michael NPR's Debbie Elliott is in Panama City and describes the scene there today\nIn Panama City there is just utter destruction groups have been ripped from buildings windows are blown out power pole light post twisted like they were something like a paper straw trees are snapped down everywhere every time you turn around and go down the street you can't\nBecause of things in the road mostly trees but also power lines pieces of billboard the front facade of the church had completely come off there is devastation on every street to just about every structure that I've seen in Panama City\nNPR's Debbie Elliott Michael's now a tropical storm moving through the Carolinas at least a half a dozen deaths are being blamed on the powerful weather system\nA film and crew aboard a Russian Soyuz spacecraft bound for the international space station as safely back on the ground after on Nick Hagen Russian cause ... venture and made an emergency landing after their capsule separated from a malfunctioning rocket and brought them back to earth we'd Wiseman is NASA deputy chief astronaut and explains what happened\nFor the ... motives the safest mode and all that really means is it's like a shooting and blow it out of a rifle borrow it starts slowly spinning the dissent mazel so that has to not make stability of comes back through the thick or parts of the atmosphere that has the power she comes out and they laugh\nMoscow's immediately suspended all manned space launches pending an investigation\nTens of millions of Social Security recipients are getting a boost in their benefits next year following a stretch of low inflation government reports the annual cost of living adjustment or cola rise by two point eight percent in two thousand Nineteen raised miles through about an additional thirty nine dollars a month for the average retired worker\nUs stocks fell sharply again the day with a ... and five hundred and forty five points on top of yesterday's eight hundred and thirty point loss NPR's John Ydstie has more on today's trading\nThe Dow fell about a hundred and thirty points at the opening bell but a positive report on us consumer inflation help support the market which bounced back and forth between ... in gains in early trading\nThen some negative news from the White House on trade tensions with China pushed ducks lower the Dow was down almost seven hundred points at his love for the day before it regain some of the lost ground\nInvestors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake John Ydstie NPR News Washington\nLooking at some of the other numbers the NASDAQ closed down Ninety two points today the U.S and the five hundred fifty seven points this is NPR New York\nCity police investigators say they are taking a look at our and this is an ... player has for all things considered in the studio with Larry Smith how're you doing Valerie\nVery well thank you so much good afternoon to you the H. P. P. R. listener thank you so much for including\nHigh plains public radio when you're afternoon activities help you had a good day welcome to the five o'clock hour this is a very important our during all things considered and it's important today because there is a challenge on the table thank you so much too too very dedicated and loyal members in Amarillo, Texas to Barbara engine we can\nHave it so great to flee offered that this membership match seven hundred and fifty dollar is the goal for this hour\nLet's membership match what a membership match in every dollar that comes into high prints public radio will be doubled so your contribution right now at ten dollars will become twenty dollars\nThree dollar that comes into high plains public radio\nWill be doubled so your contribution right now if ten dollars will become twenty dollars your contribution is fifty dollars will become one hundred dollar it's your dollars will be doubled so this is a wonderful opportunity\nFor you to start a conversation with your public radio station the number to call is one eight hundred six seven eight seven four four four if you are driving home from work please\nPlease be safe when you choose to call choose wisely when to use that number but we certainly hope that you will call with your contribution today to support high plains public radio to support reporters anywhere around the globe as we speak\nReporting about events that are happening and bringing in the ... them back to you here on the high plains\nThat services of value your contribution keeps this a valuable service on air one eight hundred six seven eight seven four for for the call and tell us why you enjoy all things considered and get your dollars doubled\nAnd whoever answers the phone for you will\nWalk you right through the process they'll tell you exactly what they need from you and then you can also set it up however works best for the draft if you want a use your credit card debit card whatever way worked for you um you can just call and they'll help you out one eight hundred\nSix seven eight seven four four four or you can also go on line to our website at H. P. P. R. dot org just simply click on the give now button and that's all you got to do\nThis is all things considered from NPR News I'm Mary Louise Kelly and I know if the Chang hurricane Michael has been downgraded to a tropical storm but not that far wreaking havoc all across the Florida Panhandle\nMichael's ferocious wins ripped off roof obliterated home and trees tore down power line and flooded communities all along the state's Gulf Coast\nOne hard hit town in Port saint Joe it was right in Michael path\nPort saint Joe mayor bow Paterson has been going around the town surveying the damage we reached him on his cell phone earlier today and he told us what he's been theme\nOr ... or ... or ... area right around ... everything got destroyed rebel or got stroller blurring outwards never flooded or really the political receding from the water\nAuburn out with your ...\nHow difficult has it been to even just drive through the area\nPretty dire yup yup the murder in order to foreign were fairly crude oil out today and the mind doing right now we're real throws around looking for to go on through them out and I've got a law degree and\nNow I Know that port saint Joe had somewhere between three to four thousand residents did did most of them evacuate\nOh our them\nLess than half okay where did they evacuate chew that portion of\nOf all the Georgia or Alabama or where to put it in ... but all that much okay on an alibi out\nFor the residents to date I mean where they mostly now are sheltering at schools are are there other facilities where they are hunkering down\nYou're ruining them up for ...\nNow this storm it picked up drinks so quickly it was not forecast originally as a category for hurricanes so did you feel that residents were prepared enough in advance of this storm\nOh we're not going to happen\nDid you feel that residents were prepared enough in advance of this storm\nOh we're heard or they could be like to say it happen quick ah you know it's usually looking at a two story knew where they came out of ... right away a little primer and not worry\nYour pretty red relied on for longer crime by we would have probably more people will\nWe never had to deal with my life for a long already but what else could have done we've got a lot of here and this is not close knit community and I'm here to community people will do everything they can to help you know the ...\nInto the voting booth for the midterm elections you you are armed with knowledge and information and you can safely and securely and confidently cast your vote knowing that you have heard from both sides and that you are an informed\nCitizens and your contribution right now continues\nThat great programming throughout the mid term election and throughout the next year to come and the repercussions they will come from that perhaps this is a quality program that's that arms with information and it's all made possible by listener contributions this is a challenge our there's membership\nThe program that's that arms with information and it's all made possible by list their contributions this is a challenge our there is a membership money on the table there is a seven hundred and fifty\nDollar membership match right now so when you call and pleasure support your dollars will be doubled out one eight hundred six seven eight seven four four four\nSupport for NPR comes from the station and from Hitchcock insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom zoom zoom offers cloud video conferencing online meetings and a video conference room solution and one platform featuring digital video and audio with green sharing account registration and more at loom dot US I'm from the look on her to support this NPR station from NPR News\nThis is all things considered ... and I'm Mary Louise Kelly Indonesia is winding down the search for bodies from an earthquake and tsunami\nNearly two weeks ago more than three thousand people are confirmed dead the number of missing could be as high as five thousand now a new search that started among the living parents and children separated in the chaos or trying to find each other and charities are trying to help them NPR's Lauren Frayer reports from the city of ...\nTen crowd the lawn of a government building coloring books are spread out on a tart this is why they bring children who've been separated from their parents\nSchool by that and so I Love\nHoosier workers teach the children a song about not being afraid of earthquakes and then pulled them aside one by one to glean information\nThe most difficult is the baby's vicar of say what is your name was your father the weather usually\nAre highly with UNICEF says this is when he's work begins once the power's back on and aftershocks dwindle hunched over a laptop in a tent heat index is school photos and list of the dead\nBaby clothes hang from the the children because only now that some roads are possible and phone services restored are people able to report their children missing in the case numbers have spiked\nFor ... for low number four four three two so she just reduce jump through my\nThousands of children altogether believed to be missing and even if the government presumed dead charities like these say they will keep searching [noise]\nSylvan play in the driveway as adults keep\nArriving at this encampment dazed and desperate and hopeful yeah yeah yeah and scanning all these little these it is ... Howard Dean\nWho's looking for her nine year old grandson ... he disappeared when the family fled from their house when the earthquake hit if I'm In one sentence out of that [noise]\nThat you're just Mart and chatty boy she says she just got a new bike across town the rest of our all these family waits in another ten on the edge of their neighborhood which is now covered in mud they hope that maybe the boy might wander back\nTo their house has been Thirteen Days [noise] the only way to go back to their house now is by motorbike through rice patties asphalt roads are all wiped out\nAnd when we get there at the house is gone\nFor the hit 'em a lot of books on uh [noise] you have to hear about it must be the capital of\nHer mother carried it way over\nThere and missing boy stepfather ... points to parts of his roof strewn a mile away\nMostly I just carried it way over\nThere on the missing boy stepfather Feisal points to parts of his roof strewn a mile away this is one of the neighborhoods Indonesia plans to declare a mass grave and memorials Raul these family says they are not ready for that\nEnded up his grandmother ab sleep that the camp for lost children every night she kind of storage it grandmother to the kids they climb on her lap and tell them please thank you\nChat again they gotta have had about\n... so precious she says and our time with them so funding there have been a few reunification tier when parents walking and spot they're missing child but they're also more unclean to children being dropped off\nAkbar Helene for UNICEF chokes up recounting how street vendor recently brought in a little boy his mother had handed him off and she was swept away by the tsunami\nThat police held my job [noise]\nAnd the mother is gone and this is my six [noise]\nAnd we try to find the families have\nYou been here a week hearing all these stories and it doesn't get easier if the river\nAnd he says he will never give up an Indonesian brother and sister were reunited with their parents ten years after the big two thousand for Asian tsunami ... initially thought he'd be in ... for days or maybe weeks but UNICEF is just told him to plan to be here for at least three more months\nLauren Frayer NPR News ... Indonesia\n[noise]\nAnd regional lose the emerald fire department has announced its new plan to combat wildfires as the Amarillo globe news reports the plan was announced that the city council meeting this week\nFire officials say the community wildfire protection plan greatly enhanced his efforts to reduce wildfire risk while also saving lives in protecting homes and other property in the area\nThe plant encompasses everything within the Emerald City limits all the way out to the five mile territorial jurisdiction\nTo repair the procedures fire experts evaluated the wildfire hazard in and around the emerald community rating it and assigning target areas that need work in order to improve safety in Amarillo\nDuring the research phase the Amarillo fire department recognizes two hundred and four different communities and Thirteen thousand homes that are either in high or extreme danger of wildfires for high plains public radio on Jonathan Baker\nAnd this is Angie ... for all things considered great story by Jonathan Baker I'm definitely a story that resonates across the high plains with a wild fires that we've seen in the area fortunately we've had some moisture recently but\nThat just I think as an example Valerie of a story that even though it's happening in Amarillo the you know that could someone in Kansas could hear that and they go that's a good idea maybe we should do that here\nAnd I think that's what H. P. P. R. brings through its regional news is connecting all of a the whole region together in that way um so that's kind of what I feel like as a big value of H. P. P. R.\nI remembered now of of a listener in Amarillo, Texas carrying nor whom I had a conversation with him and he said\nIn these ... times we need things that connected and high plains public radio it's a great healer of our time because it erases those border lines that divide it and it connects us as a region because of what is happening in Texas\nOf our time because it erases those border lines that divide it and it connects us as a region because of what is happening in Texas can greatly affect what is happening and Kansas what is happening in Kansas can affect what's happening in in Oklahoma and in Colorado\nAnd as a region we come together as a life long learners to high plains public radio to benefit\nFrom the service your contribution allows high plains public radio to continue to deliver quality news that informs and binds us together as a community one eight hundred six seven eight seven four for for this is the phone number for you to call this is your invitation\nTo call now and get your dollars doubled\nThank you so much too too very loyal and dedicated listeners in Amarillo barb in gym\nBarbara pardon me and Jim wet and they have so graciously offered this membership match which means your contribution today of fifty dollars will turn into one hundred dollars whatever level you give\nThe challenges effective for seven hundred and fifty dollars and perhaps you can do the entire seven hundred and fifty dollars and the match could be met in one phone call\nBut the beauty of being listener supported and that it's listeners doing what they can to make this service possible at whatever level\nThey can come to one eight hundred six seven eight seven four four four they will be a friendly voice on the other end of the line\nA welcoming you to the high plains public radio families will ask you just a few questions like your name and address and how much you would like to contribute today you get to decide how much money you want to double this hour\nOr maybe it's a one time one hundred dollar donation turns into to every single dollar takes your public radio station closer to the gold one eight hundred six seven eight seven four four four or pledge online at H. P. P. R. dot org\nIf you don't have power um unless you have a way to set up a fire so those kinds of problems are what are facing people\nAll right That's NPR's Debbie Elliott in Panama City Florida thank you daddy You're welcome\nTo another story now millions of Americans post our ancestry information on line [noise] new research is showing just how easy it is for law enforcement to use this data to zero in on the relatives who may have committed a crime NPR health correspondent Rob Stein has the details\nPolice made headlines last spring when they finally nabbed a suspect first series of brutal rapes and murders and California from the Nineteen seventies and eighties\nAs the golden think killer finally they capture California investigators and Jed match dot com to name just change the Angelo at the facts and the genealogy website to try to identify the notorious home state killer\nAnd that was just the beginning police around the country of started doing the same sort of thing to solve other cold cases so young ... Ehrlich kept the company my heritage wondered just how easy is it to use databases like his to find people\nWe wanted to quantify how powerful the technique to identify individual\nSo Ehrlich and his colleagues analyzed the DNA for more than one point two million people in this company's data base and discovered something startling for more than sixty percent of people of European descent they could identify or relative as distant as a third cousin most of the people in the database or white\nEach person that debate as a because that illuminate hundreds of the reality though it's enough to have your third cousins or your second cousin once removed in these debates as to actually identify you\nThe same way that a GPS than you there's multiple that's I like to find a location\nAnd when the researchers combined their data with other information like where a person probably lives and our old they are they could quickly zoom in on a suspect\nOf course you need the judge correctly they need to do the work but you have enough power to to get very close\nAnd Ehrlich use the same techniques to identifier supposedly an anonymous woman whose DNA was stored on the national institutes of health research database raising questions about how would not miss the supposedly anonymous databases really are\nThe picnic doesn't only can get you criminals all you can catch criminals with the technique but you can also use these techniques for other purposes maybe purposes that could be either do commit\nSo early says the findings raised questions about how genetic information could be misused\nThe police covered the using these techniques to find it really like you know ... and ... people but uh we okay review the technique to identify people that I don't know\nWe'll find these really like you know ... and ... people\nBut uh we okay review in the community to identify people that I don't know in the political demonstration that leftover DNA behind a wheel K with these new foreign governments are going to exploited the snake to defy you to do this for their own purposes so the Dominican argue that you can think about me you\nKnow many people defend the use of these techniques to help solve serious crimes\nExcited to see this demonstration that genetic genealogy it's so powerful\nEllen great tack works at ... which helps police solve crimes is way\nWe're working on these changes that you haven't been able to be solved for decades they're all either homicide or sexual assault and and some of these are just I mean they're her effect in murders of children things like that it just [noise] [noise] things that need to be solved\nAnd great jak says it's not nearly as easy as this new research may make it sound but others argue that the findings underscore the need to make sure people know what they're getting into when they agree to give up their genetic information Erin Murphy is in New York University law professor\nIf it comes out tomorrow that they can you genetic information for something that feels a little unsavory it's going to be virtually impossible to claw back the information that you've put out into the world and more importantly you've made a decision not just for yourself but for your siblings for your getting cut and for people you don't even know you're related to for your children for your children's children\nSo Murphy and others think better ways are needed to protect people's DNA to make sure it is an misused Rob Stein NPR News [noise]\nTomorrow on MORNING edition archbishop Oscar Romero was fascinated in El Salvador in Nineteen eighty Romero was a dedicated champion of the poor and marginalized tomorrow the Catholic Church will make him think you can hear that story tomorrow by asking your smart speaker to play NPR or your local station by name [noise]\nYou're listening to all things considered from NPR News\nSupport comes from local author George H Hopkins the novel one more turning the page set in Nineteen eighty nine Robie Kenya is available on Amazon more at one more turn the page dot com\nI I'm married and you're listening to members supported high plains public I spend most of my time when I'm\nListening to public radio in the ground when I'm driving so I'd like to talk shows with his wife particularly enjoy the things considered something that is not\nReally one sided with the other side\nEducation based from my from my perspective the tradition [noise] always get quite sad when I'm Out of\nListening rage Thanks Mary\nThis is Angie have winter air host for all things considered and as Mary said all things considered what I really enjoy about it is it's not one sided view all sides of a topic an issue it also finds the human aspect of a certain topic and\nI think that's what I really appealed to me as a little bit deeper look at some of the topics you might hear just the headline about on other in other news outlets\nAnd if that's something you appreciate that something you value it's a great time to call because you can get your dollars doubled or just for a few more minutes so so called one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nOne thing that Mary commented on in the educational value of high plains public radio on when the corporation for public broadcasting was established fifty one years ago by Lyndon Baines Johnson that was his goal to keep\nYou apply plains public radio on when the corporation for public broadcasting was established fifty one years ago by Lyndon Baines Johnson that was his goal to keep educational airwaves available to the public and that is exactly what high plains public radio does and that is exactly what your contribution\nDoes is it keeps the educational airwaves available in our region a wonderful incentive for you to call and become part of the family of lifelong learners who support high plains public radio\nAnd it's a great time to call one eight hundred six seven eight seven four four four because your dollars will be doubled at the beginning of the five o'clock hour K Kennedy who is a new staff member to high plains public radio\nReached out to a gym went in and said hey Jim we're getting ready to pull out this membership match which wish us luck and he said\nThumbs up good luck good luck\nBut the thing is that the public radio station cannot do it alone\nYour support is needed when you call one eight hundred six seven eight seven four four for not only will you get your contribution doubled whatever level you can give right now it will be doubled in every dollar makes a difference in takes public radio closer to the overall goal\nTo for the first month of the fiscal year one eight hundred six seven eight seven four for for the phone number for you to call right now\nPerhaps ... we'll answer your phone call tell her why you listen to high plains public radio tell her why all things considered is an important part of your day Bob David sitting out there executive director you might be lucky enough\nFor Bob to answer the phone right now and take your pledge but it all starts right now with your initiative and you becoming part of this service to help keep educational airwaves available in our region here's a very important number right now one eight hundred six seven eight seven four four four\nAnd ... you mentioned education based I find as a a journalist when I'm reporting on a story I learn a lot about a different topic almost every day that's what makes my job fun\nAnd I try to and Jonathan Baker also we try to prevent all of our regional news that way in a way that informs and educate our listeners so that maybe they see a new angle on a topic that they've never thought about before and I feel like NPR also obviously does a really good job of that\nOn all things considered so it's a great time to support\nThe program the radio station by calling one eight hundred six seven eight seven four four for\nA member supported or mission driven and where your public radio H. P. P. R. as your public radio station call one eight hundred six seven eight seven far far far right now and you'll get your dollars doubled or you can go to H. P. P. R. dot org\nPlains public radio in the voice of this region and you have an opportunity right now to have a voice in the public radio station when you call one eight hundred six seven eight seven four four four and get your dollar doubled you can also leave your comments tell us why all things considered that is important to you\nTell us about the value in the benefits that it has in your life\nBecause likely it benefits one of your community members and the same exact way share your story and share\nSome of the load that it takes to bring that service to you and your community and over three hundred communities across the region with your pledge of support right now one eight hundred six seven eight seven four for for\nGrounding achievements of two distinct you're this week we're exploring music the bridge those world as we pose the question\nWe get from bar debate though is\nThat this week on exploring music [noise]\nMonday through Thursday evenings at eight central\n[noise]\nThose those Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere on line at H. P. P. R. dot org\nThe availability of H. P. D. r.s Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[noise]\nWherever\nWe go forward you're ever going to give up your children are up\nIn vast rescue and recovery effort is underway in Florida has tropical storm Michael's sweeps north it Thursday October eleventh and this is all things considered\nI'm Mary Louise Kelly and I know the Chang hundreds of thousands are without power and\nI'm Mary Louise Kelly and I know the chain hundreds of thousands are without power in Florida well here comes to town on the panhandle where the devastation is the worst also how did the Kavanaugh fight change Republican strategy heading into mid term election when\nActivists are yelling at senators and the halls and harassing Republicans in restaurants that really antagonize would be an element of fellow on what kind of album he does not want to make one that would have people things that I\nRemember this guy will disreputable remind you when you liked him immediately about proposition first thing you\nLive from NPR News in Washington I'm jak spare daylight and the Florida Panhandle brought into sharp focus the devastation there after hurricane Michael a strong category for storm tore show yesterday\nMichael leveled row upon row of homes and caused extensive damage the worst occurred in the area where the storm made landfall NPR's Debbie Elliott in Panama City Florida says recovery will be some time in coming\nSo they're just all kinds of challenges facing emergency responders and the people that remain in Panama City\nYou know they've got to boil water notice going on right now there's very little if any cell phone service emergency responders are saying they're having communication problem and that tampering their recovery effort\nThere are just all of these problems that need to be overcome before the actual recovery can begin NPR's\nDebbie Elliott now a tropical storm Michael is dumping rain on the Carolinas as it moved east powerful weather system is blamed for at least six deaths the senators voted fifty to forty seven to confirm President Trump's choice to lead the Justice Department's civil rights division NPR's Carrie Johnson reports the nomination of language for more than a year\nSenate narrowly confirmed Eric dry band serve as an attorney general running civil rights unit drive an served as general counsel of the equal Employment Opportunity commission in the Bush years he also worked for independent counsel Ken Starr who investigated President Clinton\nThe Leadership Conference on civil rights had called dry banned the wrong man for the job partly because of his background defending companies against it screaming nation law suits\nThat Senate also proved Jeffrey Clark to lead the Justice Department environment and natural resources division Justice Department leaders say it should not have taken sixteen months for these nominees to wins Senate approval Carrie Johnson NPR News Washington\nIn order for a long ... CEO of electric vehicle maker Tesla shareholders will have to vote on it\nThat requirement among others can change in a court briefing fall today by tests on the FCC brief is part of a settlement between testify in the wall street watchdog mosque and Tesla agreed to pay twenty million each and make concessions instead on as the ISI lawsuit alleging must grouped investors when he made a statement about taking Tesla private\nBut the second day in a row the stock market plunged the bank right dot com chief analyst Greg McBride says there's a simple reason now that\nThe economy's doing better interest rates are rising and or the bond market a kind of got that memo last week and the stock market got that mental this week uh and as a result did investors are predictably throwing a little bit of a temper tantrum\n... ride says despite the law says do not sell he says selling indoor declining market may be the worst thing an investor can do on Wall street today the Dow dropped five hundred and forty five points to twenty five thousand fifty chew the NASDAQ closed down Ninety two points you're listening to NPR\nSupport for high plains public radio comes from town play sweets by Mary ... located in Garden City and dodge city with a commitment to make\nSupport for high plains public radio comes from town play sweets by Mary odd located in Garden City and dodge city with a commitment to make guess comfortable whether staying for a day a week a month or longer\n\nHere's your high plains weather forecast\nIn northwest north central Kansas and northeast Colorado tonight rain likely with load and the upper thirty a chance for and continue the north central Kansas in northeast Colorado tomorrow otherwise partly sunny with hide in the mid fifties in southwest Kansas and southeast Colorado tonight a chance for rain was loading the upper thirties areas of fog early tomorrow with hides in the upper fifty\nAnd then the panhandle tonight a chance for drizzle with load and the mid forties patchy fog early then mostly cloudy tomorrow with highest in the mid sixties\nAnd this is Angie ... for all things considered I'd like to thank all of our listeners from the last hour for helping us me article this hour we are looking for six calls at any level\nAt six o'clock hour you know getting a theme here of the six o'clock six thing at six calls\nAny level whatever works in your budget one eight hundred six seven eight seven far far far or online at H. P. P. R. dot org right down\nYou know it was a great opportunity for us to uh\nHave a very very successful uh all things considered and that's what it takes in these membership drives every hour every hour makes a difference and if you can help us during the six o'clock hour be one of the six calls that\nPuts us over the top of this goal will be a much closer to the overall goal and your public radio station will continue bringing you news and information program\n... that you can count on every day\nOne eight hundred six seven eight Seventy four forty four is the number to call to make the pledge of support do it right now we're going to go back to the news and other some great stories coming up but they just took a few minutes megaphone called eight hundred six seven eight seven four for for\nEight hundred six seven eight Seventy four forty four is a number to call to make your pledges of support be counted as a supporter of all things considered on high plains public radio eight hundred six seven eight seven four for for\nAll things considered from NPR News I'm Out the Chang and I'm Mary Louise Kelly\nAt least six people have been killed since hurricane Michael blasted a short yesterday the category for storm left a huge trail of destruction along the Florida Panhandle\nIncluding in the coastal community of Mexico beach which is where we find NPR's Greg Allen enough on line in Mexico beach are understandably not great but we think we've got you hey there Greg\nHi Mary Louise how bad is it [noise] [noise] well\nIt's what you would expect to you know the category for storm nearly category five which came ashore right here the I passed right over this this area and Mexico beach which is a very small community you know the storm surge came in and you can see signs of every of every where there's still lots of standing water here most of the water went out but there's still plenty of it around\nBut it was those wins or a hundred and fifty five mile per hour winds just tore our hearts many buildings here lifted up entire buildings through them down and other ones you saw roofs off you know fighting off spies off um luckily the most people have had left and weren't here to Seattle\nAnd are you able to drive around them into the streets relatively clear of water\nYes here it's a very small community and the to the streets themselves and not too bad getting here is another matter you know we came over from Tallahassee today it should be a couple of hours\nYes here it's a very small community and the through the streets themselves are not too bad getting here is another matter you know we came over from Tallahassee today it should be a couple of hours my producer Becky Sullivan and I took us nine hours to get here because you just don't know what roads are open and then when the roads are open they're just barely open you have to drive around this round down trees\nYour power crews out and in in ... and good Samaritans doing what they can but it's still very hard slog get in or out of this area right\nAt what about the impact on people I mean there's always with the storms some people said they rode out the storm I assume you've been out talking to them what are they saying\nYeah I mean it's it's a tough one I talked to them a man here who stayed and he said he left in hurricane oval which was in Nineteen Ninety five and he always regretted it so hard to get back into the community later he always worried states we stayed\nAnd he said the storm was like and you think he was prepared for it or at ever experienced before you know the the sound the noise the the windows the walls flexing\nAnd he had a little safer and built for himself and his paths at one point he said it became so he's something told him that this was no longer safe and they moved to an inter a bathroom and that happened the windows shattered glass blasted and he said he certainly would have been injured it that'd be the case\nAnd it kind of struggled to patch up his window and rode out the rest of the storm and ah today's your repairing his house with a neighbor you know I asked him if he was sorry that he said he says no he'd do it again because he says if I didn't stay there all my mature all my possessions everything will get ruined by the rain and the other stuff coming in\nOr H. P. P. R. dot org this one caller at any level that works for you and you can always bumped that up later if you like we're also looking for some maybe some members out there who\nNeed to renew their membership and be a great time to call one eight hundred six seven eight seven far far far or go to H. P. P. R. dot org to ensure that we're able to continue delivering\nThe regional news you've come to rely on as well as the national and international news that you get through NPR and all things considered and MORNING EDITION\nCall now one eight hundred six seven eight seven four four four\nSupport for NPR comes from the station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com\nFrom zoom zoom offers cloud video conferencing online meetings and a video conference rooms solution in one platform featuring digital video and audio with screened chairing account registration and more\nAt zoom dot us and from American for the art from NPR\nNews this is all things considered ... Chang and I'm Mary Louise Kelly President Trump and rapper Kanye West met for lunch today one topic on the agenda gun violence in Chicago was told Trump he opposes stop and frisk police tactics\nThe president's ideas have different greatly from what reformers and local leaders are trying to do\nA different that was on full display this week as NPR's Martin Kaste reports Chicago's had a rough\nFew years in twenty sixteen murders jumped to the highest rates in two decades something Trump talked about a lot during his campaign since then the murder rate there has followed some but gun crime remains a stubborn problem and this week the president said he wants to help\nMy of director the attorney general's office to immediately go to the great city of Chicago to help straighten out the terrible shooting wave to straighten it out or to straighten it out fast is no reason for what's going on there [noise]\nBut what that\nMeans that turns out the opposition the minister ration its filing a brief with a federal court thing it opposes a package of police reforms in Chicago that's known as a consent decree the decree aims to improve police training and rebuild trust between cops and the public\nTrump does not like consent decrees he says the real cure for Chicago is more intense of policing\nStop and frisk it works and it was meant for problems\nLike Chicago [noise] it was meant for stop and frisk [noise] from says\nThe widespread stopping and for skiing and potential criminals reduces crime that conclusions contentious though and stop and frisk can also turn into racial profiling under twenty fifty in court settlement Chicago police have had to fill out extensive forms justifying their stopped which has led to fewer stopped\nThe administration believes that sort of court ordered limitation on policing can make crime words and that the new consent decree is more of the same\nBut Lisa Madigan says it's a little late for them to be weighing in\nLimitation on policing can make crime words and that this new consent decree is more of the same But Lisa Madigan says it's a little late for them to be weighing in what we really\nHaven't had any keep from them and count now\nMadigan the Illinois attorney general last year in an unusual move she sued the city for a consent decree doing the job that the Trump Administration would not\nOr if they wanted to have a role or they had that opportunity they decided that they are getting a job that the\nTrump Administration would not\nOr if they wanted to have a role or they had that opportunity they decided that they uh get knocked and therefore chose to do nothing\nHe regards the consent decree as necessary reform but that word is not reassuring to former cop Peter Moskos\nYou know reform as a word as just as William loses stop and frisk\nHe's a professor at the John Jay College of criminal justice in New York and host of a podcast called quality policing\nIt called him to agree with the Trump Administration on something but he says the evidence from places such as Baltimore is that federal consent decrees can sometimes make crime worse by limiting the intensity of policing in the places where young men carry guns and shoot each other\nIf we're going to reduce murders we have to go to places where murders happen there's going to be racial disparity but that is separate from racial bias and racial bias has to be attacked but certain neighborhoods need more policing\nMany policing experts these days lament what they see as a false choice between the strictures of Obama era consent decrees and Trump's unquestioning support for tens of policing\nIn Chicago's city leaders are digging in against Trump's rhetoric asked about it yesterday Mayor Rahm Emanuel lashed out at reporters for taking the administration's opposition seriously\nYou guys even in the stories acknowledge it has only symbolic value you guys got to stop acting like ... little mice chasing every time Donald Trump said something it doesn't have any value\nTrump's opposition to Chicago the consent decree probably is symbolic the administration's brief is not likely to stop its approval in court but on Monday when Trump called for stop and frisk the applause from the police audience was very real highlighting the ongoing tension between them and the reformers Martin ... NPR News\nThank God the crew alive those were the words from it in for Russian President Vladimir ... after a Russian lawyer you rocket carrying two astronaut to the international space station failed during and today\nAt liftoff had proceeded smoothly for about two minutes then came in real life drama\n[noise] up\nHere and I had like five times a day or my family out of that was happening [noise]\nThe crew American the Hague and Russian Alexei option in our space after an emergency landing in context on three other astronauts are currently on board the space station and now they're returned home might be delayed\nFor more on all of that we are joined by Canadian astronaut Chris Hadfield he served as commander of the international space station and twenty Thirteen and flew up there and back any Russian Soyuz capsule welcome\nThank you nice to be talking with you also\nSo this was going to the American ... first time into the the second for like the ocean and what kind of training with they had had to handle a situation like that\nOf them in training for decades Alexei as a cause but not for quite a while as you say with space flight experience Nick prior to being an astronaut was a test pilot in the U.S air force so that's an extremely risky complex job so they've been getting ready for this for many many years and then the second\nFor many many years and then specifically for this launched working together for a couple of years we've ran out every last thing that could possibly go wrong\nAnd the way the crew behave there were so Chris and professional right on top of their game you would never know that the vehicle was behaving so badly if you listen to all Alexei ... which dealing with things bringing them both safely actor\nWendell given a chance you could go on a mission like that again I mean I Can't imagine a psychological blow\nYeah you're you're right you know the crew at first will be super focused in professional and doing their job but afterwards they're just going to be kind of mad because they didn't get to go to space today you know kind of\nLike gosh all that preparation that even that but neither of them got hurt and they're they're back in the game and they'll have a chance to fly again by and I don't know who will fly next it's way too soon to tell it's going to be a long time to figure out what went wrong\nAnd then we'll have to start thinking about who should fly next what skill sets should we need one is that going to be all of the repercussions that come from an event like today\nTell me what it will take what kind of conversations are going to have to happen to figure out how to move forward the\nFirst thing we need to do is find out what went wrong what failed in this rocket there's a lot of information people be able to sift through video of it but also the sensors on board then we need to see how can we fix it was it a design problem manufacturing problem who knows\nThat and once you know that you can fix it then you can set a timeline if that in three months from now than no big deal but if it's going to take a year or two years\nThen we need other plans Boeing is building a rocket that can take people to the space station or ... or a spaceship SpaceX is building a shift that can take people to the space station maybe they could be accelerated maybe they could fly before the Russians are going to be ready to fly again and when do we bring the crew back from the space station all of those questions need to be analyzed\nThe ... and they were expecting to return home and now that return could be delayed correct\nThey flew up and the different ... talked to the space station it's sort of like a lifeboat or their their their ride home if they're they can come home anytime they want but if they dock and come home than they are basically abandoning ship the space station would be empty and it's a big enough and complicated enough chef\nThat after a little wild things start to go wrong and there'd be nobody there to fix them so it really causes a lot of risk for the space station to leave it on man so people will be looking really hard at all of the limits and have to decide what the right trade offs are we don't know the answers yet but but it it's going to be a really complicated decision making process coming up\nChris Hadfield went the first Canadian commander at the international space station thank you very much for joining nice to talk of the aisle so effective [noise]\nThis is NPR News\nSupport comes from the campus leadership center publisher of what's right with candidates everyday citizens transforming near state by ... O'Malley available from Amazon and watermark books information at what's right with Candace dot com\nAnd he's coming from within Saudi society he knows the major players and leaders in the Saudi royal court so it's different you know if I criticize Saudi Arabia for something that's one thing but if ... ah did that\nThen it's different because he's speaking from within the family\nTo strike you as puzzling though I mean the reports are being source to Turkish officials Turkish investigators saying that this team of Fifteen people flew in on private planes with the express purpose of targeting 'cause she'll get that just seems like a massive operation to take out one editor\nIt sounds so crazy that it's hard to get your head around it that Saudi Arabia would go this far to allegedly killed one of their critics\nCan you imagine that this actually happened in the way that Turkish officials say it did\nYes I think it's the most um persuasive and plausible scenario right now I I I think many people have been waiting for the Saudis to offer evidence to the contrary they haven't but not only that they've shown I think it's surprising level of indifferent to almost as if\nYou know their taunting the international community in a sense and if they really didn't do it then there's a way for them to demonstrate that but I think that the evidence is building and also sources from different intelligence agencies are moving in this direction it seems that this is the most plausible scenario\nShadi Hamid thanks so much for having me and my pleasure Shadi Hamid is a senior fellow at the Brookings Institution we have been talking about Saudi journalist and dissident Jamal ... now ...\nDisappearance and comfortable murder is draining relations between Washington and Riyadh and it comes at a time of heightened tension between the U.S and turkey where ... was last seen the Trump Administration than it is giving the disappearance high level attention but the U.S has ... in either not hear me\nThe last scene the Trump Administration says it is giving the disappearance high level attention but the U.S has noon bachelor in either Saudi Arabia or turkey NPR's Michele Kelemen reports\nRobert Jordan was the Bush administration's ambassador to Saudi Arabia in the wake of the September eleventh attacks and he said in times like this it's crucial to have an ambassador someone who's appointed by the president and confirmed by the Senate\nYou can't really deal with the highest level or government on the ground\nWith our and brush her career\nAnd without someone who is constantly ground for American\nJordan now a diplomat in residence at Southern Methodist university says an ambassador would help coordinate us efforts on the ground in Turkey and in Saudi Arabia to find out what happened to ... and would be making clear to Saudi official how one settling this is\nA threat to the relationship I got to have people are rushing and extra cash freelancers like Roger Christian or show the world that we're ... we're\nPushing her Trump's son in law had close ties with the Saudi crown prince Mohammed bin Salman a powerful figure who's accused of being behind the disappearance of the journal that Kushner is relying on Saudi help for Middle East peace plan he has yet to unveil\nFormer ambassador Jordan says it's possible that the crown prince fields embolden by this relationship with Trump zone and loan\nAs for the president he says he wants to get to the bottom of the good show gate situation but he's not ready to cut off lucrative arms deal\nWe don't sell it to all they'll say well thank you very much worldwide from Russia or thank you very much will buy from China that doesn't help us not when it comes to jobs and not what it comes to our company's losing out on where\nTrump was speaking a day after a group of senators sent him a letter requiring him to consider sanctions against Saudi Arabia Senator Chris Murphy is also calling on Trump to dump supporting the Saudi military campaign in Yemen\nThat bombing campaign in our participation in a it was predicated on our belief that the Saudis are telling the truth but they are not intentionally trying to kill civilians given the fact that it is likely they are not telling the truth about what happened to Jamal could show you why would we believe them but they are not intentionally hitting civilians inside Yemen\nJordan the former ambassador to the private sector should also speak out and boycott an upcoming investment conference in Saudi Arabia\nAnd really there is a universal reaction or orange for the ... grand\nA crown prince who he says it played a lead role in the disastrous war in Yemen a botched political intervention in Lebanon and a purge of his critics at home Michele ... NPR News the state department\n[noise] you're listening to all things considered from NPR News\n[noise]\n\nEach week and our tournament this earth author ... questions she began asking as a young woman working beside her father a third generation high plains farmer questions like how to make a living well also too hurting the land and water beneath our feet\n\n[noise] like any farmer my father loved driving along a wall of green corn and computing the many bushels would yield and the money these were put into his bank account\nHe irrigated his car and out of the ... the aquifer and always believed that the government which shut him down before he ran out of water meanwhile the government was actually encouraging water use by subsidizing his corn crop through this\nThat the government which shut him down before he ran out of water meanwhile the government was actually encouraging water use by subsidizing his corn crop through the farm program in two thousand seven ten years after my father's death\nThe federal government further intensified the aquifers decline by passing the renewable fuel standard\nThe resulting demand for corn and feed stock for ethanol led to a drastic expansion and corn acres despite many impressive new technologies such as soil moisture centers and variable rate sprinkler systems that can apply water only is needed\nFarmers are on a collision course with a fundamental disparity irrigated car and requires that they pump over a foot of water out of an awkward for that receives less than an inch of rain and snow melt each year\nYet today if you have questioned the wisdom of growing a crop that exceeds the aquifers recharge rate many times over nor do many questioned the role that federal farm program and ethanol policy to play and they all coffers decline\nWith prices now lo and wall of dollars no longer piling up behind walls of corn this might be a good time to open that discussion\nWhy does the farm program offer high plains farmers revenue protection insurance on ... that can only be achieved by draining the nation's largest awkward for\nIs the renewable fuel standard which requires that ethanol be mixed with the nation's field supply ultimately good for farmers bottom line\nIt's brutal boom that tripled corn prices and land values but also caused a glut of corn on the market that drove corn prices back down land prices are sure to follow\nHow many farmers find themselves underwater in debt while having used up most of the water below ground\nShouldn't federal dollars go toward preserving national resources and promoting longevity and agriculture rather than policies that deplete reserves of oil and water and fuel a boom and bust ...\nInstead of paying farmers to grow a crop that depletes the water that future generations will need the government could pay farmers to regenerate their soil or to return more land to grass or to finish cattle on grass or to water less or to grow more drought tolerant crops\nAs long as those federal dollars continue to flow I Would think that farmers would actually prefer they'd be spent on keeping their soil and water beneath it in as good a shape as possible\nUs representatives and senators must run for election and farm country it is up to farmers and the citizens of communities that depend on the Ogallala Aquifer to tell them what they value most which will it be water or corn\nIn dealing bear is the author of one degree west into Google all of the road for a link to her books and other essays visit Julian ... dot com\nOr turn of the earth is a production of high plains public radio Britain and void by Julian beer and produced by Angie ... more episodes can be found on line at age BP are done Oregon [noise]\nSupport comes from ... company presenting concerto an F ... conducting and featuring Konrad towel on piano October nineteenth and twenty at seven thirty PM at the globe new center Amarillo symphony dot org\nAnd that was an interesting this is Angie have fully what your host for all things considered and uh the turn of the earth you just heard there in Julian bear a hurt her\nA knowledge of the ... for the water\nJust heard there ... there are hurt hurt a knowledge of ... for the water usage there\nI thought it was very timely with the announcement of ethanol uh the EPA going to be a ... year round and the thirst thought first thought I had was a well we've already got as Julie mentioned a very uh water\nAt the ... the crop of corn crops take a lot of water already and I just interested to know what how this will impact that further and I just thought it was interesting how timely her piece was with that announcement yesterday\nYou know all these things are or what we present on high plains public radio looking at all signs of a of the of the issues and the things that are important to our region", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Dalhart", "day": "11"}