{"month": "10", "state": "TX", "station": "KTDH", "content": "Educational cultural and community life across our region every day many thanks to loyal members who keep H. P. P. R. going and keep the mission strong gang knowledge ... gift today at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on error recognition for here support look under the support tablet H. P. P. R. dot org for details\n\nAnd waiting and waiting and waiting [noise]\nChange some sort of champion be amazing\nHow ... front and center in voters' minds in Arizona will hear what people want after the November midterm it is friday October nineteenth and this is all things considered\n... Chang and Phoenix, Arizona and I'm Mary Louise Kelly in Washington DC this hour of the Justice Department has\nBrought its first criminal charge of alleged Russian interference in the twenty team in terms plus a look at the White House reaction to Jamal ... suspected murder the president has swung from condemnation to a road kill her theory to reserving judgment\nFast vets are\nBut we'll see what I was\nBlessed the revival of an old classic Jamie Lee Curtis makes another Halloween movie for years after the first\nTime I had no intention of being in another Halloween movie now use\nLive from NPR News in Washington I'm ... beer Turkish state media reports prosecutors are questioning employees of the Saudi consulate connection with the disappearance of a journalist NPR's Peter Kenyon reports from ... was watching entering the conflict October ...\nMedia couch say more than a dozen employees of the Saudi consulate were being questioned in relation to ... disappearance drinkers investigators have said they have audio and other evidence showed you was killed in the ... and his buddy dismembered\nThe latest leaks from Turkish authorities say investigators searched a forested area in northeast ... because the Saudi diplomatic vehicle was tracked heading to the forest the day 'cause she'll do disappeared Turkey's foreign minister ... shoulder today said he read news accounts that President Trump had requested Turkey's audio evidence\nBut he said it had not been shared Peter Kenyon NPR News ...\nNew York ban has been arrested and charged with allegedly threatening to US Senators NPR's Ryan Lucas says purported threats were related to the lawmakers support for Brett Kavanaugh authorities arrested Ronald to receive and Smithtown\nUS Senators NPR's Ryan Lucas says purported threats were related to the law makers support for Brett Kavanaugh\nAuthorities arrested Ronald to receive in Smithtown Long Island to Seventy four year old has been charged with threatening to murder and assault two U.S senators in retaliation for their support for Brett Kavanaugh Supreme Court nomination\nCourt papers said to reach he left more than ten explicit and threatening voice messages for the two senators during Kavanaugh's confirmation process and wonder if he allegedly says the senator better pray Kevin ... is an elevated to the court and then it warns quote I'm going to get you\nThe senators are not identified but the criminal complaint says neither is from New York Ryan Lucas NPR News Washington\nA caravan of Central American migrants is clashing with Mexican police at the country southern border about fifty people were apparently able to knock down the Guatemalan border fence defined both Mexican authorities calls for an orderly migration US President Donald Trump's threats of retaliation\nMexico City today secretary of state Mike palm pale at a news conference with is Mexican counterpart was asked about the border situation\nWe are deeply aware or that the the way that Mexico will handle this the way you will handle this is your sovereign decision or Mexico will make its decision it's leaders and its people will decide the best way to achieve what I Believe our our shared objective\nPolice drove back other migrants using pepper spray before closing the border gate the migrants mostly from Honduras and said they intend to make their way to the U.S\nUs home sales slipped in September the national association of realtors the industry's main trade group says home sales fell three point four percent last month that was the biggest decline in two and a half years Hurricane Florence caused a downturn in sales in North Carolina but even excluding the storms effect sales would have been down more than two percent\nOr makes clothes on Wall street to end the week the Dow was up sixty four points to twenty five thousand for forty for the NASDAQ fell thirty six points to the standard and Poor's fight five hundred was down one point today you're listening to NPR\n\nEnergy and environment reporting comes from I think the great plains and the corporation for public broadcasting and this is Andy have layer heads for all things considered and joined in Studio ... Dale Bolton Bob data\nThat afternoon it's a beautiful afternoon I Hope you've had a chance to get outside and get some fresh air and\nEnjoy the scripts fall weather because we've got a little bit of work to do this afternoon feed it it is a four minutes after four o'clock in the central time zone\nAnd uh as our intentioned in this membership drive in about three hours in the meantime\nThere's some heavy lifting to do\nAnd Judy Norden of Kansas is right there to help us\nWith a five hundred dollar membership match show your pledge get smashed dollar for dollar this hour\nIf you will just call eight hundred six seven eight seven four four four remember it's the it's what makes all things considered available to everyone all of us on the high plains is are your plans of support Judy's help call us at eight hundred six seven eight Seventy four forty four\nUp we're going to have an update on the Justice Department's investigation into Russian interference in us elections and also a little bit of an update that Paul Manafort of President Trump's former campaign manager appeared in Virginia courtroom today\nThat debates coming up before we get back I just want to say that this has been a great success this uh this final day of the fall membership campaign\nOr it is it is a lived up to the uh the east coast of gain knowledge grow community in give now there's a lot of giving now going on this uh this day and this afternoon lots of H. P. P. R.\nGain knowledge grow community and give now there's a lot of giving now going on this uh this day and this afternoon [noise]\nLots of H BP our listeners have stepped up to the plate now it's your turn\nTake advantage of this a membership match by Judy Norton a veto Kansas thank you very much Judy thank you\nTo everyone who's called today and throughout this uh this Dr call one eight hundred six seven eight seven four four four or go on line H. P. P. R. dot org were almost back into the news so take advantage make the call right now\nYou know we've only got moments before we go back to all things considered thanks for saying what are the ... this drug is excess because of you made hundred six seven eight Seventy four forty four of you have a major budget\n\nFrom NPR News this is all things considered I'm Mary Louise Kelly in Washington and I melted Chang in Phoenix, Arizona where I've been talking with a lot of voters about the mid term elections\nWe came to Arizona for reasons we're exploring throughout today's show first it's a state where tight races are going to be decided by the voters in the middle the moderates\nThe independence and their minds are on health care which is nothing new healthcare it's been a top issue for the past several elections but the fight used to sound more like this\nIt's working despite countless attempts to repeal undermine the fund the famous will\nLead to repeal the failure before it literally heels women kills children senior citizen\nBut in twenty Eighteen the conversation about health care is different even though the Affordable CARE Act has been weakened by the Trump Administration it is here to stay for now and during this midterm election\nBoth sides are reckoning with what that means for Republicans it's about the knowledge and what the AC eight got right\nAnd for Democrats acknowledging what got wrong\nAnd what I Want to do now is introduce you to to voters who helped both sides get to this point\nI traveled to the red rocks of the donor I meet a man who used to be on one extreme of the Obamacare debate and then ended up on the other ... lives with his wife two cats and six dogs\nEveryone is right here\nBecause we jak\nKey me\nValentine I'm hungry [laughter]\nSeven years ago genes was just about the most fervent conservative you could find new taxes new government as he puts it the principal he lived by with everybody leaves me the heck alone and when it came to Obamacare gene felt a special loading\nOr you know I told my wife we were going to close our business before I complied with this law because as the owners of the small business I Would be able to do all the way to provide health insurance and knocked on my wife we would close our business before I did use that are shutting down then partake in Obamacare I Would have\nBeen in late ... eleven his worldview came crashing down genes was on the phone one day and I didn't meet his voice disappeared he thought maybe it was just allergies he didn't have health insurance so he waited months before seeing a doctor\nAnd one advantage there is to take a I don't know if you realize as Bob but we just got an update on the goal\nAnd when we match this dollar for dollar membership challenge from duty Norton of Utica, Kansas we will be below thirty thousand dollars left on our goal yeah good spot and an eight hundred six seven eight seven four four four be a part of today's success make your pledge today\nEight hundred six seven eight Seventy four forty four you know everything is set up all the pieces of the puzzle or in one room and railing the go to take your pledge right now\nAfter today gets it gets a little more difficult uh so what a great time to call them won't be any more membership matches next week\nOr it will be appealed to the new members won't be there for next week call now eight hundred six seven eight seven four four Ford do it now\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed to financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from zoom zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio with screen sharing account registration and more at zoom dot U. S.\nVideo and audio would screen sharing account registration and more at zoom dot US\nAll things considered from NPR News I'm Mary Louise Kelly and I'm also change the department of justice has achieved a Russian accountant of information warfare federal prosecutors say it's an attempt by Russia to disrupt the upcoming midterm elections\nNPR national justice correspondent Carrie Johnson is following this case and joins us now he carry Hi Elsa\nSo how does that count and how does she fit into the ongoing investigation of Russian interference in us elections her name is Elena ... she's from St Petersburg Russia and she still inside Russia Today\nProsecutors have charged her with conspiracy to defraud the United states she was the counting the bean counter for this Russian Campaign to interfere with elections here in the U.S and others around the world\nBetween twenty sixteen twenty Eighteen the budget for this operation with thirty five million dollars but the OJ thing only part of that what's been buying ads and setting up\nA ... court here in America now this woman works for a company controlled by a Russian oligarch also known as ... chef because he got in certain catering that oligarch has already feed us sanctions and accompanied tied to him was already charged in Washington DC earlier this year\nNow these are the first charges federal prosecutors have filed over Russian interference in the mid term elections what do they tell us about how Russians are conducting this so called information warfare these people are awfully persistent this effort certainly continued even after\nLarge numbers of Russians were charged earlier this year by the special counsel Robert Mueller and today in charging do not involve the Mueller team this case is being brought by the U.S attorney in Alexandria, Virginia ... and the Justice Department's national security division\nAsked for the Russian am oh here it seems to involve using divisive issues like gun control immigration race relations exploiting divisions already within the United states\nThe court papers include examples of Facebook app and language that beats up on former President Obama late Senator John McCain of Arizona and offered directions to the co conspirators like\nListen Russian if you're posting something that's aimed at American liberals don't mention the website Breitbart likewise if you're targeting us conservative steer clear of mentioning bugs feet so people and some sophistication about their audience [laughter]\nSo send U.S intelligence officials delivered another warning about election security shortly after these charges were announced what were they concerned about what was the warning it's with a joint statement from the director of national intelligence the FBI and the department of homeland security and they'd say they're concerned about ongoing campaigns by Russia\nChina and other foreign adversaries including Iran to undermine confidence in election\nAnd how to use social media to target American voters but they add we don't have any evidence of a compromise or disruption that would basically prevent people from voting or change vote counts\nI Know you also spent some time in uh Virginia courthouse today your job never and you were they're following the ongoing saw that Paul Manafort President Trump's former campaign chairman what's the latest there yeah the judge in Virginia ... Smith ten charges on which that Virginia a jury deadlocked earlier this year he Senate sentencing date\nFor Paul Manafort for February twenty Nineteen men of would of course it's pleaded guilty in a related case in Washington DC he's cooperating with investigators the judge says if Manafort cooperation if not done by the time of sentencing he can always get a break her leniency later on\nAlpha Manafort up here today in court in a green jail uniform in a wheelchair hit lawyer Kevin downing says he had some health issues a source close to ...\n... el ... Manafort up here today in court in a green jail uniform in a wheelchair Hitler Kevin downing says he had some health issues a source close to Manafort that it's a problem with his diet in jail and keeping him in a wheelchair for now and That's NPR's Carrie Johnson thanks carry my classroom\nSupport for all things considered comes from ... presenting George Gershwin concerto and a half what Jack and the buyer is conducting in the king Conrad doubt on piano October Nineteen twenty at seven thirty PM ethical or new center ... symphony dot org\nAnd coming up to about twenty five minutes after the hour for twenty five in the central time zone or it is a time of transition we are are we are looking at the end of a week the beginning of a weekend or we hope that the beginning of your weekend\nAnd you're getting ready to come home from work and everything else and there's a lot of business it usually goes on around this hour but there's also a little bit of\nA little bit of the pressure's off\nThat's great but don't let all the pressure off because we're still working toward the very end up our fall membership campaign and we need your support is has been a great day a fantastic day to get those phones ringing in the website click on a a\nA members coming from across the high plains and even people who were just passing through passing through ah from New Mexico in and called in and said that you guys going this is good I Love this I Want it I I appreciate it\nSo um it's a great day we've had high plains listeners from across the region step up and do their part now it's your time to do your part Judy Norton she did her part Judy is from Utica can't is she put up a\nFive hundred dollar membership match and that is well on its way to being met\nMhm yup we got a call from Matthew ... of Amarillo, Texas\nAnd he took a chunk of that are gay my anger management match a Matthew thanks so much for your call a there is still dollars available this isn't only good in the five o'clock hour eight hundred six seven eight Seventy four forty four is the number to call and you can get your pledge match dollar for dollar\nAnd I'm not sure I explained well enough\nHow important that is right now\nRight now we're ... again I'll say that we're all set up to a most officially process your pledge to support the public radio office thing is there are those volunteers out there there's phones there's ah computers all the stuff\nThat we need to efficiently process pledges are in place right now we have a matching a membership match on the table right now there's dollars to match or pledge\nAll those things can come together and be a a\nTremendously successful our for now half hour for a for all things considered if you'll just call if you just go to your computer and dial and click on H. P. P. R. dot org and say give now to public radio um\nI was thinking about this you might not be off work yet no but you have a chance to listen you know maybe you have your discreetly\nTucked in headphones and your ear buds and nobody knows you're there and and you could look like you're working and type in a way and ah and make a pledge of support the public radio just go to H. P. P. R. dot org you don't have\nTo be that ... and I'm sure your boss is a wonderful person who would understand if you're a you're getting involved in your community every boss wants a\nH. P. P. R. dot org is the is the way you do that a make a make a call or if you want to talk to some great folks there are just across the window for me and they're waiting on you\nMake a make a call or if you want to talk to some great folks there are just crossed the window for me and they're waiting on your phone call eight hundred six seven eight Seventy four forty four that's how you do it eight hundred six seven eight seven four four four reach out to your public radio station and make a pledge right now\nYou know that's the thing about it when you make that phone call\nOr this can take a short of a matter of time as you wish it to be or or as long as as you wish to be you can uh you can we've had we've had calls that lasted longer than ten minutes Fifteen minutes people call in and they tell us what they like about high plains public radio they tell us about what they wish was a little bit better\nThat's all good we want to hear that we crave that sort of feedback\nOn the other on the other side of the equation if you are if you're in a bit of a Russian you just want to call one eight hundred six seven eight seven four four four\nAnd a knock it out that friendly voice on the line well efficiently take down your information thank you very much and let you get on the rest of your way you'll probably back into the news before then\nSo uh right now we are indeed going to head back into some regional news ah from our regional reporters that are covering all of a swath of territory\nThank you bond and this from the Kansas news service or vice president Mike Pence raise funds for Republican ... candidate Kris Kobach last night in Wichita\nHitler's going\nWe're going to try to the bottom of it first\nPresented it to support the theory were you and other reporters on the plane able to ask pump pay oh what's going on\nHe kept his distance from us the whole day or when he was having these meetings and it was only after he had met with Mohammed and sell them on the young crown prince is really kind of the power broker in Saudi Arabia President Trump called in to this meeting and President Trump was the first to tweet\nWorking right now Donald Trump tweeting just moments ago just spoke with the crown prince of Saudi Arabia who totally denied any knowledge of what took place in the Turkish caused all of it was with secretary of state Mike Pompeo\nDuring then the state department had to put out a statement confirming that Trump had called in and that the crown prince had in fact denied that he had any knowledge of this and that the king denied as well Trump then\nMoved on his back here in Washington again he gave an interview to the a P on Tuesday in which he compared the allegations against him ... ... to allegations against his Supreme Court nominee now Supreme Court justice Brett Kavanaugh all the\nPresident's saying here in a in an interview with the Associated Press quote here we go again where if you're guilty until proven innocent\nOf the shell column and you buy now you're left Riyadh you've flown on to turkey where of course ... ... has disappeared Turkish investigators are presenting all kinds of evidence that Mike Pompeo say he's found anything out he's found any factor this point\nNo one's in fact it was this down there because we it was as we were leaving Riad we asked him point blank did the Saudis tell you that this Washington Post columnist was dead yeah what they say he said\nI don't want to talk about any of the facts\nThey they didn't want to either and if they want to have the opportunity to complete this investigation in a thorough white\nAnd he called that an incredible success I'm\nGuessing there were some follow up questions among the press corps on the flight home a draw headed back you flew back Wednesday a from Ankara back to Washington After the mission that was not to find out the facts of what happened\nYou land a and then the next thing we hear from the administration is we need to give the Saudis more time\nThat's right and and he did say that on the on the trip as well because we asked him about the optics of this um that it looks like business as usual with the Saudis and he insisted that he had very direct conversations that they were serious but he also went into this long line of ... prompted defense of the relationship\nI Do think it's important that everyone keeping their mind we have walked important\nRelationship an actual relationships between us Saudi company\nGovernmental relationships things we walked around together all across the world\nAnd particularly now as the as this administration is trying to reimpose sanctions on Iran they need the Saudis to maintain the oil markets they need the Turks to stop buying so much crude oil from Iran so there's a lot of geopolitics here at play and this one particular case\nSo here we took closer business on friday a Seventeen Days after Jamal ... J. walked into that Saudi conflict stumble and disappeared [noise] are we any closer to answers on the the two key questions\nWhat happened and what is the U.S going to do about it\nNot really I mean that there is a moving in Congress to push\nAnd and what does the U.S going to do about it [noise]\nNot really I mean that there is a moving in Congress to push for it leads them targeted sanctions against the people who were found to have been involved in it um\nAnd the administration has to respond to that President Trump that said the consequences are going to be Syria\nHave to be very severe I fed fed 'em but we'll see what happens is that like you\nReally want to give the Saudis a few more days to come up with their story and in the meantime the Turks have been leaking all kinds of information and very gruesome\nDetails about this case [noise] NPR's Michel ... thank you thank you and\nAnd the last word on this story for now talking to reporters today Trump pointed out Congress will have a role in the U.S response to ... jeep disappearance he also pointed out the Saudi investment create jobs in many of their states and he added quote I Hope we don't lose track of that\n\n\nYou're listening to all things considered from NPR News\nThis is Sharon ... with the USDA marketing service and dodge city Kansas the Kansas daily ... purchases for friday afternoon\nNegotiated cash sales confirmed for the day nine hundred thirty seven week today four thousand eight hundred sixty one\nLives stairs six hundred forehead fourteen Seventy one pound average at one eleven life ... two hundred and fifty three heads Thirteen forty five pound average also at one eleven no grid based sales for the day or for the week today [noise]\nTexas Oklahoma and New Mexico negotiating cash sales confirmed friday on one hundred forty three headed make stairs and heifers week today two hundred eleven no good sales for the day we today one thousand three hundred and fifty two\nIn Nebraska on friday negotiated cash sales confirmed on four hundred thirty eight head we today thirty seven thousand three hundred and fourteen lives stairs two hundred Twenty one head Fifteen hundred pounds at one eleven\nGrid bake sales for the day one hundred Seventy one week today one thousand eight hundred twenty two\nCattle sells on a formula basis around the nation had kind of Nineteen thousand five hundred weighted average weight a hundred and fifty one pounds weighted average net price one Seventy six eleven\nBox we've cut out bodies were higher on moderate to good demand and light to moderate offerings choice six to nine hundred pound carcasses were valued at two o seven Ninety three up one eleven select six to nine white carcasses at one Ninety four twenty four up one eighty nine\nChoice elect spread Thirteen dollars and sixty nine cents location include sixty four loads of cuts forty three loads of dreamt a loved one hundred seven loads\nThe cutter Cal ... value is one fifty to Seventy eight eighty six cents a movement of one hundred thirty eight loads hiding off all value on Fridays nine dollars three cents down seven cents\nEstimated livestock slugger on friday one hundred Fifteen thousand cattle Saturday forty three thousand we today six hundred twenty five thousand [noise]\nThat's down fourteen thousand from last week and down eight thousand from last year of the estimated friday at four hundred and sixty four thousand Saturday two hundred thirty five thousand we today to lay in five hundred eighty nine thousand up one hundred thousand from last week an up one hundred and Twenty one thousand from last\nYear the western Kansas gray market for friday October\nNineteenth wheat is up one and a half God's city at four Seventy one call before sixty Weingarten city for sixty sixty four Seventy one gun at four fifty six protection for sixty six got city at four fifty six sublet Syracuse and you listen to that\nWeingarten city for sixty sixty four Seventy one the line at four fifty six protection for sixty six got city at four fifty six the blood Syracuse annual is is that for Seventy one corners down three and three quarters that city at three sixty Kobe three twenty nine Garden City three fifty nine to three sixty fourth\nGulen at three twenty seven protection three fifty seven got city three forty seven it's about three Seventy two or three sixty two you let the three Seventy two\nMy lowest six lowered at sixteen lower mostly seven lower\nThat city called the Garden City at five forty eight then five twenty seven protection five sixty six got city five thirty ... five sixty six decades five sixty three and you let this five sixty sex\nSigh beans are down to sensory quarters that city at seven twenty seven ... seven ... seven Garden City seven twenty seven twenty seven protection seven thirty to Scott city seven twenty seven to seven twenty seven to seven thirty to any list as at seven or eight\nThe model feeding a vetted Ashland it's six twenty the west Texas cut and paste prices Seventy one point nine two cents per pound F o bay [noise]\nThis is Sharon Smith with the USDA marketing service and dodge city Kansas\nSupport for USDA market report comes from ... Kansas fourth generation farmers providing wheat credit Kaylee and write the to farmers and ranchers across the high plains more information available at ... dot com\nPart also comes from union Pacific railroad reminding act professional to practice safe driving procedures when bringing in crop union Pacific or just producers to stay alert when crossing the tracks the harvest season U. P. dot com\nAnd good afternoon it is forty eight minutes after the hour you are listening to all things considered on your members supported high plains public radio were coming to you or during the very last bit of our full membership campaign and we're coming asking for your support this has been a great success today we've\nHad a lot of calls a lot of clicks\nH. P. P. R. dot org and listeners are stepping up across the high plains region in canyon and in Amarillo and ah all the way up across the entire state of Kansas in Colorado and this\nIn Oakland by the way the panhandle and Oklahoma where we had a hooker Oklahoma call or\nEarlier this day so the listeners too high plains public radio are stepping up and now is the time for you to do your support to lend your support too high plains public radio\nWhen the when I got a call or [noise] we're all going to call earlier from Matthew ... of Amarillo making his pledge he took advantage of the membership match and had his support for public radio doubled\n\nIt's Gloria good when I'm liberal Kansas and high plains public radio keeps me in touch with them world home on the high plains [noise]\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter of high plains public radio who's at H. P. P. R. dot org and look under the support him for details [noise]\nOf that\nLaw and order the president returns to old themes immigration and order at a rally in Montana it's friday October nineteenth and this is all things considered\nI'm Mary Louise Kelly in Washington and I melted Chang in Phoenix today coming up this hour at the Saudi dragging their heels on investigating what happened to ...\nShould the un step in I think that this kind of investigation could very well work even with expected resistance that the Saudis also reexamining Bill Clinton in light of me to Bill Clinton's lead a product of the very fact his era one since I can say we're not done reckoning\nPlus for only the third time ever space probe takes offering seven your trip to mercury at the head first news\nFrom NPR News in Washington I'm jak spear a caravan of Central American migrants now assembled a Guatemala's border with Mexico clashed with Mexican police today about fifty migrants apparently were able to push their way through\nSo now assembled a Guatemala's border with Mexico clashed with Mexican police today about fifty migrants apparently were able to push their way through James Frederick is there an describes the scene\nChaos broke out here on the mall in Mexico bridge or the migrant caravan was pushing against the fence and eventually broke down the fence on the bottom on side\nThey started marching towards the Mexican side and congregated around the block fences there and the fence on the Mexican side opened briefly we heard shots ah there was here down that was the point a few people were injured and then the gate closed the gap and\nSo there are thousands of migrants right now waiting on the Mexico bought 'em all the bridge reporter James\nFrederick the migrants from Honduras has said they intend to make their way to the U.S in defiance of threats from the Trump Administration the first members of the three thousand member group arrived at the southern border with Mexico early yesterday\nThe Justice Department is charging a Russian woman over allegedly interfering in the upcoming you will let us elections as NPR's Ryan Lucas reports it appears to be the first known case against Russians in connection with the midterms\nThe woman identified as a ... a sign of a is charged with conspiracy to defraud the United states for her a legit role in a Russian scheme to interfere in the American political process including the twenty Eighteen midterms court papers allege that she worked as the chief accounted for a sprawling Russian influence campaign\nThat effort included that same troll farm that faces charges as part of special counsel Robert Mueller's investigation prosecutors say casino managed the finances of operations I used to fake social media posts are so discord among Americans\nThe case against or is being handled by prosecutors in Virginia not the special counsel's office the forty four year old ... is not in us custody she is believed to be in Russia Ryan Lucas NPR News Washington\nA week after the Trump Administration asked a judge to reject the draft plan to reform Chicago's twelve thousand officer police force during the general Jeff Sessions says the kind of reforms being discussed will create a surge in violent crime there\nReforms include limiting police use of deadly force sessions says bring the department under close federal supervision is not the way to go micromanage\nThing the sci fi through a federal court order is justified really it's an insult to the department\nSessions Blinder dramatic increase in homicides in two thousand sixteen on agreement between the city and the American civil liberties union drop administration maintains that proposed will take flexibility away from police\nPennsylvania apparently is not the only state or federal authorities are investigating clergy sex abuse in the Roman Catholic Church officials confirm enforcement officials began to similar probe in New York state the buffalo dicey says it received a subpoena from federal prosecutors reaching agreement to produce material months ago\nOr makes clothes on Wall street that that was up sixty four points the NASDAQ fell thirty six points this is NPR\n\nNews has ... heads for all things considered and trying to think Judi Norton once again for providing that challenge you can't last hour because we went over [noise]\nThank you thank you and thank you for everyone who called in last hour and help that meet that goal and I I Am with Bob Davis here in Studio for this hour and a half that make us look now Bob for the pledge drive as a whole\nA hall that means that uh we have raised a little bit more than fifty four thousand dollars fifty four thousand four hundred and Twenty one dollars has already been committed\nThat support is already come the way of high plains public radio so everyone who's been a supporting thank you thank you thank you thank you thank you thank you thank you\nThere is more to do today it's been a great day we've heard from a lot of listeners on the phone\nYou thank you thank you thank you thank you thank you\nThere is more to do today has been a great day we've heard from a lot of listeners on the phone on on line they're doing their part this is your chance this is your chance here\nJust a little bit left to go in this fall membership campaign to lend your support by calling one eight hundred six seven eight seven four four four online H. P. P. R. dot org\nYes we've got just a couple of hours left of the pledge drive and like Bob Said thanks to all the callers who've helped us raids fifty for over fifty four thousand dollars already and the forty three new members who've joined high plains public radio\nEvery little bit counts your your membership matters and it's your public radio station so now the great time to support it by calling one eight hundred six seven eight seven four four four or go to H. P. P. R. dot or\nComing up and just a few minutes or one of my favorite segment I'm speaking for myself here but a\nWeek in politics on all things considered he joined the owner of the Washington Post and a Margaret Hoover a PBS his firing line\nUh this is a regular feature on Fridays they just sort of go through the week it's a great way to catch up if you don't more than what's happened since I got to work what happened all this week great way to do it\nOr you could probably make the phone call the one eight hundred six seven eight seven four four forget your support registered here and be and be done with it before the week in review start so please call one eight hundred six seven eight seven\nFour four four or online at H. P. P. R. dot org\nFrom NPR News this is all things considered I'm Mary Louise Kelly in Washington and I felt the chain in Phoenix at member station kj ...\nPresident Trump is campaigning in Arizona tonight the tricky part of a western swing to rally Republican voters added the midterm elections which are now just over two weeks away last night in Montana he distilled the Republican closing argument heading into the midterm elections to this [noise]\nI Know a lot [noise] of cabinet all\nThe power of in law and order and common sense that's what it's going to be\nThe caravan he's talking about is a group of migrants trying to reach the U.S border it's now the feature in his stump speech and joining us now to talk about all this is NPR White House correspondent Tamara Keith hate him high so why I'm Talking about another caravan at a political rally think well\nThis is not the first time he has talked about caravans I he talked about a different caravan back in April\nA this is a new one um and it's getting a lot of attention on cable news and so he is talking about it again he suggested at that rally without offering any evidence um it made a claim that at Democrats were somehow behind the caravan\nWhat they wanted the caravan and there are those the say the caravan didn't just happens it didn't just happen a lot of reasons Jarvis four thousand people but I just want to thank the Mexican government because they're so good hopefully before it ever [noise]\nShould underscore that there's really no evidence to back up this conspiracy theory that that he's been able to offer but you know the reason that he is talking about this and talking about illegal immigration is that it's something that gets its supporters animated\nYou know they are still at these rallies chanting build the wall almost every ... every time he's out there so basically this is just an effort to rally the Republican bands to get out and vote yeah and the evidence that it's a winning issue a there are two new\nSo basically this is just an effort to rally the Republican base to get out and vote yeah and the evidence is that it's a winning issue a there are two new poll from few that are out\nA defined that illegal immigration is an incredibly salient issue among those who plan to vote Republican in the upcoming elections at about twenty different issues facing the country\nAnd those supporting Republicans intimate terms uh Seventy five percent of them say that they consider illegal immigration to be a very big issue Jocelyn Kiley is associate director of research at the Pew Research center you can\nSee that ah there's energy a among Republican voters around the issue of immigration and that energy is most pronounced within the set of Republican voters who are really focused on border security and law enforcement\nJumped up and raise his hand and said yes yes count me yeah and I support high plains public radio there's a lot more room to go more opportunities show your support today call one eight hundred six seven eight seven four four four\nAs is less than are dead you can go online to H. P. P. R. dot org and click on the give now button that says the time to do it because you can get your dollars doubled through the through that's our thanks to that are awesome membership match from that listener in Kansas thank you again a one eight hundred six seven eight seven four\nThrough this our thanks to that are awesome membership match from that listener in Kansas thank you again\nA one eight hundred six seven eight seven four four four we take all except all major credit card you can be bill that you can do a bank draft whatever works for you one eight hundred six seven eight seven far far far or H. P. P. R. dot org\nSupport for NPR comes from the station and from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more it fidelity dot com slash wealth fidelity brokerage services that allowed the\nFrom Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattery Amanda Peter Paul rider and Kathryn ... on a new episode every Friday on prime video\nAnd from listeners like you who donate to this NPR station\nFrom NPR News this is all things considered I'm Mary Louise Kelly in Washington and I notice that change in Phoenix, Arizona\nPresident Trump is campaigning here tonight Arizona is a state where the G O P dominates politics right now\nBoth US Senators the governor most state lawmakers they're all Republican but that could change because waves of Latinos will become eligible to vote in the coming years and they tend to vote democratic which means Arizona could flip from red to blue\nUnless the Republican Party can win over the growing number of Latino voters in this state and to get a sense of that challenge\nTraveled to a town just west of Phoenix called policy it's about eighty percent Latino\nGuy\nI'm into restaurants serving port those out got as and tacos and I bumped into a guy who could uh give the Republicans some\nWay we handle our home especially in Hispanic community is away Trump wants to run the U.S\nRamon Baron owns a small business repairing floor is he's a registered Republican and he says he appreciates the values Trump's stand\nFor security for her you know you need certain order in in your home\nYou know the issues that came with the wall you know building a wall that's a good idea it is a good idea\nBecause I just installed not even two weeks ago a security door on my door I already have a door but I Would have better doors when you're a ... year old son he's fourteen years old and it's funny that he told me somehow that door makes me feel safer\nIt made me think you know that you know it doesn't make sense more more metal their keeps\nThe side and within seconds you'll run into people who vehemently just agree with the parents like evil Hernandez a truck driver who says immigration is the deal breaker the reason most Latinos will never vote Republican\nYou heard of the names are coming up with all these laws that make it more difficult for people for any country in the world to a status you seem to have been separated from the families of the water I think all their reflects pretty bad on the Republican Party you ask me\nI mean who's ordering all that you know Trump and his agenda\nThere is no reason Hernandez has view may not be worrying Republicans right now\nRepublicans are banking on two things\nJews have ... heads the Latino public policy center at Arizona State university\nAre banking on that there's enough white voters to win the election today and their banking that there's going to be short memory for Latino voters tomorrow\nBut Garcia says data don't lie Latinos will turn Arizona majority\nShort memory for Latino voters tomorrow\nBut Garcia says data don't lie Latinos will turn Arizona majority minority by twenty thirty and a whole lot of them are going to be us citizens\nTwenty Eighteen could be the last election that Republicans can win without also winning the Latino vote\nSo the question for Republicans is how will they persuade those Latino voters to join Thirteen [noise]\nI'm at a baseball diamond in a small park in northern feeding and the district to state representative Tony Rivera\nHave any of your friends or or any other members of the Latino community giving you a hard time for becoming a Republican\nI'm people have given me a hard time like what what did they say they say um how could you be a Republican and when the Republicans don't support 'em Hispanics will support immigration reform\nAnd his response of them is take a look at all of the other values of the Republican Party they mesh perfectly with Latinos face the traditional family small business entrepreneurship but it's not easy to get away from the party's position on immigration and you can hear that when you walk\nAround with their district as he knocked on doors [noise]\nI'm only going to take some of the time I was on the river on the Republican running for realize I'm I'm here to answer any questions they may have topics including our budget education immigration is a hot topic\nOf the show that people focus too much on the people calling from Mexicali\nSeparating families isn't the way to do a paper it doesn't look good on the news it doesn't look good\nWhen Leno I'm I'm a Republican was born and raised in short of parents are from Mexico\nAnd um this is an issue where I go outside with my party a little bit and the reason for that is one yes we are a nation of laws but I think that to the country and the opportunity I Know that our party has had somewhat of a bad label but there are Republicans who are supportive of immigration reform there are Republicans of smart and sensible immigration form and I'm One of them\nI'm One of them\nI ask Rivero if he thinks the Republican Party's position on immigration needs to change to attract more Latino voters\nI Believe we need a realistic um position on immigration one that includes border security one that legalize or people who are here who want to work hard who are looking for opportunities and when you increase the number of pieces of people who are coming here so we're not in this problem again and it doesn't become a political football ten years from now\nThat sounds like a different platform than the one the Trump administration's ...\nI'm a I'm going to continue pushing my position in that position is that I just mentioned\nThat independence from the White House is something you hear a lot from Arizona Republicans were trying to appeal to the Latino electorate like you hear it from Republican governor Doug juicy who's running for reelection this year against a Latino candidate\nI'm not here to rationalize what's going on in Washington DC I'm the chief executive of the state of Arizona I Can't be in control of what happens back east still\nI asked you if the Republican Party has a perception problem with Latino voters\nYou will hear me using the word Republican uh in in the reelection a study to see on the ballot and its diagnoses agenda\nJuicy hired a Democrat to lead his outreach efforts to Latino voters a guy named Mario Diaz who the former campaign manager for several prominent Democrats including Janet Napolitano and John Kerry it wasn't the as you approach do the for the job because the I think over the past four years the governor's\nDone a lot to move away from the divisive politics of Arizona's recent past\nThe governor does not support\nCertain language doesn't support\nThe divisive politics of Arizona's recent past\nThe governor does not support\nCertain language doesn't support certain policies\nThe national Republican mood and may may call for the is not suggesting on border security\nThat we need to stop them me to keep them out we need to build a wall not one says he said that no I cannot vouch for other Republicans I Am voting for Doug juice\nBut under that logic if Republicans want to appeal hearty why to Latino voters they will have to separate the party from the Trump administration's rhetoric and there are plenty of Latino voters who don't trust them to do that\nLike Abel Hernandez remember him the truck driver who says immigration the deal breaker for Hispanics here's the key Hernandez says his kids are going to feel the same way he does\nHe see what's going on to see how they treated us in\nOur film accuse you got to vote you got to go to ... vote and they said that we were ready to go over there over\nIn other words Hernandez says\nThe Republican Party states may already be sealed for generations to come and\nAs a sign of just how hard it is for Arizona Republicans to separate themselves from the broader party governor juicy will be appearing on stage at a campaign rally in Phoenix tonight with President Trump\n[noise]\n\nYou're listening to all things considered from NPR News\n\nSupport comes from the office product a phone line commercial Offit solution company currently serving sixty Kansas counties with locations in Garden City ... injunction city more information at key office products dot com\nAnd uh we'll just have to see where it goes from here\nAnd I know it's late where you are as well but at any reaction from turkey from Turkish officials to the Saudi announcement Turkish officials that of course been working with the Saudis which was kind of a joint investigation that they'd been showing\nNo reaction yet yet some eyebrows had been raised a when they decided to investigate this jointly with the Saudis they've been in on every search a but we'll have to wait and see what the reaction is\nAll right that is Peter Kenyon getting us up to speed from a stumble thank you very much Peter thanks very Lewis and we're going to hear now from\n\nHello my name is Susan ... again and I'm from canyon can [noise]\nI grew up in Kenya\nAnd I'm very grateful for that it was a great child I'm [noise]\nBut I'm also grateful that I was able to see a lot of the bigger world\nAfter teaching I followed my husband's career and we moved to Cincinnati, Ohio [noise]\nI got a master's degree from college conservatory music and my violin teacher was a wonderful gentleman named Walter living\nMr levine was the first violinist of the world class less solve court cat he was a trade citizen of the world and it since ... who told me about public radio when I was going in canyon there was no such thing and I always remember the violin lessons\nWhen Mr levine got off kind of on a tirade and turned to me and scared me in the eye and said\nYou should never believe any means you here except what you hear on public radio [noise]\nAnd you know the longer I live the more I realize that it's a really good piece of advice why should I form my opinions and thoughts based\nOn journalists who are beholden to advertisers I always knew that WG see in Cincinnati played classical music but I had never listen\nTo MORNING EDITION or to all the [noise] I tried to listen to at least an hour at least one of those every day and it truly became my source of information I was attracted to the exchange of ideas my expert [noise]\nWho are not selling any [noise] just sharing their [noise]\nPublic radio is absolutely the best source [noise] in journalism\nSelling and [noise] just sharing [noise]\nPublic radio is absolutely the best source [noise] in journalist [noise]\nAlways going to be grateful to the to the [noise] [noise]\nWell said Susan Milligan the Kenyan Texas of that is a that is stirring words and words that we hear frequently from listeners the high plains public radio and we ask why why are you listening what brings you here to this or\nTo the service they say this is it the news that is a is not serving any one cause or not any one candidate or political party it's not the news that serving some uh\nAdvertisers interest it is the news that is serving the cause of democracy serving the cause of information\nTo ah make informed decisions\nThis is why we're here this is the reason that we're here in the region that we're asking you to call one eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org and show your support we only have a little bit of time left in this member match don't we answer yes\nOr just you are all things considered this evening we've got a membership match from a listener in Kansas who offered up a thousand dollars\nTo get some people calling in their pledges of support one eight hundred six seven eight seven four four four because they'll the those pledges will be doubled so this members hoping to motivate some other listeners to call\nAgain that number one eight hundred six seven eight seven four four four you know we've had great success today and throughout the pledge drive from listeners because they're doing their part\nAnd we're asking you are to you to do yours by calling one eight hundred six seven eight seven four four four or you can go online to H. P. P. R. dot org and click on the given that but\nIt is almost a quarter until six o'clock in the central time zone or almost a\n... agent in towards the quarter to to five in the mountains zone and so this was a time of transition you are many many of our listeners are heading home from work their in their car um some of already made it home and they're thinking about what are we going to have for dinner what are we doing tonight is there a ball game what what's happening what's on TV [noise]\nMay I suggest take a few minutes out of all that transition every time you're done with the work week you're starting to we can\nGet the weekend started ride call one eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org show your support for high plains public radio and do not miss out on this membership match a thousand dollars from a listener in Kansas\nYes and again H. P. P.\nR. dot org you can go on line or you can call one eight hundred six seven eight seven four four four thanks again to all of our listeners who have called in their support and now we're going to hear at some regional news\nRegional new Kansas high school graduates performed slightly better on the ACT than the average student nationally and two thousand Eighteen\nThey see the annual report released earlier this week included data from the one point nine million students in the class of two thousand Eighteen he took the college readiness pet the average composite score for Kansas students with Twenty one point six the national average twenty point eight a perfect score on the ACT it's thirty six\nAnd other news the American civil liberties union says Dodd cities single polling site\nCould hurt voter turnout because of its location outside the city limits the ACLU says the city had multiple polling sites in the recent past that Ford county clerk Debbie Cox says there has only been one polling location since at least the late nineties she said there will be about twenty five voting machines available November sixth\nSimilar to previous years\nFor high plains public radio any ...\nTwenty five voting machines available November sixth\nSimilar to previous years for high plains public radio Annie and do you have fully\nSupport comes from that storm Burke museum of natural history in Haiti Kansas where you can search for buried prehistoric treasures in a fossil dig pet design for budding paleontologist more extreme bird dot F H. S. U. dot edu\nAnd you're listening to all things considered and in the studio here with Bob David ... Bob the story about the dodge city polling site I found interesting and it's just one of many examples lately in the news of\nPeople are really taking a strong interest in voting and things like stronger than in a ... from what I've experienced in a while and going out of their way to make it possible for people to vote and I'm just recognizing the importance of the upcoming midterm\nAnd I think that's a value that H. P. P. R. brings to listeners providing that information so they're aware of the fact that you know these are he very important elections coming up November six\nAnd if that's something you appreciate you can call one eight hundred six seven eight seven four four four but have you noticed the same\n... you know the ... the line for early voting in one state Georgia is a two to three hours this week as early voting began the lines have been long the interest is high and that is that's that's good that's important no matter\nWhere you fall on the political spectrum interest is high his eye is good news good news indeed\nAnd uh it is it is part of the mission of high plains public radio to provide the sort of reliable\nFair contextual news that you can use that you can use make your own decision right you can hear from the candidates you can hear from people who have different perspectives\nWeigh that mix it up that's part of our democracy is the field that keeps us going pleased because you support the sort of programming it because it's a value to you take advantage of the support you can land and get your money doubled thanks to a membership match from a\nVery generous listener from Kansas who has offered a thousand dollars during all things considered we really only have about an hour and Thirteen minutes to take advantage of it don't don't don't let it get passed you don't don't please don't\nPlease don't put it off please don't call one eight hundred six seven eight seven four four four or go on line to H. P. P. R. dot org\nYeah the important thing about membership matches as if it's not mad it's like all that money has lost so it's a very good time for you to call if you appreciate what you get from high plains public radio in terms of\nNews national international regional news or if you appreciate the variety of music that is played on high plains public radio or both as we've heard from several listeners who have H. P. P. R. on all the time\nAnd um I think that's true of a lot of listeners actually they just keep it on all day\nI you know what I call it I I call it the soundtrack soundtrack of the high plains yeah it is you you start your morning what what's what's been going on right when I went to bed\nAnd then and then you ... into an amazing amazing ... music program ... high plains morning you never know what you're going to hit here is is it Tina Turner yeah he was Tina Turner this morning\nWhat what's coming next I Love to I Love to guess what's going to be chimneys for yes go into sim phone you go into classical music and now we're right back into the news of the day\nOr all of this mixes into this wonderful wonderful little uh if you were from down in the in the body you'd say it's a gumbo\nAh this is Kevin causes your coast on the street ... coming up next on the program all senior songwriter Harlan people also joining us we'll be Guy Davis as he continues his series on the pine using innovators shrine and the blues hall of fame that's all coming up next time the tri county [noise]\nFriday evening at seven cents [noise]\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a whip stream then please thank and patronize the community sponsors you hear mentioned on the air who helped covered their direct cost of operation thank you [noise]\nConfirmed that Washington Post columnist Jamal ... dead Eighteen Saudis are being held and fix this hour we'll hear from our state department and White House correspondent friday October nineteenth and this is all things considered from NPR News\nWith also Chang I'm Mary Louise Kelly this hour\nCoburn nineteenth and this is all things considered from NPR News\nWithout the tank and Mary Louise Kelly this hour the Justice Department has brought its first criminal charge of alleged Russian interference in the twenty Eighteen mid term sand healthcare is\nFront and center in voters' minds in Arizona and waiting and waiting and waiting and waiting for some sort and change something champion [laughter] that'd be amazing well hear what people want to change after the November midterm plus a revival of an old classic Jamie Lee Curtis makes another Halloween movie [noise]\nI had no intention is being in another Halloween movie [noise] their stories and more for standards\nLive from NPR News in Washington I'm jak sphere\nSaudi state run television is now confirming what has been suspected and fear the death of journalists ...\nProsecutors there say primary results of an investigation soak soak gee who disappeared sixteen days ago was killed in a fight at the Saudi consulate in Istanbul and an Eighteen Saudi nationals have been arrested\nThere are also report several high ranking officials have been ... than an effort has been lost to reorganize the Saudi general intelligence agency under the leadership of the Saudi crown prince Turkish officials previously it said they believed to show get columnist often critical of the Saudi Government had been killed and dismembered inside the consulate\nThe west and South Korea have suspended another military exercise to give the nuclear talks with North Korea a chance to proceed still there's concerns the readiness of American forces is suffering as a result as NPR's Tom Bowman reports\nJust suspended exercises called vigilant A's and it was supposed to be good in early December it's an ear exercise that involves more than two hundred military aircraft\nThe Pentagon said in a statement that both the U.S and South Korea are committed to modifying training exercises to make sure troops already\nThe last month the new commander of U.S forces in South Korea army general Robert Abrams told senators they're already has been what he called a slight degradation and the readiness of U.S forces to defend against North Korea attack because of the suspension of another military exercises in the summer\nPresident Trump said that exercise will be provocative barring a term used by North Korean leader Kim Jong il and Tom Bowman NPR News Washington\nA caravan of Central American migrants who've arrived at the border between Guatemala and Mexico have clashed with Mexican police\nAbout fifty people were apparently able to push their way through a Guatemalan border fence defined both Mexican authorities calls for an orderly migration and US President Donald Trump's threats of retaliation but the rest were treated after police unleashed pepper spray police closed the border gates the migrants from Honduras have said they intend to make their way to the U.S [noise]\nUS law enforcement an intelligence agency said they are still concerned about possible that efforts by Russia China or Iran and other foreign countries to meddle in the upcoming us midterm elections\nThe latest assessment from the office of the director of national intelligence Justice Department FBI and department of homeland security homeland security under secretary Chris ... says there's no evidence the attacks compromise actual voting systems\nWe haven't seen certainly any compromises or any sort of access to election equipment or across the United states at this point\nAll the agencies are concerned about efforts to sway public opinion though some state and local governments was run polling sites have report would appear to be attempt to block their networks though officials say they were able to prevent access or makes clothes on Wall street ... weeks ... sixty four points the NASDAQ closed down thirty six points today this is NPR\n\nSupport comes from the burrowing owls bookstore in ...\nNPR\nSupport comes from the burrowing owls bookstore in Kenyan Texas offering a variety of new and used books for children and adults along with works by area authors and on regional subjects burrowing owls books it's on Facebook\n\nHere's your high plains weather forecast\nIn northwest north central Kansas in northeast Colorado tonight it'll be clear with load and the upper thirties pillow or forty sunny tomorrow with hides in the lower to mid sixties it'll be clear in southwest Kansas and southeast Colorado tonight with loaded in the mid thirties sunny tomorrow with hides in the mid to upper sixty\nAnd then the panhandle tonight it'll be clear with loading the upper thirties pillow or forties and then sunny tomorrow with hides in the mid sixties\nAnd you're listening to hire a high plains public radio you're listening to all things considered on high plains public\nRadio and I'm Angie hateful your host and women in the studio with Bob Davis and we're coming to an end I left our of our fallen membership campaign and we're getting ever closer to that goal were about a little under thirty thousand dollars away so that means we've raised\nA over fifty five thousand dollars so far and that's thanks to listeners like you who have pledged your support a one eight hundred six seven eight seven four four four\nAnd we've got a membership match going on from a listener from Kansas that enables you if you call in your pledges of support to get your dollars doubled so call one eight hundred six seven eight seven four four four\nYou know the way you climb a mountain as you do it one step at a time you put one foot in front of the other and you just keep on Trojan up and up and up and up\nAnd we have a that's what high plains public radio has been doing as we've gone through our membership campaign we are chugging along going higher and higher and as we do it\nWe're getting we're getting 'em you know\n... who I Am from the calls from ... I Believe a or a Web dinner early and says he's been cheering us along I feel that I Do I feel that we're we're you know there's an army of supporters out there if that spring you and it's time for you to make the call please do so at one eight hundred six seven eight seven four four four\nDislike Stephen and Diane or ride of Amarillo vague mauled in and they said they love the news so thank you for calling they've gotten their dollars doubled by calling one eight hundred six seven eight seven four for for this is all things considered\nFrom NPR News I'm also Chang and I'm Mary Louise Kelly and we begin this hour with news out of Saudi Arabia that the dissident journalist ... ... ... dead confirmation of his death came unexpectedly tonight on ... TV the detailed such as we have them or they\nCould show ... entered the shouted consulate in Turkey a fight broke out between him and people who were there to meet him and that fight somehow led to his death are still a whole lot of details we don't have we're gonna talk through what we do now with NPR's diplomatic correspondent Michele ... element and Robin Wright\nOf the Wilson Center and the New Yorker magazine and she has covered Saudi Arabia for years hello to you both good to be with you either [laughter] and Robin let me start by offering my condolences I Know that Jamal 'cause she'll Jay was a friend [noise]\nHe was indeed and I mean we this is something that we have known and suspected now for sixteen days but the Saudi announcement lax total credibility\nThat they have claim for two weeks that he walked out of the conflict and the idea that that a committee led by Mohammad bin ... on the crown prince is going to investigate\nSomething that he has been implicated in is going to lead to a lot of questions I think around the world\nPrince is going to investigate something that he has been implicated in is going to lead to a lot of questions I think around the world there is no Robert Mueller and the kingdom and it's going to be very hard for them to say anything that people are going to believe\nWhen we moved back to a couple of points you raised our Michelle first jump in and let me let you just give any more detail that Saudi TV is providing what exactly was the statement tonight well\nAs you said they they said that it was a a fight that I'm In which he died a which was a a sounded rather odd\nUm ... given the fact that that the Turks have been telling us that there were Fifteen people there are the Saudis have I don't even fight exactly uh the Saudis have said that I'm Eighteen people have been arrested now in this case um\nSeveral people have been relieved from their duties and that includes um a royal court advisor who's\nClose to crown prince Mohammed bin so mine so you know it it it's obviously getting close to him but uh it's not clear what if if he is ready at all to take any credit for it it sounds like\nThey're you know trying to blame lower level people\n... to to the point that Robin Wright just made how much confidence should we have in this version of events um given that it is a completely different version of events than the one that the Saudis have been sticking to before yeah you have to remember that\nWeighed in with a pledge they said thank you for carrying the ... NPR banner to this corner of the country's thank you very much Angie and ... suit here with me as well I Believe you have a thank\nYou and I knew he had an on line pledge\nA from dodge city Kansas so we appreciate the people taking advantage of that membership match or getting their dollars doubled calling one eight hundred six seven eight seven four four four or going to the website [noise] we've got just another few forty minutes of that so now is a great\nTime to call one eight hundred six seven eight seven four four four\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more it alliance for lifetime income dot org\nAnd from zoom zoom offers cloud video conferencing online meetings and a video conference room solution and one platform featuring digital video and audio would screen sharing account registration and more at zoom dot U. S.\nAll things considered from NPR News I'm Mary Louise Kelly and I notice that change the department of justice has accused a Russian accountant of information warfare federal prosecutors say it's an attempt by Russia to disrupt the upcoming midterm elections\nNPR national justice correspondent Carrie Johnson is following this case and joins us now he carry high also [noise]\nSo how does that count and how does she fit in to the ongoing investigation of Russian interference in us elections her name is ... she's from St Petersburg Russia and she still inside Russia Today prosecutors have charged her\nConspiracy to defraud the United states she was the counting the bean counter for this Russian Campaign to interfere with election here in the U.S and others around the world between twenty sixteen and twenty Eighteen the budget for this operation was thirty five million dollars but the OJ thing only part of that what's been buying at and setting up\nA ... court here in America now this woman works for a company controlled by a Russian oligarch also known it ... chef because he got his certain catering that only ... already facing us sanctions and accompanied tied to him was already charged in Washington DC earlier this year\nNow these are the first charges federal prosecutors have filed over Russian interference in the mid term elections what do they tell us about how Russians are conducting this so called information warfare these people are awfully persistent this effort certainly continued even after\nLarge numbers of Russians were charged earlier this year by the special counsel Robert Mueller and today's charging do not involve the Mueller team it's cases being brought by the U.S attorney in Alexandria, Virginia ... and the Justice Department's national security division\nAds for the Russian am oh here it seems to involve using divisive issues like gun control immigration race relations exploiting divisions already within the United states the court papers include examples of Facebook ads and language\nControl immigration race relations exploiting divisions already within the United states\nThe court papers include examples of Facebook ads and language that beats up on former President Obama late Senator John McCain of Arizona and offered directions to the co conspirators like\nListen Russian if you're posting something that's aimed at American liberal don't mention the website Breitbart likewise if you're targeting us conservatives steer clear of mentioning bugs feet so these people and some sophistication about their audience [laughter]\nSo send U.S intelligence officials delivered another warning about electric security shortly after these charges were announced what were they concerned about what was the warning was a joint statement from the director of national intelligence the FBI and the department of homeland security and they say they're concerned about ongoing campaigns by Russia\nChina and other foreign adversaries including Iran to undermine confidence in elections\nAnd how to use social media to target American voters but they add we don't have any evidence of a compromise or disruption\nThat would basically prevent people from voting or change vote counts\nI Know you also spent some time in uh Virginia courthouse today your job never ends you were they're following the ongoing saw that Paul Manafort President Trump's former campaign chairman what's the latest there yeah the judge in Virginia has dismissed ten charging on which that Virginia a jury deadlocked earlier this year he Senate sentencing date\nFor Paul Manafort for February twenty Nineteen men of Ford of course it pleaded guilty in a related case in Washington DC he's cooperating with investigators and the judge said that Manafort cooperation is not done by the time of ... I think he can always get a break her leniency later on\n... ... ... Elsa Manafort up here today in court in a green jail uniform in a wheelchair his lawyer Kevin downing says he has some health issues a source close to Manafort says it's a problem with his diet in jail and keeping him in a wheelchair for now ... and That's NPR's Carrie Johnson thanks carry my pleasure\n\nConsidered on high plains public radio\nWe have about thirty six minutes left in a membership match from a listener in Kansas\nHas offered up a thousand dollars for us to get some dollars doubled our borders you uh we'd love to hear from you right now one eight hundred six seven eight seven four four four\nIf you plug your support uh between now and seven o'clock you will get your dollars doubled a or you can go on line H. P. P. R. dot org\nAbsolutely this is the last little bit here we are coming down to the last thirty five minutes of all things considered it is the time when a programmer switches here on high plains public radio we've had we had news in the morning we had a little music\nUh and to say a little is under selling it greatly we had some great music this morning as we always do across the\nMiddle a portion of the day and now we're coming to that part where we come to the end of the news programs the news magazines that help you make sense of your day in your world in your region in your community in your town\nAnd so we've come to you because you support that and we are asking for your health\nAsking that you would call one eight hundred six seven eight seven four four four or go online to H. P. P. R. dot org when you go on line it's easier Shia click read give now button is at the top right hand corner of the website click it is a very easy process and you'll be on your way\nYes exactly I think it'd be like Selma from sooner on she has been a member for forty years oh my God almost about as long as H. P. P. R. has been around and she enjoys listening to blues jazz classical music and the news\nThat's about as long as H. P. P. R. has been around\nAnd she enjoys listening to blues jazz classical music and the news the news and thank you so much Selma she chose the call during the membership match and get her dollars doubled\nAnd we appreciate the ongoing support from you sound like over the years we have a lot of listeners like that who supported us very faithfully for several years for you know in some cases with like ... decades\nUm and you can you can begin that tradition yourself by calling one eight hundred six seven eight seven four four four or if you're already a member you can always bump up\nYour membership if you'd like or do a one time gift that one eight hundred six seven eight seven four four for\nListeners like film or are the reason that we are here this idea of public radio in the high plains started as an idea as a concept of the notion that something\nThat we're not tangible that wasn't the bricks in waters and microphones in speakers and mixing boards it was an idea it was an idea to bring this sort of programming to residents of the high plains\n... so so forty years later brick upon brick upon brick upon brick support by support call after call imagine all the phone calls that have been made to bring high plains public radio to where it is today where it is today\nIt's a it's almost incalculable to think about the ... the amount of sweat and work and phone calls and people taking those phone calls and whip clicks this is the chance to join with this loud loud chorus that supports public radio on the high plains\nThe number to call to make it next be the next caller that Joe joined this big chorus seeing in this wonderful song be the next caller right this minute call one eight hundred six seven eight seven four four four\nYes like Bob set of core as you've got to have all your part singing now marred written sound right so we need to hear from you and hear your part of the chorus at one eight hundred six seven eight seven four four four you know actually have to sing unless you'd like to [laughter] but you'll get your dollars double\nI don't think we call it you you guys wouldn't let no we wouldn't let it bother you are see but you know and that's another story goal yeah call in and asked to to let me sing [laughter] call when they asked a lot of a seven for for for me maybe maybe someone could be persuaded\nMaybe you know it might be something where we call have callers that have you stopped singing we're not sure yet\nUm but you know I Would love to hear from you we love you to join this a public radio station as Bob mentioned it was kind of the impossible and since people thought it was not even a possibility to bring this kind of public radio to such a large region\nAnd it's very different from most public radio stations because most public radio stations drop him a very large metropolitan population whereas we've got pop a population but spread out all over Texas ... or northern Texas ... Oklahoma Panhandle western Kansas eastern Colorado\nEnrolled is going to live at [laughter] All right now\nTo this day Jean says Obamacare saved his life\nI actually sat in my hospital death cry because my perceptions of the healthcare system a for profit health care of the fact that if I got sick I can show up in the emergency room and get treated Warhol\nJust so these days genes is an advocate for the ADA\nHe appears in commercials and at rallies to champion the law I'd always wanted to President Obama\n\nFive star I took it\n[noise] seven years ago a mother of two\nNamed Korean Bobby in Phoenix started at a very different place from jak genes body and independent remembers her other relief the day the AC a marketplace first went live\nThe weight that was lifted when the role that happened I cried and I am not an emotional person and I I went on the market place and I saw that we can I cried when that Bobby\nRight outside her children's school and to understand just why the A. C. A. was such a godsend to her you first need to understand something about her daughter\nSofia was born with what's called complex congenital heart disease or they'll call it ... and then she also has another word so has had a major heart left those she was also born without a spleen and some of her organs are in the wrong place\nAll of which means staggering medical or in the wrong place\nMissing or most\nAre in the wrong place all of which means staggering medical or in the wrong place\nMissing or most\nOf the ... already ...\nHer husband didn't have health insurance through work so Obamacare gave them hope during a pretty dark time at least for a while but about three years into a theater coverage ... started having problems getting the health care she needed\nAre specialists are changing she wasn't able to get prescription that she was totally able to get before and then by I think like the fourth year we started to notice that that providers are pulling out of the marketplace every year they just started dropping like flies\nBy twenty Seventeen Maricopa County where body live was down to just one health insurers in his entire marketplace [noise]\nOkay at this point in our conversation school let out and kids start spilling into the street in front of us body way and that Sophia which one is\nShe is she's coming in a ...\nYear okay this is now a ... ten year old with a huge smile gliding home on a hot pink scooter I really hate walking [noise]\nWhy why is walking so bad it's in Turkey legs but writing scooter could be really risky now because\nRemember how Maricopa County had only one ensure left on its exchange\nWill turns out the hospital that had always treated Soviet terminated its contract with that one ensure and Bobby decided staying with those doctors was important so she cancelled the families plan under the ADA which means the Bobby's don't have any health insurance right now\nWhile I'm thinking what happens when some emergency housing right with Sophia exactly so really know what what is your\nWeather that now it literally what I say okay we'll cross that bridge if they come to it like I don't have a backup plan right now 'cause I feel\nIt's terrifying it absolutely terrifying Bobby's hoping this will be temporary she will have more options for coverage during the next open enrollment period in November\nBut when she thinks about how hopeful she was when Democrats rolled out the a CIA she says what she didn't see at the time we're all the puck marks underneath the make up\nWhen you're Democrats cheering about it a plotting themselves are passing it is there something a little bit impatient that well enough inside it\nI think in patients is an excellent way to describe it I'm like I Am impatient because I'm waiting and waiting and waiting and waiting waiting for what some ... some ... fix would be amazing\n... says she doesn't know exactly what that six should be but you know she wants to see Republicans and Democrats working together to come up with some compromise and she said this is the single most important issue for her in this entire mid term election\nYou're listening to all things considered from NPR News\nIt was earlier this year that all of the justices of the west Virginia state Supreme Court were impeached the reason accusations of lavish office renovations and mismanagement state funds\nBut now just as there impeachment trials were getting underway the proceedings have come to an abrupt halt and the state is in the middle of the constitutional showdown West Virginia Public Broadcasting's Dave Mitch has the story\nOn Monday the state Senate president Mitch Carmichael dabbled in to begin the second of the impeachment trials this one for chief justice Margaret work management the chair calls the acting chief justice feral to the chair but here's the thing the acting chief justice wasn't there in an awkward silence fell over the chamber\nActing chief justice federal to the chair but here's the thing the acting chief justice wasn't there and an awkward silence fell over the chamber fasting chief justice feral being absent the quarter of a peach met will remain adjourn until it's presiding officer is present\nThe impeachment trial came to a screeching halt last week with a ruling from a temporary state Supreme Court the ad hoc bench wrote in an opinion that the charges against chief justice Margaret workmen were unconstitutional\nThe sixty five page opinion is complicated but here's what you need to know the health and overstepped its authority on certain charges and was flawed and its procedure here's West Virginia house speaker Roger ...\nWe believe it it it will do irreparable lasting damage to the cost of ... like they will no longer have any separation\n... who helped oversee the impeachment process and it's a train parliamentarian says yes it was within the houses power to impeach the justices for what they did with the legislative and judicial branch is at a standoff some are calling this a constitutional crisis others\nI Would describe it more as a constitutional challenge\n... he's a constitutional law professor at West Virginia University which should disclose the ... his wife is a Democrat in the house of delegates I asked him if he'd ever seen anything like this before\n[laughter] [noise] not that I recall um there are certainly have been Supreme Court slash legislative confrontations over the years in other states not around impeachment\nImpeachment he says are inherently political democratic lawmakers here say this process with the state's high court has been fraught with heavy handed this from the Republicans who have the majority\nThey'll get my pushed in a Democrat in the west Virginia House was the first to call attention to now suspended justice Allen Law free but when things started moving almost six months later plus getting was immediately suspicious\nI thought it was wrong of the governor to end up in the first proclamation of the special session to make it about the entire Supreme Court kind of like smelled that we're going to getting a little bit of trouble with such a broad based resolution\nShe and other Democrats say the most egregious spinning and questionable behavior came from law for not the other four members of the court last week law free was convicted on seven counts of federal charges\nYou know what a Republican justice a broke the law and has been found guilty of it and they weren't good with that they weren't just good with that they went further and they wanted to take out the entire court\nWith impeachment trials on hold the Senate says they plan to ask the ad hoc court to reconsider its position the other option would be to start the process all over in the house ... the constitutional law professor says he won't speculate on the outcome\nI'm not very good at projecting ... will happen in an instant in situation which is highly politically charged and of course we're on the cusp of an auction and uh how that affects decision making is is is rather unpredictable\nWith the situation likely to remain unresolved until after the election where things go from here could very well depend on the makeup of the next legislature for NPR News I'm Dave message in Charleston West Virginia [noise]\nWe're listening to all things considered from NPR News\nAnd you're listening to the high plains public radio would love to think marketing Carolyn Myra ... Kansas helping us get a little bit closer to that goal one thousand dollars by calling in their pledges of support\nThey said they enjoy the programming and they're thankful to have H. P. P. R. and they've shown it by pledging their support at one eight hundred six seven eight seven four four four and I've got to think he was well\nIs Bob Davis and uh I'd like to say thank you\nBy pledging their support at one eight hundred six seven eight seven four four four\nAnd I've got to think he was well this is Bob Davis and uh I'd like to say thank you to Linda Allen of Amarillo thank you very much at a very very nice note here that ah she has a sustaining member and making an additional pledge she wants to get a hold on one of those callers we haven't really talked about a much but if you go on our website on our social media you consume they're beautiful\nFive dollars a month or sixty dollars for a new member will get you one of the counters a thirty dollar additional gets you in one as well if you're standing member\nBut anyway I just wanted to say thank you she welcomed me and I'm Glad that I'm On board and says that she's enjoying the work that I'm doing and I just have to say it's really the work done by the staff at high paced public radio I Love those guys\nAre dedicated to this mission they are a really hard hard workers and so I'd like to thank them", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Dalhart", "day": "19"}