{"month": "10", "state": "MA", "station": "WBUA", "content": "Largest radio news rum Ninety two point seven ... eighty nine point one WVU wage Brewster and streaming at W. B. U. R. dot org you'll be you are all students NPR News station\nFunding for here and now comes from that were greeters of that land and simulate somewhere accelerating the pace of engineering and science you learn more and now we're not come from NPR and W. B. or Boston I'm Jeremy ... and I'm Robyn\nYoung hearing now coming up I'm probably going to read the FBI report on Brett Kavanaugh said they're all Democrats say it isn't meanwhile his college roommate steps vote away in\nOne breath started saying things about his drinking a and is a use of a certain words a sexually oriented words you know I knew he was he was lying\nAlso Stormy Daniels on her new book about the alleged affair with President Trump and the parts of her story she says haven't been told\nOf course everybody knows that you know about that ethic Ninety seconds\nAnd I'm back in two thousand sex with Trump and I was like I just don't want to write a tell all because it would be a very very short book anymore coming up here in\nThe news this first\nLine from NPR News in Washington I'm Luis give ... inside the U.S Capitol in a secure room senators are waiting their turn to read the results or the confidential background check\nOn sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh outside people are shouting to be heard these demonstrators support Cavanaugh I\nHave to know what we're\nHaving view the confidential materials available after the most recent FBI review Democrats are not impressed California's Dianne Feinstein is the judiciary committee's top Democrats\nThe White House certainly blocked access to millions of documents from judge Kavanaugh's record I Know that\nAnd ensure that Ninety percent of his emails and memos were available for the Senate for the public in the hearings it now appears that they also blocked the FBI from doing its job first\nProcedural vote is scheduled for tomorrow in the Senate\nNPR's Windsor Johnston is at the Capitol where the Supreme Court confirmation debate has energized voters\nPretty much anywhere you go on Capitol Hill right now the ... have their hand out of office buildings lining up to the U.S Supreme Court they've come a sign that reads stopped having all have an old lied under oath\nSummer sitting on the ground reading last minute letters delivered senators before they vote on Kavanaugh confirmation angry they believed that the U.S Supreme Court deserve better adjusted will serve the country and the judicial branch and they have that person not Brett Kavanaugh\nNPR's Windsor Johnston Iran's Supreme leader says his country will defeat American sanctions and deliver a slap to the U.S NPR's Peter Kenyon reports us oil sanctions are due to be re imposed next month\nSupreme leader Ayatollah Ali humming a delivered a televised speech to an audience of besieged paramilitary forces\nCalling it a sensitive time for the Iranian people which he blamed on arrogant powers how many appear to respond to a comment by President Trump that Iran could collapse under American sanctions\nReimposed after Trump's decision to withdraw the U.S from the twenty Fifteen nuclear agreement with Iran painful sanctions on Iran's oil and gas sector are due to return in early November European countries say they're committed to continuing trade with Iran despite the American sanctions\nBut a number of companies that do business with both of us and Iran have already announced their decision to drop the Iran business Peter Kenyon NPR News Istanbul\nFlags across South Carolina are flying at half staff the governor ordering the remembrance of seven law enforcement officer shot in the line of duty and Florence South Carolina one died Wall Street the gal down two hundred thirty five points this is NPR News\nThis is not the point nine W. B. U. R. object lumpy ours in Boston Senator Elizabeth Warren is calling to weigh Senate Republican leadership handled the FBI's investigation into sexual assault allegations against Supreme Court nominee Brett Kavanaugh\nA quote complete sham orange criticizing how the FBI did not get a full week to investigate that only one copy of the report was made for the entire Senate\nAnd that she was given less than an hour to review it or it's police say students at an elementary school in the city have been temporarily relocated to Lawrence high school because of the older of natural gas\nLease as mayor Dan Rivera say the incident is not related to the Miramax valley natural gas explosions and fires last month\nThe state's highest court is considering an appeal from a plane ville woman convicted voluntary manslaughter for sending text messages to a friend at telling him to\nLast year for Conrad Roy's death four years ago Roy die by suicide judge ruled the Carter caused Roy's defy encouraging him to get back inside the truck that was filling with carbon monoxide I was twelve o five\nWB or supporters include loved me in maker of go to a meeting proud sponsor of how I built this entrepreneur summit taking place in San Francisco at the ... center October sixteens more about the summit NPR dot org slash summit\nIn the forecast a mix of southern clouds today ... will be in the upper sixties low seventies should be partly sunny tomorrow chance of a shower early in ... in the mid sixties right now sixty nine degrees and Boston this is W. B. U. R.\nWere funded by you our listeners and by Blue Cross Blue Shield of Massachusetts helping you connect the dots with a Medicare plan that fits your life you can learn more it eighty eight eight hundred eight to ... for and why don't cottages of Westwood One loved ones can no longer live at home due to memory loss\nFeaturing a home environment and twenty four seven nursing care why don't cottages dot com\nOnce again this is W. B. U. R. jak NPR's here in the studio with Deborah Becker to tell you about our full fundraiser we are coming towards the end of this fundraiser was still a long ways to go so we're asking you\nTo pick up the phone and make the call to support the news stations here WB you are that we know you count on and that you rely on\nOne that has a one eight hundred nine zero nine nine to eight seven is the number to call you could of course go online to W. B. U. R. dot org one hundred eighty nine thousand dollars that we need to raise by the end of the day to day less than seven hours left\nTo raise nearly two hundred thousand dollars we can get there with your help\nOnly with your health that's the only way we can get there so you know Jackie said we have a long way to go and a hundred and eighty nine thousand dollar certainly is a lot of money to race but\nReally this is it the final or seven hours of the biggest fundraiser or the air for us so this is a big deal for us this is where we raise most of the money we need to bring you the news to be your source of news and information\nAnd gosh what a busy day it is you're probably tuning in and going to our website throughout the day to see what's happening\nWith this report I'm Brett Kavanaugh on his nomination and it's been very busy and we're working like crazy here to bring you that news what we're asking you to do right now it's helped us reached that one hundred and eighty nine thousand dollar goal in these next seven hours so we can end this fungi successfully and have the money we need to keep bringing the news to you\nWon eight hundred nine zero nine nine to eight seven is the number to call you can go online to W. B. U. R. dot org one hundred eighty eight thousand dollars is now than ever we need to raise and we uh you know I mentioned that there's not a lot of time left just to put that into perspective\nWe need to raise about a thousand dollars a minute through seven o'clock tonight in order to meet this goal that a lot of money a lot of money to raise it I'm not a lot of time and that just gives you a sense of the kind of time crunch that were under here so if it sounds like they have and I have\nA little bit more of a sense of urgency in our ... and that's because we are really at crunch time with this fall fundraiser dead you mentioned is the largest fundraiser of the year this is where we raise a big chunk of the money that we need to continue providing you with the news and programming you count on\nBut you are an integral part of that fund raiser we cannot do it without your support and so we're asking you to do your part and pledges of support here to WB you are one hundred a ... one hundred eighty eight thousand dollars that we need to raise in the next\nLess than seven hours you can call one eight hundred nine zero nine nine to eight seven or like going online to W. B. U. R. dot org\nMoney for this radio station the money for this and use it all comes from you and so we just take a couple of minutes during fund drives just like this one around the news around bringing you the journalism that it has done and remind you\nThat this is where we get the resources so please do your part please do it now and we're lucky enough to be able to offer various incentives right now you have a brand new twenty Nineteen super ... courtesy of city side Subaru and download\nA lucky less near is going to win that brand new car and you get to choose whether you want the twenty ninth and cross track or the twenty Nineteen outback\nDecisions decisions decisions like somebody will get to make that decision when you make that pledge but please\nHelp us reached this fundraising goals hundred and eighty eight now jak is that what we had to be a one eighty eight we've got to do it in the next seven hours to have a successful fundraiser and successful isn't just successful for us success in this fundraiser means that you will successfully get the news they want to hear\nOne eight hundred nine zero nine nine to eight seven online at W. B. U. R. dot org W mentioned decisions decisions related to the Subaru but we hope\nA possibly lost nearly a billion dollars\nA vendor David Cay Johnston of the tax reporter I used to work for the times of teen to some tax documents two thousand five showing he profited a hundred and fifty million and they're seeing what happened in the decade\nOr between that time that went made him swing from a billion dollar loss two hundred and fifty million dollars remember one of the key facts about Donald Trump\nOver the years in ways in which uh you know a a presidential nominees of both parties have done for over forty years\nUh and so the times said let's try to solve that and it was able to go back and find a number of ways in which you know what they say we're simply tax Dodgers of of questionable legality\nIncluding ... essentially a shell company called the ... county building supply maintenance which Fred Trump would buy is equipment from but allow the kids to charge them a huge markup of for the equipment\nThat the White House has dismissed this report but hasn't denied any of its claims President Trump called it a hit piece on Twitter where does this go from here well you've seen some interesting\nAction or the New York State Department at that ... of taxation has said that it's going to review a number of the allegations are and and claims made in this article one of the things that makes it so impressive as they include links to all kinds of original documentation so that readers can evaluate for themselves\nYou know the basis on which that they're making these are reporting a and\nYou know we'll see whether or not this becomes an issue as as Democrats a look to find ways to take advantage of the unpopularity of the president's taxes she you could imagine that coming back into play as well but this is a huge blockbuster of a story that takes a lot of time to absorb\nAnd to understand and I think you know one real question will be whether or not that Democrats take over the house of representatives and seek to use this as a hammer\nAgainst the president tried to force or the release of his tax documents\nDo you expect other news organizations will put this kind of energy and effort into stories like this are given the reaction that the New York times has gotten\nWell and we don't know that they're not uh you know this was something that according to the times has taken effectively at Eighteen months and that they had a well over a hundred ... a thousand pages of documents to review to make this happen several top reporters meant a lot of time on this as well as\nEditors and and other researchers and others on it it's incredible devotion of resources but yes when asked to hope that we're looking at things part of the reason that ... is doing this as as I said those documents weren't released and so it's the kind of accountability being performed it's also the kinds of ... which had been able to be done\nUh during the election season voters are interested in this stuff [noise] question is whether it's still lingers in twenty twenty a very interesting insight into our president mythology wrapped himself and from as he ran for office\nDavid Folkenflik NPR thank you you bet if you're in\nFunding for here and now comes from the listeners have W. B. U. R. Boston where the program is produced and your NPR station for math works creators of meth lab and simulate software for technical computing and model based design mass works accelerating the pace of discovery in engineering and science\nLearn more math works dot com and the exact science is offering Colo guard for average risk adults over fifty a non invasive colon cancer screening test that can be used at home my prescription only information at Colo guard test dot com\nMisused WB you are in the forecast a mix of sending clouds today ... will be in the upper sixties low seventies should be cloudy tonight with a chance of showers maybe a thunder storm blows in the mid fifties\nHardly sunny tomorrow chance of the shower early then highs in the mid sixties Saturday and mix of sun and clouds eyes will be in the upper sixties right now sixty nine degrees and Boston this is W. B. U. R.\nWe're funded by you our listeners and by the cabinet and Beverly tomorrow ten time Grammy winners and vocal hall of famers the Manhattan Transfer play standards and their new release the junction tickets at the Cabot dot org and innuendo providing shading systems for businesses and homes\nTheir design team can help you find window treatments for light heat privacy and glare issues in un donate it can in your window dot com\nAgain this is W. B. U. R. jak ... here in the studio with Deborah Becker to tell you about our fall fundraiser one hundred eighty five thousand dollars these are new number one hundred eighty five thousand dollars that we need to raise by the time we end this fundraiser tonight at seven o'clock that's a lot of money to go\nAnd we know that we have a lot of people listening so we are asking you to do your part and support the news here at W. B. you are that we know that you rely on that you count on\nAnd we're asking you to make that pledge to help keep it strong vibrant and most importantly independent here's how you do it call one eight hundred nine zero nine nine to eight seven or you can go right on line does that will be you are out of\nWork that's how I just seven hours left it out of this is the lead even seven our health effects and a half hours there as my math half hours left to go in this very important fundraiser so\nYou know look we love deadlines we really do like I Can't I Can't work without ... and I can't work without a deadline so tell me when do I need to do this by so here's the deal you need to do it ASAP so we can end this fundraiser successfully\nWe have just a few hours left if you've been listening instead of groaning when you hear us fundraising because they're taking a little bit away from the news realize how important that says because this is where the money comes from and take about two minutes to do your part\nA hundred and eighty five thousand dollars left to go sounds like a lot of money it is a lot of money but we know that we have the best listeners of any public radio station in the country and they're exactly the little league do so we know we can count on you to raise this amount by seven o'clock tonight how about a thank you gift how about it\nHow about donating Fifteen dollars a month to W. B. R. Fifteen dollars a month for the news that you listen to\nJak earlier you were saying what Netflix is what ten dollars and Ninety nine or ten dollars for movies how about Fifteen dollars a month for important independent journalism if you can do that right now will send you as our thanks a pair of tickets\nTo the shell of your choice whatever show you what and the Huntington theater companies twenty Eighteen twenty Nineteen subscription season and that's for your Fifteen dollar much donation for the news\nOne eight hundred nine zero nine nine to eight seven who's the number to call you could of course go online to W. B. U. R. dot org were really only take submitted a minute or two\nDown to one hundred eighty four thousand dollars we need to raise we're making good time we've saved in about a thousand dollars off that in the last minute or two but we need to keep up the pace because we need to in order to end this fundraiser strong tonight we need to continue with the pace of raising about a thousand dollars every single minute\nThat is a very rapid pace in a\nFundraiser that doesn't have a lot of time left so if you're listening and you hear the urgency in my voice you hear the urgency in depth voice now ... there's a reason for that and that's because we're getting we're getting real close to the end of this fundraiser don't assume\nThat someone else is going to pick up the phone and call you know we have a lot of people who have cold so far this fundraiser we want to say thank you\nBut if you haven't you if you've been waiting on the sidelines have been saying all took care of it later don't do that because now is the time to do it pick up the phone make that call to one eight hundred nine zero nine nine to eight seven or right on line that WVU our\nDaughter were I think he has set nicer than I Do that to someone else not going to call I said\nDon't let someone pay for what your getting for free [laughter] how about you make your payment right now for the public radio the journalism that you can't\nMake the pledge during this fundraiser because that's how it works if you know you get a lot of this radio station and you learn a lot about the world they knew should pledge you should pay for what you listen to\nA hundred and nine zero nine nine to eight\nSeven and really saved thousand dollars and made it sounds like a lot it is a lot but don't think well maybe somebody will give them ten thousand so I don't have to give my my pledge right now's not the\nWay awareness of how it works we are down a hundred and eighty two thousand dollars now we've made some good progress but don't let's keep up that momentum don't let it slide don't slack off now's the time to make that call to one eight hundred\nNine zero nine nine to eight seven or online at W. B. U. R. dot org final hours of the fundraiser going on right now to don't elect\nWe're funded by you our listeners and vice city say Subaru on route sixty in Belmont it's back to school time and moms taxi isn't service the newly passenger only on Dr ... percent available now\nFunding for here and now comes from the listeners of W. B. U. R. Boston and Geico celebrating over Seventy five years of providing auto insurance for drivers across America more information on auto insurance\nAvailable at Geico dot com or one eight hundred nine four seven auto\nThis year and now Stormy Daniels needs very little introduction real name is Stephanie Clifford she's a porn star who claims to have had an affair with President Trump more than ten years ago Trump denies that but did authorize a payment of a hundred and thirty thousand dollars to her to stay quiet about it just a month before the election in twenty sixteen\nTrump's former fixer Michael Cohen pleaded guilty to violating campaign finance law by making that payment\nWas Germany Daniels has a book out this week called full disclosure she joined me from Beverly Hills to talk about it it is a memoir about more than the night she says she slept with Trump\nEverybody wanted me to write a tell all you really don't want to do that because you know that doesn't define me of course everybody knows that you know about that ethic you know Ninety seconds and ah back in two thousand six with Trump and I was like I just don't want to write a tell all because it'd be a very very short book\nWho need to speak up for themselves to do so [noise] the Stormy Daniels whose book is called full disclosure is out this week thank you so much for joining us thank you and you can read an excerpt from the books if you're of age if you're in a dark [noise]\nFunding for here and now comes from the listeners of WVU are Boston and not for the creators of meth lab and semi link software for technical computing and model based design math works accelerating the pace of discovery in engineering and science learn more at math works dot com\nAnd staples with printers printer ink on toner cartridges for home in business and in store print shops were customized presentations booklets and manuals more at staples stores or staples dot com staples\nUsed WB you are in the forecast it'll be a mix of southern clouds today highs and the upper sixties low seventies cloudy tonight with the chance of showers maybe a thunderstorm lows in the mid fifties or at least want me to moral jets shower early them clearing out with ... in the mid sixties\nSixties and Sunday dry and war and we live in the low seventies right now sixty nine degrees in Boston this used WB you are where funded by you\nOur listeners and the arts Emerson with Shakespeare's measure for a measure shockingly current October twenty forced to twenty eighth only at Emerson Cutler majestic theater arts Emerson dot org\nAnd again this used W. B. U. R. jak ... here in the studio with Deborah Becker to tell you\nAbout our full fundraiser one hundred eighty two thousand dollar eighty ... eighty one thousand dollars ... ... she's got the up they write immediately that that's the kind of reporting that you get here and don't want to be you are and we hope that that's the kind of reporting that you appreciate but as I've just said\nOne hundred eighty one thousand dollars and we need to raise by the end of this fall fundraiser which is not that far away we need to raise about a thousand dollars a minute\nIn order to stay on target stay on track towards meeting are larger goal\nIn this fall fundraiser the largest fall for the largest fundraiser period that we do throughout the year so right now we're asking you to do your part make the call make the pledge to support WB you are one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot org\nAnd how would you like to thank you get five would he would write it was very nice we we are able to thanks to we have so many great unless there's some really jak with great great listeners\nAnd everybody realizes that if you pitch in and you do it during this fundraiser and helps as dodge it and take her out what we're going to do how we're going to cover the news what kind of resources we can commit to covering the news\nAnd how best to do that so so that's really why we're asking you to pledge but we can't after this thank you you have to probably say All right I get at what the gas if you can donate Fifteen dollars a month for the news right now we will send us our thanks a pair of tickets to the show of your choice in the Huntington theater companies twenty Eighteen\nTwenty Nineteen subscription season so that's just for Fifteen dollars a month show of your twice thank you to the Huntington theater and thanks to you but please do your part and make that pledge only got only got about six hours left until this fund drive ends and it's really important for us\nTo at least know what kind of resources we're going to have to to beans your news resource one\nEight hundred nine zero nine nine to eight seven or course on line to W. B. U. R. dot org down to one Seventy nine hundred Seventy nine thousand dollars we need to raise now\nBy the end of this fall fundraiser now I Want to add in addition to those Huntington theater tickets we also have a sweepstakes on the board right now to your last chance to get in on this sweepstakes today it's a brand new twenty Nineteen Subaru from city side Subaru in Belmont your choice of\nTwenty ninth team cross trick or the outback a great sweepstakes a great chance for you to win a brand new car while also doing your part here to support the news still again a hundred Seventy nine thousand dollars we need to raise in just over six hours we can get there but we can only get there with your help to make a call now\nIt's like what if they didn't say Ninety five and a half percent in Ninety five and a half percent of the money that we need to run this radio station comes from you\nFrom fun guys are just like this one we just ask you a few times a year really these fundraisers used to be\nI'm old Kathy ... at the end your lawn tech these sudden hate to use to go on and on and on but really they are much shorter now thanks to you know we really got a crab and so we know you've probably been meaning to pledge do it right now because you're making a pledge for shorter fund drive you're saying yes\nI Know you're doing it now I Know you need to know what kind of money are going to have so here's my pledge\nHere's the number eight hundred nine zero nine nine too late to heaven and remember Fifteen dollars a month to get you a pair of tickets to the shell of your choice at the Huntington theater\nAny pledged at any level gets you entered into with a brand new twenty Nineteen Subaru from city side Subaru in Belmont a hundred and Seventy nine thousand dollars now that we need to raise by seven o'clock tonight we can get there with your help\nBut that means you need to do your part and call one eight hundred nine zero nine nine two seven or fledge online at W. B. U. R. dot [noise]\nWVU are supporters of fluid William James colleges certificate it'd be the African behavioral health integration for both practitioners and administrators enrolling for December William James ... [noise]\nFunding for here and now comes from the listeners have W. B. U. R. Boston whether program is produced and your NPR station\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects for minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I hit\nNational international and local news tomorrow on MORNING edition\nWell let's take a break from the news now for another edition of the hearing now DJ sessions near\nThank you for\nJoining us today the original DJ from the here and now DJ sessions Travis Holcomb at KCRW in Santa Monica high try that hello Jeremy great to be back ... to\n... how have you been it's been so long since we've talked to you I Know I like ever since the last time we'd spoken or at least in the last time I've been to this NPR studio they've completely redone it oh wow and so that you\nAre okay but the music will still be incredible because it's coming from you this is the first one polo intend to French DJ's this is their song\n\n\n\n[noise]\nSo they're saying they're sweet them why do they see on which is following me under the ocean or tell us about this one [noise] you know this album ... bipolar on and it came out last year but then it got re released this year in the states with five additional tracks and that's when it sort of came on to my radar\nUm it's got a very tropical kind of deal that route the album\nUm and I know we're in the fall now but it's been a while since I spoke to you just want to\nCatch everybody our I'm classic ... the the sound of the summer I um it'll you still use it next time or two but when I'm screening albums to looking for stuff to play on my show if I can find\nThree or four songs on an album I'm really happy and it's a I I consider that to be a good album\nOr just care about album though has Seventeen tracks and I think I've played something like fourteen of I'm On my show already so basically like every every track on this album is great and that is like an unheard ratio for for my show to be\nEnded that many of the songs but there's so many different looks I mean they have they have like some songs inspired by Brazilians some butter some daytime disco system club ready house cut some ambient songs they kinda run the whole gamut and what would you say is the John ... overall\nI Would say sort of like tropical electronic me and I would say you know they've definitely got an ear for pop 'em but it definitely is more electronic driven and or if I were to Johnny comparisons between other bands I Would say it's sort of like disclosure meet cool side\nOh I like that that is great we have poolside on the show actually they're great um yeah let's listen to the next when you brought up this is the Swedish group by agra boys on this is called sports [noise]\n\nTell us what's going on here\nFunding for here and now comes from that weren't readers of that land and simulate somewhere accelerating the pace of engineering and science and learn more and now we're\nNot come from India and WVU aren't Boston I'm young I'm Jeremy ... and you are now\nComing up the FBI report is out and Senate leader Mitch McConnell says the vote on Brett Kavanaugh is soon\nThere'll be plenty of time for members review the briefed on the supplemental material before brought in low to\nThe vice President Pence China's trying to undermine President Trump\nRetailers are expecting strong sales this holiday season but will they find enough workers and the new world war one ... novel winter soldier\nA medical student finds himself doing heavy patient than treating a ballooning condition nervous shot\nThey began to recruit doctors were very cynical training a medical students to serve a very important role in\nA field hospitals and fun to knock the numbers coming up here in\nThe news is first\nLine from NPR News in Washington I'm Louis ... the White House says it's staying in close contact with senators who may still be on the fence that Supreme Court nominee Brett Kavanaugh NPR's Scott Horsley reports Kavanaugh faces a key procedural vote in the Senate tomorrow\nThe FBI has completed its follow up background check on driving up both White House and senators are now reviewing those findings some people who knew Kevin Oh in high school and college complain they weren't interviewed by the FBI about allegations to nominate sexually assaulted women while drunk what a spokesman Raj jobs as agents\nDid what they were asked to do what Britain\nIn high school drink that's not what the senators were question that's not where are those investigations go when I went to serious allegations and tried to corroborate them with a digging a set of interviews\nShots as if the ice agents reached out to ten people and interviewed nine of them Scott Horsley NPR News the White House\nSenate GOP leaders in the White House closely watching three moderate Republicans on to vote senators Lisa Murkowski of Alaska Susan Collins of Maine and Jeff Flake of Arizona Senator Flake is aimed at the latest FBI report does not support allegations against Kavanaugh or\nA robbery [laughter]\nHe did not say how he'd vote the alleged shooter on seven police officers in Florence South Carolina has been identified as a disabled veteran South Carolina Public Radio's had and it has more\nAccording to records from the south Carolina Supreme Court and his two thousand divorce case\nSeventy four year old Frederick Hopkins was injured in the Vietnam War and we're receiving disability payments a lawyer admitted to the south Carolina bar in Nineteen eighty he was later this board\nHawkins is accused of killing a police officer in winning six others in a standoff involving officers attempt to serve a warrant on another person at Hopkins home Hopkins was charged in two thousand fourteen with disorderly conduct\nAnd later with a fence is related to not restraining his animals of Florence county deputy reports that Hopkins was hospitalized with a head injury and is unable to speak with authorities for NPR News I'm touch Underwood in Columbia South Carolina\nThe Justice Department is charging seven Russian military intelligence officials with conspiracy she had computers and steal data\nFocused on international anti doping agency's it's already said the effort mentioned the rigid in my anti doping organizations and expose officials who we deal to Russian state sponsored athletes doping program\nScott Brady is us attorney for the western district in Pennsylvania\nThey cheated they got caught they were banned from the Olympics they were mad and they retaliated and in retaliating they broke the law they are criminals\nBegan was down ... find this is NPR\nNews this is not the point nine WB you are on Jack ... in Boston Senator Elizabeth Warren is calling the FBI investigation into Supreme Court nominee Brett Kavanaugh a complete Shan Massachusetts Democrat objects to the investigation taking less than a week to complete\nAnd the fact that senators only have one hour to review a single copy of the report\nSaid highest court is considering a request to throw out the involuntary manslaughter conviction of a plain vanilla woman who encouraged her suicidal boyfriend to kill himself in dozens of text messages twenty two year old Michele Carter's lawyers argued before the justices today that the conviction criminalizes free speech\nAnd the Carter's taxed did not cause the death of Conrad Roy and twenty fourteen time is one of four\nWere funded by you our listeners and by Beth Israel Deaconess looking for people with IDS who are interested in the mind body research study ideas study dot org\nPorter Square books October author readings includes ... report with these truths and carry mayor with the Kennedy debutante more at port a square books dot com\nAnd the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more Raymond James dot com\nAnd the forecast a mix of sending clouds today highs and the upper sixties low seventies should be cloudy tonight with a chance of showers lows will be in the mid fifties partly sunny tomorrow chance of a shower early then dry and ties in the mid sixties right now is Seventy degrees in Boston this used WVU are\nWere funded by you our listeners and buy crack a wiccan gallery featuring Julian ... newest paintings prince an animated works tend Newbury Street Boston or at ... gallery dot com\nAnd the holiday pops joined Keith Lockhart ended up pops for holiday music the traditional thing along and visit from Santa December sixth the thirty first tickets at Boston Pops dot org\nOnce again this is W. B. U. R. jak ... here in the studio with Deborah Becker to tell you about our fault fundraiser we're down to a hundred Seventy six thousand dollars\nThat we need to raise by seven o'clock tonight we've taken a good chunk of that number and the last hour or so but we do need to pick up the pace because that's still only about six hours to raise a hundred Seventy six thousand dollars now we've done stuff like this before but\nIt would be nice to or maybe not be scrambling at the last few hours or so so right now we're asking you to do your part make the pledge to support the news here at W. B. Y. that we know that you count on that we know that you rely on we're asking you to call one eight hundred nine zero nine nine to eight seven or going\nJust think of the variety of information that we're asking you to pledge for right now it's all of course all the national news particularly right now and we've got\nThis battle going on over the Supreme Court\nNomination and a potential confirmation ah there's all the local news going on and it was at the Supreme judicial court justice morning covering hearing and this is a very controversial involuntary manslaughter conviction we've got a terrific pod cast right now if you haven't had a chance to listen to last seen about the Isabel Stewart Gardner art heist it's terrific\nWe take the money that we get from me we take those resources and we put that mention new sources of information\nTo help you learn about the world what dollar value are you going to put on that\nPlease do it now so we can continue to use those resources to bring information to you so you're better informed and so you understand stories like the Isabella Stewart Gardner heist like what's happening before the Supreme judicial court\nLike the Supreme Court confirmation hearings it's all here for you what can you do right now is it five dollars is it five hundred dollars or whatever it is please do it today in these final hours of this is very important fundraising\nWho doesn't take five thousand dollar donation of doesn't have to be a ten thousand dollar donation if you can never day now stuff we would absolutely taken and that would help us along that will go a long way towards meeting our goals but we just need you know a lot of people to call in with those five dollar a month donations ten dollars a month\nFifteen dollars a month whatever you can give would ever that works for you we're down to a hundred Seventy five thousand to ... to thousands of dollars off of it in the last couple of minutes\nBut we still need to be raising about a thousand dollars a minute through the end of this pledge drive if we want to meet our goal and that's the goal that we've decided we determined that's what we need in order to\nMake sure that we can cover the mid term elections will make sure that we can cover all the ongoing Supreme Court nomination hearings\nWell a ... and all the drama around that situation there is a lot of news to cover and there's\nOnly a limited number of resources in order to do it all of this money\nGoes right back into the product that you hear that you read that you see here uh WB you are on line to W. B. U. R. dot org in the pod cast that we produce this use your money at work so if you want to protect that if you want to see WB you bought the ... the strongest possible product it can be now's the time to make that\nPledge and you know look at how much we've grown already thanks to you I mean our website is always we have we have a great digital team always bringing you\nNews stories and the original content that's that's for our website only and of course then we have visuals that go with that\nWe've been able to expand we've been able to grow because of you were asking you to keep us strong with your pledge during this fund drive also want to mention this terrific thank you gift that we have for your Fifteen dollar a month donation that's Fifteen dollars a month\nFor your public radio listening that's fifty cents a day really for your public radio do you spend more than that and coffee a day that right at lightning okay well anyway it's\nWas suggesting that this amounts to election meddling or propaganda um again this is the kind of thing that foreign governments\nDo not ... not a unusually in the United states or other other countries have done it Russia does it um I think it's a little different than what we think of is a little bit the the the more subtle\nOr election interference that for example Russia has been accused of again a Pence alluded to more covert action smoke more hidden hand actions he didn't spell out what those might be a this this whole conversation about election interference by China was part of a\nBroader indictment of what has described as China's growing power and assertiveness both economically and militarily around the world\nBut you mentioned Russia and I you know some eyebrows have been raised about the White House being so vocal about China\nWithout the kind of definitive proof of let's say hacking which several government agencies have of of what Russia did and the White House has not been in all vocal about Russia where there is that proves and some have said that this is a way to sort of\nSet up a before the midterms why if the Trump Administration doesn't do well or or you know Republicans don't do well it will be because of the Chinese\n[laughter] doing in other words what the president has accused the Democrats have doing he's sixteen election of ... I Will say that uh the the vice president did cite one instance of the hacking attack a computer attack on the Hudson Institute itself the host of his speech today after that Institute\nA are invited a speaker that China was not in favor of so there was some discussion here of cyber attacks yeah\nLook at your damage speech very briefly the vice president reached out to China do you think Beijing ... react very briefly\nI think Beijing is\nConcerned about the aggressive posture that this administration has taken towards China whether we're talking about militarily whether we're talking about the trade posture a and I I think the sort of rhetorical open hand that Pence extended\nWill be overshadowed by the much more aggressive tone of the most of the speech and he'll have caused by Scott Horsley thank you You're welcome itching\nFor here and now comes from W. B. or Boston and from Geico offering motorcycle and RV insurance more information of it\nSharon's Geico dot com or one eight hundred nine four seven auto\nAnd Sammy one line items sponsor of last seen the new true crime pod cast from WVU are and the Boston Globe investigating the largest unsolved art heist in history the theft of works from Boston Isabella Stewart Gardner museum listen on apple pod cast\nThis is W. B. you are in the forecast should be a mix of sending clouds today highs and the upper sixties low seventies cloudy tonight with a chance of showers lows in the mid fifties partly sunny tomorrow chance of an early shower and then drying up with ... in the mid sixties right now is Seventy degrees and Boston this is WVU arm\nWere funded by you our listeners and by an unlikely story bookstore and cafe in Plainfield probably recognizing debt um junior women's club advocating for family literacy with a book Dr at the Boston book festival on October thirteenth\nSeeking generally use children's books to benefit the families they serve details at DJ WC dot org\nAnd again this is W. B. U. R. jak levy ours here in the studio with Deborah Becker to tell you there's\nA hundred Seventy four thousand dollars still left in this fall fundraiser that we need to raise in order to finish this fundraiser and call it a success we're asking you to do your part and protect public radio be the public that is in our name public radio\nAnd make the call at one eight hundred nine zero nine nine to eight seven or by pledging right on line that W. B. U. R. dot org\nOne hundred and Seventy four thousand now now that sounds like a lot and it is it is a lot it absolutely is a lot and we've got until seven tonight to do it so\nWe've got five and a half hours left now that may sound like a lot of time [laughter] five and a half hours I mean even if I was writing a story right now I might say five and a half hours they really it's not a lot of time and you could suddenly let the day get away from you and you wouldn't have pledged during this fundraiser\nAnd it's incredibly important for you to pledge right now because this is where the money comes from for us to be a full service public radio station and you know that we are a full service public radio station twenty four seven you can turn us on on the air you'll get news and information that's always updated so you'll know exactly what's going on\nYou can go to our website and find out what's happening you can stream programs that you might have missed\nYou can go and listen to some of our podcasts speaking of which we just heard a\nLittle bit of an underwriting announcing about our newest podcast about the Isabella Gardner Museum art heist fabulous if I if I'm allowed to say opinions which I can do when we're on the fundraising it is a fabulous podcast is called last scene\nAnd it really is great so given to listen and you know it's just an example of the full service news operation that we are an example of what we are asking you to pledge for during this fundraiser this is where the money comes from\nAnd also in line with that there is another thread here if you can make a gift of just five dollars a month five dollars a month we'll give us our thanks a pair of passes to the Isabella Stewart\nGardening is him so now they have like\nOne eight hundred nine zero nine nine to eight seven online\nUh W. B. U. R. dot or you can also do it right from the w._b. or listen at if you're listening there there's little heart button click on it\nReally easy way to pledge I loved it they'll listen up especially because I feel like we don't talk about this enough which is on the list now and this is something that we were able to develop with your support you can go back you can pause rewind fast forward it you've essential you've got TiVo or DVR\nFor public radio I haven't heard of that anywhere else or any other radio out this is really\nReally a unique thing and we made this because we know that sometimes you hear something on the radio new to go way way way way way way I Want to hear that again you can do that right there with this ah this is you know what what we try to do here is provide the best possible service to you that we possibly can\nDeb mentioned the Isabella Stewart gardener tickets you can get just by pledging five dollars a month here to support the news that's the price of a cup of coffee one cup of coffee a month\nWe also have a sweepstakes here on a on the table just for today and that's when a brand new Subaru courtesy\nOf city side Subaru in Belmont your choice of the cross strict\nOr the twenty Nineteen outback is a sweepstakes that you could win but only by doing your part to support the news here at W. B. U. R. so don't delay on this\nMake the call now we still have a hundred Seventy four thousand dollars to go in this fundraiser and only five and a half hours to do it one eight hundred nine zero nine nine to eight seven or online at W. B. U. R. dot or\nYou know you talked about listen apps and pod cast so we've got ... shows so you can hear how the community and and really how the nation sometimes is reacting to different issues\nWe've got it all here for you and we've only been able to do this and expand and grow as a journalistic outlet because of you because a fundraiser is just like this one that just a few hours left\nAnd all we're asking you to do is take a couple of minutes right now and do your part and make that pledge for this and journalism this and all of its forms uh it's\nLearning a lot you know that you're getting new perspectives and new ideas about the world because of WB or are\nThey really make that pledge and do whatever you can is it five dollars a month and we'll send you a pair of passes through the Isabella Stewart Gardner museum is it five thousand dollars right now get your name and that drawing to win that new Subaru but also\nDo your part for your public radio listening\nTo a hundred and Seventy three thousand dollar right we need to raise by seven o'clock tonight you can help us get there by calling one eight hundred nine zero nine nine to eight seven or by going online to W. B. U. R. dot org we need to raise money about a\nPace of a thousand dollars a minute if we want to end this fundraiser strong at seven o'clock we can only get there with your help so why not make that pledge right now get\nYourself entered into when this brand new twenty Nineteen Subaru from city thought Subaru in Belmont here's the number one last time one eight hundred nine zero nine nine to a seven or online or W. B. U. R. dot org\n[noise] cheat on me to be\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nWVU our supporters include arts Emerson presenting hadn't at Shakespeare's only son takes center stage and confront what it means on what it costs to be hidden by the shadow of greatness ambition clashes with family in a Tour de force performance from a child's perspective now through October seventh\nAt the Emerson Paramount's hunter arts Emerson dot org\nAnd Cambridge trust for a hundred and twenty eight years building and protecting wealth for what really matters to their clients more at Cambridge Charles dot com private banking wealth management\nFunding for here and now comes from the listeners of WB or Boston and mass works creators of Matt lab and sent me a link software for technical computing and model based designed mouse works accelerating the pace of discovery in engineering and science learn more at math works dot com\nAnd the soldiers fighting any up in prisoner of war camp or eventually returning returning at times for the war in such numbers that they'd have to pile up on top of the trains the trend for tipped over our soldiers would be knocked off tunnels\nAnd my concern is a novelist the individual person and all of that and so what happens when one person on the corner of that photograph millions in love with a person the opposite corner that photograph and how did they find their way through those masses to each other\nThat's Daniel nice in his book is the winter soldier reviewers are throwing\nWords like glorious at um he's also a clinical assistant professor of psychiatry at death they can ever [noise] Danielle thank you so much for talking to us about this\nWith new book thank you thank you for having me on the show [noise]\nHad an excerpt at here now [noise]\nWe're funded by you our listeners invite innuendo with a hundred Douglas seasonal style event in their window fashions gallery hundred Douglas that in your window and ... and then you wouldn't do dot com\nAnd try to booksellers in cafe a Newbury Street now reopened family owned since Nineteen eighty four with a full service restaurant selection of books and gifts and nightly events\nThis used WB you are in the forecast a mix of southern clouds today will be in the upper sixties low seventies\nCloudy tonight with a chance of showers maybe a thunderstorm lows in the mid fifties partly sunny tomorrow chance of a shower early then hide in the mid sixties right now it's Seventy degrees in Boston at one forty one WVU\nOur supporters include Dana Farber Brigham and women's Cancer Center where all patients are cared for by a team nationalizing in their exact type of cancer patients can schedule next day appointment learn more at you have US DOT org\nAnd again this is W. B. U. R. jak NPR's here in the studio with Deborah Becker to remind you our fall fundraiser will end in just a little more than five hours and we do still have\nQuite a bit of ways to cover it quite a little bit of a a bit of ground that we need to seek cover and that is a hundred Seventy one thousand dollars that we need to raise\nBy seven o'clock tonight that's a good chunk of money and we can get there with your help but only if you do your part to support the news here at W. B. you are asking you\nTo pick up the phone make the call to one eight hundred nine zero nine nine to eight seven or go on line to W. B. U. R. dot org we need to raise money at a piece of about a thousand dollars a minute if we want to end this fall fundraiser successfully\nAnd I think all of us want to see a successful end of this whole fundraiser because that's how we pay for the new here's the number again one eight hundred nine zero nine nine to\nYou know this is our biggest fundraiser as the biggest ... so we're really counting on the resources we get during this fungi can play it out how we're going to cover the news for you so healthy\nIt's the middle of the day or probably listening right now you're probably doing a million other things but the take just about a minute or so right now and make that pledge so will know that we'll have a successful fundraiser if everybody just pitch is that a little this is how it works we get the money we need\nTo be your source of news information to be the comprehensive journalistic institution they ... so we're we're asking you to please do your part and make that pledge right now because this is a very important fundraiser for us\nWe've got very thank you guessed that will give you for your pledging and for five dollars a month can you do five dollars a lot of right now really five dollars a month\nFor the news and we'll send you those are thanks a pair of passes to the Isabella Stewart Gardner museum a terrific museum a real treasure in Boston and of course we've got that great pod cast a going right now the third episode just came out had that last scene pod cast about the ...\nAt the Isabella Gardner Museum it's a great pod cast in it's a great example of the kind of comprehensive news and information they get from W. B. Y. or it's a partnership with the Boston Globe and we're asking you pledge right now because\nThe resources to do that kind of work that kind of investigative work in that pod cast comes from fundraisers just like this one so please do it before the fundraiser and in just a few hours from now\nOne eight hundred nine zero nine nine to eight seven is the number to call you can go online to W. B. U. R. dot org down to a hundred and Seventy thousand dollars to raise by seven o'clock\nThat was mentioned in the last scene podcasts that's just one of many productions that we have outside of what you just hear hear on on the year we've also got W. B. U. R. dot org we also have things like common health we also have things like the artery we also have things\nUh like the endless red pom test a lot here at W. B. U. R. and remember whenever you pledge whatever you pledge today you will be entered into when a brand new Subaru from city side Subaru in Belmont but\nYou need to pledge by seven o'clock it's last day to get into that sweepstakes will give what you can down to a hundred and sixty nine thousand dollars a year to raise\nSo make your pledge now by calling one eight hundred nine zero nine nine to a seven or by going online to W. B. U. R. dot org [noise]\n\nFunding for here and now comes from the listeners of W. B. U. R. Boston and your NPR station staples with printers printer toner cartridges for home in business and in store print shops for customized presentations booklets and manuals more at staples stores orange staples dot com staples\nAnd NPR and MORNING EDITION on this station tomorrow morning what happened while you were sleeping and the news interviews and analysis for the day I had national international and local news tomorrow on MORNING edition\nThis year and now retailers prepping for the holidays got some good news this week the national Retail Federation expects holiday spending to increase by around four to five percent because of destroying the economy but there's a downside the low unemployment rate\nWill make it very hard for stores to find seasonal workers ... senior innovation reporter WB or he joins us now account hijacked and tell us more about how much people are supposed to spend this year how much they're expected to spend this year and how that lines up with pastures\nSo the projection is about seven hundred and twenty billion dollars in November and December and that excludes cars and gas and spending at restaurants are really just sort of those gifts around the holidays that would be about thirty billion dollars more than last year and just for perspective\nA spending usually does grow year over year but the average growth rate in recent years has been about three point nine percent somewhere between four and five would be above average\nAnd how does that line up with the fact that we've talked about mall vacancies being at high levels about big department stores having problems like\nMacy's writes for the trend is undeniable I'm In Cyber Monday last year was the biggest online shopping day in history and meanwhile the foot traffic in brick and mortar stores on Black Friday was down by two percent so I think the overall spending increased can help the retailers to do both and I think one really interesting experiment this year\nIs way fair the online furniture retail or they are experimenting with temporary\nBrick and mortar locations in those shopping malls but interestingly they would just be showrooms you can actually buy them there you see them in the physical space in that order on\nLives is the ... model or where you can go and try things on but you have to actually go on line to buy it um what about this idea that it's hard for these places to attract seasonal workers\nQuite so we just saw a Amazon a couple of days that it's going to increase it to minimum pay the Fifteen dollars an hour and that increasing it looks like it will be the norm this holiday season the market research firm weak field of research published a survey last week of a thousand retailers\nAnd report the average hourly wage this holiday season is going to be Fifteen dollars and forty cents and that's a big jump from an average of eleven in Seventy cents last year\nAnd the minimum wage just above seven dollars an hour a nationally what about the trade war and terrorists is that going to have an impact on how much we're spending on gifts could other retests\nHas an estimated what the overall impact will be but of course we've been hearing for months from businesses saying that the ... or the tariffs especially on Chinese imports could make their costs go up and therefore they would have to pass those along to consumers\nOne more thing or kill them big economic news today and probably driving the markets lower today is that we found that the yield on tenure treasury notes US government bonds reached its highest level since ... eleven what's going on\nHere right so it was up to about three point two percent that's the highest in ... started loving as you said this is another sign of confidence in the U.S economy hard to know exactly what goes on and investors' minds but of course they're weighing the risks versus reward and the treasury notes considered very\nSafe investment that's why the interest rate is typically lower than what you might be able to get in the riskier stock market but if that interest rate picks up a little bit maybe people don't want to take so much risk him a stock market\nAnd maybe mortgage rates and other things also start to pick up even more ... of WB or thank you so much with your\nWas we heard earlier a vice president Mike Pence took a hard line on China today including it stand on Taiwan saying well administration will continue to respect or one China policy Taiwan's embrace of democracy shows a better path for all of the Chinese people\nKind of course insists Taiwan is part of its territory and actively works too isolated diplomatically and that power struggle is playing out in an unlikely region only Seventeen countries in the world still recognized Taiwan including several in Latin America\nAs part of our continuing series on China's expanding role in the world\nNPR's Carrie Kahn reports on a small and poor region of Latin America increasingly embroiled in Asia's diplomatic tool", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Tisbury", "day": "04"}