{"month": "10", "state": "AZ", "station": "KOFA", "content": "[noise]\n\nI mean they put in my own world music our will visit several countries where Portuguese is the principal language countries such as Brazil Mozambique Cape Verde and Angola\nFun with some companies [noise]\nI'm Dan store and I'm really really Howard joined us from Portuguese around the world the next ... mile world music our\nSaturday evening at seven on voter radio Thirteen twenty a an ...\nBroadcasting from the campus of Arizona western college does its border radio Thirteen twenty A. N. K. O. F. A. M. I. N. border radio ac dot org\nThey also broadcasts in Arizona community radio network at eighty nine point five FM kj C H ... Williams Ninety One FM cage ACP press get Ninety point seven F. M. K. Jaycee kicking meant in Ninety One point three offense like staff\nThis is folk singer Michael Jonathan tune into our show this week on this\nRadio station with country music ... claims songwriter Aaron Andrew and the sound of Kentucky with the job or not and drug\nBan for him to take a long time\nAnd make you feel just five\nVotes artists music in the conversation on this week's broadcast\n\nAnything at seven I'm born and radio funny\nIn England sunny skies and the highest sixty four today northeast when what you wanted to twenty five miles per hour tonight mostly clear those around forty four Prescott sunny hides near fifty four today scattered showers tonight at a lower thirty eight\nIn Flagstaff mostly sunny on your forty two today snow showers likely low around thirty one Yuma sunny I near Seventy eight today tonight\nClear those around fifty nine degree\n\nWith national eight of News I'm or he was in for Antonio been solace Massachusetts Senator Elizabeth Warren released the results of a DNA test that suggests some native heritage as far as tend generations back\nIn an edited campaign video released Monday Warren is seen consulting with Stanford genetics professor Carlos Bustamante who was also an advisor or with a commercial DNA companies twenty three and me and ancestry dot com [noise]\nThe ... references Warren's ongoing debate with President Donald Trump who frequently derived earlier claim of native heritage\nAnd the soccer genome we did five five segments of Native American ancestry with very high confidence that we believe the error rate is less than one of the south\nNow president like to call my mom a liar\nWhat are the facts are facts such as that we have a Native American ancestry and you're better\nTrump has frequently referred to Warren ... as Pocahontas the dispute stems from Warren formerly notifying to universities after she was hired in the Nineteen eighties that she had native heritage\nThe video includes statements from people who had a role in her hiring same Warren's heritage was not a factor moron reiterate she is not an enrolled member of any tribe\nThe video includes excerpts of Trump at one of his rallies suggesting he'd pay a million dollars to a charity if a DNA test showed Warren is native warrant issued a tweet saying the president can send the check to the national indigenous women's resource center Trump has since backed off of that claim\nThe Nineteen eighties that she had native heritage\nThe video includes statements from people who had a role in her hiring same Warren's heritage was not a factor moron reiterate she is not an enrolled member of any tribe\nThe video includes excerpts of Trump at one of his rallies suggesting he'd pay a million dollars to a charity if a DNA test showed more in his native warrant issued a tweet saying the president can send the check through the national indigenous women's resource center Trump has since backed off of that claim\nThe national Indian Education Association concluded its annual convention over the weekend choosing a new president and three new board members Robin Butterfield a citizen of the Winnebago tribe of Nebraska will take over as president Butterfield also from the wider ban of Chippewa succeeds Jolene Bowman\nThe nonprofit ... tax credits to fund rural community projects in low income areas around the Rocky Mountain region and now they're helping to open a twenty four hour childcare center and expanded health clinic for the northern around ... tribe Wyoming Public Radio's ... Edwards reports\nWhen the northern a rabbi who tried conducted a survey of casino workers they found in serious need for affordable child care that's according to the northern rap whoa tribal housing authority director Patrick goggles\nAs I came back that there was a priority of any of the trouble employees because they want us to continue to work some go to work because there was a chocolate syrup veils off\nSo now the tribe is building a Thirteen thousand square foot childcare center next door to the tribes casino it can hold up to three hundred children from infants to school age and will be available to travel families twenty four hours a day ... says around the clock care is a need for a couple of reasons\n... aspect is to help social services place or children that are in need of shelter for a short period of time\nThey're also graveyard shifts to Christian or working mothers of working ... taped that type of a secure a frontal a service that they know the people that work or\nThe new center will cost about four and a half million dollars and should be up and running within a year or remodeled and expanded health clinic will also be completed soon it will offer integrated services with a fulltime dentist optometrist and a pediatrician\nThat's important since infant mortality on Wind River reservation is more than twice the rate of non natives in Wyoming\nModify president David Glazer says the clinic will also expanded hours in the evenings and weekends\nThis is a really big deal to keep people from traveling long distances particularly in the winter to get basic healthcare\nThe clinical also hire a fulltime therapist to help with drug and alcohol addiction and historical trauma issues for national need news and now that he had words in Laramie and dime argues\n[noise]\nThat later and Bruce national native voice goes by one of the ... river is funding is by law group provider\nOf Indian Love Lucy and by the corporation for public broadcasting with support from the public radio satellite system\nSupport by the law Salafi chambers sexy Miller amongst the national trouble rights law for offices in Washington DC New Mexico California and Alaska and online at WWW dot ... dot com support\nBy being a separate away an American Indian science and engineering society top fifty employees being a ... basis scholarships supports Native American students in science technology engineering and math info at B. NSF dot com\nAnd what the ... from the public radio satellites that do\nNot support by the law and her son off each he respects emailer among them the national trouble rights law for the opposition to Washington DC New Mexico California and Alaska and online at W. W. W. dot ... dot com support\nBy being a separate way an American Indian science and engineering society cop skip the import and being a saps basis scholarship to support Native American students in science technology engineering at the map in both at B. S. dot com\nNative voice on the Native American radio network\n[noise]\nGauge oriental guy\nOr ... or it'll shut down\nYoung all your overall measure gave me but I don't know how\nAgainst those during the\nDidn't show it'll turn out\nAnd bring\nIt to another guy\nI mean it showed a\nI sure do you just got\nOf each other and go\n\nNow it's even clear and the pushback we take it down which is um where they take the runaway turned the killers and there's also no pressure there and the cook you know see what it did they're\nPretty clever but I'm no pressure when the cooks it's from the region album let's go sunshine which had the ... chicken bone and I really like that when you know I don't really speaks to me but for all I really liked that song and um and they give it more of a listen so I had to do that later as always but um\nWe're actually going to go into a minute break again but don't worry since we are going to have one friend the ...\nAnd also like check waiting for you when we come back\nBorder radio was supported by Dr Cheryl how go and the team at desert veterinary clinic who were dedicated to helping pets live long healthy and happy lives through regular visits and preventative care desert veterinary clinic nine nine ... and by phone at Seventy three vibes zero one zero\nYou're getting your boat or radio thirty twenty am on the radio FX Donald will be up and started and select gave us they as your favorite station\nIn Prescott sunny today I near fifty four east north east wind eight to sixty miles per hour tomorrow scattered showers are near fifty degree black that mostly sunny today I just forty two\nTomorrow snow showers likely you know I Am forty England sunny today I near sixty four tomorrow chance of showers in a high near sixty four and you must sunny in a high near Seventy eight today\nAnd tomorrow sunny skies with a high near Seventy eight degrees\n\nNavy and\nHe\nMe\nNo\nNo no no no and\n\n[noise] ...\n... ...\n\n[noise]\n[noise]\n[noise] ... ah the grill and ... yoga you're late by the book I Do I Do and I know ... we went out and buy\nFood and drug league or you've been the gear\nOr where do you know we\n\nAll know what do you do during the game I go\nTo a ...\nA lot of man that gun I read the ball to know that do you wear now\nA need to and I don't know it's not\nBe you\nKnow the the ...\nI think the main character\nIn Long Beach but\nWe all know what to do that in order to be\nA gap there\nSo yeah see yeah well you ...\nGet low\nEnd we\nWe don't know very good da da da\nDa da da\nDa da da da\nDa\nDa\nDa\n\n\n\n\nAnd do that\nKnow we don't\nTurned down a\n\n\n\nThen when I'm\nAnd\nAnd and\nActor and [noise] and\n\nAnd\nAnd and you\nThen\nAnd on\nAnd and\n\n\nA\nA\n\n\n\nUh\n[noise]\n\n[noise] Mm\n\n\nAnd\nAnd\n\n... ... ...\n... ... ... ...\nMake me\nReason of children lying then\nGovernment's done\nEating Hugo but what's wrong\nMight have a real\nShe may be joined by paying the\nAnd\nMight have been\nThe making of the children by the\n...\nWith the good stuff\nNa na\nBut I think he's going to be remembered for being somebody who really wants to be wonderful music to the American population at the same time it's kind of a hero the trauma and racial integration that and I can carry [noise]\nI'd Gary walk and welcome to many good why and how [noise]\nI think he's going to be remembered for beer somebody who really fought so wonderful music to the American population at the same time it's kind of a hero of fomenting racial integration that a lot in her [noise]\nI'm Gary Walker and welcome to many good why on Sunday Morning at hand on board or radio ... am Thirteen twenty [noise]\nThanks for listening to us pay human and Thirteen twenty am I'm bored or radio ... or your service of Arizona western college\nWe also broadcast on the Arizona community radio network at eighty nine point five FM cage Jay Z a drink Williams Ninety One that same cage Jay Z Prescott Ninety points ... kj easy take Kingman and Ninety One point three FM black stuff\nA brochure first produced by the Arizona highly department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K. A. W. sea and retired airs on highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty seven and St Paul's cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nMostly clear and you it's an idle around fifty nine tomorrow sunny skies with a high and you're Seventy eight someone got up to thirty miles per hour in Kingman mostly clearly around forty four windy tonight guts up to thirty one miles per hour twenty percent chance of showers throughout the day tomorrow with partly sunny skies and hide your sixty four\nPrescott scattered showers partly cloudy skies lower on thirty eight tonight tomorrow scattered showers as well mostly Claudia Hi and you're fifty one to three inches of snow possible in Flagstaff mostly cloudy all around thirty one tomorrow rain and snow shower throughout the day mostly cloudy hind you're forty\nOh this is the b._b._c. news is you know McDonalds\nPresident Trump says he's we're reports that the authorities in Saudi Arabia are preparing to admit the Saturday journalist your mouth ... G died during an interrogation went wrong in Turkey\nWhich took a short G A strong critic of his country's powerful crown prince Mohammed bin Salman mom haven't been seen since entering this side of the conflict in Istanbul two weeks ago Turkish officials insist he was murdered\nReports both from the U.S media under British media now suggesting that the Saudis are preparing to admit that he died during\nInterrogation the hops are yes and interrogation that went wrong and warmth adjusting to the original attention might have been to a ducks him now President Trump has said that he is aware of these reports old vote pointing out that a nobody as he puts it knows if it's an official\nReports but set play the president watching the situation closely having earlier said that it was a possibility that rogue killers were responsible\n[noise] and I was ... on Monday Turkish police investigators sets the consulate for evidence the U.S secretary of state Mike Pompeo is on a fact finding mission to Saudi Arabia [noise]\nIn a major split in Christianity the Russian Orthodox church says it's breaking off all relations with the Constantinople patriarchy ate the body that wields a pharmacy over the world orthodox Christians\nIt's in protest against the patriarchs decision to recognize the Ukrainian Orthodox church as independent from law school ...\nAnd I was ... who's on Monday Turkish police investigators searched the consulate for evidence the U.S secretary of state Mike Pompeo is on a fact finding mission to side of the ...\nIn a major split in Christianity the Russian Orthodox church says it's breaking off all relations with the Constantinople patriarchy ate the body that wields authority over the world orthodox Christians\nIn protest against the patriarchs decision to recognize the Ukrainian Orthodox church as independent from law school ... reports\nThe Ukraine this is all about shaking off another tool of Russian influence\nPresident ... cool did we gaining kids countries spiritual freedom mock got August it comes down to my ... had no authority for the move though so it's about six relations\nHave religious tempting thing called the great to split since the ... little skit them with ... in ten fifty four and practical ten the consent now is that what happens to church property across Ukraine\nAnd the potential for ... do you like any dispute as a controlled\nThe co founder of Microsoft's software giant Poland has died of cancer that this woman Seattle He was sixty five and it'd be ... suffering from non Hodgkin's lymphoma since two thousand nine from San Francisco daily reports\nIt was Paul Allen who convinced Bill Gates to drop out of Harvard to start working full time a Microsoft\nThe company that brought the personal computing to the masses the pad being close childhood friends experimenting with computer code at school in ... with what ever hardware they could get their hands on\nLike Mr Gates missed the ... became unnoticed philanthropist he gave away more than two billion dollars ...\nYou're listening to the world news from the BBC\nFor K. A. W. see news in ... I'm ... and it's not as active here in California but Arizona is part of earthquake country with over one hundred seismic events annually on average\nThis week the state wants to help prepare Arizona's for the next round trigger capable you she's Lou gum report Sigrid\nArizona shakeout is an opportunity to practice for a big or high magnitude earthquake at ten Eighteen this Thursday morning residents across the state or encouraged to drop cover and hold on for about a minute\nThere are faults in Arizona capable of delivering a six to seven point for ... magnitude quake the lake Mary fault running under Flagstaff in northern Arizona is one another is fifty miles from downtown Yuma Michael Conway senior research scientist at the Arizona Geological Survey he tells capital media services the imperial fault\nIs an offshoot of the San Andreas fault and has the potential to shape the region\nAnd that's all it will go a rupture seven to seven or eight three there\nMore than Seventy five thousand Arizona's are expected to participate in the great Arizona shake out this year last year more than fifty thousand K. through twelve students participated and about two thirds of them were here in ... county\nYou mean union high school district says this year all campuses are registered to take part you can find more information at shakeout dot org ... UC News I'm Luke gum\nPresident Trump is scheduled to be an Arizona near the end of the week for a friday night rally in Mesa it's part of a three state western swing your Arizona Nevada and Montana the rally in Mesa is set for seven o'clock friday evening\nInternational air response located near the Phoenix makes a gateway airport for K. A. W. see news in Yuma I'm Kim\nMore information at sheik out dot org ... double duty News I'm Luke gum\nPresident Trump is scheduled to be an Arizona near the end of the week for a friday night rally in Mesa it's part of a three state western swing your Arizona Nevada and Montana\nThe rally in may ... is seven or seven o'clock on friday evening at international air response located near the Phoenix makes a gateway airport\nFor K. A. W. see news in Yuma\nI'm Jim ...\nMom we you know\nComma oh let's go who\nWon that you want to know\nCan I\n\nThey should [noise]\nBad day [laughter]\nNo\nNa\n\nNa na na\n\nDa\nYou treat me not\nChi Minh\nShould we\nYeah everybody's\n\nThird call [noise]\nWill\nYou were in your life\nTransistors\nOur favorite word\nMay\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise] [noise]\n[noise] how\nThe man\nSay the things\nThat\n\n\nYou can read about\nWay you\nBeen\n\n...\nReally make any\nMan I mean God\nL as America's open road this is a recent one from cicada rhythm and before that was one from ... eh let's call tell me why is there are all there is from Los ... with little really G and of course they started off with an Elton John cover a tiny dancer done by Lawrence in the machine which of course is another reason one as well so\nI'm actually going to go straight into a ... minute break because I'm really excited when the next a son that's in our little that will come back you know but I'm going to be a singer who I Love a lot of her songs are really excited for that but we're still going to hear recent one from Brent than in so don't go anywhere\nToday's border radio day sponsors or Dr Cheryl how going all the doctors of desert veterinary clinic in recognition of veterinary technicians week a heartfelt thanks to the sometimes under appreciated veterinarian nurses who are often scratch bitten and soil by patients yet still come to work or aliens daily\nYou are the rock stars and we thank you\nYou were tuned into border radio Thirteen twenty am ... bay and border radio easy ... or we also broke us on the Arizona community radio network\nIn Yuma sunny high near Seventy eight north when twenty to twenty five miles per hour today like clear those around fifty nine England sunny I near sixty four today tonight mostly clear\nThose around forty four in Prescott on these guys in a high a fifty four today scattered showers tonight low around thirty eight in Flagstaff\nMostly sunny ... near forty two today and tonight no showers likely low around thirty one degree\nYou know Sonny high near Seventy eight north when twenty to twenty five miles per hour day like clear those around fifty nine England sunny I near sixty four today and I mostly clear those around forty four in Prescott sunny skies in Ohio fifty four today scattered showers tonight low around thirty eight in Flagstaff\nMostly sunny on your forty two today and tonight no showers likely low around thirty one degree\n\n\nA change\nCan\n\nShe didn't\nShe came\n... song bad boy before that with me the streets in single called dot contagion I'll eat cooked angel fire and we started off with the recent one friend Brent standing called here looking at you kid like I mentioned before I'm an artist here plenty of her songs and since she's the only female hearing this that it was highly cook\nNow I found out about how they cook on with ... I was hosting about I don't know a few months back\nAnd um it was from her album vessels love and I still love that album to this day is a really great all album excuse me they can check it out when you can but um time for another one every minute breaks but bear with me and when we come back we're going to hear one from Johnny Preston\nWere radio was supported by prison he'll Brewing Company a locally owned a restaurant and craft brewery on main street and you must historic downtown\nHumans in disasters alike are invited to remain themselves to join the prison held population for a memorable lunch or dinner stand featuring a wide range of menu options and craft beers more about prison he'll Brewing Company on Facebook\nWhen you can't get bored or radio Thirteen twenty am in the ... on your radio catches on line that border radio ac dot org or you can use a tune in and just search ... a\nI'm an ex Celtic Connections much reveal recording made over the last century what to do with low Mike Peters Kennedy and Chicago police chief Francis only\nA lower going oh my I'm a red eye view being my\nThis is Brian those will grow inviting you to join me for harvesting the pure\nWhen the evening at seven I'm bored or radio Thirteen twenty and [noise]\nWell Rocco by the train\n\nKnow\nWhen the when we all\nKnow Jack Jack\nWhen the evening at seven on board or radio they keep the money and [noise]\nWell Rocco by the train a la\nLa la la la la la\nDa da da\n\nDa da\nDa da da da da\nAnd the great love love\nWill Rob you can begin to treat a light the\nAnd lo o lo right or wrong or right on the line I train um\nWhen the wind blow out you\nGo rock and then the great love love\nWell Rob goodbye to ban the treat a or\nWhen they blow up\nBut I mean\nWhen the wind blow a\n\nChild in the great love love\nWell Rocco by the end the train a land\nOh\nWhat a lot\nMean when I\nWhen the wind blow a\nNo\n\nMe me me\nAnd\nI mean you\nCan you tell me\nA little bit golf\nKnow\nNo\nMm Mm Mm Mm Mm\nMm Mm Mm Mm\n[noise]\nHi this is a search on his shouldn't go with the president now we're likely vouchers are joined the every week for the best in the exciting music off Brazil every week right here\nSaturday Night at a I'm born and radio and border radio easy that way\nYeah the president an hour with music and interviews every week for right here I'll see [noise]\nBroadcasting from the campus of Arizona western college this is border radio Thirteen twenty am K O F ... humor and border radio easy dot org we also broadcast on the Arizona community radio network\nEighty nine point five FM McKay Jay Z a Drake Williams Ninety point one FM cages eat the Prescott Ninety point seven F. M. K. J. C. K. Kingman and Ninety One point three FM Flagstaff\nMartin little one of the hosts for new program called crossing borders on voter\nRadio Thirteen Tunisia Yemen Yuma joined us every afternoon from three to seven for mix of music from around the world right here in Arizona we can be heard on the Arizona community radio network and you can stream a decade WC done or the radio or the tuning out just search for K O\nIn Yuma sunny eyes near Seventy eight north northeast when ten to Fifteen miles per hour today mostly clear tonight lows around fifty nine king that has a chance of showers in the hive sixty five today partly cloudy tonight lows around forty six\nThree to seven for mix of music from around the world right here in Arizona we can be heard on the Arizona community radio network and you can stream of W ... feet on the radio or the ... just search for Kate\nIn Yuma sunny eyes near Seventy eight north northeast when ten to Fifteen miles per hour today\nMostly clear tonight lows around fifty nine England has a chance of showers and the highest sixty five today partly cloudy tonight lows around forty six Prescott a chance of showers near forty seven\nAnd tonight a chance of showers and a low around thirty seven in Flagstaff there is a winter weather advisory in till noon today snow showers likely in a high of thirty seven degrees\nBBC News ... President Trump's defense the Sunday ... says to them that it's full investigation\nIs underway over the disappearance of the Saudi journalist Jim ... G A vocal critic it's the wrong family but your chunks of the prince Mohammed bin Salman denied any knowledge of what happened in the ... tacky two weeks ago\nBut speaking to reporters in Washington the leading Republican Senator Lindsey Graham condemned Mohammed bin Salman here\nI think it was a role\nFor a very brave women\nI just don't horse\nLeft somebody shovel some\n\nThe U.S military has given detailed supported sense has been its biggest air strike in nearly two years on Islamist militants in Somalia the Pentagon an estimated that six to ... to ... I think kids during the attack will run through\nThe U.S military is claiming to have had significant success against al Shabaab that would represent a major setback for the al ... group\nIt is hard to independently verify the impact of these strikes which have become more frequent tons of Donald Trump's presidency that controversial as previous attacks from being followed by accusations that civilians were also killed or injured\nThis latest strike was not in southern Somalia like most of being bit further up the coast knew how to de which used to be a piracy how\nArmenians prime minister Nicola ... who came to power in what he called the velvet revolution earlier this year as ... as a nation and a televised address ... has more\nThese has been a much anticipated move in order to give me ... legitimacy of the nation wide mass protests Bruce came to power in may ... is counting on parliament not to propose an alternative candidate is found them and feels twice through elected replacement snap elections will be held\nThe car and parliament is dominated by Mr washing hands opponents and there was a risk they might put forward another candidate for prime minister\nBut ... enjoys popular support and he's hoping to return to power with a stronger mandate\nHundreds of police have been deployed outside the Hindu temple in southern India where protested that threatened to stop women entering\nIt follows the Supreme Court decision last month overturning a centuries old ban and women of minutes to an age and ... the bottom of the shrine in the state of ... one of the Hindu Tony insights world news from the ...\n... is dominated by Mr washing hands opponent and there was a risk they might move forward and now the candidates for prime minister but ... induced popular support and he's hoping to tend to follow up with a stronger mandate\nHundreds of police have been deployed outside the Hindu temple in southern India where protested the threatened to stop women entering it follows the Supreme Court decision last month overturning a centuries old ban and women of minutes to an age and she eats about him on a shrine in the state to Pamela when the Hindu honey in science\nWorld news from the BBC\nFor K. A. W. see news Uma ...\nArizona Senate candidates Kirsten Sinema and Martha ... last night and the only debate before the November six the general election disagreeing on virtually every issue including health care immigration and President Trump and the debate ended with a back and forth flurry between the candidates\nHoping to remind voters of democratic opponent cinemas history Republican Mick ... said that she was guilty of trees\nCapital of media services reports mix Sally brought up a radio interview sentiments from two thousand three asking the interviewer was okay to fight for the Taliban cinema said quote fine I don't care if you want to go do that unquote\nThe debate on K. A. E. T. T. V. was ending but moderator Ted Simon set cinema deserved a chance to answer that chart\nChair when I got a toddler we have to like right now whether we're going to apologize to the veterans me for saying we are running out of time so we got to get a response we respond because she was at that Apollo ways\nHow might that has chosen to run a campaign like the one you're so right now we're seeing ... ridiculous attacks and clearing my campaign\nMuch of ... campaign against Sinema has been focused on who she was more than a decade ago including their opposition to war in the middle east\nAnd Sally hopes to convince voters that sentiment is not the moderate that she has seemed to be since being elected to Congress in two thousand twelve\nCinema mean time accused mix Sally of being an apologist for anything but the geo pie and especially Donald Trump wants and like Sally was defensive about questions about her views on the president\nAnd her open support of them recently compared to her refusal to endorse him two years ago\nFor K. A. W. see news in Yuma I'm Kim transcend\nUsed to say [noise]\nWhile I see that kind\nSaw wheelchair that can play it was the\nBig bang doing wrong ... ... ... miles you know the ... and and the\nCar going strong and do\nYou have to say\n\nThanks for joining us on crossing borders am Thirteen twenty Kenya what you just heard back in the day a brand new song by the English pop rock singer and musician Ray Davies\nMom I'm hanging on the boat John\n\n\n\nThe bar cancel it\n\n\nNo no you\n\n\n\n\nA\n\n\nA\nKnow\nA\nLeash or are we uh we have a way I feel a\nIs crossing borders am Thirteen twenty Kayla pay you just heard be strong when the actress and singer painter Castro this was from the movie soundtrack for bleeping killer released just last year\nWe saw that are still just a few minutes ago with I guess that's why they call it the blues and Elton John covered by the Canadian indie pop singer and songwriter at least your car\nAnd just after that you were paid by the mile but the alternative country singer Sam Morrow and this from his latest album concrete and mud released earlier this year and following that you heard\nKayla pay you just heard be strong by the actress and singer Taylor Castro this was from the movie soundtrack for bleeping killer released just last year\nWe saw that are set off just a few minutes ago with I guess that's why they call it the blues and Elton John covered by the Canadian indie pop singer and songwriter Elise your car up\nAnd just after that you heard paid by the mile but at the alternative country singer Sam Morrow and it's from his latest album concrete and mud released earlier this year\nAnd following that you heard Arkansas it's a brand new song by the blues rock guitarist and singer John ... don't go anywhere we'll be taking a quick one minute break and come right back to the music starting off with the band the black keys\nBorder radio was supported by Arizona western college now offering extended hours as part of their ongoing commitment to putting students first and improving the college experience for our community\nStudent facing services on the campus are now open from seven AM to seven pm Monday through Thursday learn more at ease the western dot edu\nBroadcasting from the campus of Arizona western college for more than forty five years this is Thirteen twenty am border radio in forty radio easy dot org\nIn Kingman a chance of showers and the highest sixty five today northeast when sixteen to Eighteen miles per hour tonight partly cloudy those around forty six Prescott a chance of showers in a high up forty seven today and a chance of showers in the lower thirty seven tonight\nBlack staff winter weather advisory if in effect until noon snow showers likely highs around thirty seven in Yuma mostly sunny ... near Seventy eight today and tonight mostly clear low around fifty nine\n[noise] all\n\n\n\n\nI Love actually turned out she stopped even\nOne name among all the work [noise]\n\nLooking back to crossing borders and Thirteen twenty ... that was work out a brand new single by the artist chance the rapper\nWe certainly are set off just a little while ago with the song Howland for you but the indie rock band the black keys and it's from the album brothers released in twenty love and after that we heard the beep soulful sound of the recognizable senior Amy Winehouse where there is no greater love\nAnd following that you've heard monkey by by the rocket believe singer and songwriter al ... who unfortunately has no relation to Jimmy hendrix\nDon't go anywhere because we'll be taking it we wouldn't really break and come right back to the music starting off with the guitarist alley or go to ray\nBorder radio is supported by visit him a present in Rio de surveys the Bruce past October twenty seven from five to nine at desert sun stadium a limited\nWe heard the beep soulful sound of the recognizable senior Amy Winehouse where there is no greater love and following that you heard monkey by by the rocket believe singer and songwriter al ... who unfortunately has no relation to Jimmy hendrix\nDon't go anywhere because we'll be taking a quick one minute break and come right back to the music starting off with the guitarist alley or go to ray\nBorder radio is supported by visit him a present in Rio de surveys of Bruce past October twenty seven from five to nine at desert sun stadium a limited number of VIP tickets are available that includes early entry WIP area as souvenir mug and opportunity to meet him sees big dean Baba and more\nMore information and tickets available at Rio de ...\nIs is Thirteen twenty and border radio kill Afghan border radio easy dot org service of Arizona west in college for more than forty five years\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and repaired publications in the world joined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org dissident made possible in part by a grant from Arizona humanities [noise]\n\nWell [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n...\n[laughter]\n[noise] I don't know [noise]\nMy\n\nMen's on record as\n\nAnd\nThe time and then going\nAnd\nThey need to\nAnd\nI I Am a name I'm let's say\nWe are the host of a new program on border radio Thirteen to ... or if they get enough of it a very keen on Saturday morning at\nTen so we can tell you what it's like to live in the community combined with a little bit of it will shape the way music too that if they needed up it's a very thin Saturday morning radio thirty twenty eight\nYear or two to carry us pay you more voter radio Thirteen to ... am and border radio AC died or were you also broadcast on the Islamic community radio network that eighty nine point by Afghan Jay Jay Z a great Williams\nOf it a fairly ... on Saturday morning at ten so we can tell you what is like to live in a community combined with a little bit of I Will share some great music here that if it if it's a very thin Saturday morning said ten voter radio Thirteen twenty I Am [noise]\nYou're too to kill us base humor border radio Thirteen twenty am and border radio ... or\nWe also broadcast on the other was on a community radio network at eighty nine point five FM cage Jay Z a drink Williams Ninety point one F. M. K. Jay Z peep Prescott Ninety points are being asked them gay Jay Z gate Kingman and Ninety One point three FM black stuff\nOn the next Celtic Connections field recording lead over the past century collectors like Alan Lomax generally and Chicago police chief friends it's only a log on to my family who ran on you be my\nThis is Brian also grow inviting you to join me for harvesting the field I'm In the connection [noise]\nWhen the evening at seven on board or radio Thirteen twenty and [noise]\nIn Prescott a chance of showers in a high a forty seven today east north east when nine eleven miles per hour\nTomorrow chance of showers in a high a fifty eight Flagstaff a winter weather advisory until noon today snow showers likely ... near thirty seven tomorrow chance of showers in Ohio\nForty six in Kingman a chance of showers in a high of sixty five today tomorrow mostly sunny skies near sixty eight Yuma sunny eyes near Seventy eight today tomorrow I near eighty one\nABC News with sue Montgomery President Trump has something to defend Saudi Arabia from what he said was a campaign to condemn it over the disappearance of the Saudi\nJournalist Jim ... the ... were known to show them Jane disappeared two weeks ago after entering this on the continent in Istanbul, Turkey believe he was murdered for the ...\nThe U.S secretary of state Mike Pompeo after talks and beyond with crown prince Mohammed bin Salman is that the scientists wanted to establish the sign from Washington Bob ...\nPresident Trump tweeted that he'd spoken to Mohammed been summoned by telephone during Mr pump AAAS meeting with the crown prince whats your Trump said the prince totally denied any knowledge of what took place in the Saudis Turkish costs you that\nBut senators on both sides of the aisle are deeply skeptical not only about the crown princes denials but also about Mr Trump's earlier suggestion that road ... may have been involved\nLindsey Graham a Republican senator who's close to the president called Mohammed bin Salman a rogue prince accused him of ordering the church of Jesus murder and described him as a wrecking ball\nThe U.S military is giving details of what was it sentenced in its biggest and strike in nearly two years on Islamic militants in Somalia the Pentagon that to me to the sixties you Hondas belonging to al Shabaab have been killed during the attack in central Somalia\nArmenians prime minister Nicole pushing young who came to power and what he called the velvet revolution Anya that's here has announced his resignation in a televised address ... have more\nHas been a much anticipated move in order to give me ...\nOf the nation wide mass protests rule came to power in may ... is counting on parliament not to propose an alternative candidate the car and parliament is dominated by Mr washing hands opponents but ... enjoys popular support and he's hoping to return to power\nPrime minister Nick ... who came to power in what he called the ... revolution idea this year has announced his resignation in a televised address mayhem Dimitri ... more\nThese has been a much anticipated move in order to give me ...\nOf the nation wide mass protests Bruce came to power in may ... he's counting on parliament not to propose an alternative candidate the car and parliament is dominated by Mr brushing your opponent but ... enjoys popular support\nAnd he's hoping to return to power with a stronger mandate\nPresident Trump is marked the adult film actress Stormy Daniels up to John's dismiss type defamation lawsuit against him to the phones to men and we've gotten teeth freedom of speech from New York ... prime\nDonald Trump labeled her whole space so Twitter an added she was a total calm ladies and gentlemen my present your president responded Mitch Daniels she'll say we choose to of incompetence hatred of women and lack of self control them towards\nThe lawyer Michael Lebanon and see who the president described as a race also chimed in he described Mr Trump has a disgusting ms such an it's\nAn embarrassment to the United states this twitch Iraq potentially has a political dimension not least because female voters will be crucial and determine the outcome of next month's congressional elections\nWow news from the BBC [noise]\n\n\nThanks for joining us on crossing borders am Thirteen twenty J what pay my name is Martin and I'll be our host for this hour you just heard better to my baby but at the country musician and senior Wendy rose business from her latest album rules sixty T. released just last year\nWe hope you stick around with this because we have some work great music coming your way on this Tuesday Afternoon featuring artists such as the Austin called Ben Taylor child there's lots got the ... and many more ... first up next we have a great new single for you by Amish and understand\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nNot a\nFrom ...\nAnd\n\n\n[noise]\nThis is crossing borders am Thirteen twenty K on what may you just heard loving done to the last ...\nWhen the Latin rock band from LA last Lobos featuring Mexican rock band got bit ... by\nWe saw that are set off just a little while ago with no good a brand new single by the Australian blues rock guitarist and senior Amish understand\nAnd just following that you heard the instrumental version of let's get that on by Marvin Gaye as interpreted by the jet ski board is Jason miles don't go anywhere we'll be taking a quick one minute break and come right back to the music starting off with the below know Lonnie and Serino\nArizona was in college will be hosting a CPR proceed certification class with instructor Joanna ... it'll be the Saturday October Twenty years from now me up to one PM that'd be either we use the gym which is located on the east side of the human camp is\nIf you'd like more information you can give us a call at night to wait three or four seven six nine zero\nVicious thirty twenty am border radio hey your way and border radio eighty dollars a service Arizona western college for more than forty five years\nIn Yuma sunny eyes near Seventy eight north northeast when ten to Fifteen miles per hour today\nMostly clear tonight lows around fifty nine the man had the chance of showers and the highest sixty five today partly cloudy tonight lows around forty six press get a chance of showers I near forty seven and tonight a chance of showers in a low around thirty seven\nIn Flagstaff there is a winter weather advisory in till noon today snow showers likely and the highest thirty seven degree\n[noise]\nNear Seventy eight north northeast when ten to Fifteen miles per hour today\nMostly clear tonight lows around fifty nine the man had the chance of showers and sixty five today partly cloudy tonight lows around forty six press get a chance of showers near forty seven\nAnd tonight the chance of showers and a low around thirty seven in Flagstaff there is a winter weather advisory in till noon today snow showers likely and the highest thirty seven degree\n... ... a\nAnd this was\nWould call ... pay\nBusiness and found\nNo well I don't\nWhy didn't they didn't know what people around me never\nBook that brief\nCan't get no\nA year and a nice way\nTo beat the tiny pain in the brain\nWant money hungry\nWould there be no way to be you know it's like no one theory it's more gas can get no young\nThan three years\nWould be no way to you know one theory it's more gas can get no young\nAs\nI mean\n\nThink\nA bar on a charge a dollar a barrel\nOn them are men and women\nMy thoughts are gone\nBreathing room were ...\nAbout my darling girl you know\n... you are in turn\nIn Iraq now a vote because she doesn't believe in learners\n\nTalk about the back and do\nBecause by the law but check me over to\n... and then we were\nOr from\nThe Army Corps but we were just\nHow can we get along and\nAnd I uh\nAnd I\n", "show_name": "Crossing Borders", "year": "2018", "city": "Yuma", "day": "16"}