{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n\n[noise]\n\nFourth and final moving from Beethoven's third symphony the aerobic symphony Andy flats Ricardo shy conducting the life ... orchestra\n[noise]\nIt's called drive time on in P. B. think radio your financial support helps keep the programs on the air and\nGet help support local pet shelters across the state why would you become a mirror because you're supporting your station to provide in depth coverage throughout the day\nAlso we put these local programs to focus on topics relevant to Mississippians called eight eight page three seven you to get to go on line ... online dot\nThe stations have been ... music radio R. W. M. A. H. Biloxi WMA ... W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be struck W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\n\nComing up this morning Mozart writes some music for the Indian [noise]\n\n\nFor the morning I'm Jeff ... one of Mozart's patron of was a man named um [noise]\nI remember his name was now but he was a surgeon and the Dutch east India company I think his name was differently [noise] most are referred to as ... as our Indiana or the Indian or the number of uh [noise]\nMaster works for that particular patrons will hear one of the coming up later in the hour from Carol in science and the ... string quartet fair demanded to Sean that was the man's name became debate [noise]\nHappened to be a lot lately I have a name on the tip of my talk until disappear it before I go to speak at a listener supported classical music on a Tuesday up next an orchestra from one of the smallest countries on earth to national chamber orchestra and Dora\nWho played one of these little miniatures by one man [noise] [noise]\n\n\nOh\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nOh\nOh oh\nOh\nOh\n\nOh ... oh\n\nOoh\n[noise]\n\n\n\n\n\nOh\nOh\nOh ooh ooh\nOoh\n\n[noise]\nOh oh oh\nOh oh\n... uh um [noise]\n\n\n[noise] [noise] [noise]\n\nOh\n\n\nMy\nGod whoa whoa whoa whoa\nWhoa I'm\n[noise] [noise] [noise]\n[noise]\n[noise]\nOh la\n[noise]\nWhat Mr handles looking in church and the orchestra Simon ... the organist along with you who the menu in the menu in festival were destroyed\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]", "show_name": "Money Talks", "year": "2018", "city": "Jackson", "day": "23"}