{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\nDo\nYou [laughter]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n... ...\n...\n\n[noise]\nNo\nNo no no no no no no no\nNo no no I'm\n[noise] na\nNa na\nNa na\nNa na\nVe Rondo finale from Beethoven's piano concerto number three performances ... church tennis Rudolph circumvent the Boston symphony orchestra\nHi this is Chris daily inviting you to join me right here every Saturday from prairie home companion\nWe'll be joined by the press a musician something you'll know when others you might not know yet but ... well plus a bit of comedy I knew some of the week the powdered milk biscuits interest in soccer questions and if you were surprised as well All right here each week on the prairie home companion Saturday at five on MTV music radio\n\nStations have been ... music radio R. W. M. A. H. Biloxi WMA visible W. M. A. you view\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at MVP on line or gee\n\nWell it's time to lakes up your point shoes and get ready to go to the ballet\n[noise]\n\n... ballet Sleeping Beauty is of course about the title character but there is an entourage a fairytale characters also big appearances in ballet\nTowards the end of Sleeping Beauty is a wonderful dance between princess for green and the bluebird bluebird\nPod they do by Tchaikovsky is on the way from the Scottish national workers [noise]\n\n\nMandolin a Mandel up and the men do show that's what it takes to put together a mandolin cortex\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[laughter]\n[laughter] [noise]\nLa la la la la la la la la\nLa la la la\nFrom pretty near the end of the checkups you'd probably Sleeping Beauty the bluebird ... do you dance for to the Scottish national or district conducted by name a year\n[laughter]\n\n\n\n\n\n\n[laughter]\n\n\n[noise] [noise]\n\n\n[noise] there were several of course the BCS well not orchestra works that started out as the other pieces or they'd be seated not always duty our distribution and awesome was handed off to his colleague a young man they ought to reduce aches\nNow WCW Nineteen Eighteen on the loose lips don't wait 'til Nineteen Seventy three died just showing this hundred first birthday\nThis is a boost phase arrangements of course the BCS to teach which\nHere's the CBC in Vancouver orchestra led by ... [noise]\n\n\n\n\n[noise]\n\nNo\nNo [noise]\n\nNot the\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\nMm\n\n\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n\n[noise]\nMm Mm Mm\n[noise] [noise]\n[noise]\n[noise] [noise] yeah\n[noise]\n\nBut\n\n\nWe\nDo\nYou\nDo you know [noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\nA preacher in B flat spike Lucille Clemente the pianist was Louis ... Silverstein just listener supported classical music for your Tuesday is incidentally national candy corn de ... how are we so enjoy what you can't\nReally seventies sixties ... Christian box you on Sebastian youngest son moved to London one of his early appointments was music mastered the queen Charlotte twice as George the third\nReforms ensemble known as the queen's chamber band title that's been borrowed by this modern day on some good they are to play music on Christian ... [noise]\n\n[noise]\n[noise]\n", "year": "2018", "show_name": "Money Talks", "city": "Jackson", "day": "30"}