{"month": "10", "state": "AZ", "station": "KJZK", "content": "Keep you informed about late breaking music news and anything else we just keep my did under current radio died now we're on Facebook Instagram Twitter although links are right there at undercurrents radio dot yeah\nWe live snail mail someone who does the other day on the send us a check\nSo we have the snail mail there as well I think everybody for coming in and you see is needed voice one Native American radio network\nYou're listening to the Arizona community radio network on eighty nine point five K. J. ca Drake Prescott bally Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven K. J. C. K. Kingman Boulder City Nevada and on translator cage to one seven ... park in Ninety One point three than\nSupport for the Arizona community radio network is provided by uptown United drug where you'll find friendly knowledgeable garbage that with more than eight years of\nCombined experience for the board of Health News discount coupons key medication information or to refill your mail order prescription log onto uptown United road dot com Serbian king minute golden belly\nSupport for rescue public radio was provided by their show that whole museums forty you their annual folk music festival\nFor stages Ninety deferred action and two hundred musicians perform all the beautiful forager campus of Charlotte hold museum Adele John Prescott gives you get in free details on line at Charlotte dot O. R. G. for great music food and fun for the entire family gets the big folk music festival\nToday's Sunday is the final day on deal for me um\n\nThree days Greenpeace greeting this is my well the music that these will play called the space for radio Phoenix semi hosts will reduce it it's good to be here a good to have everybody on board or a few weeks ago\nA a have a some music for much Jaycee lodge coming up for you he also some music by a scratch or least scratch pairing up\nAnd then I have some uh amused by nights it's an interesting group coming up later on in the program so everybody kick back relax enjoy so then we went to this so called to stay in a peaceful manner right free would it be what do right now it would do this real like within a week ago\n\n\n\n\n\n\n\n\n\n\n\nWe time down there\nAnd the danger oh\nWe got on the job\nHand on the day\nFrom Maine and in a while\nAnd then I have\nOn and I\nI Am\n\nA guy John\nI enter the main base\nUm\nThe day\n\nCame away and I think a clean and the\nThey painted the man\nMean we [noise]\nIn\nLie and say oh\nWell that's kind\nOn me [noise]\n\n[noise]\n\n[noise]\n\nOf oh\nIn St\n\n\n\n\nMean they you know\nThing\nIf you don't know but that means\nSaying\nNow it'll only\nOne who\nIt when\nKnow and be able to do was\nAsk and\n\nThink they know na\nNa\nNa na na you\nKnow\n[noise]\nNo no no\nDon't make me any change\nI mean this is my you know and then I knew what was\nOh no [laughter] God [laughter]\n\n\n\n\n\n\n\n\n\n\n[laughter]\nYeah\n[laughter]\n[laughter]\n\n\nTo be\n\n\n\n\n\n\n[noise]\n\n[laughter]\n\n\n[laughter] [laughter]\n...\n[laughter]\n\n\n\n\n[noise]\nDa and that at the beach with listening to the ... isn't it strange excuse me street to get\nIt before that Michael Rose up for the warrior a CD who listen to the cuts die or a ... up with Bob Marley off of the survival CD with the to the cut so much trouble in the world it would take it a small break they'll go anywhere we'll be right back guy [noise]\n\nDa da dum la da dum la\nShea Brian [laughter] geared at all and just leave command high [laughter] go walk down\nWill be key Ron I'm Wondering why now on the line on our\n... [laughter] I Am I walked in and we\nMight be true for sure [laughter] and they are George [laughter] Jersey [laughter] drink\nFor [laughter] [laughter] yeah job\nLike she she writes or ... [laughter] you're I don't have all these current life church\nIn general for very sorry curse [laughter] and never showed the birds are around the earth and already her ... who are still getting\n[noise] Shaun ... go out and you're sure\nYour [laughter] I Try to reach trying too hard\nFor me [laughter] [noise]\n\n[laughter]\nYour your lawn\n[laughter]\nYou went to Washington and I think you're going to bet on\n\n[laughter] you order and you give\nUs Jordan going to see this you're worrying about how [noise] you know your voice [laughter]\nIt's Bob Blount five five dollars and you know there's no job no there's really bother me on ...\nAvenue overseas shown [noise] bonded\nThe you know the whole priest [laughter] neither do\nDon't know if you're going to get down get ground hogs the out of\nYour charm [laughter] you know traditionally Shaun Walker\nThe German war\nShe right\nHere at all and just made me a long shot [noise] [noise]\n[noise] I mean ... [noise] I mean my\nMe and my aunt and you're getting young goes\n[laughter]\nThat was the or\nThe future in leave scratch Perry top of the observer in the dark how the the limited to to the pet Thursday and before that ... out or as for the Caribbean sense that the the related to the to the ... a more than ... ... right\nAnd a quilting at the end up with midnight up to be true right the the when it comes to the ... home that day [noise]\n[noise]\nMy\n\nLike\nA lot to do that\nDidn't want\nTo go on the on the in those may\nThink oh\nBe maybe the\nLater that day that we'll see\nBut if they had him on the map may have to have\nYou know man and\nDid did you did you\nI don't\nDon't think that\nAre ... and ... and ... and I don't\n\n\n\nYou're listening to the Arizona community radio network on eighty nine point five K. Jaycee a drink packet valley Ninety point one K. J. C. P. Prescott Chino valley Ninety point seven kj the cake Kingman Boulder City Nevada and on translator K. two one seven ... park in Ninety One point three at them\nSupport for this public radio station comes from the eleventh tangible rescued area artist studio to her visit with ADD read artist at fifty one private studios was artist at three arch enters meet the artist learn their techniques and purchase fabulous are in a broad range of mediums today Sunday is the final day of this free extraordinary annual event\nStudio school it was a poor PM tour maps Indian poet person could do do you do or dot com\nSupport for the Arizona humidity radio network is provided by cable one providing the next generation of the Internet speed giggle one was that you talked to one thousand maggots download and the makeup load\nBacked by twenty four seven locals abortion stay up to speed for all your Internet needs including streaming video and online gaming learn more online I did go one dot net\n[noise]\nReaching reading this is my world the music of peace will believe in concert space from radio Phoenix I mean who knows what Richard said good to be here it's good to have everybody overboard alright\nOkay who's there is a a group out of a room Arizona\nAnd then the name of the group is majored lingo I have some of their music on the top of the program here are also I have some a fiesta mambo for you also have some uh and Julie ... uh an interesting version of a Jimmy Hindus to that she did and then also of course some\nBody for you okay for the Bob Marley fans and also I have a band out of San Diego lifters have them on on on the program as well or in their music okay so hey you all take back relax do whatever you want to do in this peaceful place and coauthors face All right\n[noise]\n\n\n\n\n\n\n[noise]\nOr [noise] [noise] [noise]\nMm [noise]\nNa na na na na\nNa na na na na na na na na\n\nNa na na\nNa na\nNa na\n\nNa\n\n\nNa and two kids and all\nNa na na na\nDa da\nDa da\n\nDa na na\nNa\n\n\nNa\nNa na na na\nA\n\nGetting your\n\nAnd\n\nNa\nNa na\nNa\nNa\nNa\n\n\n\nNa\n[noise]\nOh oh oh oh da da da\n\nDa\nDa\nDa da da da da\nDa\n\nSay\nOh well the\nF\nDa da da da da da\nDa da da da da\nDa da da da\nAnd I I'm\nAn addict and bad you know and I and\nAnd\n\nBetter\nOn your doctor was hired to clean up we're going to bring my mum\nOn the end they gave me a little\nAnd begin to get a new\nOf mine ... legal recalling\nShort\nThese people don't really\n\nThey'll be more people are getting\n\nWill will be burning all the\nRules and not\n\nThat we can look in the last thing\nThat kind of a new one is really the local local local\nPatty got used\nTo be the one that people\nWill be\n\n\n\n\nOn the\n\nThe land and when he came in and all\n\nGoing to\n\nMy\n\n\n\n\nLulu making the Jay Leno the\nCool things close to\n\nAnd I have no ability to band together and the and\nCan never eat\n\nAll the time you do\nAnd\n\n[laughter]\nAnd\nLet them they don't seem to go and they tend to be able\nHow do you want to be a big game you\nAnd then they\nThe\nKnow you do\nIn the\nDown to the bar and you have to be in touch with them and Peter Miller\nBecause people can keep them how to\n[laughter]\nThese can\nHave to be the party and they're not going\nDown and read it and then they\nDo\nAnything to do\nAnd [laughter] and then you\n\nBe trying to live and you\nLooking around the table saying not\nDo that they would go\n\n\n\n\n\n[laughter] [laughter]\nNo [laughter]\n\nWe used to be the that\nThat was a sudden they date me sending a day off of the things grow a series CD we listened to the ... system\nAnd before that and do the ... up the covered the world see the but listen to a nice rendition of a Jimi Hendrix to boot child slight return right\nIt was open that set up with Bob Marley in the way it is up for the rest of the month vibration Phoebe we listen to this cat positive vibration so okay I Will take a small break and we'll be right back they'll go anywhere [noise]\nAt home dad\nThey can't do\nBe that bad\nThey can do it\nDa da da da da da da da\nA million dollars\nDa da da da\n\nUsed to be used to be that was more Ben Bailey the era of both the island\nGym to see the really good to take me back and before that\nYou know for the call a CD with it than to get the ... and that we open up the F we use the mambo up to be about the music CDs to let the cat mama can't beat out\n[noise]\n\n\n... by ... ... one gay jade de da de ... at Ninety One boy three up in ...\nArizona ... radio network\nSupport for rescue public radio was provided by their show the whole museums forty a Daniel folk music festival\nFor stage ... and two hundred musicians perform all the beautiful forager campus of Charlotte hold music and the delta brisket get you get in free details on line at Charlotte dot ORG for great music food and fun for the entire family gets the big folk music festival today's Sunday is the final day I'll do for me yeah\nI can like you're the host of the mountain gardener each week we cover the insider tips and church for local garden that's the melting Gardner every Saturday and Sunday from ten to eleven AM\nTo overthrow this public radio station comes from the Olympic Daniel Prescott every artist studio tour visit with a teacher right artist at fifty one private studios plus artists that three arts centers me the artist lived their technique to purchase fabulous or get a broad range of mediums the free studio tour is next weekend ...\n... ... good studio tour dot com\n[noise]\nI spoke alley and I'm a ... seed banks are coming along for the musical ride this week\nTo hear you sounds from Amy how will not Lucy can plant ski Andy earls Lester coming up in the next hour and remember you're going to find even more new music on so carries fresh touch feature you'll find that at ... dot com also on\nHappy birthday to Jackson Browne\nHe's Seventy on October nights and next he is trying hard to look outside of its own world view trying to get a sense of someone else and someone else's life this is called lives in the balance\nNa\nThey even they they sounded\nFew minutes a day care\n[noise]\n...\n[noise]\n[noise]\nBeing a young man was the knowledge and the just the\nBut you know well yeah but you know the you know\nAnd you can ... G with right now which is ... ...\n\nAnd ...\nTerms of\n\nAnd see Taylor also known as he's called messenger that's a song called the locks see from his cold messenger Hassan before that that empty Taylor co wrote with Josh Kaufman\nI really sad song this swing according to a and see Taylor talking about getting through tough times about enduring through the struggles that make life\nLife this too shall light the name of the song it's the title track from Amy Helms brand new solo album this is ...\nYou can hear border radio Thirteen twenty am on the radio ethics down at the Aspen solid and so like kale I think as your favorite station\nIs there's some stadium will be ... to ... will be fun run well there'll be a contest for costumes a much more can you do this Saturday in the evening from six to seven thirty that's will be the what does your son drive in Yuma, Arizona yeah for\nNight to wait three in here seven six nine zero [noise] a brochure first\nProduced by the Arizona highway department in Nineteen twenty five Arizona highway the ball into one of the most respected and rebuild publications in the world doing K. A. W. the and retired Arizona highways publisher when holding at the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty seven\nAt St Paul's cultural center for information through the gate a WC dot org there's been made possible in part by a grant from Arizona humanities\nYou're listening to talk of Kelly ... back to the eighties in this next that's still to come this hour a new take on a traditional tune from the bluegrass super group the URL of Leicester first tell some thoughts about friendship\nOr does it really means to be a friend who's the Polanski ponders that with that one of her oldest friends Sean cold and then the two have been making music together for quite a while now and this is the song and ... plants ... new album everyday street Mm\nAnd I've got a ... man may ...\nMay be Nineteen eighty to ...\nHours on ... to ...\nHis name I don't know uh any\nReason men ...\nEach other\nMen in every fan\n... feet high\nNow and my name's Elaine ...\nLeaning I share I haven't seen it in you and I am\nI was working right now\nDee game in town\nSaying to ah\nThe no\nCreature and I'm\nKnow shared the secrets\nNa remains you know\nHe ...\nGreen Bay game\nShaw\nIt is um I Know\nMy ...\nAnd I don't know\nTiny years right now\nShare a story\nI managed to ...\nA\nNa na\nNa but no\nNo\n[noise] no\nAnd [noise]\nNa na na\nNa na\nNa na\nNa na na\nNa\n\n\n\nNa\n\nNa na na\n\nNo no no no\nNo we're\nIn in my\nI don't know na\n\n\nNa na na\nNa na na na\nNa na\nMe\n[noise]\n\n\n[noise] you know there are\n\nDying\n\n[noise]\n[noise]\nAWAC is calling their offspring grumble having dinner offerings for the fall semester the next meal featuring Armenia night with ... will be served this Tuesday evening at six meals are served in the learning resources building on the campus room ... new nine tickets are available to abuse the business office\nSunny and humid today with the high and you're eighty three breezy with the north West Wing drowned Fifteen miles per hour gusts its highest twenty miles per hour ... thirty percent chance of showers and thunderstorms partly sunny with a high and you're sixty nine\nNorth northwest wins around eleven to Fifteen miles traveled the afternoon with wind gusts up to twenty three miles per hour in Prescott eighty percent chance of showers and thunderstorms behind your fifty six in Flagstaff\nEighty percent chance of showers and thunderstorms mostly cloudy skies what the high near forty eight\nThis is Kelly music works\nFor everything I don't think there's ever a bad time for music it helps with well with heartbreak was quiet times with party times Everytime and it also helps when the world is just too much too stressful too frustrating and you need a way to deal with some of the emotions\nEric they had been Habiba ... share this song for that very intense they think it's about our desire for conspicuous consumption new song called we don't care [noise]\n\n[noise] we\nFor someone else pays nothing\nTo [noise] [noise] no we don't have [noise]\nYou don't know about\nKnew he loved me and I don't\nDon't care I mean so I'm going\nNa ve warm she may be maybe ... jumping the coal\nThe green song ... to\nIn the main show\nA young\nNew ... between ... and I'm ... I got\nWe need to be ... billion deal on\nThe early\n[noise]\n\nYour show my cooking the mom\nIt turns\nTalking today about the\nAnd I knew you were\nAnd impassioned takedown of propaganda\nMisinformation and live in our current political landscape not my word that's with Amos Lee says about that song is called cricket ... something you know find on ... brand new release my new moon before dad a song about our desire for conspicuous consumption ... we don't care\nEric beds and be quiet pay the new album is called global Grio\n... all about new music I mean of course you'll find the folk classics that you know and love here but\nNew music sure has its place to check out the fresh cut feature on our website and mobile Athens while you're there in those places read more about this brand new song from Lucy wing right roaches new album little beef it's called ... with me [noise]\nNah me well\nTo see you", "show_name": "Weekend Edition Saturday", "year": "2018", "city": "Kingman", "day": "07"}