{"month": "10", "state": "GA", "station": "WNGH", "content": "On studio three sixty [noise]\nThis is member supported gp Pete were in Eighteen station radio network you can listen online at ... dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fault fund drive there's still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution good a gp dot org and click donate at the top of the page your contribution at whatever\nLevel is right for you while cover the cost of the programs you love on cheap ... thank you so much for your support of Georgia Public broadcasting [noise]\nOf Ninety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\n[noise]\nDo recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered lunch CPB if you didn't get a chance to donate during the drive\nYour online contribution now will still make a difference [noise] please take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page\nThanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nWhen a life hangs in the balance what goes beyond a reasonable doubt really mean\nAnything [laughter] and then on them on my mind that\nGPA be present the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis joining us at ten am on Sunday October twenty first starting G.\nP. B. radio\nLive from NPR News in Washington I'm ...\nHurricane Michael the powerful category for storm that made landfall in the Florida Panhandle this week before moving inland and dumping heavy rains on Georgia the Carolinas and Virginia has obliterated some communities\nOne of the hardest hit spots in Florida is the town of Mexico Beach Florida Senator Bill Nelson says entire blocks of homes are simply going what you're saying\nSome communities one of the hardest hit spots in Florida is the town of Mexico Beach Florida Senator Bill Nelson says entire blocks of homes are simply going\nWhat you see our houses that are no longer using\nThe concrete slab of the house and that's all that's left Michael\nMeanwhile caused varying degrees of damage in Port saint Joe's storm surge smashed two homes blowing out windows and brick walls are just twenty miles away in the town of Appalachia cola Stuart nineteenth century homes are largely untouched president Donald Trump says we'll visit Florida and Georgia next week to assess the damage\nVice president Mike Pence was in Illinois today at a fundraiser for Republican congressman Rodney Davis Sam dunk law of member station ... reports the GOP incumbent is among those facing a tough reelection bid\nThe upcoming midterm Davis is seeking his third term in what has been a safe Republican district but polls suggest the race will be tight this year similar stories are playing out in other key districts across the nation in his remarks at the Illinois fundraiser vice president Pence heaped praise on the incumbent calling him key to pertaining to GOP majority\nDid just a few short years congressman Rodney Davis has emerged as the voice for conservative values and we need Rodney Davis back\nThe congressman was reluctant to side with the administration at first Davis called for president Donald Trump to give up the nomination and twenty sixteen following the release of a controversial Access Hollywood tape for NPR News I'm Sam ... in Springfield, Illinois former\nVice president Joe Biden made a campaign stop in Kentucky today to rally support for a political newcomer into hotly contested congressional race Kentucky says sixth district spans\nFrom Lexington departs ... Sherry last sort of member station WBUR reports it's one of the seats the Democrats are hoping to flip and November [noise]\nWhenever Phil fan of more than two thousand here just retired Marine pilot and panic colonel any McGrath welcome ... Mehta community fish fry knowing about\nThe former vice president praise McGrath military record of eighty nine combat nations and called her run for Congress her ninetieth mission Biden said character is the single most lacking commodity for many of those serving us in the U.S Congress today\nIs the single most important thing in a me brings to this race in my view\nIs scheduled to stand for the incumbent congressman Andy bar on Saturday for NPR News I'm Teri loss in in Richmond, Kentucky\nStock steady somewhat after one of the worst sell offs in ... the Dow Jones industrial average closed up two hundred and eighty seven points today\nLife in in Richmond, Kentucky stock steady somewhat after one of the worst sell offs in months the Dow Jones industrial average closed up two hundred and eighty seven points today to twenty five thousand three thirty nine the NASDAQ was up a hundred and sixty seven points yes in ... thirty eight points this is NPR\nBroadway songwriter Carol Hall died this week at the age of eighty two in New York best known for her songs for the best little whore house in Texas the cause was complications from dementia Jeff Lunden has this remembrance\nBorn in Texas Carol Hall trained as a classical pianist but some are calling after taking the workshop for musical theater writers in New York [noise]\nShe wrote songs for Sesame Street free to be you and me and some off Broadway reviews but her biggest success was riding the score for the best little whore house in Texas which are under two drama desk award show ran on Broadway\nFor five years and was turned into a film starring Burt Reynolds than Dolly Parton\nIn addition to writing scores for several other shows Harold hall taught musical theater too young officers for NPR\nNews I'm Jeff Lunden in New York the prosecutor who released a grand jury report this past summer on rampant sex abuse and six Pennsylvania dioceses says that it's not acceptable that Washington cardinal Donald Wuerl will be retiring with no apparent consequences\nPennsylvania attorney general Josh Shapiro says the grand jury report and they also seen records document that will oversaw and participated in a systematic cover up of child sex abused by clergy members or heading up to Pittsburgh dioceses\nFutures prices posted modest games to end the week oil was up half a percent closing at up at Seventy one thirty four barrel New York mercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nYou're listening to G. P. B. jazz on Georgia Public broadcasting I'm Neil tester\nYou're attuned to jazz with Neal tests are\nTo have you along in this hour we're going to get to some ... music we're going to get to a couple of recent recordings of ... compositions by\nBut Neal tests are glad to have you along in this hour we're going to get to some of his music we're going to get to a\nCouple of recent recordings of men gets compositions by guitarists to a pet Martina\nAnd from another guitar bass duo album that the ... not a duo album but the Michael moose allow me at a rich Syracuse album that were did I hear from is a guitar and bass do all they do a lot of maintenance compositions on their recording which is dedicated to make us\nAnd we're going to hear an extended composition and performance by the Charles ...\nItself featuring Eric coffee so I Hope that you'll be able to stick around\nFirst though this music from eight to saxophone quartet with based on drums and two tenor saxophone the SEC's opponents are already black and hundred diamond then because of that they call their band black diamond this is from their album Mandela\nThe reason the recording from a trio led by the ...\nAnd a tune called Mrs Parker of Casey the subtitle or I should say the the alternate title that is birds mother so birth mother Mrs Parker Casey you know it's about the woman who gave birth to Charlie Parker\nWe started that set of three out with the Chicago based quartet a two sacks of phones already black in hunter diamond they call a band black diamond also be during that jewelry on bass said Neal pill on drums\nFrom their album called men dial up in the middle of is that where the latest from the trumpeter I'll just shy Cohen who is working with a quartet on his album entitled cross my palm with silver that quartet anchored by now she waits on drums\nAnd then as I said the drummer GM flows that his trio includes that's been white on base and\nQuartet anchored by now she waits on drums\nAnd then as I said the drummer GM flows that\nHis trio includes Desmond white on base and pointedly settled in Fort neuron piano I mean if it's if it's a piano trio even if it's led by the drummer the pianist is going to play a bit of a pretty big pretty big role\nIn how that band sounds and this band sounds great and a lot of that has to do with solving foreigner\nThe outlook is a thing called Joe came out in the fall of two thousand Seventeen and features that Jackie buyer composition Mrs Parker of Casey\nThis is Jasmine Neal to answer the first time that I heard that composition Mrs Parker of Casey\nWas on a ... doll the recording and I'm called far cry I Believe from Nineteen sixty which also featured Jackie Byard at the piano and a few years after that in Nineteen sixty four\nBoth ... and Jackie Byard were part of the Turing sex tap led by Charles ... is this was a band that did not record in the studio at such these players did record with Charles Maynes but not as this Charles ... we're about to hear in an extended composition so sit back and enjoy that\nBut on tour in Nineteen sixty four the Charles ... played at Cornell University in New York and that's the name of this recording current Cornell Nineteen sixty four ... this was just about the time it ever ... he was planning to leave the band and work on his own projects unfortunately he passed away only a few months after that\nAt a very young age and of natural causes I hasten to add\nAs part of this ... which start Eric ... ... corporate Jordan was also there are ... and Johnny coals on trumpet with that as I said Jackie Byard at the piano Danny Richmond on drums and then gets of course himself on base\nThis is the composition called orange was the color of her dress then blue ... [noise]\n... you\n\n[laughter]\nIs that a Nineteen sixty four\nIn the spring of that year at Cornell University issued a double album on the blue note label called Cornell Nineteen sixty four from which we heard orange was the color of her dress than blues bill\nIssued as a double album on the blue note label called Cornell Nineteen sixty four from which we heard orange was the color of her dress than blue silk\nA typically cryptic Charles ... is a conversational title he wrote this wonderful music and then through these two titles on there that you have to scratch your head about some of them made sense some of them didn't all of them were unusual including the ones that were in Latin [noise]\nSo um that was just another aspect of Charles ... says quirky genius and genius it was\nA as were the players in his band most notably Eric ... on bass clarinet there and Clifford Jordan on tenor Johnny colds was the trumpeter with Danny Richmond on drums and Jackie fired at the piano here on jazz Neal tests or we're going to get to a couple of more men gets compositions in just a couple of minutes\nAnd lord knows there are plenty to choose from Charles me it was a master composer and I've been thinking\nIn the year two thousand Seventeen as we've been going through the so Loni is among catalogue of compositions\nThe centennial of monks birth was two thousand Seventeen and so there have been so many different recordings are dedicated to monk or on which some artists plays at least one or two Vilonia month tunes\nI've been thinking about the Charles ... centennial which will be in two thousand twenty two and I think that that's going to\nBe quite the show as well or so on is monk wrote songs and brilliantly he's one of the great composers of a jazz history along and Duke Ellington\nI think you have to count Wayne Shorter and chick Korea and they're among the modern a crew and ... because he didn't so much write songs as well as longer and more complex compositions maybe gets left out of that top echelon when a lot of people uh get into discussing that\nBut in my mind a direct line of composers is Ellington among to me I guess and then beyond and uh even though I was writing these larger works it's not like he didn't turn out a number of tunes that it'd become jazz standards I mean\nFables a fault is a goodbye pork pie had one of the most beautiful ballads and the jazz cannon\nUh pets I can throw up this erectus and horrid tick you beat test those Latin names tunes which just as much fire and muscle and power and Wednesday that prayer meeting him better get it and you're\nIt's an horrid check your test those Latin names to hundreds which just to have so much fire a muscle on our website at prayer meeting better get it in your soul and all the tunes on Tijuana Moods\nThere'll be no jurists of compositions for artist to choose from in celebrating the hundredth anniversary of Charles makers his birth and I'm looking forward to that because he is really one of the most remarkable musicians we have ever heard\nI've got two more Charles make his compositions for you on the program both of them from recent albums by guitar players and both of them excellent guitar players\nThis is from pat Martinez recent it released recording calls it above the teacher's pet beyond key on Oregon and make its composition Duke Ellington sound of loves [noise]\nThe\n\nWhole\n\n\nThe whole\nOh\n\nOh\nManage to\n\nWool over to a\nFor me to\n[noise]\n\n\n\n\n\n... to\n...\nBoom boom\nBoom boom\n[noise]\nWas Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\nRecover and after Michael will have the latest on the storm that devastated parts of the southeast plus a Nineteen eighty six fire destroyed the LA public libraries Susan Orlean on the unsolved mysteries that didn't just destroy books\nLibraries feel like these big collective brains because they have the memories and stories as a whole culture inside on\nSaturday on weekend edition from NPR News tomorrow morning from eight and ten unless\nThey're supported CPB support for CPB comes from you our listeners\nAnd connect savannah Santa's alternative weekly source for news music movies theater arts restaurant and events\nAvailable in print at locations throughout savannah and on the Web at connect savannah\nDot com check out CBD music on our Web sites we feature videos at performances from touring artists and emerging musicians and you can see short documentaries about people who make towards that music it's at ... dot org\nLive from NPR News in Washington I'm jak spear\nHurricane Michael is long gone but the damage it left in its wake along with the mounting death toll will have a lasting legacy\nSearch and rescue teams are beginning to find bodies in and around Mexico beach where Michael Ward as sure as a category for hurricane with one hundred and fifty five mile per hour winds the official death toll is at least sixteen but that is expected to rise\nThe Cold War to shore is a category for hurricane with one hundred and fifty five mile per hour winds the official death toll is at least sixteen but that is expected to rise in Panama City Florida resident on trees McCormick says there are lots of people who are stuck\nHoly hell does that mean that we're\nAbiding by now and hopefully we'll be saying so [noise]\nIs over in some areas FEMA crews are using bulldozers and other heavy equipment to push a path through debris meantime authorities are handing out food and water destroy I'm also cause damage in Georgia the Carolinas and Virginia\nTropical storm Michael Pashtu Georgia devastating several that states crops from member station WBUR a B. E. and Atlanta has named trauma reports much of the damage was in southwest Georgia\nHurricane Michael or right before most of the state's farmers had started harvest for the season specifically for the kinds peanuts and cotton Jordan's agriculture commissioner and Gary Black says he saw one farmers cotton crop in South Georgia\nIs our ... I have seen gotten that were being harvested yesterday ... standing ... liquor you can tell where ... where the rest of it was harvested by the storm\nState officials say at least fifty three pulse rate houses for all the destroyed and five counties in southwest Georgia Georgia pecan growers experience nature lost his last year during Hurricane Matthew for NPR News I'm just seem sound the Atlanta\nPresident Trump welcomed the release of an American Pasteur who was held for more than two years in Turkey NPR's Scott Horsley reports Trump expects the great Pashtu Andrew a bunch of at the White House this weekend\nTrump says he expects Andrew Brunson to get a full checkup in Germany on his way home to the United states but he thinks the American pastor is in good shape Brunson was arrested in twenty sixteen as part of a round up following the failed coup attempt against Turkish president regimen type or the one\nWe're very honored to have him back with us he uh\nHe suffered greatly but we're very appreciative\nTo a lot of people a lot of people\nTrump's his administration made no concessions to turkey in exchange for Branson's release the White House spokeswoman says the administration remains deeply concerned about the continued detention of other us citizens in Turkey and around the world Scott Horsley NPR News the White House\nRecent remarks by President Trump that have been critical of the Federal Reserve is treasury secretary says the president respects the independence of the interest rate setting body treasury secretary Steven Mnuchin said Trump's comments including what he said about the fed\nTreasury secretary says the president respects the independence of the interest rate setting body for secretary Steven Mnuchin said Trump's comments including what he said about the fed being out of control indicate his own stance on interest rates the dollars up two hundred and eighty seven points this is NPR\nAmerican astronaut and a Russian cosmonauts are now in Moscow arriving there after a failed rocket launch\nThe pair were bound for the international space station when they had to use an escape capsule two minutes ended the flight after their Soyuz rocket suffered an unspecified failure of its second stage the two men are apparently OK after making a rapid dissent back to earth\nThat says Mick Hagen Russia's Alexi ... were brought back from Kazakhstan whether you boarded launch occurred the Taliban are reportedly killed eight soldiers and civilians in northern Afghanistan Jennifer glass has more from Kabul\nAfrican officials say the soldiers were killed when the Taliban attacking military outpost in our key in Kunduz Province northern Afghanistan as civilians were killed in far yet also in the north when a car bomb exploded prematurely they were Taliban casualties in both instances\nThe car bombs target was an election rally the latest violence I had a parliamentary elections next Saturday the Taliban and Islamic state have called on Afghans to boycott the vote and it promised to disrupt it they've already targeted voter registration centers election workers and candidate\nKilling and injuring more than three hundred and fifty people for NPR News I'm Jennifer glass in Kabul\nUp chicken hazing reports at Dartmouth College is prompting the ivy league school to take steps to put an end the practice including hiring an investigator to look at over a dozen groups including fraternities and sororities\nCollege officials telling the school student newspaper the investigation is tied to increased reports such activities over the fall semester including reports of excessive alcohol consumption and inappropriate sexual\nBehavior I'm jak sphere NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Robert Wood Johnson Foundation working alongside others to build the culture of health that provides everyone in America a fair and just opportunity for health and wellbeing more at our W. J. F. dot ORG\nNeal tester you're listening to G. P. B. jazz on Georgia Public broadcasting you're doing the jazz with Neal tests or this is music from ... Korea\nSo this is music from Korea\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise]\nMm\nOh\nThat's the latest recording from the Danish singer sin eight IQ her name is spelled E. E. G. and our album entitled dreams which he has put out on the artist share label also features Larry Coontz on guitar and Jacob Christopher send a piano\nAnd Scott Callie on base and Joey Baron on drums\nAnd from that album dreams is an original composition by Sunni IQ which is called Aleppo and as you hear her saying about the children who have no tears left and\nHow does this keep happening over and over again throughout history\nYou can do the math and understand the aspiration for that song are there are people who feel that artist shouldn't weigh in on current events or politics or matters of war and peace and to those I Would say I respectfully disagree and that doesn't have to be the only focus at artists work but of artist didn't do that\nWe wouldn't have the aerobic symphony by Beethoven we wouldn't have ... we wouldn't have the theater of Larry Kramer\nAnd we wouldn't have a song like that Aleppo from snakes eat\nJust before that where it's all a piano music from chick Korea from his early seventies album entitled piano improvisations volume one and his piece called some time ago those things here on jazz with menial tasks or\nWe're going to pick things up or with several more recent releases including this one from the tenor saxophone is Tim arm a cost to works with that\nThat's where we're going to pick things up a with several more recent releases including this one from the tenor saxophone as Tim armored cars to works with the trio and quartet settings on a fairly new album called time being\nThis is one of the trio tracks which features the drummer ... Payne watch and the basis Roberts Hurst who takes the initial so low as this June gets going so lean it a little bit it's a base so but leaning you'll enjoy it it's called ...\n[noise]\nRhode Island [noise]\n\n\nWrong or Pearl Harbor\n\nShe\n\n\n\n\n\n\n... ...\nThat Tim arm a cough syrup jazz with neo pets are this is bases gene parallel and the coup recalls the gene machine\nThat is a group called huts and I guess you would call it a super banned or you could probably call that without your voice cracking but you know I've had a cold up there is so high idled\nYes you would call it a super banned\nOr you could probably call it that without your voice cracking but you know I've had a cold\nIf they're self titled album minutes or capping off the set of three tunes that started with the latest album from Tim armor cost the saxophonist his album called time being\nIn the middle of this that we heard from Jean ... the longtime basis with Elving Jones than others and a group of much younger musicians that he now leads called the gene machine on the album out of the gate among them Nicole Glover the find tenor saxophonist\nAnd as I said we just finished hearing Hudson that's the group that comprises jak these you're not on drums\nLarry granted here on base John ... on keyboards and John Schofield on guitar and he wrote that tune which is called Tony then jak which I Believe from the title\nIs estimation of how John Schofield feels about the legacy of jazz drumming from Tony Williams passed on to ...\nThose things here on jazz with menial tasks or are they growing Hudson made a big splash when they came out in the spring of two thousand Seventeen they as it turns out or not the first group to use that name as you'll hear and a couple of minutes\nAs you may know the ban Hudson gets its name from the fact that the four members of the group ... Larry granted dear John the desk in John Schofield are all relatively neighbors they they all live in the Hudson River valley which is a a section a north of New York city\nActually the Hudson River valley is is very far north of New York city it runs from the city up through the entire state of New York\nThrough Vermont all the way up to Canada but in this section of it which is relatively close to the metropolis of New York\nIt's convenient and relatively affordable for a lot of musicians who need to do a lot of their work in New York but want to get out of the city don't want to live in the in in the urban environment all the time like to be able to get away and so\nThese musicians live in that general area and that's how they know each other through bad and of course\nTheir reputations and and previous work\nSo uh when I first heard about this band coming together and the fact that this recording would be coming out on the team a label it was being described as the Hudson Project\nAnd in fact there was another band called the Hudson Project several years earlier which as I said we're going to listen to and a couple of minutes it's not that unusual I suppose\nAnd in fact there was another band called the Hudson Project several years earlier which as I said we're going to listen to on a couple of minutes\nIt's not that unusual I suppose they're always been a groups that are named for the geographical location in which they have come together so I'm thinking of bands like\nOh the New York composers tap for instance than the New York big band that Brett gold leaves with an album that came out in two thousand Seventeen you got the New York our quartet from the Nineteen sixties there was a New York's string trio there was a San Francisco string trio and and as long as we're talking about other cities\nThe a quick ten of the hot club of Paris and of course New Orleans has had a ton of different bands that had the words New Orleans in front of the actual name of the group and the art ensemble Chicago so this is not exactly unusual\nSo here's the other a band called Huck Finn or more specifically the Hudson Project with John Abercrombie and guitar Bob ... saxophonist John padded Tucci on base and Peter her skin on drums Peter or skin wrote this tune it's called catch and kitten [noise]\n\n\n\nTo do to prevent them from by\nNew news now no\n\nMm\n\nMm that's rolling Kurt doing his very best impression of sunny Raul close out the hour Mm\n[noise]\nDifferent Ninety seven ... seven FM WG P. B. S. W. A. G. P. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nFor MORNING EDITION and on second thought toilet fickle reminding all things that are split their support make everything you hear on TV possible if we didn't hear from your during our fault fungi your contribution now will still make a difference [noise] please take just a couple of minutes to support the\nPrograms you rely on them enjoy on ... and do your part now at whatever level is right for you\nGood at ... dot org and click donate and thanks so much for your support of Georgia Public broadcasting\nAnd it sounded as music to my ears\nSeven and I think also in Georgia the four seasons aren't summer fall winter and spring it's football springs football recruiting inciting day I'm John Nelson a GB sports every Friday I traveled a big covering high school football games for GB TV but there's still a lot\nTo talk about and joined me for the ball friday's in Georgia pod cast available on DVD dot org and wherever favorite broadcaster found me [noise]\nLive from NPR News in Washington I'm ...\nThe official death toll from hurricane Michael is now at least Thirteen though law enforcement and rescue personnel expect that number wise as they moving to solve the hardest hit communities in the Florida Panhandle\nAnd the town of ... beach where Michael roared ashore this week is a powerful category for storm with a hundred and fifty five mile per hour winds the devastation is extensive NPR's Joel Rose has its course\nWar to shore this week is a powerful category for storm with a hundred and fifty five mile per hour winds the devastation is extensive NPR's Joel Rose has it's going to be some time till things are back to normal\nI think the concern here is sort of long term can people live there I mean there's no power and it seems like not really any great chance of power being restored in the near term I mean I think we're looking at weeks if not months given sort of the scale of damage that I'm hearing about\nMental powers are stored there's also no water throughout the city there's no cell phone service in general communication is still just like a huge challenge NPR's\nJoel Rose Florida emergency officials say they rescued nearly two hundred people and inspected thousands of structures\nPennsylvania's top prosecutor is calling for changes to state law that would allow victims of clergy sex abuse to pursue decades old cases in court Bobby Allyn of member station WHYY has more of the latest move from the state attorney general who oversaw a sweeping grand jury report on sexual abuse and cover ups the Roman Catholic Church\nIn Pennsylvania victims of sexual abuse have two years to file a civil lawsuit against an abuser state attorney general Josh Shapiro says he doesn't understand how lawmakers can read the damning August report and not want to change that law\nA grand jury revealed decades of abuse and cover ups involved in three hundred priests and more than a thousand child victims attorney general Shapiro told NPR's all things considered at the time bars gotten away if the case\nIf we lived in another jurisdiction where there was no criminal statute of limitations I Would have charged every single one of them who's living\nThe Catholic conference has oppose lifting time limits on sex abuse claims thing it could bankrupt the church for NPR News I'm Bobby Allyn in Philadelphia\nMedicare announced today premiums for its part B plan will go up next year though by a relatively small amount Medicare officials say retirees will see the premiums rise by a dollar fifty resulting the increase of a tour costs for a while there about a hundred and thirty five dollars a month\nSocks finished a wobbly week with games though not enough to make up the five percent lost the markets sustained during two big down days this week or some analysts are pointing to stabilization White House economic adviser Larry Kudlow telling reporters today it's not the first time the stock market has had ups and downs corrections come and go\nI've been around a while they come and go [noise]\nPolicy is put into place by this administration\nHave delivered an economic boom\nThat virtually everybody thought would be impossible Kudlow says\nStrong job creation as brought down the unemployment rate Wall Street ended the week with\nThat virtually everybody thought would be impossible Kudlow says\nStrong job creation as brought down the unemployment rate Wall Street ended the week with the Dow up two hundred and eighty seven points the NASDAQ was up a hundred and sixty seven points this is NPR\nA bowl it continues to spread through an eastern region of the Democratic Republic of Congo but at least one hundred and sixty five people infected so far and figures released today by the world Health Organization point to concerning uptick in New cases NPR's Nurith Aizenman reports\nThis outbreak was declared on August first and by the end of that month it seems that health workers had battled the virus to sort of draw the number of people newly infected each week with no longer spiraling upwards but the virus was still spreading around seven to ten people a week\nBut this latest trend line so that more recently the new caseload has started topping thirty a week and officials say the numbers are likely even higher because they've had a hard time operating many locations where they've been frequent clashes\nBetween rebel groups and government forces another challenge practically everyday health workers are encountering people who don't trust them and who violently resist efforts to isolate and treat infected people and vaccinate those had contact with them every item and NPR News\nWith electric vehicle maker Tesla moving closer to meeting its production goals the automaker says customers would want to receive a full electric vehicle credit of Seventy five hundred dollars left the order of their car by Monday under federal law buyers received the full credit until the manufacturer reaches two hundred thousand in sales since the start of two thousand ten\nTesla at that level in July but the full credit will continue for vehicles deliberate before the end of this year after that it gradually fades out\nKudos features prices posted modest gains today oil was up to half a percent to end the such that Seventy one thirty four barrel in New York I'm jak sphere NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Jones Day and integrated partnerships collaboratively providing legal services for more than a century forty three officers five continents serving clients as one from worldwide learn more at Jones Day dot com\nBoom to G. P. B. jazz I'm the old tests or thanks for joining me tonight you're attuned to jazz ... oh you can stick around for much of this hour you know sometimes you hear about keeping up with the Joneses this hour we're keeping up with the Harris is here as a debut album that came out\nThis hour you know sometimes you hear about keeping up with the Joneses this hour we're keeping up with the Harris says here's a debut album that came out in the summer of two thousand Seventeen from the Trump bitter Bruce Harris he calls the album beginning so they called this tune stuck\n... Herman orchestra Nineteen forty five and a showcase for the trombone star in that band bill Harris a tune called bees you just before that we heard crazy Harris trombone list who performed on the recording the weird with Carlos ...\nThere is a tune called bees you\nJust before that we heard Craig Harris a trombone list who performed on the recording the weird with Carlos cook an album called dim bones just outside his chest out along on piano and I'm really kill Saddam Trump's\nFred Wesley was the other trombone as he didn't take the solo but he actually wrote the tumor we heard called for The Elders Fred Wesley famous for his work with James Brown and the J. B. horns\nAnd before Craig Harris is so low we heard the trumpeter Bruce Harris and his happening called beginnings\nWhich introduces us to a pretty fine young trumpet or with a great sense of composition an arrangement that terrific ensemble that he's put together for this recording but also features Michael Weiss on piano and not to news grant Stewart on tenor saxophone\nEr during the jazz with Neil Patrick we've got music from Stefan Harris coming up next\nSpecifically from his two thousand and three album which I Would consider in some ways his masterpiece not only for his by proponents Roomba playing but for his composition this was an ... titled the grand unification theory is that on our as a\n\n\n\nOh\nOr\n\nThat's\nThe bass guitars and regular guitars named Jerome Harris he has played both on various recording but he stuck to bass guitar on this recording under his own name\nOn the music label in Nineteen eighty nine if you're looking for it it was called in passing future Marty early on reason Christian Andersen on trombone and J. O. guard on vibes\nAnd before that we are the ... and composing arranging step on Harris and his album called the grand unification\nAnd Jay whoa guard on vibes and before that we heard the ... and composer named ranger step on Harris and his album called the grand unification theory which creature a lovely trombone solo from Steve ... that one came out about Fifteen sixteen years ago\nYou're doing the jazz or with me Neal tester that's that's my name and the names of all the other people we've been listening to for the most part it's Harris we've heard from Jerome Harrison\nAnd Eddie Harris and from a step on average than from Craig Harris I guess you could say that this is a program of jazz Harris meant\nOf course you\nDidn't have to say that and now I'm kind of sorry I did\nNext we got from the gene Harris super banned and their arrangement up center piece [noise]\n\n\n\nThat's the big bad led by Jan is gene Harris fears pianist ferry Harris that's part of the Dexter Gordon recording trash\n[noise]\n\n\n\n\n[noise] ... double your G. P. B. S. W. GBH be room for the Georgia Public broadcasting radio network [noise]\nThis fall we're counting on the participation of everyone who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make it on line contribution to go to G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you will help cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\nSupport for G. P. V. programs comes from our listeners\nAnd connect savannah so then is alternative weekly source for news music movies theater arts restaurant and events\nAvailable in print at location throughout savannah and on the Web at connected than a dot com\nGB has been honored by the Georgia Associated Press media editors winning the top award for radio the pacemaker award we were also honored for best specialized reporting best anchor and best newscast CPB news stand with the facts\nLie from NPR News in Culver City California I'm Shannon Van Zandt hurricane Michael the category for storm that hit the Florida Panhandle this week before moving up to dump heavy rain on Georgia the Carolinas and Virginia\nAnd destroyed some community Florida Senator Bill Nelson says the town of Mexico beach in Florida was completely leveled\nThere's no barrier island out there to protect the\nWhole force of the wind and the label water the game and what your sea or ALS is\nYou're out on out there to protect the\nWhole force of the wind and the ... water that game and more true see houses that are no longer you see\nThe concrete slab of the house and that's all the ...\nPresident Trump says he will visit Florida and Georgia next week to assess the damage from the storm\nAs it passed through Georgia tropical storm Michael also devastated several of the state's crops from member station WMFE Abe III and Atlanta ties name Shonda reports most of the damage was in southwest Georgia hurricane Michael or\nRight before most of the state's farmers had started harvest for the season specifically for the cons peanuts and cotton George's agriculture commissioner and Gary Black says he saw one farmers cotton crop in South Georgia\nIs are worth ... ... I have seen gotten that were being harvested yesterday it was an outstanding in your story ... liquor you can ... you know where the rest of it was harvested by the storm\nState officials say at least fifty three pulse rate houses were also destroyed and five counties in southwest Georgia Georgia pecan growers experienced major losses last\nYear during Hurricane Matthew for NPR News I'm his name Sean in Atlanta\nAnd West Virginia former state chief justice ... has been found guilty on charges of fraud witness tampering and making false statements to federal agents as Dave Mistich of West Virginia Public broadcasting reports the trial is part of a nearly year long scandal that's engulfed the state's high court\n... was found guilty on a weapon charges and not guilty on ten others the jury deadlocked on one additional charge the federal investigations them for more than three hundred and sixty thousand dollars worth of renovations to walk free Supreme Court office\nThe jury found the justice also use the resources for private gain including computers furniture and vehicles and wide to cover up his wrongdoing\nLovers will be sentenced in January and could spend the rest of his life behind bars one of the west Virginia justice pleaded guilty in August to a single kind of fraud he also awaits sentencing for NPR News I'm doing a miscarriage in Morgantown West Virginia\nRussian officials are investigating the cause of us so we use rocket break down\nWhich forced to to make an emergency landing about Ninety seconds after launch the cosmonauts on board the rocket are in good health the two crew members were heading for a six month mission on the international space station when an emergency escape system kicked in this\nThat are in good health the two crew members were heading for a six month mission on the international space station when an emergency escape system kicked in this is NPR News\n[noise]\nThe annual meetings of the international Monetary Fund and World Bank are wrapping up in Bali, Indonesia and Steve Beck no reports treasury secretary Steve Mnuchin and Federal Reserve chairman Jerome Powell had been getting an earful on President Trump's trade policies\nFinance ministers and central bankers from a hundred and eighty nine member nations have been discussing challenges facing the global economy and their focus has been on fractious trade relations as the IMF lowered its forecasts for world gross\nManaging director Christine Lagarde warned the global economy would take a significant hit if trade tensions worsen she urges the U.S and its trading partners to de escalate and fix the system not break it\nThe administration is not backing down it has raised tariffs on half of China's five hundred and five billion dollars in exports to the U. S. and at this annual gathering Malaysian worn Beijing not to devalue its currency to gain a competitive advantage\nFor NPR News I'm Steve ...\nRising tensions in the lead up to Brazil as presidential election had been linked to several of violent hate crimes\nAccording to the AFC news agency supporters of leftist candidate Fernando ... had been targeted in one case a woman had a swastika carved into her flash by supporters of far right presidential candidate ... both an R. L.\nI. Brazilian association of investigative journalism has also recorded more than sixty physical attacks on reporters ... has been leading in the polls in Brazil I'm Shannon ... NPR News in Culver City California\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home advisor dot com\nYou're listening to G. P. B. jazz on Georgia Public broadcasting I'm the old tests or you're tuned to jazz with menial tester and this is out of sex voters Vincent Herring the album is called hard times\n\nBoom boom boom\nIt's called hard times\nWell [noise] oh\n\n\nGood luck\nMan do want to\nWhoa\nMama that you\nI just thought I was happy when away\nI just thought I was happy went away\nAnd that's the reason I'm calling you hold the thing\nBelieve that we don't\nWhich is\nPlenty of them\nGet back\nOn that in a long night or\n... Hendricks and Ross as in Dave Lambert Jon Hendricks than any Ross singing the solos that Horace Silver and blue Mitchell the trumpeter and junior cook the tenor saxophonist originally recorded on that same to the song is come on home\nThe land but Hendrickson Ross version appeared on an album originally titled high flying with the ibex trio and Horace Silver version as I mentioned was on the album finger popped and with the Horace Silver quintet and before that we started to set up with the latest album from Alto man Vincent Herring\nRecording that includes the rest of them alone on guitar Steve tour a on trombone along with Cyrus chest not at the piano on a tune called hard work from the album entitled hard times\nRight here on jazz with me Neal tests are where we have music with strings from a trio of vocalist all them paying tribute to other vocalist that's a lot to think about it's all coming up with a couple of minutes [noise]\nBefore the singers though in the area also Alto saxophonist Paul that's been\nI'll go back to the bone that's been\nWell\n\n[noise]\n\n\n...\n... a ... [noise]\nI always tell the\nKnees\nWho are in\nRun\nTo me\nThe um\n\nWe heard keys keys keys or which was a hit for Nat King Cole means maybe maybe maybe\nAnd then we just finished as I said listening to Laura Kennan and diversion of never will I married which is certainly brightly and featured back ten men on base Ingrid Jensen on trumpet along with Jared Shirley on drums\nThis is from the album Lauren chairman released in two thousand Seventeen\nOn which she takes all the songs that were done by cannonball laterally and Nancy Wilson on their famous album of the early Nineteen sixties allowed and that was a tremendous boost for both of their careers and on this recording Loren cannon\nWho is best known for her work with the New York voices has taken all those tunes and recorded them in the order they appeared on the album but in strikingly different interpretations so it's a tribute to Nancy Wilson\nVoices that's taken all those tunes and recorded them in the order they appeared on the album but in strikingly different interpretations so it's a tribute to Nancy Wilson and cannonball out early but also a completely ah Loren cannon project the album is called a sweeping the\nSpeaking obese here's one more for your body the latest album from Tom Harold called moving pictures reaches a rhythm section headed up by Danny ... at the piano and this composition which is entitled G. H. B. O.\n\nThe phone from trumpeter Tom Harold here's the latest in the big band led by Christian McBride\n[noise]\nNinety seven forty seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n[noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered once she'd be be if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nOh recovering after Michael will have the latest on the storm devastated parts of the south east Bush in Nineteen eighty six fire destroyed the LA public libraries Susan Orlean on the on the shoulder mystery that didn't just destroyed books\nLibraries feel like these big collective brains because they have the memories and stories of the whole culture inside them\nSaturday on weekend edition from NPR News new and it's for weekend edition this morning from eight to ten right here on TPP\nFly from NPR News in Culver City California I'm Shannon bent sense\nHurricane Michael category for storm slammed into the Florida coast this week emergency officials continue to fight blocked roads to bring relief to hard hit areas of Florida's panhandle including Panama City and Mexico beach WFSU last rain daily reports\nHurricane Michael Franklin counties tiny East Point\nAnd Mexico beach WFSU asked Ryan daily reports\nFollowing hurricane Michael Franklin counties tiny East Point community was completely without power on friday day three of the outage big top supermarket is the only store in the area to get some power back from generators on friday owner can if Schreiber grilled the remaining need from his store for a free barbecue to feed the neighborhood\nWere trying to ... people have been laid back there so we had to cleaning and little by way of\nDoing it in bed\n... storm surge put three inches of water into business less than two hours away in Tallahassee nearly Seventy five thousand utility customers were without power at the end of the week for NPR News I'm Ryan daily in East Point Florida\nPresident Trump welcome to the release of an American pastor\nWho was held for more than two years in Turkey Bunsen was arrested in twenty sixteen is part of a round up following the failed coup attempt against Turkish president Tayyip aired a wet and Paris Scott Horsley reports Trump expects to greet pastor Andrew Brunson at the White House this weekend\nThe Trump Administration has lobbied hard for ... release he was a cause ... especially with the president's evangelical supporters however Trump says the U.S made no concessions in exchange for brunch and freedom\nFormer vice president Joe Biden made a campaign stop in Kentucky friday to rally support for a political newcomer and hotly contested congressional race\nKentucky six district spans from Lexington like sing tend to parts of Appalachia Cheri Lawson at member station WBUR each key reports it's one of the seats the Democrats are hoping to flip and November [noise]\nAn overflow crowd of more than two thousand here to retired Marine pilots kind of colonel Amy McGrath welcome by met a community fish fry annoying bell\nThe former vice president praised McGrath military record of eighty nine combat missions and called her run for Congress her ninetieth mission Biden said character is the single most lacking commodity for many of those serving us in the U.S Congress today\nIt was the most\nThing to name he brings to this race and Martin\nPresident Trump is scheduled to stump for the incumbent congressman Andy bar on Saturday for NPR News I'm Cheri Lawson and Richmond, Kentucky\nThe Hong Kong government disqualified a democracy advocates from running for a seat in the city's legislature Hong Kong as a former British colony that was returned to China in Nineteen Ninety seven half of Hong Kong's legislature is ...\nFrom running for a seat in the city's legislature Hong Kong as a former British colony that was returned to China and Nineteen Ninety seven half of Hong Kong's legislature as directly elected but efforts to expand democracy have not been successful this is NPR News\nSouth Africa's long time foreign minister has died pick ... was an unusual political figure as Chris Tamar reports he defended the apartheid system then later served in the government of the country's first black president Nelson Mandela\nPick both died at his home in Pretoria at the age of eighty six after a long illness he served as South Africa's foreign affairs minister from Nineteen Seventy seven until the end of apartheid in Nineteen Ninety four standing up to the outside world in favor of white minority rule\nBudget has been described as a good man working for a bad government\nAfter Mandela was elected bow to went on to serve in his cabinet and later joined Vandellas African National Congress party the AMC says he was one of the few apartheid era leaders who recognize that institutionalized segregation was a crime against humanity for NPR News I'm ... in Johannesburg\nBritish businessmen Richard Branson has stopped talks with Saudi Arabia over one billion dollars of investment and his virgin group space divisions after the disappearance of Saudi journalist ... Branson has also suspended his involvement and two tours in projects and Saudi Arabia\nCould show the a critic of the Saudi Government disappeared while visiting the consulate in Istanbul last week and a statement Branson said that if what has reportedly happened in Turkey around the disappearance of ... has proven true it would change the ability of anyone in the west to do business with Saudi Arabia\nThe country's crown prince has been attempting to open Saudi Arabia to foreign investment\nI'm Shannon been sent NPR News in Culver City California\n\nSupport for NPR comes from NPR stations other contributors include Carnegie Corporation of New York supporting innovations in education democratic engagements and be advancement of international peace and security or information is available online at Carnegie dot org\nI'm Dee Alexander you are listening to GDP jackass on Georgia Public broadcasting\n\nThank\n\n\n\n\n[noise]\n... from the love of the of the sky\nLet the wild rump is docked rainy relatives on piano Chris Potter on saxophone Steve Nelson by Peter Washington based and Lenny White on drums and before that we have the music of Mr shine Maxwell from his latest\nHis group new tomorrow from music in my mind that composition another Monday next up music from John Boulder from his latest decade memoirs with memoirs by the sea part one and two\n\nLike\nI'm managing it\nJudith Owens from rediscovered shake so few and before that he'll he'll from interest\nJudith Owens hungry discovered the shake machine and before that feel heal from interstellar adventures also the title of backtrack here's Joe Henderson lazy afternoon\n... [noise]\n\n\n\n[noise]\n\n\n\n\nYou're with the Alexander thank you for listening this is Janice\n[noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. room for the Georgia Public broadcasting radio network [noise]\nFor MORNING EDITION and on second thought to political reminding all things considered splits their support makes everything you hear on TV possible if we didn't hear from you during our fault fungi your contribution now still make a difference [noise] please take just a couple of minutes to support the programs you rely on them\nEnjoy on ... and do your part now at whatever level is right for you\nGood at ... dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\nDecades before calling her neck in the midst of the AIDS epidemic Nike ran an ad campaign featuring a man named break\nI said why are they going to somebody like me but then I answered the question because there's really not a whole lot of people who are HIV positive and who are marathon runners this week on only again socially conscious of advertising for shoes join us\nThis morning at seven urine G. P. B.\n\nFly from NPR News in Culver City California I'm ... cent hurricane Michael category for storm that made landfall over the Florida Panhandle this week before moving north to jump heavy rain on Georgia the Carolinas and Virginia\nThe storm is destroyed some communities Appalachian coal and each point and Florida are home to the states seafood industry NPR's Greg Allen visited both cities and has more\nAll along the panhandle several counties are almost totally without power still and that's the case certainly in Franklin County where Appalachia colonies point or there's no power\nIt's more all along the panhandle several counties or almost totally without power still that's the case certainly in Franklin County ... point or there's no power very limited cell phone service without power many people don't have water because they have wells\nSo it's a situation that's not good they haven't really she received much help yet we're seeing a lot of trucks come through the power company trucks other emergency crews going\nTo reach the really badly affected areas port saint Joe and Mexico beach so they're they're driving through ... on that way so people there are a little frustrated they're not getting the help yet they know what's coming in\nAnd they're willing to wait while their neighbors really need help in Mexico beach in Port saint Joe gets give their aid\nPresident Donald Trump within Ohio friday night campaigning for Republicans ahead of the mid term elections Trump spoke to an overflow crowd at work Warren County fairgrounds northeast Cincinnati from member station ... they'll Reinhardt reports\nThe president invoked the names of several prominent Democrats while promoting Republican candidates in Ohio all races they see fellow Democrat [noise]\nThey didn't show [noise]\nThey will try to raise your taxes impose socialism on this country\nAnd take away your jobs President Trump boasted of low unemployment rates in the revival of some steel and coal companies since and acting terrorists for NPR News I'm Bill Reinhardt in Lebanon, Ohio\nThe Trump Administration today formerly opposed to draft a planned trip farm Chicago's police force center federal court supervision attorney general Jeff Sessions also said he sending five additional federal prosecutors to the city as NPR's Eric Westervelt reports\nSessions said the prosecutors will create a gun crimes prosecution team that he hopes will expedite prosecutions in the city's most violent neighborhoods sessions also formerly opposed a draft plan between Chicago and the state of Illinois that outlines far reaching police reforms under federal oversight including stricter rules on the use of force\nSessions called that plan dangerous and blamed quote unjustified restrictions on policing for the city stubbornly high gun murder rate\nChicago's homicide rate has dropped the past two years after hitting a twenty year high in twenty sixteen Mayor Rahm Emanuel was called the administration's move to oppose the oversight deal quote further proof that they're out of step with the people of Chicago and out of touch with reality Eric Wester this is NPR\nIt was moved to oppose the oversight deal further proof that they're out of step with the people of Chicago and out of touch with reality Eric Wester\nThis is NPR News\nThe FBI is investigating a major security breach at Facebook the attack was detected in late September but the FBI is us the social media platform not to disclose that the suspect NPR's Jasmine Garsd has more\nHackers initially stole access to four hundred thousand accounts then the hackers topped those users friends' lists snowballing the tall took thirty million Facebook users who's information has been compromised emails phone numbers and recent search history where exposed\nGuy Rosen overseas safety and security for Facebook he says\nWe have a tree in our health center that people can now used to see whether they were affected what information may have been access\nThat tool is not easy to find a better bats do a Web search for Facebook newsroom Jasmine Garsd NPR News New York\n[noise] rising tensions in the lead up to Brazil's presidential election had been linked to several violent hate crimes according to a S P news agency supporters of leftist candidate Fernando ... had been targeted\nIn one case a woman had a swastika carved into her flash by supporters of far right presidential candidate shy Airbus neuro\nBrazilian association of investigative journalism has also recorded more than sixty physical attacks from reporters\n... has been leading in the polls in Brazil and has promised to reduce crime however ... comments during the campaign which have insulted women ethnic minorities and people who are gay incite violence I'm Senate and sent NPR News in Culver City California\nSupport for NPR comes from the Charles Stuart ... foundation supporting efforts to promote or just equitable and sustainable society and it's home town of Flint, Michigan and communities around the world or at ... dot org and\nThat listeners who support this NPR station welcome to G. P. B. jazz id Alexander thanks so much for joining me\n\n... ...\nI ... I think the\nA year down not\nAbout the long run around I got to get a lot of times\n\nI'm a dog ...\nMan and\n\nAh near a ban on my travels by a\n... live ... ...\n\n... ... ... I I\nMean ... ...\nHave on me and my mom my mom\n... by\nMy phone to\nMary from\nMan I'm\nAre there are ...\nA\nDay right so the meaner than members\n[noise]\nUm ... ... ...\nAh in\nThe ... to I'm Sorry\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nBe [noise]\n[noise]\nLindsey blaring his quartet all west all day his own mind to Wes Montgomery with a song that I remember my mother playing when I was a child bumping on sunset one of my favorites before that\n... Nielsen and John Powell heard from their project after us\nShe's a flower is he's the pianist and the name of the track how to keep moving how to stay\nNext up the latest Trump campus springs from her project indigo unsophisticated featuring right heart grow up\nThis\n\nOn stage ...\nDo this but the\nTo ...\n\n\n\nDa da da da\nDa da da da\nDa du da ...\nDa da da\nDa da da da da da da\nDa da da da da\nDa da da da da da da\n\n[laughter] you with the Alexander and this is Jeff\n[noise]\nNinety seven point seven FM WG P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\nThis fall we're counting on the participation of everyone's who listens to cover the rising costs of programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution to go to ... dot org and click donate at the top of the page\nYour contribution at whatever level is right for you wild cover the cost of the programs you love on cheap ...\nThank you so much for your support of Georgia Public broadcasting\nRecovering after Michael will have the latest on the storm devastated Marge Schott the Bush to Nineteen eighty six fire destroyed the LA public libraries Susan Orlean on the on the shoulder mystery that didn't just destroy books\nLibraries feel like these big collective brains because they have the memories and stories of the whole culture inside\nThem Saturday on weekend edition from NPR News new and as for weekend edition this morning from eight to ten right here on TPP\nLie from NPR News I'm Culver City California I'm Shannon Ben sent\nThe death toll from hurricane Michael is now at least Thirteen\nThe law enforcement and rescue personnel expect that to rise as they move into some of the hardest hit communities and the Florida Panhandle and the town of Mexico beach where Michael roared ashore this week as a powerful category for storm with a hundred and fifty mile and a hundred and fifty five mile an hour winds the devastation is extensive\nAnd parents Joel Rose has it's going to be some time until things her back to normal\nI think the concern here is sort of long term can people live there I mean there's\nNPR's Joel Rose has it's going to be some time and tell things are back to normal\nI think the concern here is sort of long term can people live there I mean there's no power and it seems like not really any great chance of power being restored in the near term I mean I think we're looking at weeks if not months given sort of the scale of damage that I'm hearing about\nMental powers are stored there's also no water throughout the city there's no cell phone service in general communication is still just like a huge challenge\nNPR's Joel Rose Florida emergency officials say they rescued nearly two hundred people and inspected thousands have structures President Trump welcome the release of an American pastor who was held for more than two years in Turkey and Paris Scott Horsley reports ... expects to greet pastor Andrew Brunson at the White House this weekend\nTrump says he expects Andrew Brunson to get a full checkup in Germany on his way home to the United states but he thinks the American pastor is in good shape Brunson was arrested in twenty sixteen as part of a round up following the failed coup attempt against Turkish president Recep Tayyip Irwin\nWere very honored to have him back with us he uh\nHe suffered greatly but we're very appreciative\nDo a lot of people a lot of people\nTrump's his administration made no concessions to turkey in exchange for Brunson released spokeswoman says the administration remains deeply concerned about the continued detention of other us citizens in Turkey and around the world Scott Horsley NPR News the White House\nVice president Joe Biden headlined a fish fry and political rally in rural Kentucky on friday he was trying to give a boost to retired Marine fighter pilot Amy and harassed\nWho's in a tight race against the term Republican congressman Andy bar as Kentucky Public Radio's ... Barton reports President Trump's slated to pay a visit to the district on Saturday\nAmy McGrath was the first woman to fly an F. Eighteen into combat now she's one of Democrats top hopes for flipping a seat in the house at the rally biding went after Trump hard saying the president's spread the message of hate and intolerance\nElections quiet life is not\nOur basic American values under a\nTrump will appear at a rally on Saturday on behalf of incumbent Andy Barr Kentucky six congressional district includes both urban Lexington in the foothills of Appalachia recent polling shows the race is a toss up for NPR News I'm Lynn Barton\nThis is NPR News\nAnd the foothills of Appalachia recent polling shows the race is a toss up for NPR News I'm Lynn Barton\nThis is NPR near U.S authorities now say Canadians involved in the candidates business won't have trouble crossing entity last as long as it's for personal travel as Dan carbon Chuck reports the revised policy comes chess before recreational marijuana becomes legal in Canada\nIn a statement the U.S customs and border protection agency says there shouldn't be any issues for Canadians employed in or who invested in the marijuana industry as long as the purpose of their trip is not related to that industry previously Canadians had been told that any travelers with a connection to the pot business could face a lifetime ban from the U.S\nCanadian officials say they're grateful for the clarification other restrictions however remain anyone bringing cannabis into the U.S could be denied entry find or even arrested as they gave us federal law to possess producer distribute recreational and medical marijuana\nOfficials in Ottawa say they will be signs of educational material to remind travelers are the consequences\nFor NPR News I'm Dan carpet truck in Toronto\nRussian officials are investigating the cause of a so huge rocket break down which forced to make an emergency landing about Ninety seconds after lunch\nAnd American and a Russian cause but not on board the rocket are in good health the two crew members were heading for a six month mission on the international space station when an emergency escape system kicked in separating the crew capsule from the rocket\nThe capital to play parachutes and took about thirty four minutes to reach the ground it landed and Catholic stand about two hundred and fifty miles from the launch site [noise]\nI'm Shannon ... NPR News in Culver City California him\nSupport for NPR comes from NPR stations other contributors include Newman's Own foundation\nWorking to nourish the common good by donating all profits from Newman's Own food products to charitable organizations that seek to make the world a better place more information is available at Newman's Own foundation dot org\nWelcome to G. P. B. jackass I the Alexander thanks so much for joining me [noise]\nOn on on the\nPhone to build a bomb or a\nWrong on both\nBlonde on my own on her own little along a\nLittle ... little\nBaby ...\nAre out on the lookout\n[noise]\n[noise] do that on\n\n\n\nYou know a\nMm\n[noise]\n[noise]\nOr\n\n\n[noise]\nComposer ranger Alto saxophonist cloud and clarinet is myth Amanda garde with her composition revolving door from infancy and before that the music of music the water\nFrom their album reflections we breathe it blank here's little Jimmy Scott everybody's somebody who\n... by\nA man\n\nSome\n... ... I'm ...\n... ...\n... ... ... ... a\nLaundry them man\nYoung ...\nNo no no the\nA big yeah a\nLittle ... well\n... ... ...\nNa na na\nNa\n\nNa na\nNa na\n... ten ... yeah oh\n... them but\nLot of ... them\nA ... a\n... ... yeah\nWell I\nAgree\nA lot a\n\n\n[noise]\nNinety seven points double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered once you ... if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nWe think a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your general supportive G. P. B. and the service we provide every day [noise]\nThis week wait wait don't tell me give you what you've always needed a break from the new astronaut Scott Kelly tells us why you need to double ... wouldn't floating in space and then he fell ill reveals from those challenging role mobsters and we hear ... of the exploding lives on\nA bitter said will join us for a mini vacation for your soul on the news quiz you from NPR News\nThis morning it said on GB\n\nLive from NPR News in Culver City California I'm Shannon dance dance the fate of a Saudi journalist and prominent critic of Saudi Arabia its government remains a mystery Jamal ... disappeared after entering that sell the consulate in Istanbul, Turkey last week\nTurkish officials are accusing Saudi Arabia as killing ... inside the consulate\nSaudi Arabia's crown prince and other Saudi officials insist could show gate left the conflict freely President Trump said on friday he would call ... ... the prince his father had about the disappearance [noise]\nThe crown prince says vowed to open up Saudi Arabia to him\nPresident Trump said on friday he would call king Solomon the princess father about the disappearance [noise]\nThe crown prince has vowed to open up Saudi Arabia to increased foreign investment but on friday British businessmen Richard Branson said he had stopped talks with Saudi Arabia over to tourism projects in the country and one billion dollars of investment by Saudi Arabia and his company\nHe said ... disappearance could change the ability of anyone and the west to do business with Saudi Arabia\nHurricane Michael a category ... storm slammed into the Florida coast this week emergency officials continue to fight blocked roads to bring relief to hard hit areas of Florida's panhandle including Panama City and Mexico beach W. S. U. S. rained daily reports\nFollowing hurricane Michael Franklin counties tiny East Point community was completely without power on friday day three of the outage big top supermarket is the only store in the area to get some power back from generators on friday owner Kennedy Shriver grilled the remaining me from his store for a free barbecue to feed the neighborhood\nWere trying to get over it was in the back there so we had it that bringing them back and\nFinish bringing it and say\n... storm surge put three inches of water into business less than two hours away in Tallahassee and nearly Seventy five thousand utility customers were without power at the end of the week for NPR News I'm Ryan daily in East Point in Florida\n... continues to spread to an eastern region of the Democratic Republic of Congo with at least a hundred and sixty five people infected so far\nAnd figures released friday by the world Health Organization point to a kind of turning up taking new cases NPR's Nurith Aizenman reports this outbreak was declared on August first and by the end of that month it seemed that health workers had battled the virus to a sort of draw\nThe number of people newly infected each week was no longer spiraling upwards but the virus was still spreading tour around seven to ten people a week\nBut this latest trend line shows that more recently the new caseload has started topping thirty a week and officials say the numbers are likely even higher because they've had a hard time operating and many locations where they've been frequent clashes between rebel groups and government forces [noise] and this is NPR News\n\nRising tensions in the lead up to Brazil's president\nBeen forces [noise] this is NPR News\n\nRising tensions in the lead up to Brazil is presidential election had been linked to several violent hate crimes according to the AFC news agencies supporters of leftist candidate Fernando ... had been targeted in one case the woman had a swastika carved into her flash\nBy supporters of far right presidential candidate ... Brazilian association of investigative journalism has also recorded more than sixty physical attacks on reporters ...\nHas been leading in the polls in Brazil and has promised to reduce crime however some say his comments during the campaign have incited violence\n[laughter] the Republican candidate for governor in Pennsylvania has posted a video to Facebook threatening to stomp all over his opponents face with golf spikes\nThe ap was posted as both Scott Wagner the Republican candidate and governor Tom Wolfe a Democrat have debated the level of civility in American politics Trump has recently like in democratic protesters during confirmation hearings for Brett Kavanaugh to 'em up\nBy friday afternoon Wagner video had been viewed over twenty thousand times a recent poll shows Wagner trailing wolf by twenty two point\nFree gaining ground in Pennsylvania is a key priority for Democrats who lost a state to Trump and the twenty sixteen presidential election [noise]\nAnd China the Hong Kong government has moved to disqualify democracy advocate from running for a seat on the city's legislature I'm Shannon ban sent NPR News in Culver City California\nIreland was one of four countries to be in\nSupport for NPR comes from NPR stations other contributors include the corporation for public broadcasting envious state of Joan clock who's ... served during investment in the future of public radio and the rubber ...\nYou're listening to G. P. B. jazz on Georgia Public broadcasting I'm Dee Alexander\nTo\n\n\n\n\nYou know that is\nLa\n\n...\n... ...\nOh\nYeah well you know me\nIt was ... oh one of those\nWho\nKnow\n\n\nMe\nBit ...\n\n\nDo you ... you ...\nWhere\n...\n... with you\n\n\nKnow\nThere's the\n... na\n\n\n\n\nWhere\nYou\nWhere you\n\nWould be a little\n\n\n[noise]\n\n[laughter]\n\n[laughter]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n... ...\n... ... ... ... ... ...\n\n...\n... ... ...\n...\n... ...\n... ...\n... ... ...\n\n\n...\n\n\n... ... in\n\n\n\n\nLa ...\nDe\nLa la\nHa ha ha ha ha\nHa\nHa\nHa ha ha ha ha ha\n[noise] now how beautiful is that what Philips and friends from one morning in Maine dying they dream beautiful do ... with west Phillip\nAnd Andy Brown on guitar\nAnd before that more beautiful music from Jim Galloway toes jak string clean tend to pick the ad featuring vocalist Cheryl will fit in with the ... story is composition reviews of a secret\nI'm Nat King Cole and meet with the London studio orchestra\n[noise]\nA\n\n...\n... leaves\n\n... a\n\n\n\n[noise]\n\n[noise] [noise]\nWas Ninety seven point seven FM double your gp B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nMORNING EDITION it on second thought to political rewind and all the heat that are split their support makes everything\nYou hear on TV possible if we didn't hear from you during our fault fungi your contribution now still make a difference [noise] please take just a couple of minutes to support the programs you rely on them enjoy on the TV and do your part now at whatever level is right for you\nGood a G. P. B. dot org and click donate and thanks so much for your support of Georgia Public broadcasting [noise]\nRecovering after Michael will have the latest on the storm that devastated parts of the south east plus a Nineteen eighty six fire destroyed the LA public libraries Susan Orlean on the unsolved mysteries that didn't just destroyed books\nLibraries feel like these big collective brains because they have the memories and stories of a whole culture inside them\nSaturday on weekend edition from NPR News new and it's for weekend edition this morning from eight to ten right here on TPP\n\nFly from NPR News in Culver City California I'm In advance and hurricane Michael category for storm made landfall over the Florida Panhandle this week before before moving north to dump heavy rain on Georgia the Carolinas and Virginia\nAs farmers destroyed some communities Appalachia cola and East Point and Florida are home to the states seafood industry NPR's Greg Allen visited boats\nIn Virginia as farmers destroyed some communities Appalachia cola and East Point and Florida are home to the states seafood industry NPR's Greg Allen visited both cities and has more\nAll along the panhandle several counties or almost totally without power still mess the case certainly in Franklin County ... colonies point or there's no power very limited cell phone service without power many people don't have water because their wells so it's a situation that's not good\nThey haven't really she received much help yeah we're seeing a lot of trucks come through power company trucks other emergency crews going\nTo reach really badly affected areas port saint Joe and Mexico beach so they're they're driving through a ... on the way to people there are a little frustrated they're not getting the help you know what's coming in\nAnd they're willing to wait while their neighbors really need help Mexico beach in Port saint Joe gets ...\nPresident Donald Trump within Ohio friday night campaigning for Republicans ahead of the mid term elections Trump spoke to an overflow crowd at the Warren County fairgrounds northeast of Cincinnati from member station WBHM VX you they'll Reinhardt reports\nThe president invoked the names of several prominent Democrats will promoting Republican candidates in Ohio all races see fellows humid down my throat [noise]\nTaken [noise]\nVery well try to raise your taxes impose socialism on this country\nAnd take joy jobs President Trump boasted of low an employment rates in the revival of some steel and coal companies since an acting terrorists for NPR News I'm Bill Reinhardt in Lebanon, Ohio\nFormer vice president Joe Biden made a campaign stop in Kentucky on friday to rally support for a political newcomer and hotly contested congressional race Kentucky sixth district spans from Lexington like sing tend to parts of Appalachia\nCheri Lawson at member station W. E. K. U. reports it's one of the seats the Democrats are hoping to flip in November ... [noise]\nAn overflow crowd of more than two thousand cheered as retired Marine pilot and kind of colonel Amy McGrath welcome by the community fish fry annoying bell\nThe former vice president praised McGrath military record of eighty nine combat missions and called her run for Congress her ninetieth mission Biden said character is the single most lacking commodity for many of those serving us in the U.S Congress today\nIt was the most important thing to name he brings tradition\nThis is the single most lacking commodity for many of those serving us in the U.S Congress today\nAnd for me bring this march [noise]\nPresident Trump is scheduled to stump for the incumbent congressman Andy bar on Saturday\n[noise] this is NPR News at the end of a brutal weak on Wall street stocks mounted a partial recovery friday and feedback nurses the Dow Jones industrial rose while the U.S and the five hundred and announced that composite also gained ground\n\n[noise]\nRising tensions in the lead up to Brazil is presidential election had been linked to several of violent hate crimes\nAccording to the a P news agency supporters of leftist candidate Fernando ... have been targeted in one case a woman had a swastika carved into her flashed by supporters of far right presidential candidate John ...\nA Brazilian association of investigative journalism has also recorded more than sixty physical attacks from reporters both in our own has been leading and the polls in Brazil and has promised to reduce crime however some say his comments during the campaign which I consulted women ethnic minorities and people who are gay incite violence\nThe Hong Kong government disqualified a democracy advocate from running for a seat on the city's legislature Hong Kong as a former British colony that was returned to China in Nineteen Ninety seven\nHalf of Hong Kong's legislature is directly elected but efforts to expand democratic elections beyond that have not been successful\nHong Kong government officer told that democracy advocate that she was an eligible to run into November special election democracy activists have protested the barring of candidates and remove all elected lawmakers who question Hong Kong's future as a part of China [noise]\nI'm Shannon been sent NPR News in Culver City California id Alexander you're listening to G. P. B. jazz on Georgia Public broadcasting\n\nA\n...\n\nOr\n\n\n\nHa ha ha\nMm Mm\n\nNa\n[laughter]\n\n\n\n[noise] she [laughter] she [laughter] she [laughter]\nThis guy and\n\n\n\n\n\nHeard that song just give me chills what color is love\nFrom Perry Collier born in Chicago may twelfth Nineteen forty five and he died October twenty seven Ninety two thousand and twelve I'm Sorry at the age of sixty seven he was a singer songwriter and also a computer programmer at the University of Illinois\nAnd he also played guitar and piano and was a fabulous local is as you just heard born on the north side\nUniversity of Illinois and he also played guitar and piano and was a fabulous local is as you just heard born on the north side of Chicago raising the Corrine green housing projects and they just recently had a naming ceremony in his honor [noise]\nUm some of his childhood friends were Curtis Mayfield major Lance er and Jerry Butler\nAnd he has left\nAn indelible impression in the musical community and such a wonderful body of work he has left for us to enjoy Mr Terry Collier music coming up next from Kamasi Washington from the ethic and this is ask him\n\n...\n...\n... ...", "show_name": "GPB Jazz", "year": "2018", "city": "Chatsworth", "day": "13"}