{"month": "10", "state": "GA", "station": "WNGH", "content": "\n[noise]\nIf listener supported gp ratio and ate the station surface of Georgia Public broadcasting news from NPR's next minute G. P. B. J. morning hours bungee Phoebe [noise]\nWhen a life hangs in the balance what goes beyond a reasonable doubt really mean\nTroy Anthony they don't charge them all on my mind that I'm very\nGPA be present the radio boy beyond reasonable doubt Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis\nJoining us at ten am on Sunday October twenty first on gp the radio [noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across south west Georgia a full list is available at ... dot G. A. dot Gov\nDisaster recovery centers are open this weekend and Dorothy early Miller and Seminole counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster assistance process and answer any questions\nFor times in locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one thirty three sixty two survivors and Baker Decatur\nDoherty early Miller seminal Chris Grady Lee Mitchell Terrell Thomas and worth counties are eligible for disaster assistance through FEMA\nThose survivors should file claims with their insurance companies burst then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen\nLive from NPR News in Washington I'm Jim hawk\nAs the world reacts with skepticism to the Saudi explanation of the death of writer ... during an alleged fist fight inside the Saudi consulate in Istanbul President Trump is vowing to hear directly from Saudi Arabia's crown prince Mohammed bin Salman\nAl ... a lot of progress being made\nI'm going to hear directly from Saudi Arabia's crown prince Mohammed bin Salman\nIs making two officers vary a lot of progress being made that will have an answer by probably there's there's\nGermany's foreign minister is the latest to say that it's time to rethink the sale of arms to Saudi Arabia something that President Trump wants to avoid\nHundreds of thousands of protesters poured into London Saturday demanding a final say on the terms under which Britain leaves the European Union as NPR's Frank Langfitt reports from London many Britain's are deeply unhappy with breaks up negotiations which are at a stalemate and running out of time\nBut the merger saying the breakfast was promise which included pledges of extra money for health care is turning into a disaster for the United kingdom the European Union's rejected prime minister Theresa May's plans for leaving the u._s. have many in her own party in the case now at risk of crashing out of the European Union with no deal for a future relationship\nSome protesters wanted to stay in the EU others hope there will be a deal but want to see the details before signing off by Mr may however has rejected holding another public vote which breakfast here say would be anti democratic Frank Langfitt NPR News London\nAfghan officials say voting will extend into a second day in parliamentary elections after delays in some districts on Saturday Jennifer glass reports from Kabul on the chaotic start to the long awaited elections\nMany polling stations in Afghanistan like this ... middle school and that technical logistical problems that delayed voting or prevented it altogether polling centers that couldn't operate today are set to open Sunday the latest complication in a parliamentary election that was supposed to take place three years ago\nIn Kabul there've been a number of explosions and the Taliban and Islamic State's threatened voters to stay away but despite problems that included flawed voter list and long lines many Afghans appear determined to cast their ballots saying they'll wait as long it takes for NPR News I'm Jennifer glass in Kabul\nThe Milwaukee Brewers ran out of luck and the deciding game seven of the national league championship series Saturday Night\nThe Los Angeles Dodgers pulled away on the sixth living beating Milwaukee five to one of the Dodgers seal the deal and the ninth inning sending their star pitcher Clayton ... pitch in relief and complete the final three outs\nBoston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park\nA complete the final three outs Boston what your earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park game Tuesdays in Boston Wednesday night and moved to LA for game three on friday\nThis is NPR News\nThe Trump Administration is trying to speed environmental review of western projects that deliver federally subsidized water to farmers NPR's Kirk Siegler reports a new memorandum from the president aims to loosen environmental restrictions in western states\nRepublicans going back to the George W. Bush administration has tried to increase water deliveries to farmers in California's massive Central Valley project or water from snow fed reservoirs gets pumped south to arid farmland but those deliveries are perennially cut back due to attempt to protect endangered fish and throughout\nThe president's order would speed up the current review of this as well as to other projects in Oregon and Washington\nIf environmental restrictions are loose and there will likely be a long legal battle and one of the biggest champions of this latest plan is deputy interior secretary David Bernhardt used to lobby for the Fresno based west ones water district one of the largest and most influential water agencies and the west Kirk Siegler NPR News\nTo tropical storms are swirling and the Pacific ocean off Mexico and one is forecast to become a hurricane and approach the country's west coast in the coming week tropical storm willow is the twenty first name storm of the Eastern Pacific hurricane season\nThe national Hurricane Center said it was likely to remain well off the coast through Wednesday when it could approach Mexico's west central mainland as a hurricane tropical storm ... foreign friday off the coast of the southern state of Chiapas it could produce three to six inches of rain along Mexico's southern Pacific coast and parts of\nGuatemala [noise] I'm Jim ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online they'd Kaufman dot org\nI'm Dee Alexander you are listening to ... on Georgia Public broadcasting\n\n\n\n\nThe bank\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\nAnd\n\nUp to ...\n...\n... ...\n\n\n\n\n\n\n\nThe alec relate big band from cloth that was Dan six eight and before that Mr Aaron Goldberg crime at the age of the world would point CNN [noise] here's this Damone Crump stain\n\nCrime Herbie Hancock possibilities are really nice funky version of thing has to move and you've heard it right here on jak with the Alexander ...\n\n\n\n[noise]\n... full or from diamond cut that was the coming with Terri Lynn Harrington and Jack the Jeannette on drums and percussion along with Dave Holland base Adam Rogers guitar and Sam yeah hell on Oregon\nBefore that basis Amanda ... this is what happened for mental note charred all\nMixed up music from a vocalist by the name of I may Allen her on her album is entitled wings on caged and let's take a listen to democracy how harmony and descendants\n\n\nWill do a\nNo the boys do we\nIdeals no longer\nThey just\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. GBH leave room for the Georgia Public broadcasting radio network [noise]\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across south west Georgia a full list is available at Gina dot G. A. dot Gov\nDisaster recovery centers are open this weekend and Doherty early Miller and Seminole counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster assistance process and answer any questions\nFor times locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one thirty three sixty two survivors and Baker Decatur\nDoherty early Miller's seminal Chris Grady lead Michel ... Thomas and worth counties are eligible for disastrous system through FEMA\nThose survivors should file claims with their insurance companies first then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty four\nLive from NPR News in Washington I'm Jim ...\nWorld leaders are skeptical of Saudi Arabia's explanation involving the death of writer ... the Saudis claim he died after a fist fight Anthony Cordesman of the center for Strategic and International Studies says this is an opportunity for the United states to make a stand for human rights\nMain breaking relations ending economic card ignoring our security but I think\nSo I used to make a stand for human rights\nThat doesn't mean breaking relations ending economic card\nIgnoring our security and true but I think it does mean that goes for media laws on government in the United states and was ruining they could go on this incident\nAnd make it clear to everyone in the area that this kind of operation is going to get government officials involved into very deep international criminal\nCourt has mental those those turkey has actually arrested more people and made more disappeared and Saudi Arabia has in the past few years\nThe presidents of Honduras Guatemala met Saturday trying to come up with an emergency plan for dealing with a thousands of migrants from their countries now on the Guatemala Mexico border Maria Martin reports\nOn during president ... and what the mother and head of state Jimmy Morales Mitt at an air force base in what am I the city\nAfter conferring by phone with Mexico's president they announced what they called ... that don't ... the safe passage plan whereby the migrants would be transferred back to Honduras some by bus and others with health issues by plane\nFight them urgency shelters have been set up along the way according to some reports up to five thousand migrants entered what a mother from Honduras with hopes of reaching the U.S\nMany have already been returned to their country others are still trying to cross the porous border into Mexico any way they can for NPR News I'm ... and\nThe U.S Supreme Court has blocked the mass of climate change lawsuit brought by young environmentalist plaintiffs in the case who range in age from ten to Twenty one argue the government has failed to protect natural resources is a public trust for future generations\nDespite knowing for decades that fossil fuels we're causing climate change NPR Shannon Vance and reports\nChief justice John Roberts signed the order marking a victory for the U.S government which has tried for years and are both the Obama and Trump administrations to get the case dismissed the lawsuit was filed in twenty Fifteen and it's sponsored by an Oregon based nonprofit called our children's trust\nIt seeks to phase out fossil fuels that caused climate change\nIn court filings the federal government has said the lawsuit is unconstitutional and that these issues should be left to the political branches of government to resolve not the courts\nThe high court's block is temporary and it will freeze the trial for ten days in federal court until lawyers for the activists provider response\nSports the high court's black is temporary and it will freeze the trial for ten days in federal court until lawyers for the activists provider response tenant and sent NPR needed Washington\nThis is NPR News\nA drug that harnesses the immune system to fight cancer can help women live longer has they fight a particularly bad form of breast cancer NPR's Rob Stein says that's according to new research released on Saturday\nThere is that type of breast cancer called triple negative breast cancer that's notoriously deadly it's especially common among African American women\nResearchers tried combining a drug that on leashes the immune system with the standard chemotherapy drugs in a study involving four hundred and fifty on women with triple negative breast cancer they found that to drug combination significantly prolong the women's chances of survival\nThe results were presented a scientific meeting in Germany and published online by the New England Journal of medicine Rob Stein NPR News\nLos Angeles Dodgers reached the world series or the second straight year beating the Milwaukee Brewers five to one Saturday Saturday Night in game seven of the national league championship series\nIt's off to Fenway Park for a showdown against the Boston Red Sox and game one of the world series on Tuesday Los Angeles hasn't won the world series since Nineteen eighty eight [noise]\nThe mega millions lottery may see a streak of twenty five jackpot rollovers end as it heads toward her record one point six billion dollar drawing on Tuesday based on sales projections Seventy five percent of the three hundred two million possible combinations will be chosen for Tuesday's drying\nUp from just over fifty nine percent and Fridays dry\nThe mega millions jackpot has been growing since July when a group of California office workers won five hundred forty three million I'm Jim ...\nNPR News in Washington\nSupport for NPR comes from the ... foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at ... dot org and listeners like you who donate to this NPR station\nWelcome to G. P. B. jackass and the Alexander thanks so much for joining me\nUm [noise]\n\nUm [noise]\n[noise]\n[noise]\nSunday he'll come on\nMan and you\nHe'll be big and true\nWhen he comes my way [noise]\nDo my best\nNews [noise]\nAnd look at me and my\nIn a little one\nKnow it seems so [noise]\nHave been a\nWill bizarre little hope\nMen fought\nFrom which I never\nGoing to [noise]\nI ever saw the news\n\n\n... when\nGoing to\nTo be\nTo do\nDo the\nApple bonds\nAnd\nDo do do\nThe ...\nThe ...\nGoing on\n...\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\nAll\n\n\nThe time with his tribute to ... that were mailing and he's a company by\nThe times with his tribute to Bobby ... then that was Milly and he's a company by\nAdam Coker on tenor bill O'Connell piano Peter Washington based John Reilly on drums with Steve hops on by and before that\nAll about that they see the Count Basie orchestra directed by Scott Barnhart with don't worry about me featuring Kurt Ellen\nEars Dinah Washington and book Benton you've got what it takes baby [noise]\nYou just don't want to be there\nYou go to the to do\n... ... ... ... ... ... ...\nWho who who can boom boom boom boom [noise]\nAnd [noise] ...\n[noise]\n\nLong\nNeeds\n\n\n[noise]\nThis was Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n[noise]\nYou know selling a car can be a hassle but donate again as a whole different story but I was taking off your hands or off your driveway and turn it into public radio and maybe even a tax deductions to resolve the host of marketplace in here is how to do\nEight seven seven GP be one car or donate securely on line a G. P. D. dot org slash cars and thanks [noise]\nSaudi Arabia's home if they were just struggling to strike a Brexit deal with time running out and the creator hit show transparent on allegations against ... dark I really wish I would have immediately\nJumped to supporting them and telling their stories rather than going into protection about all that and the countdown to election day Sunday\nOn weekend edition on NPR News I'm doing this for weekend edition this morning from Asia can hear on TV and online at gp news dot org\nLive from NPR News in Washington I'm Jim ... in Guatemala around Fifteen hundred mostly Honduran migrants are sleeping on a bridge that separates the country from Mexico and some of the green reports they were part of the caravan of Central American migrants trying to reach the United states\nAround four thousand migrants reach the Guatemalan city up to ... line this past week with the goal of crossing over into Mexico but the Mexican government refused to let the vast majority pass now around Fifteen\nDo you have to go along this past week with the goal of crossing over into Mexico\nBut the Mexican government refused to let the vast majority pass\nNow around Fifteen hundred migrants from that caravan remain camped out on the bridge hoping Mexico will change its position the conditions on the bridge are bad there's no bathrooms and heaps of trash are everywhere the other kids are sleeping on the sidewalk alongside their parents\nStill many of them I have no timeline for leaving and say they will keep trying to reach the U.S for NPR News I'm Emily Green and to Qunu on Guatemala\nCongressional leaders in the United states and leaders across the world are reacting with skepticism to Saudi Arabia's claim concerning the circumstances of the death of journalists ... NPR's murder reports\nAccording to the Saudi Government could show she died in a brawl on the Saudi conflict and assemble but officials initially claimed that the journalists walked out of the consulate alive democratic representative Adam Schiff of California I told the New York times he's received a classified briefing about the circumstances and the Saudi version doesn't match up\nRepublican Senator Lindsey Graham tweeted last night quote to say that I Am skeptical of the new Saturday narrative about Mr ... is an understatement unquote\nGerman Chancellor ongoing Merkel called the Saudi explanation quote inadequate in a statement world leaders have chimed in throughout the day with their own statements demanding further investigation Clara ... NPR News\nMore than a week after hurricane Michael hit the Florida Panhandle tens of thousands of people are still without power NPR's shouldn't have been sent reporters\nMost of the outages are in Bay county and northern Florida near the border of Alabama and Georgia residents say they're using candles flashlights after dark and generators to power air conditioners most of Florida's electricity sources are outside the area's most impacted by the storm and remain intact\nBut the hurricane destroy the transmission lines substations and utility poles connecting those sources to customers Gulf powers says it has more than a thousand employees working on restoration and in the meantime authorities are warning residents to stay away from downed power lines Shannon then sent NPR News\n... people took to the streets and two dozen cities across Brazil on Saturday protesting the candidacy of far right presidential candidate ... showed him not him large crowds spilled avenues and squares a week before the circuit Rome voted pools are just all sorts\nSo they're all kind of the ... are all shouting not him large crowds spilled avenues and squares a week before the second round vote to poll suggests also now is likely to win this is NPR News\nThe tiny Balkan country of Macedonia is one step closer to entering NATO and the European Union after its parliament approved changing the country's name Joanna Kakissis reports from Athens but the prime minister of neighboring Greece so it was the name change will end the long dispute between the two Balkan countries\nGreece has blocked Macedonia is entering into NATO and the EU for nearly Thirty years because Greek nationalist since it's been a Macedonia is Greek\nThe foreign minister of Greece Macedonia settled on the name north Macedonia this summer two thirds of the Macedonian Parliament voted for the new name last night but it must now be approved by the Greek parliament it will be a tough sell their\nPoliticians in Greece have long he was the name issue is a way to whip up popular support to win votes those politicians include the defense minister a nationalist too early this week forced out Nicholas cuts he asked the foreign minister who negotiated the name change deal for NPR News I'm Joanna Kakissis in Athens\n[laughter] the Milwaukee Brewers ran out of luck and the the site in game seven of the national league championship series Saturday Night\nThe Los Angeles Dodgers pulled away on the sixth inning beating Milwaukee five to one the Dodgers sealed the deal and the ninth inning sending their star pitcher quake Kirsch a pitch in relief and complete the final three outs\nBoston which earlier one the American league championship series will host the Dodgers in game one of the world series on Tuesday night at Fenway Park game to stays in Boston Wednesday jock NPR News in Washington\nSupport for NPR comes from NPR stations other contributors includes the air and Nevada Brewing Company\nFamily owned operated and argued over since Nineteen eighty proud supporter of independent thought whether that's on line over the air or in a bottle more at Sierra Nevada dot com\nWelcome to gp jazz I'm the Alexander thanks so much for joining me\n\nFor\nWhile there ain't no you were you in\nThey're crazy then the only way not to not have\nTo enjoy them\nMen came at a new one\nThere and know their phone so\nNight and day during the ... the only way\n\n...\n... ...\nPretty busy [laughter] the\nBoom boom boom boom\nOn\n[noise]\n\n... ... ...\n... ... ... ...\n...\n... ...\n[noise] or\n\n\n\n\n\n\nThe show they\nLive on much for\nThey've been\nShedding any\nThe daddy down all\nThat\nShe\nDid\n\n\nThe daddy down\n\nOh what a wonderful memory so my mom playing her music on her stereo or high fives they called it back then\nThe wonderful voice of Esther Phillips from and I love him with his on them and before that the latest from Marcus Miller laid black and that was\nFor ... bunnies dream featuring the voice of Jonathan Butler up next the music of Mr Jared Gold on Hammond beef read from his latest reemerge and this is nomad [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[laughter]\n[noise]\nEasy to\nNo money money\n\n\n\n\nA\nFish and\n\n[noise] John mulder from decades memoirs\nThat was introduction to about us\nAnd you've heard this great music right here with me the Alexander on jackass\n[noise]\nOf Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even received protected us just\nGo to G. P. B. dot org slash cars or called eight seven seven GP the one car and banks\nNext time on the New Yorker radio our interview with Sally ate was acting attorney general she said no to the so called Muslim travel ban\nAnd then what happens [noise]\nUm I was fine [laughter]\nYou were fired by Donald Trump before it was fashionable hired by Donald [noise]\nSally Yates talks with Jeffrey tube and next time on the New Yorker radio hour and you can hear the New Yorker radio hour this morning at seven here on GB radio\n\nLive from NPR News in Washington I'm Jim hawk President Trump said Saturday he will pull the United states from the Nineteen eighty seven intermediate range nuclear forces treaty because Russia has violated the agreement\nWe're not going to let them violate a nuclear agreement\nI go out as your weapons were not allowed to wear the one who said it said in the agreement and we bonded agreement for Russia is not on seriously minded they agreement so we're going to terminate anyway but we're going to pull out\nU.S officials are previous they allege that Russia violated the treaty by deliberately deploying a land based cruise missile in order to pose\nAnd we're going to terminate\nU.S officials are previous they allege that Russia violate the treaty by deliberately deploying a land based cruise missile in order to pose a threat to NATO and Russia has claimed the U.S missile defense systems violate the pact [noise]\nAfghanistan is holding us first parliamentary elections in eight years and years ... reports there were dozens of attacks on election day across the country including a suicide bomber income all\nThe bomber struck a school that was used as a polling station it was kept open to accommodate voters hadn't been able to count that ballots earlier because electoral stuff hadn't turned up in the morning fearing attacks\nBut if they did turn up in defiance of the Taliban and ISIS he struck campaign rallies in the lead up to these elections militants also try to attend voting scattered deadly attacks around the country\nThere was also confusion about how to use and you buy metric systems and some days didn't have ballot because of the cast around in the elections fighting will now be extended to Sunday in some areas ... date NPR News Islamabad\nHundreds of thousands of people marched in London Saturday asking for A People's vote on brings up the nickname for Britain leaving the European Union as Lauren Miller reports the demonstrators demands are unlikely to be met [noise]\nThen you can really see the second in a referendum but this is unlikely more than two years after a slim majority of British voted\nTo leave the you know dealership and struck and it appears that brings its deadline may be extended organizers are calling for A People's vote\nIn which the public would have final approval of any deal one organizer says a fresh voters necessary because ... is a mess and there is no faith the government can deliver on its promises\nThey can tend to divorce from the ... will be far more costly and complex than anticipated\nHowever prime minister Theresa May and says there'll be no second vote and brings his supporters say it would trigger a major constitutional crisis for NPR News I'm Larry Miller in London\nTwo new tropical storms are swirling on the Pacific ocean of Mexico and one is forecast to become a hurricane and approach the country's west coast in the coming week\nTropical storm Willa is the twenty first name storm of the Eastern Pacific hurricane season the national Hurricane Center so that was likely to remain off the coast through Wednesday and then could approach Mexico's west central mainland as a hurricane this is NPR News\nOff the coast through Wednesday then could approach Mexico's west central mainland as a hurricane this is NPR News\n[laughter] it'll be in the Los Angeles Dodgers against the Boston Red Sox and baseball's World Series beginning Tuesday the Dodgers won the national league championship series Saturday Night with a five to one victory over the Milwaukee Brewers Chuck Quirmbach of member station Wu WMD in Milwaukee reports\nHomeruns by ... Cody Ballenger and among saving catch by outfielder Chris Taylor spark the Dodgers winning game seven of the NFL Championship series is the second year in a row the Dodgers will play in the world series last year they lost the Houston Astros\nBut Dodgers manager Dave Roberts says he's looking forward to this year's contest against the American league champion red Sox\nIt's great for baseball a two story franchises going head to head so it's going to be aggressors\nRoberts was part of the two thousand four Boston team that ended the franchises eighty six year run without a World Series championship for NPR News I'm Chuck Quirmbach in Milwaukee\nA European Japanese spacecraft is on its way to mercury after being loft it into orbit late friday\nThe ... Colombo mission is only the third time mercury has been attempted the two probes will have to follow when elliptical passed to the innermost planet utilizing a flyby of earth to Venus and six of mercury itself arriving in December of twenty twenty five\nThe aim is to build on the insight gained by NASA's messenger probe which ended its mission and twenty Fifteen after a four year orbit of mercury or providing new evidence of ice in the shadows of some of the planets creators I'm Jim Huck\nNPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include their doors do charitable foundation whos clinical scientists development award support promising early career physician scientists and their research efforts to improve human health and Americans for the arts\nYou are listening to a gp jazz on Georgia Public broadcasting Andy Alexander\nOh [noise]\n\n\n\nHouston Person come come rain or shine a haunting song that's one of my favorites everything ...\nHouston Person from come rain or shine was haunting song that's one of my favorites\nEverything must change Houston Person on tenor was warned by Shay on core net Lafayette Harrison piano Rodney Jones on guitar Matthew perished on base\nAnd Vincent act door on drums and before that drummer drone Jennings with his project caught the beast with the corps the Freddie Hubbard composition drone Jennings on John John Jones on trumpet\nHoward Wiley on tenor Dionne Tucker on trombone Christian fans on piano Christian McBride on base\nBecause the Alexander more music coming up from the coal Michel ... ice crystals with Aquarius\n\n\nReally didn't did and they made the leading didn't do anything we need didn't they didn't they didn't they didn't do\nIt but didn't\nThey didn't do that or do they just didn't know about\n...\nWe meaning Amy ... di di di di di di di di di di di di di di any TV all the way to me he didn't even need entertaining near you need the way\nTV he ... the\nThey told me this\nWho do do do do ... you don't need\nHa\nDay and\nAnd\nTo my\n\nWhat\nThe\n[noise]\n\nI\n[noise]\n[noise]\n\nThat the taking us out with what you're doing to me this is [noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nNow is the perfect time to clean out the garage and get rid of that car you no longer need\nDo face the coming months with a fresh start and by donating your used Carter G Bebe you'll even get a tax deduction called eight seven seven GP be one car or donate securely on line a G. P. B. dot org slash cars and bank\nSaudi Arabia chapel diplomacy we're struggling to strike a breath to deal with time running out and the creator a hit show transparent on allegations against dark I really wish I would have immediately\nJumped to supporting them and telling their stories rather than going into protection and all that and the countdown to election day Sunday on weekend edition NPR onion\nIs for weekend edition this morning from a cat here on the TV and online at gp news dot org\nLive from NPR News in Washington I'm sure mark\nWorld leaders are skeptical of Saudi Arabia's explanation involving the death of writer ... show gee the Saudis claim he died after Russia's tried has to make court has been at the center for Strategic and International Studies so is this is an opportunity for the United states to make a stand for human rights\nThat the main breaking relations ending economic card ignoring\nThis is an opportunity for the United states to make a stand for human rights\nThat doesn't mean breaking relations ending economic card\nIgnoring our security and true but I think it does mean that both the media and outlaws and government in the United states and was ruining they could pick up on this incident\nAnd make it clear to everyone in the area that this kind of operation is going to get government out of the shows in ... in two very deep international tropical\nCriticism and also says turkey has actually arrested more people and made more disappeared and Saudi Arabia has in the past few years\nThe European Union's top court says the polish government must immediately stop forcing Supreme Court judges to retire at a younger age from Brussels Teri Schultz reports the case has been brought by the European Commission which is concerned the populace led government is stacking accord with hand picked political supporters\nThe European Commission has long warned pull and government led by the national is long Justice Party that lowering catches retirement date from Seventy to sixty five and forcing out about a third of them by early democratic principles\nThe government did it anyway Anna pointed political allies to the post is investigating them is threatening to suspend the polling voting rights that it doesn't reverse it this injunction from the European Court of justice it's not a final ruling yet dismissals mess to end and those already forced out must be reinstated\nPolish prime minister ... let me ask you says his government is reviewing the order Hungary has vowed to block the necessary unanimity for any attempt to punish Warsaw\nFor NPR News I'm Teri Schultz in Brussels\nAfghanistan's first parliamentary elections in eight years suffered from violence and chaos Saturday with a multitude of attacks killing dozens of people key election workers feeling to show up many polling stations thing open hours later than scheduled to handle long lines of voters\nPolice officer in Georgia has been shot and killed after responding to reports of a suspicious vehicle and there were a school when the county police say shots were fired from inside the vehicle as officer and one Tony and other officers approached police sergeant Jake Smith says it happened without warning\nMy understanding of bill that there was no problem with the officer got out of their patrol cars and approach beautiful and before they could even get to do the south right\nOfficer Tony died after being rushed to a hospital days away from mark in three years is or not\nYeah people and before they could even get to be able to south rap\nOfficer Tony died after being rushed to a hospital days away from working three years as an officer and going to county one suspect is under arrest and the second is still at large this is NPR News\nIn Syria ISIS has released to women and four children who are among dozens of hostages the militants have been holding captive for months as Ruth Sherlock reports the move is reportedly are the result of a deal struck by the Syrian regime\nIn July this yeah ISIS attack an ethnically Druze village in southern Syria killing hundreds of inhabitants and taking hostage dozens of women and children local residents put pressure on the Syrian regime to find a solution\nNow months late that Syrian activists and the Syrian Observatory for human rights lawyers say the regime has struck a deal with ISIS agreeing to pay millions of dollars in rent and housing gauge in a prison that took\nThe Syrian Government is not confined to the times is that reports that they're Syrian state television characterized the hostage releases thing the result of a tight siege imposed on the extremists by government treat it has more of the hostages out to be freed saying we chat up and Danny's they rate\nThe mega millions lottery may see a streak of twenty five Jack Potter rollovers end as it heads toward a record one point six billion dollar drawing based on sales projections Seventy five percent of the three hundred two million possible combinations will be chosen for Tuesday's drawing up from just over fifty nine percent in friday's drawing\nThe Dodgers reached the world series or the second straight year beating the Milwaukee Brewers five to one Saturday Night in game seven of the national league championship series that sets up a showdown against the Boston Red Sox game one of the world series on Tuesday I'm Jim Huck NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the emcee foundation dot org\nI'm Dee Alexander you're listening to G. P. B. jazz on Georgia Public broadcasting\nOh [noise]\n... ...\n\n\n\n\nHouston Person from come rain or shine with a haunting song that's one of my favorites\nEverything must change Houston Person on tenor was warned by Shay on core net Lafayette Harrison piano Rodney Jones on guitar Matthew Parish on base\nAnd Vincent act door on drums and before that drummer drone Jennings with his project caught the beef with the court the Freddie Hubbard composition drone Jennings on drums Shawn Jones on trumpet\nHoward Wiley on tenor Dionne Tucker on trombone Christian fans on piano Christian McBride on base\nBecause the Alexander more music coming up from the coal Michel ... ice crystals with Aquarius\n\n\nReally didn't they didn't they didn't they didn't do we need didn't they didn't they didn't you\nJust put it in there but I just\nDidn't do that or do they just didn't have\nAny meaning leaning named ...\nMe me me me any\nIt's just they just have\n...\nMe me me me me me me me me me me eating ... ne\nNe ne ne ne ne ne ne ne ne lead the way\nWay back home and those\nDo do do do di di di di di di di\n\nThe day we\nKnew\nDown to my\n", "year": "2018", "show_name": "GPB Jazz", "city": "Chatsworth", "day": "21"}