{"month": "10", "state": "GA", "station": "WNGH", "content": "It's time on studio three sixty [noise]\nThis is member supported gp Pete were in Eighteen station radio network you can listen online or G. P. B. dot org and you can find us on Twitter at my G. P. B. and Georgia Public broadcasting on Facebook thank you for listening ...\nThis week and the Georgia health reporting we discuss the findings of a new study from the government Accountability Office in\nPeople who are\nNon Medicaid expansion students like George Patton certainly more affordability problems comes to health and\nSo some of these findings followed\nThe Georgia health important Saturday that five thirty five during all things considered [noise]\n[noise]\nNinety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nNow is the perfect time to clean out the garage and get rid of that car you no longer need\nThey'll face the coming months with a fresh start and by donating your used car to GB believing it a tax deduction called eight seven seven GP be one car or donate securely online at ... dot org slash cars and thank\nSupport for TB comes from you our listeners\nAnd connect savannah Santa's alternative weekly source for news music movies theater arts restaurant and events\nAvailable in print at locations throughout savannah and on the Web at connects savannah dot com TB has been honored by the Georgia Associated Press media editor is winning the top award for radio the pacemaker award we were also honored for specialized reporting best anchor and best newscast gp news stand with the facts\nLive from NPR News in Washington I'm jak sphere Caesar say are cooler suspected of sending explosives to prominent critics of President Trump through the mail may face up to forty eight years in prison NPR's Quil Lawrence reports the investigation remains ongoing\nFBI Director Chris Wray said that a fingerprint found on one of the packages soon turned up a match with Cesar say Iraq because of the Florida Man had a long for him\nRemains ongoing FBI Director Chris Wray said that a fingerprint found on one of the packages soon turned up a match with Cesar say Iraq\nBecause of the Florida Man had a long criminal record that includes theft battery and making a bomb threat DNA from two packages also matched race said the FBI's crime lab had found there man within thirty six hours of receiving the evidence\nWe see unbelievable works like this on TV and Hollywood but to see it up close and reality is something to behold\nRe cautioned that more packages could still be in circulation he said the packages did contain explosive material and should not be considered hoaxes despite the fact that no one so far has been harmed Quil Lawrence NPR News New York\nAsked again by reporters today about whether his own rhetoric has anything to do with the man accused of sending bombs through the mail President Trump largely brushed off the comments after doting it appears the suspect there's an ardent supporter of the President Trump said he himself bears no blame resin also doubled down on his recent criticisms of the media's coverage of his administration\nBut I think I don't\nPrevent you know the media is really really unfair to me and the Republican Party I think\nVery unfair terms of the\nTrump's remarks ... came as he headed off to Charlotte North Carolina for a political rally tonight [laughter] the ashes of match shepherd the young gay man murdered Twenty years ago in Wyoming were laid to rest today at the national cathedral NPR's Tom Gjelten says the internment of his ashes brought together many was so saturated with shepherd and suffering\nThe Nineteen Ninety eight murder of Matthew Shepard came to symbolize crimes of hate and the anti gay bigotry his parents did not enter his ashes previously for fear of the site would be desecrated speaking at the end tournaments ceremony Dennis shepherd said he was relieved his son could though rest is so important that we now have\nA whole format [noise]\nAll the others [noise] can visit [noise]\nIt is safe from\n...\nShepherds ashes will rest in the cathedral crypt alongside those of about two hundred other notable figures Tom Gjelten NPR News Washington\nThe consumer financial Protection Bureau says it intends to take another look at its payday lending rules finalized last year ... says it wants to focus specifically on its ability to repay provision which would force payday lenders take into account the ability for customers repay their loans in a timely manner that's changed could make it more difficult to Europe\nTypically on its ability to repay provision which would force payday lenders take into account the ability for customers repay their loans in a timely manner that's changed it could make it more difficult to protect consumers from potential abuses on Wall street the Dow is down two hundred Ninety six points today you're listening to NPR\nFacebook has removed a new batch of accounts that originated in Iran and spread disinformation to people in the U.S and the u._k. company says it removed more than ... eighty to Iran linked accounts pages and groups from Facebook and Instagram more from NPR's Alina Selyukh\nFacebook says the Iran linked to cancer typically pretended to be us or UK citizens and shared politically charged both for example about race relations or immigration aimed at American and British audiences\nThis activity dates as far back as twenty sixteen but Facebook says it has not notice any targeting of the midterm elections which are in ten days here's Nathaniel glad you're headed Facebook's cybersecurity policy\nAnd it was selling discord and it was trying to target or socially to visit issues as opposed to being specifically targeted on events that are about her\nFacebook says it's still investigating who is behind this coordinated disinformation campaign and has not linked it to the Iranian government Alina Selyukh NPR News\nA group of twenty us states in several major cities today called on the Trump Administration to abandon their proposal would freeze fuel efficiency standards after twenty twenty also stripping California of the ability to impose its own stricter guidelines\nStates including California New York Illinois Massachusetts in Pennsylvania\nAre calling the administration's proposal unlawful and reckless in a filing review today by Reuters proposal to set up a major battle between the administration in California over whether the largest US state can be more aggressive in terms of working to reduce greenhouse gas emissions which was linked to climate change\nOr to a futures prices closed higher oil at sixty seven fifty nine and barely New York I'm jak sphere NPR News in Washington\nSupport for NPR comes from little passports a monthly subscription service for kids each package includes the games souvenirs and activities from a new country designed to spark curiosity and cultures around the globe at little passports dot com slash radio\nWelcome to G. P. B. jazz I'm the old tests or thanks for joining me tonight [noise]\n[noise]\nMm Mm\nSan Joan Lindsay why\nThey just sit around and came back\nTo the\nKnew he\nCould\n\nThat he\nWas one more\nThat we all thought and\nAnd the and\nDo\nYou do in the Jones\nBeing and and\nYou may have\nSaying they either\nHave settled down and\nBill\n\nRent I\nDon't need you close to I\nDon't need one man to\nReach the shunned\n\nI\nShe\n\nA program Jones no\n\n\nCannonball ladder league going to be true Ben Jones on his composition called unit seven here's the milk and\nWe started off that set up three terms with Tina Brooks that was the gentleman's name Tina Brooks on tenor saxophone was Freddie Hubbard on trumpet\nAnd a rhythm section that including Sam Jones on base was the title track from the album true blue going back to Nineteen sixty also from the early Nineteen sixties in the middle of the SAT\nWe heard another tune featuring Sam Jones and in fact his composition was Sam Jones is blues with a bridge you might say it's got a blues but then it's got a middle section\nIt's called unit seven and it's about his most famous composition largely because it entered the repertoire of cannonball add a release quintet which is who we heard playing it when that added early on corn that's a very young Joseph ... at the piano with Sam Jones on base Lewis ... on drums\nAnd then we just finished listening to steam Nelson fiber phone is from his two thousand Seventeen album called brother is under the sun\nWhich featured a rhythm section headed up by the pianist Danny Chris and almost all the compositions on this recording were written by mold grew Miller the late pianists or with whom seatbelts and performed regularly in the Nineteen nineties\nThat was a composition gold new wheels from the pen of mold grew Miller\nCartoon a jazz with Neal tests or the saxophone is Vincent Herring plays another mother grew Miller composition on his latest album and we're going to get to it in just a couple of minutes\nOr\n\n\n\n\nThat made one album that I Know of called project them the trademark Sherman on by ... here's Joey different just go\nOh oh oh oh oh\n\n\nMany\n\n\n\n\n[noise]\n\n\n\n[noise]\nNinety seven point seven FM double your G. P. B. S. W. GBH be room for the Georgia Public broadcasting radio network [noise]\nMe investigation continues into the suspicious packages ... critics prejudice from when I have the latest polls are rushing trolls try to influence American by reading about football players kneel during the anthem what their efforts were aimed at we're\nSowing discord and so if you're attempting to divide people this is a pretty great subject and Saturday and weekend edition from NPR News new tomorrow morning from eight until ten on Mr supported\n... support for G. P. V. programs comes from our listeners\nAnd connect savannah Santa's alternative weekly source for news music movies theater arts restaurant and events\nAvailable in print at locations throughout savannah and on the Web at connects savannah\nDot com your support allows ... to bring you a great weekend programs that are both informative and fun like wait wait don't tell me asked me another and Planet Money check out our entire radio programs scheduled at gp news dot org\nLive from NPR News in Washington I'm ... the Justice Department is bringing a raft of charges against a Florida Man in the case of Thirteen letter bombs sent a prominent Democrats in recent days NPR's Quil Lawrence reports you could face up to forty eight years in prison\nCaesar salad is fifty six years old and has a long criminal record including theft battery and making a bomb threat at a press conference attorney general Jeff Sessions was asked about ... motive I don't know\nSix years old and has a long criminal record including theft battery and making a bomb threat at a press conference attorney general Jeff Sessions was asked about say ox motive\nI don't know and then uh what you might uh normally expect a a ... appears to be a partisan but that would be determined by the fact is the case goes for non not able to comment on that\nAll the targets so far we're prominent critics of President Trump politicians but also former career intelligence officials whom the president has attacked in public speech Trump has continued to denounce violence and appealed for unity his also resume some of his regular verbal attacks on the press and his political opponents Quil Lawrence NPR News New York\nFormer president Brock Obama took sharp aim at President Trump's tenure during a speech in Milwaukee today the trip part of a get out the vote effort for Democrats they're Obama accused Trump and other Republicans of making stuff up the also said voters deserve a country where politicians seek to help and not divide the country\nOf this country we love was one of the sharpest attacks on Trump to date by the Democratic former President Obama also blast Wisconsin Governor Scott Walker Walker is being challenged by Democrat Tony Evers\nThe cost of running for political office keeps rising and now the reports of a record smashing sixty million dollars in campaign donations and outside spending go into Montana's contentious US Senate race Democrats are hoping to hold onto his seat there in a state that has been leaning toward President Trump\nStocks in the u._s. went through another ... day the market's open with the dive and recovered only slightly by days and NPR's Alina Selyukh reports tech earnings caused the jitters it's\nBeen a very turbulent weak on Wall street with stocks soaring one day and plummeting the next day after the bell on friday the Dow was down more than one percent the U.S and be five hundred one point seven percent and the NASDAQ more than two percent\nThe as in the end the Dow have erased their gains for the year two companies in particular had prompted this sell off Amazon and Google ... parent company alphabet\nThe two giants had reported mixed quarterly results solid profits but disappointing sales this even overshadowed strong economic data some investors are warning that the bull market may have had its run and a correction is coming Alina Selyukh NPR News\nAnd it was strong economic data on some investors are warning that the bull market may have had its run and a correction is coming ... NPR News\nToday the Dow closed down two hundred and Ninety six points you're listening to NPR\nIsraeli prime minister Benjamin Netanyahu made a rare official visit to a Gulf Arab country visiting old mom just days after the Palestinian authority leader visited the country NPR's Daniel Estrin has more from Jerusalem\nIt's on Yahoo and his wife and senior Israeli officials met ... leader sultan caboose been said his office said it was the first official visit of a high ranking Israeli official to Oman in twenty two years and it's on Yahoo 's office says the leaders spoke about ways to advance the peace process in the middle east\nIsrael and among do not share diplomatic relations but they have discreet ties\nJust days ago Palestinian Authority president Mahmoud Abbas visited him on raising the possibility that the country could play a role in restarting peace talks between Israelis and Palestinians\nOman borders Saudi Arabia and his near Iran you al ... an Israeli researcher who studies Oman said it was remarkable Oman acknowledged the visit Daniel Estrin NPR News Jerusalem\nThe Cincinnati Zoo says it's filing a lawsuit for the return of a gorilla it along to the California conservatory as a companion for cocoa the role of fame for mastering sign language\nCocoa died in June attorneys for the Cincinnati is to say the thirty seven year old silver back rolling in and do may was sent to the gorilla foundation in Nineteen Ninety One with the understanding of after ... death he would be returned\nWherever dispute has apparently developed over the grill it or whether they really should be sent the zoo says the California conservatory is in violation of the contract\nRudolph futures prices were up for tens of one percent closing it's sixty seven fifty nine a barrel or the New York mercantile exchange\nI'm jak spear NPR News in Washington support for NPR comes from NPR stations other contributors to include the public welfare foundation committed to advancing justice an opportunity for people in need more\nInformation at public welfare dot org and that John ... and Catherine the MacArthur Foundation at max pounded out or\nListening to G. P. B. jazz on Georgia Public broadcasting I'm Neil test her this is jazz with Neal tests are glad to have you along this hour we're going to get to some seasonal music the weather is changing Christmas is coming and uh so it was some Christmas music and just a little bit first though something from it\nWe're we're going to get to some seasonal music the weather is changing Christmas is kind of\nAnd uh so it was some Christmas music in just a little bit first do something from the latest album by Christian McBride and it's been banned\nIt's called bringing it and it features not only Christian McBride on base he also did the arranging on almost all of the tunes on this recording this one among them it also featured Rodney Jones on guitar and that's important because this is a tune was written by the legendary guitarists Wes Montgomery it's called full house\nMm\nMm\n\n\n[noise]\n\n\n\n\nI'm\n\n\n\n...\n\n\n... ...\n...\n...\n\n[noise]\n\n[noise]\n\n\nOh oh\n\nThat's from an album that the insanely talented tenor saxophone pianist composer and a ranger and band leader Gordon Gould when put out a few years ago an album called rat W. R. H. P.\nFeaturing his big fat band and the album subtitled a big factor Christmas that P H A T Christmas\nAnd that's a tune that you don't often hear when you're listening to Christmas carols but it is from a Christmas Time movie movie that came out of Christmas and in fact uh during the Christmas holidays that's a song called somewhere in my memory and it's from home alone of all places\nJust before Gordon Gould when we're the he's brothers are featuring Jimmy Heath on tenor saxophone at first the heat on base\nHome alone of all places\nJust before Gordon Gould when we're the he's brother is\nA featuring Jimmy Heath on tenor saxophone Percy Heath on base and not ... on drums he was an accident on this recording use replaced by accurate China usually the heat brothers is all three of them also features Stanley Cal on piano and Tony parolee on guitar\nOn the a version of our little town that's based on a little town of Bethlehem and before that where the solo piano rendition of that beautiful Christmas Time to Iowa will be home for Christmas has played by McCoy tighter that's from a collection called jingle bells jazz and you can find on the legacy\nOn the legacy label\nAnd you heard of Iran jazz with neo pets are we got a little more Christmas music for you on this evening as we get close to the big day this is from a two thousand Seventeen Christmas release from David in a tree oh this is an updated version of joy to the world [noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\nWell\nThat's Wynton Marsalis here's Nina ...\n\n[noise]\n[noise]\nIt was Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome quarter but Georgia Public broadcasting radio network [noise]\nPeter said will hear anything in your car I Want you to try something roll up the windows you're all sealed inside a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that old car smell my donating your vehicle one of your favorite causes like public radio it only takes a few minutes and just like that you've supported the station and well you were on your way to a life of better smell [noise]\nGo to Dee Dee Dee dot org slash cars and thanks\n... and the church how ... we just got the findings of a new study and the government Accountability Office and the\nNon medicated expansion states like Georgia have certainly more affordability problems when it comes to health care\nSo some of these findings kind of follow the net ... billion\nThat you were to help her pointing Saturday that five thirty five during all things considered\nGlide from NPR News in Washington I'm ...\nI'm ... have arrested a suspect charge with sending more than ... does that explosive devices to prominent Democrats and CNN this week\nBears haunted along reports fifty six year old Cesar ... Florida is charged with multiple federal crimes including threatening former presidents and assaulting federal officer a nationwide investigation has recovered Thirteen improvised explosive devices that the federal government says were sent by Cesar ... FBI Director Christopher Wray\nFederal officer a nationwide investigation has recovered Thirteen improvised explosive devices that the federal government says were sent by Cesar ... FBI Director Christopher Wray says investigators identified say August ... through a fingerprint and they found an envelope Sai allegedly sent a democratic congresswoman Maxine Waters of California\nWe do believe that we've got the right guy but\nWe also know that this is an ongoing investigation and there's a lot of work still to be done which means there's still plenty of unanswered questions\nRaised says it's not clear yet if say I acted alone and if there anymore devices still in the postal system is devices authorities have recovered so far but may with basic materials including PVC pipe a small clock and a battery on the little ... NPR News\nNew York as for the suspect more details are emerging about a man who appears to have been living on the margins not only had to say are regularly run into trouble with the law with a series of arrest also appears to be mostly homeless going to run allowing has Miami attorney his client clearly needed help he was not getting\nHe refused to even get diagnosed but his family and anyone who interacts with and can see he suffers from something [noise] I don't know what it is but he certainly doesn't have the shoe or the ability to communicate the way you and I had\nTo say I filed for bankruptcy in two thousand twelve and was living with his mother though it appears at times he may have been living out of his van among other things the Florida Man had been a former males stripper an amateur bodybuilder he wants to spend time on probation for a bomb threat\nThat apartment of homeland security says the first completed section of border wall in Calexico California's a fulfillment of President Trump's promise to build a southern wall secretary cures to Nielsen was on hand for the installation of the last part of the renovated thirty foot high border fence Maxwell ... has more\nPlayed by border patrol agents and officials Nielsen watched as two local welders attached the fence a plaque during President Trump's name in bold letters with Nielsen's below at and smaller font afterwards she stressed the importance of defense for maintaining safety in the area\nUntil this project was finished our agents for trying to stop illegal crossings that ... that had not been replaced since the Nineteen nineties\nBefore the renovation began apprehension by border patrol had already dropped her record lows for NPR News I'm ... now they're in Calexico\nCalifornia there was a ... state stronger than expected for the three months ending in September the government says the gross domestic product rose by an annual rate of three and a half percent still not enough to excite Wall Street ... weeks and the Dow plunged two hundred Ninety six points the the NASDAQ was\nSilverman says the gross domestic product rose by an annual rate of three and a half percent still not enough to excite Wall Street ... weeks and the doubt plunged two hundred Ninety six points to save the NASDAQ was down a hundred and fifty one point this is NPR\nAnd the Democratic Republic of Congo the total number of people infected with Ebola is now top two hundred and Fifteen World Health officials say efforts to contain the nearly three months long outbreak continues to be hampered by violence ... ... and man has more\nThe outbreak isn't in eastern region that is seen decades of conflict between multiple rebel militias and government forces in the last week alone one of these athletes killed two members of an Army Medical assistance team and another launch an attack in which around two dozen civilians were killed or kidnapped\nWith each new attack health workers responding to people the crisis have had to suspend their work\nAnd the violence is also feel suspicion of health workers\nPeople in affected areas who resent the government sometimes view the polar responders estate agents over the last month the tally of new infections has risen from about ... a week to nearly thirty a week officials safer now it doesn't look like numbers will spiral beyond that at the risk is there and read ... NPR News\nIncreasingly fatigued and in some cases ill the ranks of migrant caravan bound for the U.S continue to dwindle next leg of the groups journey covering sixty miles from the southern Mexican town is starting to take its toll some of the migrants were saying with what little money they have they made by bus tickets for part of the way to\nTry to regain their strength thousands of Central American migrants about to reach the southern border of us even as President Trump is vowing to keep them from entering the country [noise]\nHurdle futures prices rose for tens of percent closing it sixty seven fifty nine a barrel on the New York mercantile exchange I'm jak spear NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the Charles Stuart my foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org and the corporation for public broadcasting\nNeal tester you're listening to G. P. B. jazz on Georgia Public broadcasting looking into this hour of jazz with Neil ... way to get some recent releases from the pianist and composer Stanley towel and from David Bloom who for the last forty odd years has been running a jazz school in Chicago\nThe pianist and composer Stanley towel and from David Bloom who for the last forty odd years has been running a jazz school in Chicago\nAnd on his most recent recording shows that he can put into practice what he preaches also going to get to a recent release from the Dutch guitarist named Marta ...\nAnd from Taylor Haskins who plays a sort of electric synthesizer trumpet but not exactly I can explain it more later\nRight now though the British vocalist I Need a war Dell\nWho ah back in two thousand six put out an album called noted\nThat caused all kinds of Mr on that album she took several songs that were from the blue Note Records catalog a much the way that a singer named illicit all good did in two thousand sixteen but this was a decade earlier when I Need a war del took song such as moaning and watermelon man\nAnd lowly woman and dueling and put lyrics to them or sometimes just ...\nIn any case this was one of those it's the McCoy tighter tune called lose on the corner lyrics by a need to war del\nTo\n\nAt an\n\n\n\n\n\n\n\nBand called green empire which is led by Taylor Haskins\nHe is primarily a trumpeter but on this recording he primarily primarily he plays the electronic vows instrument\nYou may have heard of the ... the electronic wind instrument that's been around since really the Nineteen seventies it's a tool that looks kind of like a current it without the bell at the bottom that's hooked up by wires to a synthesizer\nAnd for many years uh read men had been able to play synthesizer music on something bad response to the fingering that they would use on a clarinet or saxophone well be electronic valve instrument does that for breast players it's set up so that the mouthpiece is sensitive to\nChanges in I'm sure Iran and air pressure and the other various techniques for the trumpet player would use on an actual trumpet but it operates through a synthesizer it is a win the controls synthesizer instead of something that you just hit on the keyboard and that's what that's\nThe on an actual trumpet but it operates through a synthesizer it is a wind the controls synthesizer instead of something that you just hit on the keyboard and that's what that instrument is and that has a lot to do with the sound on this album which is called the point from Taylor Haskins and green empire\nJust before that we heard the Dutch guitarists Martin ... and his group on an album called old school band that came out as did the Taylor Haskins album the second half of two thousand sixteen\nOh wait Seventy one year isn't going to have a two thousand Seventy times does fly and before that he got this weird from Anita war Dell from her album noted of about a lemon twelve years ago\nAnd her version of the McCoy Turner classic blues on the corner all of those here on jazz would Neal tests are going to continue in the same vein as that Taylor Haskins recording and just a couple of minutes [laughter]\n\nThat's Denise I plan on piano and sympathizers and George Marshall on drums just the two of them the album called riding the moment\n\nYou're doing the jazz Neal tester here Stanley ...\n\n\n\n\nThat's a Nineteen sixty two recordings from Yousef Latinos who you heard there on St Louis\nThat's attracted actually went on released for about a dozen years until the Nineteen seventies\nAnd it's called the Torah featuring used to have to keep on flus along with his fellow Detroit her Barry Harris at the piano and a small wrapped up percussionist before that in the middle of the SAT we heard this latest album from David Bloom who is a guitarist than a composer\nAnd back in the mid Nineteen seventies when he himself was only in his twenties\nHe founded a the Booth School of jazz in downtown Chicago which is still operating today and has a matriculated or at least advise\nHundreds of different uh young musicians some of whom have gone on to the greater note some of whom have simply use music\nIn their daily lives in a way that they might not have otherwise can David Bloom just keeps writing music on this route released which is called contender he handed his compositions over to a former student of heads who was a renowned a ranger named cliff cola\nAnd so it's really under both their names that was a piece called will or won't that had Cheryl Wilson on voice and the very intriguing on the front line in front of the rhythm section of English worn French horn and tenor saxophone as played by mark Colby\nWe started out the set with the two thousand Seventeen released by Stanley titled the pianist and composer and comic manipulator using electronics on a quartet album called no illusions with Billy drawing on drums and Jay Anderson on base and Bruce Williams on Alto saxophone\nUp next we've got an extended track from a quintet that I've admired Everytime I've had the chance to hear them on a desk and\nThe exit poll up next we've got an extended track from a quick trip that I admired Everytime I've had the chance to hear them on a desk\nAnd I don't think I brought them for you to hear at all and you may not be familiar with this group led by Ken Thompson who plays bass clarinet in outer saxophone and the band that he calls low fat low with a slash fast\nIt also features rushed Johnson on trombone and the rhythm section ended up by near soldier the guitars from the album called central filled with music that does not do that this is a piece titled bring along\n\n\n\nNa\n[noise]\nWas Ninety seven point seven FM W G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nYou know selling a car can be a hassle but don't get is a whole different story let us take off your hands or off your driveway and turn it into public radio and maybe even a tax deductions to resolve the host marketplace and here is how to do [noise]\nEight seven seven GP beat one car or donate securely on line a gp dot org slash cars and thanks [noise]\nSweet and the judge to help her point and we just got the findings of a new study from the government Accountability Office in\nPeople who are\nNon medicated expansion states like Georgia have certainly more affordability problems when it comes to health care\nIn the ... some of these findings followed in vain\nThat you were to help her pointing Saturday that by thirty five during all things considered\n[noise]\nLife from NPR News in Washington ... Stevens oh fifty six year old for demand is facing charges of sending Thirteen potentially explosive devices to prominent Democrats and critics of President Trump\nAs NPR's Miles parks reports the suspect was arrested after that the discovery of three more packages earlier today\nTeachers say August chartered interstate transportation and explosive illegal mailing of explosives threats against former presidents threatening interstate communications and assaulting federal officers\nState transportation and explosive illegal mailing explosives threats against former presidents threatening interstate communications and assaulting federal officers he faces up to forty eight years in prison if he's convicted according to the Justice Department\nTickets along criminal record according to public data including a charge related to a bomb threat in the early to thousands President Trump spoke about sex arrest saying quote these terrorizing acts are despicable and have no place in our country except we must never allow political violence to take root in America\nMiles Parks NPR News\nPresident Trump says he doesn't plan to contact former President Obama or anyone else targeted by the pipe bombs Trump says it's not his fault that one of his supporters is allegedly behind the threats speaking to reporters before heading to in North Carolina rally the president says he wants to focus on the upcoming mid terms I think\nTrump later accused the media of gloating over the package bombs story to score political points against him and against the Republican Party\nThousands of people from Central America are still walking through Mexico toward the U.S border to seek asylum but their numbers are getting smaller coordinators of the caravan are rejecting a proposal by Mexico's president or the migrants to apply for refugee status in the country [laughter]\nMeanwhile the Pentagon is preparing to send hundreds of active duty troops to a border patrol agents at the U.S southern border when the asylum seekers arrive\nAnd a report from the nonpartisan government Accountability Office shows disparities and how schools prepare students for college NPR's list the ...\nHigh poverty schools and smaller schools were less likely to offer advanced classes like calculus or physics according to the research those schools were also less likely had advanced placement or AP classes about allow students to earn college credit either really rigorous classes and kids are taking you know in high school and the idea is\nThat they will help better prepare them for the rigors of college that's Jackie ... with the G. A. L. in addition to preparing students these classes are also like most public four year colleges are looking for during the admissions process\nStudents not taking it may be less competitive when it comes to applying to college I listen to any NPR News\nStudents not taking it may be less competitive when it comes to applying to college I listen to any NPR knit\nListening to NPR News\nAre you in so many national park officials his two people killed after falling from a popular overlooked punched about eight hundred feet in a very steep terrain parts spokeswoman Jamie richer says rangers retrieved the bodies with the help of California highway patrol helicopter\nA tourist spot at the pair after they had fallen from a granite cliff thousands of feet high it's unclear when the victims died\nAnd they have not been identified\nThe ashes of Matthew Shepard finally have a final resting place some Twenty years after he was murdered in Wyoming for being gay and parents Tom Gjelten reports that shepherds ashes were interred today at the Washington National cathedral\nThe Nineteen Ninety eight murder of Matthew Shepard came to symbolize crimes of hate and anti gay bigotry his parents did not enter his ashes previously for fear of the site would be desecrated\nSpeaking at the un tournaments ceremony data shepherd said he was relieved his son could though rest so important that we now have a whole\nFormat [noise]\nAll the others [noise]\nIt is safe from\nEight or ... shepherds ashes will rest and the cathedral crypt alongside those of about two hundred other notable figures Tom Gjelten NPR News Washington\nAnd a dino virus outbreak has claimed the life of an eighth child at a New Jersey rehabilitation center where twenty three people have been afflicted state health officials say the strain of virus is associated with communal living arrangements I'm Shay Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\nWelcome to G. P. B. jazz I'm the Old Testament thanks for joining me tonight\nFor corporate brown max Roach quintet free drinks Sonny Rollins on tenor saxophone here's Frank Caruso\nOnly me but I only\nAbout me\nDown economy there you go\nMatter what mood I'm In your body or\nBy boat on the you know regarding young or\nEven to find a bad\nOther day that the law go down the drain for my editor they let\nYou get me wrong and I but what about the the thing of the time you\nAnd that was already cloudy\nReally bad in my day a\nBut not you know you will de\nDum la da dum la la la\nJob Logan young blond you\nMe no young mom read\nMe not that young mom read\nKnow Ron Donovan\nLittle little little the little room done\n\nLa la\nLa la la la la la la la la\nLa la la la la la\nLa\nLa la and new\n\nLa la la la la la la la la la\n\n\n\nGift from ... Jim gala right over here is Lenny trust on\n[noise]\nThis was Ninety seven point seven FM double your G. P. B. N. W. GBH the rural part of Georgia Public broadcasting radio network [noise]\n[noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that keeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive a tax deduction\nG. P. dot org slash cars or called eight Seventy seven GP be one car and banks\nMe investigation continues into the suspicious packages and critics of President Trump will have the latest polls show rushing trolls try to influence Americans by reading about football players who kneel during the anthem\nWhat their efforts were aimed at we're sowing discord so if you're attempting to divide people this is a pretty great subject\nSaturday on weekend edition from NPR News Tunis for weekend edition this morning from eight to ten right here on TPP\nLines from NPR News in Washington ... state and federal authorities say DNA and the fingerprint on a novel led them to the Florida Man accused of sending explosive devices to at least eleven prominent Democrats\nFifty six year old Caesar say I was arrested earlier today near Fort Lauderdale as W ELL Iran's Katie ... reports authorities say the suspect has a history of posting and\nYeah I was arrested earlier today near Fort Lauderdale as W ... reports authorities say the suspect has a history of posting anti Democrat messages on social media\nIn his latest string of tweets over the past several weeks see their staff posted pictures of negative campaign ads against Florida democratic candidate for governor Andrew gallon many ... over and over and not even so much as his tweets are pro Republican as much as they are anti Gillum\nCount is Fiore washed sacks arrest from across the street and size they uncovered and anti liberal stickers\nHe actually had to look on his face from what I saw of him more of like just a okay they got me\nSay Iraq is in federal custody facing five charges for NPR News I'm ... and plantation Florida\nBefore heading to a campaign rally in North Carolina Friday President Trump accused the medium of using the actions of one individual to undermine him and the Republican Party from tweeted earlier that the package bomb story was diverting attention away from the mid term elections\nFormer President Obama is not shying away from taking shots at Republicans will stumping for democratic candidates Michigan Public radio Sheena Roth reports on Obama's remarks at a rally in Detroit\nLike in several other states some Republicans in Michigan had been running on a platform that includes support for pre existing conditions for health insurance coverage Obama says Republicans have been doing the opposite of protecting healthcare\nObama has been more critical of the White House recently and he used the platform in Detroit to also take a swipe at Donald Trump's administration's legal troubles Obama said no one in his administration got indicted for NPR News I'm Shana Ross and Detroit Michigan\nAnd have child has died as a result of ... outbreak at a pediatric health center in New Jersey Rachel holidays Smith of WNYC reports there are two dozen confirmed cases in\nOld their health officials and clinical staff say they are doing everything they can to contain the outbreak of added no virus at the ... Center for nursing and rehabilitation\nThe virus affects healthy people only mildly but his wreaking havoc among the facilities immuno compromised patients New Jersey's health commissioner Dr Sharif el in the hall says it's been difficult to isolate sick children on ventilators who cannot be moved\nSeeing a much worse outcome because the patients are so fragile\nIt's been difficult to isolate sick children on ventilators who cannot be moved\nSeeing much worse outcome because the patients are so fragile at baseline\n... says it may take another two months for the outbreak to end for NPR News I'm Rachael ... this is NPR News\nAll Street Journal report says the FBI is investigating whether electric carmaker Tesla misled investors by overstating production forecasts sports model three sedan\nTesla spokesman says the company was transparent about his problems with ramping up production Fessler settled those civil lawsuit by the securities and Exchange Commission last month\nThat case stems from tweets by founder Elon Musk the test was taking the company private\nMission manager at NASA's Jet Propulsion Laboratory in Pasadena, California has completed a successful dress rehearsal for next month's Mars landing as NPR's Joe Palca reports the probe known is in sight is designed to study the red planet's interior insight\nCarries a delicate seismometers that will be used for measuring Mars quakes the Martian equivalent of earthquakes data from the seismometers will help scientists understand more about what the core of Mars is like\nA heat shield parachute and ultimately twelve small rockets are used to bring insight to a soft landing on a regional Mars known as a ... a very flat area that makes landing safely easier\nOn a cruise to Mars mission manager said the spacecraft has been performing nominally masses speak for all is well the actual landing is set for November twenty six I'm\nJoe Palca NPR News Pasadena\nCouldn't lose says it as updated its website and software for patients to ensure that blinded visually impaired customers can use screen readers move follows a lawsuit by disability rights advocates who had accused Hulu of violating the Americans with Disabilities Act on chase Stevens NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the artist foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at our cars foundation dot org and the corporation for public broadcasting\nId Alexander you are listening to ... on Georgia Public broadcasting\nThem but you know\n\n\nThings\nThink he'll again\nI Do\nHow beautiful is that Mrs Chanay Kendrick I had an opportunity to speak with her and it's\nThat song is entitled you too and she has two beautiful twin daughters and we would we have in common is that I have\nTwin granddaughter so I actually reached out to her and we had a nice conversation on how it is to have these beautiful wonderful children in our lives you to\nMiss Johnny Kendrick from her album flying\nBefore that mighty Alexander from stir it up the music of Bob Marley with ... coming up next is the latest from Brett good acquainted featuring Ernie what Crum that's right and this is a violent Freeman composition jug ain't going\n... and so\n\nThe\n\nWay\nIt\nDa\n\n...\n... ... ...\n...\nMine\n... ... ...\n\nMm\n\n\n\n\n[noise] Ninety seven forty seven FM double your G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n[noise] now is the perfect time to clean out the garage and get rid of that car you no longer need\nDo face the coming months with a fresh start and by donating your used car to GB believing it a tax deduction called eight seven seven GP be one car or donate securely online at ... dot org slash cars and thank\nJoined us this morning at seven your own gp being\n[noise]\nLive from NPR News in Washington ... Stevens authorities say the Florida Man accused of sending Thirteen package bombs to prominent Democrats he's already charged with five federal crimes as NPR's Quil Lawrence reports the suspect was arrested friday near Fort Lauderdale\nCaesar salad is fifty six years old and has a long criminal record including theft battery and making a bomb threat at a press conference attorney general Jeff Sessions was asked about say our motives I don't know\nTwo years old and has a long criminal record including fast battery and making a bomb threat at a press conference attorney general Jeff Sessions was asked about say ox motive\nI don't know ... and then uh what you might uh normally expect a mayor ... appears to be a partisan but that would be determined by the facts as the case goes forward now I'm not able to comment on that\nAll the targets so far we're prominent critics of President Trump politicians but also former career intelligence officials whom the president has attacked in public speech Trump has continued to denounce violence and appealed for unity he's also resume some of his regular verbal attacks on the press and his political opponents Quil Lawrence NPR News New York\nPresident Trump dismisses any notion of a link between his rhetoric and bomb threats against his Democratic critics Trump is also chastising the media's coverage of his administration to essentially softened his public comments\nWell I think I don't know if\nOut because you know the media's been extremely unfair to me and the Republican Party I think the media\nVery unfair the\nTrump addressing reporters before heading to a political rally in Charlotte North Carolina former vice president Joe Biden says he's pleased that a suspect has been arrested for the pipe bomb mailings but Biden says there's still a need to turn down the political rhetoric W essay choose among the dominant has more on mine's remarks at a democratic rally in Connecticut\nTwo of the pie bump puzzles have been sent to buy\nFormer vice president told more than Thirteen hundred Democratic Party supporters in a tiny school gymnasium and haunt with this country has to come together\nThis division that exists the hatred is ugly and I\nReally actually coming to an end\nMy friends and the other side as well as Democrats understand\nBiden was in ... states democratic candidate for governor Ned Lamont and I'm system questionable district under the John I have as well as the state's junior US Senator Chris Murphy\nWho's speaking to them for NPR News I'm a bong who DOMA in Hartford\nSeveral thousand asylum seekers from Central America have turned down Mexico's offer to apply for refugee status in exchange for shelter and other benefits they're vowing to keep trying to reach the U.S border\nHomeland security secretary Kirstjen Nielsen says every legal option is being explored to keep out people she says I have no legal right to be\nHomeland security secretary Kirstjen Nielsen says every legal option as being explored to keep out people she says have no legal right to be in the United states\nYou're listening to NPR News [noise]\nSecurity is tight in southern Kandahar for parliamentary elections this weekend in wake of the murders of two top government officials the attack by an elite Afghan guards delayed the vote by a week\nA spokesman for ... governor says major roads in the province will remain closed while polls are open unless they happen prior security clearance preliminary election results are not expected to form it November\nAnd then Bob way gas prices are rising supplies dwindle from Harare ... has details on how citizens there are coping\nZimbabwe impose or it's a fuel government overspending is left a shortage of foreign currency to buy the fuel seem Bob gains a spending hours in line at gas stations in anticipation of fuel deliveries driver joined do there had been waiting in line for seven hours\nBefore fuel would leave it to the gas station\nIt's probably going to be another three hours before I get fuel so that's probably a total of ten hours drive\nAs resorted to forming what's up groups to elect each of the wind and waves ... liberal some has created apps to shall we stations if gas for NPR News I'm ... in ...\nMegan Kelly reporter last negotiating her exit from NBC the network canceled Kelly's morning show after the host adjusted it was okay for white people to wear black face on Halloween\nOf former Fox News personality joined NBC two years ago she's in the second year of reporting twenty million dollar a year contract I'm chase Stevens\nNPR News in Washington\nSupport for NPR Thomas from NPR stations other contributors include Carnegie Corporation of New York supporting innovations in education democratic engagement NBA advancements of international peace and security more information is available online at Carnegie dot org\nWelcome to G. P. B. jazz and the Alexander thanks so much for joining me [noise]\nReally they do\nSo one\nYou you do that for me the amount of\nThe chance to be I got\nVery\nMade him\nAnd when my day\nAge nine on\nThe way you know\nAs though I Know and\nBefore that are interesting Anderson from when the sun goes down with I'm just lucky so and so next up we have music from wherever Davis is Chicago chance she'll harmonic chamber ensemble from Havana blue and this is\n\nUh\nNo\nIn New York you\nWhy it must be stolen by email\n\nDo your job to know me in New York\nIt's spelled the three ...\n\n... ... even whispering ground ...\nIn canyons the\n\nSevere making me the\n\n...\nWho\nYou're in New York ...\nMust be doing\nWe dont know\nThe New York could\nWhy must be ... by ... ...\nLives in New York could\nI Love to ... they ...\nDream when San San\n... from a fire a player in\n\nIran in New York\nI Love to live there again\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\nIt's spelled the three Oscars night\n[noise]\nIn New York I Love to ... in\nDream is ... and\n...\nMost far off the land\nYeah in\nAfar off play for I\nI Love to live the ...\n\n\nAnd beautiful voice of Oscar Peterson that's right that's Oscar Peterson singing on I'm In New York\nAnd this is from Jan and Jan's male jazz singers it's just wonderful before that we heard from Christian fans from his latest facing dragons with Frankenstein\nMixed up we have music from chip white who is a fantastic drummer with his project new dedication and Latin roots and the wonderful thing about this project is a two discs project and he has a disk of poetry that accompanies the music desk\nNew dedication and Latin foods and we're going to take a listen to his column about Wayne Shorter and there was one here short one from Wayne in the poetry is read from his book I'm just a drummer in the band [noise]\n[noise]\nOf Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n... here and if you're in your heart I Want you to try something roll up the windows are all sealed inside take a good smell\nCan you smell that that was the great cologne experiments of two thousand for it you should not have gone with the dollar store for that one boy you can lose that old car smell by donating your vehicle one of your favorite causes lights public radio it only takes a few minutes and just like that you supported the station and well you were on your way to a life of better smell\n... dot org slash cars and thanked\nMe investigation continues into the suspicious packages sent to critics of President Trump's when I have the latest also rushing trolls try to influence Americans by reading about football players who kneel during the anthem\nWhat their efforts were aimed at we're sowing discord so if you're attempting to divide people this is a pretty great subject and\nSaturday on weekend edition from NPR News for weekend edition this morning from eight to ten right here on TPP\n[noise]\nFly from NPR News in Washington I'm Shea Stadium\nI suspect in the mail bomb threats targeting comedy Democrats remains in custody after being charged with five federal crimes\nFifty six year old Caesar say I was arrested friday near Fort Lauderdale his former attorney Ron ... says say on a long criminal past and a history it's disturbing behavior I Do keep\nIn touch with his family they're the ones who originally returning to represent him but he's a strange himself from Batman refused to get medical\nI Do keep in touch with his family they're the ones\nWho originally retain made to represent him but he's a strange himself from them and refused to get medical treatment and sadly and Florida like most states it's very difficult to compel medical treatment of someone you love unless you can prove that they're a danger\nTo spin no evidence that he is truly a danger until now\nNo he says he represented say sixteen years ago when he threatened to bomb a utility company that shut off power to a laundromat he owned at the time\nAfter that he says the on filed for bankruptcy and has had balance with homelessness after dialing back his rhetoric earlier in the week President Trump returned to partisan campaign mode after say ox arrest on friday NPR's Scott Horsley reports on Trump's remarks at a campaign rally\nTrump told supporters in North Carolina everyone would benefit from ending what he called the politics of personal destruction he then proceeded to attack Democrats as extreme and radical calling out lawmakers Nancy Pelosi and Maxine Waters by name waters was among the targets of the would be bomber\nTrump also suggested the news media has a role in promoting a more civil discourse weather reporters like it or not\nWe have seen an effort by the media and raised in ours to use the citizens are actions of one individual to score political points against me and the Republican Party [noise]\nThe bombing suspect appears to be a Trump supporter authorities say it's premature to speculate automotive Scott Horsley NPR News Washington\nFormer President Obama has wrapped up a swing through the mid west and NPR's Sam ... glass reports Obama rallied voters in Michigan and Wisconsin to states that help send him to the White House then voted for Donald Trump\n[noise] high school gymnasium\nObama emphasized over and over again the stakes in this year's midterm elections are huge in Michigan Democrats are trying to reclaim the governor's mansion and with several house seats and turnout is crucial\nThat family member who\nYou know as far\nWhether Obama can re energized voters delivered him Michigan two times that still up in the air ... NPR News Detroit\nWhether Obama can re energized voters but delivered him Michigan two times that still up in the air ... NPR News Detroit\nThis is NPR News\nNew report from the non partisan government Accountability Office shows disparities in how schools prepare students for college as NPR's lists of Nadworny reports\nThe findings show that predominantly poor and small public high schools offer fewer academic options\nHigh poverty schools and smaller schools were less likely to offer advanced classes like calculus or physics according to the research those schools were also less likely have advanced placement or AP classes about allow students to earn college credit these are really rigorous classes the kids are taking you know in high school and the idea is\nThat they will help better prepare them for the rigors of college that's Jackie ... with the G. A. L. in addition to preparing students these classes are also like most public four year colleges are looking for during the admissions process students not taking it may be less competitive when it comes to applying to college\nI listen to any NPR knit\nAnimal rights activists are demanding that Puerto Rico close it's only Jew and relocate the animals to sanctuaries a California based animal legal Defense Fund and move organizations cite reports some depth and in proper medical care\nThe agriculture department decided dozens of violations at the zoo in recent years and canceled its exhibited his license in February\nThe forty five acre site has been closed since September of last year when Hurricane Maria devastated much of the\nFederal government isn't supplies to the northern Mariano where residents are bracing for a long recovery from super typhoon you to you to kill one person after coming ashore Thursday as a category five storm\nList NPR News in Washington\nSupport for NPR terms from NPR stations other contributors include the Charles Stuart ... foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org and the corporation for public broadcasting\nWelcome to GB jazz I'm Dee Alexander thanks so much for joining me\n[noise]\nDrummer ... hunter junior from his latest the groove hunter that wasn't titled on him and he's a company by Stacy tailored on tenor\nEric Greek piano Corcoran hold on base with Mr hunter on drums\nAnd before that out of Kansas City we heard from Lani McFadden live at the green lady lounge was get ready mixed up\nThen is Lou Ellen de from by some blues in Balad with special guest Camille sermon on waters of march and\n\nUs take us stone it's the end of the road and the rest of us\nLive longer than you did little sliver of land line gets the kid is might it is that in the ... the bill would it\nBe locked in the world for not in the stone brush\nBragging but he did not being on\nThe wind blowing three\nBig enough to ... get something that is a boy if we can hold on to\nTo end up with ...\nA truckload of radio much song morning with a line\nThe shot up a gun in the ... and ...\nBe in some girl so we're\nGetting some polish moms\nThat drives up and get some money so much\nPoint upgrade to stop by\nLeading them a little bit you let me just throw of non\nCompared to the mound Lamar send them to be in the ...\nPercent the mom more send them to be in the ... the road who look\nDa di di ... dead in both the wrong\nTo draw in\nYo\nYour your your in your ...\n...\n...\n\n\nThen\n\n\n\n\n\nWell now there you have is the family feeling\nTo real Stafford on trumpet big old Alto Bruce bars piano Tim war field tenor David one base in Byron land them on drums oh music composed and a range by Bruce bars and that's from the family feeling why not\nBefore that the latest from rainy Rosen is and David how'd you ice on the Hudson with various to Hamas on to meet my brother here's Nancy Wilson when sunny gets right\nLeave me because\nThe knees\nShe\nChanged it\nWas a\n[noise]\nThis was Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\n[noise]\nYou know selling a car can be a hassle but donating it is a whole different story is split I was taking off your hands off your driveway and turn it into public radio and maybe even had tax deductions to resolve the host marketplace and here is how to do [noise]\nEight seven seven GP beat one car or donate securely on line a gp dot org slash cars ten thanks [noise]\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid to the news is on Peter Segal and all I can say is we'll stop when they do and join us for it all started celebration was all our panelists as right and all of them\nAnd special get big wigs that's just one year away from being able to buy the dream that's really neat you're Twenty years of doing the weight weight from\nThis morning at ten on G. P. B. [noise]\n\nLive from NPR News in Washington I'm ... I'm fifty six year old Florida Man is being held in the mail links have Thirteen potentially explosive devices targeting critics of President Trump is NPR's Miles parks reports the suspect is already facing five federal charges\nTeachers say August charges interstate transportation and explosive illegal mailing of explosives threats against former presidents threatening interstate communications and assaulting federal officers he faces up to forty eight years in prison if convicted according to the Justice Department that has a long criminal record according to public data including a charge related to bomb threats\nHe faces up to forty eight years in prison if he's convicted according to the Justice Department sick along criminal record according to public data including a charge related to a bomb threat in the early to thousands\nPresident Trump spoke about sex arrest saying quote these terrorizing acts are despicable and have no place in our country seven was never allow political violence to take root in America Miles Parks NPR News\nPresident Trump is accusing the media of using the actions of one individual to undermine him and the Republican Party\nTrump tweeted earlier that the package bomb story was diverting attention away from the mid term elections Facebook is removed a new batch of around based accounts that spread disinformation to people in the U.S and the u._k.\nAs NPR's Alina Selyukh reports the company says each removed for than eighty two around like the counts pages and groups from Facebook and Instagram\nFacebook says the Iran linked to counts typically pretended to be us or UK citizens and shared politically charged boasts for example about race relations or immigration aimed at American and British audiences\nThis activity dates as far back as twenty sixteen but Facebook says it has not noticed any targeting of the midterm elections which are in a daze here's Nathaniel glide your head a Facebook cyber security policy\nSowing discord and it was trying to target or socially to visit issues as opposed to being specifically targeted on events that are about to our\nFacebook says it still investigating who is behind this coordinated disinformation campaign and has not linked it to the Iranian government Alina Selyukh\nNPR News World Health officials say efforts to contain in Boulder outbreak in the Democratic Republic of Congo are still being hampered by violence NPR's read them and has more\nThe outbreak is an eastern region that has seen decades of conflict between multiple rebel militias and government forces in the last week alone one of these groups killed two members of an Army Medical assistance team and another launched an attack in which around two dozen civilians were killed or kidnapped\nWith each new attack health workers responding to the bowl a crisis have had to suspend their work and the violence has also fueled suspicion of health workers people in affected areas who resent the government sometimes viewed Ebola responders estate agents\nThe last month the tally of new infections has risen from about ten a week to nearly thirty a week officials safer now it doesn't look like the numbers will spiral beyond that that the risk is there ... NPR News this\nHe was defense secretary Jim Mattis\nSpiral beyond that but the risk is they're married men NPR\nNews this is NPR\nHe was defense secretary Jim Mattis says the slaying of Washington Post journalist ... undermine stability in the middle east\nMad as telling a security conference in ... that the U.S will take additional measures against the responsible parties\nSaudi prosecutors acknowledge that ... killing at the kingdom's consulate in Turkey earlier this month was premeditated Saudi officials had said earlier that ... died accidentally during a fight\nPresident Trump ramped up his criticism of the Federal Reserve again this week but Steve Beck and reports that policymakers are showing no signs of bowing to pressure to stop raising interest rates\nTrump who called the fit crazy after it raised rates last month for the third time this year told the wall Street Journal the fed poses the biggest risk to the economy because it is raising rates too quickly\nBought the fed remains on track for a fourth rate hike before years and and more next year judging from official comments to vice chairman Richard Clara to a Trump appointee says monetary policy is still accommodated of growth\nAnd says further gradual rate increases are warranted Cleveland Federal Reserve bank president Loretta messenger says higher rates are needed to keep the economy from overheating and to avoid financial instability for NPR News I'm Steve ...\nAnother sell off pushed shares lower on Wall street friday but the marketing recovered from steeper law sister earlier in the session before the Dell the Dow Jones industrial lost two hundred Ninety six points the NASDAQ down one hundred fifty one this is NPR News in Washington\nSupport for NPR comes from the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org and listeners like you who donate to this NPR station\nYou are listening to a gp jak on Georgia Public broadcasting Andy Alexander\n\nThe Slager from dedication with fun song a song dedicated to Sonny Rollins who was a constant mentor because he came up at a time when Sonny Rollins playing and the strength of his personality became his constant mentor\nBefore that we had words and music from genie Tanner\nThe song was entitled red beautifully sun by Elaine Denny here's music from Andy bay from American song\nLonely town well\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n... ...\n\n... ... ... ... ...\n\n...\n...\n[noise] [noise]\n[noise]\n\n\n[noise] back to back main gifts from east coast thing\nWith memories of view and east coast thing take for actually\nWith Charles maintenance on base Jimmy Knepper on trombone Sufi Heidi on tenor Clarence Shaw on trumpet Danny return on drums and a young uh bill Evans actually months before he embarked on his ... with Miles Davis\nComing up next\nMusic from that great lady Carmen McCray singing music of mark with\nYou'd ask me now\n\n...\nAnd then people\nShoes that you love me\nKnow one above me\nLot of dumb thing did I say\nSo busy being\nWas gay show\nI ignored what was\nI\nMay lie to\nMe and blue\nAnd ...\nWhere's your when\nYou were mad\nMe\n\n\nMm\n\n\n\n\n\n\n\n[noise] was Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. P. H. D. Rome portable Georgia Public broadcasting radio network [noise]\nHey this is David Greene host of MORNING EDITION I'm here to talk with you about that poking feeling the one that\nKeeps reminding you support public radio you can support the programs you love by donating your used vehicle that old car truck could be worth hundreds of dollars to the station or you have to do is call and you might even receive protected us just\nGo to ... dot org slash cars or called eight seven seven ... one car and bank [noise]\nMe investigation continues into the suspicious packages tend to critics of President Trump's when I have the latest also rushing trolls try to influence American by reading about football players who kneel during the anthem\nWhat their efforts were aimed at we're sowing discord so if you're attempting to divide people this is a pretty great subject and\nSaturday on weekend edition from NPR News for weekend edition this morning from eight to ten right here on TPP\n\nLive from NPR News in Washington ... and investigators\nAre examining potentially explosive pipe bombs sent to critics of President Trump and the background that the suspect accused of sending the packages NPR's Hansi Lo Wang reports that a Florida Man is facing federal charges\nCesar ... facing five counts including the illegal mailing of explosives threatening former presidents and assaulting federal officers ... director\nThat's including the illegal mailing of explosives threatening former presidents and assaulting federal officers the FBI's director Christopher Wray says a nationwide investigation has recovered Thirteen improvised explosive devices\nEach device consisted of roughly six inches of PVC pipe a small clock a battery some wiring and what is known as energetic material\nRacists say I was identified through a fingerprint on an envelope he allegedly sent a congresswoman Maxine Waters a Democrat from California I've already said there may be more explosive devices in the postal system undo along NPR News New York\nCity where people are still heading to the U.S border from Central America to seek asylum but their numbers are still in the thousands they projected a proposal by Mexico's president for\nMigrants to apply for refugee status in his country in exchange for benefits the Pentagon is preparing to send hundreds of active duty soldiers to aid border patrol agents at the U.S southern border when the asylum seekers arrive\nHomeland security secretary Kirstjen Nielsen was on hand yesterday as the last piece of uh renovated border fence was installed in Calexico, California has max Rivlin Adler reports Nielsen calls the first completed section of President Trump's proposed border wall the fulfillment of a promise\nSwings by border patrol agents and officials Nielsen watched as two local welders attached to the fence a plaque bearing President Trump's name and bold letters was Nielsen's below it and smaller font afterwards she stressed the importance of defense for maintaining safety in the area\nUntil this project was finished our agents for trying to stop illegal crossings with ... dated fencing that had not been replaced since the Nineteen nineties\nBefore the renovation began apprehension by border patrol had already dropped her record lows for NPR News I'm ... and Calexico, California\nMost street closed out the week with another model till training session as NPR's Alina Selyukh reports stocks tumbled at the start of the session on concerns about Tucker earnings but recovered slightly by the closing bell\nBeen a very turbulent weak on Wall street with stocks soaring one day and plummeting the next day after the bell on friday the Dow was down more than one percent the U.S in the five hundred one point seven percent and the NASDAQ more than two percent\nThe as and be and the Dow have erased their gains for the year two companies in particular had prompted this sell off Amazon and Google sparing company alpha that\nThe two giants had reported mixed quarterly results solid profits but disappointing sales\nOff Amazon and Google sparing company alphabet and the two giants had reported mixed quarterly results solid profits but disappointing sales\nAlina Selyukh reporting you're listening\nTo NPR News [noise]\nSecurity is tight in southern Kandahar for parliamentary elections this weekend in the wake of the murders of two top government officials\nThe attack diner leak Afghan guard delayed the vote a week after thirty to thirty four problem says had already gone to the polls at least fifty people were killed when insurgents long scores up attacks across the country after two days of voting last weekend\nA spokesman for Kandahar governor says major roads and the province will remain close well polls are open unless they have a prior security clearance preliminary election results are not expected before mid November\nAtop pork producers says it will cover some controversial pawns containing hauled manure had many of its farms details from NPR's Dan Charles big hog farms\nOften pumped manure into open air ponds or lagoons we're natural bacteria help but to decompose but in North Carolina people living near those farms successfully sued a pork producer for the smell\nAnd during Hurricane Florence dozens of manure lagoons overflowed\nSmithfield Foods the biggest pork producer in the country now says it will put plastic covers over the lagoons that most of its hog farms in North Carolina Missouri and Utah the covers will just keep water out and capture odor is it will capture a lot of methane which is a powerful greenhouse gas\nSmithfield will recover that gas and use it instead as an energy source Smithfield plans to finish the job within ten years Dan Charles NPR News\nLos Angeles Dodgers beat the Boston Red Sox three to two after home run by max Muncie broken Eighteenth any time that ended the longest World Series game in major league history Boston leads to theories two games to one\nThis is NPR News\nSupport for NPR comes from NPR stations other contributors include their doors do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health and Americans for the arts\nI D Alexander you're listening to G. P. B. jazz on Georgia Public broadcasting\n[noise]\n... my ...\nCan ...\nBelieve in and they'll know where it out there oh Joan\nAbove above my\nPay and they um\nAbove my\nAn event in without them how much do\nNo no no no no\nBe a\n\n\nThat was Coleman Hawkins from the best of Coleman Hawkins was I'm beginning to see the light would kill Thomas on trumpet the thick and thin on trombone Tommy Flanagan piano Wendell Marshall based ... feet Johnson on drums that was recorded January\nThat's on trumpet ... Dickinson on trombone Tommy Flanagan Seattle Wendell marshal bass oh the Johnson on drums that was recorded January eight Nineteen sixty\n... Coleman Hawkins all stars and before that the unmistakable voice a little Jimmy Scott with\nVery truly your\nHere's music from John Christie from the song is Jim nighttime\n\nNah nah it was my mother\nA loan\nBall no well the whole nine\nThink ... to ... yeah\nWrong and no no\nBe kidding me very one is to\nTry to do that\nMy brother would\n...\nOh\nNo no well\nWell we've got to be oh\nOh\nA I Am one mom\nHere and there was my brother\nThen I don't know the ... to me [laughter] [noise] he's a\nUm never knew\nHe's a\nNo ... no\nOh man went\nTo the ...\nNever know I\nKnow man\nOr\nA\nHe\n", "year": "2018", "show_name": "GPB Jazz", "city": "Chatsworth", "day": "27"}