{"month": "10", "state": "CO", "station": "KRCC", "content": "You can catch the takeaway this morning at eleven o'clock this is southern Colorado was NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI seem a hunter KCBS stark them all and K W CCF in woodland park\nOn line at K. R. C. C. dot O. R. G.\nHigh temperatures in the upper thirties and forties today snow is expected for the central mountains and another round of freezing temperatures is possible tonight for the southeastern planes and the San Luis valley rain and snow mix expected in Colorado Springs it's nine o'clock\nYou made this mess and now we have to clean it up and time is running out a new report gives reasons for insurance and hope [noise]\nFrom W. A. M. U. and NPR in Washington DC is one ... [noise]\nHey there I'm Joshua Johnson today on one a controlling climate change the report is clear at this pace are warming planet we'll show major signs of irreversible damage by the year twenty forty we know what to do but that's not the problem the problem is\nWe'll show major signs of irreversible damage by the year twenty forty we know what to do but that's that's the problem the problem is getting the world's governments to do it\nHow do we overcome the political challenges of fighting climate change and how much do individual actions like planting trees or going vegan really make a difference in saving the planet\nWe love to hear from you email one at a at W. A. M. U. dot org comments on our Facebook page or tweet us at one [noise]\n\nLive from NPR News in Washington on corporate Coleman the national Hurricane Center says hurricane Michael is just off the Florida Panhandle with top sustained winds of one hundred and forty five miles per hour Florida governor Rick Scott says greater danger is from the water he says the coast will get it leads to twelve inches of rain\nSo thinking about that a foot of rain in some parts of the panhandle again prepare for major flooding from the store the national Hurricane Center is forecasting storm surge to be between nine and Thirteen feet\nThat means of water will come miles in shore and could easily rise over the roof so houses once\nThe hurricane makes landfall and we'll move north east into Georgia they will lose strength but it's still expected to be a tropical storm then it will push into the Carolinas before ... into the Atlantic ocean\nNow that Brett Kavanaugh has been sworn in as a Supreme Court justice abortion rights groups are gearing up for what they expect to be more difficult fight in the years to come Planned Parenthood is unveiling a new strategy designed to prepare for the possibility that roe versus Wade could be overturned NPR's Sarah McCammon has more\nWhere the cabinet on the court abortion rights opponents see a new opportunity to weaken or overturn roe the Nineteen Seventy three decision that legalized abortion nationwide Planned Parenthood's Don McGahn said abortion rights advocates expected increasingly difficult environment\nAlready women across this country have to access funding they have to access transportation they have to access housing that have to access support\nNetworks Planned Parenthood officials say they will focus on shoring up abortion rights in state legislatures expanding access in states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nImmigration and Customs Enforcement officials will inspector privately run immigration jail in Southern California it's been cited for violations including poor\nCustoms Enforcement officials will inspector privately run immigration jail in Southern California it's been cited for violations including poor medical care and news is in cells from member station KCPW Q. E. D. for ... Romero reports\nA contractor for ice will investigate the Atlanta processing center which is operated by the GEO Group one of the largest private prison companies nationwide but a former detainee Pelosi ... says he doubts that new inspection will improve conditions by the up to two thousand people health there\nThat has been going on for years they know about this\nEvent goes that he repeatedly said detainees suffer seizures and ... on the floor without proper medical care\nBut I made it will get their either ordered bang up I'm reading yesterday\nThe GEO Group said that company takes the federal inspectors report seriously most ice detainees are locked up in facilities run by private companies according to a new report by Syracuse University for NPR News I'm fighting that chapter on NATO in San Francisco\nOn Wall street the Dow was down three hundred and sixteen points It's NPR\nA new report from the government Accountability Office finds cyber flaws in the Pentagon's latest weapons systems the geo report says the Pentagon is just starting to grapple with numerous vulnerabilities common problems included passwords that were easy to guess or weren't even changed from the factory setting\nThe report cites Pentagon officials who say their systems are secure\nGuatemala's former vice president has been sentenced to Fifteen Years in prison in the country's first major verdict against corrupt officials Maria Martin reports the case was brought by a controversial un backed anti corruption commission\nFormer vice president or somebody that he was charged with defrauding the state of what the mother of millions of dollars for purchasing chemicals that were to clean the contaminated lake about these non in reality the chemicals did nothing but make by the the rich in this case the press here cause magic waters\nCivil society groups are hitting the verdict as historic\nThey said this shows the un backed anti corruption commission known as CCD has indeed been effective in fighting corruption at the highest levels\nBut did they served under former president of it is more than enough he's also in person facing charges and other corruption cases in which ... is also implicated for NPR News somebody um arts and\nA private TV channel in Turkey is airing footage that it says shows the missing Saudi Arabian critic Jamal ...\nFor NPR News I'm a ...\nA private TV channel in Turkey is airing footage that it says shows the missing Saudi Arabian critic Jamal ... he went into a Saturday consulate in Istanbul, Turkey last week and vanished the Saudi Government says it doesn't know where ... is turkey says it's suspects he was kidnapped or killed\nOn core of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\n\nAnd it's critical election year you can count on Ninety One point five K. R. C. C. to bring you the information you need from NPR in the Ninety One point five ... newsroom we have the best journalists bringing you intelligent insightful reporting to help you understand the issues and the candidates\nBut quality cost money as a nonprofit media organization we looked directly to you to help pay the costs of our services becoming part of the team contribute at K. R. C. C. dot org today thank you [noise]\n\n\nThis is one day I'm Joshua Johnson in Washington ten to fourteen years that's how long you and I have to do something about our changing climate now it's hard not to sound melodramatic reading the latest findings from the Intergovernmental Panel on climate change\nTo limit global warming we will need and the reports words quote rapid far reaching and unprecedented changes in all aspects of society unquote the estimated cost fifty four trillion dollars\nThere is no precedent for pulling off something like this and the report says we are rapidly approaching a point of no return but if we can make changes now we can limit the warming of our planet\nIs there the political will for different countries and industries to come together or should we just start taking lots of pictures of coral reefs now so we can tell our kids all about them when they're gone joining us to discuss it is Coral Davenport energy and environment reporter for the New York times Karl welcome back to the program\nHi great to be with you and in Tucson, Arizona one of the authors of the IPC report Diana Lieberman is a professor of geography and development at the university\nTucson, Arizona one of the authors of the eye PCC report Diana Lieberman is a professor of geography and development at the University of Arizona professor Lieberman welcome great to be with you we also welcome your questions and thoughts about this report and about the prospects for ... fighting climate change effectively\nEmail us one a at W. A. M. U. dot org tweet us at one a or comment on our Facebook page\nLet's begin Doug professor live from and if we could with a comment from the chair of the IPC the group behind this report who suddenly he's part of what chair leaf said at the conference where the report was released\nClimate change is occurring already and affecting people\nBefore systems and live when it was more around the world [noise] every degree of warming methods\nThere's tremendous benefit and limited to at one point five even sensors in terms of their editors public as well as a Cuban sustainable development [noise]\nProfessor maybe a good place to start will be to put the power of a degree in to context we'll be talking a lot about one point five degrees Celsius into resources and to point seven degrees Celsius\nHow much of a difference to a degree or half degree really make when it comes to ice caps melting or reefs disappearing or the impact on shoreline so you can you give us a sense of how powerful a degree is\nThree marketing on Ninety One point five K. R. D. C. underwriters reaching the people most likely to shop and their businesses support their non profit and buy tickets to their show to learn more about corporate important called genetic seven one nine four seven or eight year oh why oh Ninety\nOne point five cares DC is dedicated to covering southern Colorado and the Rocky Mountain west your membership directly funds are journalism thanks for supporting Ninety One point five K. R. C. C.\nNPR on Ninety One point five through your cc you supported locally by the Colorado health foundation proud supporter of Ninety One point five K. R. C. C. and southern Colorado more about the Colorado health round Asian and their mission to improve\nLucian proud supporter of Ninety One point five K. R. C. C. and southern Colorado more about the Colorado health foundation and their mission to improve the health of Coloradans throughout the state is that Colorado health dot or\nSupport for NPR comes from this station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from math ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees IOM dot com slash NPR\nThis is one a I'm Joshua Johnson we're discussing climate change and how long we have left to stop or a warming planet from going past a point of no return and what we can do about it there's a lot we can do but are we willing to do it\nWe're discussing it with the University of Arizona professor dying of liver men who helped contribute to this new report and Coral Davenport who covers energy and the environment for the New York times you've already had quite a bit to say we got this message from Andy who was an oyster farmer in Alabama here's what Andy left in our inbox\nWhen I moved here in Nineteen eighty there were Marsha ... shrimp crabs and dozens of fears\nMuch of that has gone I bought my first appearance on each well it was destroyed two weeks later by Hurricane Isaac I rebuilt a lawsuit again tonight and twenty Seventeen and then again to Gordon in twenty eight team now I'm watching my approach\nHandy thanks very much for writing in sorry to hear about what's been going on with your peers and I know that hurricane Michael is very worrisome is just about\nTo hit the Florida Panhandle so I Know that you're watching that very very closely I Wonder professor liver men if you could speak to part of what Andy\nSaid I've seen a lot of my friends on line saying seed climate change and people say there's no climate change and look at these hurricanes that we've been having\n... how much should the average person be packing things like hurricane Michael directly to what we're seeing from from climate change there's still a lot we don't know about the cycles of severe weather but what do what would you say to people like Andy who are worried about this kind of thing\nWell festival about less heartbreaking I had paid ... ... but um [noise] we can't say that the American directly related to\nMichael but um [noise]\nWe can't say that the American directly related to global warming but we can say is the ... the hurricanes are increasing as a result of global warming because all my atmosphere had more energy can hold more water [noise] so\nThe chances of these sorts of extreme events whether it's harkens or extreme rainfall or heat waves are increasing with every little bits are warming\nMe to a few more of your comments Sarah emailed I feel overwhelmed by the talk about climate change\nAnd don't feel like there is a unified voice out they're letting families knew what concrete steps they can take to make a difference for our family this has led to ever present feelings of helplessness anxiety and guilt about the choices we make every day Sarah we will be talking about some concrete options in just a moment but let me get to a few more\nThoughts that have come in the U.S for ... emailed\nYou should stop framing this as what will politicians do politicians reflect the people that voted for them half the voters in the U.S ... Donald Trump's tweet the global warming was a Chinese hopes and voted for him anyway that just goes to show how important the issue as to the people in this country\nCruel downpour I Wonder if you could respond to Joel's email I mean the president has committed to taking us out of the Paris Agreement he kind of questions the provenance of the agreement by saying well who wrote it up let me see road and then I'll believe it does Joel have a point\n[noise] oh well in in terms of um ... policies being the policies that address climate change on the U.S really isn't a\nA distinctive place right now I think I'm Around the rest of the world we do see an expression of well by leaders\nTo um enact policies to limit greenhouse gas emissions I think that there's a lot of questions on how strong list policies actually are um you know the analysis shows that they're they're not strong enough to limit warming even to that that initial two degrees but the in the U. S.\nUm what we see it's President Trump not only you know essentially questioning that the basic established I have of\nClimate change but but also moving to undo existing climate policies I'm President Trump had already moved forward with policies to undo regulations on greenhouse gas emissions from power plants um\nThe sting climate policies I'm President Trump has already moved forward with policies to undo regulations on greenhouse gas emissions from power plants on undo or weekend um regulations on greenhouse gas emissions from cars\nUm and he had said that it is his objective to promote the use of coal\nI'm burning coal is one of the leading contributors to greenhouse gas emissions\nA President Trump wants to promote the use of calling us and abroad um one of the findings of this report is that in order to um limit greenhouse limit climate change to um you know to to to the sort of least destructive\nUm level of warming\nUm the use of coal will have to ah basically go down to zero\nI'm by by twenty fifty so ... basically no more on just about no more coal and and and and it is you know that that it that is an extremely disruptive policy recommendation um there's no question that there are industries and people who will be harmed\nWho who will have their livelihoods disrupted by policies that go in that direction and and that's\nLooming ever never just once I started to shore call but I Wonder in terms of the politics behind this I hear you on I I totally hear you on how disruptive is has its own like coal is so\nInterwoven in the network of America's energy grits kind of hard to just yank it all out I Wonder though in terms of the voices on the world stage who we we know that there are voices who were saying well poll it'd be really hard to pull out\nTo get the sense of there's anyone in the world stage saying tough our planet is only home you light pole tough we got to get rid of it deal with it on you or California so Jerry Brown the governor of California for sure\nAnd many of the ... the president of France has sought to kind of a step in and um\nHe he's trying to carve out a place for himself as as a as a leader on climate change it's it's not difficult for France to take that position because France um doesn't really use coal\nUm so but but but we I mean we absolutely see world leaders saying you know this is what needs to happen [noise]\nUm [noise] in China it's very interesting because um China is the world's largest um greenhouse gas polluter and is a massive user of coal at the same time we're off the the Chinese government\nWorld's largest um greenhouse gas polluter and is now said user of coal at the same time we're ... the Chinese government has moved forward with I'm actually in acting um prices on carbon ah they're they're and they're an acting a cap and trade system that would force\nUm carbon polluters called polluters to essentially pay attacks or the um I did in in order to pollute which is designed to drive the market away from from greenhouse gas has an idea that was invented in the United states but as\nI'm considered sort of politically toxic here in China they can implement it by ... they don't have to deal with that Congress voting against at Iraq and in the United states\nKind of doing it and I do want to talk more about that idea of carbon taxes we continue in just a moment but let me get to a few more comments or Brian emailed\nWe have no leaders anymore with the skills or courage to do what's right regardless of the political cost we will keep polluting as long as the price of fossil fuels is low\nWould be interested to hear from some of you listening who you trust who you think some of the leaders are politically\nIn this country around the world who you believe are sincere in their push to do something significant about climate change is there anybody that you think is for real and saying that we're going to make this happen or maybe if you were active with\nA politician or a government leader or a government agency that's doing something tangible that you feel people should know more about we love to hear from you what gives you hope\nThat climate change is something that is actively being worked on where you are email is one a at W. A. M. U. dot org by the way we've been talking in terms of degree Celsius yes I Know where we are\nIf you need a little conversion one point five degrees Celsius we mentioned one and a half degrees and two degrees for those of you don't have a conversion calculator in your head one and a half degrees Celsius is about two and a half to point seven degrees Fahrenheit and two degrees Celsius is about three and a half degrees Fahrenheit about three point six degrees anyway\nTom posted on our Facebook page one be quote unquote global warming scare first appeared long ago it was made a political position by the Democratic party that immediately convinced me that the manmade weather change is nothing but a political hoax to fool the stupid professor liver and what would you say to tell them\nThis ... this is Christoph ... this is Michael from spirit we seem to Ninety One point five K. R. C. the music having PMDD need Ninety seven Ninety two week\nProgramming on Ninety One point five K. R. C. C. is supported by your optics the Colorado are glasses and sunglasses emporium open seven days a week and the promenade\nKay Orr cc is supported by your optics the Colorado eye glasses and sunglasses emporium open seven days a week and the promenade shops at ... and in Denver more information is online at your optics dot net your optics the art of optics\nBy Colorado State university global campus in online State University offering career development through bachelor's degrees master's degrees answer to if it gets a completion more as the as you global dot edu\nSupport for NPR comes from the station and from loved me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\n[noise] more at alliance for a lifetime income dot org\nBack now to our conversation with Coral Davenport of the New York times and University of Arizona professor dying of liver meant we got a number of messages from you in terms of how you are trying to make an impact with the fight against climate change here is a little mash up of two of the messages we got this is Amy from Chesapeake in ... in Michigan listen\nI'm getting a thought to slash ... slash feeling powerless and that Khan scale enough to stop the path of destruction that Iran\nWiped out some ism comes because I Believe that what's happening to the world that is happening at a corporate level and I'm Still\nMore companies get on board and care about the environment that feels like we're kind of on the inevitable I have um two thousand for it or you will be here before we know it and we will reap the consequences\nThanks Geoff an Emmy for sharing your thoughts with us ah speaking of the corporate path there are some corporations who are taking a position in the fight against climate change including with regards to the carbon tax Melissa tweeted\nChina uses more than twice as much coal as the U.S hard to believe some carbon tax is going to make much of a difference considering their population let's talk more about carbon taxes with one more of our guests joining us from London\nTed holstead is the chairman and CEO of the climate leadership council Ted welcome\nMore about carbon taxes with one more of our guests joining us from London Ted holstead is the chairman and CEO of the climate leadership council Ted welcome to want to be\nGood to be with you ... what is the climate leadership council it is a group or that is co founded by a\nWhite actually the brought us climate coalition in us history to back a national solution is pushing for a carbon tax where all the money is related to the American people in the form of ... of ... of a dividend\nWho were some of the backers of the council where does the funding come from so um the council is ah does not accept\nCorporate contributions but our founding members include for the ah oil major is the largest car manufacturer in the United states the largest utility but also the largest a solar company in the United states a very broad coalition it also includes two leading environmental groups and opinion leaders from across the political spectrum ranging from\nBen Bernanke you to Janet Yellen to Larry Summers\nAnd of course our plan is named after former secretaries of state James Baker and George Schultz the Baker shields carbon defense plan but Joshua let me clarify we have there is a separate spin off organization that is a lobbying organization and that now has corporate funding including from Exxon\nOkay and that is connected to the organization or use it as they spin off but is there still a connection in any way or completely separate uh it is a separate\nOrganization that is the advocacy arm of the climate leadership council so the council develops this groundbreaking breaking plan were all sides wind and Americans for carbon dividends which is co chaired by former Republican Senate majority leader Trent Lott and a\nA center bro that group lobbies for this plan and it now has money from oil natural gas solar wind and nuclear power interests\nCoral Davenport let's take a step back before we get into the plan that the climate leadership council is advocating more specifically defined this term carbon tax for us what exactly is a carbon tax\nShore sell 'em\nThe idea of a carbon tax is them and each time I have a carbon dioxide emitted into the atmosphere um you can put a price on how much economic harm it causes\n'em and add in in ... important\nAnd how much economic harm it causes I'm and I'm In ... and ... and important note on that as the the economist who came up with with that idea his name is William North house\nHe's a professor at Yale I'm was just awarded the Nobel Prize for this idea on Monday I'm the same day that the IPC came out with this report which heavily sites I'm professor north houses work\nUm so he came up with the idea of every ton of carbon um traps heat in the atmosphere and you can put a price on how much\nEach kind of carbon hurts a the global economy um and and there's a range for how much that costs that it it can range from um fifty dollars a ton to a hundred dollars a ton um you know there there's there's debate about about how much\nUm actual harm it can cost but once you sort of place that price on carbon um then you are can essentially um create attacks\nI'm at a price on carbon or attacks on carbon that you would impose upon polluters of carbon dioxide no no no a carbon\nSource or Coolidge want to be really clear in terms of who the taxes paid on I mean if I Am a carbon so do I pay\nThe pollution from automobiles does the carmaker pay a carbon tax for producing the vehicle that ... carbon dioxide or does the oil company pay the carbon tax for finding the gas and loaded term I actually\nMost likely you pay at a as a car driver I'm older\nAnd and and and you you would so um we don't have carbon taxes in the U. S.\nUm so in some ways this this is sort of um you know in intellectual debate although other countries are are are working are sort of further along on this but the idea is\nUm if this would affect how you drive it would probably um be taxed based on how much carbon a carbon dioxide would be a produced by burning 'em by burning gasoline show it would most likely be added to the cost of the gasoline that you put in your car so if you're going to put in\nAnd in Mount of gasoline in your car that would produce a certain amount of carbon dioxide when you burn it that would raise that tax would raise the price of your Kathleen and the idea is then you would be motivated to buy a car that use less gasoline essentially that that's how it would\nDrive the market so consumers would want to buy electric cars would want\nBy a car that you didn't laugh gasoline essentially that that's how it would drive the markets have consumers would want to buy electric cars would want to buy cars not ... not out at censored as\nA moral sensibility but because actually at a price on carbon and would make it cheaper to use an electric car it's a it's a powerful market signal\nTo hosted the yesterday Exxon Mobil committed money lobbying Congress for a price on carbon give us a sense of what that plan involves and why it's getting support now\n[noise] so um the Baker shields carbon defense plant is based on four pillars of the first is a robust carbon tax starting at forty dollars per ton which would actually be the highest carbon tax of any\nA leading emitting country all of the money would go directly back to the American people in the form of a carbon dividend\nWhich means that the vast majority of American families including the most vulnerable would win economically from this plan\nAnd a third pillar is that we would trade a high price on carbon in a growing price on carbon\nFor some of the carbon regulations simply because a carbon tax is a more cost effective way to solve climate change\nWho I just wanna make sure I understand so the plan if the plan went into effect there would be a tax on the carbon that I Am it with my car or my motorcycle or whatever and then that the revenues from that tax would come back to me as a taxpayer in the form of a of a dividend is that what you called\nYes so a family of four would get approximately two thousand dollars per year\nIn dividends and here's how the system would work the more you pollute the more you pay the less you pollute the more you win so Seventy percent of American families would come out economically ahead and that's what's so transformative about the dividend concept which is that we can have\nThe most effective climate lever which is a carbon tax in a manner that is popular populist and equitable for the American people\nHow much of that money would be spent on environmental programs are planting forests or doing research on cleaner energy with all of it just come back to us as taxpayers\nA hundred percent would go back to the American people and that is what makes the plan a popular and politically viable because in cap on Capitol Hill you'll never get the two sides to agree on how to spend the revenue Republicans will say well let's spend on deficit reduction are lowering the corporate\nWell because in ... on Capitol Hill you'll never get the two sides to agree on how to spend the revenue Republicans will say well let's spend on deficit reduction are lowering the corporate income tax Democrats will say well let's spend it on a renewable energy innovation or a low income support\nVoice and the lightning rod in the black lives matter movement and now he's selling his own story next time on one end\nRecord numbers of black women are running for office but is the Democratic party ready to support\nGoes to the DNC when I notice systemic issues as far as opportunities for black lung and\nThe DNC and getting black women at the at the table that next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five K. or CC's southern Colorado's NPR station\nProgramming on Ninety One point five kill your cc is supported by bourbon brothers smoke house in ... north gate and bass\nPro Dr Colorado own southern gourmet cuisine and barbecue hosting private parties and offering catering packages for events more at bourbon brothers dot com\nThis southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ... cc law hunter tc of ... M K W CCF them woodland park\n[noise] [noise]\nHi I'm Steve Kearns welcome to ... civics class where palm or high school social studies teacher ... answers questions about our upcoming election today we ask does my vote really matter\nIf you're not voting that means that my vote gets to count twice [noise] no I'm not voting twice but I have more power in my vote because you chose not to them now that of course is you're right not to vote\nBut think about it this year you're going to be voting on things like the governor of Colorado who gets to control the state legislature and they make decisions like with our tuition fees going to be like at colleges and universities in Colorado [noise] that you might want to think about but if not that's fine that'll make my vote all the\nMore important [noise]\nJoined us next week when we discuss who's on the ballot this November [noise]\nFrom NPR News in Washington I'm Laurie London [noise]\nHurricane Michael is now an extremely dangerous category for storm and continues to grow forecasters say it will make landfall around mid day to day posing a threat of catastrophic searches of the water\n[noise]\nJoined us next week when we discuss who's on the ballot this November [noise]\nLive from NPR News in Washington I'm Laurie London [noise]\nHurricane Michael is now an extremely dangerous category for storm and continues to grow forecasters say it will make landfall around mid day to day posing a threat of catastrophic\nSearches of the water and roof shredding wins FEMA says it has nearly three thousand people in the field ready to assist and as NPR's Rebecca Hersher reports Michael is predicted to be the worst hurricane ever recorded on the Florida Panhandle\nMichael's maximum sustained wind speeds or near one hundred forty five miles per hour that strong enough to rip off ribs down trees and overturn mobile homes hurricane warning in effect for hundreds of miles of coastline along the Florida Panhandle storm surge of at least nine vertical feet is forecast near Panama City Florida\nUp to twelve inches of rain could cause flash floods in some areas and tornados are also possible according to the national Hurricane Center Michael could get slightly stronger before it's powerful core makes landfall in Florida this afternoon\nThe storm is expected to turn northeast says it hits land moving across Georgia and South Carolina on Thursday before busting out into the Atlantic on friday Rebecca Hersher NPR News\nThe U.S Supreme Court is weighing in on lawsuits over a citizenship question the Trump Administration wants to add to the twenty twenty cents is NPR's Hansi Lo Wang reports the administration is asking the court to stop lawyers from questioning administration officials under oath about the citizenship question\nCourts had ordered to key officials behind the citizenship question to testify out of court they include coverage secretary Wilbur Ross who approved adding the question to the ... census and John Gore the acting director of the Justice Department division that the administration says it needs the question to better and for the voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put both of their depositions on hold temporarily until the high court decides whether to block them permanently dozens of states cities and other groups are suing for the removal of the citizenship question\nIf you'll discourage households with non citizens from participating in the census and harm the accuracy of the information collected ... NPR News New York President Trump\nQuestion to testify out of court they include coverage secretary Wilbur Ross who approved adding the question to the twenty twenty senses and John Gore you acting director of the Justice Department division that the administration says meets the question to better enforce the voting rights act\nSupreme Court Justice Ruth Bader Ginsburg has put both of their depositions on hold temporarily until the high court decides whether to block them permanently dozens of states cities and other groups are suing for the removal of the citizenship question\nIf you will discourage households with non citizens from participating in the census and harm the accuracy of the information collected on do along NPR News New York\nPresident Trump is repeating and an supported assertion that California Democratic Senator Dianne Feinstein leaked a letter written by the woman accusing Supreme Court justice Brett Kavanaugh of sexual assault\nTrump's comments at a rally in Iowa last night prompted the crowd chanted lock her up Feinstein is the ranking democratic member of the Senate Judiciary committee she denies leaking the letter that led to the firestorm over Kavanaugh's confirmation\nOn Wall street tech stocks are leading a major downward slide the Dow is down three hundred and Seventy nine points this is NPR News\n\nOne person is under arrest in Germany as part of an investigation into the slaying of an investigative journalist in Bulgaria as Joanna Kakissis reports it's the third killing of a reporter in the end you this here\nVictoria Medina was found on Saturday she'd been raped beaten and murdered she hosted investigative reporting program at a private station run by her ex husband still an moxie most he\nSpoke at a makeshift memorial for her because she was a fighter she would not be satisfied juice investigated you want to treat each of us killing has shocked the ease with which considers itself a safe haven for journalists under threat\nThe anti graft watchdog Transparency International ranks Bulgaria is the most corrupt in the European Union and the least open\nTo press freedom for NPR News I'm Joanna Kakissis in Rousseff Bulgaria\nTurkish media is airing surveillance video of missing writer Jamal ... walking into the Saudi consulate in Istanbul but doesn't show ... leaving\nThe footage purports to show a team of Saudis arriving in Istanbul the day he went missing it also shows a black Mercedes Benz leaving the Saudi constantly\nTransparency International ranks Bulgaria is the most corrupt in the European Union and the least open to press freedom for NPR News I'm Joanna Kakissis in Rousseff Bulgaria\nMeanwhile Turkish media is airing surveillance video of missing writer Jamal ... walking into the Saudi consulate in Istanbul but doesn't show him leaving leaving\nThe footage purports to show a team of Saudis arriving in Istanbul the day he went missing it also shows that black Mercedes Benz leaving the Saudi consulate after he entered and the team checking out\nAnd partying the country later that night Saudi Arabia remain silent as the images plate across TV networks in Turkey and around the world\nOr the kingdom is under pressure amid growing international concern for\nThe writer I'm Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile app\nFree at Google Play and in the eye tunes asked or\nSupport for the Ninety One point five years cc newsrooms provided in part\nBy Home Depot information available at home depot dot com\nLooking for something to do check out the community calendar link at ... or gee\nTo presentation [noise]\n\n\nThis is one day I'm Joshua Johnson in Washington a star is born combines three things that movie audiences love a passionate love story an inside look at stardom and the tragedies of fame\nThe first version came up back in Nineteen thirty seven then again in Nineteen fifty four and again in Nineteen Seventy six and now a new generation has its own version of star is born the directorial debut of actor Bradley Cooper\nHey I'm Joshua Johnson in Washington a star is born combines three things that movie audiences love a passionate love story an inside look at stardom and the tragedies of fame\nThe first version came out back in Nineteen thirty seven then again in Nineteen fifty four and again in Nineteen Seventy six and now a new generation has its own version of star is born the directorial debut of actor Bradley Cooper\n\n\nThat's of course Lady Gaga who plays the undiscovered musician and singer songwriter who Cooper's character a wiry rockstar falls for we asked you for your thoughts on a star is born here is some of what you left in our inbox\nIs Cammy from Wisconsin my husband and I both loved it we thought it was a beautiful love story and Bradley Cooper and ladies got were phenomenal and they're acting and they're singing and the sons they wrote together excellent movie I recommend it for uh\nMy name is Louise and I'm from Gainesville, Florida\nI saw a star is born this weekend and absolutely loved it Bradley Cooper again proved as acting chops and ... was a true revelation\nI Love also how they adapted the timeline to the President's Day by the inclusion of Saturday Night live and it's important in a career of a young singer and I think even the die hard Barbra Streisand\nVersion fans will absolutely love it\nThanks very much for calling in we'd love to get more of your thoughts on a star is born how many stars out of five would you give it and why we're taking your calls this hour at eight five five to three six one a one a\nNPR News afternoons at three thirty on Ninety One point five you're your cc\nMemberships or the largest source of funding it Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nOn Ninety One point five ... your cc you supported locally by Ninety One point five ... ...\nBruises or even which candidate said what they're about my youth out there about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon from NPR News afternoons\nAt three thirty Ninety One point five K. or cc\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nNPR on Ninety One point five K. or CC's supported locally by Ninety One point five or so you see underwriters who realized the benefit of reaching Ninety One point five to your cc listeners for more info on your business underwriting with Katie Orr cc called seven one nine four seven three for a zero one\nBy Colorado College where lifelong learners foster relationships with students and professors working side by side to attain a liberal arts education more about lifelong learning at Colorado College dot edu\nBy the Colorado health foundation dedicated to the belief that health has a basic human right Colorado health foundation is working to bring health in reach for all Coloradans more information is available at Colorado health dot org\nSupport for NPR comes from the station and from bona with a bona certified craftsman program a network of hardwood flooring contractors committed to expertise in customer service contractor locate her and more information or at bona dot com\nAnd from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angels America's Choice and senior home care office locations are at visiting angels dot com\nFishes won a I'm Joshua Johnson we're discussing this month's movie club selection a star is born with John horn from Cape you see see NPR's Linda Holmes hosted the pop culture happy hour podcast and NPR Music critic and correspondent and powers we'd love to hear from you too we always are happy to take your calls and voice mails at eight five five\nTo three six one a one a weed especially love to hear from those of you who've seen multiple versions of a star is born or what price Hollywood and let us know how you think this one compares to the previous ones you can also comment on our Facebook page tweet us at one a\nEmail one a at W. A. M. U. dot org and if you are just joining us I Will remind you one more time spoiler alert we will be discussing all that\nOur music critic in correspondence and powers\nWe love to hear from you too we always are happy to take your calls and voice mails at eight five five to three six one a one a we'd especially like to hear from those of you who've seen multiple versions of a star is born or what price Hollywood and let us know how you think this one compares to the previous ones\nYou can also comment on our Facebook page tweet us at one a\nEmail one a at W. A. M. U. dot org and if you are just joining us\nI Will remind you one more time spoiler alert we will be discussing all the details of this movie so if you haven't seen the star is born yet but you want to you might want to listen to this conversation later on line at the one a dot org\nLet's get to a few more of your calls Heather in Indianapolis is on the line hey Heather what's on your mind what'd you think of the movie\nHey well of course I loved it but I loved it for the entertainment value but my big piece was that moment when he brought her onstage and knowing that was not her comfort zone knowing what she'd been told that she wasn't going to be good enough\nThat no one would care that no one would find her interesting or attractive\nAnd she just went out and she killed it and they loved it and for that have second ac that she realized they were wrong and everything they said to her that was a pretty important moment if you're someone who's been afraid to put yourself out there for the same reasons is kind of a big moment\nYeah I I I hear you on that didn't do that resonate for you in a way like was there something personal that that made you flash back to work out for a lay\nAbsolutely yeah I think you know\nI Do a lot of things where I have to go out in front of crowd or in front of people and you often hear you know you need to be dinner or project lower or beat this or that are younger and at that moment with kind of all of this it was kind of all of us will have that moment\nThat we can personalize it whether it's in an interview or what have you and I think that was an important or with\nHeather what'd you think about that whole storyline was her nose like for me that kind of set up that moment on stage very well but things with her no\nYes yes I mean I'm just like a little bit sick as a person and uh for me her nose is like my weight so she owned it she was like this is my name's needs to take me as I Am and she worked at it\nYou know got them to accept that this is me and it's not going to change and I thought it it kind of an ill\nYeah yeah how do I really appreciate your calling and thanks very much for talking to us and I love Ann Powers I Love that kind of common\nKnows like for me that kind of set up that moment on stage very well but things with her nose\nYeah [noise] yes I mean and I'm just like a little bit sick as a person and for me her nose is like my weight so she owned it she's like this is my name is ... ... yes I Am and she worked at it\nYou know got to accept that this is me and it's not going to change and I thought it it kind of the email\nYeah yeah Heather I really appreciate your calling and thanks very much for talking to us and I love Ann Powers I Love that kind of commentary on the music industry that was kind of baked into the film particularly the thing about her nose when they're standing on the roof top in LA and there's that alley billboard and he says we should have just made the old billboard you're knows\nI mean I think the thing about the comments about her nose is also a guy guys\nHonoring Barbra Streisand and one of the greatest performers and greatest noses to ever a exist in and thrive in Hollywood as far as coming up the music industry it absolutely is a powerful comment on the music industry\nAs the music industry existed I don't know maybe ten years ago I think that where this thing has placed in time where this movie its place in time it's interesting to think about that\nBecause almost everything that happens still happens today and the music industry but there's really no acknowledgement of how things are rapidly changing with the advent of streaming playlists and um the major record labels having less\nPower than they used to so it's almost like we own fashion and its view of the music industry but only that view would would work for this film you couldn't really tackle a the collapse of the music industry in this in this movie\nLinda Holmes could you also chime in but by the way for those who have not seen star is born will not be seeing stars more but just kind of want to being on the conversation she tells Bradley Cooper character fairly early on that she's dealt with music industry people who were like yeah your songs are you saying well but your nose your nose just isn't quite right\nFor music and that was kind of one of those petty impediments that had prevented her from getting where she wanted to go into homes I Wonder how you view that commentary on the music industry when I was watching the movie\nI felt like I was thinking about Lady Gaga because Lady Gaga herself has this kind of over the top persona that she created to kind of be the vehicle for her art I also thought about pink\nWho's very much and invention of pop music but who also had\nThe character fairly early on that she's dealt with music industry people who were like yeah your songs are you saying well but your nose you know just isn't quite right\nFor music and that was kind of one of those petty impediments that had prevented her from getting where she wanted to go into homes I Wonder how you view the commentary on the music industry when I was watching the movie\nI felt like I was thinking about Lady Gaga because Lady Gaga herself has this kind of over the top persona that she created to kind of be the vehicle for her art I also thought about pink\nWho's very much and invention of pop music but who also have this kind of rye cynical style style but almost commented on it as she was doing it and that was what made people love her\nYeah I mean I think that um I agree with and that\nThe view of the music industry in this film in order to be aligned with the view of Hollywood and the previous films in some ways is very linear it's a very linear idea of there is the one\nI'm rose to fame there is one pass you just simply a send or D sand as opposed to there's no suggestion that either one of them that he or she\nMight have success in a a different kind of version of what it means to be famous like that he would score movies or you know that she would develop her own you know following through streaming\nWith out kind of going through that traditional Paso agree with Anna about that but I think\nThat um I'm not sure that you could do it any other way I think the purpose is to have them pass each other on this fame ladder and I think you kind of have to construct it that way and what you're saying about Lady Gaga you know I'm the caller was talking about kind of seeing\nA alley the character talking about well I have to and I'm really afraid and I don't have confidence in my nose or whatever it is funny to see an artist's like Lady Gaga who has been so able to make such an indelible mark on the industry and on popular culture I mean\nThe funny thing about this movie is she is way more important to culture than he is um if you're talking about the real people so it's kind of funny to see\nHer big personality taking advice from you know Bradley Cooper without a much more traditional Hollywood leading man type of career right um it's odd and that way\nExcept for the voice in rocket and guardians of the galaxy that's a little bit more of a diversion but you're right I mean she is much more of like typical leaving\nLiberal mark on the industry and on popular culture I mean the funny thing about this movie is she is way more important to share than he is um if you're talking about the real people so it's kind of funny to see\nHer big personality taking advice from Bradley Cooper they've had a much more traditional Hollywood leading man type of career right um it's odd in that way\nYeah except for that voicing rocketing guardians of the galaxy that's a little bit more of a diversion but you're right I mean he is much more of like typical leading man actor I Wonder also John in terms of\nThe story line you know one of the big parts of the storyline is the love story and Bradley spent a lot of time sitting up that first time meeting here's a piece of that moment from a star is born when they're falling in love in a grocery store parking lot and Lady Gaga is character Eli is just improvising alive so\nTown they found\nTo [noise]\n... [noise]\nBradley Cooper Lady Gaga in a star is born Cooper spoke to NPR's MORNING EDITION with the host Rachel Martin about his work and said this about working with Lady Gaga\nAnd then we went to the piano and saying and it was just kind of wonderful thing I couldn't believe it\nSo that was the beginning of the journey and the first time we sang together I mean everything's alive we said we sing everything live in the movie wow you know there's nothing wrong with thinking\nAnd I turned to Lady Gaga who's seen next to me and she was looking at me like I was Jackson, Maine when any when you're in a scene in the actors fully believing that you're the character you cannot believe it yourself so she really gave me the confidence\nRespond [noise] I Know if the chain between in Tallahassee for a major Hering afternoon on all things considered from NPR News\nRecord numbers of black women are running for office but is the Democratic party ready to support\nGo to the DNC when I Know that can make issue as far as opportunities for black Lenin the DNC and getting black women I see that\nCan respond I notice that change the scene in Tallahassee before a major hurricane afternoon on all things considered from NPR News [noise]\n\nRecord numbers of black women are running for office but is the Democratic party ready to support\nAnd I go to the DNC when I notice systemic issues as far as opportunities for\nBlack women the DNC and getting black women at the at the table that next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five K. or CC's southern Colorado's NPR station\nIn\n... I'm ... and you're listening to Ninety One point fun to our movie Mm\nProgramming on Ninety One point five K. R. C. C. is supported by the silver sea friends thrift store with clothing household items and more plus our home medical equipment apart when with gently used mobility aids proceeds support silver key services silver the dot org\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom El severe a global information analytics business serving scientists and clinicians with a commitment to helping to manage their work more efficiently so they can spend more time making breakthroughs el severe dot com\nAnd from the John D and Catherine T MacArthur Foundation at Mack foundation dot org\nBack now to this month's meeting of the one a movie club with and power is Linda Holmes and John horn let's get to a few more of your calls now gene is listening in Indianapolis hey gene what did you think of a star is born\nHater gene can you hear me yes I gave it five stars which why five stars [noise]\nActually I just loved everything about this I've actually seen the other versions and this one seem particularly well updated to today [noise] um I thought it was the the irony of her being discovered because he was\n... is listening in Indianapolis he Jean what did you think of a star is born\nWho their genes can you hear me yes I have a five stars which why five stars [noise]\nUm actually I just loved everything about this I've actually seen the other versions and this one scene particularly well updated to today um I thought it was the the irony of her being discovered\nBecause he was a drunk and looking for a drink and their life being torn apart at the end because of drink I mean that was the continuing thing and one one thing I don't think other people have mentioned is the part that her agent\nI guess he was her agent uh the guy who made her over\nThe manager do agent played yeah what what is your main character\nI didn't like him and I I guess I wasn't supposed to but the minute he had\nThat conversation with jacks and um and and basically getting ready to accuse ... are accusing him of being a problem in that whole relationship I just I just knew that that was going to be the start of of something really bad happening\nYeah I'd I hear Eugene a hundred percent of it and I I figure I heard your charming and as well\nNo that was a male nominee yeah I think I think one of the tricks and this goes a little bit back to what you were all talking about about the mental health and recovery portions of the story one of the tricks with the manager is I think they do such a beautiful job of explaining where he is in his recovery process and where he is\nI'm thinking about mental health and they made her seem like someone who is aware of what his problems are she's been wary of them\nFrom the beginning um but then they are ultimately headed toward this pre determined tragic ending in which um he dies of suicide and so\nI think the manager I think the conversation with the manager unfortunately seems like a forced elements that\nIt doesn't feel organic to the story it feels like it comes into just drive that last you know to drive that ending and it doesn't seem organic necessarily to to the story as they've developed it because when he's been through these um recovery process is does it seem like without speaking to her\nSmelly headed toward this pre determined tragic ending in which um he dies of suicide and so\nI think the manager I think the conversation with the manager unfortunately seems like a forced element that\nIt doesn't feel organic to the story it feels like it comes into just drive that last you know to drive that ending and it doesn't seem organic necessarily to to the story as they've developed it because when he's been through these um recovery process is\nDoes it seem like without speaking to her he would hear that from the manager I mean obviously depression and an addiction can operate and a lot of different ways for sure but you know did the movie really do a good job of explaining why that conversation at that moment would be enough\nTo drive this enormous decision that that he makes and I'm not sure it did I think that's where I found the ending to be not as satisfying as I thought the rest of the film was\nBy agree with you on that and on top of that I think that the movie had a way you know I was always taught you know in in writer school show don't tell\nAnd there was this moment in the film where Ali says I Want jak on my tour make it happen or or we're done\nAnd I feel like there could have been a moment where for example she goes on stage to her with her and he can't keep up or he keeps we're getting the lyrics or he falls down draw like something could have happened to someone coming to him and saying you know your bad for her right so that would have like plead that whole narrative in a different way for me\nIt exactly someone he doesn't really know someone he hasn't necessarily trust they'd come in and is able to kind of up in his entire sense of his relationship with her I think that part of that the narrative issue with the ending\nLet's all go ahead and go ahead well of course\nOf course the the ways in which a Hollywood and the fame machine or the fame monster as Lady Gaga once called it and one of her album ah destroys people is a major theme\nThroughout all of the versions of stars born in there and in fact all the bridges of the SARS going to have that manager character in a different embodiment\nUm that character in this film I absolutely agree was more personally slimy felt like you know a villain whereas in in some of the previous versions he almost it was a sympathetic enabler um of of the male lead and who then\nWas like hey you know we're trying to keep them afloat\nTheme throughout\nAll of the versions of star is born in there and in fact all of the virtues of the SARS going to have that manager character in a different embodiment\nUm that character in this film I absolutely agree was more personally slimy felt like you know a villain whereas in in some of the previous versions him was a sympathetic enabler\nUm of of the male lead and who then was like hey you know\nWe're trying to keep them afloat but he's going to mess you up Esther Esther was the first name of alley\nOr in the star is born versions so the story of Hollywood destroying people um requires that a a stand in for the machine be part of being part of the cast you know has to be there um\nI also just want to say before we end gotta get this out there that um\nThis is also the story of how a woman's arise leads to a man's fall [laughter] and that's an internal problem with the stars bar and you know um it's a melodrama it's it's a melodrama is traditionally aimed at women we feel very sympathetic\nA ... toward the lead female character but there is this underlying sense has to say it that even as Jackson, Maine is saved temporarily by the energy he he gets almost empirically from\nHis young protege ultimately he is destroyed because she has moved into the center and he has been pushed to the periphery\nFeminist reading problematic found\nWell but you're not the only one who's brought that up I mean Julian wrote on our Facebook page I fear the story of a rising female star nursing a feeling male ego is the wrong story induce me to era\nWe get to a few more of your views of the film Harvey in Ann Arbor emailed I saw this film hoping to be moved crying deeply engaged that didn't happen for stars\nI deeply appreciative ... new wants to shyness in her early portrayal which made means characters advising her work well I'd like to have the same Eliot brother character better developed possibly a moment perhaps a moment could have been written into the car rides the bar possibly dropping him off from the performance\nIs scenes seemed a little too detached from me overall I Love the big venue concert treatments\nThat kind of gets to a comment from Argo in ... North Carolina who tweeted\nOur email I saw this film hoping to be moved crying deeply engaged that didn't happen for stars\nI deeply appreciative guys nuanced shyness in her early portrayal which made main character's advising her work well I'd like to have the same Eliot brother character better developed possibly a moment perhaps a moment could have been written into the car rides the bar possibly dropping him off from the performance\nHis scenes seemed a little too detached from Maine overall I Love the big venue concert treatments\nThat kind of gets to a comment from Argo in ... North Carolina who tweeted three stars a star is born was a story\nThe performances especially the musical ones were fantastic\nAnd the cinematography was incredible I expect a lot of nominations to come for deep ie the director of photography cinematographer Matthew ... production designer Karen Murphy costumer Aaron been out score original saw\nAn ad attacking John horn spoke with the cinematographer Matthew ... about shooting live performances which are not really straightforward spaces to navigate\nHere is a part of that conversation from K. P. C. sees the frame\nThis film was very difficult to sort of navigate the stage performances because we had the three different modes basically we had the Coachella mode which is I'm borrowing stages or that were already set up with the lady that was already existing\nAnd putting in our own crowds and then there was the I'm running guns sort of we have ten minutes to shoot in between two sets with a real audience apologizing in thanking the audience for I'm sort of I'm shooting a movie in between\nTwo bands and then we had the third which is the Greek theater which in which shallow was performed where we um we actually in more of a movie fashion was able to create the Greek theater as a set\nAnd put a certain amount of crowded and so that was my most controlled um scenario but the lighting of it had to have a consistency might my goal was that um you know in creating a character from St Louis in retiree standpoint\nYou know in creating a character from St Louis and with our resemblance", "year": "2018", "show_name": "1A Plus", "city": "Colorado Springs", "day": "10"}