{"month": "10", "state": "CO", "station": "KRCC", "content": "Our executive producer is Nicole ... is our digital producer is Redmond car Livio\nOr engineer his Brian helps\nIn New York and I'm David Brancaccio with the marketplace morning\nAmerican public media\nOur executive producer is Nicole ... is our digital producer is Redmond Carla view or engineer is Ryan how are you\nIn New York on David Brancaccio with the marketplace morning\nAmerican public media\nWhat is the president's promise worse we going to end terminate repeal Obamacare and replace it I Will build a great great wall\nOn the cusp of the mid term we take a look at what worked and what's falling flat from candidate Trump's campaign pledges next time on the takeaways politics with Amy Walter from WNYC NPR I [noise]\nYou can catch the take away this morning at eleven o'clock followed by fresh air at noon\nThis is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ... hunter Casey the ads start Phil and K W cc FM woodland park streaming at K. R. C. C. dot ORG\nI today in the fifties and sixties similar temperatures expected Saturday will be cold Sunday hides in the twenties and thirties with snow forecast across the region\nComing up next we have this morning headlines followed by one eight it's nine o'clock\nThe latest firestorm in Washington but this week a real storm hurricane Michael called catastrophic damage and what's next with a recovering\nFrom W. A. M. U. and NPR One [noise]\nHey there I'm Joshua Johnson visiting ... public radio in San Francisco today on one eight at the friday news roundup Michael is long gone after devastating Florida's panhandle dismissed after a new un report feeding the climate change is making these major storms more likely\nBrett Kavanaugh joins the Supreme Court and Nikki Haley will step down as UN ambassador also Kanye West raises eyebrows at the White House and the two main candidates vying to become California's next governor of one head to head to your a tricky we'd\nWe'd love to hear from you on this week sob stories comments on our Facebook page or tweet on that one [noise]\n\nThe friday news round up Michael is long gone after devastating Florida's panhandle dismissed after a new un report feeding the climate changes making these major storms more likely\nBrett Kavanaugh joins the Supreme Court and Nikki Haley will step down as UN ambassador also Kanye West raises eyebrows at the White House and the two main candidates vying to become California's next governor would head to head to your kid can be de\nWe'd love to hear from you on this we saw stories comments on our Facebook page or tweet us at one egg [noise]\n\nLive from NPR News in Washington I'm core of a cool ... authorities in the U.S southeast are still assessing damage from hurricane Michael they say at least eleven people have been killed because of the storm Virginia officials reported five of the deaths this morning\nMichael came ashore and Florida's panhandle on Wednesday is a very powerful category for hurricane FEMA director Brock Long says the site of its landfall Mexico beach is devastated\nAnd so when you look at this the the damage in Mexico beach that is where the ocean rows potentially fourteen feet with wave action on top and just shove buildings out of the way\nEmergency responders in North Carolina reported flash flooding in Charlotte and Raleigh teams had to rescue motorists from rising water it's estimated about a million customers lack power in the south east the path of destruction included a direct hit on the tend to air force base near Panama City Florida\nNPR's Greg Myre e reports the air force was prepared\nAirplane hangers were shredded roofs were peeled off buildings and retired fighter jets that was on display at the ten do base was torn from its foundation the air force is still assessing what it calls widespread catastrophic damage the personnel into hugely expensive planes were evacuated before the storm hit\nThe tinder bases on land the jets into the Gulf of Mexico in his home to more than fifty after twenty two stealth fighters which costs more than three hundred million dollars apiece those planes are now safely parked at the Wright Patterson air force base in Ohio\nGreg Myre NPR News Washington\nNational Hurricane center says tropical storm Sergio was crossing Baja California\nThat storm is expected to break up as it passes over Mexico today the storm's remnants will move into southern Arizona New Mexico and Texas over the weekend bringing heavy rain the hurricane center is warning of the chance of life threatening flash flooding\nA Turkish court has ordered the release of an American pastor held for nearly two\nThree hundred million dollars apiece those planes are now safely parked at the Wright Patterson air force base in Ohio Greg Myre NPR News Washington\nThe national Hurricane Center says tropical storm Sergio was crossing Baja California\nThat storm is expected to break up as it passes over Mexico today the storm's remnants will move into southern Arizona New Mexico and Texas over the weekend bringing heavy rain the hurricane center is warning of the chance of life threatening flash flooding\nA Turkish court has ordered the release of an American pastor held for nearly two years NPR's Peter Kenyon reports winning the release of pastor Andrew Brunson has been a top priority for the Trump Administration\nAccording western turkey convicted burns in on terror related charges and issued a sentence of more than three years in prison but the judge is also ruled that because of time already served Brits and should not have to serve the rest of that sentence and they lifted restrictions on his movement clearing the way for him to be returned to the U.S\nRoads and was arrested and late twenties sixteen as part of a massive roundup of suspects following a failed coup attempt against the government of president ...\nThis summer the White House believed it in one agreement from here to wander released Brunson but he was simply moved from prison to house arrest us sanctions on turkey followed and analysts say a crew will be hoping those will be lifted now that brings in his cleared to return home Peter Kenyon NPR News Istanbul\nOn Wall street the Dow is up two hundred eighty five points than as decades up one hundred fifty two\nPoints you're listening to NPR News\nThe Vatican says Pope Francis has decided to accept the resignation of cardinal Donald Wuerl of Washington D. C. world who turns Seventy eight next month is involved in the church is sexual abuse scandal\nA grand jury report in Pennsylvania has alleged to the world while the bishop in Pittsburgh helped shield some priests accused of molesting children\nA new analysis of dietary supplements finds more than seven hundred supplement products have been found to contain unapproved pharmaceutical ingredients that can be harmful NPR's Allison Aubrey reports the most common adult or instant over the counter supplement include drugs for weight loss and synthetic steroids\nHalf of adults in the U. S. report using some dietary supplements and this study researchers to use food and Drug Administration data to analyze warnings sent to supplement manufacturers when products were found to contain unapproved ingredients over ten year period the authors identified seven hundred and Seventy six\nFinds more than seven hundred supplement products have been found to contain unapproved pharmaceutical ingredients that can be harmful NPR's Allison Aubrey reports the most common adultery and send over the counter supplement include drugs for weight loss and synthetic steroids\nOver half of adults in the U. S. report using some dietary supplements and this study researchers to use food and Drug Administration data to analyze warnings sent to supplement manufacturers when products were found to contain unapproved ingredients\nOver ten year period the authors identified seven hundred and Seventy six adults are rated dietary supplements\nPeter Caroline at Harvard Medical school says consumers should be aware\nWhen it comes to soften the FDA doesn't that the supplements before they appear on store shelves but the FDA is responsible for removing dangerous off once once they're detected\nThat study is published in the journal jama network open Allison Aubrey NPR News\nThe Saudi Arabian ambassador to the U.S is returning to Riyadh as the controversy grows over the fate of missing Saudi journalist ... the state department says it wants to know any information the ambassador may have about the case when he returns on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video\nThis week on all things considered here the latest news has been an honor in a lifetime to serve\nMuch what it means what we have a number of people that would very much like to do it it's a great position and some things that are so serious was no so to destroy your mind goes with the song tells you ... you know listen to all things considered\nTo hear the bigger picture every afternoon from NPR News ... afternoons at three thirty Ninety One point five ... or so you see [noise]\n\n\nThis is what a Happy Friday I'm Joshua Johnson visiting ... public radio in San Francisco California has a lot to the side in the midterms who will be the next governor and will the state's congressional races contribute to he predicted blue wave across the nation\nThere's also renewed political energy on both sides of the aisle now that Brett\nAreas is one thing a search and rescue is where we are hyper focus this morning\nBut as that uh you know simultaneously what we're trying to do is assessed roadways and bridges to make sure that we can get you know teams commodities and equipment into the areas that were hardest hit a hospital system or near Panama City in and around Panama City took a hit too so we\nOr eight year old [noise]\nAnd buy tickets to their shows [noise] to learn more about corporate support called genetic seven one nine four seven or eight year old ... oh [noise]\nYes you can have great music seven nights a week from seven to midnight and Ninety One point five K. R. D. C. [noise]\n\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile app free at Google Play and in the eye tunes avatar\nProgramming on Ninety One point five through your cc is supported by the cultural office of the pikes peak region inviting listeners celebrate our ... month this October but having at least one new cultural experience with family or friends details at ... dot com slash ... month\nSupport for NPR comes from the station and from bona with the bona certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or a bona dot com\nAnd from the Newseum committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math Newseum dot com slash NPR\nThis is one a I'm Joshua Johnson it's the flooding news roundup with political journalists Todd's will lick reporter Shane Harris of the Washington Post\nAnd lose your Molly of kick you leave California report we love to hear from you to feel free to tweet us at one a comments on our Facebook page where you can watch our video stream or email one a ... am you dot org before we move on from the weather and climate Louis there was one more thing you want us to\nYeah I just wanted to lead to mention you know poll Rome or the other\nHe um dot com slash NPR\nThis is one a I'm Joshua Johnson it's the friday news roundup with political journalist Todd's will lick reporter Shane Harris a Washington Post\nAnd lose your Molly of kick you leave California report we love to hear from you to feel free to tweet us at one a comments on our Facebook page where you can watch video stream or email one a at W. A. M. U. dot org before we move on from the weather and climate Louis there was one more thing you want us to ...\nYeah I I just wanted to not to mention you know ... Rome or the other guy who won the Nobel Prize in economics this week talking about carbon taxes being the solution to to this crisis at least in part\nOn and you know I think it's important to recognize that sounds punitive but I think there is a positive message that he's trying to put out there\nAnd that is if you commit to attacks uh on carbon not only are you dealing with this issue head on but you're also in his view\nI'm opening up the opportunity for people to make money investors to to make money off of it because when money is at stake you're always going to find alternative people will naturally gravitate\nAn economic argument is often on carbon tax or that it's bad for business\nCalifornia's the fifth largest economy in the world and Jerry Brown just signed an executive order committing the state to carbon neutrality by twenty forty five which I'm sure sounds crazy to people outside of the state but that's actually very close to one of the policy prescriptions the I the IPC set forth\nA kind of crazy until you do it really telephone is very serious about doing it\nIt's a very serious about doing it um you know Paul Romer talks about\nThe problem isn't going to be solved until you build consensus 'em and political will is really at the heart of that there's there's really a huge divide in terms of political well not just here but also you know I just moved here from Canada that same thing there you have prime minister Justin Trudeau trainer and a\nAnd pose a a carbon tax across the country and he's running into real opposition at the provincial level there\nBefore we move on let me get one more comment more comments on this not my account of me tweeted why are we still talking about the credibility of science when it comes to climate change a good point on my car to me I don't know if you listen to this program but we are not question the credibility that's kind of a done deal on this program but I hear what you're saying [noise]\nLeary tweeted it's frustrating to hear criticism of citizens in some of the poorest parts of Florida for not upgrading their homes ability to withstand hurricanes they may live\n... and ... and plus a carbon tax across the country and he's running into real opposition at the presidential level there\nBefore we move on let me get one more comment a few more comments on this not my academy tweeted why are we still talking about the credibility of science when it comes to climate change\nA good point not my economy I don't know if you listen to this program but we are not questioning the credibility that's kind of a done deal on this program but I hear what you're saying [noise]\nLeary tweeted it's frustrating to hear criticism of citizens in some of the poorest parts of Florida for not upgrading their homes ability to withstand hurricanes they may live where other people vacation but they're mostly stuck\nThis storm will expose that contrast\nShane Harris I Wonder if you could respond to Larry on one hand\nI disagree with him as a Floridian like the state of Florida has programs to help you heart in your home and if you want to live in Florida\nThat as a base will risk of living within ... yards of a rising coastline if you want to live there you just have to absorb that on the other hand I totally hear what he's coming from Mexico beach where the hurricane Michael made landfall had to be moved back from the coastline for safety sake\nThe town cannot incorporate uh it's it's it's a tough one [noise]\nNo it is a really tough and when we're we're when we're thinking about climate change in the sort of thirty to forty year our Todd and I were just talking about this trying to break\n'em their existential risks that are opposed not just to\nA community is close to the coastline to where we are talking about today but large cities like Miami in Florida in other places that really in the long term are going to have to make serious profound choices about\nSurvive ability about resilience or whether people want to continue living there and there is an element of risk that you take her that also has to give people some agency and what I think is missing from the conversation about climate change is a real honest discussion about long term risk\nAnd what the responsibility is for people living in these places and they're elected leaders both at the local and the national level we're not having that conversation\nAnd Joshua ... ... one small point just the end if you think that risking getting your heads around the risk for lower income or poor people here in America is something we need to think about\nAmericans also need to think about what some of our international leaders leaders generals like Colin Powell advisers had been saying for years if you think it's a risk in this country imagine what storms increased drought and conflict means for millions and millions of poor people around the world when they start\nAnd the national level we're not having that conversation and Joshua ... one small point just to and if you think that risk and getting your heads around the risk for lower income or poor people here in America is something we need to think about\nUh Americans also need to think about what some of our international leaders leaders generals like Colin Powell advisors had been saying for years if you think it's a risk in this country imagine what storms increased drought\nAnd conflict means for millions and millions of poor people around the world when they started to migrate when they upset the relationships between countries and that becomes not just their problem in terms of life and death but America's problem in terms of of keeping the world in order\nWill listen for those who are in an had been in the path of hurricane Michael we wish you of course a speedy recovery and we'd love to hear from you\nAs you continue to deal with the recovery give us a sense of how you're doing how the recovery is going\nWhat your thoughts are and how things are going how well FEMA is meeting your needs state officials how well that's going we always love to hear from you feel free to email us one at a at W. A. M. U. dot org you can always leave us a voice mail at eight five five to three six one a one a we know caught activity is probably bad\nWhere you are so be careful moving around if you have to find\nA self signal please stay safe do not put your health risk for the sake of sending us a voicemail but if you're able we'd love to know how you're doing eight five five\nTo three six one a one a\nLet's move on to the White House where another major official is leaving the administration Nikki Haley the U.S ambassador to the United nations announced her resignation on Tuesday a lot of people\nBring some time leaving the term I Want to make sure\nIt was a blessing to go to the un body armor\nEvery day and defend America I'm always on our\nSide from fighting for our pay that I think it's time\nNikki Haley speaking on Tuesday about resigning as US ambassador to the un and others resignation was different from some of the others we've seen in this administration because it seemed to kind of come out of nowhere by surprise last month ambassador Haley published an op ed in the Washington Post declaring her loyalty to and respect for\nThe president Shane what is your read on Nikki Haley's resignation\nAnnouncement do we take it at face value is there more at play here\nWhat do you think well there's yeah there's always Marta ... particularly\nI Will tell you that\nNikki Haley speaking on Tuesday about resigning as the U.S ambassador to the un this resignation was different from some of the others we've seen in this administration because it seemed to kind of come out of nowhere by surprise last month ambassador Haley published an op ed in the Washington Post declaring her loyalty to and respect for\nThe president Shane what is your read on Nikki Haley's resignation announcement do we take it at face value is there more at play here what do you think well there's\nYeah there's always more play particularly in this White House um it was a surprise there is no doubt about that it was a surprise even to people in the administration uh Nikki Haley [noise] also I think I'd found herself increasingly politically isolated in the power centers of foreign policy\nAnd the administration with John Bolton the national security advisor and Mike Pompeo now secretary of state\nA sort of absorbing a lot of that energy and then of course this administration being quite hostile to the United nations being UN ambassador is not necessarily the most powerful position\nUm Nikki Haley has presidential ambitions I she she said they are and and her meeting with Trump this week she's not running and twenty twenty she plans to be campaigning for him a twenty twenty four is not that long away a and so I think there's an element of that as well\nThe question of why now is a curious one that'll keep people in Washington guessing she may have thought get out before the midterms\nI'm there may be of Democrats certainly have Democrats take back the house they're going to become a subpoena factory this administration will be under investigation relentlessly and Nikki Haley herself is under scrutiny for a private jet flights that she accepted from friends and associates\nThere's been some investigation to that um it might have just a ban that now with the time to head for the exits and and I have to say she really does leave\nI'm probably one of the best positions of any senior Trump admission official she's not leaving under a lot of scandal\nUh she won generally plaudits for her work at the un she was seen as a stabilizing force within an administration that many people feel needs them uh and she can leave with her head held high and I think uh certainly someone as smart\nAnd capable and as ambitious is Nikki Haley this is not her swan song\nShe was seen as a stabilizing force within that administration that many people feel needs them uh and she can leave with her head held high and I think uh certainly someone as smart and capable as ambitious is Nikki Haley this is not her swan song\nIs your motives she'll disappear also women in Brazil say\nNot him in Bollywood meet me to the next hour on one [noise]\nThe Ninety One point five years\nYour motive show he is also women in Brazil say not him\nIn Bollywood meeting me to the next hour on one [noise]\nThe Ninety One point five ... your cc news team the meeting was the third for scheduled around the\nCountry in the end the ban passed on to sixty two so over the past five years officials say the\nGM recognized for excellence by the Colorado broadcasters association\nWhy there's this is my age who is this is Jonathan from your water is the dominant ... from the most at\nLeast seven PMDD now by many one point five ... he he\nNPR on Ninety One point five to your cc is supported locally by took care to be screw serving gluten free comfort food and treats paired with house made cocktails like the French Seventy five made with Lee's Jim fresh squeezed lemonade house bubbly and garnished with a ... cherry coke at ... dot com\nBust opinion real estate group insulator helping visitors fulfill dreams of mountain living in ... county and the surrounding region from land and ranchers to vacation homes and long term rentals information and more at putting in real estate dot com\nSupport for NPR comes from the station and from loved me in makers have go to meeting a collaboration meeting platform that comes equipped with the church to help people stay focused to get work done learn more to go to meeting dot com\nAnd from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement [noise] more at alliance for a lifetime income dot org\n\nNow to the friday news roundup with little each a Molly Shane Harris and Todd's will still time to get into more of your questions and thoughts on the week's top stories one eight at W. A. M. U. dot org touch will look let's talk a bit about Brett Kavanaugh we're seeing\nThe Supreme Court nomination and confirmation heavily politicized going into the midterms President Trump is using the issue to energize Republicans Democrats are doing the same thing on the other side of the aisle I Wonder where we see\nMore at alliance for a lifetime income dot org\n\nBack now to the friday news round up with ... Shane Harris and Todd's will still time to get into more of your questions and thoughts on the week's top stories won a ass W. A. M. U. dot org Todd's will look let's talk a bit about Brett Kavanaugh we're seeing\nHis Supreme Court nomination and confirmation heavily politicized going into the midterms President Trump\nIs using the issue to energize Republicans Democrats are doing the same thing on the other side of the aisle I Wonder where we see this going especially since Democrats some of them seem determined not to let the Kavanaugh's confirmation go\nIt seems to have had office it affects or at least so it seems these numbers are little sketchy I Want to put the provides though around what I'm about to say\nThat the polls are fresh and we don't know exactly what this means yet for the upcoming mid terms we all know and for weeks however it looks like now it's having an opposite effect on Senate races and house races we've seen several Senate races places like\nTennessee or places like North Dakota where races that seemed to be closer where the Democrat who is challenging the Republican and a red state actually had a a chance of either surviving or in the case of Tennessee uh maybe picking up an open seat\nTo now a surge for Republicans that Brett Kavanaugh phenomenon seems to in Senate races have solidified Republican base voters behind Republican candidates in most cases and then curiously\nIn house races where so many Republicans are vulnerable\nUh I Can't say that it's had the opposite effect because I'm not sure that a Supreme Court fight has a cause and effect relationship on house races house members don't really have much to do with Supreme Court fights in at least not not in confirming them up but there doesn't seem to have been the same erosion\nIn a lead or in democratic support in the house however looking forward and you mentioned that a lot of Democrats are promising their base that the fight isn't over on Brett Kavanaugh not necessarily because of his ideological positions on a rower executive power\nBut what his behavior was in high school and college and more importantly perhaps whether he was truthful under oath in front of the Judiciary Committee and in his statements when he talked about his drinking when he talked about his behavior in high school and college\nUh I Would look to the house most likely house members who may if the numbers hold true control the house after January they will control\nThe crowds are promising their base that the fight isn't over on Brett Kavanaugh not necessarily because of his ideological positions on a rower executive power\nBut what his behavior was\nIn high school and college and more importantly perhaps whether he was truthful under oath in front of the Judiciary Committee and in his statements when he talked about who's drinking when he talked about his behavior in high school and college uh I Would look to the house most likely house members who may if the numbers hold true control the house after January\nThe will control the Judiciary Committee they will control the investigations committees they will have chairman ships and like and like Shane said before\nThey will become subpoena factories they will also have to respond to a base wants Brett Kavanaugh statements investigated a lot of this Joshua ... comes from dissatisfaction over the extremely limited nature of that FBI background check that week in between when Christine Blasey Ford came forward and we had that high profile\nHighly emotional and remarkable hearing in front of the Judiciary Committee or the FBI really investigate did they get to the bottom of anything did they ask\nTen twelve fourteen people who may have been witnesses in some form to some of the alleged behavior it appears that they didn't and people might be relying on Democrats to pick up that church ...\nI'll add to this you know senator Kamala Harris is not just on the Senate Judiciary committee where she's also in the homeland security and government Affairs Committee and in that capacity she had the chance to grill\nFBI Director Christopher Wray on that face to face um how much intervention did the White House do in this says supplemental background check\nWill click also on ranking member of the Senate Judiciary committee Dianne Feinstein her six year term in the Senate is up so she's up for reelection you can bet that this is going to come up in the debate between her and state senator Kevin daily own who wants to know why she sat on that letter from Dr Christine Blasey Ford for two months\nAnd last thing I'll say is she just last night was trying to take the fight from you know on the SCOTUS thing too\nThat the way that Trump is trying to remake the courts writ large in talking about the Ninth Circuit court here in California Trump's nomination this is a court that's been a real store and then from side the White House just put forth as three nominees there and she didn't get to sign off on them she's very upset about that and Trump\nAre tempted maturation is really breaking from tradition by not giving the home state senators any say in these packs\nI think I say if she just last night with trying to take the fight from you know on this ... thing too\nThat the way that they're trying to remake the court to rent large talking about the Ninth Circuit court here in California ... this is a court that's been a real store in ... side the White House just put forth his three nominees there and she didn't get to sign off on that and she's very upset about that and try and\nAt ... really breaking friend tradition by not giving the home state senators any say in these packs\nI Do want to see if we can leave time to talk California politics before the round up is up but a few more things out of D.C\nWe wanted to discuss including the president stepping in the middle of the feud between Taylor Swift and Kanye West he publicly dissed miss swift for endorsing two Democrats in Tennessee and he woke up Kanye West of the White House yesterday\nConnie wore red make America great again hat for the visit\nAnd we're gonna have lunch with the dog will want to say I don't want to put you in this guy I mean\nI Love this guy right\nNow calling us was reportedly at the White House to discuss criminal justice reform he also said yesterday that he doesn't like the liberals and shows like Saturday Night live make the president look bad he said the president needs to be in his words precious to us as Americans\nWe should also be clear those Shane Harris Conyers seemed rather rambling during the good bit of his visit maybe a little unhinged heated noted\nThat he had been diagnosed with bipolar disorder I I'm I'm I'm hesitant to dig deep in on this story I think ... easy to mock easy to make fun of\nEasy to criticize but the fact that he said that he is a bipolar while he's meeting with the president and dropping some absurdities at the other side of the resolute desk I I'm not sure what to do with it\nI I'm not either I mean I was quite surreal we were actually in the newsroom working on other ... arguably more important stories I hesitate to bid to be so deep and it's like you\nAnd looked up at the TV and we all sort of set is this is just really happening it was just so strange it's hard to know what to make of it but it is part of a litany of these kind of bizarre\nCarnival esque spectacles that we've seen both sometimes in the oval office and then from the president that have the flavor\nSome obscenity at the other side of the resolute desk I I'm not sure what to do with it\nI I'm not either I mean I I think it was quite surreal we were actually in the newsroom working on other but I think arguably more important stories I hesitate to do these deep in this like you\nAnd looked up at the TV and we all sort of set is this is this really happening it was just so strange it's hard to know what to make of it but it is part of a litany of these kind of bizarre\nCarnival esque spectacles that we've seen both sometimes in the oval office and then from the president that have the flavor more of a reality show I mean that that seemed to remind us of the mill you that Donald Trump came out of\nA when he ran for president and so in that sense I suppose it's not that surprising but I think for a lot of people there's a sense that it almost diminishes the office of the president to see this sort of rambling bizarre what do we make of it a behavior\nFrom a celebrity that has been outspoken about his politics and that's his right but there's also left many people scratching his head about what is he actually doing and is is there something wrong with him or he was just a very strange moment and I know for for for for me and my colleagues who just tried to move past it as quickly as we could\nAnd the interest in moving past as quickly as we could do that too but I should note the county's old nemesis Taylor Swift and sort of herself into politics this week\nShe endorsed Democrats Phil Bredesen for Senate and Jim Cooper for the house in her home state of Tennessee on social media\nAnd the Senate race in Tennessee is tight and British and has strong support Taylor Swift has one hundred twelve million followers on Instagram and voter registrations among young people rose by more than sixty thousand\nAfter her post\nShane Harris let me stick with you for a moment because President Trump is facing another a difficult situation regarding the disappearance of a journalist named ... Saudi dissident and a resident of the U.S he disappeared inside the Saudi consulate\nIn Turkey you've been doing a fair bit of reporting on this particularly the concern that the Turks have raised that the Saudis basically sent hit men to kill ... to show you because of his reporting\nThe Turkish government has really provided any independent evidence for this they say they have security video and and and logs of people who signed in and so forth what do we actually know right now if anything about what really happens All right well what we\nParticularly the concern that the Turks have raised that the Saudis basically sent hit men to kill ... because of his reporting\nThe Turkish government hasn't really provided any independent evidence for this they say they have security video and and and logs of people who signed in and so forth what do we actually know right now if anything about what really happened right well what we\n[noise] [noise] [noise] um\nLeon Castro next on one hand\nAnd then\nWhat is the president's promise worse we going to end terminate repeal Obamacare and replace it I Will build a great great wall\nOn the cusp of the midterms we take a look at what worked and what fallen flat from candidate Trump's campaign pledges next time on the takeaways politics with Amy Walter from WNYC NPR I [noise]\nThe take away today to Lebanon am on Ninety One point five to your C. C.\nProgramming on Ninety One point five K. R. C. C. is supported by pikes peak hospice and palliative care committed to helping people live their lives to the fullest including specialized support to pediatric patients and their families pikes peak hospice daughter work\nThis is southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ISI see law hunter tc CEO structural M. T. W. CCF them woodland park\n\nTo Jamal ... turkey says the Saudis sent shipment to kill this outspoken journalists the Saudis denies that\nFrom W. A. M. U. and NPR this is one [noise]\nAre you there I'm Joshua Johnson visiting ... public radio in San Francisco today on one ... it's the friday news round up to show he disappeared soon after criticizing the Saudi regime his journalism get him chills Nikki Haley the U.S ambassador to the un prepares to step down\nHow does she helped shape America's diplomacy also the U.S will try and extradited Chinese spy enforced for the first time and the un warns that climate change will become critical sooner than expected\nWe'd love to hear from you email one day I W am dot org or tweet us ... one day\n\nLie from NPR News in Washington I'm Laurie London Pope Francis has notified cardinal Donald Wuerl the archbishop of Washington DC that he has accepted his offer to step down NPR's Tom Gjelten says world has been accused of helping to ...\nThe un warns the climate change will become critical sooner than expected\nWe'd love to hear from you email won a a W am Dutch board for weed us that one\n\nLive from NPR News in Washington I'm Laurie London Pope Francis has notified cardinal Donald Wuerl the archbishop of Washington DC that he has accepted his offer to step down NPR's Tom Gjelten says\nWorld has been accused of helping to cover up the sex crimes of priests under his supervision\nCardinal Wuerl has not himself been accused of sexual abuse unlike his predecessor in Washington Theodore mature who had to step down as a cardinal in July\nBut his bishop of Pittsburgh world do sympathetically with several priests against whom serious complaints have been made sending them for psychological evaluation but allowing them to remain in the priesthood or approving payments to them\nIn accepting the arch bishops resignation Pope Francis noted that world could have defended themselves by distinguishing between covering up crimes and committing mistakes but the world had not tried to do so he has to world to remain in charge of the Washington archdiocese until a successor is named Tom Gjelten NPR News\nIt's all about right response and recovery now and the aftermath of hurricane Michael the storm has caused massive damage particularly on the coast of Florida\nSupplies of food and water are being brought in some by helicopter in cases where roads are still impassable FEMA administrator Brock Long is asking residents who evacuated to wait a bit longer to return\nQuite honestly it's a dangerous area to go back into a you know when you have this type of destruction there's gas lines that are there there's paralyzed that are down a and doing so you're putting your life in danger and we ask you to be patient\nSome areas saw several feet of storm surge which smashed through windows ripped off roof blew out brick walls Michael is now being blamed for eleven fates holidays and Florida Senate debate between democratic Senator Bill Nelson and Republican Rick Scott has been postponed\nAnd American pastor has been released from house arrest in Turkey NPR's Scott Horsley reports President Trump had lobbied for pastor Andrew Brunson freedom\nTrump tweeted this morning that his thoughts and prayers are with Andrew Brunson you hope to have the pastor safely\nWhich which smashed through windows ripped off roofs flu outbreak walls Michael is now being blamed for eleven fade holidays and Florida Senate debate between democratic Senator Bill Nelson and Republican Rick Scott has been postponed\nAn American pastor has been released from house arrest in Turkey NPR's Scott Horsley reports President Trump had lobbied for pastor Andrew Brunson freedom\nPresident Trump tweeted this morning that his thoughts and prayers are with Andrew Brunson or do you hope to have the pastor safely back home soon in the United states Brunson who's from North Carolina was imprisoned in Turkey for two years it was part of a round up following the failed coup against president ... Irwin\nThe Trump Administration had champion Brunson cause telling her to want his release would improve us Turkish relations Rosen was transferred to house arrest earlier this summer\nToday's order but he'd be freed entirely was warmly welcomed by evangelical Christians in this country Scott Horsley NPR News the White House\nStocks are recovering to some degree from the law says this week but still on track for their biggest one week last since late march to download a hundred and sixty two\nThis is NPR\nRussia's space agency is clarifying that chain of events in yesterday's dramatic emergency landing of the Soyuz capsule as\nMatthew Bodner reports from Moscow to man crew survived\nRussian pays eight in the executive and cosmonauts Sergei creek live told reporters today that one of the rockets foresight boosters did not properly jettisoned and struck the body of the ... rocket\nHe described a chain of events that corresponds with what can be seen from video footage of the rocket industry from within the cabin the rocket was damaged and knocked off course\nThe Russian accident investigation team has begun work in critical of says they should have result later this month they syndicate confidence that the problem can be identified end result quickly meanwhile the head of the Russian space agency said today that the crew of yesterday's launch will be given another chance\nTo fly sometime early next year for NPR News I'm Matthew Bodner in Moscow\nThe U.S relationship with Saudi Arabia is being tested following the mysterious disappearance of Washington Post columnist Jamal because she'll gay it's also creating friction between the Trump Administration and members of Congress who are demanding to know what happens\nLawmakers are calling for the U.S to halt arms sales to the kingdom until further evidence has been reached\nHe said today that the crew of yesterday's launch will be given another chance to fly sometime early next year for NPR News I'm Matthew Bodner in Moscow\nThe U.S relationship with Saudi Arabia is being tested following the mysterious disappearance of Washington Post columnist Jamal because show gay and it's also creating friction between the Trump Administration and members of Congress who are demanding to know what happens\nLawmakers are calling for the U.S to halt arms sales to the kingdom until further evidence that's been revealed Turkish authorities sake a show he was killed by members of an elite Saudi fascination squad\nAn allegation the Saudis deny meanwhile the leaders of France and Germany say they're deeply concerned and also want answers\nAnd Laurie London NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men\nStarring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair a new episode every Friday on prime video hey everybody does it through\nThe foster this is Christoph ... this is Michael from spirit we seem to Ninety One point five K. R. C. the music seven PM in Ninety seven Ninety silly\nSupport for the Ninety One point five years cc newsrooms provided in part\nBy Home Depot information available at home depot dot com\nLooking for something to do check out the community calendar link at ... dot ORG [noise]\n\n\nThis is one a Happy Friday I'm Joshua Johnson visiting ... public radio in San Francisco authorities in Turkey might have audio and visual evidence proving that a dissident Saudi journalist was killed inside the Saudi Arabian consulate in Istanbul\nThe U.S has joined an investigation into the disappearance of ... a U.S residents in the Washington Post columnist also America's ambassador to the un announced this week that she will leave the administration at the end of the year\nSecretary of state Mike Pompeo took another stab at persuading North Korea to disarm its nuclear weapons Brazil will hold a runoff election to determine its next president and India's Bollywood experienced it\nAuthorities in Turkey might have audio and visual evidence proving that a dissident Saudi journalist was killed inside the Saudi Arabian consulate in Istanbul\nThe U.S has joined an investigation into the disappearance of ... a U.S resident in the Washington Post columnist also America's ambassador to the un announced this week that she will leave the administration at the end of the year\nSecretary of state Mike Pompeo took another stab at persuading North Korea to disarm its nuclear weapons Brazil will hold a runoff election to determine its next president and India's Bollywood experienced its own me to moment and the fallout that comes with it [noise]\nJoining us from our home base in Washington for the friday news roundup is John ... North America editor for the BBC and the author of if only they didn't speak English notes from Trump's America Jon welcome back thank you very much\nAlso with us in DC is messy use if national security reporter for the wall Street Journal Nancy welcome to be ready\nAnd already Friedman a staff writer at the Atlantic covering global affairs or we glad to have you with us pleasure to be here we're also pleased to get your questions and thoughts about the week's top stories from around the world so email us one a at W. A. M. U. dot org comments on our Facebook page where you can watch our video stream or tweet us at one a\nUs representative to the UN is stepping down President Trump accepted the resignation of America's ambassador to the United nations Nikki Haley on Tuesday here is some of what she had to say during the announcement at the White House\nCat what happened with the United states on foreign policy [noise] now the United states it\nThing and if we say we're going to do something we follow that whether it was with the chemical weapons in Syria whether it was\nSaying that our country has to pay their share and it rather than try and deal with your main thing they do that and they all agree that\nHow will the new court handle some of the country's most divisive issue listening to MORNING EDITION every weekday from NPR News weekday mornings beginning at five on Ninety One point five\nOr so you see memberships or the largest source of funding in Ninety One point five K. R. C. C. allowing us to bring the local stories NPR News and music thanks for your generous support programming on Ninety One point five kill your cc is supported by took care to grow up\nNine and I will always be a team player on the team of nine\nHow will the new court handle some of the country's most divisive issue listening to MORNING EDITION every weekday from NPR News weekday mornings beginning at five on Ninety One point five\nTo your cc memberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nProgramming on Ninety One point five K. R. C. C. is supported by Cokie let's throw open every day at eight am serving breakfast lunch and dinner and afterward cocktails every weekday like martinis on Monday Marguerite isn't tacos on Tuesday and cocktails and cupcakes on Thursday cool kids ... dot com\nBust distillery to Ninety One a small ... remaking whiskey in the foothills of the Rocky Mountains and found and package stores throughout Colorado open Wednesday through Sunday with live blues Wednesday night distillery to Ninety One sixteen forty seven south today home by Colorado College offering an experiential education\nFrom cc classrooms studios in laboratories at the base of pikes peak to access\nTo the nearby mountains in urban centers Colorado College dot edu\nSupport for NPR comes from the station and from bona with a bona certified craftsmen program a network of hardwood flooring contractor is committed to expertise and customer service contractor locate her aunt more information there at bona dot com\nFrom his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learned more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nAnd from the listeners who support this NPR station\nThis is one a I'm Joshua Johnson it's the friday news roundup with or re Friedman of the Atlantic John ... all of the BBC and Nancy usage of the wall Street Journal we'd love to hear from you to your questions about the U.S and North Korea the election in Brazil Interpol missing president or any of the international stories that caught your eye this week\nComments on our Facebook page where you can watch our video stream tweet us ... won a or email one eight at W. A. M. U. dot org let's get back to that story of the Saudi Arabian journalist ... who has gone missing possibly murdered\n... we've heard a number of accounts particularly from the Turks about what Saudi Arabia allegedly did to Mr ... show\nYour questions about the U.S and North Korea the election and Brazil Interpol missing president or any of the international stories that caught your eye this week\nComments on our Facebook page where you can watch our video stream tweet us ... won a or email one a at W. A. M. U. dot org let's get back to that story of the Saudi Arabian journalist ... who has gone missing possibly murdered\n... we've heard a number of accounts particularly from the Turks about what Saudi Arabia allegedly did to Mr to show that they basically said hitman after him what do we know for sure about the disappearance at this point\nFor shall we know that he ... to into the come so uh in Istanbul\nAnd he didn't work out that is what we know for sure\nThere are then report that they were to go string jets that came from Saudi Arabia or with fifty men of the day goes into\nA blackout a vans a drive to the ... so the consul general's residence which is allegedly where show he may have been taken and they did what they did to him now there are reports that collecting that attack ish intelligence have proof\nOr that or that they know what happened to him and that he was tortured and dismembered\nAnd a ... the most brutal brutal debts under the fifty men then flew back to a Saudi Arabia\nOn the Gulf Stream jets a little later in the day now we know the the planes that were those to paint movements at different times that came into his stumble ... and then went back to re at\nWho was on them ... that designation was within the state capital right just widowed one hundred percent no but you get the distinct sense that ah the ... the Turkish are telling the authorities here\nAmong the thirties here in the U.S to understand is not a million miles from what I have just sketched out because I think that there has been a willingness to believe and that is why you're seeing\nThe deep expressions of anxiety and on these over what has unfolded and what the implications might be there's some things that you can easily sweep onto the carpet in international affairs and there are some things that are just there are a bit more ... quit I miss definitely falls into the latter category\nWhere we I Wonder if we can talk about the U.S in Saudi Arabia is relationship there very long time allies at a press conference at the oval office yesterday President Trump was asked about\nSo I think that there has been a willingness to believe and that is why you're seeing\nThe deep expressions of anxiety and on these over what has unfolded I Know what the implications might be there's some things that you can easily sweep under the carpet in international affairs on there are some things that are just there are a bit more awkward I miss definitely falls into the latter category\nWhere we I Wonder if we can talk about the U.S in Saudi Arabia is relationship to real long time allies at a press conference at the oval office yesterday President Trump was asked about to show use disappearance here's part of what the president said\nFirst I Want to find out what happened and we're lucky again this took place in Turkey\nAnd to the best of our knowledge because she'll be is not a United States citizen is that right or from a permanent resident okay we're all like John would like it and we don't like it even a little bit\nAs to whether or not we should stop a hundred and ten million dollars from being spent in this country knowing they have four\nOr five alternatives to very good alternatives that would not be acceptable thing okay but we're looking for the answer and I think probably you'll have an answer sooner than people think\nThe president speaking at the oval office yesterday and when we was referring to the human Saudi Arabia and the four or five alternatives would be other countries from whom the Saudis could buy arms to a hundred and ten billion dollars is an arms deal a military deal between the U.S\nAnd Saudi Arabia ... I Wonder if you could give us your sense of how this case\nFits into the relationship between the U.S in Saudi Arabia especially in light of the comment that I read it earlier a re read at chess sixteen forty three wrote on our website the one eight dot org [noise]\nThere is no reason to maintain close ties with a country that the heads more people than ISIS finally gives women the right to drive but it's only window dressing is killing civilians in Yemen and murdered a journalist who was critical of the quote unquote royal\nFamily if I were king for a day all the weapons we've sold them would be rendered useless and Jared Kushner would be banned from any policy making\nLaw the sharp elbows thrown in that comment I Wonder if you could help us fact\nChecked that yeah I think um it's it's really a fascinating point and also that that um clip you played of Donald Trump was really striking because I'm the one hand\nIt seemed so I'm cold Lee transactional in the sense that he was saying you know we have billions of dollars pouring in why am I going to stop that just because they have murdered a dissident journalist in other words I\nFamily if I were king for a day all the weapons we've sold them would be rendered useless and Jared cush there would be banned from any policy making love the sharp elbows throwing that comment I Wonder if you could help us ... trick\nThat yeah I think um it's it's really a fascinating point and also that that um clip you played of Donald Trump was really striking because I'm the one hand\nIt seemed so I'm cold lead transactional in the sense that he was saying you know we have billions of dollars pouring in why am I going to stop that just because they have murdered a dissident journalist in other words I I'm so you know I don't care about human rights I mean we usually stand up for I care about money pouring into the United states economy\nAnd that attitude had activated a lot of\nUm people in Washington who are against our alliance with Saudi Arabia for example senators on both sides of the aisle Chris Murphy and Rand Paul who have an argument for a long time just as the commentator said I'm\nNow we're supporting a war in Yemen that it's unconscionable that is starving civilians and killing civilians killing civilians and you know bus attacks and other things that are just horrendous um\nWhy the hell out of the country short but since you mentioned Rand Paul I'm really sorry to interrupt you but we have a clip of Rand Paul speaking to reporters this week on that very thing he said he would try to force a vote on us arms sales to Saudi Arabia I'll let you finish your thought but first let's hear from Senator Paul\nI think in the early reports have shown that this is linked to the Saudi Government and nothing happens in Saudi Arabia without the government's approval\nSo no I think that ah and less and less of a sudden the journalists turns up alive I think that we should we should just continue our arms sales to Saudi Arabia [noise] plus I think we need to be voting in the Senate and debating whether or not we should be involved in the war in Yemen\nThat was Republican Senator Rand Paul of Kentucky where we go ahead\nSo I was gonna say people like Rand Paul are going to push back against arms sales about about our support for the war in Yemen um even saw a at a law makers invoking the global Magnitsky Act which said that the U. S. trumping ministries and have to investigate what happened and if they find Saudi officials responsible they need to impose sanctions all that being said I Want it is a counterpoint to that too which is that\nOur relationship with Saudi Arabia has always been transactional Trump kind of said the quiet part out loud a little bit in the way he in a way he framed it out yesterday because we have never had a relationship an alliance based in value since World War two it had all been about money and oil I think about nine eleven Fifteen of the Nineteen hijackers were from Saudi Arabia\nThat didn't lead to a permanent rupture in our alliance because we have always seen them as a strategic ally not as a values faith ally as in Europe and I think that's in\nSaudi officials responsible they need to impose sanctions all that being said I Want it there is a counterpoint to that which is that\nOur relationship with Saudi Arabia has always been transactional Trump kind of said the quiet part out loud a little bit in the way he in a way he framed it out yesterday because we have never had a relationship an alliance based on value since World War two it had all been about money and oil think about nine eleven Fifteen of the Nineteen hijackers were from Saudi Arabia\nThat then lead to a permanent rupture in our alliance because we have always seen them as a strategic ally not of the values faith ally as in Europe and I think that's important to keep in mind that Trump said it in a particularly accentuated way and he feels you know is very transactional way past presidents have\nBut this is somewhat reflective of what us presidents have said quietly for a long\nTime yeah sure sure if I could chip in the last ... here I mean I think Donald Trump said out loud what other presidents and prime ministers have said it could moments in relationship to have with regimes that are far from perfect I mean I remember when Tony Blair was prime minister\nAnd there was a huge I'm Still that was about to be concluded\nOn the British serious fruit office launched an investigation into Saudi Arabia or had been doing and whether they'd be paying kickbacks or whatever to get contracts through\nUm old ... and you know it was clear that Saudi says that ... you've got to call this the cooled off the dos otherwise the deal is in jeopardy\nAnd highly unusually mercifully Contra virtually Tony Blair intervened with a ... an independent investigation and said right we're canceling this investigation\nAnd he used his power as prime minister because he felt he had to because Saudi Arabia was two biggest customer too important an ally and you've seen with Donald Trump you know one of the first places he went to when he became president was to Saudi Arabia\nI traveled with him on that trip and\nIt was they were one hundred percent in with Mohammed bin Salman now whether they're regretting their own note is an open question however they they are they're on the un Donald Trump is determined that the arms deal will go ahead Josh before we keep going it oh I was just\nI Know if that change will talk to a former fed official about what the president's attacks me for the institution this afternoon on all things considered from NPR News [noise]\nWhat is the president's comments were we going to end terminate repeal Obamacare and replace it I Will build a great great wall\nOn the cusp of the terms we take a look at what worked and what falling flat from candidate Trump's campaign pledge and\nI Know if that change will talk to a former fed official about what the president's attacks me for the institution this afternoon on all things considered from NPR News [noise]\nWhat is the president's comments were we going to end terminate repeal Obamacare and replace it I Will build a great great wall\nOn the cusp of the midterms we take a look at what work and what's falling flat from candidate Trump's campaign pledges next time on the takeaways politics with Amy Walter from WNYC NPR I [noise]\nThe take away today to Lebanon am on Ninety One point five to your cc\n\nMm I'm ... from king and you're listening to Ninety One point ... on our\nNPR on Ninety One point five for your cc is supported locally by Colorado College a national liberal arts college where together students and professors explore the depth and breadth of each subject one course at a time more about Colorado colleges block planet Colorado College dot edu\nSupport for NPR comes from the station and from bona with the bonus certified craftsmen program a network of hardwood flooring contractor is committed to expertise in customer service contract or low cater and more information or at Boehner dot com\nFrom capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one an a\nAnd from listeners like you who donate to this NPR station\nBack now to the friday news roundup with John ... and ... been still time to get in some of your questions and thoughts about the week's top stories as well one a at W. A. M. U. dot for\nThe story of the next president of Interpol Ming hung way who's reported missing last week by his wife that stories moved Maine was detained by Chinese authorities on corruption charges\nHe resigned in immediate effect this week the arrest as part of a larger official anti corruption campaign by China's president Xi Jinping know grace Meng the ex Interpol president's wife\nIs speaking out she told the Associated Press that she felt threatened\nPushing some thoughts about the week's top stories as well one a at W. A. M. U. dot for\nThe story of the next president of Interpol Ming hung way who's reported missing last week by his wife that stories moved Maine was detained by Chinese authorities on corruption charges\nHe resigned in immediate effect this week the arrest as part of a larger official anti corruption campaign by China's president Xi Jinping know grace Meng the ex Interpol president's wife\nIs speaking out she told the Associated Press that she felt threatened nephews have do we have a sense that you know of why this is going on and what it is that makes me so important to the Chinese government of what this means that a larger sense\nWell he's been a long time operative of the the Chinese government and their arguments being made that this is part of an effort to purge non loyalists to that she government and so there is no definitive answer but\nI think the message that um many are taken as if somebody who's been in government this long and the police capacity um could be sweat swept off the streets and his wife sent a knife ... the day the day he disappears at knowing and China's safe and and at the time of all this there was talk from\nParty officials about the importance of absolute loyalty said their suggestions certainly is that somehow he was less than ... in the eyes of the government\nI Will say I think I'm One of the more interesting developments as well as his wife and how outspoken she has been she has been ah she's in French protective custody\nBut she's been speaking out in a way that we wouldn't normally see out of China and I thought it was an interesting development and may lead to more information coming out quicker than Chinese officials wanted to happen\nAnd so it was fascinating to watch her sort of use 'em up public platform in a way we'd see more often in the west as a way to get information about her husband and defend her husband that it's something we don't normally see\nWas heading out to Brazil were far right presidential candidate John ... surprised the nation when he shot to the top of the ranks he nearly took the election with forty six percent of the vote just shy of preventing a runoff Brazilians will vote in the runoff election soon on October twenty eighth\nCorey Freidman can you remind us who ... is and what makes him and his policy platform so newsworthy\nHe's a fascinating character he's been he's a former army captain has been in Congress for almost three decades um he's a law and order candidate that as his big thing so he says you know our crime rates are too high we need\nKennedy ... surprised the nation when he shot to the top of the ranks he nearly took the election with forty six percent of the vote just shy of preventing a runoff Brazilians will vote in the runoff election soon on October twenty eighth\nGory Freidman can you remind us who usually ... is and what makes him and his policy platform so newsworthy\nYeah he's a fascinating character he's been he's a former army captain has been in Congress for almost three decades um he's a law and order candidate that his his big thing so he says you know our crime rates are too high we need to empower the police he is very controversial and saying you know the police need to shoot first\nUm and and um shoot to kill 'em and and also to losing gun laws to address crime rates he's also very controversial in the sense that he said things that are most optimistic\nUm that are anti algae beauty and one other thing that's really important is to Brazil we often forget I'm only became a democracy in Nineteen eighty five or return to democracy Nineteen eighty five or Twenty one years had a dictatorship and he has spoken ... um\n[noise] about the time of the dictatorship as a time when there were law and order one other point to know is that he had an armored with Donald Trump a lot of conservatives feel that Donald Trump has the right formula be pro business you know loosen regulations\nAh you know be nationalistic and be about cracking down on crime and he has promised to be a really close ally of the United states all of this is\nI'm very a shocking because Brazil for many ... for decades has been led by a leftist government or there was a little more ambivalent about its relationship with the United states and certainly a didn't espouse kind of the right wing view is that he espoused is so this is a real shock to the system I think it really goes to the fact\nThat Brazil I mean it's in deep recession it's embroiled in a massive corruption um crisis that affected all parties except for both an arrow who is actually not been implicated in this and that was his\nThat was his winning point I'll say one other thing we you know the Atlantic wrote an article in which they interviewed a a cab driver who said you know things are so bad maybe we need someone with crazy ideas out who else is going to fix this mat and so I think that that is that is the sentiment that it's worth keeping an eye on because that was a similar sentiment\nIn ... and Donald Trump's victory in the victory of Andres Manuel Lopez Obrador Mexico I mean this is a sentiment that people are feeling against the establishment in many countries in the world\nBut to hear from some Brazilians who are listening in today and looking ahead to the election one listener emailed I'm In a a Brazilian listening from a city next to Brazil's capital Brasilia I'm very concerned about the future of our democracy\nEver who said you know things are so bad maybe we need someone with crazy ideas out who else is going to fix this math and I think that that is that is the sentiment that is worth keeping an eye on because that was a similar sentiment\nAnd bread and Donald Trump's victory in the victory of Andres Manuel Lopez Obrador and Mexico I mean this is a sentiment that people are feeling against the establishment in many countries in the world\nBut to hear from some Brazilians who are listening today and looking ahead to the election one listener emailed I'm Anna a Brazilian listening from a city next to Brazil's capital Brasilia\nI'm very concerned about the future of our democracy the candidate leading the polls is an ex military who has a very anti democratic discourse which is also racist massage and his and homophobic\nSince last Sunday the election day more than fifty people have suffered physical and verbal aggressions from both so NATO supporters social media specifically what app\nIs playing a very important role and lots of fake news is circulating I really believe that with ... out of our democracy is at risk John ... what's projected to happen for the runoff is there any sense of whether ... could win this\nFor the last poll I saw suggested yes that the latest post suggests that he is at fifty eight percent\nAnd the opposition leader is at forty two percent or ... for them to her dad and so I kind of thing that you'd have to say that it's eight to do with that sort of margin of error is going to take some quite something for the left is kind of candidate to come back from that position um I mean you know they talk about violence and the other thing about both ... he was stabbed\nIn September as a rally I'm so there's been a lot of violence around by his men that he's been able to say\nI really love to take part in debates I really count at the moment because I'm Still you know slightly getting for this stopping that I had things that I'm afraid I wouldn't be able to come to your studio this evening and so I think that there is kind of a feeling that you know he is he's got his head down he has said what he said people know exactly where he stands and I think he sees the finish line\nOne story that much of the world has been talking about has to do with a new report from the UN's Intergovernmental Panel on climate change the I. P. C. C.\nThe report says that the world is quickly running out of time to stem catastrophic climate change scientists predict we're on course to go beyond a crucial threshold of the world's average temperature rising one point five degrees Celsius or to point seven degrees Fahrenheit\nIn just over about ten years they save that would leave us dealing with the risks of extreme drought wildfires floods food shortages for hundreds of millions of people we talked about this report\nWorld has been talking about has to do with a new report from the UN's Intergovernmental Panel on climate change the PCC\nThe report says that the world is quickly running out of time to stem catastrophic climate change scientists predict we're on course to go beyond a crucial threshold of the world's average temperature rising one point five degrees Celsius or to point seven degrees Fahrenheit\nIn just over about ten years received that would leave us dealing with the risks of extreme drought wildfires floods food shortages for hundreds of millions of people we talked about this report on the program this week one comment from a listener stuck along the lines that at least here in America\nThis is just not a big enough issue I mean people will vote for a lot of reasons and the state of our climate is not something that lawmakers talk much about or that voters demand to discuss Mr use if what is your sense of that or whether or not this report has made an impact around the world enough for people to start demanding action\nI think it's made an impact but the problem is the effects of this already being seen in various ways around the world so where one country can say it's not\nA big impact another country could see it as an immediate impact on something that needs to be dealt with aggressively in of course the kinds of changes that this report says need to happen are so I'm\nDrastic that in demand sort of a uniform world agreed upon action and we're not there yet and so I'm ... years scene of variance in response and I think it really reflects the variants have impact that nations are already seen\nAny either at work correspondent one of the things I see it come up most often as as a cause of the start of wars and conflicts environmental changes changing where people live how they're able to eat so I'm\nYou know it's an area that doesn't just hit the environment that really hits other parts of of national security and government writ large but there's because of the complexity in terms of its impact\nI think it's hard to get a uniform agreement particularly at it in such a polarized time um so it's hard to be optimistic that that will see at least in the short term the kinds of drastic changes at this report says it needs to happen to stop literally famine drought wildfires really severe consequences\nI think it's hard to get a uniform agreement particularly at it in such a polarized time um so it's hard to be optimistic that that will see at least in the short term the kinds of drastic changes at this report says it needs to happen to stop literally famine drought wildfires really severe consequences", "show_name": "1A Plus", "year": "2018", "city": "Colorado Springs", "day": "12"}