{"month": "10", "state": "CO", "station": "KRCC", "content": "We'll be talking about that next time on the take away from WNYC NPR I\nYou can catch the take away this morning at eleven o'clock this is southern Colorado NPR\nStation K. R. C. C. K. R. C. C. H. D. Colorado Springs ... hunter Casey the s ... K W CCF him woodland park streaming at K. R. C. C. dot ORG [noise]\nUh wintry wet morning across southern Colorado today temperatures right now in the twenties and thirties eyes will be in the thirties and low forties today snow and rain is expected\nTo clear up by late afternoon the news is coming up next followed by one eight it's nine o'clock\nOr shooting and you have President Trump's rhetoric\nOr the link and if so how do we know\nFrom W AMU and NPR in Washington this is one egg [noise]\nEither I'm Joshua Johnson today on what a rage rhetoric and responsibility human face charges for politically motivated violence one from mailing pipe bombs other for killing seniors at a synagogue\nBoth men have echoed President Trump's talking points in hateful online post is the president's responsible for inspiring these crimes if not we'll soon and we're\nTalking points in hateful online posts he's the president responsible for inspiring these crimes if not who else is and regardless of who's at fault or how much what are we going to do about it [noise]\nIt's a tough subject and we need your help to think it through so email us one\nA ... a and you've got bored or tweet us at one egg [noise]\n\nLive from NPR News in Washington encore of a cool and President Trump is traveling to a political rally near Fort Myers Florida Today I had of next Tuesday's elections White House spokeswoman Sarah Sanders says that Trump is going to start campaigning for Republican gubernatorial and Senate candidates\nThey're awful places where the president's overwhelmingly popular in a those locations and I think that the president the best messenger for the party he's had an incredible historic first two years in office and the other great story to tell\nTrump has eleven campaign stops on his schedule before the election you know the president continues to tweet today about what he wants to do about changing birthright citizenship\nThis is guaranteed the fourteenth amendment to the U.S constitution Trump falsely claims that it is not he's also threatening to take the matter to the U.S Supreme Court to get the constitution changed the constitution has only amended through action by the U.S Congress and state legislatures\nNative Americans in North Dakota are suing the state over voter identification requirements NPR's Jeff Brady reports the lawsuit comes as tribes are scrambling to make sure their members have the required id to vote next Tuesday\nThe spirit lake suit tribe and members of other tribes are suing the state to overturn a requirement that voters have a street address on their identification\nMany Native Americans in North Dakota live in rural places and some don't have a street address that get their mail at a local post office Native Americans are an important voting bloc for Democrats in North Dakota\nIn recent years Republicans who control the state government have changed identification requirements citing concerns about potential voter fraud earlier this month the U.S Supreme Court let stand a previous decision that the address requirement is constitutional\nJeff Brady NPR News Bismarck North Dakota\nThere are three funerals planned today in Pittsburgh for some of the eleventh victims of last Saturday's mass shooting at the tree of life synagogue Joyce Feinberg Melvin wax and urban younger will be laid to rest duck boots begin rolling ...\nShooting at the tree of life synagogue Joyce Feinberg Melvin wax and urban younger will be laid to rest duck boats begin rolling through the streets of Boston this hour it's a parade to celebrate the world series victory of the red Sox from member station WB you are in Boston Bob Schieffer reports\nThis is the fourth time since two thousand for that the red Sox have won the world series and also the fourth time players of piled onto the duck boats to celebrate with rolling rally through the city\nThe boats are leaving from Fenway Park and will make their way through the streets with hundreds of thousands of fans expected to cheer them on Marty Walsh says that while parade like this might be a familiar sight in Boston this when in this team stand though\nThis is a an all time great seem that we had I think a lot of people enjoyed watching this team I everybody contributed these players are role models and we want to celebrate them in Boston style\nDoes your socks team won a franchise record one hundred and eight games in the regular season for NPR News I'm Bob Schieffer in Boston\nOn Wall street that I was up more than one percent It's NPR\nA Turkish prosecutors says Saudi Arabian journalist ... was strangled when he entered the Saturday consulate in Istanbul for many days the Saudi Government claimed he was alive than it claimed the dissident died in a fistfight now it is acknowledged that his death was premeditated\nTurkey's president has demanded that Saudi officials turn over ... body but the Turkish prosecutor says it wasn't dismembered and disposed of\nThe u._s. and Kim Rooney and governments say an American has been killed in the troubled northwest part of the Central African nation NPR's affair via Quist Arcton reports Baptist missionary Charles let's go had recently moved to Cameron with his family\nThat are conflicting accounts of how Charles what's going to die nearby Mendoza\nThe main town in North west kind of ruined a region where the ministry and pro independence separatists have been fighting the ... days have blamed the secessionist for west goes death other reports say he was killed in crossfire or by a government soldier the Indiana mission we was reportedly traveling in a vehicle with his wife\nOne of the eight children and another machinery a family member told journalists ... moved to ... less than two weeks ago the state department comes on Tuesday that to an American citizen was killed in Cameron but gave no other details that Iraq was stopped at NPR News that guy\nRescuers in the northern Philippines are working to free people trapped by a massive landslide it was triggered by a powerful typhoon\nRescuers in the northern Philippines are working to free people trapped by a massive landslide it was triggered by a powerful typhoon at least Eighteen people are missing rescuers are using shovels and their hands\nTo dang I'm ... NPR News\nSupport for NPR comes from NPR stations or their contributors include a Rhodes Scholar offering educational travel experiences with an algae BP cute theme to learning adventure aboard the queen Mary and twenty nine pain more it R. O. A. B. scholar dot org slash cue him to\nAs part of the story for military voices initiative and veterans' day Ninety nine point five we'll be hearing the stories of veterans\nIn our dreams for NPR's MORNING EDITION off and he joined and honoring the men and women of our armed forces and they tell their story find out more about the story for military voices initiative she got orange\nSponsored in part by the military care network [noise]\n\n\nThis is one a I'm Joshua Johnson in Washington words are powerful but how much power do the president's words really have\nThe debate continues over what part political rhetoric played in the mass shooting at Pittsburgh's tree of life synagogue and in the mailing pipe bombs to outspoken targets across the country but Donald Trump has never backed away from harsh rhetoric\nThrown out there [noise] if you do all different you in court don't worry about in the good old days is does it happen because they used to treat them very very rough guards\nAre very gentle with him he's walking out like a guy five smiling laughing like the punch him in the face I'll tell you I Love\nTo see one of these NFL Owners when somebody disrespected our flag\nTo say get that son of\nThe field right now how [noise]\nSome are blaming the president at least in part for creating a climate in which these atrocities could happen others including the White House call that outrageous still others say the president's rhetoric may cross the line but blaming him for someone else's criminal actions is unjustified\nWho's right we'd\nLove you to weigh in on this especially of President Trump's words have had a tangible impact on your life email us ...\nWho's right we'd love you to weigh in on this especially of President Trump's words have had a tangible impact on your life email is one a at W. A. M. U. dot org comments on our Facebook page or tweet us at ...\nJoining us from K. AMU public radio at Texas A M university is Jennifer ... an associate professor in the university's department of communication at an expert in American political rhetoric Jennifer welcome to want to say\nHello and thank you for having me on joining us online from Georgia is highly ... director of the intelligence project at the Southern Poverty Law Center the project trucks hate groups and extremists Heidi welcome thanks for having me and that NPR New York Nick Gillespie is editor at large for the libertarian magazine reason Mick thanks for joining us\nOh my pleasure thanks for having me Jennifer let me start with you you've been paying very close attention to President Trump's rhetoric\nFrom an academic standpoint since twenty Fifteen during the campaign when after he announced his candidacy what have you noticed about his use of language particularly the most salient ways that you see maybe differs from previous presidents\nYeah so Trump is very consistent with the way that he uses language he has used the same sex rhetorical strategies throughout his campaign and his presidency\nUm and and largely those are the strategies that presidents typically use for war rhetoric and so what I mean by that is you have lots of examples at the beginning of what we think of as ... threats threats of force we usually use those threats of force when we're trying to intimidate opponents\nCare she she was natural for us we started in two thousand and two with salsa Robin rocker imminent we've grown to twelve locations up and down the front range in the last Fifteen Years and feel like it's been a great partnership find out how to sponsor were Ninety One point five or six or seven one nine four seven three four zero one you'll be glad you did\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile apps free at Google Play and in the eye tunes asked our\nProgramming on Ninety One point five K. R. C. C. is supported by Jackson Greek senior living monument offering independent living assisted living in memory care residents is designed for many lifestyle choices wellness programs tailored activities in more now scheduling tours more at Jackson creek senior living dot com support for NPR comes from\n... says wellness programs tailored activities and more now scheduling tours ... Jackson creek senior living\nDot com support for NPR comes from this station and from ... I'm committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees EM dot com slash NPR\nAnd from the F P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nThis is one a I'm Joshua Johnson we're discussing the role of political rhetoric in public life particularly these latest acts of politically ... politically motivated violence and whether or not President Trump bears any responsibility at all for these acts we're discussing with Jennifer ... an American political rhetoric expert from Texas a and M. university\nHeidi by wreck of the Southern Poverty Law Center and Nick Gillespie of reason magazine\nWe'd love to hear from you particularly if you have noticed tangible impacts of President Trump's rhetoric in your life whether you believe that the president bears responsibility does not have responsibility we'd love your help thinking out loud about this question so comment on our Facebook page\nTweet us at one a or email one a at W. A. M. U. dot org let me get to a few more of your comments Laura is in Goshen, Indiana\nLaura emailed Trump as the vanguard of our worst angels is effectively sounding the horn to release previously restrained prejudices latent in some Americans\nHate is now fair game at high volume what they call the end of political correctness is the end of civility and democracy missing McCain and Obama now you don't know what you've got till it's gone and it's gone\nHeidi by Eric I Wonder if you could respond to that comment I Wonder if what Laura is saying in a way takes a little of the pressure off of President Trump in so far as he didn't create these views he happened to have tapped into them but you can tap into something that wasn't already there\nI think that's a completely fair position I mean you know the United states that's how long problem with white supremacy and racism and legally oppressed you know parts of its own population for centuries\nSo that it's legitimate to say that this kind of have has been there I Will say that the work we do at the Southern Poverty Law Center found in ...\nSo that that it's legitimate to say that this kind of have has been there\nI Will say that the work we do at the Southern Poverty Law Center found a great escalation and the number of hate groups for example on line hate rhetoric particular ... during the years that Obama with an office as an African American he very much a\nSet off white supremacist you were unhappy with him being elected to the highest office\nAnd the Internet itself has allowed this kind of material to proliferate radicalized people you know it's allowed to be shared in a way that wasn't the case in prior areas so we have a lot more of it around and that's certainly something Trump has tapped into\nNick how do you see it uh there's no question that there is a hyper polarization in American politics and I think it's important to also recognize that something is going on internationally when you look at Europe ah there is a larger\nKind of breakdown of post World war two consensus um you know in general throughout the developed world and certainly in Western Europe and North America a Trump did not create that he isn't happening it and he's exploiting it to his political uh aims we\nNeed a a tremendous reset I think in American political discourse in this is not a I'm not even talking about the rhetoric of hate per se um of polarization of opposition at this point according to Gallup about twenty six percent of people\nIn America identify as Republican about twenty seven or twenty percent identified as Democrats these are historic lows\nAs those noted before there is a historically low level of trust and confidence in the government and other major institutions we need to come up with\nA a political rhetoric of public rhetoric actually that is\nI'm not a you know that is not based on demonization polarization and again either Trump Trump bears a certain core responsibility as president of the United states because he is not\nSimply a politician he is also on some level or he should be leading the discussion in a way that us more productive than he is but he's also not the only one are you doing this um [noise]\nAnd um the other thing to think about though is\nWhat is the distinction between rhetoric and action um and you know when we we live in a violent the society that is filled with a lot of a fantasy violence whether we're talking about games whether we're talking about rhetoric et cetera but in general crimes are going down and violence is going down so again\nRecognizing that rhetoric is one thing in reality is another I think is you know it was the starting point of any conversation\n... are going down and violence is going down so again recognizing that rhetoric is one thing in reality is another I think is you know it was the starting point of any conversation about this but I Do think we need to reset and that it needs to ah needs to move away from polarization but this is much much bigger than Donald Trump I Wonder though Nick how much\nPower we give the words that are set especially in the political sphere I mean anyone who thinks that and I I Know you're not saying that words have zero power but ... who who minimize the power of words needs to go back and read the declaration of independence those words yeah weapons for sure and they led to a war\nAh you know yeah I I you know I I agree completely with that and and I realized that I you know or maybe it's a slippery position where I'm saying you know simultaneously that words matter in rhetoric matters but also that we need you know what what are we going to do about that so I guess as it is another way of coming to this question of\nTrump's rhetoric is ridiculous it as hate filled is garbage I mean it is and it you know it's been now uh we we can go on and on that doesn't get us any closer to figuring out how do how do we have a better conversation about politics about places where we need to\nReach a consensus and and then in that policies that actually work for the benefit of of people\nI Do want to talk a little bit more going forward a little later in the conversation about what next steps my looked like next so we'll we'll circle back to that Jennifer mochi a number of people\nHave commented on the role of the press of various media outlets that I Will try hard not to use the term as a media\nBecause there are so many different kinds of media out there will try to be a specific as we can and and thanks to those of you who have commented who have been specific who've mentioned specific networks or specific people that is extremely helpful so keep that up\nLet me get to a few of your comments about various media outlets in various press outlets\nCheryl tweeted the largest responsibility belongs to the twenty four seven media and those who absorb commentary an opinion as if it were factual news that President much like Andrew Jackson stands up to the press should he just let the Ninety percent negative coverage go we all need to be personally responsible\nMod asks why does he get so much airtime\nAnd Jim Wright's why hasn't anyone addressed the years of conditioning the public has received from talking heads such as Rush Limbaugh Glenn\nBeck Alex Jones et cetera they have permeated our society and finally elected their leader which only embolden stone Jennifer before you react to that sweet of comments\nPermeated our society at a finally elected veer leader which only embolden stone Jennifer before you react to that sweet of comments I should note that going back in recent years\nHas tried to walk back some of his rhetoric has as publicly apologized in his words for for taking some of the rhetoric too far but I Do wonder Jennifer what your senses of how much of an oval various media outlets playing this\nIt's a great question and I think that um there's a little bit of a historical big picture that um maybe would inform my answer here I'm In part of that is a reciprocal ruled that used to exist between the president and the press\nUm it used to be the case that uh there was a mutually beneficial relationship between the presidency and the press a largely because they needed each other the press needed the president for information and the president needed the press because the president needed to disseminate that information and get their message out\nUm that relationship has fractured a and that's largely due to um cable news and social media and the fact that we all now have this platform to disseminate and circulate information including the president\nUm and so information circulates in a very different way than it did twenty thirty fifty years ago which is really fractured this relationship between the press and the president and Trump has been able to take advantage of that\nAre in a way that that previous presidents had tried to do but Trump has really done much better for worse job depending on your perspective um and so a Trump is completely mastered the news cycle and the way that\n... especially cable news has been complicit I think in\nIn amplifying his message at you know on Twitter he has followers many of them are bought a but most of Americans aren't on Twitter but we see his tweets everywhere right\nBecause those messages are amplified and that is Trump using the bully pulpit the good puppet of the presidency and also taking advantage of all of these other social media opportunities\nFind our ballot guide K. R. C. C. dot org and cast your vote confident [noise]\nYour Ninety One point five care see the membership is vital we thank you for your financial support\nWith confidence [noise]\nYour Ninety One point five care cc membership is vital we thank you for your financial support which directly funds are news music an online services at K. R. C. C. dot org\nNPR on Ninety One point five K. or CC's supported locally buy moxie a plant based restaurant on a mission to help with holiday meal planning by offering a selection of plant based take out for the Thanksgiving table menu and more at live moxie dot C. oh\nBy the the the music department\nPresenting a concert with Kathy fully titled lot ... a hundred ... a Japanese puppet show accompanied by feces ... muti ah Robert us November eleventh three PM in Packard hall\nSupport for NPR comes from the station and from logged me in makers of go to a meeting that collaboration meeting platform that comes equipped with features to help people stay focused to get work done and learn more it go to meeting dot com\nFrom capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere capital one what's in your wallet capital one NA\nAnd from the John D and Catherine K MacArthur Foundation at max sound dot org\nBefore we get back to our conversation we would love your help with tomorrow's program about voter access head of the midterms we've heard a lot of concerns about people who should be able to vote not being able to voter fraud has been a hot topic for the last few years some say voter suppression is worse now than it's been in some time\nHow easy or hard is it to vote where you live\nWhat have you encountered in terms of registering to vote or casting your ballot leave us a voice mail eight five five to three six one a one a if you've ever run into problems voting what was the issue and how did you deal with it\nTell us your story eight five five to three six one a one a or send us a radio quality audio files through our app won a vox pop will share some of your stories tomorrow on one day\nBack now to our conversation with Jennifer ... Heidi by Rick and Nick Gillespie a few more of your comments Fernando tweeted we are all adults at adults take responsibility for their own actions the media is trying to find a scapegoat and it is truly unfair but then again he is blamed for everything done\nThe media is trying to find a scapegoat and it is truly unfair but then again he is blamed for everything\nDone writes the shooter is responsible dumb question\nDrew tweeted short may not be responsible for the violence but the people who are feeling Bolden and encouraged by what he says as long as he remains inconsistent and denouncing violence and hatred they'll continue seeing him as an ally\n... could you respond to that last week from drew you it is true that the president has denounced the violence I mean the first amendment she made after the carnage in Charlottesville was to denounce white supremacy bigotry hatred notes forms\nAnd in that press conference that impromptu press conference in the lobby of Trump Tower in New York on the Tuesday I think\nHe said there were good people on both sides I Wonder how you view this in terms of the the way that the president denounces violence at least at a statement\nAnd then makes comments that are vitriolic thereafter how do you see this\nYeah it's a great question and and I'd also like to address the question of responsibility and if we have a moment that after answer\nI'm so Trump will say the thing that somebody has written for him to say he will read from the teleprompter when he is forced to do that\nUm but that isn't his natural inclination and so I have tracked in fact the way that Trump uses denial I'm In these situations when people do try to hold him accountable and suggest that he has some responsibility for something\nSo for example during the campaign I'm a group of white nationalist at the Daily Stormer decided that they would avenge um what they thought was a bad a article that was written by Julie ... kill 'em and so they sent her um hate messages and death threats and you know did all kinds of terrible things to her\nAnd then when they asked Trump about it he said he didn't know anything about it so his first strategy was to deny any knowledge and then they said well and you know the sun CNN they said well but you know do you have a message about this now you you clearly know about it I'm telling you about it\nAnd then he denies association with the people right and he says I don't know I don't know those people and he says what fans of mine you know are these are these fans who've done this\nUm and then he does a third thing which is to wonder what um the journalist Julie ... he had done to deserve this hatred you know did she write this terrible article that is full of you know lies about me um and then to um\nHe had done to deserve this hatred you know did she write this terrible article that is full of you know lives about me\nUm and then to accuse other people have doing the same kinds of things right to an appeal to hypocrisy um and if you look at when Trump is responding to these situations where people are trying to hold him accountable for his violent rhetoric\nUm he follows that same pattern he denies knowledge of it he denies association of it and maybe praises the people who've done it he wonders what the person did to deserve it and then he finally uses to quote ... which is an appeal to ... to say oh everybody else does this it's not just me\nI'm In that is classic for Trump he cannot be held accountable [noise]\nThis is why I call him a demagogue a demagogue is an an accountable leader and that's a historic definition deriving from ancient Athens\nUm and and we're talking about whether Trump is responsible and we can say that he's responsible but I'm telling you Trump does not accept responsibility he won't take that responsibility um and admit that he in fact has been wrong\nI Wonder how effective do Jennifer's in a situation like this to refer blaming you for this I'm just kind of wondering what your teachers or to refer to President Trump\nAs a demagogue I mean she is the duly elected president of the United states of America she won the electoral college and when you call him a demagogue\nYou call all the people who looked at him supporters enablers of a demagogue at a time when something like this happens but it's got to make it harder to have to cut it to be we need to have about ... about refining the civil discourse\nSure it's an accurate term so um if you look it up in the Oxford English dictionary and the lady you'll see that the first step finishing of a demagogue is positive for neutral it says that it's a leader of the people which is bad etymology of the word\nWho defends the rights of the people against the other parts of the state the second definition of demagogue is a leader who uses polarizing propaganda for their own personal gain\nDonald Trump is a demagogue in both senses of the word\nFor his fans for his followers and has voters the ones who won't leave him who will defend him at all costs they defend him because they see him as a heroic demagogue they see him as defending their rights against the other parts of the state that they believe are corrupt\nEveryone else who sees him as a demagogue in the bad sense of the worst\nAs defending their rights against the other parts of the state that they believe are corrupt everyone else who sees him as a demagogue into bad sense of the word sees him as using polarizing propaganda for his own gain\nSlip through the use of the word to use the word accurate though it may be is it\nHelpful I think so\n[laughter] it's an analytic point we can't understand what Donald Trump is doing if we can't understand what he's doing an unaccountable leader is a danger in any political community but is specially in a democracy\nPolitical scientists and historians who are concerned about the health as American democracy people who are charting democratic erosion and how democracies die they point to the kind of language that he uses they point to the authoritarian tendencies of I'm wanting to uh\nYou know Jill people or change the constitution to all of these things all of these authoritarian tendencies um which are are grounded in his language frankly I'm as as evidence of democratic erosion\nParty a wonder if you could respond to one of the concerns that I think are a number of people on the political right have raised which is this idea that the rhetoric is too hot all the way around but the political discourse\nAs a heated up in both directions many on the right her pointed to the left saying that they use similar rhetoric to the rhetoric the President Trump has been using but they don't get cold out for quite as much here here's a sample of some of what they're referring to\nRead his time for us as Democrats dubious covers they are getting hated his arms have used them as they often which shows do you know when they go low we [noise] go low we to [noise]\nThat you cannot be civil with a political party that wants to destroy what you stand for what you care about that's why I Believe if we are fortunate enough to win back the house and or the Senate\nThat twin civility can start again but until then the only thing that the Republicans seemed to [noise]\nBack the house and or the Senate that twin civility can start again but until then the only thing that the Republicans seemed to recognize and respect his strength\nThat of course was former secretary of state and democratic presidential candidate Hillary Clinton preceded by democratic California congresswoman Maxine Waters and first was former attorney general Eric Holder Heidi ... what about the portion is across the political spectrum how does that factor into into our current climate well there's no question that\nTo be Seventy five percent I Believe urban by twenty fifty\nWe'll be talking about that next time on the take away from WNYC NPR I\nParticular way today to Lebanon am on the one point five to your seat southern Colorado's NPR station programming on Ninety One point five K. R. C. C. is supported\nBy the Colorado Springs law firm of ... can hurt and cry for forty five years hoping navigate through many legal issues that arise when a loved one dies from providing guidance about probate settling in states more get her skin heard dot com\nThis was southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs ... hunter PCS store crew M. T. W. CCF them woodland park\nWelcome to ... civics class where Homer high school social studies teacher in ... he answers questions about our upcoming election\nThis week we asked why Tuesday this is a question that goes all the way back to the early days of our republic and the seventeenth Eighteenth century primarily United States was an agrarian society and we\nKept the Sabbath holy so we could not vote on the weekends and we needed to avoid Wednesday's which was the traditional market day so Tuesday was settled on and in fact it was actually codified\nInto law by Eighteen forty eight by the Congress who decided it would be the first Tuesday following the first Monday in November that also would allow plenty of time to deal with things like the electoral college but that's another issue\nNext week we ask why don't we have compulsory voting the way some countries to be sure to visit K. R. C. C. dot org for more election resources\n[noise]\nFrom NPR News in Washington ... sang\nIt's now sprint to them in terms and as NPR's Tamara Keith tells US President Trump will be attending a series of rallies on behalf of Republican candidates\nIncluding near Fort Myers Florida Today with less than a week to election day President Trump has eleven campaign stops on a schedule all aimed at boosting Republicans and competitive Senate and governor's races\nTake Florida a state Trump will visit twice this week there are highly contested house races but he isn't going to those districts instead focusing on heavily Republican areas where a boost in turnout would help the Republicans running statewide\nTrump philosophy making to stop the each in Missouri and Indiana State T\nPublic in areas where a boost in turn out what helped the Republicans running statewide Trump will also be making to stop the each in Missouri and Indiana State T. one in twenty sixteen both have Democratic senators in tough reelection fights camera Keith NPR News\nEchoing Trump's politics on immigration Austria's right wing government says it will not sign on to a new United Nations packed on immigration carry scarring has that\nStory for global ... migration so you've only had helpers countries dealing with large influx of refugees\nLittle streams anti immigration coalition claims of my blur the line between legal and illegal immigration and impacts over into opposition parties described the decision was a low point we're recovering the presidency\nCarry scarring reporting aid groups are welcoming us call for a ceasefire in Yemen where officials have been warning of manmade famine the U.S has been backing one side and the complicated civil war Saudi led coalition that is fighting Iranian backed rebels as NPR's Michele Kelemen reports\nSecretary of state Mike Pompeo is called for a cease fire was carefully worded calling on the Iranian back to the rebels in Yemen just dump launching strikes into Saudi Arabia and the United Arab Emirates\nSubsequently he adds coalition airstrikes most seats in populated areas in Yemen us lawmakers have been urging the Trump Administration to stop providing logistical support for the Saudi led coalition because of the highest civilian death toll in the air campaign\nBump a oh what's going on all scientists aboard un mediated talks Sweden's foreign minister says her country could host such a meeting Michele ... NPR News the state department\nSaudi journalist ... G reportedly with strangled as soon as he entered the Saudi conflict and assemble on October second the statement today by prosecutors ... is the first public confirmation by Turkish official about the nature of how could show she was killed\nThe prosecutor says ... killing and dismembered met were premeditated by Danny issued a statement as Saudi Arabia is chief prosecutor sewed Elmo job ended his three day visit to assemble the talks reportedly did not result in anything concrete and there's still no word on where ... remains are\nFrom Washington this is NPR News\n\nLawmakers in Canada and the u._k. want to hear from Facebook CEO Mark Zuckerberg on what's been done so far to combat the spread of missing\nLawmakers in Canada and the u._k. want to hear from Facebook CEO Mark Zuckerberg on what's been done so far to combat the spread of misinformation and protect users' accounts from being compromised again\nParliamentary committees in both countries are urging him to testify before what they call an international grand committee involving British and Canadian members of parliament the joint session is scheduled November twenty sevens\nThe Census Bureau estimates more than forty million children will be trick or treating across the U.S tonight on this Halloween NPR's hunting all along has more\nThe Census Bureau is defining trick or treating youngsters as those between the ages of five and fourteen so sorry you can you lovers in your late teens are still young at heart\nThe kids though have a lot of ground to cover around the country based on the latest population estimates there are one hundred twenty million homes that maybe handing out Halloween treats likely include chocolate produced by around forty thousand people who work in cocoa factories and other facilities in the U.S\nNot to mention the other types of candy sold by more than three thousand confectionery and nuts doors\nAccording to an Associated Press analysis of census numbers the stayed with the largest share of trick or treaters about one in six residence is Utah ... along NPR News New York\nWell hiring appears to remain strong at U.S companies the payroll processor ATP released the results of a private survey that found employers added two hundred twenty seven thousand jobs this month that would make October's job showing his strongest an eight months retail and manufacturing were among the sectors that showed robust employment growth\nIn October [noise] this is NPR News\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nNinety One point five ... is dedicated to covering a changing southern\nColorado your membership dollars directly fund our local reporting thank you for your sustaining membership\nSupport for the Ninety One point five years easy newsrooms provided in part by indeed dot com where business owners in age or professionals post job openings review candidates take notes and schedule interviews more information at indeed dot com\n\nSchedule interviews more information at indeed dot com [noise]\n\n\nThis is one a I'm Joshua Johnson in Washington when you think of which is\nWhat springs to mind is it this\nNew Mind or maybe this one time there was a typical American [noise]\n[noise]\n[noise] what about this\nFor this audience Lonnie next\nWhich meant many things to many people from terrifying ... steel infants and living up\nTo empowered renegades who fight patriarchy and control their destiny is two series featuring which has debuted this month the chilling adventures of Sabrina on Netflix and charm the remake of charm on the cw than there are films like the which from twenty sixteen and ... which came up this year\nHalloween is it time for many of us to indulge in fantasy but disease fictional witch's point to the real ways that our views of women are changing\nWe love to hear your thoughts on this ... ... email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one and three guess joined us from NPR in New York to discuss it Christian ... is an instructor and lecturer at the new school in New York\nShe's the author of which is slut and feminists Christian welcome to want to say thanks for having me\nPam gross when is the host of the which wave podcast she's also the author of what is a witch and waking the which reflections on women magic and power Pam welcome so happy to be here and Constance ... is a culture writer at vox Constance glad to have you with us\nThanks so much for having me let me start with you Constance I Wonder if you could bring us up to speed with\nHow which is are are kind of played in pop culture right now I always wonder if these kinds of things are part of a moment that his organic or whether it's like one studio did a thing on which is and then all the others to do is we're like oh that work let's do that to how to use it\nBut I think they really feed this particular written on land at something that's been very linked to make a terrible pun a hundred years now thank you Don I think\nParticular written on there and as something that's been\nBrewing to make a terrible pun a few years now thank you [noise] um I think starting more or less at the beginning of the decade uh with sites like ... and and sort of the teen social media\nNinety One point five K. R. C. C. is supported\nBy the use CCS artist series presenting the Vienna boys' choir talented young singers from around the world November ninth at the end Center for the arts\nTickets to UCS presents dot or by wolf creek ski area open for the season on weekends with a sixteen inch base in forty inches of new snow this October will freak large features a full menu and the ski school in rental shopper also open\nDetails at wolf creek ski dot com by Ninety One point five K. or CCD members throughout our listening area\nThank you for your supportive southern Colorado's NPR station Ninety One point five years cc online at ... dot ORG\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be opened from anywhere capital one what's in your wallet capital one an a\nFrom the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and ... solutions at industrial scale learn more it see three ... ...\nAnd from the listeners who support this NPR station\nThis is one a I'm Joshua Johnson we're having a little fun this Halloween discussing the changing legacy of which is particularly in TV and movies and pop culture was authors Pam grow spin and Christians so late and Fox culture correspondent Constance greedy\nWe love to hear from you too particularly if there are certain which is in pop culture that or your favorites that you may identify with or if you've watched any of these new ... charmed Sabrina what did you make of them particularly did they speak to you or perhaps did they\nTo ... charmed Sabrina what did you make of them particularly did they speak to you or perhaps\nDo they turn you off in some way did you think the depiction maybe didn't quite hit the nail on the head whatever your views are we love to hear some comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org\n... let me come back to you to talk about the nineties a little bit there are two particular nineties references that I Love you to react to one of them is one that has been getting a lot of attention lately because it's celebrated its twenty fifth anniversary this year\nHere's Bette Midler caffeine the Jimmy and Sarah Jessica Parker in Nineteen Ninety three hocus pocus\nBe must find a book the new the posts and its allies mature enough sailing default and\nWe\nWe just how come\nThe head and he was saying just use if they win either way easier with the adventure and he says the slow lane\n[noise] focus focus from Nineteen Ninety three I was Thirteen I saw this in the movie theaters I was like I don't know why I Love this movie but I'm going to love this movie for the rest of my life so that's hocus pocus then there's also the movie the craft from Nineteen Ninety six years Robin Tony and Rachel True in the craft\nThat my sister and I asked for the thing that they had those who gave me\nEspecially racist pieces of bleach blond score unless he\nConstancy feel like two very different kinds of depictions from the nineties but but were there any common bond so\nI think there are certain similarities um I think both of those movies are sort of grappling with the kind of wizard of Oz Margaret Hamilton idea but which that we talked about earlier right the idea of the weight just this weekend threatening woman who is the villainous types the status quo\nAnd he'll get don't get the way it sort of deals that that is it makes the which is fine and bumbling and they're not totally threatening because they're so bad at what they're doing that in the end of course the the modern caves\nAre Victorian which is our sense away and\nTry to feed it and you don't have to worry about them ever again the craft kind of wants to embrace the idea of the wicked witch a little bit more ... sort of the joy of that movie is watching ... grills gain access to the power and sort of spiraled out of control and go feral in this kind of really satisfying way but at the end of the movie\nGain access to the power and sort of spiraled out of control and go feral in this kind of really satisfying way\nBut at the end of the movie they still have to be returned resort to the status quo right because it would be too threatening at that point in time if they got to just have all of this on channel ... so it starts to their power which is officially agenda this but the movie consistently efforts and as a male and sometimes they call him daddy\nThe source of their power puts restrictions on them\nAnd the only the witch who\nSort of response to those restrictions appropriately it's that gets to keep her power the ones who rebel against those restrictions and tried to just do whatever they want get punished and have to be\nSort of sent off to an insane asylum in straight jackets in order for the status voted to restore it so we don't labeled at these movies are about the idea of wanting to bring the wicked witch than is the end of the ... the ... century and wanting to get access to that however but not being quite able to do so with wholeheartedly\nGlad to hear from some of you about your favorite references to which is in music and movies TV and books more tweeted Sylvia ... Taliban and the which the C. A. L. I. B. A. and the Taliban and the which\nIs essential reading on how early capitalism and massaging this witch hunts were tied together and the current season of American horror story is all about which is trying to save the world\nMolly tweeted how about the episode of broad city called which is when Abby and a lot of learned to embrace which one is as a powerful part of womanhood and perhaps actual magic\nChristian so let's talk a little bit about American horror story particularly the third season of the anthology series American horror story covering which takes place in New Orleans here is Jessica Lange as Fiona good from the third season\nShare I took down your entire company with about as much as it takes me to mix that has a Roth Roy\nAnd Marie in more than\n... thank you thank God which reminds me honey drink\nJessica Lange us feel good in American horror story coven now Christian feeling good is not very good in the series she sucks people's life forces to remain eternal young but she's always got a quip she's one step ahead of our enemies she dresses fabulously and it seems like even when which is are evil\nBut she's always got a quip she's one step ahead of our enemies she dresses fabulously and it seems like even when which is our evil in pop culture they still kind of are portrayed as enviable\n[noise] yeah I think it goes back to the ... type this off and ah one of the stations that the ... that we see\nAnd um yeah we were afraid of her um but we love her you know were drawn to these things that we fear and I think that's that's what makes which is so appealing particularly someone like the on and we want to see her be wicked and\nThen we want to see her be punished for it unfortunately that's what most people want to say and so that's kind of what plays out within that area so that ... it was many years ago so he probably seen it [laughter]\nI Wonder how you see that the crust than I mean you know when when we look at the the way that different struggles for equality or for social ascendancy are depicted\nYou know sometimes it's the it's a very it feels like a similar cycle you know you have these these characters that are very noble and then eventually we get to these characters that are renegades you know we have\nThe Sidney ... is the first wave and then you've got blacks boy station movies you got shaft it's the second wave you have these characters who are are very admirable and noble and then you have cattle characters who are like you know screw it I'm chicken butts and taking names\nYeah I mean I it just speaks to the the complicated nature of actual human being so in that way they're sort of a human is ... and that's happening when we see these multifaceted which is\nSondra excuse me a busy black woman tweeted so thankful for your guests alternative perspective on be which that's the one which I never liked because of her husband's demands that she not use her powers\nUh oh yeah ... I Wonder if you could could help me with this ah the use of the word which I don't know if you've encountered this but I Would countered a lot of men who have used the W. word\nBecause they knew they weren't allowed to use the B word this word is very charged for a lot of men I mean even that song by Frank Sinatra witchcraft where he says there's just no nicer which than you I think that's kind of a sideways reference to that B word is that's something we have to grapple with\nAbsolutely and we see it in the politics all the time you can Google pretty much any female politician and no matter what side of the aisle they're on it\nAnd we see it in politics all the time you can Google pretty much any female politician and no matter what side of the aisle they're on you will find them photoshopped as a which\nI'm so this really is still a negative epithet that a lot of people use to put women in their place to shame them um to shut them up\nEspecially women who are in the public eye who have opinions and who dare to speak their mind\nYeah I I Wonder kind of costs we do\nWith that mixed connotation a new will wrote on our Facebook page\nI don't see the concept of which is as a positive feminist forcing mainstream American society if a woman says she identifies as a witch in any sense of the word she's only embrace without identification and pig and culture the word which still has negative connotations like witch hunt\nSo I don't see it as a way for feminists to assert themselves and be hurt a strong powerful voices in society\nWe'll be talking about that next time on the take away from WNYC NPR I\nTo take away today to Lebanon am on Ninety One point five K. or CDC southern Colorado's NPR station\nYou're Ninety One point five K. I. C. C. membership is our largest source of funding allowing us to bring you local stories music and news and NPR Thanks for supporting Ninety One point five K. R. C. C.\nNPR on Ninety One point five ... your cc is supported locally by the money museum believing that money and medals or works of art and a window to history with rare diseases including a four million dollar nickel located next to Colorado College an Eighteen north cascade avenue\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from American University's ... school of business committed to business being a force for meaningful change through graduate and to undergraduate degrees mission\nGod school of business committed to business being a force for meaningful change through graduate and to undergraduate degrees mission driven curriculum and hands on approach Morris co God ... dot edu\nBefore we get back to our conversation we would love your help with tomorrow's program about sports and politics\nWhen Colin Kaepernick refused to stand for the national anthem before forty niners games he was far from the first athlete to protest publicly he follows generations of athletes who've done the same despite some fans owners and commentators telling them to just shut up and play\nWouldn't you love to see one of these NFL Owners when somebody disrespected our flag\nTo say get that son of a job the field right now [noise]\n[noise] what\nPlease do you feel that politics has in sports if any\nLeave us a voice mail eight five five to three six one a one a\nDid an athlete's public prospective ever helped changed your opinion on something happening in the world tell us your story eight five five to three six one a one a or you can leave us a radio quality audio file through our app won a vox pop will share some of your stories tomorrow on one day\nI'm no free cat but I tend to avoid scary movies if you're like me and you find yourself facing a tale of terror on the screen here's a tip don't cover your eyes\nCover your ears\nImages of spooky houses in bloodthirsty monsters are only a small part of what gets our heart's racing [noise] the rest of it's done by the south [noise] especially the music [noise]\nJohn Carpenter is a master of horror movies end of the soundtracks that bring them to life his latest project as a return to the film that launched his career\nHalloween John Carpenter directed and scored the original back in Nineteen Seventy eight and he's the composer on the twenty Eighteen sequel which is in theaters now John Carpenter welcome to want to thank you for having me you've been away from a Halloween movie franchise for some time now\nTwenty eight teams sequel which is in theaters now John Carpenter welcome to want to thank you for having me you've been away from the Halloween movie franchise for some time now what made you decide to come back\nWhen his producer Hollywood producer Jason Blum a convinced me to come back\nI knew that one was a a a sequel is going to be made as I Know a Malik the cod he's the the son of the man who put up the money for the original Halloween so I knew there was a sequel coming\nBut Jason bomb or talk to me and he said you know where it's going to be made with or without us so why don't we meaning he he and I\nI'm getting bored and try to help it be good so nobody had put it to me that way before so I thought that's a great great thing\nJason Blum spend doing some pretty interesting things with horror movies lately what what do you make of where the genre stance today\nThat's in good shape but it's always in good shape horror has been with cinnamon since the very beginning and I have a feeling [noise]\nAh it will be with us until doomsday just because everybody's scared of something that were all born afraid we all understand fear and so it's really fun to go to a horror movie with your girlfriend or your significant other and cuddle and scream and so forth\nAnd it was it like for you not being in the directors chair for the twenty eighth team verse of Halloween you are involved in the film but what about watching someone else direct this movie it was a relief\nBecause I don't have to suffer the stress and anxiety\nThat directors suffer and that's a worst profession in the world other than being a coal miner\nThe worst other than a cold I'll come on now well it could it could be worse I guess you could be a slaughterhouse technique that\nYou're right ah it's not the worst now\nUh when when things were [noise] ah it's great to be a director when they don't work it's it's really garbage\nWhat do you think movie fans least understand about what it takes to direct a movie especially a horror movie\nWell ever [noise] what are they at least understand let me think a\nA directors are responsible for all of the central elements of a movie if it's supposed to be funny they're responsible for the humor of it if it's an adventure and so forth and so on so director of a horror movie think of it this way horror and comedy or a\nLot like because it's tiny it's all about timing and it's all about when things happen and how the\nAnd and comedy or a lot like 'cause it's tiny it's all about timing and it's all about when things happen and how they unfold and it's more complex than than people assume but um people just thinks that horror as a lot of Gore an obvious violence and it's not\nYeah see I I I hear you on that it's an interesting analogy between horror and comedy I'm not big on ... or I Do not personally do well or on blood and Gore and all but a good suspenseful movie like I can I can hang with that 'cause that's that's a satisfying experience what what do you think\nIt takes to make that kind of timing in a horror movie work\nWhat is it what does it take to make a horror movie work these are secrets that only the Brotherhood no so I Can't oh come on you can tell me something well look to make it really simple\nUh there are no rules for any horror film\nThe horror horror movies come out of the story and horror is every\nAction think of it that way not a genre necessarily what the reaction to things\nAnd that if the story is is unfolding then you use the storytelling\nTo a a a set up your scares set up things\nFrightening for the audience he said the word earlier suspense that's what you if you get the audience in suspense and you can scare them\nSo maybe the key is having a story\nIt's got enough of the right elements to make me feel that suspense so that they're there can be that pay off so that there can be the scare is that it that is correct you got it what about the music you contributed music to this film and and the music to the original\nIn Nineteen Seventy eight what does it take to make that kind of music work for a scary movie\nWhat does it take it takes a certain amount of talent and the ability to play musical instruments and feeling for him\nThat's what it takes now were you always musically inclined when you put the original movie Halloween together Nineteen Nineteen Seventy eight or was it something that kind of came together unexpectedly\nNo I I grew up in a musical household my father was a music professor he was a [noise] a virtuoso violin player and he had taught to college\nLevel music courses at the university where I grew up I grew up with music in the house all the time classical music listening to it\nHe decided when I was about eight years old and I should learn to play the violin there was only one problem with that and I had known\nHe decided when I was about eight years old and I should learn to play the violin there was only one problem with that and I had no talent other than that it was a great idea\nBut I moved on from the violin to the piano and tar and other things I picked a lot of stuff up\nWhere there any particular influences that you draw on when you made the music for the original Halloween or that you've drawn on over the years\nYes I'm all classical a\nMovie composers and classical ... ah musicians and rock and roll I'd get influenced everywhere\nWhat about the timing of the theme to the original Halloween is not in a plain old for for your time it's in five four time it's an odd kind of time's signature was what drew you to that\nMy father taught me five four time uh when I was Thirteen he tried it on the I had a pair of bongos I got the Christmas we taught me five four on that and I thought it was unusual just straightforwardly unusual timing so\nAdapted that time's signature to the piano piece and we'll\nWe're speaking to John ... the director of dozens of horror classics including probably some of your favorites Halloween to thing Christine prince of darkness escape from New York\nAlso a musician and composer who wrote the soundtracks for many of his films including the sequel to Halloween which was released this month by the way since it is Halloween we were curious what are you wearing\nShorts your costume send us a tweet with a picture at one eight or tags vote one a show on Instagram to show off your holiday outfits what are you wearing what made you decide to pick your costume this year and also you can check out what our producers dressed as for Halloween yes there is a team costume", "show_name": "1A Plus", "year": "2018", "city": "Colorado Springs", "day": "31"}