{"month": "10", "state": "CO", "station": "KRCC", "content": "We'll talk about why they're fleeing and the concerted effort to stop them from coming north I'm tending to Vegas and that's next time on the take away from WNYC NPR ride public radio international\nHe can catch the take away this morning at eleven o'clock\nSolid buy fresh air at new\nGood morning I'm Abigail back then and this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs can't he see seeing the hunter Casey cs ... K W cc FM woodland park streaming at K. R. C. C. dot O. R. G.\nWill be warmer today temperatures mostly in the fifties and sixties there's a chance for precipitation in the high country and over the far eastern plains looks like we'll have warm dry weather for your friday and that continues through the weekend we have headline news coming up next followed by one eight it's nine o'clock\nIn the mid term election on November sixth so let's check you know the big races quickly at this rate everything could change by tomorrow\nFrom W. A. M. U. and NPR this is one egg [noise]\nNeither Joshua Johnson visiting New Hampshire public radio today on one age the mid term\nNext month's election for the answer a lot of big questions how much power does the Democratic blue wave really have are these midterms a referendum on President Trump's for Republicans who align with him benefits or suffer most governors right now a Republican what will the margin be after the election and how much more diverse will Congress become\nMore suffer most governors right now a Republican what will the margin be after the election and how much more diverse will Congress because [noise]\nPlenty to talk about and we love to hear from you too ... ... email us one a match W. A. M. U. dot org comments on our Facebook page or tweet us at one egg [noise]\n\nLive from NPR News in Washington encore of a Coleman in Afghanistan the police chief of Kandahar Province has been killed by his own bodyguards to provincial intelligence she was also killed in the local governor was wounded\nThe attack in Canada car came as they attended a meeting with senior U.S military officials the BBC's signature ... has more\nGeneral of the dog was chief of police in Kandahar Province and puffing opponents of the dawn of on according to local media reports he was killed in the shooting targeting a meeting at the governor's house in Kandahar city\nA number of other senior Afghan officials I said to be an injured the come onto the NATO forces in Afghanistan is believed to be in a meeting but his unharmed\nThat thought about had claimed responsibility for the attack comes amid escalating violence the head of today's elections\nThe BBC's ... the first of some three thousand Honduran migrants traveling north to pass through Guatemala and reached the Mexican border angering President Trump reemerged in report a lot of ... and U.S authorities are trying to discourage them from traveling farther\nThe leader of the migrants march former Honduran lawmaker ... this was arrested and what that might not as President Trump threatened to cut off us aid to any Central American country that didn't stop the march\nStill hundreds of migrants have made their way to the Mexican border the U.S ambassador to what the other side of yoga issued a statement in Spanish urging the migrants to return\nFrom their idol is does the needles new ...\nI said to us order has never been so protected or those who tried to enter legally will be arrested and deported he added he understood people flee to lack of opportunities and that the U.S is investing millions of dollars to change that for NPR News I'm ... and\nPresident Trump heads back to Montana today for another campaign rally it's his third visit to the states in July as Montana Public Radio's Eric Whitney reports Trump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nPresident will appear in Missoula a famously liberal enclave in his state\nTrump is supporting the Republican who was hoping to take a Senate seat away from Democrats\nThe president will appear in Missoula a famously liberal enclave in his state President Trump won by twenty points\nA counter rallies being held seven miles away while Republicans are popular in Montana democratic Senator Jon tester won't be easy to beat he's raised more than four times as much money as his Republican opponent Matt Rosendale\nRosendale TV ads feature clips of the president's earlier Montana campaign stops\nJon Tester is a vote for Chuck Schumer Nancy Pelosi\n[laughter] walk\nDown the nonpartisan cook Political Report recently shifted its forecasts of Montana's Senate race from leans democratic to toss up for NPR News I'm Eric Whitney in Missoula\nOn Wall street the Dow was down Ninety points the NASDAQ is down more than fifty five you're listening to NPR\nTurkish in Saudi Arabian investigators have completed their search of Saudi diplomatic properties in ...\nThey're looking for evidence into the disappearance of Saudi journalist Jamal ... Turkish investigators have said they've got evidence he was tortured and killed inside the Saudi consulate an allegation the south but he's strongly deny\nMeanwhile after briefing President Trump this morning secretary of state Mike Pompeo says the Saudis assured him during his visit this week they would thoroughly investigated ... disappearance\nThe agriculture department is giving its approval to a new type of caught and to be grown in the U. S. is edible seeds for people and animals NPR's Dan Charles says it will take some time before the cotton is widely available\nCotton plants produce a lot of seeds globally forty million tons of them each year they're rich in oil and protein but people and most animals can't eat them because they contain a toxin called gossip all scientists at Texas a and M. university have created a genetically modified cotton plant that doesn't make gossip all and it feeds\nPeople can eat this cotton seed meal so can chicken and fish the inventor say the seeds taste like chick peas the USDA now says farmers are free to grow the new cotton plants but it will be years before they're widely available and the FDA still has to give its approval before the seeds can be sold for use in food Dan Charles NPR News\nDeath toll from hurricane Michael has now increased to twenty nine people damage teams in Florida are still working to restore power to several\nNPR News the death toll from hurricane Michael has now increased to twenty nine people damage teams in Florida are still working to restore power to several counties cell phone service in some areas it's still out on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include progressive insurance with the name your prize tool offering a range of coverage and price options to choose from now bats progressive more at progressive dot com or one eight hundred progressive and the corporation for public broadcasting\nThis is the case for the Laurie Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish some task for her lawyers gift to the care cc legacy fun helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... the legacy fund can be found at our website K. R. C. C. dot O. R. G. [noise]\n\n\nThis is one day I'm Joshua Johnson visiting New Hampshire public radio in Concord and this is a part of the show where we try to put our conversation for the hour into some context to boil down what will be discussing into one big theme but frankly today\nWhat's the point we're just under three weeks away from the midterms and it feels sometimes like this election is about everything all the time all at once\nWhether the nation supports repudiate President Trump whether the me too movement has affected our politics the future of health care immigration policy our economy national security diversity is Brett Kavanaugh\nIt's an election about everything that makes us in America right now and in states like New Hampshire those national debates blend with local concerns to make for some pretty interesting politics so\nToday's show is about everything sorry to dumped so much in your lap but such is life will deal with pieces of those big issues this hour but maybe you can help us focus\nWhat's on your mind right now with the midterms email is one a at W. A. M. U. dot org comments on our Facebook page where you can watch our video stream courtesy of N. H. P. R. or tweet us at one egg\nJoining us from our home base in Washington is one summer so national politics reporter with the Associated Press one a welcome back to the program thanks for having me also with us\nJoining us from our home base in Washington is one summer so national politics reporter with the Associated Press one and we'll come back to the program thanks for having me also with us NPR lead political editor Domenico Montanaro to medical welcome hey there\nKatie Sanders is the managing editor for the nonprofit fact checking website politifact she joins us from the Poynter Institute a professional school for journalists in St Petersburg Florida Katie welcome to want to\nThank you for having me and here with me a New Hampshire public radio in Concord is Casey McDermott who covers politics and policy Casey thanks for making time for thanks for having me let's start with New Hampshire's congressional races the state has two districts but both of those races are pretty interesting right now give us a sense of who's running\nShort so at the congressional districts kind of split the state and half on one side we have the first district which covers kind of the eastern part of the state and not race we have a contest between Chris ... the Democrat and Eddie Edwards the Republican\nI'm both of them fairly young and I think fairly mild mannered you know people have described them as two of the really you know nice guys in their respective political parties very non controversial\nOr they disagree but often respectfully on a number of issues I'm On the other side of the state we had\nIncumbent democratic congresswoman any ... that says her third term in the house and I this election is largely being framed as kind of a referendum on whether or not she's been effective in that role she is being challenged by a first term Republican state legislator Steve Negron\nAnd some things that aren't so serious Hi Jamie Lee Curtis it might be the Audie Cornish listen to all things considered to hear the bigger picture every afternoon from NPR News [noise]\nAfternoons at three thirty on Ninety One point five gay or see see\nNow you can tune in to Ninety One point five K. R. C. C. without lifting a finger just down your smart speaker to name ...\n[noise] [laughter]\nNPR on Ninety One point five to your cc is supported locally by shoulder roast coffee bringing organic copy roasted with solar power from Pueblo to king supernatural grocers state wide answers sprout stores throughout the country so roasted at a low temperature to help create coffee to savor solar rose dot com\nSupport for NPR comes from the station and ...\nThe country solar roasted at a low temperature to help create coffee to savor solar rose dot com\nSupport for NPR comes from the station and from progressive insurance offering its home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more it progressive dot com\nAnd from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilience cities at rock sound dot org\nThis is one a I'm Joshua Johnson we're discussing the upcoming upcoming midterm elections with NPR's Dominican months and early eighties wanna sellers\nAnd Katie Sanders of politifact we'd love to hear from you if there's a particular race or an election that's coming up where you live in the midterms that you're watching very closely we'd love to know what's on your mind about that race or if you just have some questions about what's going on with the midterms overall\nNationally right now now is a good time to share those comments on our Facebook page where you can also watch video stream of today's program\nTweet us ... when a or email one a at\nW. A. M. U. dot for domestic I Wonder if we could pick up with that last question I asked Casey Kendra tweeted what I Would like to see is all of the Democrats and Republicans voted out of Congress they are so polarized we need to start over\nHow much do you get a sense that the pure polarization of today's politics is just changing the way voters approached this year's midterms I mean you know Nancy Pelosi's named still comes up quite a bit on the campaign trail she's a of an obvious kind of a hot button for many Republican voters but\nIt is that working in terms of making people show up or is it just turning people off\nYou know a lot of people might be in our frustrated with politics in the country but we're seeing the opposite effect of not keeping people home or or a voting for some third party coalition in fact it's people strapping on the T shirts and going as hard as they can\nI ... in their political corners I mean the fact is midterms are usually about activist they're usually about the hardest core a people within the party but in fact we're seeing the potential for a surge this year in turnout I spoke to Michael McDonald who's a professor at the University of Florida who's really\nOne of the preeminent turnout experts in the country maintains a turnout database he expect there to be a turnout of about forty\nOne of the preeminent turnout experts in the country maintains a turnout database he expects there to be a turnout of about forty five fifty percent of eligible voters this year that doesn't sound like a lot but it would be the highest level for mid term since the mid Nineteen sixties\nAnd that is really spurred on by all of this high interest we're seeing high turnout in primaries in in special elections\nAnd you know frankly using Democrats really fired up to vote against the president and we've seen that according to a Pew sixty percent of people say the president is a factor in their vote and that's higher than it's ever been\nA wonder wanna summers what your take is on that in terms of the the potential playbook for Democrats first of all let's just put a little context is focused on the house for example how many seats with the Democrats need to flip the house\nShirts that Democrats would need twenty three seats in order to have control of the house of representatives and right now most public pull in when we look across the landscape suggests that they're doing they're making good efforts and things are looking good for them right now one thing that I've noticed as I've been talking to\nFolks you work on the Democratic side of the aisle who are professional political folks is they're spending a lot of money to make sure that their voter turnout and particularly looking at the types of voters infrequent voters who say may show up in a presidential election year but are more likely to stay home\nAnd I'm an off year or a midterm year and there's a reason for that\nTypically when we look at the electorate that shows up for mid term elections it's typically older whiter and more Republican tell things that you see Democrats spending a lot of money and a lot of time on the ground trying to turn out younger voters those millennials voters of color or Latinos African Americans and Asians who are more likely to vote for Democrats are also more likely to stay home and ...\nIs there are certain benchmark Warner for what Democrats would consider for lack of a better word of blowouts like you use the goal just to get above ... percent plus one or is there a larger like a stretch goal but the Democratic party's aiming for\nWhat I'm hearing from most people including Ben ray Lujan congressmen who chairs the Democratic democratic congressional campaign committee is\nThey don't think this is going to be a blowout year they feel confident and their chances of taking back the house of turning the house blew but I don't think most people most members of Congress were involved in this would say that there's going to be a huge blue waves crashing over a pick up some ten seats or something like that\nThey're focusing on delivering that twenty three out turning the the House bill in the message I keep hearing from them as they want to do that as it a balance of power right now Republicans\nControl every branch of government and they want to restore\nThree at turning be the house bill and the message I keep hearing from them as they want to do that as a a balance of power right now Republicans control every branch of government and they want to restore balance of power to this administration\nYou know this idea of a blue way was the focus of an email from Marty who wrote I'm all about the blue wave but I'm afraid that between voter disenfranchisement lingering gerrymandering and possible foreign interference we're about to be punt again\nDominican let me ask you about some of the polling water some of the main trends in national polls right now in terms of how the Democrats and Republicans might do\nWell when we look at our NPR PBS NewsHour Marist pulling Democrats have had an advantage on what's known as the congressional ballad who would you prefer to be a two run Congress ... the Democrat and your district or the Republican the ... in your district\nYou know we've had an advantage for Democrats anywhere from seven to twelve points over from the summer until now\nOr other polling other public bowling a showing it to be double digits that's about the range that Democrats feel like they would be able to take the at least those twenty three seats in the house and I look at some other factors to just look at the landscape and the playing field and when I was gamed out or how many seats would be up for grabs this year\nI found that there are ... seats that were a competitive to potentially competitive\nDespite all the talk of cabinet or you know that confirmation battle in ... Republicans and it certainly did\nOnly six of those seats are democratic held seats Seventy four seats are of the potentially competitive to competitive landscape are held by Republicans no matter what you look at that and you know if the Democrats win half of those that's the house\n[noise] glad to hear from some of you with regards to your concerns about the midterms including about the nature of polling in general do medical I Love you to respond to this comment from a listener who left a note in our inbox\nI'm Alan from Ashville North Carolina and I'm frustrated with the elections with not having enough\nHoles in down ballot races even even U.S House but state house and stuff because if it's a close election I Want to vote Democrat\nAt least at the federal and state level but if it's a good weekend that I Want to vote a third party greener libertarian or write my own in for and you know with a razor close or not if it's a if it's true it if my vote might be the deciding vote and I needed all I Need some calls to ah to divide and\nIf a if it's true it if my vote might be the deciding vote and I need to do I need some polls through our to divide and it it actually changes my vote the oil change my vote\nAlan thanks for your comment Domingo\nThat cracks me up or if he wants to run for office he should run for office if he wants to a vote third party because that's his conscience than he should do so\nI get a pragmatic approach though and I think a lot of you know establishment Democrats would argue that they wish there were a lot more voters like him who voted in Wisconsin Michigan and Pennsylvania for the Democrat instead of voting for the third party candidate now when it comes to polls look\nThere is a huge problem in this country when it comes to a polling generally and then when you go and drill down into the state level or district level or state house level my goodness\nThe response rate that people are getting from polling is lower and lower and lower every year in other words you make a phone call does somebody wish to participate in that that just continues to decrease\nIt takes a lot of money to conduct a good pole and to get a sizable enough sample that the results are representative and it's really tough and I would just say go based on the issues and vote your conscience\nYeah quite a lot of you express real concern with the very nature of polling Peter wrote on our Facebook page\nPlease discuss the obsession the media NPR included has with a horse race method of election coverage is an irresponsible journalism to report on polls one such reporting could affect turnout or elections are not sporting events\nAnd Michael wrote on our Facebook page unit which still trust polls remember how that turned out in twenty sixteen\n[noise] yeah I mean I you know look I mean this is a this is a tried and true a criticism\nUm you know we can get into the science of polling and what not and I would disagree that were obsessed quote unquote with polling we do use it to pepper our coverage and to give us a sense of ah what the snap shots are within districts in fact\nEither this is my these flu is this is Jonathan from your water the dominant ... from the most at Seventeen\nAnd by the this is\nMy love these flu is this is Jonathan from your water the dominant ... from the most at\nSeven in the nighttime anyone ... he he\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado College offering an experiential education from cc classrooms studios in laboratories at the base of pikes peak to access\nTo the nearby mountains in urban centers Colorado College dot edu by Ninety One point five ... summit club members who have dedicated twelve hundred dollars or more in support of our award winning coverage of life in southern Colorado information about joining the summit club or kill your CBC dot or\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nAnd from the science themes foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at size Sims foundation dot org\nBack now to our conversation with one summers of the Associated Press Katie Sanders of politifact and NPR's their medical months and are all still time to get in some of your questions and thoughts about the mid term elections email us one a acts W. A. M. U. dot org\nTweet us at one eighty or comments on our Facebook page where you can also watch our video stream of our lovely environs here at New Hampshire public radio also you can go check out some more of their excellent coverage at an H. P. R. dot org including of some of the things that make New Hampshire unique\nThere's a story about a giant pumpkin boat race in golf town I didn't know pumpkins where that point but I Will after the show I went to check it out and H. P. R. dot org let's get to some of your comments about the midterms Laurie emailed I Am a lifelong Democrat and I can tell you what frustrates me and has for years\nThe complete inability of the Dems to get a message and stick to it I've gone to my local Democrat Party website and the front page does not say what they are for does not tell me what they care about one summer she's been following the Democrats in the run up\nTo the midterms how common is Laurie is complaint and how well are Democrats doing an answering it\nI think the largest pointing to is actually a really common and I think Democrats are trying to figure out how to fix that and number\nHow well are Democrats doing an answering it\nWell I think what Laurie is pointing to is actually really comment and I think Democrats are trying to figure out how it affects that number of the conversations I had I recently wrote an article that looks at how Democrats are trying to\nMake sure they have record mid term turnout and they said that when they're talking to voters that are sending out mailers are going and knocking the people's doors in these battleground states and districts are trying to make sure\nThat they're telling their voters that they have a message that they are running on rather than just having these conversations that are about just running against President Trump's\nBase um I was talking to some groups that did some field testing recently among Latino voters and they said ... and when they get this field testing\nAnd they were saying people were turned out they said if they got a ... a mailer from their local democratic candidate had President Trump's face on it they'd be super turned off right they throw that away they wouldn't even engage or see who the candidate was so I think they're really trying to tweak that match and you talk about what they can do for them what's at stake that that's\nThat's why you hear Democrats nationally talking about how this is the most important election of our lifetimes why you hear about healthcare message I think has Dominican noted being such a huge share of the advertising that you're seeing from pro democratic groups it's because they do realize that they need a message for their voters to coalesce around otherwise they're not going to turn out\nTo mimic or wonder if we can follow up on that theme was one more voice mail from a listener on the east coast here's what judge John left in our inbox\nShould John Ruth sure to New York so often on the shows people for the Republicans the Democrats or Republicans for Democrats or Republicans would\nInstead of doing that they should be focusing on specific policies\nNamely the Democrats that stand for such a threat to the Republicans to stand for such and such it helps educate listeners because you don't gain anything by just going Democrats Republicans Democrats Republicans\nJohn thanks very much for calling and sharing your thoughts with us no medical for me I don't know how you hear this but for me as a journalist I feel uncomfortable saying the Democrats who stand for X. I feel more comfortable saying the Democrats who say they stand for ... or the Democrats who have done\n... to me journalistically that's more reliable but I Do take John's\nPoint that it just feels a little bit too\nBroad brush yeah I mean we have to always be aware of trying to get into some of the issues and where are the party stand on these things and what they've been pushing I think that that's been part of the post\nOf trying to get into some of the issues and where are the party stand on these things and what they've been pushing I think that that's been part of\nThe pushback and why you've seen so much interest from Democrats obviously in this election because they've seen so much of what\nPresident Obama did a and regulations that were put in place that have been rolled back for example a by the environmental protection agency a and a whole host of other things including an immigration policy that Democrats are firmly against\nAnd it's also what you saw a as a rise of the Tea Party in twenty ten where they didn't trust a lot of their government officials including a lot of Republicans and how they essentially took over the Republican Party with that message of uh taxed enough already and being really in opposition to\nA President Obama's health care act so the parties stand for a very very different things and we're seeing that play out and going to come to a head and in this in the mid term\nKatie I Wonder if you can respond to a listener who left a note on our website the one eight out or the listener writes with the upcoming midterm elections and Michelle Obama's advised to go high when opponents go low what is the effectiveness of negative campaigns are the negative campaign ads coming from a particular party or ...\nI think everyone's guilty and I don't think any party has a\nHas Israeli going going high all the time right and I think that's because it's affected and that really sticks with people as much as people like to say that they dislike negative advertising and I think actually do it is a memorable\nAnd it certainly a bill that impression that people are going to remember and that's why we see so much of it and that's why we have jobs here fact checkers [laughter] it's funny to do\nYou you will never be unemployed not ever\nTheir medical research on some of the diversity of the candidates this time around quite a few record numbers of women running a record numbers of el ... of out L G teach you candidates running some of whom spoke to Ari Shapiro on all things considered earlier\nGive us a sense of what that means for the midterms and whether many of these candidates are considered to stay on those strong chance of winning\nWell look you're correct that there are a lot of people um who are\nA ... of diverse backgrounds I mean women are the biggest bloc of this that are really driving the midterms you think a lot of Native American candidates or you know just a New Hampshire there Chris Pappas who is\nA an openly gay man or he would be the first gay representative from the state of New Hampshire if he wins in a new in the first congressional district there in New Hampshire\nThis who is a an openly gay man or he would be the first gay representative from the state of New Hampshire if he wins in a new in the first congressional district there in New Hampshire the Democrat now\nBut when again we look at the power of the midterms women they have been fired up since the day President Trump\nWas elected moment talking about when and where I Am a democratic women there have been two hundred and thirty five women who have been nominated for ah for Congress for their party's nomination a hundred and eighty three of those a hundred and eighty three has been democratic women\nJust if you were to take the number of democratic women who are running ... that would be bigger than the record previously of all women combined who're nominees and that was a hundred and sixty seven\nSo I'm Sorry you just just to clarify the numbers are basically saying three out of four women in this in this go round or democratic woman who'd been nominated\nAbsolutely that's absolutely right and the the wave of democratic women the year of the woman quote unquote round to ah after Nineteen Ninety two after the Clarence Thomas Anita Hill hearings had been driven by democratic women and we've seen them be very fired up in poll after poll\nAnd you know they're going to lead the march to the polls for Democrats and if they win the house it's going to be largely because of women\nWanted there are some races where you know women are making a very historic a historic showing I mean the Arizona Senate races going on right now between ... and send them the Democrat and more with Sally the Republican you know Arizona is going to have\nA female senator in that seat I Wonder how much you see this as a bipartisan try and we heard the numbers from Dominican oh but do we get the sense\nThat both parties both major parties are trying to be part of this trend trying to embrace this trend\nSure so I think that the energy and when we talk about female candidates is certainly more on the side of Democrats than Republicans I think that's frustrated and number of Republican women I spoke to chew women who founded the group Republican women for progress recently and they told me that they were really concerned that their party doesn't have an apparatus to cultivate\nYoung promising Republican conservative went in\nFrom the local those local level seats all the way up so nothing that really reflects say what you see on the left on the Democratic side from emily's list a group that cultivate and backs\nA pro abortion rights when in female candidates so there there's some concern certainly among Republicans and my colleagues that he actually asked Senate majority leader Mitch McConnell about that the question came and its back and forth about the Senate Judiciary committee\nAnd the lack of Republican women on that\nLast Senate majority leader Mitch McConnell about that the question came in the back and forth about the Senate Judiciary committee\nAnd the lack of Republican women on that panel during the hearings around Dr ... Ford and ... now justice Brett Kavanaugh and he's on them early and why there were no women there and Mitch McConnell said you know that something he doesn't like at something he wants to see more up but I still haven't heard Republicans\nAnd the concerted effort to stop them from coming north I tend to Vegas and that's next time on the take away from WNYC NPR ride public radio international [noise]\nTake away today to Lebanon am on Ninety One point five to your cc southern Colorado's NPR station\nProgramming on Ninety One point five to your cc is supported\nBy into credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business trucking details it into dot com slash business checking federally insured by in the usa this was southern Colorado's NPR\nStation to your C. C. C. C. H. D. Colorado Springs ... cc law hunter tc of ... M. T. W. CCF them woodland park [noise]\n[noise] Hi this is Andy ... executive director of the cultural officer the pikes peak region with your peak radar minute featuring a couple of ... for the coming weeks [noise] the walls of the pikes peak center will reverberate with power chords tonight at seven thirty PM when American hard\nRockers Alison change make their Colorado Springs debut beginning tomorrow night and running through October twenty seven the phones community theater will present the postman always rings twice\nThis Saturday in celebration of arts month the Colorado photography learning group the downtown partnership and the cities of Colorado Springs and managers brings will host a free photo scavenger hunt along the creative poor participant should mute the mandatory center at two PM\nIf you have information about upcoming cultural activities or events that you'd like to share with the community and next week speak radar minute please visit K. R. C. C. dot org for more information about the radar [noise]\nThe peak radar minute on Ninety One point five here he is made possible by the team and foundation [noise]\n\nFrom NPR News in Washington on Lakshmi sang\nTreasury secretary Steve Mnuchin has the latest major figure to pull out of Saudi Arabia is upcoming future investment initiative summit\nThat suspicion of foul play looms over the royal family fatty crown prince Mohammed bin Salman is widely suspected of ordering an attack of the Washington Post columnist Saturday dissident journalist ... his family and friends here he is dead the crown prince however denied any involvement\nSomeone who has announced via tweet that he will not attend the official line from Washington is that the administration still reserve judgment until all the facts are in just back from Saudi Arabia and turkey secretary of state Mike Pompeo was at the White House today telling President Trump that the south\nAll the facts are and just back from Saudi Arabia and turkey secretary of state Mike Pompeo was at the White House today telling President Trump that the Saudis need more time to investigate ... disappearance we have the latest on this from NPR's Michel ... secretary Pompeo says he got assurances from the Saudi that they will be thorough in their investigation\nTitled further from the morning but we ought to give him a few more days to come back so that we do a complete understanding of the fact that which we can make decisions about how the United states should respond to a surrounding this show\nUm pail isn't responding to news reports detailing how karaoke was tortured and killed at the Saudi consulate in Istanbul he says there are lots of stories about what happened but he's waiting for facts to unfold Michele ... NPR News Washington\nThe Taliban are claiming they were behind a deadly attack in southern Afghanistan that claimed the lives of three provincial officials including Kandahar as powerful police chief Jennifer glass report the Afghan guards carried out the attack\nConsumers equals respected and fears in Kandahar as police chief and the birthplace of the Taliban he was praised for bringing peace to the city but the Taliban and tried to kill him dozens of times and really can self was controversial human rights watch called him torture and chief for alleged illegal prisons and heavy handed tactics against those who opposed him\nThat Jennifer glass reporting powers returning to more communities in the Florida Panhandle devastated by hurricane Michael NPR's Hansi Lo Wang reports a few school districts are set to reopen for classes next week\nSchool districts are preparing for students to return early next weekend Holmes county in Franklin County which sits along Florida's northern coast the classes are still cancelled in most parts of Florida's panhandle ravaged by hurricane Michael\nIt's not clear windows schools will reopen for students some school buildings are sheltering hundreds of families across the region as a cleanup continues after the storm\nShe'd officials are now sending up at Base Camp in Tallahassee to provide long term housing for the utility workers and first responders working around the panhandle where more than a week after the hurricane many do not have electricity or cell phone service and you along NPR News Panama City Florida\nThe death toll from hurricane Michael is at least twenty nine from Florida to Virginia the Dow is down three hundred forty eight points this is NPR News\nIn the Pennsylvania legislature negotiations have crumbled on a high profile bill that would've made it easier for victims of child sex abuse\nIn the Pennsylvania legislature negotiations have crumbled on a high profile bill that would have made it easier for victims of child sex abuse to later sue abusers and enablers\nKatie my of member station W. I. T. F. reports the effort follows a landmark grand jury report that name more than three hundred Roman Catholic priests in this state accused of abusing children over the last several decades\nSticking point is a provision that would open a window for retroactive lawsuits in cases where the statute of limitations has already expired\nThe Pennsylvania house already passed a version of the bill that included one that is that Republicans worry it could bankrupt churches they floated a proposal that would also open it retroactive window that it wouldn't apply to institutions state representative mark ... an abuse survivor who led the effort says that's not acceptable\nYour senator does not support a two year window\nYou vote them out of office\nThere are no more scheduled session days before the election lawmakers could reconvene before then but it's unclear if that will happen for NPR News I'm Katie Meyer and Harrisburg\nFacebook is sporting a new election war room designed to shoot down fake accounts and fake news stories in the run up to them in terms\nOf social networking giants been tightening its measures to counter bogus accounts or pages and to protect user privacy after revelations that the data millions of users were inappropriately mind by outside parties for political purposes\nHowever many of its critics see the war room is more of a publicity stunt then a concrete solution on Lakshmi Singh NPR News\nSupport for NPR comes from NPR stations other contributors include a log Meehan makers have go to a meeting a collaborative meeting platform with over Eighteen million mostly users designed to connect people from anywhere in the world on any device learn more and go to meeting dot com\nMemberships or the largest source of funding it Ninety One point five care cc allowing us to bring you local stories NPR News music thanks for your generous support\nSupport for the Ninety One point five years he's the news room was provided in part\nBy Home Depot information available at home depot dot com\nLooking for something to do check out the community counter link or ... or gee\n[noise]\n\nThe calendar link at K. R. C. C. dot ORG [noise]\n\n\nThis is one day I'm Joshua Johnson visiting New Hampshire public radio in Concord right now there are a lot of jobs\nThis week the Labor Department reported more than seven million openings nationwide with just over six million people unemployed the rate of job openings is pretty high right now it's the fifth month in a row that there have been more available jobs than jobless people now high unemployment is obviously bad\nBut super low unemployment presents its own problem\nHow to recruit people into jobs that need filling what's it like being an employer right now are you able to hire the help you need maybe you're looking for work do you feel like you have a lot of choices if the job market is so competitive why aren't we seeing wages grow faster\nWe'd love to hear from you email us one at a at\nW. A. M. U. dot org comments on our Facebook page where you can also watch a video stream or tweet us at one eh\nLet's begin with a view from here in New Hampshire joining us in Studio at New Hampshire public radio is Dan give you a welder who's been living and working here in the Granite State for more than Twenty years he's the owner of ... construction services Dan welcome to want to\nSay also with us is ... the president of applied economic research and economic and real estate consultancy based here in New Hampshire Russ thanks for being here going to be here thank you then let me start with you you're a welder you run your own business give us a sense of what you deal with on a regular basis just trying to find enough people to get your workload done\nBut it's hard I'm One of the biggest reasons as hard as ... there's just no qualified welders out there any more of a lot of aged out in in in ... the education system really hasn't put enough\nA time into his own vacation trades anymore\nGive me a sense of what you got to do so you've got a job and you don't have quite enough people what kind of hoops do you have to jump through to try to find people are you like making phone calls all day or knocking on doors are like what's your day look like\nUsually the first thing they do is I go to my existing employees and said do you have anybody that you know of that may be looking for work um and sometimes that works out and sometimes it doesn't\nHave anybody that you know of that may be looking for work um and sometimes that works out and sometimes it doesn't so then you know you have to\nYou know put the word out there that you're hiring and you're hiring basically in practice and you're going to be teaching on the job [noise] really slows down the progress that that you can make and uh\nNPR on Ninety One point five kill your cc is supported locally by absolute bikes insulator a full service bike shop committed to serving locals and visitors with sales servicemen rentals the writing season runs laid on the lighter trails current drill conditions or online at absolute bikes dot com\nBy the cultural office of the pikes peak region inviting listeners celebrate arts month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nBy bourbon brothers smoke house in ... north gate and bass pro Dr Colorado own southern gourmet cuisine and barbecue hosting private parties and offering catering packages for events more at bourbon brothers dot com\nSupport for NPR comes from the station and from ... am committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day and nine hundred franchise locations math Newseum dot com slash NPR\nFrom logged me in makers have go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it goes to meeting dot com\nAnd from the listeners to support this NPR station\nThis is one a I'm Joshua Johnson we're discussing the job market and the difficulties in getting America's job openings filled with regional economist Russ T. Bo of applied economic research here in New Hampshire we love to hear from you to share what you know about finding a job in today's economy comments on our Facebook page where you can watch our video stream courtesy of New Hampshire public radio\nTweet us at one essay or email one a at W. A. M. U. dot org before we keep going and introduce our next guests I just want to kind of add a U.S any men too what\nOr email one at a at W. A. M. U. dot org before we keep going and introduce our next guests I just want to kind of add a yes any men to within deal you just said there is no shame and getting a career that doesn't require a college degree\nNot and we did a show last year called how to earn six figures without a four year degree about how to get into some of these skilled trades\nThat requires some training or an apprenticeship but that don't require a four year bachelor's degree one of our guests are Nicholas when Louis Wyman who was the c._e._o. of the Institute\nFor workplace skills and innovation wrote a book called the job you\nAnd he put a question to answer on our website about what an apprenticeship is how does an apprenticeship work\nWhen should you consider taking one where do you go to find one you'll find all this information on our site a program called how to earn six figures without a four year degree on line at the one at a dot for that's the word ... the number one the letter a dot org\nBefore we bring in our next two guests Russ one more thing about the job market here you mentioned\nThat New Hampshire has an aging population affordable housing is a challenge New Hampshire is one of many states has been hit hard by the opioid epidemic how does all of this show up in in the job market is adjust and aging job market or or does it manifest in other ways and that well I think\nThe main thing that is that we see right now it's sort of they're lagging wage growth in the state than it is kind of a deterrent to bringing more people into the labor force attracting more people to the state our wage growth has been around two two and a half percent a year as sort of lagging this prosperous economy that we hear so much about\nI think one of the quips that I recall a woman said yeah we have a great job market in New Hampshire I should know I have three jobs and I need three jobs go yet by\nSo I think that that's a that's sort of the main stumbling block right now we're beginning to see a little bit of labor force growth as I said we've added sixty five thousand jobs in this state since the down turn\nKind of reverse course and started becoming an improvement but we've only added Seventeen thousand workers\nSo that they are in lies the crunch\nTo get to some more of your comments about what you're experiencing where you live with work especially in skilled trades\nSean emailed I work in the steel mill and union and management have been complaining about the lack of quality candidates were even taking mc Donald's employees if they will come in a big issue is drug testing half our potential potential candidates don't come in for an interview\nDonald's employees if they will come in a big issue is drug testing half our potential potential candidates don't come in for an interview after hearing that we randomly drug test\nJulian tweeted like is really in jobs are no consequences if they don't pay a living wage all the jobs I see what ... my education and pay a third of what his manageable\nBut try to zoom out a little bit more and talk about what's happening not only here in New Hampshire but also nationwide joining us from our home base in Washington is Ryan none policy director of the Hamilton Project and a fellow in economic studies at the Brookings Institution Ryan welcome to want to thank you for having me on\nAlso here with this is Christine car the executive director for the New Hampshire career and technical educators association Christine welcome thank you Brian can you give us the big national snapshot of what's happening across the country right now in terms of the labor market we know what the national picture is\nWe've talked about New Hampshire are most states doing OK really struggling what does it look like on a more granular level\nSure what I think that it's important to start from a long term perspective to understand where we are now ah and I think it can be summarized with the idea that the labor market is not always linking workers with economic opportunity I start by saying that productivity growth overall has been unusually low since the mid to thousands\nWage growth has also been quite weak\nAh and then there's also a tremendous variation in wage levels across the country it's not always easy for workers to access jobs in those high wage places\nAre at the Hamilton Project we've released a paper recently that describes how over the last forty years geographic mobility has plummeted in those geographic imbalances those wage differences I just mentioned have tended to persist over time and the struggling areas in this country are not generally catching up with the prosperous places\nWe asked members of our one a tax club for their input one person wrote it wrote us at age Seventy one I was shocked to be hired I Am a retired attorney working as a state employee Ryan do we officially qualify now as being in a a labor shortage capital L capital as labor shortage\nI actually have a different perspective on this or that and there's an example I liked that kind of illustrates my thinking about labor shortages or if you go into a store and you offered to pay less than the posted price for something and the store refuses to do that or we don't say there's a shortage\nAnd I think the same logic applies to the labor market fit in recent years we just aren't seeing broad signs of extreme labor scarcity in the national data uh\nAnd I think the same logic applies to the labor market fit in recent years we just aren't seeing broad signs of extreme labor scarcity in the national data that scarcity should produce rapidly rising wages as employers compete for workers\nAnd we just haven't observe that you know overall ... after we adjust for inflation remains very weak\nAnd there's little evidence of earnings and brought industry groups out pacing other industries by big margins are for example a wage growth in construction and manufacturing is not so different than for the overall economy\nAnd I'd also say that wages are growing at roughly similar rates across regions throwing a bit faster in New England and the Pacific states but\nAh but not tremendous gaps and and then I'll just end by saying that that's all to say that they were not seeing this at the broad national level but there could certainly be particular occupations in particular places that are characterized by labor scarcity and that have seen some pretty rapid wage growth I just don't think that's probably true of us labor market\nWe heard from quite a lot of you about just the nature of wages as an impediment to filling these jobs Ronald posted on our Facebook page as someone who works for many years in construction mostly trim carpentry I can see wages in the field aren't enough to attract and keep people willing to do the work\nWhich show emailed it's wages not supply\nAnd Christine car and wonder if you might respond to this tweet from a friend who wrote New Hampshire eliminated the state minimum wage a few years ago so even though all surrounding states have raised there's we're at the national minimum wage thousands traveled to Massachusetts daily where the pay is much better\nChristine in terms of what you were dealing with trying to get jobs matched up with workers how much does the state's minimum wage factor into structurally\n[noise] well I I don't have any empirical data why so many uh employees are working in national traveling there that I Know when I Lived there that played over at a caters everyday into the city and in many of those they coming from New Hampshire\nSo you know wages is one aspect of it but they're Fisher is an actual shortage of people and my feeling is we've got to really just focus on how they can get the people that we as into the jobs that are out there\nWhat do you see is the Roosevelt shortage Christine was there a point at which you begin to notice more viscerally that the job market and the labor pool were significantly mismatched\nThat you know\nThat the job market and the labor pool were significantly mismatched\nThat\nYou know I feel like you know my point of view is sort of a wider industry perspective in in the sense that at work in technology for the last ten years and coming to New Hampshire and looking at each other a hike in the end um occupation such as I did notice construction\nAnd manufacturing there just seems to be shortages across every single single sector whether it's factoring or in high tech\nLet's get to a few more of your comments particularly about the nature of what we've described as an aging workforce Christian in Wisconsin emailed\nTo all the companies out there whining that they can't hire enough people stop discriminating against older workers and older is in quotes we're not old and we have so much experience plus we don't always want a huge salary\nWe'll talk about why they're fleeing and the concerted effort to stop them from coming north I tend to Vegas and that's next time on the take away from WNYC NPR rye public radio international [noise]\nTypical way today to Lebanon am on Ninety One point five to your cc southern Colorado's NPR station\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile apps free at Google Play and in the eye tunes asked or\nProgramming on Ninety One point five K. R. C. C. is supported by into credit union and business banking is committed to comprehensive solutions to help solve small business challenges including business checking details it into dot com slash business checking federally insured by in the U.S\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one an a\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics Sendai O T solutions learned more it\nFrom the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics ... solutions learn more it see three I O T dot AI\nAnd from the William T grant foundation at W T grant foundation dot org\nBack now to our conversation was ... and Ryan ... let me get to a few more of your comments before we bring in our next guest particularly with regards to training skilled workers\nChris writes as a current plant manager of a manufacturing facility and for manufacturing HR director slashed production manager for over Fifteen Years in both metal and plastics I Am calling BS\nManufacturing in the U.S has completely abdicated any responsibility for training new employees since the eighties they want experienced people at relatively low wages right off the street\nIf you want lower wages to remain competitive you must develop an inhouse training program that brings lower wage entry level employees up to speed over time\nWe also heard from some of you in some pockets where employers are increasing wages here's one listener who left a voicemail in our inbox\nThis is bill I live in North Carolina and I work in the logistics and warehouse and supply chain industry and we've had a a pretty good expansion of our business over the last six months and we're really struggling with two items one is employed turnover wherever there are chasing higher wages and and new facilities and new employers and secondly\nTo hire the right people are as a result of that we've had to probably increase our incoming salaries the hourly salary is probably anywhere between ten and Fifteen or twenty percent\nFrom what we did last year so we're struggling with both turnover and securing the right employees so having unemployment down as low as two to two and a half percent has definitely impacting logistics and warehousing\nIt's easy to see how Bill thanks very much for sharing your story with us\nAnother one of our listeners tweeted I hold a four year degree strangely enough in journalism but transitioned into a trade job shortly following college because the pay was three times what a starting job in my field would be I Know makes six figures yearly and work in the rural community I grew up in\nI Will withhold my thoughts on your ... your journalism degree good for you glad you found something that works for you but\nThis listener has an interesting point because to stem their brain drain some cities and counties and states are offering to pay workers to move there there's a city in Nebraska that'll match signing\nPoint because to stem their brain drain some cities and counties and states are offering to pay workers to move there there's a city in Nebraska that'll match signing bonuses for newcomers to the tune of five thousand dollars Vermont passed a law to pay people ten thousand dollars to move to Vermont and work remotely\nAnd accounting northeast of Detroit is offering to take a chunk out of your student debt\nThat plan was the idea of Randy ... the president and CEO of the community foundation of St Clair county and he joins us now to discuss it Randy welcome to winning thanks Joshua so this is called the come home award ... tell us what to come home award is how does that work\nYou had to come home award program that we launch in ... and early twenties sixteen is really turning traditional scholarship business models on their head um there are too many flaws and traditional scholarship to talk about and doing that but at its core what we're doing is changing the scholarship business model\nAnd instead of investing heavily in Seventeen or Eighteen year old who may or may not complete college or maybe not be right for college we flip it around and we said we will pay you significantly a pot of completion of some kind of degree but only if you return to our region to live in a war and it's really our home home reward paying off of that\nSo this is for people who are who are from saint Clair counting to come back home to St Clair counting\nYeah we have a very strong preference for those with family ties I mean to to help protect our investments we want people to know what it's like to live in a small town America or we want to keep them here and so we feel that if they have some family connection here that there's probably a better bet they'll stay\nTell me about St Clair county pay me a picture of what's it like\nSort of small town America or its waterfront community along the shores of Lake Huron on the St Clair river um our largest out of court here on as a population of about thirty thousand people\nWe do not have a four year University in our region we did a fortune five hundred company in our region a thirty percent of our workforce leaves our county and headed out AT Metro Detroit to to be employed but they love the small town life or the family friendly environment and amenities a small town America Josh\nI was just going to ask you about Detroit you're about an hour outside of Detroit is that right\nYeah and you were talking about something earlier jobs I Want to mention you know Detroit has become a talent magnet which is great for Detroit um but the health of American out that Michigan I think is better judged on the economic held the region\nWhich is great for Detroit um but the health of America and the health of Michigan I think is better judged on the economic health of regions like port Huron are Marquette or Muskegon, Michigan right it gives you a better barometer of what is our our true health\nHow did the recession do to do in St Clair county where people keep their pretty hard\nYeah I Would say it hit here earlier than than hit the country and much more severely um the ironic part that we tell people and that's really one of the things that led to this come on program was once we really hit rock bottom our stakeholders whether it was the Lancet be government business\nAny other sector we realized that we all had to get together and play a piece in economic growth and prosperity we all had something to bring to the table but more importantly we we reached a point where we stopped waiting for someone from Washington or for someone from Lansing to come in and save us with a plan\nIt had to be an organic planned that drove our prosperity\nWe're speaking to Randy Myers the president and CEO of the community foundation of St Clair county in St Clair accounting Michigan\nAlso still speaking to us T. Bo the president of applied economic research and Ryan non policy director of the Hamilton Project and a fellow in economic studies\nAt the Brookings Institution still time to get in some more of your questions and thoughts\nAbout the labor shortage won a at W. A. M. U. dot org tweet us ... when a or comments on our Facebook page where you can watch our video streams so Randy telling me how\nThe come home award work suppose I'm from saint Clair county and I moved to Chicago for work and now I'm considering coming back and how does that work\nChicago's a great example Chicago Austin's south um as long as you do not have primary residence here so let let's say your parents still live in this region maybe completed college six years ago\nAnd you're still living in Chicago but you met someone you met a party the medicine they've got other you're you're weighing the option of staying in Chicago which is a great place to live or you want to come back home settled down started family spend more time doing what you want to do as long as you don't already live back in our region\nOr you're eligible for Fifteen thousand dollar award if you're selected we give the recipients a hundred and twenty days to establish a permanent residency or they have to find a job that they don't already have won several already have jobs lined up\nAnd then we stretch those payments out over two or three years as a carrot to keep you here\nAnd it's really a simple back in scholarship\nAnd then we stretch those payments out over two or three years as a carrot to keep you here and it's really a simple back in scholarship would pay the loan holder directly which in every case for us has been the federal government\nSo I Do so you you pay it out a little bit overtime so by over time by the time to two years or up Sinclair county voted this program to come home award will have put in\nFifteen thousand dollars towards one's dead I'm guessing it's like would that be three thousand seven hundred fifty dollars like every six months or so and it adds up to Fifteen thousand over time\nThat's exactly it Joshua and the goal you know I'm is to really give young people actually can be in their twenties or thirties or forties I'm the chance to go two or three years without making debt\nNationally I Know you see data that says the average college student has thirty thousand dollars in debt I don't know where they're getting that data Josh because out of the fifty plus applications we've received our average at an eighty thousand dollars\n[laughter] that that's a crippling amount of debt preventing people from living the American dream\nI can relate to that I'd finally paid off my private student loans I had to settle them it was\nCaught it was it was the most awful form of financial slavery I can possibly imagine and definitely like that's a whole other our where I Will I Will rebel you with my tearful story of dealing with Sally Mae before I I Know rush people wants to jump in but before he does Randy I just want to\nAsk you about some of the perception issues that we discussed with regards to New Hampshire\nThere's this there there is evidence that young people are moving to bigger cities in in large numbers you've talked a lot about this feels kind of small town America New Hampshire specifically conquered for sure definitely feels like small town America", "year": "2018", "show_name": "1A Plus", "city": "Colorado Springs", "day": "18"}