{"month": "10", "state": "CO", "station": "KRCC", "content": "That there was no corroborating evidence against him that many of the charges were nonsense and he told senators this is one of the most consequential votes you've ever had and it's a vote that went for capital this is special coverage from NPR News\nListening to southern Colorado with NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI seeing the hunter\nCasey the answers stark fell and gay WC see eh than woodland park streaming at K. R. C. C. dot O. R. G. good morning I'm Abigail Batman is nine o'clock and our live coverage of dust procedural vote in the Senate this morning we'll continue for about another hour\nAnd it's a vote that went for Kavanaugh this is special coverage from NPR News\nYou're listening to southern Colorado with NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI seeing the hunter\nCasey the as stark fell and gay W cc ed than woodland park\nStreaming at K. R. C. C. dot O. R. G. good morning I'm Abigail Batman is nine o'clock\nAnd our live coverage of dust procedural vote in the Senate this morning we'll continue for about another hour the final vote tally from today's vote was fifty one to forty nine ending the debate on the nomination of Brett Kavanaugh\nThe process will advance to a final vote which is expected over the weekend details still to come this hour should be warm today hide in the seventies and eighties for the lower elevations sixties in the mountains the cold front is expected to come through this evening leading to a cloudy\nDamp weekend you're listening to southern Colorado NPR station Ninety One point five K. R. C. C.\n\nYeah the U.S Senate and the nomination to the Supreme Court of President Trump's choice Brett Kavanaugh it was an extremely close vote and a West Virginia senator who was the presiding officer today Republicans ah choose choose the presiding officer and was Shelley Moore capital of West Virginia let's give a listen\nOn this vote the yeas are fifty one the nose are forty nine the motion is agreed to\nFifty one to forty nine as the gavel goes down almost as close as it could be if it had been a fifty fifty tie presume that vice president Mike Pence would have come in\nAnd broken that time fifty one to forty nine almost entirely along partisan lines the one Democrat who voted for Kavanaugh is Joe Manchin of West Virginia the one Republican who voted against Kavanaugh is Lisa Murkowski of Alaska and we should emphasize before we begin our discussion here\nThis is what's called a cloture vote this is not the final vote this was a vote to end the debate the kind of test\nBut not an absolute test because senators could choose to vote differently if they feel moved to do so when the final vote comes tomorrow\nNPR's Nina Totenberg has covered the United States Supreme court about as long as well as anyone and she is in our studios here along with NPR's Ron Elving is covered\nHaving all is Joe Manchin of West Virginia the one Republican who voted against Kavanaugh is Lisa Murkowski of Alaska and we should emphasize before we begin our discussion here this is what's called a cloture vote this was not the final vote this was a vote to end the debate I kind of test\nBut not an absolute test because senators could choose to vote differently if they feel moved to do so when the final vote comes tomorrow\nNPR's Nina Totenberg has covered the United States Supreme court about as long\nAs well as anyone and she is in our studios here along with NPR's Ron Elving who's covered politics for very long time as well good morning to get both in mourning mourning thanks for joining us throughout the morning here and a new you know I Want to start with you let's just back away from the drama the last couple of weeks and talk about the\nHistoric consequences of this choice presuming that Kavanaugh gets through as he got through the vote today how has the U.S Supreme Court to different court than it would have been a with a different nominee or than it was before he came\n[noise] well I was going to be a much more conservative court regardless whoever Donald Trump picked from his famous list it was going to be someone way more conservative than Anthony Kennedy the man\nThat is being replaced and that will\nKill to court that was sort of like a balanced bored sometimes mainly going in the conservative direction but about a quarter of the time and some of those very big cases going the other way\nTo the liberal side now in almost every case that is a closely contested one where the voters five to four I think you can expect the conservatives to win and they may\nMove on an agenda to increase executive power to decrease actually congressional power in some ways to and to um\nTo take on\nLegal questions that have only been sort of on the wish list of hardcore conservatives for fifty to a hundred years\nYou know it's interesting you use the word agenda I think that if some conservatives ah we're listening to you they might object to the word agenda and argue the conservative judges or just applying the law as they see it but it is an agenda in the sense that it's a very different way of viewing and reading the law correct this would be don't\nEven this term which is so far pretty doggy term frankly with not very compelling big hot sexy cases even this term so far with a half the docket agreed to and the rest yet to come there are three cases asking\nIt was four fifty to a hundred years\nNow it's interesting you use the word agenda I think that if some conservatives ah we're listening to you they might object to the word agenda and argue that conservative judges or just applying the law as they see it but it is an agenda in the sense that it's a very different way of viewing and reading the law correct this would be don't even this\nTerm which is so far pretty doggy term frankly with not very compelling big hot sexy cases even this term so far with a half the docket agreed to and the rest yet to come\nThere are three cases asking for reversal of very longstanding presidents so you could see a lot of the law changed quite dramatically and some of it would not make headlines you would only\nSee it when you went to do something and found you could no longer do that whether you're on the right or the left you could be blocked or you could be suddenly find as people are now finding for example that the court in recent years has on the question if arbitration\nSaid to people you can't bring a class action challenging a clause in ... and when you were hired that says any dispute over salary or anything else has to go to arbitration you can't bring a class action suit in court challenge that ...\nThat example because it reminds us that while Kavanaugh's nomination has been viewed through the lens of roe versus Wade of abortion rights there is an almost infinite variety cases\nIn which presuming he is confirmed on the final vote tomorrow he would have an opportunity to rule and they would include abortion rights and a lot of things short of overturning roe versus Wade and they would include labor rights and\nAnd and many other things let's also remember that there was a relatively true statements made by Charles Schumer the Democrat from New York when he gave his speech shortly before the vote\nAnd he said Democrats have been accused of delaying the nomination Democrats have not he said and what he means is\nRepublicans have had the majority Republicans reset the Supreme Court rules so that hey so that a minority cannot block a action and so if there's been any delay it's been been because of division and the Republican ranks there'd been a number of Republicans who have been uncertain votes\nOne of them Lisa Murkowski who ultimately voted no on this test vote here this morning Lisa Murkowski of Alaska\nAnother one being Susan Collins of Maine who issued in a sense a partial decision and let's listen to the words that you spoke to reporters a little bit earlier today we're not going to hear Susan ...\nLook into that the majority Republicans reset the Supreme Court rules so that a so that a minority cannot block\nA action and so if there's been any delay it's been been because of division and the Republican ranks there'd been a number of Republicans who have been uncertain votes one of them Lisa Murkowski who ultimately voted no on this test vote here this morning Lisa Murkowski of Alaska another one being Susan Collins of Maine who\nIssued in a sense a partial decision and let's listen to the words that she spoke to reporters a little bit earlier today we're not going to hear Susan Collins of Maine but what you said out to rip out to a scrum of reporters a group of reporters out on the floor\nIs that I'm voting yes voting yes on cloture however uh I Am not going to announce until a little bit later on today what I'm going to do a later what I'm going to do in that second vote which is the way it works ride Ron opening\nIt is but it let's let's be Frank it it's pretty rare for people to vote for cloture and then turn around and vote and why ... why would you do that\nWell that the justification that people put forward as they say I Believe in fairness to both sides we should have some more floor debate and we should hear all the arguments as though we haven't and\nAt the end of that we should be fair enough to this candidate to give him a final vote on the floor now I plan to vote no but I think he should have that final vote on the floor\nShe has not said that let's be fair she did and I say that and and I think there'd be an awful lot of folks who'd be very surprised if tomorrow she votes no but she has that option she may I don't think she's actually\nWell who knows whether or not she's enjoying the amount of pressure that she does not seem to be having a good time but there was a time when the rules were different when that sort of thing would happen you'd get sixty votes for cloture and then maybe only fifty two votes to pass something if you had a principal and the principal was I don't believe we should block this person from getting a final vote\nAnd win the majority clearly favors this person I don't favor the person but I also don't favor cutting off their chance to have a final vote with a filibuster\nOkay so we've talked about Republicans who have been doubtful Lisa Murkowski of Alaska who was a no vote at least on cloture Susan Collins of Maine who was a yes vote on cloture but it's held out at least for a number of hours today her decision on the final vote\nAnd then there is a Republican who was never expressed any doubt about the nomination and let's listen to a little bit of today's speech on the Senate floor from Senate majority leader Mitch McConnell\nEvery effort was made to ensure that the fat free verdict of the most\nAnd I don't favor the person but I also don't favor cutting off their chance to have a final vote with a filibuster okay so we've talked about Republicans who have been doubtful Lisa Murkowski of Alaska who was a no vote at least on cloture\nSusan Collins of Maine who is a yes vote on cloture but it's held out at least for a number of hours today her decision on the final vote and then there is a Republican who was never expressed any doubt about the nomination and let's listen to a little bit of today's speech on the Senate floor from Senate majority leader Mitch McConnell\nEvery effort was made to ensure that the factory verdict of\nThe mob and the media would win out over the actual evidence\nMade sure the mob prevail\nBut they are uncorroborated mud and the partisan noise and the physical intimidation of members here in the Senate will not have the final say\nAround here\nThe Senate will have the final so\nThe Senate is not quite have the final say but they got a step closer today with this fifty one to forty nine vote\nThat we have been covering and then we will continue covering here in special coverage from NPR News let's bring another voice into the conversation now more lately is executive director of the Georgetown Institute of politics and public service a veteran democratic strategist did I pronounce your name correctly ...\nYou got an excellent I'm very excited thank you very much so what are you thinking about as you learned this news of the fifty one forty nine vote to advance Kevin\n[noise] well you know it's all going to come down I think the person to watch uh as you guys have been talking about a ... there's actually two people I'm kinda curious to watch over the next twenty four hours a and they are the um [noise] uh she was in college a while we'll see what she has to say at three o'clock mhm but uh you know\nShe might be actually trying to uh go back to sort of regular order in the Senate and saying you know he deserves a vote I'm going to vote no but he does or about that could be possible I think that's likely about possible and the other person is Joe mansion who\n... what we think will be just as a cabin on\nBill ... thanks for taking the time I really appreciate yes great to be with you she's with\nThe Judicial Crisis network ... special coverage from NPR News\nNineteen Minutes after nine o'clock good morning I'm Abigail back then things for tuning into Ninety One point five ... southern Colorado who's NPR's station this morning it is friday October that\nLooks like high today will be in the seventies and eighties for the lower elevations sixties for the mountains a cold front come through this evening bringing some cool temperatures for the weekend cloudy\nAppreciate it yeah it's great to be like the issues with the Judicial Crisis network this is special coverage from NPR News\nIt is Nineteen Minutes after nine o'clock good morning I'm Abigail back then things for tuning in Ninety One point five K. R. C. C. southern Colorado's NPR station this morning it is friday October fest\nLooks like highs today will be in the seventies and eighties for the lower elevations sixteen for the mountains a cold front come through this evening bringing some cold temperatures for the weekend cloudy and damp for your Saturday and Sunday\nAnd we are now joining us back to our regular programming won a with Joshua Johnson\nWill continue until eleven o'clock when we will bring you the take away it is nine Nineteen\nNinety One point five kill your cc is supported by the Colorado Springs fine arts center at Colorado College present in Shakespeare in love the comedic Rob filled with adventure Elizabethan England September twenty seventh through October twenty first tickets at Colorado College dot edu slash FCC\nSupport for NPR comes from the station and from bona with the bonus certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her and more information or at bona dot com\nAnd from ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nThis is one a I'm Joshua Johnson unemployment is at its lowest rate in about fifty years\nThe latest report from the Labor Department out today shows the economy added a hundred and thirty four thousand jobs in September that's lower than some expectations according to marketwatch but experts agree that the labor market is strong and there are no signs of a slow down this quarter unemployment is at three point seven percent\nThat's the lowest rate since Nineteen sixty nine\nBack down to the friday news roundup with Steve Clemons Washington editor at large for the Atlantic Susan Glasser staff writer for the New Yorker and the global affairs analyst for CNN and Washington Post political reporter Eugene Scott we love to hear from you too about this week's biggest stories from across the country\nComments on our Facebook page where you can watch our video stream tweet us at one a or email one a\nAnd there are no signs of a slow down this quarter unemployment is at three point seven percent that's the lowest rate since Nineteen sixty nine\nBack down to the friday news roundup with Steve Clemons Washington editor at large for the Atlantic Susan Glasser staff writer for the New Yorker and the global affairs analyst for CNN and Washington Post political reporter Eugene Scott we'd love to hear from you too about this week's biggest stories from across the country\nComments on our Facebook page where you can watch our video stream tweet us at one a or email one a at W. A. M. U. dot org\nWorth noting that the president is awake and tweeting today his latest tweet about the Kavanaugh process and the protest against it reads quote\nThe very rude elevators screamer are paid professionals only looking to make senators look bad don't fall for it also look at all of the professionally made identical signs paid for by Soros and others these are not signs made in the basement from love\nHash tag troublemakers\nThe president's been pretty vocal about this whole process in the last few days has been for some time but it's been turning increasingly negative as the weeks going on on Tuesday the president held a rally in Minnesota and took the opportunity to mock Kavanaugh's accuser professor Christine Blasey Ford and question her account of about\nThirty years ago this shop and\nI had one beer [noise] right I Want to be [noise]\nWell do you think it was it was one of them are good\nHow did you get home I don't remember how did you get there I don't remember where is the place I don't remember how many years ago when I don't\nKnow [noise] I don't know [noise] what\nWas it and I don't know where's the house [noise] upstairs downstairs where was I don't know but I Wonder if that's the only thing I remember [noise]\n\nAnd a man's life is in tatters a man who lives in shattered his wife is shattered his daughters who are beautiful incredible\nYoung kids\nThey destroyed people they want to destroy people these are really evil people\nPart of what President Trump said to supporters at a rally in Minnesota on Tuesday Steve Clemons we should note first of all what the president said is on true professor Ford did not say that the only thing she remembered was having one beer ironically she said that thing she most remembered was being ...\nI met his wife is shattered his daughters are beautiful incredible\nYoung is\nDestroyed before they want to destroy these really evil people\nPart of what President Trump said to supporters at a rally in Minnesota on Tuesday Steve Clemons we should note first of all what the president said is on true professor Ford did not say that the only thing she remembered was having one beer ironically she said the thing she most remembered was being laughed at\nBy Brett Kavanaugh and his friend mark judge who was allegedly in the room when this happened so it was a little bit of irony with the crowd laughing at her over the president's account so we should clear that up but I Wonder more to the point whether or not the White House has addressed those remarks\nLook I'm I was on stage just on the other day with Kellyanne Conway are asking her about these are the president's temperament and uh\nAbout her own revelations about sexual assault that had happened in her life and why she chose a to share that and and she uh acknowledged that she didn't choose to share that it just came out\nThe president's behavior is something that makes many people around the president United States today extremely uncomfortable [noise]\nThey have at the beginning of this process we're trying to be respectful to say that a doctor Ford needed to be heard and listen to that there were important issues there and the president broke out of those constraints and we're sitting as I'm sure Susan Glasser and Eugene a\nWill will comment as well in a very extraordinary moment where many Americans and their experiences that have gone through many other sexual assault victims in the past have kept quiet and said this way even Susan Collins who's now probably\nIn in a position to vote 'em in in favor of a judge Kavanaugh has has said you know people do not talk about this these are the the most under reported incidents and I would like to add just to your genes comment about Kavanaugh's\nWall Street journal op ed that was written for one person that was written for not Donald Trump it was written for Senator Flake Senator Flake at the Atlantic idea at the Atlantic festival this this week\nSaid that we could not have the kind of temperament that Kavanaugh showed on the Supreme Court he says we cannot have that on the court we just cannot and he was referring specifically to cabinet going after senator after senator after Senate\nSaid you know people do not talk about this these are the the most under reported incidents and I like that just to Eugene ths comment about Kavanaugh's\nWall Street journal op ed that was written for one person that was written for not Donald Trump was written for Senator Flake Senator Flake at the Atlantic idea at the Atlantic festival this this week\nSaid that we could not have the kind of temperament that Kavanaugh showed on the Supreme Court he says we cannot have that on the court we just cannot and he was referring specifically to Kavanaugh going after senator after senator after senator after his very emotional opening statement\nAnd that was a message to give flake cover to also vote for Kavanaugh so we're sitting here where people are walking away\nFrom the allegations and uh the ... that many women and their partners and other supporting them feel about this being a shoved under the rug right while others are getting a I'm essentially\nFig leafs and passes to be able to vote for cabinet\nYeah he did have a lot of very sharp exchanges with senator Amy ... Patrick Leahy and and Dick Durbin and many of the Democrats who questioned him last Thursday few more questions and then we'll we'll keep going let me get to some of your comments as well Virginia and in Washington DC writes democratic obstructionism\nMerrick Garland\nAnd Susan in Gainesville, Florida asks what on earth is the rationale for only one copy of the report a forty five pages being provided for review by\nOne hundred senators Susan clearly a lot of things for voters to carry in they're not at all distant memories when they go to the polls in November go to the polls next month do we have any\nReal hard reliable sense is there any evidence of how much this may affect the mid term elections I mean a lot of what voters vote on in the midterms doesn't have to do with what happens in Washington so live it does a lot of it has to do with what happens at home we have a sense of what the balance is looking like right now\nWell look first of all it does depend in fact on how the and and uh there is an interesting argument to be made that if Kavanaugh is\nConfirmed a it's much more likely in a way to somewhat fate as an issue for Republican voters while\nA becoming an enormous rallying cry for Democrats and and conversely were he to go down\nA especially in such a spectacular fashion so close to the election there's already a sense of President Trump clearly feels is which is why he's been tending up his his voters over the last week on that he you know that we're having to go down that this would outrage\nIt does depend in fact on how this ends and uh there is an interesting argument to be made that if Kavanaugh is\nConfirmed a it's much more likely in a way to somewhat fate as an issue for Republican voters while\nA becoming an enormous rallying cry for Democrats and conversely were he to go down a especially in such a spectacular fashion so close to the election there's already a sense and President Trump clearly feels is which is why he's been ... up his his voters over the last week on that the you know that we're having to go down\nThat this would outrage uh and and enrage\nRepublican base voters in a way that could prove beneficial especially in some of these key Senate races in ... which is already taking place largely on a favorable to Republicans playing field this fault what's unusual about this\nDevice if we've had many divisive fights before a it strikes me that this is coming so close to a mid term election therefore injecting a volatile note of uncertainty with just weeks to go to the election number one number two a it is\nA cultural war being ignited arguably among Democrats and Republicans while\nBoth sides I I wrote last week about the two Americas that would listen to the very jarring lead different accounts offered by Dr Ford and Brett Kavanaugh and uh would process this hearing it in a completely different way I think we've all watched that playing out over the last week a each a\nPolitical tried in our increasingly tribally divided culture has a whole different facts at a whole different narrative a whole different argument to make its inflaming\nPassions on both sides are Republicans have made a lot over pools in recent days showing that\nA Republican voter enthusiasm which had been very low very turned off in this midterm election year has sparked upwards a over the last week you could argue well that's just the election getting closer and we're not sure how much it has to do with cabinet but but my guess is that you know for different parts of the country\nJust dance the news from around the world on the friday news round up next our on one [noise]\n\nSouthern Colorado's NPR's mission Ninety One point five to ... you can be with you wherever you go all you needed your smartphone download the free Ninety One point five to ... mobile out to go play or the tunes ap story\nMemberships or the largest source of funding in Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support NPR on Ninety One point five to ...\n[noise]\nSouthern Colorado's NPR station Ninety One point five to ... you can be with you wherever you go all you need is your smartphone download the free Ninety One point five ... mobile apps like Google Play or the tunes app store [noise]\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nNPR on Ninety One point five K. or cc is supported locally by planet granite for Twenty years remodeling kitchens bathrooms with colors from around the globe granite quartz site marble and more on display in the show room at thirty twenty north stone on line at planet granted taught us\nBy Ninety One point five K. or cc members who continue to fund the news music and other quality programming that Ninety One point five ... years cc brings to southern Colorado and beyond at ... dot org thank you\nSupport for NPR comes from the station and from Boehner with a bonus certified craftsmen program a network of hardwood flooring contractor is committed to expertise and the customer service contract to locate her and more information are Boehner dot com\nAnd from Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security healthcare and science and technology leadership brown dot edu slash NPR\nBack now to the friday news roundup with Susan Glasser Eugene Scott and Steve Clemons let's talk a little bit more about that New York times investigation regarding President Trump's finances are ... Eugene I think\nOne of the things that is worth knowing for sure was what Susan Glasser said regarding the uh the provenance of the information related to the investigation are there are other big questions that are still out there when it comes to the president's tax history we still don't have his tax returns provided by him for example\nI was gonna say that's the biggest question I mean the reality is this what's done over a I Believe Eighteen months what has happened since\nUh you know that piece was published or perhaps the research and that we still do not know are there more questions than answers because many of the answers could be provided if we actually had a the tax forms which Sarah Huckabee Sanders pretty much gave us reasons\nRelated to the investigation or there are other big questions that are still out there when it comes to the president's tax history we still don't have his tax returns provided by him for example\nI was gonna say that's the biggest question I mean the reality is this what's done over\nA I Believe Eighteen months what has happened since uh you know the peace with publisher perhaps the research and that we still do not know that they're more questions than answers because many of the answers could be providing if we actually had a the tax forms which\nSarah Huckabee Sanders pretty much gave us a reason to believe earlier this week we we perhaps should not expect\nUh the reality is that this is not an area that Trump I desire to be transparent about and many of his supporters don't demand that he has I think there are people who have noticed how much wealthier he hasn't gotten since getting in\nUm the White House and and regarding specific uh businesses if heads or some of the um hotels have been rented out by international organizations perhaps wanting to curry favor with the administration\nUm and I think there are some people who are concerned about how that could influence a policy foreign policy specific\n[noise] well it's been four years since the fatal shooting of black teenager look climbed McDonald by officer Jason Van Dyke in Chicago this week marks the end\nOf that closely watched trial has the jury deliberations we're keeping an eye on the verdict come will keep you updated on any developments on that before we continue with surround up a quick word\nAbout next week the black lives matter movement which they will climb McDonald cases definitely caught up in\nFocuses on police shootings of African Americans and one of the most prominent voices in that movement will join us next week de ray ...\nHis new memoir called on the other side of freedom appeals for police reform and remind supporters of black lives matter to keep fighting for awareness of this issue\nWe'd like to know what questions you have about the black lives matter movement today or questions for ... he tried to turn his activism into elected office when he ran for mayor of Baltimore in twenty six team that beat was unsuccessful but what does it say about whereas a movement is and where should go\nShare your questions for activists during the cast and you can leave us a voice mail eight five five to three six one a one a\nWhat do you want to know about the black lives matter movement\nEight five five to three six one a one a you can also use our new app won a vox pop where you can leave us a radio quality message\nOffice when he ran for mayor of Baltimore in twenty six team that beat was unsuccessful but what does it say about wears a movement is and where should go\nShare your questions for activists during the cast and you can leave us a voice mail eight five five to three six one a one a what do you want to know about the black lives matter movement\nEight five five to three six one a one a you can also use our new app won a vox pop where you can leave us a radio quality message or check in on future topics you'll find one vox pop V. O. X. P. O. P. in the app store and we will share our conversation with their aim to cast and coming up next week\nOn one a while to vote on the Senate floor has just happened were just double checking our numbers are out of what the vote total was again this is one of two votes that's involved in either getting Brett Kavanaugh on the Supreme Court or not\nToday's vote is a procedural vote to end the debate it's technically called cloture\nNext vote would be the vote on whether or not senators would actually choose to put Brett Kavanaugh on the U.S Supreme Court\nWe heard just a few minutes ago that Senator Susan Collins Republican of Maine\nWho might be a potential swing vote on this announced\nThat she will side with her fellow Republicans on a critical past voted this cloture vote\nTo end the debate we're just double checking our numbers right now I Want to make sure we have the exact right vote total and as soon as we have that we will bring that to you for the moment we should get to one of Susan ... a ... she is literally leaping out of ...\nWell it looks like we have the votes now from all four of the undecided senators going into at least on this cloture motion and interesting they Lisa Murkowski is the only one who was voted no show Joe mansion that Democrat from West Virginia has voted yes\nJeff Flake has voted yes Susan Collins has voted yes now Susan Collins however previously announced she was voting yes on the coach of it but not to necessarily take that as an indication of her final stance on Kavanaugh because\nThis afternoon at three PM she will announce her final decision so we don't know necessarily what this procedural vote to me but I think it's quite significant\nUh to see the Joe mansion yes vote in particular and the Lisa Murkowski no vote if those positions where to hold up in the final vote on Kavanaugh he would be approved\nLooks like there's still some voting going on maybe from senators who are struggling in and out of the rooms Steve Clemons once this cloture vote is done\nTo necessarily take that as an indication of her final stance on Kavanaugh because this afternoon at three PM she will announce her final decision so we don't know necessarily what this procedure also to me but I think it's quite significant\nAh to feed the Joe mansion yes vote in particular and Lisa Murkowski no vote if those positions were holed up in the final vote on Kavanaugh he would be approved\nLooks like there's still some voting going on maybe from senators who were struggling in and out of the room Steve Clemons once this cloture vote is done with eventually it will be done with what happens then what do we expect between this vote in the next one will you'll have debate on the floor\nOf that goes on and they'll bring that debate too close and they will set a time most likely\nTomorrow I'm In which they will vote to confirm or not judge Kavanaugh\nAnd that time it it could be any time during the day or is there like a particular window hardly any time of\nDay I mean one of the things about this at it as it runs anytime I think one of the interesting things is you have\nA a senator from Montana a a Steve Gaines whose daughter is being married tomorrow getting married tomorrow and he wants to walk her down the aisle so ah shoot his vote be absolutely necessary they have to wait for him to get back from Montana so it's one of those life\nUh intrusions into the way of the system runs but my sense is that Mitch McConnell is obsessed with getting this done moving on and getting people out campaigning and\nNoting this as a success that they've achieved that's why this is so unusual that feels raced pushed whether it's the FBI investigation which many people have been saying has not been a exhaustive did not go into many corners it's because the clock is ticking for Mitch McConnell and I think he wants\nTo shelve this and get this done as soon as possible and not one of these votes that you do one of these what you have to do in person there was no app for that so certainly his [laughter]\nHis uh his other life commitments could have a big impact the final vote total fifty one yes forty nine no and indeed as Susan said senators Collins flake and mentioned voted yes to suspend the debate and move on\nLisa Murkowski voted no but it seems like for the most part this was pretty much\nA party line vote Eugene Scott I don't think that we really expected it to go any other way than being essentially a squeaker right on party lines absolutely I think everything leading up to this moment suggested that even before the allegations against Kavanaugh\nLife commitments can have a big impact the final vote total fifty one yes forty nine no and indeed as Susan said senators Collins flake and mentioned voted yes to suspend the debate and move on\nLisa Murkowski voted no but it seems like for the most part this was pretty much a party line vote Eugene Scott I don't think that we really expected it to go any other way than being essentially a squeaker right on party lines\nAbsolutely I think everything address leading up to this moment suggested that even before the allegations against Kavanaugh became\nA public and I think uh there's a a ... a larger idea on that baby Brooks tapped them\nOr to today and in his New York times piece about just how part of the judicial branch has become\nUm we talk often about activists judges um and concern that people on the bench are not making decisions and partially but we haven't seen that be the case for a while now and they simply appears to be a continuation of that I mean if I if I may\nJoshua one other element on this is that it was interesting to note that Heidi Heitkamp brother\nTweeted that she has to look at herself every day in the mirror and us chose to vote no even though he thinks it significantly increases the chances that she will lose her seat\nJoe Manchin the last time there was a a a reasonable poll in West Virginia is looking at Seventy percent of West Virginia is likely to vote support the Kavanaugh nomination to the broader side in terms of the tectonics and the parties as they look at trying to take the Senate where the Democrats taking the Senate\nIs is also hedging on this that if Manchin were to be a no vote on Kavanaugh I think it it it very seriously could raise the stakes of him losing that states are there different there are different issues here one is what what does the future prospects of\nBalance you are stupid won a always available in plain English weekdays from W AMU end NPR [noise]\nYou can be tough on crime without being tough on people\nKnew frontline and criminal justice reform district attorney's\nOffice it themselves are basically impenetrable black boxes\nI look at the power indiscretion and the da's office and a grassroots movement pushing for change next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five K. or cc southern Colorado's NPR\nStation\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado College a national liberal arts college where together students and professors explore the depth and breadth of each subject one course of the time more about Colorado colleges block planet Colorado College dot edu this was southern Colorado's NPR\nStation to your C. C. C. C. H. D. Colorado Springs each cc law hunter tc of ... M K W CCF them woodland park\nIs on earth for service to humanity and now we know the winters who's in this year's class of Nobel laureates from W. A. M. U. and NPR in Washington DC is one egg [noise]\nHey there I'm Joshua Johnson today on one ... it's the friday news round up the twenty Eighteen Nobel Prizes have all gone out culminating in the peace prize which went out today who won and what for [noise] meanwhile Russia is getting attention for an Ig Nobel achievements spying on at least two international\nAgencies [noise] plus the U.S calls out China for trying to sway public opinion in America\nAnd first lady Melania Trump visit to Africa\nOr also across the Brett Kavanaugh vote in the Senate but in the meantime let's review this week's topic global headlines comments on our Facebook page or tweet us ... one ... [noise]\n\n[noise] live from NPR News in Washington I'm Marie ... the nomination of Brett Kavanaugh to the Supreme Court is now on track for a final Senate vote probably sometime this weekend on this vote the age of fifty one that knows are forty nine the motion is agreed to the voices senator Shelley Moore cats\nBrett Kavanaugh vote in the Senate but in the meantime let's review this week's tongue global headlines\nComments on our Facebook page or tweet us that one [noise]\n\nLive from NPR News in Washington I'm Marie skills on the nomination of Brett Kavanaugh to the Supreme Court is now on track for a final Senate vote probably sometime this weekend on this vote the yeas are fifty one\nThe nose are forty nine the motion is agreed to the voices senator Shelley Moore Capito with the majority yes vote on the procedural questioned the Senate will now continue to a final confirmation decision within thirty hours NPR's Scott Detrow has more\nIt was a party line vote with two exceptions Alaska Republican Lisa Murkowski voted no in West Virginia Democrat Joe Manchin voted yes\nSenators can still change their minds ahead of the final up or down vote in fact Maine Senator Susan Collins a Republican ... may not be final and she'll announcer ultimate decision later today in a speech on the Senate floor\nThe final vote will likely be held Saturday but it could be pushed to Sunday if Collins is a no Montana Republican Steve Gaines won't be available to vote tomorrow because his daughter is getting married Dayton says he won't skip the wedding for a vote Scott Detrow NPR News Washington\nNPR's Brakkton Booker is watching the scene outside the U.S Supreme Court across from the U.S Capitol Grounds\nTo crowdsource site in the U.S Supreme Court in after the Senate procedural vote to move in with a nominee Brett Kavanaugh the crowds were not as big as they were yesterday protesters here still held signs that read a cabinet\nNPR's Brakkton Booker at the Supreme Court here in Washington the nation's unemployment rate fell to its lowest level in almost fifty years in September according to a government jobs data released today but as NPR's John Ydstie reports job creation cool debate last month\nThree point seven percent unemployment rate in September is the lowest since December of Nineteen sixty nine that was during the Vietnam War when many potential workers were out of the workforce fighting in Southeast Asia\nToday's labor market is tied for other reasons a very strong economy has boosted demand for workers and the retirement of the baby boom is slowing growth in the workforce employers added only a hundred and thirty four thousand new jobs in September and that's the smallest monthly gain any year it may be an indication\nLast month the three point seven percent unemployment rate in September is the lowest since December of Nineteen sixty nine that was during the Vietnam War when many potential workers were out of the workforce fighting in Southeast Asia\nToday's labor market is tied for other reasons\nA very strong economy has boosted demand for workers and the retirement of the baby boom is slowing growth in the workforce employers added only a hundred and thirty four thousand new jobs in September and that's the smallest monthly gain any year\nIt may be an indication of scarcity of potential workers it's also possible Hurricane Florence reduced employment temporarily in some industries John Ydstie NPR News Washington\nThe Commerce Department is reporting the U.S trade deficit increase six point four percent in August hitting fifty three point two billion dollars exports dropped in the declining soybean ship mention imports hit a record high the politically sensitive goods trade deficit with China surged four point seven percent\nTo a record high of thirty eight point six billion Wall Street at this hour the Dow down two hundred sixty five that NASDAQ off one hundred Nineteen this is NPR\nAfghan officials have rejected a proposal by the founder of the private security firms Blackwater to privatize the war in Afghanistan Jennifer glass has more details from Kabul\nEvery prince who founded the private security firm Blackwater was recently in Kabul lobbying for his plan to outsource some military operations to contractors and mercenaries\nAfghan president Ashraf Ghani issued a statement saying under no circumstances would Afghanistan allow the counter terrorism fight to become a private for profit business with the U.S defense secretary Jim Mattis and General Joseph motel the head of U.S Central command have called the plant a bad idea\nThe Taliban and Islamic state have launched build attacks in Afghanistan controlling or contesting more than half the country Afghan military casualties are on the rise and many here are concerned that the violence will escalate have parliamentary elections later this month\nFor NPR News I'm Jennifer glass in Kabul\nTesla shares have slipped in trading today the downward slide followed a tweet by chief executive Iran must\nMocking the securities and Exchange Commission to must tweet calling the SEC the quote short seller enrichment connection came just hours after a federal judge ordered mosque and the SEC to write a letter justifying a settlement which allows him to remain in charge at Tesla the SEC is charge that much\nAnd many here are concerned that the violence will escalate at a parliamentary elections later this month for NPR News I'm Jennifer glass in Kabul\nCatch shares have slipped in trading today the downward slide followed a tweet by chief executive Iran must\nMocking the securities and Exchange Commission must ... calling the SEC the quote short seller enrichment connection came just hours after a federal judge ordered mosque and the SEC to write a letter justifying a settlement which allows him to remain in charge at Tesla\nThe SEC is charge that much posted false and misleading tweets this summer about taking the electric carmaker pride that settled making the case has Tesla and mosque each paying at twenty million dollar fine to the FCC well mosque would step down as chairman but continue as CEO\nI'm Louis ... NPR News Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit compose the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nI'm ... I'm ... king and you're listening to Ninety One point a to our ...\nSupport for the Ninety One point five years cc newsrooms provided in part by Ninety One point five to your cc members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five years cc on line or kill your cc dot ORG [noise]\n\n\nThis is one a Happy Friday I'm Joshua Johnson in Washington the Nobel Peace prize goes to two people from two different countries for their work helping victims of sexual violence in armed conflict\nAlso a big election is coming up in Brazil more allegations of Russian hacking vice president Pence has harsh words for China and Iran and first lady Melania Trump goes to Africa joining us to discuss this and the big stories from around the world is David Sanger national security correspondent for the New York times and the author of\nThe perfect weapon war sabotage and fear in the cyber age David welcome back to what a great to be with the judge will Vivian ... covers the White House for the wall Street Journal Vivian welcome thank you and ...\nHelping victims of sexual violence in armed conflict\nAlso a big election is coming up in Brazil more allegations of Russian hacking vice president Pence has harsh words for China and Iran and first lady Melania Trump goes to Africa joining us to discuss this and the big stories from around the world is David Sanger national security correspondent for the New York times and the author of\nThe perfect weapon war sabotage and fear in the cyber age David welcome back to what a\nGreat to be ready Joshua Vivian ... covers the White House for the wall Street Journal Vivian welcome and NPR national security correspondent Greg Myre ... co author of this Burning Land lessons from the frontlines of the transformed Israeli Palestinian conflict ... glad to have you back\nGood to be a gesture we'd also be glad to have your questions in thoughts about the top stories from around the world we are following the top story in the U.S right now and we'll have more on the vote regarding judge Brett Kavanaugh a little bit later on that vote has taken place in the Senate has voted\nTo move forward with a big vote will discuss that a little bit further later on but we want to start with some big stories from around the world that have really gotten eclipse over the counter not covered so email us one a at W. A. M. U. dot org\nComments on our Facebook page where you can watch a video stream or tweet us at one a\nAmerica and other western governments hammered Russia's spy network this week\nYesterday the U.S indicted seven military spies with links to an Olympic doping scandal earlier of Dutch authorities said they had foiled a cyber attack against the international chemical weapons watchdog let's explain\nFor men working for Russian military intelligence or caught trying to hack the computer network at the headquarters of the organization for the prohibition of chemical weapons OPEC W. that's the group that was investigating the use of chemical weapons in Salzburg England that attack on the four Russian spy\nAnd in Syria equipment was found in the trunk of a car there was a wife I intend to hidden under a jacket on the shelf reports suggest the set was working when Dutch security officers disrupted the attack\nA lifetime appointment the latest this afternoon on all things considered from NPR News\nFor your see see why there is this is my age who is this is Jonathan from your what are the dominant galling for the most at\nThe end of the night time anyone ... pi hey I teach the\nProgramming on Ninety One point five to your cc is supported by Colorado College where lifelong learners\nRaised as a way of other witnesses to take a couple of weeks where we're talking about\nA lifetime appointment the latest this afternoon on all things considered from NPR News\nSee or see see why there is this is my age who is this is Jonathan from your water the dominant ... from the most at\nThe end of the night time anyone ... pie ... the\nProgramming on Ninety One point five K. R. C. C. is supported by Colorado College where lifelong learners foster relationships with students and professors working side by side to attain a liberal arts education more about lifelong learning at Colorado College dot edu\nBy Ninety One point five or so you see underwriters who realized the benefit of reaching Ninety One point five 'til your cc listeners for more info on your business underwriting with carrier cc called seven one nine four seven three for eight zero one\nBy cafe dawn in saliva organic fair trade coffee and tea located at one twenty two east ... street cafe Don is on line at cafe dash dawn dot com open six AM to three PM daily\nSupport for NPR comes from this station and from progressive insurance offering a way to buy home insurance with their home quote explorer tool custom cars sin rates are available on mind learn more progressive dot com or one eight hundred progressive now that's progressive\nAnd from Boehner with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contractor locate her hand more information or at bona dot com\nMisses one a I'm Joshua Johnson it's the friday news roundup with NPR's Greg Myre is Vivian ... of the wall Street Journal and David Sanger of the New York times we welcome your questions and thoughts about the top stories from around the world\nComment on our Facebook page where you can also watch a video stream tweet us at one a or email one a at W. A. M. U. dot pork\nWith regards to cyber hacking Michael asks with the loss and result in widespread dissemination of the CIA tool kit which allows one to spoof packing from another country how can cyber bread crumbs lead to certainty that another country is actually guilty David what do you think\nWell cyber attribution is something that people are getting a lot better at I'm certainly there are lots of ways\nComments on our Facebook page where you can also watch a video stream tweet us at one a or email one a at\nW. A. M. U. dot org with regards to cyber hacking Michael asks with the loss and result in widespread dissemination of the CIA tool kit which allows one to spoof tacking from another country how can cyber bread crumbs lead to certainty that another country is actually guilty\nDavid what do you think well cyber attribution\nIs something that people are getting a lot better at I'm certainly there are lots of ways to make it appear that a cyber attack came from other places when the New York times was attacked by the Chinese and its computer systems uh years ago it looked like the attack was coming from a University in the southern part of the U.S\nBut the fact that matter is a combination of forensic evidence a motive\nPast use so similar tools can get you most of the way most of the time so there are some pretty good ways to go do it\nThe bigger question facing many governments is once they've found this out and perhaps decide to announce it as happened in these most recent cases than the political pressures on them so what do you do about it\nThat's why the president signed a new set of executive orders and I'm\nIn August we haven't seen them they're all classified that pushes down into the system or the ability for commanders in the U.S to do cyber attacks back without having presidential sign off\nTill now that's been something that the only only the president authorized the use of nuclear weapons and cyber weapons now it's not entirely clear that only he can authorize the use of cyber weapons in retaliation but you want to make sure you're attribution is pretty good before\nYou strike back you know who to attack\nYeah great married before we move on from there first of all that is no small thing that that the U.S military might have the latitude unilaterally to shut down a power grid or turn off or you know hydroelectric dam through the Internet\nBut beyond that do we have a sense that certain countries certain organizations are getting a better handle on dealing with cyberattacks to world clearly hasn't figured this out is anyone making progress I think about the EU because I hear so much about Internet regulations from there on a consumer level but\nOn a military level is anyone making progress or not that I'm aware of the U.S I think it's still the world leader and in in terms of they\nLaterally to shut down a power grid or turn off or you know hydroelectric dam through the Internet\nBut beyond that do we have a sense that certain countries certain organizations are getting a better handle on dealing with cyberattacks to world clearly hasn't figured this out is anyone making progress I think about the EU because I hear so much about Internet regulations from there on a consumer level but\nOn a military level is anyone making progress\nOr not that I'm aware of the U.S I think it's still a world leader and in in terms of uh you know advanced Internet abilities and and the threats are pretty clear ah Russia China and North Korea or Iran but\nA ... D figuring out or response and how you want to calibrate that response so it doesn't become this open ended escalation and you don't know the capabilities of your rivals if you respond a ... you're entering really uncharted territory\nVivian do we get a sense of countries beginning to kind of work together to figure this out to to figure out some kind of international response to cyber attacks or his Russia really got the whole world kind of running when the ...\nThe what we've seen in the last couple of days is the coordination of um indictments and you know raising concerns about um sighing and otherwise obviously there's a lot of discussions that are taking place where countries our western allies trying to coordinate some kind of effort to counter\nThe threat that that the Russians posed but at the same time again you have so many ah\nRestrictions and so many um uncertainty as to how to approach the cyber world in general and cyber threats\nAnd as David said the U.S trying to really formulate some sort of attack plan or something to counter and to protect our infrastructure so that we don't have um we're not as vulnerable as we've seen ourselves\nIn the past but obviously you know the U.S is still trying to figure out a way forward I'm having looked at what happened to us in the two thousand sixteen election still we're talking about the fact that we are vulnerable in two thousand Eighteen we could be vulnerable on twenty twenty so we haven't actually tried quite figured out how to protect ourselves get alone\nThe world's kind of coordinating on a global scale to do the same it's it's it's not an easy task\nIt's funny kind of a decentralization of the way that we vote that we have so many different kinds of voting systems might you know way kind of how it helps a lot it helps insulated from according to the fact that we got all these different utility company yeah but you know ... but but the key element here is we've done a better job at discussing internal\nStill we're talking about the fact that we are vulnerable in two thousand Eighteen we could be vulnerable on twenty twenty so we haven't actually tried quite figured out how to protect ourselves get alone the world kind of coordinating on a global scale to do the same it's it's it's not an easy task\nAlthough it's funny kind of decentralization of the way that we vote that we have so many different kinds of voting systems might you know way kind of how it helps allied helps insulated from according to the fact that we've got all these different utility company yeah but you know ... but but the key element here as we've done a better job at discussing internally how we would\nDo counterattacks than we have organizing the world than the sort of digital Geneva Convention what standards of what's on limits and often it\nLet's shift gears and talk about the Nobel Prize is particularly the Nobel Peace prize the winners were announced this morning\nDr Denis ... and ... one for their work combating sexual violence as a weapon of war\nThe announcement from the Nobel Committee said in part quote Dennis ... Luke ... is to help or who has devoted his life defending these victims not him a rod is the witness who tells of the abuses perpetrated against herself\nAnd others were rod is an Iraqi woman she was captured and held by the Islamic state escaped captivity after three months and told to her story in a book called the last girl\nDr ... founded a hospital in eastern Congo that treated thousands of women many of whom are survivors of gang rape ... pretty extraordinary people to be winning the prize especially as we've learned more about how sexual violence is being used as a weapon of war and has for quite some time\nYeah really has to two individuals who seem really deserving the peace prize has been a lot of had a lot of controversy in recent years very politicized\nA couple of people who really been thrust into dangerous situations handled it with with incredible courage and and Dr ... up built this hospital in eastern Congo which is in the middle of nowhere and just a very remote region\nTwenty years ago for maternal care there just isn't much health care of that was his intent but\nAs the Congolese civil war metastasize um rape became a huge issue a huge problem that the various factions un peacekeepers who are involved in in rape there\nAnd so he became the voice of rape being used as a weapon of war and so he's been at this for Twenty years very prominent a voice but still operating in ...\nEastern Congo which is in the middle of nowhere and just a very remote region Twenty years ago for maternal care there just isn't much health care of that was his intent\nBut as the Congolese civil war metastasize um rape became a huge issue a huge problem to the various factions un peacekeepers who are involved in in rape there\nAnd so he became the voice of rape being used as a weapon of war and so he's been at this for Twenty years very prominent a voice but still operating in a very ah a dicey region of very deserving winter maybe\nI can really speak for the case of hum ... who I I spend a lot of time in Iraq and two dozen Fifteen sixteen I'm interviewing ZD women who were released from captivity from ISIS and the impact yeah obviously psychologically physically or the use of sexual assault\nAnd rape as a tool in a war is obviously a huge thing but you have to also remember that these women go back to their tried to go back home a lot of their family shunned them because of cultural sensitivities to such things and so\nTheir lives are essentially up ended by this their families a lot of times don't take them back home a lot of these women were impregnated I'm as a result of this and\nHad to really know where to go because they were single mothers which in Iraq is is just\nCompletely a taboo and so uh you know it's something that you should raising awareness for that's something really really important and you had a lot of people on the ground in Iraq [noise] trying to educate these families that this is not a no fault of the women that they had no say in the matter but\nObviously you know changing cultural perceptions it's it's it's an uphill battle and so that's one of the other way I'm trying to do that and it's a it's it's worth the the know notoriety that she's getting\nLet's shift gears and talk about China vice president Mike Pence spoke yesterday accusing China of trying to sway American public opinion and undermined the Trump Administration\nJustices are supposed to be above the political break so how will this fight in the ... the Supreme Court and that story this afternoon on all things considered from NPR News\nYou can be tough on crime without being tough on people\nCanoe frontline and criminal justice reform district attorney's\nOffice it themselves are basically impenetrable black boxes\nI look at the power indiscretion and the da's office and the grass roots movement pushing for change\nFor most of the polling smear campaign imaginable\nJustices are supposed to be above the political break so how will this fight in the ... the Supreme Court ruled that story this afternoon on all things considered from NPR News [noise]\n[noise] you can be tough on crime without being tough on people\nCanoe frontline and criminal justice reform district attorney's\nOffice it themselves are basically impenetrable black boxes\nI look at the power and discretion in the da's office and the grass roots movement pushing for change next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five K. or cc southern Colorado's NPR station\nHey everybody this is really the faucet this is Krista hello this is Michael from spirit refunding\nNinety One point five K. R. C. the music seven PM you'd need Ninety seven Ninety three\nNPR on Ninety One point five to your cc is supported locally by the cultural office of the pikes peak region inviting listeners celebrate arts month this October by having at least one new cultural experience with family or friends details at ... dot com slash arts month\nSupport for NPR comes from the station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nAnd from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her aunt more information or at bona dot com\nAs promised let's get a brief update on the Supreme Court nomination of judge Brett Kavanaugh the Senate voted this morning to move his nomination to a final vote is very close vote fifty one to forty nine\nThat came after more than an hour of speeches including a last ditch effort by Senator Dianne Feinstein to convince senators who were still on the fence Feinstein is the ranking Democrat on the Senate Judiciary committee here's part of what she said\nFord and Ramirez submitted evidence to support their allegations including naming over two dozen witnesses ... unfortunately the limited investigation that was conducted by the FBI failed to enter\nForty nine that came after more than an hour of speeches including a last ditch effort by Senator Dianne Feinstein to convince senators who were still on the fence Feinstein is the ranking Democrat on the Senate Judiciary committee is part of what she said\nBoth Ford and for a merit\nSubmitted evidence to support their allegations including naming over two dozen witnesses ... unfortunately the limited investigation that was conducted by the FBI failed to interview any one of the witnesses\nThese two women identify who could support her account\nThat was Senator Dianne Feinstein speaking on the Senate floor just a few hours ago of course the Ford and Ramirez she referred to our professor Christine Blasey Ford and Deborah Ramirez both of them have accused ... of sexual misconduct\nFeinstein was preceded by Senator Chuck Grassley the chairman of the Senate Judiciary committee who bemoan the process and slam Democrats for their treatment of the nominee\nWhat left wing groups in their democratic allies have done to judge Kavanaugh\nIsn't nothing short\nI saw what they did to Robert Morris\nI saw what they did to Clarence Thomas\nWas nothing compared to what we ... and this here in the last three months\nWhen all was said and done Senator Lisa Murkowski the Republican of Alaska was the only GOP member to vote no on advancing to the ... vote Senator Joe Manchin the Democrat from West Virginia was the only Democrat to vote yes\nSenator Susan Collins Republican from Maine voted yes but said she would announce her decision on a big vote later today that vote is expected to happen this weekend you'll find full coverage of that here on your NPR member station and online at NPR dot org\nBefore we get back to the round up a quick heads up and the much needed diversion from the news of the day this month's meeting of the one a movie club is next week\nThis time we're watching one of the most hotly anticipated movies in Hollywood the latest remake of the classic romance a star is born now this movie has already been made three times in Nineteen thirty seven Nineteen fifty four in Nineteen Seventy six\nNow Bradley Cooper stars in an directs this version alongside Lady Gaga has a hard drinking musician who falls in love with a young singer a star is born just debuted we will review it\nTo the round up a quick heads up and the much needed diversion from the news of the day this month's meeting of the one a movie club is next week\nThis time we're watching one of the most hotly anticipated movies in Hollywood the latest remake of the classic romance a star is born now this movie has already been made three times in Nineteen thirty seven Nineteen fifty four in Nineteen Seventy six\nNow Bradley Cooper stars in an directs this version alongside Lady Gaga has a hard drinking musician who falls in love with a young singer a star is born just debuted we will review it this coming Wednesday if you go see it send us your review how many stars out of five would you give the movie and why\nLeave us a voice mail eight five five to three six one a one a weed especially love to hear from you movie buffs who've seen any or all of the previous versions how does this one compare\nEight five five to three six one a one a or use our app won a vox pop to send us radio quality audio file we will review a star is born spoilers and all this Wednesday on one day\nBack now to the round up with Vivian ... and David Sanger let's talk about Iran\nAfter the Trump Administration abandoned the nuclear deal that was negotiated during President Obama's tenure and to reimpose sanctions Iran took the U.S to court the international court of justice to argue that the u._s. actions violated the terms of the Nineteen fifty five ... of ...\nWell the Trump Administration hit back this week\nSecretary of state Mike Pompeo announced on Wednesday that the U.S is ending that treaty\nThis is a decision frankly that his thirty nine years overdue in July around brought in Marilyn's case and the international court of justice alleging violations of the treaty of amity\nOr on six to challenge the United states' decision to seize participation in the Iran nuclear deal into reimpose the sanctions were lifted as part of that deal\n... attempt to interfere with the sovereign rights of the United states to take a waffle actions of necessary to protect our national security and Iran is abusing the icy Jay for political and propaganda purposes\nThat was secretary of state Mike Pompeo speaking on Wednesday Vivian salami some have said that ending this treaty is largely symbolic or is that so\nYeah it is an unknown and a lot of ways I think in general\nDeal and to reimpose the sanctions were lifted as part of that deal\nAre always attempted interfere with the sovereign rights of the United states to take a waffle actions of necessary to protect our national security and Iran is abusing the icy Jay for political and propaganda purposes\nThat was secretary of state Mike Pompeo speaking on Wednesday Vivian salami some have said that ending this treaty is largely symbolic or is that so\nYeah it is an unknown and a lot of ways I I think um in general it's more just I'm reinforcing the administration says standing efforts to withdraw from the Iran nuclear deal and um crackdown on Iran and kind of show that they're not messing around and so\nI'm basically this was just one more step in that process but as far as any real uh changes on the ground it really doesn't do much it's really just our sponsor\nTo on the international court of justice says ruling a that essentially said that sanctions that they re imposing sanctions um we're not fair to Iran\nBring my we step back for just a second what is this treaty of amity are I'm sure that was the question of the state department I just had this vision of some low level staff are going through the basement looking treaty\nOr am I think it's really damage could result thing through what we've heard about you know the the big acronym of Jaycee peel away the Iran nuclear deal but what\nIs this treaty of amateur well in Nineteen fifty three the U.S helped orchestrate a coup in Iran bringing the shah of Iran back to power and they were us in Iran where buddy buddy at that time and so two years later\nIt's yeah you brought me back to power sure treaty of amnesty great and they were indeed good friends from fifty three until\nThe Seventy nine revolution this is the shah who was deposed in these lemon revel in the Islamic Revolution of ... Seventy nine so for thirty nine years uh there has been no enmity between us and Iran um this again seems very symbolic\nI'm just a last little relic that somehow didn't get shredded after the the the revolution that Seventy not\nIt was the last hurrah of Kermit Roosevelt grandson of Theodore Roosevelt CIA operative who almost singlehandedly staged this coup and then they got everybody we put in power to go sign the treaty\nPort Kermit he's getting no respect from the state department these days by Malian was Carmen Roosevelt I'm taking it\nNo enmity between us and Iran um this again seems very symbolic I'm just a last little relic that somehow didn't get shredded after the the the revolution and Seventy not\nIt was the last hurrah of Kermit Roosevelt grandson of Theodore Roosevelt CIA operative who almost singlehandedly staged this coup and then they got everybody we put in power to go sign the treaty\nPort Kermit he's getting no respect in the state department these days if I may have them as permanent\nRoosevelt I'm taking it I I like that name for for a man who had such a place in history Kermit Roosevelt and I know where the American David ... is there any real effect in terms of\nThe sanctions that consequences to the U. S. for refusing to lift them if this treaty of am at sea is more sim Bali where might there be more tangible impact\nThe so the tangible impact is November when President Trump has said that he will impose the full sanctions on Iran He's given allies warning that this was coming\nAnd those sanctions if he does it as he his pronounced would say to any ... company around the world but particularly European companies\nIf you do business with Iran you're not doing business with the United states and it's an effort to choke off the Iranians\nBy making the big aircraft makers Boeing's already pulled out the big oil a production equipment makers all get out of Iran and they were doing that what's happening now though is that the ... the Europeans are saying we're going to find a method\nTo buy oil from Iran without clearing it in dollars so that the u._s. can affect it with the sanctions and a number of us went up and met a with the Iranian foreign minister when he was at the un ah last week and he made an argument to assess who Saturday evening\nThat he believed that this method was going to come together so we're heading toward a conflict between the U.S and its European allies over on\nGoing to come together so we're heading toward a conflict between the U.S and its European allies over on do we have a sense I think I feel like the the big issue really user wrongs nuclear program", "year": "2018", "show_name": "1A Plus", "city": "Colorado Springs", "day": "05"}