{"month": "10", "state": "CO", "station": "KRCC", "content": "American public media\n\nGood morning ... is nine o'clock southern Colorado's NPR station K. R. C. C.\nCare see the HD Colorado Springs can't eat the the the hunter Casey the stark fail and K W CCF in woodland park streaming at K. R. sci fi got a large e coming up we have looking at followed by this morning headline and won a [noise]\nAmerican public media\n\nGood morning is nine o'clock this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs can't he see the the hunter\nCasey the ... the the ... than woodland park streaming at K. R. C. C. dot ORG coming up we have and looking at followed by this morning's headlines and won a [noise]\n\nWas looking up in southern Colorado Colorado Springs Astronomical Society I mean I'll be like in there are a lot of reasons look up I Want to tell you about a very strange that are known formally as beta city unless formally\nIs dipped normally the brightest star in the constellation gets to be the alpha star but in Cedar so whale the brightest stars beta or ... and these weird\nThe name means well first frog which means of course there must be a second frog and there is which is the much brighter star full halt soldiers were up there is a dying giant star but it's warmer than most others and it's about a hundred and forty five times brighter than our sun so far so good\nBut tip the has a dark secrets or at least an invisible one it seems that this quiet little stars also and surprisingly a major source of X rays that really shouldn't be\nAstronomers think the stars magnetic field above the surface is somehow twisting and magnifying the X rays and ... those corona and to do that it should be spending really rapidly but it isn't\nAnd there are a number of theories about how this can happen but we just don't know so it's kinda like that really strange neighbor down the street who does weird things so keep an eye on the oddball ... we never know what it will do next\nIf you'd like to a close look at the door and the other wonderful and amazing things that are sky please reserve care see see that or for Lincoln permission about a month the beating center of republics our party is this is Albert lack for the goddess springs economical society telling you to keep looking up southern Colorado\n\nLive from NPR News in Washington I'm core of a Coleman President Trump is to speak this hour at the White House a new trade terms reached with Canada the agreement will allow candidates and joined the revamped North American free trade agreement\nMr Trump will be in Tennessee tonight to campaign for a Republican member of the house who is seeking a seat in the Senate from member station WWNO P. L. and ... Martinez Deltron has more\nTrump's event in Johnson City will serve in Raleigh for us\nAnd I'm a little society telling you to keep looking up southern Colorado\n\nLive from NPR News in Washington encore of a Coleman President Trump is to speak this hour at the White House a new trade terms reached with Canada the agreement will allow candidates and joined the revamped North American free trade agreement\nMr Trump will be in Tennessee tonight to campaign for a Republican member of the house who is seeking a seat in the Senate from member station WBUR P. L. answers you a Martinez Deltron has more on\nTrump's event in Johnson City will serve us in Raleigh for us representative Marsha Blackburn the Republican candidate running to replace retiring Senator Bob Corker because the second time in five months that President Trump will visit the state to campaign for Blackburn who's running against Tennessee's former governor in a race that he's very close according to recent polls\nThe former governor Democrat feel British and us run his campaign nothing moderate in a steep that overwhelmingly supported Trump he has avoided endorsements from his party and has said he will not support the current democratic leadership if elected for NPR News I'm said if you might be and it's been done in Nashville\nDisaster officials in Indonesia say at least eight hundred forty four people have been killed from last week's earthquake and tsunami on the island of ... NPR's Julie McCarthy is in ... and says rescue and relief efforts have been disastrously snarled including in the provincial capital pollute\nThe polo airport was closed today\nA one police major said four thousand people storm to the airport there\nThey rushed a military transport filled with aid and that shut down to the flights for the day so\nYou know the chaos is emerging people are shown a standing on tankers siphoning the fuel power has been cut hospitals or crippled people have moved outside where patients or been moved outside where the doctors are trying to administer them outside their NPR's\nJulie McCarthy there are questions over why warning systems in Indonesia failed after the initial powerful earthquake General Electric has fired its chief executive after a little more than a year on the job NPR's Jim Zarroli reports the move comes admitted declining profits for the company\nGE chief executive John ... had been on the job just Fifteen months\nHe will be replaced by H. Lawrence called the former chief executive of the conglomerate Dan or her who's now board member a G. E. the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division one second\nGeneral Electric has fired its chief executive after a little more than a year on the job NPR's Jim Zarroli reports the move comes admitted declining profits for the company\nGE chief executive John ... had been on the job just Fifteen months\nHe will be replaced by H. Lawrence cope the former chief executive of the conglomerate Danner her who's now a board member a G the company also said it's cash flow in earnings would be less than previously thought because of problems that it's G. E. power division\nOnce considered the essence of a modern cutting edge conglomerate ... has seen its fortunes and its share price fall dramatically and it's been forced to sell off divisions and lay off employees and a symbol of the company has declined GE was removed from the Dow Jones industrial average in June\nJim Zarroli NPR News New York\nOn Wall street the Dow Jones industrial ... two hundred Seventy points at twenty six thousand seven hundred twenty eight but now that gives up forty four you're listening to NPR\nThe winners of this year's Nobel Prize in physiology or medicine or American James P Alison and ... of Japan\nThe Nobel Committee is honoring them for their work and discovering methods of cancer therapy they develop ways to use the body's immune system in a manner that can't arrest the development of cancer research has led to major advances and cancer therapy drawings\nThe men at the center of a scandal that led to the cancellation of this year's Nobel Prize in literature has been convicted of rape it's all over guard has more\nSwedish court had sentence John cloud or no to two years in prison for the rape of a woman in two thousand eleven I Know is married to a member of the Swedish Academy which awarded the Nobel Prize in literature and has long been considered a kingmaker in Swedish art scene\nAllegations against him began to emerge in two thousand Seventeen when Eighteen women came forward to accuse him of sexual harassment and assault\nMost of the cases were dropped but the scandal sparked a crisis within the academy that eventually led to the ouster of its head and the subsequent wave of resignations while the two thousand Eighteen prize will not be awarded the academy has said it will choose to laureates in two thousand Nineteen for NPR News I'm since all of our guard in Denmark\nReports and South Korea say that north and South Korea have started to remove some landmines from their heavily guarded mutual border the ... news agency says that this action stems from the most recent summit between the countries to leaders they both agreed to\nOr drop in the scandals sparked a crisis within the academy that eventually led to the ouster of its head and the subsequent wave of resignations by the two thousand Eighteen prize will not be awarded the academy has said it will choose to laureates into that Nineteen for NPR News I'm said some of our guide in Denmark\nReports in South Korea say that north and South Korea have started to remove some landmines from their heavily guarded mutual border and the ... news agency says that this action stems from the most recent summit between the countries to leaders\nThey both agreed to halt all hostile acts against each other's countries and to take steps to eliminate the danger of war\nI'm core of a ... NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the law firm Cooley El Al will pay with offices in the U.S Europe and China cooling advisors entrepreneur as investors financial institutions and established companies around the world where innovation meets the law\n\nBy it's Cairo's all the host of marketplace you might have known or maybe didn't before I worked in radio I flew planes in the United States Navy seals were seriously dating machines but they'll actually one thing or radio that could pulling NPR I can tell you what I Would have given to hear wait wait don't tell me on an aircraft\nCarrier if you'll like listening to your favorite shows in your own machine\nWintertime comes ... decision they'll turn it into the programs you love gr donation information at your CBC dot org [noise]\n\nThis is one day I'm Joshua Johnson in Washington if you feel a bit breathless today you're not alone after the testimony of Brett Kavanaugh and Christine Blasey Ford the nation has found it hard to catch its breath\nMillions of Americans held their breath during the dramatic testimony on Thursday millions more shouted themselves horse at what lawmakers on both sides of the aisle said and did in Kavanaugh's confirmation battle\nThere were also private conversations about personal pain of votes by professor for its testimony conversations that used to only be whispered but now in this me to moment to finally be said out loud\nThose stories of sexual assault matter and we will spend a lot of tomorrow's program focused on them today let's focus on what happens now with Kavanaugh's nomination what's going on with the FBI invested\nMillions more shouted themselves horse at what lawmakers on both sides of the aisle said and did in Kavanaugh's confirmation battle\nThere were also private conversations about personal pain of votes by professor Ford's testimony conversations that used to only be whispered but now in this me to moment can finally be said out loud\nThose stories of sexual assault matter and we will spend a lot of tomorrow's program focused on them today let's focus on what happens now with Kavanaugh's nomination what's going on with the FBI investigation afford accusations and how this reflects on our national politics we'd love to answer your questions\nAnd get your take we're taking your calls and voice mails at eight five five to three six one a one a that's eight five five to three six one to one to\nEmail us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one egg\nJoining us in Studio is Jeffrey Rosen president and CEO of the national constitution center in Philadelphia He's also a professor at the George Washington university's law school Jeffrey welcome back to a great to be you're speaking to us from Harvard is Brian Fitzpatrick professor at Vanderbilt law school\nAnd a former clerk to the late Justice Antonin Scalia from two thousand one to two thousand two professor fitzpatrick welcome thank you for having me\nProfessor Rosen let me start with you and the confirmation hearing it seems like one of the big\nComplaints about the hearing was just the way that it was done that it was public at all as opposed to behind closed doors the timing of when the allegations from professor for war investigated I'd love to get both your sense professor fitzpatrick sense of just the structure of the hearing itself\nAnd how that might affect the big decision that needs to be made about whether or not to put judge Kavanaugh on the Supreme Court\n[laughter] listen to all things considered to hear the bigger picture every afternoon from NPR News weekday afternoons at three thirty [noise]\nOn behalf of all of us here in Ninety One point five care cc thank you for your support during our fall membership drive your financial contributions will ensure that Ninety One point five here she provides accurate news and analysis music and entertainment today tomorrow and the day after we could not do this without thanks\n[noise]\nNew ... afternoons at three thirty [noise]\nOn behalf of all of us here in Ninety One point five ... thank you for your support during our fall membership drive your financial contributions will ensure that Ninety One point five years cc provides accurate news and analysis music entertainment today tomorrow and the day after he could not do this without [noise] like\n[noise]\nHey everybody this is really the foster this is Krista hello this is Michael from spirit we seem to Ninety One point five K. R. C. the music having PMDD made Ninety seven Ninety three\nNPR on Ninety One point five to your cc you supported locally by the Colorado Springs law firm of data can hurt and crawl for forty five years helping clients with family asset preservation federal or state tax exemptions and more Fifteen west similar on got us can hurt dot com\nSupport for NPR comes from the station and from bona with the bone and certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at bona dot com\nAnd from Matthew ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR\nThis is one a I'm Joshua Johnson we're talking about the Kavanaugh confirmation and its impact on the nation we're speaking with Jeffrey Rosen president and CEO of the national constitution center and a professor at George Washington you can university's law school as well as Brian Fitzpatrick professor at Vanderbilt law school we love to speak to you to comment on our Facebook page\nTweet us at one a email one a at W. A. M. U. dot org and we're taking your calls and voice mails at eight five five to three six one a one a speaking of calls let's get to one now from Florida David is on the line Hey David what's on your mind\nBy Joshua how are you good what'd you think could be a hearing last week\nThe impact on the show or you just show the impact on the ... the actor exactly what I Would comment on the trail that uh I'm actually glad that the um\nAt one a email one a at W. A. M. U. dot org and we're taking your calls and voice mails at eight five five to three six one a one a speaking of calls let's get to one now from Florida David is on the line Hey David what's on your mind\nHey Joshua how are you\nGood what'd you think can be a hearing last week\nThe impact on the nation are you just said the impact on the nation that's the ACA exactly what I Would\nComment on I feel that uh I'm actually glad that the um that the hearings were made a public because it allows us as a nation to weigh in on what exactly is going on in Washington with our\nPoliticians and how they're making decisions for us\nOr with regard to these things so uh I think it was very important that we all uh chime in on what's going on in regard less of a our political aspirations uh I myself\nHave a they also at the alcoholism in my past ah I found a recovery in Nineteen eighty five I I understand the struggles of alcoholism but I also understood stand up uh in my youth when I struggled with alcohol as I grew into adulthood\nI uh was able to me I was able to hide or my drinking and to justify my drinking\nAnd this is a characteristic of alcoholics they\nAre very adamant about defending their drinking and also at the same time admitting that uh they do not have a problem so\nUm I think it's very interesting for us to see um individuals or come to terms with their past and how it affects their future and how that affects the future of all of us\nDavid how ... how do you think there's ... how do you think this will affect the confirmation battle though I mean I hear you about these other conversations that need to be had in terms of whether or not Brett Kavanaugh makes it to the Supreme Court or not what impact do you think the last few days might have\nA ... one particular clip I saw on CNN was when I'm One of the senators and was questioning him about er an FBI investigation\nAnd he refused to answer he fall silent he he he explained that he was hoping to what the committee or would a welcome however hit he personally would not comment on whether\nConversations I Need to be had in terms of whether or not Brett Kavanaugh makes it to the Supreme Court or not what impact do you think the last few days might have\nOne particular clip I saw on CNN was when I'm One of the senators and was questioning him about a an FBI investigation\nAnd he refused to answer he falls silent as he ... he explained that he was hoping to what the committee or would a welcome however hit she personally would not comment\nOn whether or not she would accept an FBI investigation and it was very interesting to watch his wife or her response to him because when he was not answering that question and she was staring at in very sternly and I always also wonder what exactly was she thinking\nWhen he refused to answer this question regarding your FBI investigation\nYeah you're you're actually yelled at your friend that was enough that Senator Durbin of Illinois cabinet and\nThere is nothing to hide we should be open to any possibility is\nYou know David appreciate your calling in thanks very much and that was the question that Dick Durbin of Illinois put to Brett Kavanaugh and he paused for a long time and then Chuck Grassley who's the chairman of the committee a Republican chairman of the committee jump back in and then after that Rachel Mitchell the question or for the G O P basically lost her job and then the GOP senator started jumping back and\nLet me get to some more of your comments David thanks very much for talking to us Catherine emailed\nAs a woman listening to Kavanaugh defend himself last Thursday I didn't find his presentation appropriate\nIt smacks of bullying and intimidation aside from that conspiracy theories like revenge from the Clintons aired and Senate testimony is a major disqualify or in my eyes before we bring our next guest professor fitzpatrick if I could ask you to respond\nTo Catherine particularly whether or not someone who began by making a partisan broadside can be trusted to sit on the Supreme Court and administer equal justice under law\nWell I'm you know I think we have to be realistic about all of this our Supreme Court justice has come from the political world they work for president of one party and I'm often times or they have other experience in politics they are\nTo some extent partisan or in their outlook but they try to put that to the side as best they can when they get on the court and focus on the statutes\nSupreme Court at administer equal justice under law\nWell I'm you know I think we have to be realistic about all of this our Supreme Court justices come from the political world they work for president of one party and I'm often times or they have other experience in politics they are\nTo some extent partisan or in their outlook but they try to put that to the side as best they can when they get on the court\nAnd focus on the statutes the constitution the administrative regulations and I think they do a pretty good job obviously people's world view influences their decisions to some extent but I think we'll find that if judge Kavanaugh's confirmed\nHe is a successful justice well liked by his colleagues just like Clarence Thomas\nFrankly a is today if you ask the justices if they like Clarence Thomas they they they will tell you I don't just like him I Love him so Sonia Sotomayor came to Vanderbilt last year and talk to her students and she said that I Love Clarence Thomas in so I think\nGet beyond this um but they're certainly going to be some awkward moments for a year or two\nLet's get another voice to our conversation joining us now in Studio is Elizabeth why drove the presidents of the constitutional accountability center of public interest law firm as think tank based here in D.C Elizabeth welcome ... let me start with the question that I began with\nFor professors Rosen and fitzpatrick just your general sense of the hearing both the structure of it and the testimony as we heard from professor Ford and judge Kavanaugh and how that might affect the ultimate big decision about whether Brett Kavanaugh should become an associate justice of the United states\nWell I think you know harkening back to what the caller uh just uh your your um listener just mentioned about the\nPresentation that judge Kavanaugh I made and talking about revenge of the Clintons you know there's definitely been a divide between those who are centering Dr Ford and the other survivors of sexual assault and as we saw judge Kavanaugh's opening censoring the political\nTalking about the Democrats talking about uh whether or not they should have leaked her letter and disregarded her request for an identity you know I think that ah whether or not you think Senator Feinstein should have tried to raise this another way earlier\nDivide between those who are centering Dr Ford and the other survivors of sexual assault and as we saw in judge Kavanaugh's opening centering the political\nTalking about the Democrats talking about uh whether or not they should have leaked her letter and disregarded her request for anonymity you know I think that uh whether or not you think Senator Feinstein should have\nTried to raise this another way earlier she was trying to respect that clear request for anonymity from this\nTraumatized survivor and maybe it's telling that Republicans would have just leaked it anyway and disregarded her request but Senator Feinstein was trying to give her the respect that she and her experience deserved\nAnd I think that trying to make that part of a political gain game like she came up with this decades long ... on to try to stop judge Kavanaugh from getting to the Supreme Court is frankly offensive it's offensive to\nHer and her experience and to the many many many many others who have experienced sexual assault and\nHave not come forward because of fear because of shame because they worried frankly that what we might see in this case would be true for them that they would finally find their voice and the courage to come forward and it would not matter\nI Wonder Elizabeth if there was any way around the politicking of this if it was just bound to happen no matter what I mean we've got a lot of comments very critical of the Democrats alluding to what you just kind of reference there\nHave emailed the Democrats are showing their ugly side and the people see right through their deception they should be ashamed but that would require morals which they lack\n[noise] Hi I'm ... membership manager here in Ninety One point five years on behalf of all of us your decision thank you for your support for membership dry food not do the surgery [noise]\nMemberships or the largest source of funding Ninety One point five care cc allowing us to bring you local stories NPR News music thanks for your generous support\nOn Ninety One point five ... or see she is\n[noise] Hi I'm ... membership manager here in Ninety One point five years on behalf of all of us here at the station thank you for your support all membership drive to not do this for gotcha [noise]\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News music thanks for your generous support\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five ... see underwriters who realized the benefit of reaching Ninety One point five\nTo your cc listeners for more info on your business underwriting was kill your cc called seven one nine four seven three for eight zero one vice also Robert now serving menu items featuring locally sourced ingredients from the Colorado tortilla company and savory spy shop to the polar dory sausage company and Schmidt AP aries menu and more and it's\nAlso bravo Colorado dot com support for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more at Raymond James dot\nCom and from bona\nA bona certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contractor locate her and more information\nOr at bona dot com [noise]\nWe will continue this conversation tomorrow focusing on some of the more personal revelations that this confirmation process has triggered we know that a lot of you have stories like professor Ford's to share some of which you shared with us we're so humbled that you would tell us and kind of sad that we cannot air more of them just because we've received so many\nAnd that's kind of what we need your help with figuring out what to do when someone tells you their meat to story\nHow have you dealt with these revelations among people in your life once the story is shared what then leave us a voice bail eight five five to three six one a one a\nIf someone's told you their story of being assaulted all harassed or if you shared your own story with others what happened then to help the healing process or are you still struggling for the ride response\nTell us your story you can email us one a ...\nHelp with figuring out what to do when someone tells you their me two story\nHow have you dealt with these revelations among people in your life once the story is shared what then leave us a voice mail eight five five to three six one a one a\nIf someone told you their story of being assaulted or harassed or if you shared your own story with others what happened then to help the healing process or are you still struggling for the ride response\nTell us your story you can email us one a at W. A. M. U. dot org or use our app wanting vox pop to send a radio quality audio file and to keep up to date on future topics and we'll share some of your stories tomorrow on one end\nBack now to our conversation with Elizabeth wider Jeffrey Rosen and Brian Fitzpatrick before we had back to the phones professor fitzpatrick let me give you a chance to respond to Elizabeth and then we'll keep going\n[noise] well I I Do think that the academic research on implicit bias suggests that we tend to see events through a political prior commitment now there are some\nAmericans that aren't strongly partisan there the independence and and so they're not going to see things through the same kind of bias and so I'd be curious to see what the independence think about about Brett Kavanaugh that may be or cruise test of of who's more credible and these allegations\nLet's keep doing on the phones now Jake in North Carolina is standing by hey Jake what's on your mind\nHey Joshua or I was just wanting to bring up something that I've been seeing talked about a lot on line but I haven't heard in your show so far this hour or really on a lot of coverage on NPR\nUh and that's the the idea that a Brett Kavanaugh it should be barred from this job primarily because of his uh\nLive that he has told while uh giving testimony\nUm were there any major killer and if they ever to inject it set out to you sorry what were there any statements in particular Jake that stood out to you\nThe the foremost is towards the end of his testimony he was asked if he\nWas uh watching Dr forwards testimony or and he very clearly said no and I have seen multiple accounts or putting him in a room watching from a monitor or and that that seemed like a a demonstrable fault that that just we can't let it slide\nUm whether any major killer in particular Jake that stood out to you sorry what were there any statements in particular Jake that stood out to you\nYeah the the foremost is towards the end of his testimony he was asked if he\nWas watching to Ford's testimony or and he very clearly said no and I have seen multiple accounts or putting him into watching it from a monitor or and that that have like eight eight demonstrable all said that that just we can't let slide\nJake I appreciate your calling in with that and actually a Jeffrey Rosen a Senator Richard Blumenthal of Connecticut asked\nJudge Kavanaugh about this legal principle a jury instruction Latin ms ... who know focus in on the bus which basically says if you lie about one thing we can disregard what you said about every ...\nHow much should that way into Brett Kavanaugh's confirmation remembering that this is as we've said not a court of law\nYou're absolutely right about the senator Blumenthal and it was very impressively pronounce\nTo drive over the weekend I have a nice um\nAnd ... folks are are tweeting an opinion that judge Kavanaugh road involving Guantanamo Bay detainees where he embraced the same principle and said if you lie about one thing you lie about others\nNow a ... but Democrats are promising that if Kavanaugh is confirmed and they take the house they will hold impeachment hearings on the alleged misstatements in the confirmation hearings and they range not only from\nA his testimony involving Dr Ford and his college classmates insistence that he was a heavy drinker even though he says he wasn't and so forth but also about alleged misstatements and the first part of the hearings where he said he didn't know about a emails involving lower court confirmations or surveillance programs and the evidence suggests that he did\nSo regardless of whether the Senate chooses to decide that a small misstatement as evidence of a larger one the Democrats are determined to press these and they're not going to go way\nWho is your mom but tweeted sometimes the partisan lens is overrated I Am a moderate Republican women and so many women that I have known experienced assaults like Dr for describes a friend from my church a high school friend a cousin a neighbor we believe her because we have been her\nPamela tweeted this is an impossible situation I feel deeply sorry for Ford is she was obviously sexually assaulted by someone and spent her life trying to get over it I also feel deeply for cabinet\nDetermined to press these and they're not going to go way\nWho's your mind but tweeted sometimes the partisan lens is overrated I Am a moderate Republican women and so many women that I have known experience to solve like Dr for describes a friend from my church a high school friend a cousin a neighbor we believe her because we have been her\nPamela tweeted this is an impossible situation I feel deeply sorry for Ford is she was obviously sexually assaulted by someone and they spent her life trying to get over it I also feel deeply for Kavanaugh as I have a father and brothers there was no way to prove his guilt or innocence\nI should also note that we've been getting a number of voice mail messages about this from across the country\nAnd even from around the world already in Hamburg, Germany left this note in our inbox\nThe Kavanaugh hearings have caught the attention of the German press beat to sue ... what do you decide\nThe opinion though is uniform it's an absolute shock or the lack of respect being shown by the Republican Senate toward the Supreme Court\nAnd its own history as the world's greatest deliberative body\nThe shock is not at the partisan tones of the hearing the right left battles are left right battles happening here too\nBut what's shocking is the tenor with which the Republicans have been speaking to the Democratic colleagues and the tenor with which the nominee himself used to address the Democratic senators Thursday\nFriday thanks very much for commenting to us in just by way of context to ... is a major paper in Germany if you remember our conversations about the Panama Papers the big international investigative report about money hidden in offshore bank accounts to do which is I took was one of the major papers that helped drive that forward\nI Wonder a professor for Patrick what's your take is on what all of this means\nFor just America's image around the world how the world is reflecting on us because of the way we're handling\nThis well after last presidential election I'm not sure image can get any worse um but uh you know I I think that it is a shame that the judicial nomination process has become so broken parties and\nUm and you know the Republicans are just as much to blame is the Democrats what they did to Merrick Garland after Justice Scalia passed away was unconscionable in my view and I frankly don't blame the Democrats for retaliation\nPresidential election I'm not sure image can get any worse um but uh you know I I think that it is a shame that the judicial nomination process has become so broken part is and\nUm and you know the Republicans are just as much to blame as the Democrats what they did to Merrick Garland after Justice Scalia passed away was unconscionable in my view and I frankly don't blame the Democrats\nFor retaliated um with this nominee a and what's so uh I really think that in in order to make the system\nWorked better we're gonna have to come up with some major\nOverhaul and and I think the one solution\nTo kind of restore the dignity tore judicial confirmation process is it's a big change but I think it's necessary change I think we have to ask do we think Supreme Court justices should have life tenure\nIf they didn't have served forty years it wouldn't be Armageddon every time someone retires and there's a replacement if presidents had a knowledge that every two years they get a Supreme Court nomination we would normalized this process and it would become more\nI'm sane [laughter] um and a lot of professors have been proposing this Eighteen year term for Supreme Court justices\nYeah time you have her I've I've I've heard it was when I was just gonna ask you about that I've heard that suggested that if it was Eighteen years you know there are nine seats and you know every two years basically see what come open kind of like clockwork\nThat this might not be quite so much like oh we're making this decision that will affect our children and our children's children it would still be a big deal but you know Eighteen is less than thirty or forty the question is whether or not that's politically viable\nSo next time on one hand [noise] [noise] [noise]\nA lifetime law and no experience game in my mind on thirty three years old when on people I'm Seventy seven you went in June a certain age do you come out you the same age would have different noble\nLife after prison with a look at seniors entering society decade after leaving in that next time on the take away from WNYC NPR I\nWanted to take away today to Lebanon am on Ninety One point five to your cc southern Colorado's NPR\nStation programming on Ninety One point five K. R. C. C. is supported by the cultural office of the pikes peak region inviting listeners who celebrate arts month this October but having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nJust to southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs the ISI Ceylon turkey CEO structural M K W CCF them woodland park\n\nGovernment gets nothing done\nMaybe true with the federal government but chances are your state house is highly productive\nFrom W. A. M. U. at NPR in Washington this is one egg [noise]\nHey there I'm Joshua Johnson today on on a we begin or special series this state where at\nState lawmakers tend to get a lot done including responding to cultural trips in part one of our series we focus on gun laws a hot topic after the mass shootings in Las Vegas and Parkland, Florida some states took bipartisan action on new restrictions others expanded access to fire off [noise] we'll see where this trend might be headed\nWhat gun laws are coming from your steak house at how are the affecting you email one a at W. A. M. U. dot org comments on our Facebook page or tweet us ... won a\n\nLive from NPR News in Washington I'm Laurie London a deal has been reached for candidates to stay in a free trade pact with the United states and Mexico President Trump is delivering details from the White House Rose Garden\nGreat honor to announce that we have successfully completed negotiation\nAm Utah board comments on our Facebook page or tweet us at one day [noise]\n\nLive from NPR News in Washington I'm Laurie London a deal has been reached for candidates to stay in a free trade pact with the United states and Mexico President Trump is delivering details from the White House Rose Garden\n... great honor to announce that we have successfully completed negotiations on a brand new deal to terminate and replace NAFTA Andy NAFTA trade agreements with an incredible new U.S Mexico Canada agreement\nCalled us MCA sort of just war [noise]\nTrade officials for both countries say they're renegotiated deal will result in free markets and fair trade the two countries also agreed to protect Canada from any future auto tariffs imposed by the U.S the agreement was reached after weeks of bitter high pressure negotiations\nThat rushed up against a mid night deadline the U.S Supreme Court is back in session today NPR's Nina Totenberg reports that the new term is beginning regardless of the chaos of the Brett Kavanaugh nomination\nThere'll be eight justices sitting on the bench a situation that is not ideal but not unfamiliar\nWhen conservative Justice Antonin Scalia died in early twenties sixteen Republican Senate majority leader Mitch McConnell kept a vacancy open for almost a year locking President Obama's nominee to the Supreme Court Merrick Garland\nNow with Trump nominee Brett Kavanaugh mired in controversy the court is once again soldier going on with only eight justices the difference is that in twenty sixteen conservative Justice Anthony Kennedy who sometimes voted with the liberal members of the court on key questions\nHas retired and the court is now evenly split between conservatives and liberals Nina Totenberg NPR News Washington\nTo scientists will share this year's Nobel Prize in medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who is currently at the empty Anderson Cancer center in Houston and ... at Kyoto University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nNow evenly split between conservatives and liberals Nina Totenberg NPR News Washington\nTo scientists will share this year's Nobel Prize in medicine for discoveries that have led to a revolution in cancer treatment NPR's Richard Harris has the story\nThe price will be split by James Allison who's currently at the empty Anderson Cancer center in Houston and ... at ... University in Japan the to work independently they were both exploring how the immune system works to ward off diseases including cancer\nThe immune system needs to rev up and it also needs to apply the brakes at times\nAlison and hundred discovered they could interfere with this process and release the breaks that makes the immune system more effective it attacking some cancers and their discoveries lead to a whole new class of drugs called checkpoint inhibitors which are widely used today Richard Harris NPR News\nStocks are rising sharply afterward that the U.S and Canada have agreed to a new trade deal the Dow is up two hundred and fifty five points the S. and\nP. gains Eighteen this is NPR\nSix days before key elections in Cameroon atop un official is calling for an immediate probe into killings\nIn the English speaking regions of the country the area is currently under a forty eight hour curfew and as NPR's Ofeibea Quist Arcton reports the official is concerned about reports of alleged atrocities on both sides of the conflict in the divided west central African nation\nComma rooms I guess when region's main grief and is that they're being marginalized by the dominant French speaking majority and long serving president phone via\nToday ... two years since the launch of an increasingly violent rebellion income marine questioning ... party\nNow the UN's special advisor on the prevention of genocide has stepped in that my Jang says alleged crimes by government forces and pro independence ... including extrajudicial killings\nVintage tools changed on kidnappings must be independently investigated and perpetrators to justice because new one is above the little ... NPR News\nTrump departs for Africa today on her first big so low international trip as first lady the seven day trip included stops to Guyana Malawi Kenya and Egypt or main focus will be child welfare but this extended tour around the world stage could drop\n... says I'm pro independent scientists including extrajudicial killings lineage toll kings on kidnappings must be independently investigated and perpetrators to justice because new one is about the little ... stop ... NPR News\nMillennia trumped up heart for Africa today on her first big solo international trip back first lady\nThe seven day trip included stops to Guyana Malawi Kenya and Egypt or main focus will be child welfare but this extended tour in the world stage could draw skepticism from some African leaders after previous derogatory comments by Donald Trump that\nIncluded a vulgarity to describe some countries\nOn the continent I'm Laurie London NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include progressive insurance comparing car insurance rates from multiple insurers so shoppers can evaluate options in one place now bats progressive comparisons available at progressive dot com or one eight hundred progressive\nAnd I'm ... I'm looking and you're listening to Ninety One point mine are moving\nSupport for the Ninety One point five years cc newsroom is provided in part by Ninety One point five ... members who continue to fund the news music and other quality programming that Ninety One point five to yours easy brings to southern Colorado and beyond at ... dot org thank you [noise]\n\nIs one a I'm Joshua Johnson in Washington Congress is often deadlocked on legislation but there is lots of action happening at the state level from immigration to gun control state houses and governors are passing bills and voters are approving ballot initiatives today we're launching a special series called the state we're in\nEach Monday This month we'll explore the bills and ballot initiatives dominating the debates in state capitals what are the state level trends tell us about the political direction of the country\nThis time around we'll explore trends in gun legislation and proposals around the nation today also marks one year since the mass shooting in Las Vegas at an open air country music festival it left fifty eight people dead and hundreds of people wounded\nAnd there was a passing bills and voters are proven ballot initiatives today we're launching a special series called the state we're in each Monday This month we'll explore the bills in ballot initiatives dominating the debates in state capitals what are the state level trends tell us about the political direction of the country\nThis time around we'll explore trends in gun legislation and proposals around the nation today also marks one year since the mass shooting in Las Vegas at an open air country music festival it left fifty eight people dead and hundreds of people wounded\nAfter that shooting many people called from on more gun control measures particularly on bump stocks some states passed bump stock restrictions other major restrictions went nowhere\nBut this year some things shifted after another mass shooting at Marjory Stoneman Douglas High school in Parkland, Florida a gunman walked into that school and killed Seventeen students and staff\nThat sparked a movement led by students survivors and states around the nation started restricting gun access including some states with Republican governors\nJoining us in Studio to discuss it is Scott Greenberg executive editor of state line a journalism project of the Pew Charitable trusts Scott welcome back to one day thanks very much for having me joining us from NPR in New York is Chris Brown ... president of the Brady Campaign to prevent gun violence Chris welcome\nThank you so much and joining us from Texas Public radio in San Antonio is Richard Feldman the president of the independent firearm owners association he's a former lobbyist for the n._r._a. and he's the author of Rick is Shay confessions of a gun lobbyist Richard thanks for making time for us\nThank you we should note that we have made attempts every single week to invite the president of the n._r._a. on this program we are eager to hear\nFrom Mr Oliver North thus far in treaties have gone unanswered but that invitation still stands\nSurvivor helps others confront the aftermath of their near death experiences this afternoon on all things considered from NPR News\nOn all things considered today and three thirty pm\nWhy there is this is my age who is this is Jonathan from your the dominant falling from the most at\nSeven and nine nine Ninety One point five ... the\nNPR on Ninety One point five to your cc you supported locally by Ninety One point five tree or see see underwriters thank you for helping to fund southern Colorado's NPR station Ninety One point five years cc more information on how\n... today and three thirty pm\nWhy there's this is my love these fluid by this is Jonathan from your business Dominic ... from the most at\nSeventeen you need now many one plane pie I have the\nNPR on Ninety One point five K. or CC's supported locally by Ninety One point five K. or see see underwriters thank you for helping to fund southern Colorado's NPR station Ninety One point five years cc more information on how to underwrite at K. or CBC dot org\nBy pikes peak center presenting clinical psychologist Dr Jordan Peterson championing his twelve rules for life to her on October eighth\nTickets for the twelve rules for life to her are available now at pikes peak center dot com by Colorado College offering an experiential education from cc classrooms studios in laboratories at the base of pikes peak to access to the nearby mountains in urban centers Colorado College dot edu\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learned more it Raymond James dot\nCom and from bona\nWith a bonus certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service\nContract to locate her and more information or at bona dot com\nBusiness one a I'm Joshua Johnson we're discussing trends this year in New state gun laws and proposals part one of our new series the state we're in we're speaking to Scott Greenberg or executive editor of state line Chris Brown the co president of the Brady Campaign to prevent gun violence and Richard Feldman president of the independent firearm owners association\nWe love to hear from you to share what you know about new gun laws in your state or proposals in your state whether they are in the state house or on the ballot\nComment on our Facebook page tweet us at one a ... or email one a at W. A. M. U. dot org Richard by the way before we keep going we mentioned that you are a former lobbyist for the ghetto ray you're not president of a group called the independent firearm owners association\nFor those who may not have heard of it that's that's a separate organization from NRA right or is it affiliated or is there any relationship now just clarify\nNo relationship between the two I headed up the firearm\nLaws in your state or proposals in your state whether they are in the state house or on the ballot\nComments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org Richard by the way before we keep going we mentioned that you are a former lobbyist for the n._r._a. you're not president of a group called the independent firearm owners association\nFor those who may not have heard of it that's that's a separate organization from in RA right or is it affiliated or is there any relationship no just clarify\nNo relationship between the two I headed up the firearm industry's trade association during the Nineteen nineties\nGotcha okay thank you I just wanted to make sure we're kind of clear on on the the distinction between your organization and the and the n._r._a. Scott Greenberger I Wonder if we can talk a little bit more about red flag laws and their impact the Jerry Brown the governor of California the outgoing four term governor of California\nJust vetoed a bill that would have expanded that states red flag law Jerry Brown is a Democrat very progressive but also thoroughly pragmatic and has pushed back on Democrats get an array of ways so this is an unprecedented in terms of\nHim vetoing something the Democrats would have wanted but what do you make of the veto\nWell a ... you know California of course is a very blue state of progressive state and already had um\nA a relatively speaking a pretty strong gun control laws in place so I'm Jerry Brown has a government as a a pragmatic a liberal and progressive and so um [noise]\nUh you know in this case he felt like it perhaps you know with some of the concerns that ah Richard raise that uh it went a little too too far um and a richer note it's a question of a balance but I Would add also I think it's interesting that generally speaking\nA that a lot of the debate um post a Parkland has focused on a these so called red flag laws or I'm\nA limiting the gun access to guns for people a domestic abusers you know the argument or the ... argument for for such a long time was that a guns don't kill people people kill people and it seems that now rather than\nTrying to revive or for example on assault weapons ban uh the assault weapons ban from the nineties\nOr people who are in favor of more um uh safeguards gun control are pushed\nJust on a these so called red flag laws or I'm\nA limiting the gun access to guns for people a domestic abusers you know the argument or the ... argument for for such a long time was that a guns don't kill people people kill people and it seems that now rather than\nTrying to revive a for example on assault weapons ban uh the assault weapons ban from the nineties\nOr people who are in favor of more um uh safeguards gun control are pushing on red flag laws are they're pushing on background checks and it seems like that's a potential uh common ground between people who are\nA very strongly support their Second Amendment or what they view as their Second Amendment gun rights and and folks who would like a um some more controls and safeguards speaking\nOf the ... are a governor Larry Hogan of Maryland who's a Republican had an a minus rating from the national Rifle Association here he is endorsing a red flag law in this February\nI've said for years that we need to do more\nTo keep guns out of the hands of the mentally ill\nAnd people with criminal backgrounds\nThat's why we will push for and support what is known as red flag legislation in general this policy would allow family members for law enforcement to petition the court for a lethal violence protective order issued by a judge which would prohibit an individual\nFrom having any firearms or ammunition if the judge has clear evidence that the family member poses a an immediate and present danger\nUm ah causing injury to themselves or to others [noise] individuals with\nA mental illness should not have access to fire on various\nThat is Republican governor Larry Hogan of Maryland worth noting that his a minus rating from the n._r._a. dropped to a seat as a result of his support of these kinds of red flag laws Chris I Wonder what impact do you think\nThat that kind of influence would have on more states passing these kinds of extreme risk laws\nI think it has a positive impact absolutely a and I think governor Hogan actually there eh eh he's doing the right thing and be you know he's a politician he has to be aware that that has an impact on his NRA rating it has an impact on that rating that brand\nAlready dropped to ... feet as a result of shoe support of these kinds of red flag laws Chris I Wonder what impact do you think that that kind of influence would have on more states passing these kinds of extreme risk laws\nI think it has a positive impact absolutely a and I think governor Hogan actually there is a he was doing the right thing and be you know he's a politician he has to be aware that that has an impact\nOn his NRA rating it has an impact on the rating the Brady give some as well and I think it relates back to the initial point\nThat I made that is part post Parkland really there is a groundswell of activism on this issue a huge new slate of polls that have been taken\nWhich show in every state across this country a vast majority well over fifty percent normally in the seventies a supporting exactly these kinds of measures\nThey're sensible measures they're pragmatic measures and they balance appropriately uh the you know the second Amendment rights of of gun owners with uh the idea that we all want to be safe in our communities one of the most heartbreaking components of my job\nIs getting polling data back and focus group information that really yields two different things and I think it's really important to think about these laws in this context first\nAmericans overall when they ask about their fear associated with being shot one of the most profound quotes I got back from a recent poll is well most people think I have not been shot yet\nAnd and that is a very concerning thing the second is many Americans are actually ashamed\nAbout the epidemic of gun violence in this country and they want pragmatic solutions so I certainly applaud governor Hogan for doing the right thing here but I think he like many politicians are looking at what their constituents want\nAnd moving forward knowing that these are popular and populist positions to take\nIncrease in terms of the pragmatic argument but you know when it comes to gun laws their constituents in their constituents I mean blood is a good example of that I mean Vermont yes was one of the states to ban bump stocks as part of a larger package of legislation on guns this year back in April for months\nSame here but I think he like many politicians are looking at what their constituents want and moving forward knowing that these are popular and populist positions to take\nMy here you Chris in terms of the pragmatic argument but you know when it comes to gun laws their constituents and then their constituents I mean Vermont is a good example of that I mean Vermont yes was one of the states that band bump stocks as part of a larger package of legislation on guns this year back in April Vermont's governor Phil Scott who was a Republican who had an a rating from the n._r._a.\nSigned these laws into these bills into law\nNobody's got said he changed his mind about them after police\nFoiled and alleged shooter's plans to storm a local high school and basically kill as many people as possible now here is some of the sound from the signing ceremony as he was signing outside the Vermont state house he was being heckled by opponents to gun restrictions listen\nI support the second amendment [noise]\nAre we doing everything we can to make our kids in our community safe [noise] got a point where our kids are afraid to go to school and parents are afraid to put\nThem on a bus [noise] or police\nDon't have the tools they need to protect victims of violence or families can step in to prevent\nA loved one per day [noise] and [noise]\nPart of the signing ceremony on the steps of the Vermont state house with Vermont governor Phil Scott who is a Republican Richard Feldman filled in when you hear that moment from the signing ceremony ... what does that tell you about the the nature of this debate in states across the country\nI'm\nA lifetime law and no experience gained in my mind I'm thirty three years old when on people I'm Seventy seven you went in June to Tunisia you come out and do the same age but a different\nLife after prison with a look at seniors entering society decade after leaving in that next time on the take away from WNYC NPR I had to\nTake away today to Lebanon am on Ninety One point five to your cc southern Colorado's NPR station\nHey everybody that this ... this is Chris ... hello\n[noise] a lifetime law and no experience game\nIn my mind I'm thirty three years old when on people I'm Seventy seven you winning Janet nice you come out and use the same age but a different number\nLife after prison with a look at seniors entering society decade after leaving it that's next time on the take away from WNYC NPR I\nTake away today to Lebanon am on Ninety One point five K. or CC's southern Colorado's NPR station\nHey everybody this is really fast and this is Krista hello this is Michael from spirit in Ninety One point five K. I. C. the music seven ... seven Ninety three\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five ... summit club members who have dedicated twelve hundred dollars or more in support of our award winning coverage of life in southern Colorado information about joining the summit club or kill your CBC dot or\nSupport for NPR comes from this station and from progressive insurance offering a way to buy a home insurance with their home quote explorer tool custom quotes and rates are available online learn more at progressive dot com or one eight hundred progressive now that it's progressive\nAnd from at lassie and a collaboration software company powering teams around the world committed to providing the tools and practices to help teams playing track build and work better together more at at ... dot com\nOr series the state we're in continues next Monday we'll ... we'll dive into trends on new state election laws for redistricting proposals to voting rights what's happening now in your state on redistricting reforms are voting rights on the ballot this November\nIf so leave us a voicemail eight five five to three six one a one a what's being debated in your state house on voter rights and redistricting do you feel like these proposed changes could make for a fair election or not\nTell us your story eight five five to three six one a one a or use our app one a vox pop to send us a radio quality audio file and to keep up to date on future topics will share some of your stories next Monday when our series the state we're in continues here on one day\nBack now to our conversation with Richard Feldman Chris Brown and Scott Greenberg or a few more different kinds of laws that we should touch on before our time is up we should talk\nDo you feel like these proposed changes could make for a fair election or not\nTell us your story eight five five to three six one a one a or use our app won a vox pop to send us a radio quality audio file and to keep up to date on future topics will share some of your stories next Monday when our series the state we're in continues here on one day\nBack now to our conversation with Richard Feldman Chris Brown and Scott Greenberg or a few more different kinds of laws that we should touch on before our time is up\nWe should talk about the minimum age to purchasing long guns and rifles four states California Hawaii Illinois and Florida passed new laws that would raise the minimum age from Eighteen to Twenty one uh Florida State representative who ... who was a Republican\nSponsored new legislation on new gun control after the shooting in Parkland, Florida he had an eighth grade from the n._r._a.\nSerious speaking on WFL our TV in Miami about why he agreed to raise the legal age this is an edited version of his interview\nA determining what age someone can do something is a judgment call and we do it in in many areas of our of our law making and so I think it was for that on was the fact that you had an Eighteen year old a who did purchase his wife and I think I think without that particular fact he probably wouldn't have seen that\n[noise] what about law abiding Floridians who are Eighteen Nineteen Twenty years old some of whom have gone and served our country and fought for our country overseas what are you say to those who feel like their Second Amendment rights are being friends with\nParticularly that group of people that you mentioned are covered in them off so if you have if you're a correctional officer if you're a parole officer if you're a law enforcement officer or or you served in the military society has already said that you're trained and can carry a firearm so this bill would not unfair that even if those agents\nThat state rep ... in Florida Republican state rep speaking to us for TV in Miami Chris I Wonder how you think it will play out with this law particularly because the n._r._a. is challenging it in court\nYeah stand are as challenging it in court I think a Marion Hammer has done a very effective lobbyists there for the\nNRA for a long time um had as suit filed within twenty four hours of that measure passing I think that it will certainly less than judicial scrutiny from our interview 'em and be upheld and I think it's a natural reaction to that are now\nFor TV in Miami Chris I Wonder how you think it will play out with this law particularly because the n._r._a. is challenging it in court\nYes than our as challenging it in court I think I'm Marion Hammer has been a very effective lobbyists there for the\nNRA for a long time um had a suit filed within twenty four hours of the measure passing\nI think that it will certainly withstand judicial scrutiny from our interview 'em and be upheld and I think it's a natural reaction to the a mass shooting involving you know that are often\nUm with schools individuals who are within that timeframe of Eighteen to Twenty one uh and I will note that Florida passed a package of laws at the minimum age being one all of which were\nA really designed to address the that type of issues that we saw\nA from Parkland at the age of the shooter obviously the fact that this weapon was actually kept in the home where he stayed on secured\nAnd that's why the extreme risk laws so important so we're seeing these kinds of package bills ah reviewed and introduced that the most notable point for me is it passed in the state of Florida\nThreat has long been one of the strongest a sort of ... of the ... legislative agenda and I think it's very telling\nOn obviously the reactions of Parkland and that the activism that took place immediately following a the Parkland shooting\nI Would like to come back to safe storage and the moment but by the way we did a program when we visited Salt Lake city\nAbout guns in the mountain west states and and the nature of gun suicide in the mountain west in which\nA state representative who joined us showed us one of these safe storage lockers it does open with your fingerprints I tried it it it works it's it's pretty fascinating you can find the conversation on line at our website the one a dot org before we move on to other kinds of gun legislation Richard Feldman because I just get your sense in terms of\nThe un or raise real view on gun legislation the injury has said that so measures like bump stock restrictions could be examined maybe through the administration's authority on a federal level rather than the state level\nOr we just shooting ourselves here should we just come out and just see the IRA is not in favor of any new gun legislation\nYou can find that conversation on line at our website the one a dot org before we move on to other kinds of gun legislation Richard Feldman because I just get your sense in terms of\nThe ... real view on gun legislation DNA has said that some measures like bump stock restrictions could be examined maybe through the administration's authority on a federal level rather than the state level\nOr we just kidding ourselves here should we just come out and just say the n._r._a. is not in favor of any new gun legislation that can be passed on a bipartisan basis are we trying to make the n._r._a. more ten fifth wheel and more collaborative than it really is\nWell first let's define something I'm always a little bit of a loss to understand when people talk about the n._r._a.\nHarmon endowment number the n._r._a. there five million NRA members um there's the board of directors there's the senior leadership there that can psalms there are many and our race\nThere's my uncle was a card carrying life member of the IRA and we'll show you his card on demand if you ask with great pride\nHas so many will myself included um but I I I think we're talking about the senior leadership\nOf NRA here and um again when I said earlier an array finds itself institutionally boxed in a corner of if you're calling it gun control no matter what it is it could mandate\nThat ah when you turn Twenty one you're given a gun they're almost institutionally has to be against it because of the terminology in the political position of the terms gun control\nThey don't mean what we sometimes think they mean are they mean different things to different people at different times but\nYou know what I mean I'm Talking about Wayne LaPierre Oliver North of the leadership of the national Rifle Association what we hear you know from the big ... the main figures who speak with a national voice for the n._r._a. it's the\nYou know the only thing that stops a bad guy with a gun is a good guy with a gun it's those ads within the last that say you know they are coming for our freedom and they use their media and the n._r._a. as you know ... you know liberties last safe place that NRA that's who I'm Talking about\nWhat you're talking about that's politics that's galvanizing the true believers\nPierre Oliver North of the leadership of the national Rifle Association what we hear you know from the big ... the main figures who speak with a national voice for the n._r._a. it's the\nYou know the only thing that stops a bad guy with a gun is a good guy with a gun it's those ads within the last that say you know they are coming for our freedom and they use their media and the n._r._a. as you know ... you know liberties last safe place that NRA that's who I'm Talking about\nWhat you're talking about that's politics\nThat's galvanizing the true believers that's about membership that's about fundraising that's about a organizing for the next a political event both sides do it and there's nothing unusual about that whether we're talking firearms or the environment\nOr any other hot button issues in America\nEverybody does it that way perhaps we see it a little more distinctly in the firearm debate than others on we've been put on that side Scott Y. disorder sides I wanted\nTo ah just ah to to add to that that you've seen on some of those issues issues you just mentioned in perhaps a we're going to begin to see it on gun control as well that in cases where state legislatures are gridlocked and the power of a [noise]\nUm the gun lobby is such that uh that lawmakers won't pass anything I'm a there is another outlet in many states and that's about initiative Washington state will have a ballot initiative in November that would raise the minimum age to buy a a\nSemi automatic rifle to Twenty one uh Oregon people in Oregon and supportive a similar measure came close to getting out on the ballot so we may see that I mean that's that was a pattern with the marijuana legalization for example so that that might be a that might be coming in the future", "year": "2018", "show_name": "1A Plus", "city": "Colorado Springs", "day": "01"}