{"month": "10", "state": "CO", "station": "KRCC", "content": "In Cleveland I made three miles from marketplace\nAnd in New York Times to prevent ashore with the marketplace morning report\nFor may PM American public media\nIn Cleveland I may dream up from working with\nAnd in New York I'm Sabrina shore with the marketplace morning record\nFor may PM American public media does America have a drinking problem my friends when I drank beer like beer beer sometimes probably at the ready beers\nWere talking about the culture around alcohol in this country and how your race and gender and background can all play a role in what's considered a normal amount to drink next time on the take away from WNYC NPR eyes [noise]\nAnd the takeaway gets underway in at eleven o'clock on Ninety One point five K. R. C. C. coming up it is NPR headline news followed by one Amy this is southern Colorado's NPR station a K. R. C. C. N. K. R. C. C. H. D. Colorado Springs ...\nCase CCS dark build and K W CCF ... park streaming at K. R. C. C. dot O. R. G.\nAgain NPR headline news is coming up next followed by one egg it's nine o'clock\nFifteen dollars an hour isn't over yet but this week it built a big blow to those you call it a job killer whales nowadays is really making money from WAMC you an NPR in Washington is ... [noise]\nHey there are times where like in for Joshua Johnson today on one day getting by on the bare minimum more big companies like Amazon are embracing a higher minimum wage\nMaybe they'd been shamed into paying their workers more ... just feed them mark of a ... for years critics warn that Fifteen dollars an hour would force firms to make fewer hires so what's changed and it twenty teens just how far does Fifteen really go\nWe love to hear from you are you making enough and just how much do you need to get by comments on our Facebook page or its we want to [noise]\n\nBig companies like Amazon or embracing a higher minimum wage\nMaybe they'd been shamed into paying their workers more for ... just feed the mark of a ... to ... for years critics warn that Fifteen dollars an hour would force firms to make fewer hires so what's changed and in twenty eight teams just how far does Fifteen really go\nWe love to hear from you are you making enough and just how much do you need to get by comments on our Facebook page or tweet us want to [noise]\n\nLive from NPR News in Washington I'm core of a Coleman President Trump is being criticized for mocking the woman who was alleged Supreme Court nominee Brett Kavanaugh sexually assaulted her when they were in high school\nMaine Republican Senator Susan Collins who is not decided whether to support Kavanaugh's nomination said Trump was quote just plain wrong when he made fun of Christine Blasey Ford at a political rally in Mississippi last night the crowd laughed and clapped\nNPR's Kelsey Snell says GOP leaders are seeking Collins support Republican\nLeaders are still trying to convince undecided Republicans and even some Democrats to vote for Kavanaugh and this kind of conversation is kind of the exact opposite of what they are trying to deal\nThe president has made clear that he takes this personally that he and he had a personal connection with allegations and he says what he believes to be false allegations of sexual misconduct\nAnd that is playing a role in the way that he's responding to all of this\nNPR's Kelsey Snell in\nIndonesia time is running out for earthquake and tsunami victims still buried under rebel Indonesian disaster officials have increased the death toll to more than fourteen hundred people Michael Sullivan reports on the rescue efforts\nA spokesman for the national disaster mitigation agency said in Jakarta than rescue workers have reached all four of the worst affected areas but he declined to give an estimate on casualties\nThree of the areas had been largely cut off since Friday by roads damaged by the earthquake landslides in down bridges\nOfficials say heavy equipment to clear the rubble are still in short supply and increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of ... new where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the non Vietnam\nTests done by the state of North Carolina show no environmental hazards in the ...\nSince Friday by roads damaged by the earthquake landslides and down bridges officials say heavy equipment to clear the rubble are still in short supply and increasingly desperate survivors are still waiting for food and water and medical supplies many still sleeping outside five days after the quake\nMost of the dead reported so far were found in the city of ... where nearly a dozen military flights carrying relief supplies landed Wednesday morning for NPR News I'm Michael Sullivan in the know Vietnam\nTests done by the state of North Carolina show no environmental hazards in the Neuse River this after Hurricane Florence and breached coal ash ponds operated buying Duke Energy Jason to ruin of member station WWNO UNC says that contradicts claims made by an environmental group\nThe department of environmental quality says their tests on the Neuse River showed new elevated levels of dangerous metals in the water while those results came as a relief to Duke Energy they are in direct conflict with tests taken by the water keeper alliance\nThe environmental advocacy group says the tests were done too late by the time regulators took samples ash had been diluted but ... secretary Michael Reagan is pushing back he says the state tests Smith the highest standards tests on the Cape Fear River are still pending\nFor NPR News I'm Jason to Berlin in Raleigh\nOn Wall street the Dow Jones industrial is are up one hundred thirty six points at twenty six thousand nine hundred ten the NASDAQ he's up more than fourteen\n[noise] this is NPR News\nThe White House's rejecting a detailed story published by the New York times that investigated President Trump's wealth the White House has the story is deeply inaccurate anti misleading attack\nThe report says it is based on a trove of documents including tax returns and other confidential documents from the state of President Trump's late father it alleges Trump and his siblings increased the wealth that they inherited through questionable financial actions\nMaker Tesla is reporting a sharp jumping the production of its model three electric cars NPR's Camila Domonoske has more\nThe model three is less pricey than the earlier Tesla's it's supposed to be a mass market electric car that from the start Tesla struggled to actually produce the vehicle and mass quantities\nThen the summer of founder and CEO Ilan mosque got in trouble for tweeting about taking the company private the federal government cried fraud and Musk agreed to step down as chairman of the board\nDespite the turmoil and the third quarter Tesla mates\nFinancial actions automaker Tesla is reporting a sharp jumping the production of its model three electric cars NPR's Camila Domonoske has more\nThe model three is less pricey than the earlier Tesla's it's supposed to be a mass market electric car\nThat from the start Tesla struggled to actually produce the vehicle and mass quantities then this summer founder and CEO Ilan mosques got in trouble for tweeting about taking the company pride that the federal government cried fraud and must agreed to step down as chairman of the board\nDespite the turmoil and the third quarter Tesla made more than fifty three thousand model threes nearly twice the output in the second quarter in fact the company went from having a production problem to having a delivery problem with so many cars coming off the assembly line Tesla was struggling to get them out the door\nIt's still not clear if Tesla has started to turn a profit ... NPR News\nThe federal emergency management agency will conduct a nationwide emergency alert test today at two Eighteen pm eastern time millions of people will get this on their cell phones that means you will not be able to opt out of this and you will have to dismiss it from your cell phone or smart watch\nEncore of a Coleman NPR News\nSupport for NPR comes from and be used by over three million businesses for hiring or employers can post jobs and use greener questions to build their short list are preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\n[noise] mid term elections are coming up every vote matters that every day matters too can be hard to stay on top of it all things change fast when news breaks all things considered is on it\nAnd then we help you understand what it means for the nation for you\nListen to all things considered every afternoon if you're the bigger picture from NPR News [noise]\nAfternoons at three thirty Ninety One point five or so usually [noise]\n\n[noise]\nTo just want to act on Todd's willing in Washington filling in for Joshua Johnson here's the scene outside of an Amazon warehouse in California will take you there now jubilant yesterday after a major announcement [noise]\nThat would be hard\n\n\nThis is one eight on Todd's will like in Washington filling in for Joshua Johnson here's the scene outside of an Amazon warehouse in California will take you there now jubilant yesterday after a major announcement [noise]\nThat\nWould be hard to Amazon's senior vice president of operations informing the staff there that the online retail giant\nAh ... had a major change in policy minimum wage earners at Amazon now we'll see their pay jumped to Fifteen dollars an hour starting in November\nAnd this is a move that will increase wages up three hundred and fifty thousand people that's forty percent of Amazon's workforce Amazon is a leader in the business world one of the biggest companies in the world a trillion dollar market capitalization\nAnd it ... its motives will be something for us to discuss but can we expect other big corporations to follow suit\nGiven the size of Amazon's footprint in today's economy is Fifteen dollars an hour actually really enough to get by\nJoining me from Sacramento, California is Sean high tower a minimum wage worker and fight for Fifteen advocate\nUh Shaun welcome to one a thank you thank you for having me now is Sean you don't work at Amazon but your grass roots movement fight for Fifteen or started in twenty twelve I think can take quite a good deal of the credit for Amazon's decision here\nUh what was your reaction to Amazon announcement yesterday\nI was very excited when I seen it on the news yesterday morning um it's it's a milestone and I hope it sets a fire under some of the big lakes just an example that we need Fifteen dollars here also as fast food workers\nNow I Want to talk about Fifteen dollars and I want to talk about real life uh Shaun I'm you mention that you're a fast food workers you're a senior manager\nAt Burger King right yes ... and what is your hourly wage hourly I make it let them fifty an hour in benefits\nUm right now we do not have any benefits\nYou mentioned that you're a fast food workers your senior manager\nAt Burger King right yes ... ... and what is your hourly wage finally I make eleven fifty an hour in benefits\nUm right now we do not have any benefits\nAnd the ... guys when\nI'm Susan I live in Colorado Springs and I was okay I see see through yours the dog or words you've worked hard to imagine information\nJust as the case\nInto ten guys when\nI'm I live in Colorado Springs and I can see the ... award for hard to imagine information\nThis is the case for the Laurie cone charitable trust\nMy good friend Dr lord Cohen asked me to help finish some tests for her lawyers gift to the care cc legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... sea legacy fund can be found at our website ... seat died or G.\nMemberships or the largest source of funding at Ninety One point five K. R. C. C. allowing us to bring you local stories NPR News and music thanks for your generous support\nProgramming on Ninety One point five K. R. C. C. is supported by Jackson Greek senior living monument offering independent living assisted living memory care residents was designed for many lifestyle choices wellness programs tailored activities in more now scheduling tours more at Jackson creek senior living dot com\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at bona dot com\nAnd from ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations matinees him dot com slash NPR\nThis is one a on Todd's will again for Joshua Johnson we're talking about the minimum wage with Paul San Michael Saltsman and Sarah Anderson and we'd love to hear from you to share with you know do you earn the minimum wage right now how much of a difference would Fifteen dollars an hour make in your life\nComment on our Facebook page you can tweet us ... when a you can always email us at one a at W. A. M. U. dot org we've been hearing from so many of you Elizabeth tweets why is the minimum wage a specific him out\nFranchise locations matinees EM dot com slash NPR [noise]\nThis is one a on Todd's we're looking for Joshua Johnson we're talking about the minimum wage with Paul San Michael Saltsman and Sarah Anderson and we'd love to hear from you to share with you know do you earn the minimum wage right now how much of a difference would Fifteen dollars an hour make in your life\nComment on our Facebook page you can tweet us ... when a you can always email us ... won a at W. A. M. U. dot org we've been hearing from so many of you Elizabeth tweets why is the minimum wage a specific amount instead of a percentage tied to cost of living or some other figure measured\nAnd adjusted annually and we'll emails us from Cape Cod I have a small landscaping in gardening business with depending on the time of year six to ten employees all skilled gardeners\nI pay at least Eighteen dollars an hour and I support a higher minimum wage we're going to be talking about minimum wage and a living wage let's have Paul San I set the table for it's a little bit Paul the federal minimum wage\nIs just seven twenty five less than half of what Amazon is paying and what you can make in California starting in twenty twenty two hasn't been raised by Congress since two thousand and nine and its last ten percent of its purchasing power or even since two thousand nine how many states hew to the seven twenty five\nMinimum ... there are about Twenty one states where the uh minimum wage is just seven twenty five [noise] um and then there's another group of about eight states where it's boom wages is a little higher but still owe a nine dollars are lower\nUm but but uh the other ... you know there's the other Twenty one states have um a you know stopped waiting for Congress to act and have have raise the minimum wage including a whole cluster of them that are raising it significantly to the twelve to Fifteen dollars an hour range\nWhen is it the the key things on the minimum wage to understand is you know it's a it's been because of of the role of money in politics and you know the congressional Republican leaderships refusal to um to to to allow any action on it um\nIt's really become irrelevant at the federal level it's so low it's not doing its job to rate of raising pay\nAnd this is a real issue right now you know and it's a ... receiving increasing attention you know we're in a booming economy jobs are growing but there's almost no wage growth jobs are barely keeping up with rising the rising cost of living the one place where we're seeing wage growth for workers at the bottom are in those states that are raising the minimum wage and that\nThat actually speaks to the point the important point that mess\nIn politics and you know the congressional Republican leaderships refusal to um to to to allow any action on it um it's really become irrelevant at the federal level it's so low it's not doing its job to rate of raising pay\nAnd this is a real issue right now you know to get receiving increasing attention you know we're in a booming economy jobs are growing but there's almost no wage growth jobs are barely keeping up with rice the rising cost of living the one place where we're seeing wage growth for workers at the bottom are in those states that are raising the minimum wage and that\nThat actually speaks to the point the important point that Mr ... and the caller raised about hey you know if some companies are raising payment do we need a minimum wage\nBut the the data shows that while there are some leaders to really raise the floor and ... improve improve improve pay and our economy we need we need fair standards and the minimum wage has to be a lot higher and\nThe um you know things have gotten so out of whack that today close to one in three Americans\nAre earning less than Fifteen dollars an hour that some you know forty million workers the median age of thirty is thirty five\nYou know these are overwhelmingly adults who spend their careers in these jobs and it's you know it's it's not it's fast food but not just fast food jobs you know the jobs to make our economy run about you know one one for health care workers one in five educators you know\nHuge swaths of our economy of our workforce are stuck in these jobs paying less than Fifteen dollars an hour\nAnd ... I I think it says a lot when you say that the minimum wages as lay down by Congress has almost irrelevant to the real economy because seven dollars and twenty five cents [noise]\nJust doesn't go anywhere or in most states in most localities are and yet to have Congress advocating laws that are essentially irrelevant to how people really live\nA is a remarkable and and notable state of affairs necessary Europe proponent of a living wage and I and I read that tweet from one of our listeners who said why have a minimum wage why not index it essentially tour real life now what is the difference between a minimum wage and and what's become known as a living wage\nRight well MIT has a living wage calculator where you can go on there and type thing where you live and it'll be a lotta number that's based on looking at the\nCost of local transportation food housing and other basic needs I looked up on the city I live in that district of Columbia they said at the living wage there I was Seventeen dollars an hour but that's for a full time work\nAnd I want to point out that a huge ... additional problem in addition\nReal life now what is the difference between a minimum wage and and what's become known as a living wage\nRight well MIT has a living wage calculator where you can go on there and type in where you live and it'll be allowed in number that's based on looking at the\nCost of local transportation food housing and other basic needs I looked up on the city I live in the district of Columbia they said uh the living wage there was Seventeen dollars an hour but that's for full time work\nAnd I want to point out that a huge ... additional problem in addition to the low wages in this country is the increase in security of work how many people are working part time at Walmart it's half\nOf their employees are part time workers and then there's the temporary workers in the subcontracted workers you know Amazon Fifteen dollars an hour is not going to apply to their\nA contractor says the increase ... precarious ness of work that that's also a big problem eat despite are low unemployment we still have so many people working every day for poverty wages\nI'm Paul even though Fifteen dollars an hour is twice the current federal minimum as you mentioned we heard from a lot of listeners who say in this economic climate or even Fifteen doesn't go very far let's hear from some of them\nWhen all is higher than the minimum wage to try to make a better for workers but whenever I catch\nUp with a dog or whatever and the minimum wage that's never know\nAnd as a college graduate with a bachelor's degree and student loans I already make Fifteen dollars an hour at a fulltime job and have to supplement with at least one part time job at all times\nI think there needs to be some consideration on regional differences because I can assure you that Fifteen dollars an hour in South Carolina goes much further than Fifteen dollars an hour in California\nI work another job besides my full time job and uh so I Am kind of like we can buy but fortunately I have lots of credit card debt and the result and uh actually like Eighteen dollars an hour to twenty four a fulltime job would probably be closer to saving my but\nPaul we hear from a lot of one of the listeners there who were living on minimum wage and for many many more this has been a big issue in Congress or workers who work for big companies can't afford healthcare don't have insurance wind up relying on state or federal public assistance to make up the\nLike waking up fortunately I have a lot of credit card debt and the result and actually like Eighteen dollars going out at twenty for a full time job what I Believe that\n[noise] that Paul we hear from a lot of listeners there who are living on minimum wage and for many many more this has been a big issue in Congress a workers who work for big companies can't afford health care don't have insurance wind up relying on state or federal public assistance\nTo make up the difference and that suggests that all of us in some way are subsidizing low wages\nNow you're you're exactly right and and as or your callers I mean\nActually if you look at cost of living data you see that in all fifty states or a single worker will need at least Fifteen dollars an hour to cover the basics in just a couple of years\nAnd in the high cost states that your your your listeners were flogging or workers with children will need even more than Fifteen dollars an hour we have a report on our website by my uh pinto P. I. N. T. O. on this with the with the numbers for all fifty states and uh\nIt really highlights how Fifteen is really a basic national floor and we need to even go up from there like a you know you know in New York and New Jersey did this week we're airport workers are getting a raise to Nineteen dollars an hour\nIn hotel workers are are striking around the country in the higher costs cities demanding twenty five dollars an hour or so you know your workers or your your listeners are right about about about what you know as a practical matter if you do the math what what individuals need to to to get by especially in the higher cost regions\nAnd as a result you know a lot of ... of of companies big and small are relying on our taxpayer funded safety net for support you know more than a hundred and fifty billion dollars a year of safety net programs go to a workers in low paying jobs and you know these are good programs and we should have them but we need\nYou know major employers to do their part to pay a decent wage of at least Fifteen dollars an hour and then to supplement that with a with work supports in order to help bring bring workers up to a a basic level\nNow let's hear some of the other side of the Seth writes to us on Facebook when I worked for Walmart we were all excited when they raised our wages to ten dollars and fifty cents but then they cut ours to barely twenty hours a week then told us if we even had to have an open schedule we would get even less I'm skeptical of individual companies\nWith a with work supports in order to help bring\nBring workers up to a a basic level now let's hear some of the other side of the Seth writes to us on Facebook when I worked for Walmart we were all excited when they raised our wages to ten dollars and fifty cents\nWholesome necessary it's an extra hour and want to\n\nAlso necessary next hour I Want to\n[noise]\nIf you are looking for something to do in the Ninety One point five care cc listening area check out the community calendar link K. R. C. C. dot org G and you can submit your event there as well [noise]\nNinety One point five K. R. C. C. is dedicated to covering a changing southern Colorado your membership dollars directly find our local reporting thank you for your support\nProgramming on Ninety One point five K. or cc is supported\nBy forty five degree gallery celebrating art walk featuring winter green transfers by the late William ... and ... drawings by Patrick Carter knows this Friday five to eight at forty five degree gallery twenty ... twenty eight western Colorado\nWhether you CCS artist series featuring National Geographic libraries intrusions starting with NASA engineer Kobe Boykins and to look at the effort to explore Mars October twenty six that ends sooner for the arts UCS present start or\nSupport for NPR comes from this station and from bona with a bonus certified craftsmen program a network of hardwood flooring contractor is committed to expertise and the customer service contract to locate her and more information or Boehner dot com\nAnd from the Brown University school of professional studies with executive master's degrees for mid career professionals in the fields of business cyber security health care and science and technology leadership brown dot edu slash NPR\nLooking back to one a Todd's will lick with you today I'm\nSorry I ... I I Want to talk about a fight going on in Washington DC where we happen to be in a one eight studios at WAMC you enter the world [laughter] unfortunately increasingly so but there has been a very important wage fight going on on the local level not in Washington is a world knows it but D.C as locals know it\nUh there was a ballot initiative where voters in DC voted to raise the minimum wage for it\nBrown dot edu slash NPR\nLooking back to one a Todd's will lick with you today [noise] I'm Sorry I ...\nI Want to talk about a fight going on in Washington DC where we happened to be in the studios of WAMC you enter the world [laughter] unfortunately increasingly so but there has been a very important wage fight going on on the local level not in Washington is a world knows it but D.C as locals know\nThere was a ballot initiative where voters in DC voted to raise the minimum wage\nFor tipped workers a bar backs bartenders waiters and waitresses people who work in restaurants primarily\nAnd there was a big fight a lot of pushback it looks like grassroots resistance and then we found out that a lot of the money for the pushback was indeed coming from organizing interests for restaurant owners of the American restaurant association local chapters and others\nUm voters voted to say yes you have to raise your minimum wage restaurants bars\nAnd now the city council here in the district of Columbia has decided that voters were wrong and they are in the process of voting\nThis very day to overturn the will of local D.C voters on this issue or what does this fight here in D.C say about the state of wages especially for tipped workers people who might get paid by their employer I don't know five bucks an hour because they make up the rest in in ones and hopefully five ...\nThe way I see it this week the living wage movement to three or four steps forward with the Amazon announcement on Fifteen\nAnd they took one big step back with the DC Council voting to repeal um that the will of the voters to eliminate and in a gradual way this sub minimum wage for tipped workers\nI'm sad really than minimum wage protects workers is two dollars and Thirteen cents it's been stuck there for a couple of decades here in DC it's three dollars and eighty nine cents\nTechnically if you don't make enough tips to bring that a wage up to that the um the local minimum your employer is supposed to make up the difference\nThat pretty much never happens I used to work in the restaurant industry and I've talked to a lot of restaurant workers that pretty much never happens and so we have a workforce of restaurant servers primarily women many women of color\nOr at at jobs where people face ramping sexual harassment their ... because they're having to do whatever customers say to get those tips because without the tips there ...\nA wage up to that the um the local minimum your employer is supposed to make up the difference\nThat pretty much never happens I used to work in the restaurant industry and I've talked to a lot of restaurant workers that pretty much never happens and so we have a workforce of restaurant servers primarily women many women of color\nOr at at jobs where people face rampant sexual harassment they're vulnerable because they're having to do whatever customers say to get those tips because without the tips they're back down to really a A N E L a wage that doesn't amount to anything so\nPeople in the district um voted to get rid of this two tier system um the industry launched an incredible campaign against it they put posters up everywhere in the city saying save our tips to try to make people think that this had something to do with banning tips\nIt did not it was clearly be beyond a local issue this with the national showdown between the restaurant industry and people who are trying to get a fair wage for this vulnerable sector of the workforce\nA Michael Saltsman and what did you see at play here I think we're familiar with workers versus management in a fight like this uh the DC Council voting to overturn the will of the voters is is remarkable but what about the economics of it will actually\nI I think in this case you had a situation where the interest of workers and management were actually very clearly aligned I mean there was a sixteen hour hearing\nBefore the council voted on this this bill to repeal the initiative initiative Seventy seven I'm I was at the hearing I testified at two thirty in the morning it wait until three twenty in the morning um and the number of employees who showed up to say\nThis is going to be harmful to us you need to repeal this far out numbered those where they're supportive\nAnd I just want to take a step back to I mean it was mentioned earlier that a living wage in in DC is is is Seventeen dollars an hour I mean tipped employees in D.C\nAccording to the bureau of Labor Statistics earn with their tips about Eighteen Nineteen dollars an hour or so you have people who are already doing quite well and what happened a few years ago as a business and labor in DC came together\nAnd said okay we're we want to go to a Fifteen dollar minimum wage and regardless of what you think on the merits of that\nWe're also going to raise the tips may win among wage in that case up to about five dollars an hour and and they did that because they heard from tipped employees who said we want to keep the tip credit we want our tips to count as income\nThere was one group of New York based group called rock that didn't like that and so they they came in and they had a lot of money to come in to try and put this issue on the ballot and what happened was yes the restaurant industry\nTo go as a business and labor in DC came together and said okay we're we want to go to a Fifteen dollar minimum wage and regardless of what you think on the merits of that\nWe're also going to raise the tips may win among wage in that case up to about five dollars an hour and and they did that because they heard from tipped employees who said we want to keep the tip credit we want our tips to count as income\nThere was one group of New York based group called rock they didn't like that and so they they came in and they had a lot of money that come in to try and put this issue\nOn the ballot and what happened was yes the restaurant industry um was opposed this ballot measure but you had a massive grassroots outpouring from employees hundreds of who showed up for instance to an event with council chairman Phil Mendelson to say\nWe don't want this and I think it's part of a bigger movement of employees\nThat you say you say grass roots and I'm I'm sure that you're right but grass roots are astro turf we see so much grass roots in the area of wages and minimum wage is only to find out that the grassroots workers who are fighting against increases in wages are are backed by business interests so\nActually I I think it's I think that that talking point I think that's been used by proponents is is is a little bit um demeaning to the workers who who came forward um because the the testimony they gave it you know one forty five in the morning or the people who got up or at Franklin hall and said you know what this is going to be harmful to me this is going to be harmful to my industry\nDon't try and save me I'm not asking for it I mean I think that the the the notion I think that these people are just doing that um because they're sort of put up to enter somehow that they're not real employees\nUm I I think it's kind of insulting to what they're trying to do and it's still Mendelson that chairman Phil Mendelson to chair the DC Council made an interesting point um when he got to talk about this which is that he said\nI have heard from countless employees who tell me this is not good for them I have heard from almost nobody who wants who wants to keep it and he said people can come to me privately they can email me this is not an issue of their owners being intimidated\nHe said that the grassroots on this in support of it was silent he called them the silent grassroots and I think that's that's indicative of where the passion was on this issue let's pull back\nFrom the district the district of Columbia to local D.C back out to the nation at large in so many of you won a listeners\nHad been reaching out to us Nina posts on Facebook I'm In a precarious position if my wages go up I won't be eligible for Medicaid so it's a wash or worst for me we talked about free riders and how many workers who get minimum wage is wind up on public assistance\nAnd Randy in Tulsa emails advocates a correct Amazon Walmart McDonalds and the other giants can afford fifty\nHe called them the silent grassroots and I think that's that's indicative of where the passion was on this issue let's pull back from the district the district of Columbia the local D.C back out to the nation at large and so many of you want any listeners\nHad been reaching out to us Nina posts on Facebook arm and a precarious position if my wages go up I won't be eligible for Medicaid so it's a wash or worst for me we talked about free riders and how many workers who get minimum wages wind up on public assistance\nAnd Randy in Tulsa emails advocates are correct Amazon Walmart McDonalds and the other giants can afford Fifteen dollars for a minimum wage but the local donut shop the mom and pop floors those businesses will be hurt it's just another blow against main street\nNo sir I Want to talk to you about income inequality and wear a minimum wage fits into this we hear so much about the growing wealth gap in massive income inequality in this country we talk about the shrinking of the middle class but at the low end of the pay scale can increases in minimum wage actually provide\nAny real equity or is it just a drop in the bucket in a world where the top one percent on fifty percent\nIt's meaningful that in some ways it as a drop in the bucket you know a couple of years ago two of my colleagues calculated that three men three wealthiest men in America including Amazon CEO Jeff Bass though it's Warren Buffett and Bill Gates have combined wealth is greater than the combined wealth of the bottom half of the country\nAnd today that's an understatement because Jaffe as well as increased so much but nevertheless dramatize is just how extreme the wealth gap is and I think there's a lot of interest in\n'em adding to the fight for Fifteen efforts to look not just that the low end of the wage scale but also the top and what can we do to prevent the Israeli obscene levels of income and wealth concentration at the top that are so damaging to our economy our democracy\nNot to mention just a moral outrage and in a country that that is so wealthy\nAnd so I'm really excited about a new tool we have for doing this this year for the first time in history publicly held companies have to report the gap between their CEO and their worker pay\nMoral outrage and in a country that that is so wealthy\nAnd so I'm really excited about a new tool we have for doing this this year for the first time in history publicly held companies have to report the gap between their CEO and their work or pay\nAfter a sexual assault what is the way forward majority of jumped in\nOr whether they want to just met a guy a restored of justice approached a healing after sexual assault that next time on the takeaway from WNYC NPR I\nTake away today to Lebanon am on Ninety One point five gay or CC's southern Colorado's NPR\nStation NPR on Ninety One point five to your cc is supported locally by Ninety One point five to your cc members who continue to fund the news music and other quality programming that Ninety One point five years cc brings to southern Colorado and beyond that to your cc dot org thank you\nThis was southern Colorado's NPR station to your C C C C H ... Colorado Springs each cc law hunter tc of ... in K W CCF them woodland park's\nGot\nAngry and history tells us they now would be a good time to pay attention\nFrom WMU and NPR in Washington this is one a [noise]\nEither I Todd's will like infer Joshua Johnson today on one eight the power of anger\nWomen everywhere are ditching the advice to play nice instead they're getting mad and using their rage to make social and political change from the me too movement to a record number of female political candidates women are expressing their anger and making the world pay attention\nOr the rest of us ready to be on the receiving end of this regime we'd love to hear from you especially if you're a woman who's good and mad email one day at W. A. M. U. dot org you can always tweet us at one [noise]\n\nLive from NPR News in Washington I'm In er Johnston\nPresident Trump has taken to social media to push back against a scathing report published in the New York times NPR's Scott Horsley says the article reports that Trump and his family used to be it's game to evade taxes on hundreds of millions of dollars and inherited wealth\nThe New York times fourteen thousand word story was the product of more than a year of investigation it shows that despite his claim to be a self made billionaire President Trump was the beneficiary of a vast inherited fortune much of which was shielded from taxes through a variety of questionable schemes\nNew York taxing authorities say they're reviewing the articles findings in his tweet the president does\nIn New York taxing authority sort of air reviewing the articles findings in his tweets the president does not dispute any of the facts in the article book describes it as quote a very old boring and often told ... piece\nTrump complains the vast majority of newspapers coverage of his administration has been negative echoing a charge leveled by the White House press secretary Scott Horsley NPR News Washington\nIt's still unclear whether the Senate will vote this week to confirm Supreme Court nominee Brett Kavanaugh all the vote has been delayed pending the results of an ongoing FBI investigation into allegations of sexual misconduct against cabin all who denies the claims the agency is expected to release its findings by the end of the week\nThis year's Nobel Prize in chemistry has been awarded to Americans and a researcher and the United kingdom NPR's Nell Greenfieldboyce reports they won for using evolution to design new enzymes and medicines\nFrancis Arnold works at Cal Tech but early this morning she was in a hotel room in Dallas texas sound asleep\nAnd the phone rang and at first of course I thought it was one of my sons were the\nProblems nope it was the royals Swedish Academy of Sciences she'd been awarded half of the Nobel Prize in chemistry for pioneering the idea of using random changes to produce all kinds of new chemicals are enzymes so researchers can pick the best one for use in say an industrial process or a pharmaceutical\nShe shares the award with George Smith of the University of Missouri in Colombia and Gregory Winter at the end Marcy laboratory of molecular biology in the United kingdom now\nGreenfieldboyce NPR News\nIslamic state is claiming responsibility for a suicide bombing that targeted an election rally in Afghanistan NPR's ... date reports the attack killed at least Thirteen people and wounded more than two dozen\nIt was the first attack on an election rally since campaigning kicked off last week the parliamentary elections there widespread fear that this sort of violence could derail the process they seen as a dry run for the more important presidential elections next year and a test of the government's ability to provide security\nNPR's ... date reporting from Islamabad on Wall street the Dow was one hundred forty eight points\nThe NASDAQ up thirty eight this is NPR News\nBumpy and government has launched an oral vaccine campaign to contain a cholera outbreak the outbreak is centered in the capital Harare were ...\nGovernment has launched an oral vaccine campaign to contain a cholera outbreak the outbreak is centered in the capital Harare were ... people report\nHundreds of people received this posed a dose of the vaccine ... within six months that protects one against clarify view is Zimbabwe's Las ... break into those in aids\nClaimed more than four thousand lives the city's sewer and water systems are blamed for both outbreaks the new government sworn in in September just days after the latest outbreak began\nSees it was to be an issue of nobody dies of color again health minister orbit or more you\nWere really started you know we're already betting that by\nThe United nations is funding the bucks nations for NPR News I'm ... you know the\nFirst lady Melania Trump is continuing her multi nation African tour she visited a former slave holding facility on the coast of gun at today\nSo [noise]\nAnd it says Trump will also visit Kenya Malawi in Egypt with a focus on promoting health and education she's also set to promote her the best initiative which aims to tackle issues such as cyber bullying and boost healthy living she tweeted the campaign\nWhat's going international on Wall street the Dallas up one hundred forty eight points this is NPR News\nSupport for NPR comes from NPR stations other contributors include ISI MC foundation working to improve postsecondary educational outcomes for underserved students through evidence based innovation learn more at ease the emcee foundation dot org\n... king and you're listening to Ninety One point fine okay our\nSupport for the Ninety One point five years cc newsroom is provided in part by Ninety One point five to your cc members throughout our listening area thank you for your supportive southern Colorado's NPR station Ninety One point five years cc online at ... or gee\n\nThe online at ... dot org gee [noise]\n\n\nThis is one a montage were like sitting in for Joshua Johnson in Washington for generations men and women were fed the old saying sugar and spice and everything nice that's what little girls are made of really\nTelling\nWomen across America are angry and they're taking that anger to the streets and going further\nWe know record numbers of women this year are running for state and federal office and there's a lot to be mad about wage gap sexual harassment and violence condescension mockery\nAnd I'm like men women know there are risks to publicly expressing your anger or dissatisfaction with the status quo today we see you we hear you and we want to hear from you\nAnd you hear some of what you've already shared with us\nMy name is Cindy laying on my name is Danny ... Hi this is Julie from Louisville, Kentucky I Am in my mid ... and my entire life I've been told to act like a lady\nWhen I was growing up I was always taught to you know not not really a temper\nMy mother taught me never to be angry always be night didn't your sitting in the back not making a lot of noise\nIt taught me not to really deal with my emotions any kind of pushed me leave my anger and analyze it today as an adult\nI still struggle with expressing my anger and I cry\nI just think that there's a huge disparity between men and women feeling\nWe want to hear from you as we spend this hour looking at women's rage and anger in politics it at work and in the culture and we're lucky to have some fantastic gifts to help us discuss women's rage and anger in America today three prominent writers out with new books on this very topic\nHere with me in Studio is Rebecca Traister writer at large for New York magazine and the cut she's out with a brand new book good and mad the revolutionary power of women's anger she's also author of twenty sixteen book all the single ladies unmarried women and the rise of an independent nation\nRebecca Traister it's great to have you know it's wonderful to be here thank you for being here and from an NPR studio in New York is ... she's director of the women's media center speech project she's author of the new book rage becomes or the ...\nAnd from an NPR studio in New York is ... she's director of the women's media center speech project she's author of the new book\nReached becomes or the power of women's anger hello Shariah Hi Todd and joining from Piscataway New Jersey is Brittany Cooper Brittany Cooper is associate professor of women's and gender studies and Africana studies at Rutgers University she is out with a new book\nProgramming on Ninety One point five K. R. C. C. is supported by the cultural office of the pikes peak region inviting listeners who celebrate arts month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nBar squash blossom October's art walk features oil painters ... and Jean coach hero an artist in ... with social friday five to eight PM the squash blossom located at twenty six been Colorado avenue\nBy Ninety One point five or so you see underwriters who realized the benefit of reaching Ninety One point five to your cc listeners for more info on your business underwriting was kill your cc called seven one nine four seven three for eight zero one\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learned more Raymond James dot\nCom and from bona\nWith a bona certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service\nContractor locate her and more information or at bona dot com [noise]\nIs one eight I'm Todd's will like sitting in for Joshua Johnson we're talking about women's anger and taking it seriously with ... director of the women's media center speech project an author of the new book rage become served Brittany Cooper associate professor at Rutgers University and author of the new work eloquent rage\nAnd in the studio Rebecca Traister writer of writer in New York magazine and the cut and author of good and bad we want to hear from you to do you think right now is a moment in us history for women expressing themselves in the ...\nAnd author of good and bad we want to hear from you to do you think right now is a moment in us history for women expressing themselves in the form of rage and anger you can comment on our Facebook page you can tweet us ... when a\nYou can always email us one a at W. A. M. U. dot org and we had been hearing from so many of you want to listeners primarily women\nBut not exclusively Petra emailed to say I am so tired of people equating my anger within sanity\nFriends laugh at my posted insinuate that I've lost it and you know what I have I have lost my inability to be quiet in the face of gross injustice\nAnd Joan emailed us I'm sixty five and I was in college with the first feminist resurgence is the world the usa ready for women's anger that's like asking African Americans when will the world be ready for their anger the answer never\nPower doesn't seed without a fight don't even ask the question the question itself\nIs demanding and peg in Traverse City emailed this on a conservative woman that is angry that someone can be assumed guilty based on unproven allegations I'm angry at the assumption that all American women or antique having a pro choice liberal and progressive I'm a proud American woman who's also conservative pro life pro Cavanaugh\nI Am an American woman to\nNow Rebecca Traister you started to paint a picture of the history of women who've gotten angry and made their mark their anger is not always shown in the same form as somebody yelling in the face of a senator like Jeff Flake on live TV but anger nonetheless and Brittany Cooper you've written a book\nAbout finding your power in rage uh tell me a little bit about that theme and how this story fits into the moment\n[noise] a shore so part of what happens is that women are told as many of your listeners say that to be angry it to be irrational\nUm and I had a student when I was a graduate instructor confront me um and said to me that she loved to listen to me lecture because my lectures were filled with what she called the most eloquent rage ever and it was a wake up call for me as someone who had run away from the angry black woman stereotype my whole life\nBecause I didn't want to be discredited as a black woman moving through predominantly white institutions\nAnd so my student who was a young black woman and me a kind of authenticity and she helped me to realize that my anger wasn't keeping me from doing my job are showing up offering quality lectures are material or material but then it was actually helping me to do it better\nWasn't keeping me from doing my job or showing up are offering\nQuality lectures are material or material but that it was actually helping me to do a better job and so in that moment I made a connection that I've been encouraging other women to make which is ... knowledge that we have the right to our rage and some reject ideas that say that when we're angry about legitimate injustices\nThat this in some way make the irrational or makes are clean illegitimate and when we then begin to own that anger doesn't mean that we would come destructive or harmful it means that we happened to the energy and power and we start to use that energy and power to build the kind of world we want to see\nA and more women need to give themselves permission to do that\nI've given myself permission to do that I'm at in this moment I Am on the front lines of saying women outrage have the potential if we own it and if we don't apologize for\nUs to change that very scary a trajectory of this historical moment we have a lot to be afraid about\nOr we have a lot to be angry about opposite that anger in the catalyst for being able to do something about the things we see\nNow let's move from the Senate committee hearing room\nIn the hallways around the Senate um and even the books that are esteemed authors have written onto the tennis court and the U.S open for another moment that American shared within the last couple of weeks\nSerena Williams in her match against Naomi Osaka at the U. S. open here's a cut I'll bring you back there to refresher memory of anger on the court Serena Williams infamous exchange with umpire Carlos Ramos\n[noise]\nSuresh I'm Shawnee you shared this moment along with the rest of America a ... is a champion and one of the most famous black women in America somebody who got angry and somebody found who found that anger a weaponized against her\nAh yes I think that what we saw in their response was everything that Britain in Tribeca and I have been talking about it was interesting because\nThere are so many egregious examples of men behaving in the same way but not facing the same policing or penalties mean she she was a defined that was levied against her is the highest ever for verbal abuse in the history of the u._s. open I Believe and so\n... I mean she she was a defined that was levied against her is the highest ever for verbal abuse in the history of the U. S. open I Believe\nAnd so in that moment there were two very distinct responses of the responses of the people that really just wanted to see her in isolation acting\nOn it and this exchange with this man but then there were people who really looked at that exchange within the much broader context of\nThe power dynamics and the moment in the history in the context and the legacy of discrimination within the sport that she has faced\nAnd so I think that one thing that has been unexplored in the bigger conversation about that is the central and pivotal role of title nine in understanding women as\nLeaders or as people who have the right to defend themselves or engage in public conflict um what she was really doing was I'm asserting her right to defend herself and to have dignity in the moment\nBe accused the way that she was accused and with sports I think it's important to note that we now have not one but two generations of women so a generation of role models who have benefited from title nine and the lessons of title nine which we tend to think of it as\nA athletics but it is really about leadership and the ability to act together um in teams to manage conflict to make the nuance distinctions between being assertive and being aggression and be aggressive and being angry\nI think we're seeing the ... of of that now in our political live there\nWere some pushback though to Serena Williams behavior on the court and the reaction to it even from within the tennis world a Brittany Cooper I don't know if you saw Martina Navratilova was response to this arena Williams episode a couple of days later but she wrote an op ed after the U.S open and she said Martina speaking now\nSaid yes women are treated differently yes there are double standards but Serino was wrong her encore behavior was inappropriate paraphrasing just because men raging umpires and act like babies on the court doesn't make it right and a champion Serena should not emulated\nI'm Martina Navratilova was wrong or she did this thing that women are conditioned to do which is rather than use it as a moment of solidarity she tried police arena conduct as a lifelong tennis fan\nWhich is rather than use it as a moment of solidarity\nShe tried to police arenas conduct I'm as a lifelong tennis fan I'm I Am livid but Martina Navratilova reminded me that up until this moment most white women in tennis have not been allies of the Williams sisters\nUm do when I watch tennis with my friends were African American tennis fan we often talk about watching these matches on you because of the micro aggressions that come from white women who are often knocking at the Williams sisters and having things to say but let me also add\nThat one of the things that was most infuriating about watching the way in which Ramos treated Serena ... there was a broader context to her anger\nOnly did he accused her of cheating but this also came out on the heels of reports that members of the u._s. TA had been showing up to her house\nUnannounced and testing her over and over again on grounds that maybe she was doping even though she has come clean on every drug tested even those statistics show that they were testing her double the amount that they were testing any other players on the women's side and so she had been subjected to repeated indignity\nTalking about the culture around alcohol in this country and how your race and gender and background in all play a role in what's considered a normal amount to drink tap next time on the take away from WNYC NPR I [noise]\nThink away today the Lebanon am on Ninety One point five to your see see\nWhy there was this was my little to the beach fluid by this is John from your water the dominant wallet from the motion\nMusic WGN didn't need now you find any one point five K. R. T. V.\nProgramming on Ninety One point five three or so you see is supported by distillery to Ninety One a small but actually still remaking whiskey in the foothills of the Rocky Mountains and founded package stores throughout Colorado open Wednesday through Sunday would live blues Wednesday night distillery to Ninety One sixteen forty seven throughout during\nSupport for NPR comes from the station and from the main office of tourism offering traveled there is an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\nAnd from Newman's Own foundation working to nourish the common good buy donuts\nAnd be yourself at visit main dot com\nAnd from Newman's Own foundation working to nourish the common good by donating all profits from Newman's Own food products to charitable organizations that seek to make the world a better place more information is available at Newman's Own foundation dot org\n[noise] on the odds were like sitting in for Joshua Johnson we're talking about the power of women's anger in the current moment in America\nWhere I'm Talking with Rebecca Traister for New York magazine and the ... author of good and mad Britney Cooper associate professor at Rutgers University and author of the new book eloquent rage\nAnd also ... director of the women's media center speech project and author of the new book rage becomes her\nNow I read an email from Karen at the end of the last segment said she was hurt disappointed and angry wounded about the treatment of Hillary Clinton into twenty sixteen campaign and I want to go there because Hillary Clinton is one prominent famous\nWoman well known for navigating the shoals at how women are supposed to express themselves in public now Hillary Clinton has a history of being\nVery careful and very deliberate mindful of appearing angry or emotional she's been at it for thirty five years in America and in fact it was news in the two thousand and eight campaign I remember this when she shed a tear in New Hampshire one tier and it was at the top of CNN for like a new cycle and a half\nSo now a lot of people are saying that the twenty sixteen presidential campaign I'm Hillary Clinton in fact was was tone police listen\nI regret deeply\nHow angry tone of the campaign became [noise]\n\nNot your fault says one audience member when when Hillary Clinton very deliberately in that in Hillary fashion\nSays I regret how nasty the campaign became I'm ... I'm only does this moment has clearly struck a chord Rebecca Traister who's laughing here in the studio with me but how does that strike you [laughter] so she was ... that she was she was very very careful in her choice of words there to even as she was commenting on it I mean\nI think it was um it was ridiculous that this woman was called an authentic while being held to the standard of care full control in her voice and her facial the parents and her body\nThis woman was called inauthentic well being held to the standard\nOf care full control in her voice and her facial of parents and her body\nAnd her motive expression I mean the two candidates um that were her primary\nOpponents for Donald Trump and Bernie Sanders could act in unhinged ways they could show up looking unkempt they could pound ...\nYou know they could turn red in the face and as men they could leverage this enormous tide of populist anger and that was a gender card nobody wrote about that as a gender card right there were all of these conversations about\nI'm Hillary Clinton as there often are with women because we associate gender with women and pretend men don't have a gender\nUm and and so they could do that and she couldn't leverage that political power and we saw that over and over and over again throughout the campaign\nRecord ... is so right about this and I'm In fact the thing that the irony of what we were told about Hillary Clinton both Bernie Sanders and Donald Trump or congratulated by the political pressed for their particular skill and channeling the anger of their supporters this was their gift\nThey were able to give voice to this frustration\nAnd we were repeatedly told that some of the authenticity of Hillary was that she couldn't convey anger and passion and yet\nEvery time she spoke too close to a microphone somebody said you're yelling your shrill um she really got directives at one point Joe Scarborough she was giving an ... a speech the night she won a primary and Joe Scarborough said smile is if it was like some catch cholera on the street smile more um she was told that regularly\nAnd I think that that's again an example of of not having that tool to wield she also has done remarkable writing and talking herself\nIn instances where I've interviewed her and she's written about it in our own memoir of the campaign about the process of not using that anger she writes particularly about that second debate where Donald Trump came up behind her and kind of loomed behind her\nAnd how menacing an aggressive his body language was and how during\nThe debate a presidential debate she was doing internal calculations thinking can I turn around and confront this guy she said she thought about turning around and saying get away from me but then she was thinking no no no\nThat's gonna redound negatively to me that's gonna make me look bad it's gonna hurt me strategically and the debate and so she didn't and one of the things that that little story tells us is about how\nIt's going to make me look bad it's gonna hurt me strategically and the debate and so she didn't and one of the things that that little story tells us about\nHow much energy women expend\nModulating considering strategizing thinking tactically about how to use their voice how to suppress their voice how to channel their anger how to swallow their anger what to do in order to be rhetorically effective\nAnd and I think that that's something that that all three of us are writing about and thinking about is the amount of time and energy women spend doing this kind of maneuvering around the rules around are angry expression snow\nI Want to I Want to talk a little bit in the last\n... section of the show that we have about where some of this anger goes because this is a moment in America and let's be realistic moments have a way of fading they just do and and so I'm interested in where this goes when\nThe cameras in all of the writers who aren't Rebecca Traister and Brittany Cooper are are not as interested anymore you know in in a couple of years I think that might happen and I want to know where this goes now we've been hearing from so many want listeners I Want to play you another mash up of some of the women's voices who've been reaching out to us about how they're feeling\nMy name's Aaron I'm calling from Lancaster, Pennsylvania this is Sarah from Cincinnati\nWhen I let my anger bubble over and I get really angry out loud it it really doesn't do much good I find that if I express a strong opinion or even just a bit of discomfort with something I'm perceived as being angry are overreacting women yelling even in this day and age that very acceptable men don't seem to have that same problem and I'm\nStarting to feel like maybe it's not just a personal issue I'm dealing with with a call to be nice and and uh and keep our mouth shut however\nI Am so angry and so angry right now maybe women all over the place you're dealing with it I'm turning my anger into action given help but feel like I'm not alone but still pretty discouraging I think that but when that have to do we have to take that anger hold onto it and that's how we're going to take back this country\nWe're hearing from listeners women who it feels like there's a theme there are transferring\nSome of their personal rage I'm sure a lot of it's in in personal life not just political life or cultural life put into action taking action industries taking action maybe at the ballot box we got\nThis tweet from Tracy in Jacksonville I'm One of the thousands of women using their frustration to run for office I'm running for the Florida House district Fifteen I Am focused on my determination to be a voice for all\nUsing their frustration to run for office I'm running for the Florida House district Fifteen I Am focused on\nMy determination to be a voice for all and focus on issues important to Jacksonville families Tracey as one candidate who says that this moment of anger is very important for her motivation a Brittany Cooper I Want to talk about where\nThis goes in terms of maybe the midterms that might be the most immediate effect I\nNone of us knows exactly how that vote is going to turn out but it seems like any\nPollster or political analyst worth anything is looking down and what they call the cross tabs and noticing a that women are mad women are going to vote and women are going to form a title even twenty Eighteen one way or the other\nAbsolutely and that is as it should be um I'm particularly heartened by the Stacey Abrams campaign down in Georgia we have the opportunity to have the first black woman\nGovernor of a state of a former slave state um the ... Presley campaign they're all of these progressive campaigns that are being run and here's the thing\nWe've been seeing that since twenty sixteen we had a wave of a progressive as sort of radically progressive black mayors in the deep south and so one of the things that I Want to challenge folks to do as we think in this moment is to actually look at what people of color are doing not just women\nBut particularly black women in these elections the ways that we have that channeling our anger\nOn for decades and decades and that started with the way that we voted for Hillary Clinton in this most immediate political moment\nUm but to your earlier point about whether or not our anger can be sustained um I think that I think that this can be sustained I think that we have to remember that the women's movement in this country do it goes through ebbs and flows that's really been a solid political project", "show_name": "1A Plus", "year": "2018", "city": "Colorado Springs", "day": "03"}