{"month": "10", "state": "CO", "station": "KRCC", "content": "It's too small to doesn't fit any more\nAn old film pushes back against the one dimension analogy that black filmmakers have been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nHave to take away is at eleven o'clock hope you can join us for that program this is southern Colorado's NPR station K. R. C. C. K. R. C. C. H. D. Colorado Springs Kate ISI the law hunter Casey cs stark bill and K W CCF than woodland park streaming at K. R. C. D. done or warranty\nTemperatures will top out in the fifties and sixties today across the region partly cloudy skies expected looks like it will be clear and warm for your friday and through the weekend headline news is coming up next followed by one a\nIt's nine o'clock\nAnd image that helps him win the presidency [noise] how does that image match up with the facts and what impact might that have\nFrom WAMC you an NPR News one day [noise]\nNeither Joshua Johnson visiting Georgia Public broadcasting in Atlanta today on one a Trump's taxes the president has refused to release his income tax returns\nNow an extensive New York times investigation of his family's taxes suggest that he and his father manufactured ... image and doing so may have started tax laws were broken were also\nTaxes suggests that he and his father manufactured that self made image and doing so may have skirted tax laws were broken\nWill also watching the investigation into suspicious packages center prominent figures across the country lots to get you including your questions about the times investigation so comments on our Facebook page or tweet us ... won a [noise]\nLive from NPR News in Washington on the\nLine from NPR News in Washington I'm core of a ... at least three more suspicious devices have been discovered today that are similar to those that were sent democratic officials and activists this week\nTwo packages were addressed to former vice president Joe Biden they turned up in the Delaware postal facility the third was sent a liberal activist and actor Robert Deniro New York city Mayor Bill de Blasio told CNN Today that package was found early this morning in lower Manhattan\nWhat we have to recognize is we should expect more of these in the meantime so yes this morning Robert De Niro his office a thank God because of an eagle eye security employee or no one was hurt or the device was removed successfully by the NYPD\nAt least ten suspicious packages have now been sent some of the people addressed her former president Brock Obama and former secretary of State Hillary Clinton\nPresident Trump is calling for civility in light of pipe bombs being sent to his political enemies but as NPR's Tamara Keith reports Trump is not let up on his attacks on the media\nPresident Trump told a rally crowd he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media\nQuote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media that I referred to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages responded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care of CNN\nAnd networks Trump frequently attacks camera Keith NPR News Boston\nHas taken game to the world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers four to two last night from member station WBUR\nThe world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers four to two last night from member station WVU are Shira Springer says Boston hold the two games to none lead\nThe games big hit was a single to right field by the red Sox JD Martinez they hit with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless off and\nHe preached to preview examples on ... on and just keeping them\nMeanwhile on the mound Red Sox started David Price got the when he granted his way out of the bases loaded jam and the fourth and pitch six solid innings allowing only two runs on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Shira Springer in Boston\nOn Wall street the Dow Jones industrial are up two hundred fifty six points or more than one percent the NASDAQ is up one hundred sixty points or more than two percent you're listening to NPR\nCIA director Gina Haspel is going to brief the President Trump today about the investigation into the killing of Saudi dissident journalist ... in Turkey Saudi Arabia has changed its story yet again and now admits he's killing was premeditated\nUkrainian filmmaker imprisoned by Russia has won the European Union's top humanitarian prize that soccer a prize or racial reports the European Parliament is using the occasion to praise Oleg Sentsov courage and determination under pressure Moscow to set him free\nSentsov in a jail cell in Russia as far north got a standing ovation from eve lawmakers of [noise]\nThe film directors turned to activists is serving a twenty year sentence after the crumbling accused him of plotting terrorist attacks in his native Crimea annexed by Russia and twenty fourteen\nCents off denies the charges and became a symbol of political prisoners worldwide when he went on about one hundred and forty four day hunger strike to demand freedom for dozens of Ukrainians jailed by Russia\nEuropean Parliament president Antonio ... says sense also ward is a message to Moscow it up and down the European Parliament would like to show its support to him and just cause Taiwanese says we call upon the authorities to release him immediately for NPR News I'm Teri Schultz in Brussels\nThe joint typhoon warning center says super typhoon YouTube has crossed over the Mariano islands the U.S territory in the Pacific its current\nTyphoon warning center says super typhoon YouTube has crossed over the Mariano islands the U.S territory in the Pacific its current top sustained winds are one hundred sixty six miles per hour although there are reports the winds were stronger encore of a cool and NPR News\nSupport for NPR comments from NPR stations or their contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people\nFrom anywhere in the world on any device learn more and go to meeting ...\nThis is the case for the Laurie Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish them task for her lawyers gift to the care cc legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... the legacy fund can be found at our website ... seat dot O. R. G. [noise]\n\n\nThis is one a I'm Joshua Johnson visiting Georgia Public broadcasting in Atlanta\nAs you no doubt heard in the news by now there's a lot going on as we speak we're waiting for more developments about this series of suspicious packages that have been sent to various targets across the country will let you know if we have more information to report on that as the program goes on\nFirst off a separate question one that's been in the news but kind of has gotten lost in the news cycle lately president Donald Trump is a rich man but is he truly a self made man\nThat's been up for debate for some time where he got his money and how much of it came from his father the legendary New York real estate magnate Fred Trump now Donald Trump story has been pretty consistent over the years\nIt has not been easy for me and you know I I started off in Brooklyn my father gave me a small amount of a million dollars I came into Manhattan and I had to pay him back and I had to pay him back with interest\nAccording to a recent investigation by the New York times Mr Trump was a millionaire by the age of eight thanks to his father's money over the years Donald Trump received the equivalent of what would be more than four hundred million dollars today\nWhat do we now know about how the president got his wealth how does this report from the times effectively\n... today what do we now know about how the president got his wealth how does this report from the times affect his image as being a self made billionaire and for that matter\nWhat difference does it make I mean Donald trumps the president now he won partly on a platform of putting his business smarts to work for the nation how much of an impact will these revelations really half\nJoining us from NPR in New York are Susan Craig and Russ Buechner to investigative reporters for the New York times they worked on this report with our colleague David Barstow Suzanne Russ welcome to when I\nHad to be your next we also welcome your questions and thoughts about this report email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one a Susanna let me start with you how did this report come about I assume\nIt was kind of a natural outgrowth of the times is previous reporting about Donald Trump after he declared himself to be a candidate\nIt it was we I'm In late two thousand and a sixteen I was mailed three pages of\nDonald Trump's Nineteen Ninety five tax returns and all of his reporting as sort of been in one way or another you know just an outgrowth of our our study of his taxes and and and those taxes in particular showed something very interesting which was not your Donald Trump\nAt a loss of almost a billion dollars it was a huge number and it essentially gave him a bit of a gift card from the IRS allowed him to shelter\nBut quality costs money as a nonprofit media organization we looked directly to you to help pay the costs of our services become a part of the team contribute at K. R. C. C. dot org today thank you\nWe can be with you wherever you go all you need is your phone gets a Ninety One point five K. R. C. the mobile app free at Google Play and in the eye tunes avatar\nProgramming on Ninety One point five to your cc is supported by springs community acupuncture dedicated to helping treat chronic conditions from pain and anxiety to P. T. S. B. M. insomnia information about conditions greeted with acupuncture at springs community acupuncture dot com\nSupport for NPR comes from this\nThe insomnia information about conditions treated with acupuncture at springs community acupuncture dot com\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com\nFrom visiting angels professional caregivers assisting adults at home and bathing dressing Neal sunlight housework nationwide visiting angels America's Choice and senior home care learn more at one eight hundred three six five four one eight nine\nAnd from Americans for the arts\nIs one a an Joshua Johnson before we get back to our discussion on the New York times investigation we want it to update you on the investigation of suspicious packages that have turned up around the country in the past few days\nA series of pipe bombs were mailed or delivered by careers to top democratic figures from LA to New York to Washington the bombs were wrapped in bubble wrap and manila envelopes\nThey're attain tended recipients according to the mailings included Hillary and Bill Clinton Iraq Obama Joe Biden former attorney general Eric Holder democratic donor George Soros democratic California congresswoman Maxine Waters\nFormer CIA director John Brennan an actor Robert Deniro all of them have been vocal critics of President Trump\nAt least one package had a district office of Florida Congresswoman Debbie Wasserman Schultz listed as its return address shields as the former chairwoman of the Democratic National Committee it bounced back to that district office when it failed to reach its intended recipient Eric Holder\nThe bomb that was sent to John Brennan was sent and care of CNN studios on Columbus Circle in New York when it was discovered the entire CNN building the time Warner center was evacuated\nAnd the FBI says additional packages may have been mailed elsewhere and initial examination shows that at least five of the bombs are rudimentary but functional none of the bombs detonated on site and no one has been hurt as far as we know\nNow President Trump urged unity during the White House press conference yesterday\nThe full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable act to justice we will spare no resources are expense in this effort\nAnd I just wanted to tell you that in these times we have to unify we have to come together\nAnd I just want to tell you that in these times we have to unify we have to come together\nAnd send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America [noise]\nLeader during a rally in Wisconsin and in a tweet the president once again urged unity but he also blamed the press for supposedly stoking political divisions this morning the president tweeted quote\nA very big part of the anger we see today in our society has caused by the purposely false an inaccurate reporting of the mainstream media that I refer to as fake news and it's gotten so bad and hateful bet it is beyond description mainstream media must\nClean up its act fast unquote\nThis story is moving very fast and again there's still a lot that we do not know including who is behind the suspicious devices and what message they exactly we're trying to send will keep to keep you up to speed as quickly as we can you get more details of course on your NPR member station and online at NPR dot\nOrg let's get\nBack to our discussion about the Trump family empire and the true nature of President Trump's wealth with Susan ... must beating her up in New York Times we walk more of your questions about this investigation comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org\nFactor that common with regards to avoidance versus evasion of taxes Suzanne I Wonder how your reporting turned out in terms of how much money it appears that Trump's should have\nPaid in taxes but didn't do we have a sense of what the difference was between those two I mean it it it\nComes into the hundreds of millions of dollars range I mean they did pay some tax on um the schemes that that we found 'em in the IRS puts push back\nOn some of the um some of the things that they submitted that didn't add up to them but ultimately we we felt that there was hundreds of millions of dollars that should have been paid to various tax authorities that weren't\nOne of the aspects that comes up in the investigation has to do with valuations I mean when Fred Trump's children took over his empire the value that at a little over forty one million dollars all the buildings and all the businesses that they had and the various kind of larger Trump family organization\nThat at a little over forty one million dollars all the buildings and all the businesses that they had in the various kind of larger Trump family organization when they sold the business ... business has off over the next decade they sold for sixteen times more\nThan devaluation can you give us a sense Suzanne of how valuations kind of what you say something is worth factors into all of this\nEvaluations became a a a theme quit quickly in the in our reporting once we got into the documents\nAnd we saw um sort of writ large when it when it benefited the trumps to put a low valuation on buildings when they didn't want to pay taxes on it they would do that and go to great lengths to to put values that just seems\nRidiculous to us I'm low buildings worth you know a hundred million plus we get a valuation sort of you know five ten million\nBut on the same hand when they had a charitable donation um where they were a high valuation um would benefit them they went high so when it benefited them to go higher they went high when it benefited them to go low we saw them go very low\nAnd of course if you inaccurately state the value of something to the IRS then that compromise is the amount of taxes the IRS may or may not be able to assess on that but Russ I Wonder if you could respond\nTo a tweet from Matthew who asks how common are the various tax Dodgers committed by the Trump family that also goes with another comment from Bryce several if you've been asking\nWhether this is kind of unique to the trumps Bryce run on our Facebook page I Would like to know how common to sort of tax dodging inheritance scheme is among the very rich after the Panama and paradise papers I just assume everyone riches engaged in a lifelong struggle to subvert the law in order to get richer [laughter]\nThose are those are very good questions I there are some of these\nSome of the things that we're talking about here that we uncovered are um trust arrangements that the IRS has endorsed sometimes after being pushed by a trust in a state attorneys\nI'm a ... and that that that are widely used one of them the scratcher retained annuity trust which is a formal name for the mechanism through which Donald Trump in his siblings took\nOwnership of their fathers empire in the nineties\nThere's actually a commercial BDO the consulting firm runs a commercial where a daughter is trying to persuade her father to pass on the family winery through one of these trust 'em so they're they are quite common\nThen there are other aspects of of things that we uncovered that er\nPass on the family winery through one of these trust 'em so there there are quite common\nThen there are other aspects of of things that we uncovered that are not common at all and are not endorsed they set up a corporation that serves no purpose of when pat invoices so Donald Trump in his siblings could start\nA taking some of their fathers profits that's not that's not anything that's endorsed by the IRS that's patently fraudulent on on its face\nUm and so those kind of things aren't a gray area and they're not widely used so it's a it's a mix of things that we are talking about here and even in the cases where\nThey used a mechanisms like the trust that are well established and widely used by wealthy people to Trump's really push the limits the boundaries of those things in ways that a trust in the state attorneys that we consulted with an exam and these things said we're beyond the pale of of anything they'd seen in their careers\nBefore we get into more of the details I like to get to one more comment that was sent in a through voice mail from one of our listeners who is struggling with the idea that the Trump actually did anything wrong here's what Jeff left in our inbox\nIs he Jeff St Clair falls Wisconsin many many successful people have received benefits and their father I see this is a story the second part is taxes avoided\nThat is a legal method a reducing your tax bill through existing a statute taxes evaded now that would be interesting but so far all I hear is that he use certain ... to avoid paying taxes as we all do\nWe all take deductions standard or otherwise\nJeff thanks for sharing your thoughts with Suzanne what would you say to Jeff\n... at the top I mean these aren't standard deductions one at one of the um one of the things that we wrote about the ... you mentioned\nUm with the company that was set up it's it's interesting because it's true that the rich due to a lot of things to avoid taxes to Trump's cross the line into illegality and one of the companies that we wrote about his company called all county building supply\nNow you can have the Ninety One point five ... the newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning find out\nLocal and national news delivered to your inbox every Friday morning sign up at ... dot org\nNPR on Ninety One point five K. or cc is supported locally by e G presenting Chris Isaac's holiday tour November twenty six pikes peak center more information is available online at access dot com that's a X. S. dot com\nBy Colorado College a national liberal arts college where together students and professors explore the depth and breadth of each subject one course at a time more about Colorado colleges block plan at Colorado College dot edu\nSupport for NPR comes from the station and from American University's ... school of business committed to business being a force for meaningful change through graduate and undergraduate degrees mission driven curriculum and the hands on approach more Ed Koch God that American dot edu\nAnd for math amazing him committed to changing lives through math by building math achievements problem solving and the critical thinking skills for thousands of students every day and nine hundred franchise locations math ... dot com slash NPR\nWe get back to our conversation we are very excited to let you know about something new a new partnership that we are launching today it's called one a across America\nWe're partnering with six public radio stations around the country will be spending time in their communities over the next few years to bring your voices that may not normally make it into our national conversations\nThis Monday you'll hear from reporters on the ground in these regions to learn more about the key issues that are showing up in the mid term elections and we'd like to hear from you starting with three states\nKansas Michigan and Colorado we're just starting with those three we want to know what's driving you to the polls this year if you live in one of these areas and you do or don't plan on voting why\nOr why not leave us a voice mail eight five five to three six one a one a again for starters if you live in Kansas\nMichigan or Colorado is there a candidate or ballot initiative that you're passionate about for if you do not plan on voting why not\nTell us your story eight five five to three six one a one a let's say five five to three six one to one to you\nFive to three six one a one a that's eight five five to three six one two one two you'll find more details on one a across America on line at the one eight dot org will share some of your stories and tell you a bit more about across America this Monday\nOn one day\nBack now to our conversation with Susan Craig and ... of the New York times still times to get in a few more of your questions and comments won a at W. A. M. U. dot org before we get some more questions from our listeners Suzanne what about the IRS his role in all of\nThis is their job to catch the French trumps of the world doing what Fred Trump did how do they reflect on this it\nIt is their job and it's an interesting um you know a theme throughout\nThe story when we started to look at the different um schemes and I think one thing to remember about the IRS is um you know ... large um they're understaffed and and often a lot of stuff does get through 'em and I I think that that sort of became apparent to us as we were sort of looking at the totality\nOf the uh the ...\nThat we saw we do see I'm In some of the things that we found that the IRS did push back\nAnd you know from talking to the tax experts that we did um you understand when when the IRS does see something um there's back and forth I'm with you know and it would have been in this case the trumps but with the people were where were problems are found and eventually they come to a settlement\nAnd we we saw that additional tax and certain things was paid when they saw valuations that they too agreed were low um and then the cases settled and and and things move on in the case of all county um we found no evidence that the IRS I'm like oh county as the company where they had they were putting the voices in order to drain\nI'm Fred Trump's empire an in cases like that we saw no evidence that they were aware of what the trumps we're doing there so it sort of a mix of they caught some stuff and and they push back an extra tax was paid here and there and then other cases where we're not convinced they even knew what was going on\nThat you report has come out Russ have we heard anything more from the IRS they plan to look into any of these allegations or is it is it too late or are there a statute of limitations that are involved there are statute of limitations on any potential criminal charges those have since told there is if there's fraud involved there's not a statue\nThere are statute of limitations on any potential criminal charges those have since told there is if there's a fraud involved there's not a statute of limitations on civil penalties and and collection of back taxes we haven't heard anything from the IRS we wouldn't necessarily expect to they generally run\nVery silent and most people who work at the IRS are forbidden by law from talking about any individual taxpayer we have heard from New York City in New York state taxation authorities\nWho say based on uh the the reporting that we did they have opened investigations and and are looking for ways or if there's a reason to collect a back taxes with penalties\nBenjamin has a clarifying question about all county building supply and maintenance Benjamin tweeted did all county building have to pay taxes on the income it made how much of a difference is the percentage from the estate tax Suzanne which said ...\nUm it's a good question the estate tax that they were looking at what have been\nFifty five percent and all county the partners in our county Donald Trump in his siblings I'm would've had to pay some tax that would have been a business tax um and it would have been substantially less than it's\nInteresting at least in the case of the president we know because of the law says that he it incurred throughout his um his life that he may be ... potentially would have been able to shelter the income and not paid taxes on it because in America when you have\nYou know law says you're allowed to use those losses to offset future income so we just don't know exactly what each of them paid but it would have been substantially less than fifty five percent state tax if they were facing\nPart of the story also one of the other aspects of the kinds of stands out is it how Fred Trump went to some pretty great lengths to bail out Donald Trump repeatedly if he ran into financial trouble rush there was one story that involves millions of dollars of poker chips and\nOne of Donald Trump's fails casinos ... can you explain that to us\nThat was uh in in Nineteen Ninety Donald Trump was really in his darkest moment he was facing a a payment on a bond basically a money he owns the hotel lenders and he couldn't make it from the revenue to the casinos\nHis father's a lawyer showed up\nWith checks totaling three and a half million dollars bought some gambling chips took the chips back out to the limousine and went back to queens with them and I never cash them so that was a venture determined to be an illegal loan that Fred Trump or had given his son to help them make a payment gets\nA venture determined to be an illegal loan Fred Trump or had given his son to help them make a payment get over that hump\nI Wonder if we all should be clear here I mean even if\nEven if officials in New York or the IRS had known all of these things about the Trump family Suzanne and had decided you know what let's go after them let's ran down to full force of the law on the trumps and make an example of them\nHow much did they have really done I mean what what's the worst case scenario that Fred Trump and the trumps might have faced at the time if they had been caught and fully prosecuted\nOr a big one is they would have had to pay taxes on all the uh on all the money but there could have been civil civil fines I'm there potentially could have been criminality I mean we talked about one area where the county where you know they use these padded receipts that they are that they came up with to drain the empire they didn't pass those costs\nOnto the tenants and I'm In doing so you know they inflated they they did it on and you know they did it with inflated receipts and they shouldn't have done it\nThat potentially could go into areas of wire fraud among other areas and not\nSo there's a range of things um and now you could be looking at not only having to um they're they're facing potential not only back taxes but penalties in interest on the money that so so there's there's a lot of things that that I think various taxing authority is um another authorities could be looking at 'em\nWith us today have ended up in in federal prison for this\n...\nFederal or state for him that depends on who would choose to prosecute the clearest a legal violation that could go into a crime was what she was describing that all county they were filing false documents or with a state agency um and there would be slower level charges that were slow to that\nAnd yes those could be we've talked to several former prosecutors who said that looks like\nSomething that could have clearly been prosecuted as a state crime\nClearly some of our listeners some if you feel that this is not as big a story as some of our other listeners feel it is Charlie wrote on our Facebook page sounds like President Trump is more brilliant than we ever thought and freedom and Jay tweeted so you're prove that Donald Trump success did start with a loan from his father\nAs he stated where exactly is the discrepancy none\nSuzanne ...\nComments I had one one thing that when when we started out Donald Trump has has stated that he started with a million dollar loan any bill\nInteresting comments I had one one thing that when when we started out Donald Trump has has stated that he started with a million dollar loan and he built it into a billion dollar empire he's now in the White House\nPushing back against the one dimension analogy that black filmmakers have been fighting for decades and now it's getting a new life that's next time on the take away from WNYC NPR I\nToday at ... am on Ninety One point five K. or cc southern Colorado's NPR station\nProgramming on Ninety One point five K. R. C. C. is supported by Ninety One point five kill your cc members who continue to fund the news music and other quality programming that Ninety One point five years cc brings to southern Colorado and beyond it kill your C. C. dot org thank you\nThis is southern Colorado's NPR station to your C. C. C. C. H. D. Colorado Springs the ISI see law hunter tc of ... M K W CCF them woodland park\n[noise]\nTie this is Andy ... executive director of the cultural officer the pikes peak region with your peak radar minutes between a couple of great events suggestions for the coming week\nTomorrow night at the end Center for the arts NASA engineer Kobe Boykins will provide an informative update about what curiosity and other Mars rovers have discovered on the red planet\nThis Friday and Saturday the Colorado Springs philharmonic will present monster Masha soup secular night of scary tricks and musical treats performed by an orchestra possessed by thrilling classics and the newest movie thrillers\nManagers springs will celebrate the twenty fourth annual Emma proper coughing racism festival this Saturday from eleven AM to six PM the parade starts at new view of information about upcoming cultural activities or events that you'd like to share with the community in next week's pick radar minute\nPlease visit ... dot org for more information about the great our\nRadar made I mind one point five here he is made possible by the team and foundation [noise]\n\nLife from NPR News in Washington I'm Lakshmi sang investigators are looking into three more suspicious packages intercepted by law enforcement the latest targets are former vice president Joe Biden an actor Robert De Niro NPR's Ryan Lucas is following developments\nFBI says authorities have discovered it three more suspicious packages similar in appearance to others found this week that contained would authorities have described as pipe bombs\nTwo of the new packages were in Delaware and address the former vice president Joe Biden the third was found outside of a restaurant belonging to Robert De Niro in Detroit ... neighborhood of Manhattan New York police tell NPR that that one contained a potentially explosive device similar to those discovered earlier this week the FBI has warned that they are maybe more\nManhattan New York police still NPR that that one can tell you the potential explosive device similar to those discovered earlier this week the FBI has warned that there may be more of these packages out there and has asked members of the public for any information that could help in the investigation Ryan Lucas NPR News Washington\nPresident Trump's delivering on his threat to send more troops to the southern us border with Mexico to keep a caravan of thousands of Central Americans from crossing illegally NPR's Tom Bowman has the latest\nThe department of homeland security has made a real close to the point of going to send hundreds of troops down to the border\nTo help with a border patrol we're told a different secretary Jim Mattis was signed that order today so need as many as eight hundred army troops down to the border we're told they're going to be military police and engineers again to assist border patrol not to take part in any sort of a law enforcement activities\nAnd we're told will likely be active duty troops or Army Reserve troops\nAs NPR's Tom Bowman are reporting under law troops are only allowed to serve\nIn support capacity they are not permitted to get involved in law enforcement a caravan is reported to be more than a thousand miles away thousands of men women children grandparents have embarked on the arduous journey saying they're attempting to put more distance between them and the violence and poverty of their home countries\nAnd firing up his base while campaigning for Republican candidates this week President Trump claimed terrorists have infiltrated the care of and he has provided no proof of that\nIraq has a new prime minister and a partial cabinet NPR's Jane Arraf reports of parliament in Baghdad gave its approval earlier today\nI don't ... Iraq's new prime minister he was sworn in along with fourteen of his cabinet picks after hours of late night debate in parliament\nRefused confirmed key positions including interior and defense minister member said they'd been given the names only the day before with no chance to look into the nominations almost half the members of parliament boycotted the opening session\nAbdul ... he is expected to try again that the next session in about two weeks he told parliament has government's priorities included cutting corruption and improving public services Jane around for NPR News Amman, Jordan\nUs stocks higher with the dial up one point two percent the S. and peas up one and a half percent and the NASDAQ is up two point four percent this is NPR News\nBritain's information watchdog is finding Facebook six hundred forty four thousand dollars for a data breach that compromise\nBritain's information watchdog is finding Facebook six hundred forty four thousand dollars for a data breach that compromise the accounts of millions of users for political purposes Larry Miller has an update on this\nThe information commissioner's office as Facebook permitted a serious bridge or the law found that between two thousand seven in two thousand fourteen Facebook process users' personal information unfairly by giving app developers access to data without informed consent\nSuch access even extended beyond after users themselves through their friends data also that after the misuse of data was discovered\nFacebook failed to take action to insure was deleted one company use the rules of a personality quiz to harvest the Facebook data of up to eighty seven million people some of that was shared with Cambridge Analytica would use the information to target voters\nFacebook has apologized and admits it's guilty over breach of trust for NPR News I'm Larry Miller in London\nIn the U.S sales of existing homes may have picked up in the month of September but for the year they're down the national association of realtors is\nPosting a half percent increase in its home sales index for the month but year over year the metric fell one percent\nThe sectors experience and overall slow down as mortgage rates have continued to climb this week the fixed rate on the thirty year alone came in at four point eight six percent that figure was under four percent this time a year ago\nA day after a sharp sell off or seeing a surge in the markets the Dow is that three hundred and Fifteen points one point two percent ... at one point six ads that got two and a half [noise] this is NPR News\nSupport for NPR comes from NPR stations\nOther contributors include Amazon Prime video with their Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video [noise]\nNow you can tune in to Ninety when we find NPR's D.C without lifting a thing or ... years in our ...\n\nSupport for the Ninety One point five years cc newsrooms provided in part\nBy Home Depot information available at home depot dot com\nLooking for something to do check out the community calendar link at K. R. C. C. dot ORG\n[noise]\nCheck out the community calendar link at ... dot ORG\n[noise]\n\n\nThis is one a I'm Joshua Johnson visiting Georgia Public broadcasting in Atlanta we begin with an unfolding story regarding a series of pipe bombs that have been mailed or delivered to top democratic figures from LA to New York to Washington that's where we'll start today later on we'll talk about another high profile attack\nWas the BBC's mark urban he's been investigating a particular threat from Russia but for now let's begin with those pipe bombs and what we know the targets have included President Bill Clinton and Hillary Clinton president Brock Obama vice president Joe Biden former attorney general Eric Holder former presidents of course\nDemocratic donor George Soros democratic California congresswoman Maxine Waters former CIA director John Brennan actor Robert De Niro and CNN all of the people who've received these packages had been critical of President Trump\nNow the story is still developing it could change before this program is over do bear that in mind as we talk about this fast moving story\nFor now we're going to focus on what we know and try to be clear about what we don't know or cannot yet conform to help us do that joining us by phone is Devlin Barrett who covers national security and law enforcement for the Washington Post sibling welcome to want to say\nHi thanks for having me we welcome your questions on this fast moving story as well so email us one a at W. A. M. U. dot org ... comments on our Facebook page tweet us at one a and again do bear in mind as you hear the coverage of this\nAt this story is developing very very fast so we'll do our best to not get ahead of our skis in terms of what we know or don't know at this time Devlin let's kind of walk through this very carefully where does the investigation stand at the moment\nWell what what they're working with right now is they have a we believe ten packages or none of them exploded so each of them offer them potentially a significant amount of forensic evidence and we also have reason I think that they they're\n... have been revealing quite as significant a volume of videos to try and find in the cases where these packages were dropped off as opposed to put in the mail and even frankly when they were dropped off at mailboxes or do they have videos of a suspect and so those are the two biggest parts\nEven frankly when they were dropped off at mailboxes or do they have videos of a suspect and so those are the two biggest parts of the investigative effort that we know of right now looking at the packages themselves for clues and searching videos for any image that may be that the suspect\nTell us about the packages themselves can you describe them for us one of the big aspects of the packages that a lot of people have been commenting on\nProgramming on Ninety One point five K. or CCD is supported by community karate and fitness helping parents feel space under the tree this holiday season with karate uniforms could be wrapped in classes that started in January schedule and more online at nice karate school dot com\nBy the cultural office of the pikes peak region inviting listeners who celebrate arts month this October by having at least one new cultural experience with family or friends details at peak radar dot com slash arts month\nBy springs homes dot com realtors Joe and Jennifer boiling leverage their team myriad social media and the tools of technology as they work directly with their clients for both buying and selling homes details that springs homes dot com\nSupport for NPR comes from this station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home advisor dot com and from the sustaining members of this NPR station\nThis is one a I'm Joshua Johnson in the middle of a park in Salisbury England a young woman sat on a bench leaning against an older man that older man was former Russian spy Sergei Skripal he had been poisoned with a highly toxic nerve agent\nThe young woman slumped against him was his daughter she had been poison to fall\nOn British soil it written as prime minister Theresa May was quick to place the blame on Russia and its president\nBeen poison to all on British soil\nAs prime minister Theresa May was quick to place the blame on Russia and its president is not clear\nThat ... were poisoned with a minute the graves none of agent or the titan did that by Russia [noise] this is talk of the critical nowadays you know that's ... [laughter] based on the positive identification if this chemical agents Bible leading acts but that the defendant science and technology to volunteer folks and down\nOn all these ... Russia has previously produce this agent and would still be capable of doing that Russia's code\nOf conduct ... states from that side of the nation and tolerance excellent that Russia the the some ... to as much targets for soccer nation the government has concluded that it is highly likely that Russia was responsible for the ...\nTo ... have you with the ...\nThe poisoning by suspected Russian intelligence officers strained relations between the u._k. and Russia more than they've been strained in decades the U.S expelled more than sixty Russian dignitaries in response as it sided with its ally Great Britain ended sanctioned Russia\nRussia's foreign minister Sergei Lavrov spoke on behalf of president Vladimir Putin and Russia the vehemently denied the charges and claimed it was a British distraction from the tumult surrounding breaks it\nWas just a warrant them in a number of all that I think that they said oh the ... Arab governments have Great Britain especially in a situation where they cannot fulfill the promises they gained so national ... from the European Union that\nWill Vietnam civil very soon signed guarantee it but who\nWas the man at the center of it all sixty seven year old Sergei Skripal how did he become the target after seemingly falling off of Russia's radar what did he do that angered Vladimir putting so much\nAnd with Russia's military intelligence agency the G are you now linked to not just this poisoning but also tampering in and potentially swing the outcome of our last presidential election is this agency the G R U emboldened by its successes\nWere stumbling through its failures\nJoining us from London to discuss it is mark urban the diplomatic editor of BBC Television news magazine news night he's the author of this cripple files the life and near death of a Russian spy he's the only journalist known to ever interviewed Sergei ...\nHe's the only journalist known to have ever interviewed Sergei Skripal mark welcome to one a\nIt's such a Joshua thank you for having me\nWe also welcome your questions from our urban about Sergei Skripal the mad at the center of this whole story so comments on our Facebook page tweet us at one essay or email one A. W. A. M. U. dot fork lock before we get into the details of Sergei scruples life I Wonder what you make of this story overall this kind of\nCaptured the world's attention why do you think that this got such international attention\n[noise] well it's an outrageous activity that or to use that kind of substance on on the streets of a foreign city in order to settle the school I think it's something that a lot of people find extraordinary and you know\nIn in both senses of that would that it's an extraordinarily provocative thing but some people\nI think to have trouble believing the British Government narrative in its details I have to say though you know as time has gone on and particularly things we've seen in the last month now off\nWith the identification of two suspects and then Russian Janice and experts working to find out the real identity that those people who came to the u._k. on season and and then to link them to this military intelligence service the geo you you know it'll do seem to be pointing pretty clearly in that direction\nLet's talk more about the G are you what exactly is it and what does it do\nWell at the Russian initials a stand for main intelligence directorate and it's the it's a direct threats of\nThe Russian general stuff the ...\nOr the ... that are seeing some plans for the Russian ministry and this is the same in called little countries historically or the general stuff will have its own intelligence department and that's been the case you know the changing one or two that bureaucratic details but more or less since the Russians civil war and the twentieth century\nThat the a Soviet than Russian general office had this organization and ate embraces a whole a sway the capabilities and the idea of a ... kid reconnaissance so intelligence as practiced by the geo use a very ...\nAnd that can be two guys creeping forward on their bellies in eastern Ukraine trying to see if they can ... the Ukrainian full says and basically ... as soldiers on the battlefield and it can be a ... tell policy in Madrid in Nineteen Ninety six I uh ... who was serving that Under Cover of being a\n... tell policy in Madrid\nIn Nineteen Ninety six ... ... ... who was serving that Under Cover of being a scientific and technical for sex tree at the embassy\nAnd it can also embrace things like cyber warfare and spy satellites so it's an organization that has many thousands of people working for it it also has special operations forces\nAre ... and a very\nBroad capabilities audits Sergei Skripal joined the G argue well joining the\nGI you particularly ah back in the Soviet period when he got involved or he was invited in Nineteen Seventy nine\nIt was a pretty mysterious thing you weren't supposed to really know about it you couldn't supply it was them who approached few and he'd been involved he was in the ... and he was a in a reconnaissance unit that did some pretty daring things like they went into China or on the cover and\nYou know and there are other missions as well but uh described in my book\nAnd I think this protein to the attention of the G all you as being the kind of steely guy who who had the right stuff and they invite you to have you gotten citizen exam and he goes through that said later that year he started at the what's cool limited to diplomatic academy which is effectively ... school to Moscow\nWet you spent four years uh doing everything from you know the real a spy novel trade crossed off of agent meats and counter surveillance\nA means of communications from ... to secret writing to\nYou know encrypted email all that stuff\nOr through to intelligence analysis and all the rest of it so it's a very sorry grounding that they get ... and having done all that he got ... uh in not sneaky full to move to\nA on his first job working on the diplomatic cover and that's what a generally speaking a lot of these gee all you people who were deployed strategic intelligence gathering that's what they do they assume of civilian personnel let's say\nA may be working for Arab ... maybe in the embassy maybe in a trade mission round they carry on with that tree intelligence and they said all of these people are you mentioned in your introduction expelled from the U.S\nFollowing the soles free incidents where gee all you people working in in Russian organizations in Washington and New York\nDescribes Sergei Skripal and his day what did he look like how did he come across well he's a pretty either well built guy I mean he's he's a\nWho uh was a Russian Army\nDid he come across well he's a pretty he's a well built guy I mean he's he's a man who uh was a Russian Army a boxing championship level a boat so\nHe he was in the ... where they they put quite a premium on you know physical strengths are real courage throwing yourself out there playing Nineteen to an ... kind of stuff\nA ... and so you know he's a tough guy he's he's broad um of course now in his mid sixties or eight of them have quite the same physical condition you did back when he was working with the jail you but he's still a fairly um striking physical presence he's got a very dry sense of humor\nI'm a dead pan and it tends to make light of the sort of negative things in life so when we were talking\nAbout his experiences under interrogation in the fall to the prison in Moscow well then in the labor camp he was sent to you know he would struggle also made off and say well I got this fix them on Iran for that to happen and you know this made me more comfortable and you know he was thinking I think he would have said was\nToday at ... am on Ninety One point forward to your cc southern Colorado's NPR station\nNow you can have the Ninety One point five ... the newsletter highlighting the weeks local and national news delivered to your inbox every Friday morning sign up at ... dot org\nNPR on Ninety One point five through your cc you supported locally by e G presenting an acoustic evening with Lyle Lovett and John Prime February eleventh at pikes peak center more information is available at access dot com that's a ex S. dot com\nSupport for NPR comes from the station and from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nFrom F Jaycee foundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learn more\nFoundation of donor advised funds working to maximize the impact of charitable giving and to create customized philanthropic solutions learned more it after Jaycee dot org and from the listeners who support this NPR station\nBefore we get back to our conversation we would love your help with our special series this state we're in which continues on Monday we'll dive into trends on new state laws that aim to strengthen protections against sexual harassment\nWe'd love to know what your state has done to protect people at risk whether that's freelancers or farm workers or employees of small businesses does your state now for example ban nondisclosure other confidentiality agreements that could hinder people from reporting abuse\nLeave us a voice mail eight five five\nTo three six one a one a are you seeing any state response new laws new guidance it work regarding sexual harassment\nTell us your story eight five five to three six one a one a or you can use our app won a vox pop to send us a radio quality audio file and to keep up to date on future topics\nWill share some of your stories Monday when our series the state we're in continues on one day\nBack\nNow to our conversation with mark urban of BBC's news night his new book is called the scribble files still time to get some of your question the questions and comments in one a at W. A. M. U. dot org tweet us at one at a or comments on our Facebook page regarding the poisoning Martin asks\nThere were five people substantially exposed to the nerve agent insults break one of whom died what's the condition of the others\nMark [noise] um well ah\nSo those on the people on Nick Bailey who was a police officer who went to this ... house on the day of the poisoning he is a much better but to still not ready to return to work\nUh of course a Charlie Rowley who was one of those who are then found the buffalo or in the summer in June and uh he's palm ... just as the person who died Charlie Rose the lightning Bailey is to have had a very\nSmall very small dies\nHe was a very on well for a week or two but he also has made a recovery of salts and then of course you get to you to a script pile and ... and uh\nShe was discharged from hospital a ...\nAnd then of course you get to UT a script pile and ... and uh\nShe was discharged from hospital a several weeks before he was once again I think one can infer from that but to how to a lesser dosage and so I suppose you could say the most seriously affected person who survived will ... himself\nUm uh when I interviewed the medical stuff their hospital you ... you had a clip earlier of or go to Steven jokes\nThey was saying well ah we think that will be long term side effects ... it's very hard for us to predict what they all say I think one would still say that ... in the presence of come with essence that's my understanding that there are some long term effects but of course\nYou know if people are not a keen to discuss the specifics that a ... because it's an issue of ... medical confidentiality and ah because I think there are still call it of unknowns\nWith regard to Yulia ... daughter ... emailed\nIt's often assumed in the media that his daughter was an accidental casualty however her fiance was a G R U employee whose mother was also a high level G R U operative\nWhen she tried to reach her fiance from the hospital he and his mother disappear also interesting and it goes on to write also interesting that the two alleged hit men flew on the same flight as the daughter to London considering that scruples wife and son died earlier somewhat suddenly it seems that the poisoning when the daughter was visiting was not an accident\nThe big question in my mind is this an operation ordered by some unhappy G R U operatives or a higher level order\nMark I'm well I I'll just\nPick cozy one little bits of an has a description that the the two people the two suspects or did not flying on the same plane as you describe how they arrived the previous day at a different ... got wake a she arrived in on the science data ... at Heathrow\nA on a plane for mostly but anyway um\nLet's just talk that ah that's just a detail um look there is definitely some thing all been trashed about ah\nArrival in the u._k. and the timing of the attack\nI'm ... and right from the outset people I was speaking to who were involved in trying to work out what has happened investigation or believed that the timing was critical now we know even more so\nIn trying to work out what has happened investigation or believed that the timing was critical now we know even more so that the suspects are named as\n... had been in the u._k. on exactly the same here the last few days of February\n... and the first couple of days in March during the previous year twenty six team I think it probably twenty Seventeen and then another man who's been isolated or identified by Russian newspapers probably a pseudonym so ...\nHad been in the u._k. at the same time as ... or in twenty Seventeen and at the same time late February early March twenty sixteen\nNow this raises questions about or would they target ... pounds for some time whether they using the fact that she lived in Russia and therefore they could hack a email account and that's been alleged by the u._k. government that they were hacking it from twenty ... woods and indeed him eyeball fun [noise]\nUm she seems to have come back to be with her daddy Shia around that time because have bravo slash a had his birthday on the first of march [noise]\nSo that's the ... uh by a light switch Seventeen I'm fortunate they tragically a Sasha by the way had died but it's still supposed that she had come and twenty Eighteen to be with her dad at that time because it would be a difficult time because it was a time they were all normally together as a family [noise]\nSo that the that it's always been um a a a line of inquiry for the investigators that the\nTiming of the attack was critically linked to use his arrival than a hacking her data bugs emails and stuff which said show outcome that you are from the ... would help them to locate again make sure he wasn't on a business trip or in some other way absent [noise]\nAnd ah that this would be a good time to do it now and I also mentioned a boyfriend that I'm Yulia had bought a is a bit of a cab yet he is salt by some to have had connections with a one of the Russian intelligence agency thought\nHe was not on the scene for example back in twenty six dating when it's believed that this um figure I'm using the names of traveled to the u._k.\nHe was not on the scene back in twenty Thirteen when we know according to the u._k. government that ah\nIn the name so I get to do to travel to the u._k. he was not on the scene back in ... when we know according to the u._k. government that ... ... email account was hacked or he hadn't been on the scene for much more than a year so [noise]\nYou know we don't know and no fan of he's not here to defend himself against any allegations that he had played some policy in this um but ... we know that after the attack um [noise]\nUh well nearly among solved there was a cool hearing to do with medical procedures that to happen and it was stage in ... that he had not been in touch with the hospital for example to find out how she was\nSo the idea that he kind of a vanished from the scene seems to have some substance\nOr you'd have had access to the Internet since a fairly early on in a recovery we don't know whether she reached out to him or whether indeed they often ... by\nA social media or messaging or or email or whatever or buts we have to assume that they no longer income times\nTo get to a few more of your comments and questions from our urban another market tweeted you got that out quick if it's half as good as your previous books it will be a pleasure and an education to read [noise]\nCO asked listening to this broadcast I was wondering if we knew why it was that he decided to defect to and my six mark you kind of suggested that he had kind of had enough that he had kind of lost face\nAs it were in the G are you do have a sense of whether there was a last straw for Sergei Skripal", "show_name": "1A Plus", "year": "2018", "city": "Colorado Springs", "day": "25"}