{"month": "10", "state": "TN", "station": "WPLN-FM", "content": "This is Ninety point three WPN land National Public radio Ninety One point five W T amount of Houma and Ninety One point seven W. H. R. S. Cookeville get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook at W. P. L. N. dot org\n[noise] you can also find schedules for all of our program channels and listen to a live stream of any of our programming on line learned more about connecting with Nashville public radio at W. P. L. N. dot org\nEvidence for climate change the solid put support for that evidence these mixed\nHow do we change the climate of the climate change debate [noise]\nFrom W. A. M. U. and NPR in Washington DC is one egg [noise]\nHey there I'm Joshua Johnson today on one a how to discuss climate change is one of those topics that make people digging their heels and argue like crazy a big issue wrapped up in deeply held beliefs so of course that means the discussions tend to go nowhere\nWill get tips on debating climate change in a productive way [noise] been we shift gears to the British royal family's new baby a light hearted story comes to the heavy time in the u._k. is this just a distraction from breakfast or something more\nWe'd love to hear from you email one day at W. A. M. U. dot Ford or tweet us at one end [noise]\n\nLive from NPR News in Washington I'm neuron\nSecretary of state Mike Pompeo is on his way to Ankara to sneak with Turkish officials about the disappearance of writer ... who hasn't been seen in public since he entered the Saudi conflict is stumbled two weeks ago\nAnd pay all met earlier in Riyadh with the Saudi king and crown prince he said he was assured that find out what happened\nTold me they were going to conduct a third complete transfer an investigation they made a commitment to to hold a anyone\nConnected to any wrongdoing that made me found accountable for that whether they are a senior officer official\nOr they've promised accountability\nTurkish officials claim Saudi agents killed because she'll get she in the ...\nAlaska is next government governor was thrown into turmoil Tuesday when the lieutenant governor resigned Andrew catch him in at member station ... reports\nLieutenant governor Byron ... resigned suddenly over inappropriate comments he recently made\nThe resignation as a blow to the reelection chances of bill Walker the nation's only independent governor Alaska is a top target for the Republican Party Republican nominee Mike ... has the largest lead in polls of any Republican seeking to pick up a governorship\nDemocrat Mark baggage also is running Walker said the inappropriate comments were quote overture toward a woman he wouldn't provide more details saying that he wanted to protect her identity Valerie knew arousal Davidson replaces mullah for NPR News I'm Andrew kitchen in June now\nNearly a week after hurricane Michael hit the Florida Panhandle authorities say at least sixteen people died in that state alone at least another ten people died in Georgia North Carolina and Virginia tens of thousands of people are still without electrical service\nStocks are real short on Wall street Tuesday NPR's John Ydstie reports\nBoth a downed us chills in the S. and P. five hundred gain more than two percent the NASDAQ shot up nearly three percent investors were reassured by strong earnings are too big Wall Street banks Goldman Sachs Morgan Stanley stocks in both banks rose sharply\nTech stocks which were battered in recent sell off also bounced back\nData that reassured investors that the economy remains strong helped fuel the games to the Labor Department reported there are nine hundred thousand more jobs available in the economy than there are workers seeking a job at the highest differential on record\nJohn Ydstie NPR News Washington\nYouTube says it's working again the popular video streaming service was down for about an hour and a half Tuesday evening users received a five oh three Arab methods which is often displayed when servers are overloaded this is NPR News from Washington\n\nFederal health officials are investigating mystery illness that has sickened children in twenty two states this year it's called a F. M. for acute placid flat said my light is\nAnd according to the Centers for Disease Control it causes muscle weakness and limb paralysis other symptoms included droopy islands and difficulties swallowing\nAuthorities in South Carolina found a very large supply of guns inside the home of the man who ambushed police officers come into question his son about a possible child sexual assault one officer died for the hospital South Carolina Public Radio's events called logo has more on the silver third shootings\nIt took Thirteen Days to process what investigators described as a massive crime scene spanning six blocks richly county sheriff Lee ... that investigators recovered hundreds of spent rounds from outside of the home and doesn't inside\nOnce we got inside the house from storm surge and uh we recovered a hundred and twenty six guns that we've seen for say the key thing when you see three weapons a pistol and to military style assault rifles that we believe in use than she was in the plane itself and\nIt's still unclear why after two hours of exchanging fire with police Frederick Hopkins stopped in surrendered for NPR News I'm Vince cool blue go in Columbia\nStarting Wednesday it's legal to buy an use marijuana in Canada sales are underway in the eastern provinces medical marijuana has been legal in Canada's since two thousand one now candidate becomes the second country to allow recreational use your way was the first\nI'm neuron NPR News in Washington\nWeb streaming is made possible by diversify trust and independent wealth management firm offering an integrated approach to the investment trust in state and philanthropic needs of individuals' multigenerational families institutions and retirement plans learn more at diversified trust dot com or\n[noise]\n\n\n\n[noise]\n\nThis is one day I'm Joshua Johnson in Washington Leslie stall of sixty minutes is a renowned journalist but there's one thing I'll bet she's no better than you are debating climate change it came up during her latest interview with President Trump\nI Wish you could go to Greenland ah watch these huge chunks of ice just falling into the ocean\nRaising the sea level and you don't know whether or not that would have happened with or without man you don't know when you're a scientist your scientists that no I Am not interested disagree with that you know I I was thinking\nWhat if he said now I've seen the hurricane situations\nAnd change my mind that really is climate change and I thought what an impact what an ... I'm not denying climate change\nBut it could very well go back you know we're talking about it all down in the news they say that we had hurricanes that were far worse than what we just had with Michael says that they say when they say that and then but what about nine scientists who say it's worse than ever\nClearly climate change is tough to discuss despite overwhelming scientific evidence of its existence\nOr maybe because of that evidence I mean think about it if someone tried to hit you over the head with a bunch of facts\nAnd figures Supreme Lee confident that they are right and you are wrong how would you feel or if someone is flat out refused to hear you out despite the fact being really clear and just dug in their heels to avoid feeling like they lost an argument\nWould that be like we want to elevate this debate to change the way we talk about climate change and we want to hear from you where do you stand on the issue and what is it been like discussing it with people whose views are different from yours\nWhat's worked and what has not email us one a X. W. A. M. U. dot org comments on our Facebook page or tweet us at one egg\nJoining us from K. U. L. W. public radio in Seattle is Sarah ... a research associate at the University of Washington shields a PHD in ecology from UC Davis she also founded the row in Institute a group that empowers leaders to tackle climate change Sarah welcome to want to say\nThanks for having me joining us from NPR in New York is poll blood show a lecture at American University's Center for environmental policy American owns W. A. M. U. the station that produces won a\nHe's also a former climate advisor to the Clinton White house and a strategic advisor at the progressive Policy Institute poll welcome\nThank structural Sarah I Wonder if we should just framed a discussion very clearly first of all this is a conversation that's for skeptics and believers alike right this is bigger than just is climate change real but this kind of feels to me like the human aspect of working our way through this issue right\n\nSupport for NPR comes from this station and from super featuring the all new three row ascent with eating for up to eight and a choice of second row captain's chairs love it's what makes us Subaru Subaru learn more at Subaru dot com\nFrom Fidel itty investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more fidelity dot com slash wealth fidelity brokerage services El Al ... and from Americans for the arts\nOne a I'm Joshua Johnson we're discussing climate change and what we discuss when we discuss climate change\nWith Sarah my re founder of the ruined Institute and Paul Bledsoe across the story a lecture at American University Center for environmental policy\nWe love to hear from you to wherever you are on the spectrum of belief with regards to climate change what kind of conversations\nAre you having with people in your life about climate change have you been able to win any one over have you had any arguments that just went sideways tell us what this conversation spin like for you comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org we know that\nSome of you have been giving us your suggestions for what has worked for you or what might work\nMelissa writes for my Bible friends I remind them that we are called to be good stewards of the earth\nNothing the environmentalists are suggesting would cause harm for my fiscally conservative friends I talk about the economics green power is more profitable and this is the future economy more jobs better jobs saving the earth for their grandchildren is way down on the list\nWe also heard from some of you who are dealing with the difficulties of discussing climate change Caitlin left this note in our inbox\nRoutes are all go actually than I Am in a room and I'm very interested in protecting the environment teaching about\nClimate change\nI Want to know ways in which I can better explain myself to others are\nJust regular people who might not have the education that I had that climate change because from where I'm standing at plainly Avi ... what's going on and it just seems like we really need to come together and actually make a change or there's going to be a really bad and\nCaitlin thanks very much for sharing your thoughts with his poll I Wonder how you would respond to Caitlyn particularly because I think sometimes if I may just add to your comment the terminology often gets us in trouble I mean some people use the phrase climate change some people say extreme weather as some people say global warming and\nJust beginning to get on the same page can be one of the core problems of talking about all this\n... it's a great point we need to recognize that the good news is we have the solutions to address this problem the technical solutions the energy\nSolutions with a policy solutions what we lack our political will and consensus around action\nWe know that we have to peak global emissions by twenty twenty and go to zero net carbon by twenty fifty turns out we have the technologies renewable carbon capture\nA electric vehicles and many others to make that happen if we make a real push but it is going to take a huge push likely made during the Cold War I Wish the country would come together over this expression of American leadership\nLeading the world again to safety I think that it's possible but when one party in the United states it's a nice factual information over twenty year period than elects a president who almost campaigned on it it becomes very difficult to engage with that and I think voters\nMay reflect that in this midterm election\nGeorge tweeted as an environmental health scientist I focus on telling people about the immediate and local clean air health benefits that will go to people in locations taking action to address climate change pollution and reducing fossil fuel burning irrespective of opinions on climate\nKatie emailed my family has vacation to Mexico beach in Florida for twenty plus years and we have many friends and loved ones from Panama City who have lost everything meaning in hurricane Michael\nMy father is it this believer of climate change and it's been very upset about losing a place we love so much he won't consider that just maybe there is a greater sing at play here what is it going to take for this to change how do we those who are convinced that is happening change the way we talk about it and rather than shutting down the conversation\nNurture it Sarah how would you respond to Katie\nGosh that's a really really great question and I can feel that the pain that she's in and the last that her family is struggling with to describe and you know this is this is the peace around recognizing how difficult this information is\nWhen I started graduate school and it took me like six years to integrate the scale of difficulty of that information and it it\nPeople can get exposed to the science of climate change and it ... they can be in such a vulnerable place that it's actually potentially dangerous for for students and people who are struggling with mental health issues\nSo the the way that we unpack this I think is through and through relationship and trust and empathy\nOn because as we interact as individuals and we come to terms with the scale of the change and the crisis you can have a lot of really based on emotion and fear anger um [noise]\nI anxiety all of these pieces that are we all ... away from those very challenging emotions and often when we feel those emotions ... into our part in corners\nWhere we think we know the way the world is and we we become ever more entrenched in our existing world view and that's why being honest that yeah this is a really difficult conversation and that's exactly why we're having this conversation is one of the ways to start\nSarah if I could just doing it a little deeper on that I Wonder if this idea of being empathetic and being a little compassionate might also speak to the conversations with folks who feel very fatalistic I mean\nIt's hard not to read the latest report from the un climate change that I Wish we discuss last week on this program\nAnd not feel like well we're all going to die anyway why bother run up your credit 'cause they're not going to be around to collect you know what I'm saying like it just feels like an intractable problem and I wonder if maybe a little empathy for folks who feel that way would go a long way\nWell I ... I ... yeah I got it and I I Want to remind remind us that as we sit\nWith the privilege of western lifestyles and we look at the science that we've invested public money into you know remembering that we're living a science fiction fantasy right now and we can look to human history and see that there are many other cultures around us\nAnd specifically in the U. S. Native American and indigenous Native American people\nWho have already experienced the kind of cultural eradication that we are looking at down the line and ... that the consequences from climate change we can look at the stories of human tenacity\nAnd how people struggle and survives\nThrough massive massive shift we know these stories and we can inform our strengths and resilience our courage by looking at the stories of for example the water protectors and the people who are standing at the front lines right now saying the earth is precious we only have one planet and we're all going to show up and\nI'm informed that the you know the public's eye of the necessity of staying in this place and and staying vigilant charge\nI Would just go go ahead go ahead ... but oh I Would just add that\nThe St Louis is a reasonable reaction if you don't know the full range of solutions\nThat there's a lot of good news here\nTwo years ago we eliminated one of them six main greenhouse gases it will no longer exist on earth Twenty years from now with the could golly agreement to phase out HFCs\nTurns out there three or four other super pollutants like methane and black carbon if we can reduce these quickly about three times the current rate\nWe can limit near term warming and prevent runaway climate change we need education about the fact that we can take hold of the climate crisis and actually solve it exactly to combat that fade lives and which has\nPeople who are overwhelmed by an apologist to dig in sound a little further what our HFCs agencies are harder floor carbon or manmade gas that ironically are used in refrigeration in air conditioners\nAnd they're growing incredibly quickly because we phased out an earlier set\nOf CFCs chlorofluorocarbons\nBefore we get back to our conversation we would love your help with tomorrow's program about being Native American Massachusetts democratic Senator Elizabeth Warren recently announced that a DNA test has confirmed what she said all along that she is indeed\nTribal heritage the test was a ... back to President Trump who mocked her for claiming that heritage and refer to her as Pocahontas critics including some tribal leaders said direct ancestry matters more than DNA testing in this regard\nIt's just one of many issues that may have Native American voters talking head of the midterms\nIf you are Native American what has claiming your heritage meant to you what tribe or are you part of and how does that factor into your life\nLeave us a voice mail eight five five to three six one a one a you know if you're not Native American then share what your heritage means to you especially if it's something you learned about a little later in life what did you discover and how did it change you\nTell us your story eight five five to three six one a one\nWas through our app won a vox pop will share some of your stories tomorrow on one day\nBack now to our conversation with Sarah ... and Paul blitz so let's get in a few more of your questions and comments before we move on\nNoel tweeted I teach clients to think of anxiety kind of like sugar a little gives you energy to get going and too much shuts you down and drains you need to keep it at that middle area I guess let's get back to Arlene's question on our website and and the poll I Wonder if you could respond to her a lean rights\nSo if you change people's minds what then I see a lot of people who believe in climate change to do nothing to try to mitigate it in their own personal lives\nThere still driving around in gas guzzling SUVs owning their ... mentioned houses with a thermostat turned up not recycling not cutting back on meat and dairy basically waiting for someone else to do something it's like someone else's tomorrow not ours\nNo doubt personal action is important not least so that you're not hypocritical\nWhen you advocate policy and political action but let's be clear that it will take large policy action to reduce emissions in the United states and globally\nTo make the United states once again a global leader and cutting emissions to solve this problem we have the biggest thing you can do personally\nFor climate change action is to vote out people who won't take it and vote in people who will and I don't mean trust Democrat and Republican because within those parties there are a few Republicans who acknowledge like uh the congressman from some South Florida\nUm but there are many more who deny it on the Democratic side there are some who are not strong enough and do not advocate serious policies\nWe have to recognize this is\nAn imminent threat to people's public safety national security and economic well being as all the recent hurricanes wildfires have\nShown we need to vote I think one of the kind of saving grace is there at this point in the conversation is that we we do need to deal with those policy issues but\nJust being able to have the conversation and useful successful way I think that's a form of progress as well you just get people kind of pointed in the direction of being willing to do something so by the by way of kind of wrapping up I Want to go through a few comment objections to the basic argument around climate change and sort of role play how one might respond to those\nFor example be tweeted I often run into these excuses if warming is happening why do we still have winter and we've been told for decades that bad things would have happened ... years ago but they haven't Sarah how would you respond to that\nWell I mean bad things are happening right now so [laughter] they have to have it in that um that that those protections are coming through I mean all of the pieces of protection that we have seen around temperature and carbon\nConcentration I mean we are able to do a very good job at projecting\nA the impacts of climate change on the ground and and that's the state of the science right now it's it's phenomenal\nI guess the issue is not just that we're having winter but we're having like day after tomorrow winter like we're having super winner\nRight and and so like [noise]\nYes and there is cut and so there's complexity and how the regional climate and the season out the different places are influenced by the day that the on the Arctic weather system basically a\nCollapsing and how and how that changes North American climate and so we do see these complexities and why\nAnd people get confused right because they're like well wait a second this is a massive storm but this is the fundamental distinction between weather and climate\nClimate ... we can measure climate for the last you know ... million years right and the the\nIsolation between glacial in injure glacial states abrupt warming into into glacial followed by slow cooling into glacial state so that pacing of glacial into glacial warming that cold too warm structure that was fundamentally paste by changing geometric relationship between the earth and assigned\nSarah backup along the changing geometric relationship between glacial an intellectual stayed last me it's so cool it's amazing what it's confusing like like bring it down to earth from it\nOkay so in a laugh million years the planet's climate has been moving between glacial state where there's an ice on top of North American and you're Asian continent sea level is lower\nOn it's a colder climate on and then in ... states so we are in an inter glacial right now okay and that changed that cold too warm shift\nThis on this piecing that I'm ... ... it's like a heartbeat of earth's climate and the heartbeat from cold to warm cold too warm that heartbeat was paid by the ... and ... of the geometric in earth orbit and earth killed as it moves around the sun\nSo I Want to make sure I'm following you this heartbeat this earth heartbeat between poll too warm\nCold too warm it's almost like the earth is having cardiac arrest heartbeat as off and the pattern is not what it's been for a million years and we can trace it to us is that what you're saying that's exactly right at like ... okay that makes it a full\nPattern that's been on that's been happening for the last ... million years we ... we have fundamentally disturbed that\nPattern I was saying we're on a super high cholesterol sugar fossil fuel diet has gotten or a blood pressure through the roof\nAnd um the climate system can't take that forever that will go out of control that's a perfect that's a perfect image that makes perfect sense one more thing I wanted to get to ... and then we got to let you go shortly but\nFor folks who questioned the provenance of the science food the scientists are that came up during the sixty minutes interview who say I just don't trust the people where this data's coming from how do I know that they don't have a political agenda what would you say to someone with that concern to try to work through that\nI I understand that you can distress individual scientists but there's not a conspiracy of\nTens and hundreds of thousands of scientists around the world to create a problem actually I find it quite the opposite in many cases their understanding the nature of the problem because they don't want to seem alarmist the truth is that the problem is here now in imminent\nAnd that that's just the factual information on the ground we have already warmed up a degree and a half Fahrenheit were on her way to well past three or even four Fahrenheit\nAnd it could spin out of control and that that's just the factual information I think we went with very few people actually denied about ten percent Fifteen Percent of the U. S. public actually\nDenied climate science would I think we have to do is galvanized the Seventy five eighty percent who broadly accepted into action\nPublished so former climate advisor for the Clinton White house process or your lecture at American University Center for environmental policy and a strategic advisor at the progressive Policy Institute Paul thanks very much for talking to us thank you judge them and Sarah ... research associate at the University of Washington and founder of the ... Institute Sarah thank you\nYou're so welcome [noise]\nAre good reasons to be concerned about our politics the division the tribal ties that seem to get in\nJust discussed but we're not alone no matter how fraud things may become sheer between now and the midterms at least we're not trying to work out a divorce it's lasted more than forty years and that will probably cost about fifty billion dollars\nMitt to speak a semi these negotiations on necessarily\nBut the reason it's own masses is because it affects the future of our country is Joan and every community is kind of country the all off in a democracy\nI continue to believe that the negotiated deal without the u._k. and for the European Union continues to deal is achievable and\nNot much I Will continue to ... it was all European partners and I commend\nTomorrow Britain's prime minister Theresa May will face European Union leaders and what has been called a make or break summit this week the president of the European Council ... to ... at the u._k. is barreling towards a disastrous no deal Brexit Britain's exit from the ... you\nThis is Ninety point three WPN National Public radio Ninety One point five WPN Alta Loma in Ninety One point seven WHM rats Cookeville get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook at W. P. L. N. dot org\nYou can also find scheduled for all of our program channels and listen to a live stream of any of our programming on line learned more about connecting with Nashville public radio at W. P. L. N. dot org\nWorld War\nThree if it ever happens bombs and troops might not fully that big a role the battlefield might be the computer in your pocket\nFrom W. A. M. U. and NPR in Washington DC is one\nHi I'm Joshua Johnson today on a winning the Cold War no not the Cold War the west already won that flew this new conflict has some similarities this threat from cyber attacks you constantly changing\nJohn Harley who's being the federal government's response to this threat divorce will explore his new book dawn of the Cold War\nAlso Facebook is a major fear of war and despite what are the networks leaving ... tells us how the company's trying to keep us safe on law we love to hear from you email one a hostile you you'd on board for the last one [noise]\n\nLive from NPR News in Washington I'm neuron the death toll from hurricane Michael is rising nearly a week after the storm NPR's Debbie Elliott reports Florida officials say at least sixteen people were killed in that state alone\nTwelve of the debts are reported in Bay county where hurricane Michael made landfall last week with a hundred and fifty five mile per hour winds\nSearch and rescue efforts continue thousands of people are still unaccounted for the response has been hampered by heavily damaged infrastructure roads electricity and communication systems\nProlonged cell phone outages had made it difficult for friends and family to check on people who remained in the Florida Panhandle during the storm governor Rick Scott has been critical of telecommunication companies are not restoring service more quickly Debbie Elliott NPR News\nNew to the immensely popular video streaming service used by billions around the globe was\nDown for the first time ever Tuesday evening NPR's Emily Sullivan reports\nUsers who tried to access videos or upload content were greeted with a five three Arab message for about an hour and a half\nGenerally speaking five oh three messages displayed on servers are overloaded and can't handle the volume of traffic trying to access their patriots\nYouTube is operated by Google and serious downtime for any of Google Services is pretty rare YouTube did suffer a minor service interruption during the summers World Cup and channel teachers were down for an afternoon in April last night was the first major outage\nThe company knowledge that services were down and issued a prompt statement once effect they did not identify a reason for the disruption Emily Sullivan NPR News\nDoctors at the Centers for Disease Control or tracking a rare disease that affects mainly children it's called acute flats and my light is or a FM it causes partial paralysis knocked are Nancy may Sonya says is affected more than one hundred people this year\nIn twenty teens so far the CDC has received the port of one hundred and twenty seven patients under investigation penalize each one of the state of sixty two cases have been confirmed as a up and\nShe says she's frustrated doctors have been unable so far to identify the cause of the illness cheered as parents to seek medical treatment right away if their child develop such sudden weakness or a loss of muscle tone and the arms of the legs\nThe Labor Department reports that job openings in the U.S rose in August to the highest level since it began keeping that statistic in two thousand and says there were seven point one four million open jobs far more than the six point two million who are looking for work that month\nThat suggests the companies are finding it increasingly difficult to find qualified workers\nThis is NPR News from Washington\nPresident Trump is giving the benefit of the doubt to members of the royal Saudi family who deny involvement in the\nHaven't been seen in public since he walked into the Saudi constantly in Istanbul, Turkey two weeks ago target officials say he was killed there the president told the Associated Press he's spoken with the crown prince and he said very strongly that he and his father know nothing about it\nThe president said the Saudis shouldn't be considered guilty until proven innocent\nThe U.S is offering ten million dollars for information leading to the rest of the head of Mexico's most powerful drug cartel NPR's Carrie Kahn reports\nAttorney general Jeff Sessions says the ... state based ... at least five tens of cocaine and five tens of math and to the U.S each month it's one of the five most dangerous criminal groups in the world\nThey announced reward is double what the us off at last march but the rest of the cartels leaders in the ... to get us have vantage Mexico is also offering a reward of about one point six million dollars for the editor Rashed known by the nickname of men show\nUs prosecutors also announced Fifteen indictments against members of the ... generation officials say the cartel has influence in Seventy five percent in Mexico and in several countries around the world Carrie Kahn NPR News Mexico City\nBrazil's federal places asking the country's highest court to indict president Michel Temer and confiscate his assets a report says he should be tried for corruption money laundering and bribery I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Sierra Nevada Brewing Company family owned operated and argued over since Nineteen eighty proud supporter of independent doubt whether that's on line over the air or in a bottle more as we are in Nevada dot com\n[noise]\n[noise]\n\nThis is one day I'm Joshua Johnson in Washington for years America's security and defense chiefs have warned that a major terror attack is inevitable and the next one may well come on line\nThere has been big cyber attacks in recent years but which one do you think has made the biggest difference was it the Iranian cyberattack against the damn in New York two years ago here's what Preet Bharara the former U.S attorney based in Manhattan said back in twenty sixteen\nNow living in your devastating attack on our financial system infrastructure and our way of life can be launched from anywhere in the ...\nMaybe it was when China hacked the federal government's a chore department the office of Personnel Management that attack compromise to private information of Twenty one million government workers and their spouses and close relatives\nRepublican congressman Michael McCall of Texas chairs the house homeland security committee here's what he told CBS News in twenty Fifteen\nThis was the most significant breach of federal networks in us history in my judgment tissues who attacked by China are due to the United states government it qualifies to espionage and that raises all sorts of issues that we need to do it\nAnd of course there's Russia it's clear now that flooded near Butte and tried to disrupt interfere with twenty sixteen election surely that stands out\nWeb streaming is made possible by Lipscomb universities online degree offerings designed for ambitious learners students can earn a bachelors or masters degree yet their pace wherever they are learned more at Lipscomb dot edu slash on line\nFair and through cyber attacks in the future and those were all big but our guest today says we learn the most from an attack involving a movie\nWith a lot and he could take a nap [laughter] [noise] when for drinks I to dinner and you know\nIf you want to kill the leader of the most Korea\nInterview was a comedy about a plot to assassinate North Korea's leader Kim Jong moon hackers demanded that the film not be released and when Sony Pictures released it on line anyway it's suffered a devastating attack crippling systems and leaking internal documents\nAre guests says to Sony hack probably did more to improve the government's cyber capabilities than anything in the last decade\nJohn Carlin is the author of the code war America's battle against Russia China and the rising global cyber threat John welcome to one a ... so remind us about the ... first of all if I left anything out and then why you think it was so very significant\nWell haven't worked on all those incidents was inside a government and I can tell you in a long career including his chief of staff to the director of the FBI Bob Mueller as head of the national security division\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking into capital markets expertise along with the legacy of putting clients financial wellbeing first learn more at Raymond James dot com\nAnd from the three I O T providing a software platform that enables organizations to deploy artificial intelligence predictive analytics and diabetes solutions at industrial scale [noise] learn more at sea three I O T dot AI\nThis is one a I'm Joshua Johnson we're discussing the evolving war against cyber attackers with John Carlin former assistant attorney general for national security at the apartment of justice whose new book is called dawn of the code war\nWe'd like to hear from you too especially if you are involved in cyber security what are you seeing in terms of the emerging threats and how well we're able to deal with them or for that matter\nHave you been targeted yourself if you're willing to talk about what happened in what you learn from it we love to hear from your comments on our Facebook page tweet us at one at a ... or email one a at W. A. M. U. dot org John we're looking at all of the tax that we know about the one from the office of Personnel Management\nFacebook that big hack at the credit reporting from Equifax\nWe're talking about many many many millions of accounts should we just assume that we've been picked off at some point I mean sometimes\nI feel so personally foolish for having lived my life online without worry before it became a host of this program I just did not even vulnerable but just foolish like to not be more thoughtful about the fact that sooner or later my personal information is going to get picked off is that a reasonable feeling\n[noise] you know you hope that people don't feel foolish but it is true and and one of your ah your earlier guest commented on it which is we don't do enough to educate on it you know my ... my ah girls in school now\nAnd they don't have a standard course in the public school system on basic cyber cyber security and unfortunately you need it right now or it's not a safe space and part of learning how to make it safe is\nEducating people both at the consumer level in one of the things I talk about it in the books even that are most sophisticated institution so let's say MIT\nLearning cyber security I'm like how to code was not part of the basic curriculum so even at the highest levels people weren't thinking about this day to day I Hope that there's time for a change in that it doesn't depend on just your behavior ... or ... which is\nYou know when I grew up in New York in the eighties\nThe ah it used to be if you made eye contact with someone that you know if you didn't cross the street when you saw someone then it was your fault if she got that there's a famous Saturday Night live skit it's like what did you make eye contact what do you expect yes you get that that's kinda today on the Internet right like if you don't change your\nAlpha new Merrick ah thirty character password every thirty days for the twenty five different accounts you have that is your father's a consumer I don't think we're ever going to get out of it if that's our mindset will we need to do is focus ON Technology\nThat makes it easier for consumers to use and also recognize there's maybe some stuff we just shouldn't be doing using a protocol that's fundamentally not secure\nI Do think that we are having a slightly more sophisticated conversation these days I mean even that meeting the county west had with President Trump in the oval office there was that shot of him sitting at the resolute desk opening his phone and his password was zero zero zero\nHe's a really bad password to we pick apart what you're referring to as the code war you see that it bears some resemblance to the Cold War in what ways\nI think we're in for a generational struggle and that that struggle is going to include not just the use of force but this setting a whose values prevail who's norms prevail about the world that we want to live in\nAnd then you need to execute on those values with your tactics so ... do deterrent bring criminal cases make public behavior that you think is unacceptable like\nThe Russian uh now where not touch a that indiscriminately hit companies around the world like Maersk shipping FedEx\nHospitals and took them off line I think we can partner with countries that share our values around the world\nWorked together to collectively impose it costs on a rogue actor like Russia when they do that type of activity to say this is unacceptable it's not going to change overnight though just like the Cold War\nIt's going to take years and years and years of day in day out fighting and this war has already begun and part of why is telling their stories that we didn't used to tell that we kept secret inside government but now we're trying to make public I think importantly so that consumers so that companies\nCan ... ah realize that were already in this conflict and start taking steps to be a part of it\nYou quote your old boss early in the book here's part of what Bob Miller said in a speech he worked on back in two thousand seven it's a fairly long quote but I Want to read it in its entirety here's part of what Bob Mueller set at the time quote\nThere is an old saying that all roads lead to roam in the days of the Roman empire roads radiate it out from the capital city spending more than fifty two thousand miles\nThe Romans built these roads to access the vast areas they had conquered but in the end these same roads lead to Rome's downfall for they allowed the invaders to march right up to the city's gates he goes on to say quote\nThe Internet has opened up thousands of new roads for each of us new ideas and information new sights and sounds new people and places but the invaders\nThose whose intent is not enlightenment but exploitation and extremism are marching right down those same roads to attack us in multiple ways unquote is this another Roman moment do we kind of becoming a victim of our openness\n... I think it could be if we don't realize the moments are the moments that we're in I remember vividly when a when director Mueller gave that speech where out in uh in in the Pennsylvania area\nIt was the first major speech on cyber as a national security threat think about that it's now considered\nBy the director of national intelligence all the major officials to be the top threat it was only around ten years ago that we even talked about it seriously from the director the FBI for the first\nTime I know you have like a a guest on later a number of former Justice Department person Monica vicar from Facebook\nAnd it reminds me of the terrorist threat that we're facing you know our openness began to be exploited by terrorists the same way that terrorists al ... used aviation which has done so much good and connected us around the world\nAnd they turned it into a weapon that caused thousands of deaths we started to watch terrorist groups my last two years ... division exploit social media\nIn order to get their adherence to kill and it was working inside the United states there's one chilling case um that I talk about that still I think people haven't heard of out\nOf it as a case that looks from the perspective of a company like someone's stealing customer\nDay out saying that you were talking about earlier however in this case he wasn't doing it to make five hundred bucks although he did ask for five hundred bucks\nHe also through bitcoin you also on the back end had become friends with one of the most notorious terrorist in the world a British born citizen name due date Hussein he became friends with them only through Twitter only on line\nAnd what he did with that stolen customer information that was provided to him was turn it into a kill list that said using this customer information\nAre located from his safe hole and Rocca a Syria he bombarded back to the United states through social media a list of the stolen customer information and said kill these people by name by address where they live\nThat's the new era of national security that that we're in we're criminal threats merge or blend with terrorists and national security threats and companies the private sector is on the front lines for the first time\nMichelle emailed as a person of a certain age I recall a world functioned before the digital age are total reliance on digital information is making us less safe were trading safety for convenience\nI Wonder John if Michelle has a point there used to be a time when you had to actually go to the bank to Rob it and now you don't\nShell definitely in fact one of the cases we talked about is an Internet a bank heist a worry hackers managed to send human operatives to ATM machines all across the world in different countries and they use to hack\nTo simultaneously allow them to withdraw money from a from a ... I think Michelle does have a point you know for twenty five years\nWe moved to almost everything we value from analog space from books in papers\nTo digital space and connect it using a protocol the Internet's protocol that was fundamentally never designed with security in mind huge advantages to that economic convenience however we did so systematically and this was true in government along with the private sector without taking into account\n\n\n\n\nSupport for NPR comes from this station and from home advisor matching homeowners with home improvement professionals for a variety of home project from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments on mine at home advisor dot com\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities first hand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence\nA quick word about our guest for this time tomorrow TSA lame and he's a writer with a lot to say about how and where she grew up\nHis memoir charges upbringing in Jackson, Mississippi his other essays have included his thoughts on hearing the perfect rap song also on the role of the black church in the south and another piece called what Bill Cosby taught me about flying\nIf you grew up in the south\nWhich story do you most want to share about that experience is it still home for you what was it about that experience that shaped how you live your life today\nLeave us a voicemail eight five five to three six\nOne a one day if you grew up in the south what's your story and what do you think people tend to get wrong about where you grew up tell us your story eight five five to three six one a one a\nYou can also leave us a radio quality audio file using our app won a vox pop\nWill speak to the layman and share some of your stories tomorrow on one ... we've been talking about the threat from cyber attacks and we know that some hackers are hell bent on stealing our secrets so\nNow might be a good time to go check your Facebook account the most recent hack of the social media giant compromise about thirty million users names phone numbers emails and other personal details\nFacebook says last month attackers found a vulnerability in the code and use Facebook's view as feature to steal access tokens these tokens or bits of code that let you love right in without having type your password Everytime\nIt gave them whoever they are access to nearly everything your user name which devices you access Facebook with\nThe last ten places you checked into or were attacked at and personal details that you posted like your religion your hometown your birth date where you work yeah a good reason to go check your Facebook account now the company and the FBI or trying to catch these hackers\nAnd this year Facebook chairman and CEO Mark Zuckerberg testified to Congress that his company needs to race it's game\nFacebook is an idealistic and optimistic company for most of our existence we focused on all the good the connecting people can do and if Facebook is grown people everywhere have gotten a powerful new tool for staying connected to the people they love\nFor making their voices heard and for building communities and businesses but it's clear now that we didn't do enough to prevent these tools are being\nNews foreign interference in elections and hate speech as well as developers and data privacy\nFacebook talks endlessly about its community and at the fringes there are some in that community who regard the platform as one of the best ways to spread terrorist propaganda over the summer we spoke to Monica bigger she's Facebook's head of global policy management about how the company is taking on terrorists\nThere are two ways that we become aware of content that might violate our policies and keep in mind we have billions of new post every day or so the first thing we become aware is if somebody reports content to as you can report any piece of content through the fight if you do it comes through in its reviewed by Facebook\nOr the second thing is we actually have technology tools that are out looking for content that might pilot our policies so for instance terror propaganda\nNow we remove of the terror propaganda that we've removed from Facebook more than Ninety nine percent of that our technical tools find before anybody in our community flags that for us now once content has been flagged as potentially\nViolating our policies it comes into one of our content reviewers and there's more than Seventy five hundred people sitting on those content review teams around the world reviewing content in dozens of languages a and making a decision if it violates the policy than Denver mayor that if it doesn't violate the policy to leave it up that's got to be\nA hard job being a contract reviewer at Facebook what kind of person does it take to do that\nKind of work it really depends on the a specific area that person is working in all content reviewers who come to Facebook are hired with a certain degree of language expertise we have a really global population using this service in fact more than eighty five percent\nOf people using Facebook on a regular basis are from outside the United states\nSo if you think about the different languages that we see we have to hire content reviewers who speak all different kinds of languages and it's important to us that we have\nNative language speakers because they really understand the way that language is used so that's a big focus in our hiring once you're hired as a constant review or you're trained in all of our policies but then you were assigned to become a specialist in one\nSo for instance you'll learn all about um our terrorism and harassment and bullying policies but you might ultimately be assigned to work on um identifying self harm threats of self harm when\nYou catch content that doesn't belong on Facebook that violates its terms what's the difference between say reactive flagging and proactive flying how much of it is the kind of thing to say a reviewer or bought would find as\nOpposed to something that I as a user would flag and then Facebook\nDeals with us we still rely heavily on people to tell us when something is going wrong on the side\nSaid we've been investing heavily in tools that can proactively flag\nViolating content and I'll tell you there's a couple of areas where this is working really well and a couple of areas where it harder areas where it's working really well with terror propaganda\nI'm with child sexual exploitation with spam with fake accounts we now have technical tools that can fly the vast majority of that content before anybody in the community\nSend it to us or sees it at all um in fact when it comes to child sexual abuse imagery or terror propaganda were able to stop the majority of that at a time of upload meaning nobody ends up seeing\nNow when you think about a policy like bullying or hate speech or harassment a lot of that is very can textual\nFor instance um you know there could be if I if I wanted to bully you on social media and you and I are our friends at work or\nAt our university and and now we've fallen out then there's a backstory there and the words that I might use to believe on Facebook would not necessarily be the things that we could train our technology to catch so it's really important for us to give\nOne Facebook you can report it and our reviewer will actually look at what's happening and make that decision what about topics as opposed to content patterns how's that pattern recognition work\nWell we do some most of our policies are about content that people are posting but we do have some policies that are focused on actors themselves\nFor instance if you miss represent yourself on Facebook we'll remove your account even if you're not otherwise pilot in our content policies we also have policies against terror organizations and our members hate organizations um and so forth so if you for instance wanted to create a page to support al ...\nAnd on that page you were just going to share photos of puppies and kittens and rain does we would still remove it because we don't allow those groups or anybody representing those groups to have a presence on the site\nUm if you see a page that is violating our policies in its entirety meaning it's a page that's represent an al ... page that has been created for the purpose of bullying somebody then it's appropriate to report the page to us the reason I mentioned that is because whatever you report that the piece of content that's going to come through to our review teams first\nAnd so if somebody has an otherwise okay profile and then they are attacking you based on your religion and you report that specific attacking comment that what's going to come through our reviewers and they'll be able to take immediate action\nAlso worth noting if you're a mobile use or like if if you're an iPhone use or if you just have one comment directly sometimes it'll bring you up a menu that will say reply or light or copy and then there's other options I mean those other options there is an option to report somebody I Wonder\nHow much Facebook is facing the learning curve of a world as learning to use Facebook know decides designed to be intuitive I think it is increasingly intuitive the more you use it and because you're global you've got people in some parts of the world who are just beginning for the first time\nTo have broadband devices or to be connected to a world where there are more devices in our people house Facebook teaching people to use Facebook\nWe definitely do outreach but you're right at different in different parts of the world people will have different levels as experience and finding these reporting options and even just understanding how the fight works\nSo we actually do the options that we offer people to report content actually do vary by location and we're always testing ways to get more report to us to make it easier now there's a tension here if you just have one big red button\nYou can also my schedule all of our program channels and listen to a live stream of any of our programming on mine learned more about connecting with National Public radio WPN land dot org [noise]\n\nSenator Elizabeth Warren is DNA test is just one topic on the minds of Native American voters what else is driving them to the polls for away from [noise]\nFrom W. A. M. U. and NPR\nHi there I'm Joshua Johnson today on one a Native Americans and the mid term Senator Warren ... to a phone or tribal ancestry got mixed reactions from Indian country\nNative Americans are much more to say about him next month's elections in the feud between warring and President Trump's unprecedented numbers of tribal citizens are running for office a new laws are making it harder for me to cast ballots the impact of these voters could be crucial and we love to hear from you especially if you are a Native American candidate\nEmail one a actual you AMU dot org or tweet us at one [noise]\n\nLive from NPR News in Washington on corporate Coleman hurricane Michael is now blamed for at least twenty six deaths authorities in one county in the Florida Panhandle are raising the death toll there the area includes Mexico beach in Panama City where damage to homes and businesses is extensive NPR's Debbie Elliott has more\nMost of the storm related deaths are reported in Bay counting along the coast where hurricane Michael made landfall search and rescue efforts are still underway thousands of people have been reported missing a high number in part because of fractured communication system\nNPR's Debbie Elliott Michael came ashore in the Florida Panhandle is a strong category for hurricane\nSecretary of state Mike Pompeo was visiting ... where he talked with Turkey's president and other leaders\nThey're reviewing the case of missing Saudi Arabian journalists to Jamal ... Turkish officials have said they believe ... was murdered after he went inside of study conflict and never emerged Saudi Arabia denies this Pompeo visited Saturday leaders yesterday and says the Saudi Government is investigating\nPresident Trump is threatening to cut aid to any country that helped hundreds of Honduran migrants now walking toward the U.S southern border Maria Martin talked with the director of a migrant shelter housing the Hondurans who are passing through Guatemala City\nBother him out of which side of the hits up got somebody could on to a shelter no housing nearly a thousand migrants from Honduras he says more are expected on Wednesday and describes what he's seeing as a serious humanitarian crisis\nYou know that all the money that you'll lawyer said\nThe Trump Administration is threatening to cut off aid to any country that helps the so called march of migrants including Guatemala and Honduras\n... syndrome that it goes along with it but ...\nThis previous to sports with migrants for over Twenty years says if he'd had really gone to help the poor these hundreds of people would not be fleeing from violence and poverty for NPR News I'm mighty on Martin\nThe European Union had hoped to approve a breakfast in agreement at their summit taking place today in Brussels but as Teri Schultz reports talks are at a standstill with just over five months to go until Britain's departure from the block\nEuropean Council president Donald Tusk says he has no grounds for optimism that the jammed Brexit talks will be resolved at this meeting you leaders asked British prime minister Theresa May come with new proposals or risk leading in March with no deal\nThe biggest hurdle is a settlement on held a border between ... member Ireland and the u._k. Northern Ireland can remain open for trading in traffic\nThat you would like Northern Ireland to stay in its customs union but May's government says that's not a long term solution there were reports the emu as willing to extend the transition period by a year in exchange for British concessions on the border issue for NPR News I'm Teri Schultz in Brussels\nOn Wall street the Dow was down more than two hundred points\nThis is NPR\nOfficials say a student in a vocational school in Crimea attacked other students today\nMore than forty others he then took his own life there have been differing accounts of what happened Russian officials first suspected a terrorist bombing now reports suggest some of the victims may have been shot to death\nProtesters are rioting outside of Hindu temple in southern India to try to prevent women from entering NPR's Lauren Frayer reports from Mumbai the temple reopen today for the first time since India's Supreme Court ordered it to admit women\n\nFemale\nTV reporters covering the reopening of this temple in the state of ... are among those who've come under attack by protesters Hindu temple is dedicated to celebrate deity women between the ages of ten fifty were banned from worship but last month India's Supreme Court ruled that discrimination\nThousands of police are surrounding the temple to ensure the safety of female worshippers but protesters have blocked their access and hard line Hindu groups are threatening mass suicide by self immolation if women are allowed to enter Lauren Frayer NPR News\nMumbai there was no winner drawn in last night's mega millions lottery the jackpot rolled over it is now swelled to eight hundred sixty eight million dollars the Associated Press says that's the second largest jackpot in us history it's the biggest ever for the mega millions the next drawing\nWill be on friday on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes a super super learn more at Subaru dot com\nNPR News Nashville this was Ninety point three W peel in National Weather today so these guys in the mid ... mostly clear tonight and below around forty it's only again to more than a high and you're sixty two [noise]\n\n[noise]\n\nThis is one a I'm Joshua Johnson in Washington wonder Native American voters thinking about for the midterms much more than what's happening with Senator Elizabeth Warren and President Trump their ongoing feud over Warren claiming to have tribal ancestry\nThe senator has addressed her heritage in the past including at this year's National Congress of American Indians\nI get why some people think there's hate to be made here\nYou won't find my family members on any roles and I'm not enrolled in a tried and I want to make something clear\nI respect that distinction I understand that tribal membership is determined by tribes and only by tribes my mother's family was part Native American and my daddy's parents were bitterly opposed to their relationship\nNow in the scheme of things does it matter if Senator Warren really is a verifiable tribal heritage\nClearly it does to her especially after the president referred to her as Pocahontas and said he would give a million dollars to the charity of her choice if she could prove or ancestry that apparently led the senator to take a DNA test results she says prove that she is charity\nThat drew criticism from tribal leaders like the Cherokee Nation secretary of state Chuck Hoskins junior\nWe're now at the point where she's taken a DNA test and this I think money to the waters for a lot of Americans on a subject that they don't know a great deal about so that's what the concern is is that we're a sovereign nation we have a very specific means by which you are a turkey citizen that's true of all Indian nations and for a senator in this context of this ongoing back and forth political\nA fight or to talk about DNA I really undermines tribal interest frankly\nOn top of that the test did nothing to stop the presidents insults he tweeted quote\nPocahontas the bad version sometimes referred to as Elizabeth Warren is getting slammed she took a bogus DNA test and it showed that she may be one one thousand twenty fourth\nFar less than the average American now Cherokee Nation denies her quote DNA test is useless even they don't want her phoney and quote\nWhat is the story actually mean for Native Americans right now and what else matters to these voters that the rest of America should know about joining us via Skype from Anchorage, Alaska is mark ... the editor of Indian country today he's also a citizen of the show need Bennett's nation mark welcome to the program\n[noise] thank you delighted to be here\nHere with us in Studio is Carrie levine a senior reporter for the center for Public Integrity Kerry welcome back thinking and joining us from NPR West near Los Angeles is Simon ... Smith a Chicano writer and reporter and the CNN contributor he's also an open ... citizens Simon glad to have you with us\n\n\n\nSupport for NPR comes from the station and from St Martin's press publishers of them why we hate each other and how to kill a book from US Senator Ben Sasse about the state of politics and the country's future available where books are sold\nAnd from home advisor matching homeowners with home improvement professionals for a variety of home project from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home adviser dot com\n[noise] this is one a I'm Joshua Johnson we're discussing the impact of Native American voters and candidates in this year's midterm elections\nWith Simon Malia Smith a Chicano writer in reporter CNN contributor and in a glut Lakota citizen mark ... editor of Indian country today and they showed ... citizen and carry levine a senior reporter for the center for Public Integrity\nWe'd love to hear from you to share what you know about the impact of Native Americans at the midterms this time around comments on our Facebook page tweet us at one a or email one at a at W. A. M. U. dot org we heard from quite a few of you who shared your stories\nAbout exploring your tribal ancestry about what that means to you in the context of your life here's one voice mail that was left in our inbox\nHigh cash this care elaborately uh I found out about oh four or five years ago that we had a lot of documentation from my mother to uh that we were part of the ... tribe in Oklahoma we applied to be a member of the ... tribe we were accepted and it's\nBeen a real joy to be a member 'cause we um we can vote now we get all kinds of information from them what they're doing with the tried just amazing\nCarol thanks very much for getting in touch with us mark ... can you give us a sense of uh what the process is for becoming an acknowledged tribal citizen understanding that every tribe has the right to set its own process and they can be be quite different but ... broadly speaking what what does it take\nYou usually a tribe has an enrollment committee of some kind that actually goes through and sets out the process required proving family connections to Simon said are looking for I'm basically I'm a history of involvement with the tribe that goes back I'm a retired\nI mean one of the I think really important ideas and this is that I'm a tribal community has one that's been around\nIn many cases for tens of thousands of years and so this idea of a long arc and being part of that is I think really important what was the things I Love to think about as a shoney's was hundred bastard on\nHunted massive on\nHow to best it I think about that long arc\nYeah yeah I it's I Can't imagine Simon the benefit of just kind of knowing\nThat you're part of a community that goes back\nMillennia you talked about appropriation by whites of tribal culture are there other kinds of benefits that you find whether their intrinsic or extra benefits\nOf being and acknowledge member of a tribe that are worth protecting that are worth keeping in their proper places I mean Carol talks about being able to vote in the tribe and also just knowing what the tribe is doing what are the kind of benefits are there to being an acknowledge citizen of a truck\n[noise] well I think what you kind of hit it right there with that\nWeb streaming is made possible by the Nashville repertory theater presenting the regional debut of adult cells part to October eleventh through November third this clever show imagines what happens Fifteen Years after the classic play adults house when Norah returns tickets at Nashville rep dot org\n[noise] you know they they the problem is some of them take our culture and they can modify it\nThey take our language and they can modify it they take our spirituality and can modify it and they make money\nThey make money off of something that they just either learn they are or it's been a part of their family lore or they speak with them mugging titled meant\nLike they've lived the life of a native like somebody who's ever called them an engine or a or word the name of the Washington football team and that's where it becomes problematic and we have to check these allies out the door even if it's Elizabeth Warren\nI should know by the way it was almost exactly a year ago today that we did a discussion about these DNA testing kids the ones that say find nurture ancestry and learn what your family's from\nWe did a program today's October seventeenth we did it on October Eighteenth of last year called ... where do we come from where we spoke to a geneticist\nNamed Adam Rutherford who's gone into some of the latest research about would be and they can and cannot tell us about ourselves and what you actually need to know if you were going to do one of these home DNA tests\nYou'll find that conversation with Adam Rutherford on our website the one a dot org that's the word the the number one the letter a dot org\nBrittany tweeted I Am a county and kick Hanukkah or mohawk and I'm frustrated with people claiming native as a race and doing nothing to help me to issues or thinking that they're uninformed opinion on native issues is helpful\nYou a progressive tweeted what we're not talking about now is North Dakota voter disenfranchisement please focus on this\nYou ate progressive she must have known why we both Kerry living 'cause we're going there next because over the past few days there's been this story about Senator Warren but Kerry we wanted to invite you on specifically to talk about what you would progress has brought up there's a lot of focus on what's happening in North Dakota what is going on there\nWell North Dakota has a voter identification law that has been stayed by the courts until now last\nWeek the Supreme Court I decided to essentially let it go into effect for the November election so what that means is new voter id requirements are going into force a month before the election\nAs you may know North Dakota is home to a very critical Senate race the race between us and our Heidi Heitkamp who is one of the most endangered Democrats and the Senate and us wrapped Kevin Cramer\nHer Republican challenger polls have Kramer ahead\nIn twenty twelve setting the high camp one her race by fewer than three thousand votes\nWith a very strong support from Native American voters she had a very strong support from three counties in North Dakota that that are majority Native American and so this lunar id law could potentially saw heavily upon Native Americans courts had stayed at\nBecause they said that that north Native Americans in North Dakota we're less likely to have the types of ID that were required the types of supplemental documentation that was required to get the idea and the first place\nAnd what kinds of ID are we talking about like what does the law requires the central\nHere is that the law requires an ID that carries a residential street address that's an issue because on many reservations that most people don't have that they have PO box is they have mailing address it and those addresses are no longer sufficient\nSo if you have ID but it carries a mailing address like a post office box you can no longer use it to them\nHi Mary when this law was said by the court but that idea used in the primary is no longer good for the general\nElection a lot of these voter ID laws that have come up in the last few years have been justified by their supporters as an effort to root out voter fraud has that been the argument among the supporters of North Dakota as well\nAnd that's essentially correct It's been\nUm talked about as a measure to prevent voter fraud and also\nBecause the the state has argued that a mailing address\nDoesn't necessarily locate a voter in the correct precinct if you have a local race on the ballot someone could use a mailing address and and even added vertically vote in the wrong local district in the wrong local race so it's it's also a vote or die Lucian argument that that inappropriately cast a ballot in the wrong precinct would just would\nDilute the ones that were correctly cast if your mailing address to somewhere different than where you actually reside\nWould love to hear from some of you if you live in areas where this kind of voter id law affects you particularly if you are part of a tribal population there reservation maybe you live in an area where folks predominantly have fuel boxes as their primary mailing address rather than a physical street residential address\nWhat are you seeing and how is this affecting you whether you are in North Dakota or elsewhere love to hear from your your North Dakota but email us one a X. W. A. M. U. dot org tweet us at one a comment on our Facebook page\nJerry what did you hear from people in North Dakota about how this law is affecting them is this on people's radar as this kind of more of a a smaller issue\nI'd say it is and also you have to put it into the larger contact\nI'm Sorry you see it as it is a big issue or does this ...\nOh I think it's really on people's radar absolutely an issue and I also think there's some context around it when I was reporting from North Dakota from the Standing Rock reservation which is in North and South Dakota but the north Dakota part is affected by this\nI'm a you know really one of the things that I was interested in one of the reasons I went there even before the Supreme Court ruling is because voter turnout there is the lowest in the state\nAnd Quinn stone for financial helping clients see where they're headed financially and working with them to achieve their goals more information and details on scheduling a financial physical are online ad Q. S. dash financial dot com [noise] powerful membership campaign begins on Monday when you support Nashville public\nRadio you'll not only help pay for the programs you value you'll also have a chance to win a thousand dollar Amazon gift card three nights that OK Vin spa or seven months in Costa Rica make a guess now at W. P. L. N. dot org\nSupport for NPR comes from this station and from Subaru featuring the all new three row ascent with eating for up to eight and a choice of second drought captain's chairs love it's what makes us Subaru Subaru learn more it Subaru dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more fidelity dot com slash wealth fidelity brokerage services El Al ... and from Americans for the arts\nTomorrow we'll continue our conversation about the mid term elections with a national look at major races and issues we booked a great panel but we could use your help to focus the discussion what are your main questions and your main concerns about the midterms candidates polls voter turnout controversies or anything else\nLeave us a voicemail eight five five to three six one a one a which we talk about tomorrow when we talk about the midterms on a national level it's eight five five to three six one two one two\nYou can also send us a radio quality audio file through our app won a vox pop you can download the app that's V. O. X. P. O. P. in the store and we'll share some of your questions and thoughts tomorrow [noise]\nBack now with mark ... of Indian country today and carry levine of the center for Public Integrity\nLet's turn now to the number of Native American candidates on ballots across the U.S for the midterms we'll hear from one of those candidates in a moment but first mark I'd like to come to you you've been following Native American candidates for years what are you seeing this year that is the same as the past or is it may be different\nOh it's a record breaking nearby I ah almost every measure at this point past the primaries more than a hundred or candidate\nUm we have for the first time ever more women than men running for office or just look at lieutenant governor with a five candidates for lieutenant governor across the country three candidates for governor across the country\nUh nine for the U.S house of representatives it's just pretty extraordinary also ups are breaking news uh yet just yesterday\nThe lieutenant governor of Alaska Byron the lot who as Clinton resigned and was replaced by a\nDirector of health and Human Services and Alaska Valerie Davidson is you pick as she is now the first native woman to ever be lieutenant governor of estate\nWow but just as of like the last twenty four hours yes can you give me a sense mark and this may be kind of a facile question but\nWhat does it mean to to folks of tribal dissent to see other people have tribal dissent in these kinds of positions senators members of Congress lieutenant governors governors can you give me a sense of intrinsically what that means\nWell I mean there's the old joke that if uh you're not at the table you're on the menu and that's certainly part of it but uh\nCycle with the news Juno who's running for the house in Montana and everywhere we went a little girls would come up to her and want their picture taken with her and you just saw this deep sense of wild that could be me some day and that I think is probably the most powerful message out there\nWell we'd love to hear from some of you about which candidates of tribal descent you are keeping an eye on if there are Native American candidates that you are pushing for or that you have concerns about that are on the ballot in the midterms\nWho are you keeping an eye on and why email is one a at W. A. M. U. dot org perhaps one of the candidates what's on your radar\nIs Deb Holland who joins us by phone to talk about her experiences she's a democratic nominee for New Mexico's first congressional district and she has a Pueblo of Laguna citizen Deb welcome to want to\nThank you so much why are you what made you decide to run for Congress\n[noise] well I've been involved in politics in New Mexico for a number of years and he was just finishing up my term is the state chairwoman of the Democratic\nParty of New Mexico and I just felt that I wanted to continue to uh work for my state and worked for the the people I Love here\nAnd so uh the seat opened up and I I felt that um I Would\nHave a good chance of winning and so I decided to run to be a strong voice for the people of New Mexico\nNo New Mexico's first district just looking on the map that includes Albuquerque and some of the areas south east of New Mexico is that right\n[laughter] so well there's some areas north and there's some there's some areas east and West is two tribal communities and the district Sandia Pueblo and the total harshly a Navajo Nation chapter [laughter]\nSo um so it does it geographically it's not large but it has a very diverse population so that's\nGreat now if you win next month's that would make you the first Native American congresswoman in American history what would that mean to you\n[noise] well of course what I always say is that I Can't speak for my tribe or any tribe but at my perspective growing up uh in to a point below woman uh with my my mom and my grandparents you know teaching may our culture and traditions and just\nUnderstanding you know having worked for several tribes and and understanding\nOf the issues and the challenges that we face a which\nIncidentally are are the same as a lot of other places\nIn New Mexico and across our country so I just feel like having that perspective at the table will mean you know something um something good for a for our country a voice that we haven't yet heard\nGive us a sense of what some of those issues are that might be affecting tribal populations in your district that you'd like Congress to pay more attention to or deal with differently\nSure sure well of course you know there's always housing that's always an issue of for a lot of tribal communities\nBut it's also an issue for a lot of rural communities across our state as well uh\nWe are on in my campaign I have a I have we've made renewable energy I'm pretty much the number one issue that I'm campaigning on and I think that that would create thousands of jobs for the district and not just in the in the city of Albuquerque but\nIn the rural communities so um so that's one thing turtle communities always always care tremendously about our education system\nAnd so that's something that that is high on my list as well as well as health care right we\nMedicate eligible that includes a twenty two tribal communities that we have here in the state and so uh that's always a an important issue as well\nWe're speaking to them hauling the Democratic nominee for New Mexico's first congressional district she is a ... of Laguna citizen\n... I I have no context for dealing with tribal populations in politics and you said there is quite an array of diversity among the tribes that would that you'd be representing\nIn Congress can you give folks just a sense of what it's like to try to represent the issues of all those different groups do you find that there is a handful of issues the kind of overlap every one or do you really have to be sensitive to what this tribe is asking for versus what does that tribe is asking for and and we are the differences are\nSure I mean I think there's some of that ... ... absolutely there's there you know they'll they'll be some competing issues along the way but but really I'm land water uh our environment is all I mean that's sort of a a\n... those are issues that transcend um you know tribal lines so to speak issues that that all of us are concerned about and so um so I I'm In Iowa lifelong environmentalist and you know I I'm a I'm somebody who used to go down to the\nTo the failed with my grandfather and weeds and pick worms off of corn um so I Know I understand the value of clean water and clean land to our people and I think that is that's an issue that\nTranscends a lot of tribes across the country um but\nYou know the issues you are talking about earlier with voting that that is that's definitely an issue that all of us care about as well because we deserve a to have a voice at the table that's something I've been fighting for for a long time I've I've been\nGetting out the vote in Indian communities for nearly Twenty years because I've always felt that we should have a say in who are elected officials are so um so that's a passion of mine as well\nAnd and I want to work to make sure that that our voices are always heard in that respect\nI don't want to keep you too much longer but I Do wonder what you make of this larger surge of Native American candidates this year ... what do you think is behind that\nWell of course I mean it's a you know it's hard to say exactly but I mean there we can because we've had you know we've had a\nThis is Ninety point three WPN Len Nashville public radio Ninety One point five WTO ... in Ninety One point seven W. H. R. S. Cookeville get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook at W. P. L. N. dot org\nYou can also find scheduled for all of our program channels and listen to a live stream of any of our programming on line learn more about connecting with Nashville public radio at W. P. L. N. dot org\n\nJust losing or gaining weight represent to you for\nOne author it represented thing she avoided talking about but ultimately I have to say\nFrom W. A. M. U. and NPR in Washington this is one egg [noise]\nEither I'm Joshua Johnson today on what age she is a lame in his new memoir explores growing up black in the south and finding his way through life through it all was who struggled with weight at one point going from obesity too excessive weight loss cutting his weight in half will meet TSE layman and explore his new book heavy [noise]\nFirst an update on the U.S in Saudi Arabia switching them has promised a thorough investigation into journalist which I'm all for show but with so much at stake\nAnd that really happened [noise]\nWe'd love to hear from you comments on our Facebook page or tweet us ... one [noise]\n\nLive from NPR News in Washington encore of a Coleman secretary of state Mike Pompeo is in Turkey talking with leaders and reviewing the case of missing Saudi Arabian journalists Jamal ... shape\nThe Turkish government suspects Saudi Arabian official killed him ... met with Saudi officials yesterday who vehemently reject the allegation and say they're investigating the case\nI mean well Pompeo told reporters the U.S has a great relationship with Saudi Arabia I Do think it's important that uh\nKeeping their mind we have walks with important\nRelationship an actual relationships between us Saudi company governmental relationships things we walked out together all across\nReduce the risk to the United states of America and the world's largest sponsor terror Ron Saudis have been great partners in ...\nIn an interview President Trump criticized the criticism of Saudi Arabia comparing allegations against the kingdom to sexual assault allegations against a Supreme Court justice Brett Kavanaugh Trump's as cabinet and he's innocent\nThe Taliban have claimed responsibility for a bombing in Helmand Province that killed a parliamentary candidates three days before the election Jennifer glass reports from Kabul\nThe bomb was placed in the office Abdul Jabbar ... Lashkar Gah the capital of Helmand Province in southern Afghanistan the Taliban control much of the province and say they killed the parliamentary candidate on the last day of campaigning Afghan president Ashraf Ghani called ...\nHe has at least the tenth candidate killed in Iraq the parliamentary elections scheduled for Saturday when the Taliban and Islamic state has mounted disruptive vote and called on Afghans to boycott it I just ... centers election workers and pulling sites have all been attacked with more than two hundred and Seventy people killed or wounded printing I needed I'm Jennifer glass in Kabul\nOfficials in Canada's say now move forward with a plan to pardon Canadians convicted of simple pot possession charges as Dan carbon jak reports the move coincides with the legalization of recreational marijuana which came into effect today\nThe government will issue pardons not an ad in the state or the expungement of records the cardinals will apply to anyone charged with thirty grams or less of marijuana\nThat main cabinet ministers on the Canada's file public safety justice health and border security will lay out the plan in broad terms of the news conference in Ottawa sources say the pardons won't be granted right away and there will be several options that could be used to facilitate the process was to have people fill out a form to qualified\nPrime minister Justin Trudeau had promised to address the pardon issue as soon as legalization of recreational marijuana came into force\nIt's estimated that hundreds of thousands of Canadians carry possession charges on their records for NPR News I'm Dan carp and check in Toronto\nOn Wall street the Dow Jones industrial average is down two hundred eighty four points or more than one percent you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include his car insurance providing customize insurance for small and medium businesses so they can do more and be more learn more at age I. S. C. O. X. dot com or from an agent Hitchcock's insurance encouraged courage\nWith NPR News in Nashville this was Ninety point three WPN Lynn I'm Jason Wilkins\nDemocrat Phil Bredesen out raised his Republican opponent Marsha Blackburn in the lead up to the Senate election the tendency in reports that individual donors gave nearly two million dollars more depressing than black burn during the last period\nBut outside groups like super PACs have been largely supporting Blackburn and they're spending especially on TV attack ads\nAccording to the latest campaign finance disclosures total spending and the race has\nExceeded fifty million dollars that makes it the most expensive US Senate race in Tennessee history and the majority of that money has come from outside groups\nEarly voting on the Senate race as well as numerous other contest in reference starts today\nDemocratic Karl Dean is being supported and the governor's race by a group of prominent Republicans including would've Nashville's most well known philanthropists and the video released yesterday music business giant and former lieutenant governor of California might curb touted his own political past as informing his decision to back dean\nI have served as the acting governor and lieutenant governor and president of the Senate and a large state and I've also served as the national co chairman for the Ronald Reagan presidency campaign I Know how very hard it is to try to please everyone\nCurb praised deans handling of the catastrophic Nashville flood as well as the former mayor supported the city's health care and tourism industries in addition to curb the Nashville posed points out that the group also features best fortune she served as senior advisor to Republican bet Har wells unsuccessful bid for governor this year\nA new land purchase in any out may take the sting out of the recent reversal of plants by Swedish home goods giant ikea\nThe natural Business Journal reports the company behind tanker factory factory outlets has agreed to buy a piece of the century farms development\nThe one point seven billion dollar mixed use project located off of vi twenty four took a big hit earlier this year when I hear backed out of bringing one of their stores to the site the journalist is to anger has been scouting national for years and while it won't publicly confirmed to move the L. O.\nIt sold member it's you know six [noise]\n\nThis is one a I'm Joshua Johnson in Washington Washington Post columnist and us resident ... has been missing for more than two weeks and there is still no official line on what happened to him\nTo show she disappeared after entering the Saudi constantly in Turkey this month Saudi officials say he left the building\nTurkish police say he was killed and dismembered inside\nSecretary of state Mike Pompeo is overseas looking into this here he is speaking to reporters yesterday before boarding a flight from Saudi Arabia to turkey\nAnd made a commitment to hold\nAnyone connected to any wrongdoing that may be found accountable for that whether they are a senior officer official they've promised accountability for each of those persons who may determine as a result of their investigation deserves accountability\nMade no exceptions to who they would hold accountable\nSecretary Pompeo is in Turkey now meaning it's president and its foreign minister meanwhile President Trump has defended Saudi Arabia's leader Mohammed bin ... from accusations that he ordered ... killed most recently he told reporters quote here we go again with the you know guilty until proven innocent unquote\nSenator Lindsey Graham has long been a vocal defended of Saudi Arabia but he told Fox News that bin ... has a lot to answer for\nI Will not have my intelligence insulted or my support disrespect that I was the leading advocate for Saudi Arabia coast they're strategic ally and Donald Trump President Trump has been tremendous\nTo the country Saudi Arabia [laughter] this is the most disrespectful thing I've ever seen tour depressing ... he's a strong man President Trump this will not go on answered\nPlenty to discuss with this story and we'd love to hear from you ... ... email us one a at W. A. M. U. dot org your questions your thoughts comments on our Facebook page or tweet us at one a\nJoining us to break this down is Robin Wright she's an analyst at the Woodrow Wilson International Center and the author of rock the cast by rage and rebellion across the Islamic world Robin welcome back to what I\nAlways good to be with you\nLet's get this bill a little bit of context for this first of all help us understand why President Trump has invested so much political capital in Saudi Arabia he's not the first US President to do this but what his strategy what's his and the game\n[laughter] well Saudi Arabia has been a centerpiece of his foreign policy and a pit in three of his most ambitious\nForeign policy goals first to find an elusive\nPeace agreement between the Arabs and the Israelis a second lead to organize a counterterrorism campaign and the age of ISIS in third to squeeze Iran to change its behavior and potentially even to change the regime and in each case uh the kingdom as\n\n\n\n\n\n\n\nSupport for NPR comes from this station and from babble European made language learning program that teaches practical conversation in Spanish French German and other languages available in the app store or online at B. A. B. B. E. L. dot com\nAnd from at last than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nBusiness one a I'm Joshua Johnson what does it mean to be heavy objects can be heavy people can be heavy history the nations of the world's or our own can also be heavy in any case the word refers to something that's hard to deal with or move or just to think about [noise]\nShe is a layman explores all these meanings in his new memoir called heavy it's about the weight of lies of the past and about the weight of his own body which has changed quite a lot over the years\nIt follows him from growing up with his mother a college professor in Jackson, Mississippi to his own life as a professor at Vassar\nThese days he's an old miss the University of Mississippi where he is a professor of English and creative writing and he joins us now from the University He is a lame insects for being here welcome\nThanks for having me how to be here we'd love to hear from you especially if you've read\nAny of professor layman's essays or his novel long division comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org your memoir just came out and I imagine that a number of people who are listening have not had a chance to pick it up and read it yet so I Wonder if we could start by asking you to read\nFrom the very beginning just right on all of page one in like two thirds down page to I I've I've got mine with me so if you wouldn't mind actually\nBeen I did not want to write to you\nI did not want to write honestly about black lives black dies black loves black labs to black foods black addiction black stretch marks black dollars black words black abuses black blues black belly buttons black when black beans like bans black consent black parents are black children\nI did not want to write about us I Want it to write in America memoir I wanted to write a lie I wanted to do that old black work of pandering in line to folks who pay us to pander and lots of them every day\nI Want it to write about our families relationships the simple carbohydrates deep fried meats and high fructose corn syrup or I Want it to book to begin with my way up three hundred in Nineteen pounds and and with my way and one hundred and sixty five pounds\nI Want it to pepper the book with the Serbs warnings to us fat black folk in the deep south and saccharin sentimental expectations from grandma I did not want you to laugh\nI wanted to write a lie\nI wanted to write about how fundamental present black grandfather's responsible black mothers magical black grandmothers and perfectly discipline black children our to our liberation\nI wanted to center or something they someone who wants to Dan and dishonest or one white Americans who have proven themselves even more unwilling to confront their lives to consider how their lives limit our access to good love healthy choices in second chances\nOr want it to book to begin in and with the assumption that if white Americans reckon with their insatiable appetite for black Americans suffering and we reckon with our insatiable appetite so unhealthy food we could all be assured into a reform to Arab American prosperity\nI wanted to create a fantastic literary spectacle I wanted a literary spectacle to asked nothing that view grandma or me other than All right here and to a low carb diet limited sugar weightlifting twelve thousand steps a day gallons of water and not eating after midnight\nI wanted you to promise I did not want you to remember\nI wanted to write a lie I Want it that law to be ... I wrote that lie it was to the lady you would've loved it I discovered nothing you would have loved it I started over and wrote what we hoped I forget\nThe opening lines from ... new memoir heavy who are you writing to\nHim directly addressing my mother I'm with an awareness that this book hopefully as going out to the nation and I'm particularly writing to my region and the deep south uh Mississippi\nWhy began with what you're not going to write editing phrase it as such a kind of a sucker punch\n[noise] ah I wanted to be a bit bombastic in the book but I also wanted the first few lines and the first few pages of the book to feel as if they were directly written to my mom and\nI think it's important for me to tell my mother and tell the world that you know I wanted to write a book that my mother would enjoy as opposed to run in a book that I think my mother and I could actually work with\nThe imposed as a pressure I think for most writers to write what they think I'm the market might necessarily embrace an easy way\nAh and yeah initially I wanted to write to and I started writing that book and I actually wrote that book and then I started over and I was like you know I think that's a shiny book I think it's maybe interesting book to people but it's dishonest so you weren't\nKidding you actually wrote this kind of shiny respectable memoir that you thought would be more marketable and then got half way through got to the end there were like I Can't put my name on that\nYeah the book I saw was a weight loss book I was going to lose a hundred and fifty pounds to talk to my mother talked to my grandmother talk to my aunt's about their relationships with weight\n... is made possible by electronic expressed with a comprehensive selection of smart appliances for Katie's computers accessories for the smart home available in stores or online at electronic express dot com code WPRI\nWeren't true and then I decided to try to craft a novel I mean ... to craft a piece of nonfiction to specifically my mother I'm searching for honesty right which I think it's different than the truth\nSo I just went got through the end of that process and realize that the book wasn't at all I'm doing the work that I think I needed to do or in my family need it and then I wrote back to them\nUm after that initial long process\nWe're speaking to kiss a layman author of the new memoir heavy we'd love to hear from you especially if any of the themes\nIn his work resonate with you or maybe what you're hearing now resonates with you these themes\nOf the weight of deception of respectability particularly things of violence or bodily violets are dramatic change that resonate with you we love to hear from you tweet us at one a comments on our Facebook page or email one a at W. A. M. U. dot org you dedicate the book heavy\nFor the porch that grandma built what do you mean by that will\nLiterally to book started when I was twelve years old right and on my grandmother's porch we just come back from church she gave me a notebook with she always there Sunday as opposed to write about a a sermon we just hurt\nThe sermon was using a book Islam so instead of writing about the book a song I wrote to her about something I experienced a three days earlier at a friend's house and so many experiences that I had and the bedrooms are my actual house\nUm and so I wrote those things to my grandmother because I didn't know who else to talk to about it and my grandmother that Tom to me was this like perfect um bodily walking wisdom and so I thought she could help me understand when I was feeling and why I was feeling because none of the films that I felt then we had been felt before by me\nI gave the noble to my grandmother and instead of talking to me about it she looked at it she close it she walked away and we didn't talk about it at all so\nThat that porch which is literally to push that she built on a house that she owned a small um place called forest Mississippi\nIs where the book began literally and so fully is also where the book began because we have a boss or hurt as a kid so many incredible conversations between my mother and my aunts and my grandmother happened on our porch and I wanted to bring someone at a rally um and some of that communal reckoning familial reckoning to the book\nSo vote that porch the book necessarily would not be here um so I just wanted to dedicated to something that she built something she made possible\nWe are hearing from some of the fans of your work including the shell who tweeted I have finished the book and I love it one of the most powerful aspects she's rendering of his relationship with his grandmother not since Ernest gains have I've been so moved by representation of older southern black folks the book is amazing\nYou call the book heavy and on the very first page ground\nThis kind of goal to begin weighing three hundred Nineteen pounds and end by weighing one hundred sixty five pounds right I'm assuming you don't mean like\nThree hundred Nineteen like power lifter pounds like an obese three Nineteen to a ... athletic CrossFit ask one sixty five is that right ... again that's what I wanted\nTo do that the book I saw when I when I saw the book I was three Nineteen I wanted to get down to I mean for me if I get down to one sixty five I'm nuts felt at all I'm I'm pretty bony but my head never changes which is the weird thing and it you know I'm just a Bible headed\nSustaining members of Nashville public radio our hallways automatically entered in any other ways we have in our upcoming fall membership campaign will be giving away a feather ninth trip to Costa Rica and the one thousand dollar Amazon gift card you can become a sustained her right now at W. P. L. M. daughter words [noise]\n\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from the John D and Catherine T MacArthur Foundation at max found dot org\nBefore we get back to our conversation we would love your help with tomorrow's program about the job market America has a record number of a job openings right now more than seven million tomorrow will be in New Hampshire to explore why finding the right workers it's getting harder\nIf you run a business have you been able to hire to help you need heavy maybe had to sweetened the deal to attract new staff\nLeave us a voice mail eight five five choose three six one a one a now maybe you're looking for a new job how do you feel about your options in the labor market right now\nTell us your story eight five five to three six one a one day you can also leave us a radio quality audio file through our app won a vox pop will share some of your stories tomorrow from New Hampshire on one day back now\nIs called heavy we'd love to read your questions and thoughts about the author has worked or any of the themes that resonate with you comment on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org\nLet's read one more eggs or from the book this is about something that happened to you and your mother or when you were younger not real far from here in Maryland and it is all on page Amy one would you mind reading from it's about halfway down patriots won the part that begins when we were half a mile from home\nSo almost the end of page eighty three which ends with the word flying would you read that for us please\nA sure anyone on the officer while we were having okay\nWhen we were half a mile from home in Maryland police cars stopped us just like when they stopped us in Mississippi you set up in your seat ... kept both hands on the wheel and looked straight ahead\nYou took out your University of Maryland I D and suck my red black and green African medallion into my public enemy T shirt you told me to sit up keep my hands on the dashboard don't say a word\nOfficer knelt down and lifting your window when I saw your face so close to his gun I Want it to snatch it and watch it melt into black grits evidence police started approaching me more often and Mississippi I wanted a superpower to melt every gun in the world and the black grits officer asked why we had Mississippi license plates\nBecause we are residents of Jackson, Mississippi you say\nI have a post doctoral appointment at the University of Maryland College park have done anything wrong officer when officer told you to speak up and claim your change lanes without signaling you kept your grip\nOn the steering wheel and said I did not change lanes without signaling you spit up behind me so I signaled and changed lanes officer tried to laugh in your face as he asked for your license and registration\nIs that your man he asked you he needs to show some identification to\nYour hands came off just staring well and you pointed at the officers face move away from my car you said that as much out he is Fifteen Years old he does not have identification may I have your badge number please\nI hated how it sounded when you didn't use contractions golf to ask both of us to step out of the car we will not get out of his car you said louder this time we have done nothing wrong\nMy fist were bald up and I was edging towards the driver's side window you slapped me across much that's what the back of your hand and told me to be quiet and unconscious office right as another officer pulled up the first officer who is now laughing walked back to the second officers car you\nEventually show the second officer your license and your University of Maryland I D\nD officer looked at the id flipped it over and told us to have a good night never give them a chance to take a shot you finally said after we walked in the apartment and lock the door they will take it they will take it they will take it and wonder why you said it three times and why you never told me to shoot back\nMississippi Marilyn it doesn't matter where the where you are they will shoot Joe Black but out of the sky every chance they get if you have a heart attack dodging bullets they hide their guns and say you kill yourself\nI hear you I told you and try to make you laugh\nWhy didn't you just said don't instead of does not or doesn't\nAnd they instead of their though\nIf I did not know correct English is more likely that officer might have shot us you say oh you wouldn't I told you that for that matter because you were speaking correct English you looked at me like you were thinking\nYou might actually be right key but in the long run correct English will save a black man more than it will hurt you will correct English they view though I Do not nice\nEndangered species I'm not either I told you I Am an endangered species would a lot of gas in my stomach I'll be right back that cop game in a bubble guts you laughed and laughed and laughed until you didn't\nWhile I was in my room change and you told me to write about what I learned from the experience with the police I wasn't sure what the right because I wasn't sure how to live life in a way that didn't give them a chance to shoot us out of the sky\nIt seemed like just driving or walking into a house or doing your job or cutting a grapefruit was all it took to get shot out of the sky and the biggest problem was police weren't the only people doing the shooting\nThey were just the only people allowed to walk around and threaten us with guns in prison if they didn't like our style of flying I loved our style of fly\nAt other eggs or for heavy bike yes they leave and there is a lot going on to the eggs are but I think one of the census from the last paragraph struck me where you write I wasn't sure how to live life in a way that didn't give them a chance to shoot us out of the sky right is that kind of the crux of it\nYeah I mean that's a crust of a lot of uh the relationship are talking about in this book with my mother um I'm also talking about a situation where we went to had to go to a new school in eighth grade was first time I've gone to school with white kids\nAnd a few of my best friends from a previous school were there and one of my best best friends um took out a butter knife before school started and started trying to cut his grapefruit the same way you did every morning when we were at a school in Jackson and long story short you know the teacher uh eventually told them put the knife away treated the knife as if it was a gun\nOr we both got kicked out of school that day and we got what to buy our mothers and grandmothers\nAnd in that situation I learned that sometimes in off in a mock communities um it was black mothers primarily who had to discipline their children for the failures of their teachers\nAnd so uh my mother would always say you know you have to fly right you know don't give them a chance but I'm saying as a Fifteen year old I said I'm not sure what you're not giving them a chance to look like\nEating a grapefruit got us in trouble just now you didn't do anything we got in trouble later I Would take a library book out an elaborate without checking it out\nAnd that got in trouble so I just wasn't sure\nAbout this this a theory my mom my head that you know you conduct them you can dodge them if you just anticipate every move and again anticipation is crucial but what happens to the home life when you spend your entire life outside at home anticipating white supremacy and white power doing un that's the question I'm trying to ask you miss the action and also in the entire book\nWhat did happen with your home life particularly with with you and your mom is you were trying to grapple with these things that she was telling you or the way of the world and you were trying to understand and how did that affect your relationship with her\nYou know one one way I think a lot of just traditionally American things happen I started to be resentful that my mother was telling me things some things that were right some things that were wrong\nUm she started to be a a a lot more active in trying to police me as my body group um and I started to have lots and lots of run ins with cops are starting to get kicked out of school more [noise]\nUm but and we could talk about those things sorted we could talk about police we could talk about why people but we we couldn't talk about with things like sexual violence so we couldn't talk about what's like domestic abuse she was in an abusive relationship I saw that relationship I reacted to that relationship I tried to fight and protect different relationship\nBut I Would never talk to her about that fighting that protection she saw me and relationships that were like difficult for me where I was being bad to myself well I was mistreated people emotionally we didn't know how to talk about any of it so while we're doing really good sort of talking about how we survive outside of the house\nThe particular kinds of violence has happened in in my house were completely um silent we never\nI was forty two forty one years old to have the guts to actually write into some of what was happening in our house and try to connect that to what was happening outside of our house I Want to talk", "year": "2018", "show_name": "1A Plus", "city": "Nashville", "day": "17"}