{"month": "10", "state": "TN", "station": "WPLN-FM", "content": "This is Ninety point three WPN land National Public radio Ninety One point five WPN mountains of Houma and Ninety One point seven W. H. R. S. cook them get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook W. P. L. N. dot org\nYou can also find schedules for all of our program channels and listen to a live stream of any of our programming on mine learned more about connecting with Nashville public radio at W. P. L. N. dot org\n... McDonald an unarmed black teen who's killer a white police officer awaits sentencing when when this case I mean in the fight for police reform\nFrom W. A. M. U. and NPR in Washington DC is one a [noise]\nA there I'm Joshua Johnson today on one age the future of law enforcement Chicago police officer Jason Van Dyke could spend years in prison for second degree murder\nIt's a rare conviction some activists considered it unlikely and some in law enforcement considerate heavy handed [noise] what what happens now in the larger push to rebuild trust between police and the public especially in communities of color\nWill explore that today and we'd love to hear from you sure what you know if you're working to improve policing from the inside or the outside female won a a W. A. M. U. dot org comments on our Facebook page or tweet us at one day [noise]\n\nLive from NPR News in Washington on trial Snyder\nMandatory evacuations have been ordered for more than a hundred thousand people on Florida's panhandle hurricane Michael remains a category three storm but forecasters say it's getting stronger that Michael will come ashore Wednesday as a major category for storm\nNPR's Greg Allen reports Michael is expected to bring punishing wins a massive storm surge\nMichael is in the Gulf of Mexico heading north expected to come ashore between Pensacola an Appalachian cola with a storm surge forecast as high as twelve feet long Florida's Big Bend area in Tallahassee retired firefighter Errol barber was picking up last minute supplies\nHigh winds will likely knocked down trees and power lines and he says he could be without electricity for days oh yeah we\nIs definitely going to not about the question is how long that's going to be the question\nMichael is expected to weaken after making landfall but bringing heavy rain and tropical storm force winds as it moves through Georgia and the Carolinas breakout one NPR News Tallahassee\nPresident Trump continuing to bless Democrats and protesters for their opposition to Supreme Court justice Brett Kavanaugh NPR's Ayesha Rascoe has details on what the latest from Trump on the campaign trail\nTrump said Democrats will try to impeach Kevin ... they take control of Congress and a campaign stop in Iowa Trump said the fight against Kavanaugh will not and now that he's on the bench\nFrom the very first Brett Kavanaugh was nominated radical Democrats were on a mission to resist obstruct LA demolish and destroy they want to destroy that ban\nThe fight over that Kavanaugh's nomination has become a rallying cry for ... and Republican lawmakers ahead of the midterm elections in November Ayesha Rascoe NPR News Council Bluffs Iowa\nOr earlier in the day President Trump appeared alongside the United nations ambassador Nikki Haley as she announced her decision to resign the two made the announcement to reporters in the oval office Haley plans to leave the post at the end of the year President Trump says he has five people on his shortlist of replacements\nState Department spokeswoman Heather Nauert says the U.S is not going to make any judgments about what has happened to the missing Saudi journalist ... she told reporters at the state department that the u._s. lax information but she said there is concern about his whereabouts\nSenior officials that the state department has spoken with Saudi officials through diplomatic channels about the matter we call and the government is Saudi Arabia to conduct if there are ... and transparent investigation remote\nShow he is known as a critic of the government of his native Saudi Arabia he has not been seen since he entered the Saudi consulate in Istanbul last week Turkish officials have said they believe ... was killed inside the diplomatic mission and on Monday\nTurkey's president as Saudi Arabia to prove that he left the consulate you're listening to NPR News\nPolice in Bulgaria say they're questioning suspecting connection but the rape and murder of T. V. journalism Victoria ...\nNoble was investigating fraud allegations involving European Union funding in South east European governments Rob Mahoney us with the committee to protect journalists he told NPR's MORNING EDITION it's not clear married over his work is linked with her murder\nAt this point it's too early to say that you know that's why we want to please to do a credible job of investigating this because I'm In the past that's not always been the case um if\nIf there is a link between reporting she won't be a journalist in the European Union have been killed in the last month for doing investigative reporting\nGary in government officials are insisting marital was murder was not connected with her work but have not cited evidence the Nineteen eighties metal band or a leopard among the first time nominees to the rock and Roll Hall of fame [noise]\n\nBritain singer Stevie Nicks among Fifteen acts announced Tuesday is\nNominees Knicks already in the hall she was abducted Twenty years ago as a member of Fleetwood Mac she's now been nominated for her solo career the duck these will be announced in December and be inducted into the hall of fame at a ceremony in March ...\nMajor league baseball the Boston Red Sox play the Houston Astros for the American league pennant Boston advanced into the championship series tonight\nBeating the New York Yankees game for their division series on trial Snyder NPR News from Washington\nFor NPR comes from NPR stations\nLife lock with Norton works to help protect identities and the information on devices from cyber criminals learn more at life locked dot com and the ... foundation at ... dot org\n[noise] [noise] [noise] [noise]\n[noise] Mm [noise]\n[noise]\n\nThis is one day I'm Joshua Johnson in Washington on October twenty twenty fourteen a teenager named ... McDonald was shot dead by Chicago police officer\nMcDonald was shot at sixteen times as he was moving away from police vehicles video of his death would go unseen by the public for more than a year and when the footage did come out it sparked protests across Chicago [laughter]\n\nOfficer Jason Van Dyke was charged with first degree murder that day\nLast week a jury convicted Van Dyke of second degree murder and sixteen counts of aggravated battery with a fire off\nWe signed up for the fire fire sale aggravated battery was higher than ... than\nThe battery fire\nThere one\nBattery out for each bullet the conviction surprised many people Van Dyke is the first Chicago police officer in fifty years to be found guilty of murder diverted led some to wonder if this marks a new period of accountability for police\nOfficers and police department [noise] use change on the horizon\n\nWhat does this verdict mean for police reform around the country [noise]\nJoining us from WB easy Chicago public media is it's criminal justice reporter Patrick Smith he's covered the clown McDonald's case since the beginning and he is also hurting WB easiest pod cast on the case called sixteen shots Patrick welcome to want to say thanks for having me\nAlso with us judge la Doris Cordell she is retired from California superior court system\nAnd this is the former independent police auditor in San jose California judge Cordell welcome it to be also with us from WIP our public radio in Baltimore Neal Franklin is a retired major from the Maryland state police department\nCurrently he's the executive director of leap law enforcement against prohibition it's a nonprofit focused on improving relations between police and the public Neal glad to have you with us\nThank you Joshua Russell glad to include your questions and thoughts about improving law enforcement whether you are a law enforcement officer an activist working for reform or just a citizen in a community that's dealing with this issue what's the conversation like where you live and what are you seeing that works or does not work\nIn rebuilding trust email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one egg Patrick Smith let me start with you\nGive us a quick overview of hula ... McDonald an officer Van Dyke war particularly officer Van Dyke and what his record was like within the police department before all of this happened while the climate\n\nSupport for NPR comes from the station and from bona with the bonus certified craftsmen program a network of hardwood flooring contractors committed to expertise and customer service contractor low cater and more information or at bono dot com [noise]\nAnd from at last seeing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nBecause one a I'm Joshua Johnson we're discussing the verdict in the corn McDonald's case that was a teenager who was shot dead in Chicago by officer Jason Van Dyke we'd love to hear from you whether you're in Chicago or anywhere across the country with regards to what this means\nFor the effort to improve law enforcement in this country comments on our Facebook page tweet us at one eight or email one a at W. A. M. U. dot org let me get to a few of your comments before we keep going Nick is in Wilmington North Carolina\nMick rights I'm In North Carolina and the G O P state super majority pushed a bill through last year to not release any body can footage the public except for family members involved to view if\nI could make one law to increase mixed\nBe Sean wrote on our Facebook page maybe the real issue here is that the criminal justice system in general and law enforcement in particular are being deployed to manage the effects of social and economic problems that they are ill equipped to resolve\nAnd assess wrote on our Facebook page as a white person who works in an office that staffs mostly black people\nHearing stories of police shootings scares me that one day I might lose a loved co worker just because of their skin color when I found out they found this man guilty I was elated it's time for bad cops to stop being protected killers\nDisc or do I know I had to cut you short before we pause I Wonder if we do pick up with sets comment and finding officer Van Dyke guilty it seems rare that officers are convicted after shooting someone under questionable circumstances what's the legal reason behind that\nWell there is a decision from the United States Supreme court that really is the\nKey to all of this and that is the decision that the court made many years ago the grand case that basically said that when you are determining whether or not an officer is engaged in the use of excessive force it much basically\nTake the in the state that that the steps of the state of the officer so it's a very subjective standard what would a reasonable officer have done it in that\nSituation so it is not an object that look is what is the officer feeling what is the officer seeing\nWhat is the officer experiencing so that's what the jurors are required to do it as a result you find very few judgments first of all you know in in civil ensuing police departments a jurors have to again hold the standard\nAnd prosecutors before they decide to to charge the officer have to look at the standard and say what would an officer reasonable officer in that situation had done so it is the Supreme Court that has set\nThis world for all law enforcement agencies in the country\nAnd they are over Eighteen thousand separate police departments throughout the United states they all have different rules but they are all under the umbrella of whatever the Supreme Court set of that is the rule that is out there now\nYou were by the way referring to the keys is Graham versus Connor it's a case from a Nineteen eighty nine and some of you actually comments with regards to what's going on in officers mines like Peter Peter emailed\nIt seemed like to do with the mentality of police officers that their life is paramount beyond all else including their safety I feel like whenever they are threatened with any sort of possible harm to use deadly force in the new somehow justify\nThis is a career in which they signed up for similar to the military where they know they're going to be put in harm's way to protect and serve the are paid for this\nLet's add one more voice to our conversation before we get to some more of your comments joining us now on the line is Shannon Spalding the Chicago police officer who was also a whistle blower within the department who worked undercover with the FBI Shannon welcome to the program\n[noise] thank you Joshua\nNo I understand you had been working as an FBI informant within the department and as a result of what happened that caused some of your fellow officers not to be too fond with you what what happened that caused such a stern did it have to do with with corruption inside the Chicago police department\nAbsolutely dash law I was working as an undercover narcotics officer with the FBI and um I had discovered that\nSome of my fellow officers were actually involved and the money that are kind of trade with and the Chicago area and there for ...\nOperation brass tacks against some of my fellow officers who\nI used the term officer loosely because if you are on the other side of the law you are really not an officer but they did have badges and ultimately that\nLed these officers one of them being a bus to go to federal prison and that made me very unpopular among the rank and file within to Chicago police department\nBecause before I came forward with operation brass tacks the code of silence\nWas unheard of you didn't talk about it it didn't exist\nOr they tried to label me as crazy for believing that this was actually going on within the ... the department so it made me very unpopular and lead to a lot of police retaliation\nI Wonder why that is from your\nPerspective I mean I Can't imagine I've never been a law enforcement officer how law enforcement or my family but I've never taken an oath so I Can't I'm speaking as an outsider\nBut I Would think you know if I knew that there were reporters who worked for my station who were lying in stories and they got caught I Would be grateful to see them go because drugs all of us now why do you think it's not a similar mentality in law enforcement\nYou know honestly a lot of police officers get approach man they still talk to me and you are correct\nOn as police officers absolutely do not want to work alongside with corrupt officers however the code of silence is so strong within the Chicago police department and I feel that does go across departments nationwide that\nOfficers actually\nFear what will happen to them if they break this code of silence and\nWhat was interesting to discover during this journey of\nBreaking the code of silence is that there's this common misconception that it's a blue officers blue shirt common St officers going against other officers when actually I learned that the retaliation came from the top down\nBosses were actually\nInstructing the officers who were working with me not to back me up or they would be the next Shannon Spalding so out of\nFear of becoming me out of fear of retaliation and south or putting their lives in danger losing their job what could happen to them they complied because they it it's easier it's easier than blowing through everything that I had to go through and even though officers didn't\nWant to they thought they had to I had officers come up to me and say you know I Believe in what you're doing but I Can't be seen ... because I'll be next\nWe'll let me let me play a clip from the president of Chicago's fraternal order of police carbon ground this what do you have to say after the conviction of officer Jason Van Dyke this clip comes from do you use these podcast on the corner McDonald's case called sixteen shots here is Kevin ...\nLook or you are you going from about this\nOver the last several years of use this case one and I want to remind everybody ran for millions of dollars every every every year in this case really took ... which is but I'm fortunate because I'm going to tell you this and um\nThe men and women over ... who's with farming\nTake seriously\nWhat they do and they try and provide for self protection they can lose your father\nAnd they do it [noise] putting their own lives and every single day and night\nThat's Kevin ... the president of Chicago's fraternal order of police\n[noise] and from the William T grant foundation at W T grant foundation dot org\nA quick heads up about our conversation on tomorrow's program about climate change the world is talking about a new report by some of the most renowned climate scientists putting a finer point on just how little time we have to do something about our warming planet\nThe report states that we have until about the year twenty forty before we reach a point of no return it\nAlso gives reason for hope that we have the skills to do something if we work together\nWe want to answer your questions about what it would practically take to fight climate change leave us a voicemail eight five five to three six one a one egg\nWe'd also love to know what you're working on to fight climate change in a big way tell us your story eight five five to three six one a one way\nOr you can use our app won a vox pop to send us a high quality audio file and to keep up to date on future topics you can find one a vox pop V. O. X. P. O. P.\nIn the app store and we'll share some of your questions and stories tomorrow on one day\nBack now to our conversation with new Franklin Shannon Spalding Patrick Smith and judge will Doris Cordell let's get to some more\nTo prove policing in America might be going\nThe sailor tweeted the reasonable officer standard is a very easy standard to apply it's not that hard we do need to eliminate the criminal justice college major and higher police with degrees in psychology or sociology too many cops have no business carrying a badge and the gun however\nDelving had these questions and writes\nThe question is what is reasonable\nDoes disobeying a police officer shouting mortars constitute the right to use deadly force\nIs a drug dealer running away from the police deserved to be shot while they may be criminals or the actions from the police ... to the criminals actions to Cornell maybe you should respond to golf and how do we suss out you know minor sense what reasonable misuse\nWe said well this is in the eye of the beholder\nIt really has no one definition and what jurors are required to do is put themselves in the shoes of the officer at what was the officers dating thing and often times incidents happen and you know just a matter of a\nFew seconds so it's there really is not one definition of it but but I Do want us to\nGet to something you said Joshua about you know looking ahead I Believe it's time to we imagine policing in America\nPolicing in America today is is ... militaristic and police departments officers are seen as an occupying force especially in communities of color in low income communities\nThat's not how policing started in this country policing started with individuals who lived in a community who knew everyone and they were people who were not seen as an occupying force there were people there to basically provide a service and help the individuals in the community\nAnd it has dramatically changed we have police departments\nArmed to the teeth with\nTanks and all kinds of of the equipment that uh are commonly used in the military and I think it's time to to change this whole thing we need to start thinking outside the box why do we need police officers to basically a patrol and and take care of traffic issues\nFor why can't that come from within the humidity why can't individuals' community members somehow the deputy ties to deal with with those kinds of things that the minor kinds of things that are happening in the community\nMuslim somebody who's ... and I'm I'm not disagree with you or just by way of conflicts there are some places where the lower level of sworn law enforce off or worse when officer does deal with things like parking enforcement and traffic enforcement things that are less likely to require deadly force\nSure but but but my point is that that our our whole attitude and this is even within police departments they see\nThemselves as this you know kind of a militaristic force and and they they do have\nA command structure and ... and and so what I'm saying is that maybe it's time now to say let's pull back from this whole image we have of police being occupiers and look at a different model entirely\nI'm not opposed to criminal to criminal justice reform but look what happened we we get body cameras and what what happens well we have officers several oh don't turn\nThe cameras on or we have places like Chicago where it takes more than a year and a court order ticket footage out on for example in liquid shooting so that that the whole lack of transparency policing for example has very little sunshine\nThere's very little sunshine and policing we don't get to know who these officers are their track record their history their discipline\nWeb streaming is made possible by electronic express with a comprehensive selection of smart appliances for Katie's computers and accessories for the smart home available in stores or online at electronic express dot com code W. P. L. and\n... I have had experiences where you know it's that way and I would rather have conflict with ah with me rather than actually serve it I really think that they should\nKnow take away the first couple of months at least to buy cheap it's added a community without gun makers Dana community to force me to have a dialogue with community I think it'd be a lot better uh which serving X\nRays you thanks for calling in and sharing your thoughts with us Neal Franklin I Love you to respond to that but if I could first\nIf we could contrast what Reggie said with another set of comments that we've gotten from some of our listeners like what's scholar Rhodes Scholar writes\nPolice put their lives on the line every day protecting our society Ninety percent nine zero percent of the cases put forward by activists as examples of police brutality involve people not complying why is the outrage not centered around these individuals' behavior that got them shot\nIf a cop breaks the law out convict him but if there's any doubt I'm siding with the police one hundred percent of the time\nNeal what would you say to folks who said that police work is inherently difficult inherently dangerous potentially deadly and then we as a public also have a role to play in easing the tension that officers feel about just being able to get home at night\nSo I Believe it was Reggie that left a message yes um\nYou know that was such a brilliant comment because forcing the dialogue see when you develop a relationship with those people you are serving the citizens who are serving\nAnd you get their support your job doesn't isn't as dangerous as it is today it you know going back to what the judge Cornell said um\nHow it used to be having relationships walking up and down the street talking with citizens talking with the neighbors\nWhen something happens they support you when you had those relationships but when you have this occupying force will you know none of the people who are very few of the people the ones that you do know there's conflict on the under ... on the other end of that relationship\nThat's a problem this goes to community control policing that I mentioned before\nWhere the community sets the philosophy where the community sets the budget for those in uniform where the community\nDecides who the the leader is going to be whether you call them achieve for commissioner or whatever with the community decides what's important with the community decides you know what we can handle these issues that the ground level\nWe just want you to pay attention to people hurting other people and this is how we want you to do that\nBut policing is very political political through the unions it's political through the mayors and governors and we'll never get to that place into the community that side and they come together and say we want control over our police departments and this is how we want to do it\nHaving that oversight at the beginning means that you don't need police review boards at the end when something goes horribly\nIs speaking of which we got some ideas from some of you about what could be done with regards to policing and review boards were part of it including on a larger scale\nJamie asked shouldn't there be a national group or board who could provide oversight over individual police departments they could be an objective trusted advisory boards who's judgments both sides would trust and accept and to whom and aggrieved local citizens group could\nPolice forces with their training transformed them from people's defenders into communities photos with this dance to police forces not your friend even if you are a regular law abiding citizen so maybe trainings part of it\nAnd Hector emailed the u._k. and other European Union countries have unarmed on duty police officers and we should have more on armed cops to\nPatrick Smith I'm not sure if anyone is advocating that any offices in Chicago disarmed themselves but I Wonder what people are suggesting I mean is there a conversation about lasting change after the ... McDonald's case or are there are still other loose ends with this that need to be tied up first before we talk about for a\nWhile there are I mean the uh the video of McDonald's shooting a prompted the department of justice to come in and investigate the the Chicago police department which has been done in other cities\nThis is Ninety point three WPN when National Public radio Ninety One point five WTO ... in Ninety One point seven WHM rats Cookeville get the latest stories from WPN news throughout the day and connect with National Public radio via Twitter and Facebook WPN dot org\nYou can also find schedules for all of our program channels and listen to a live stream of any of our programming on line learn more about connecting with Nashville public radio at W. P. L. N. dot org\n\nEmpathy hardness vulnerability courage\nMobile treats for life but what about for work [noise]\nFrom W. A. M. U. and NPR in Washington DC is one thing\nHi there I'm Joshua Johnson today on one a working from the heart Bernie brown game to following for her research on shame and vulnerability her latest book uses that to help leaders bring out the best in their team\nToo many jobs demand perfection and obedience and not a safe place to just be ourselves or make mistakes but brown argues that wholehearted workplaces are not just more enjoyable they're more successful\nWe'll dig into her book dear to lean and we'd love to hear from you what's helping your employees bring their best cells to work\nFor what's getting in the way\nComments on our Facebook page or tweet us at one egg [noise]\n\nLive from NPR News in Washington on trial Snyder\nHurricane Michael is now a category for hurricane as it prepares to make landfall in the Florida Panhandle forecasters say it's been gaining strength in the warm waters of the Gulf of Mexico officials are urging evacuations from an area that spans twenty two counties\nFrom member station WFDD ... reports from a small coastal town called ...\n... market is the only grocery store and ... and it's about the size of the gas station residents are running in and out of the store buying water charcoal and a lot of canned goods store manager Rita Adele says they have doubled up on all their produce\nBuys\nA little says they're total sales have doubled and another truck lettuce food will come to the store a couple of days after the storm passes for NPR News I'm tested been to one in ... Florida\nSo precarious state Mike Pompeo praising United Nations ambassador Nikki Haley who has announced her resignation\nBut a great part of their mind for them now five months that she and I had been working together or had I Want to wish her very well whatever comes then\nIt really is is expected to leave her position by the end of the year President Trump says he will name a successor in the next two or three weeks he says there are five people in the short list of replacements including former White House advisor Dina pow\nOn Twitter Tuesday he found a Trump shut down the possibility of replacing Haley after her father suggested he would consider her but\nThat he knowledge she would be accused of nepotism federal law prohibits hiring relatives to hit an executive agency\nOn Wednesday immigration and Customs Enforcement officials are expected to be getting a full inspection of are privately run immigration jail in Southern California this comes after federal investigators reported serious health and safety violations including do Susan detainees cells and sub standard medical care\nFrom member station KCPW to eat the free to ... Romero records\nA contract for ice will investigate the Atlanta processing center which is operated by the GEO Group one of the largest private prison companies nationwide but a former detainee ... says he doubts the new inspection will improve conditions by the up to two thousand people health there\nThis is going on for years they known about this\nEvent go says he repeatedly said detainees suffer seizures and ... on the floor without proper medical care\nBut I made it will get their either already bank that one leading yesterday\nThe GEO Group says the company takes the federal inspectors report seriously most ice detainees locked up in facilities run by private companies according to a new report by Syracuse University ... news and fatty that kept by meddling in San Francisco\nNation chairs or study and Wednesday trading and for Washington this is NPR News\nPresident Trump celebrating the swearing in a Supreme Court justice Brett Kavanaugh\nStart wait for America [noise]\n\nAnd you know what I'm Talking about cars yesterday as to why we proudly floor and the newest member of the [noise]\nPresident Trump speaking at his Tuesday night campaign rally in Council Bluffs Iowa again calling Democrats attempt to block gambling on a national embarrassment and he did not mentioned the sexual assault allegations Kevin joined the eight other justices on the bench for the first time Tuesday following a bruising confirmation fight\nMajor U.S coal producer has filed for bankruptcy was more than coal operates seven months across the country\nFrom the mountain west news bureau Nate how jeep reports\nWestmoreland coal company says it isn't laying off anyone or closing any minds right now shortly after announcing the bankruptcy the company's stock plummeted by more than forty percent Peter Morgan is senior attorney with the Sierra Club he says the company might try to sell its coal mines\nBut I question whether Westmoreland going to be able to find anyone willing to buy these mines given that their economic model is just inherently flood\nThat model involves owning coal mines that directly supply power plants Westmoreland has struggled as the nation transitions towards cheaper and more abundant renewables and natural gas for NPR News I'm ... this is NPR News\nSupport for NPR comes from NPR stations other contributors include twenty three and me a personal genetic service working to help people understand their DNA learn more at twenty three and made dot com slash NPR radio and the listeners who support this NPR station\n[noise]\n\n\n\n[noise]\n\nThis is one a I'm Joshua Johnson in Washington when you talk in at work are you still you\nOr do you put on a different persona a kind of a mask just to survive the work day if you feel very guarded at work you're not alone and it turns out how your boss behaves has a lot to do with your answer to that\nBernie brown has spent years researching effective leadership as a follow up to her groundbreaking findings on shame vulnerability and whole hardness applying those findings to the world of work\nRound is a research professor at the University of Houston graduate College of social work her new book is called dear to lead Deering greatly and rising strong at work and she joins us here in Studio ... brown welcome to LA and excited to be here so many of your fans who've already shared some questions with us and we walk more of your questions in thoughts\nAbout the world of work work brings embassy in dealing with vulnerability in the workplace so email us one a at W. A. M. U. dot org comments on our Facebook page or tweet us at one day\nI read the book and you say early in the book that it does follow up to a lot of your previous\nWork I imagine there was a point at which you wanted to take some of the findings you head Bruce you had your develop through your research and apply them were practically especially because you do speak to a lot of business groups across the country around the year\nI did I say I spend about for the past five years\nIs Asians working with leaders and talking about leadership innovation and creativity uh recently talking about um AI and machine learning and kind of the consequences of that the rise of the machine\n[laughter] so you know for me it was probably I don't know six or seven years ago um we had this mission\nThat kind of where I work at our organization of making the world are braver place and it really struck me that if we don't change the way we work we can't change the world because we spend too much time at work\nUm and I think everyone listening at least my experience has been when that's a bad experience with NASA toxic environment when we are in bad relationships at work\nOur whole lives go just fall apart\nOne of the things that you've described in your speeches I forget which of your TED Talks it was but you talked about how business groups or to reach out to you and they say they want you to talk about creativity and innovation and the future but please don't bring up shame vulnerability or any of that difficult stuff and your response to that was\n[laughter] I can see why you have a problem [laughter] you know it right there yeah I mean that's the thing so\nIf you don't have a culture that is prepared and understands failure set back and disappointment don't ask people to innovate because failure is a prerequisite for innovation is by debt you know you bankrupt innovation on its own terms when you say nothing can fail\n[noise]\n[noise]\n[noise] [noise]\nOh [noise]\n\nSupport for NPR comes from the station and from Boehner with the bone a certified craftsman program a network of hardwood flooring contractor is committed to expertise and customer service contract to locate her and more information or at bona dot com [noise]\nFrom progressive insurance suffering it's home quote explore so shoppers can evaluate options in one place when buying home insurance custom quotes in rates are available online learn more progressive dot com [noise] and from the listeners who support this NPR station\nThis is one a I'm Joshua Johnson we are discussing empathy and vulnerability and how they can help make some of the best employees bosses in workplaces\nWith Bernie brown her new book is called dear to lead we'd love to hear from you too sure what you know about creating empathetic wholehearted workplaces or what's getting in the way comments on our Facebook page tweet us at when a\nOr email one at a at W. A. M. U. dot org speaking of the world of work there's been some breaking news this morning about a woman who is choosing a new job and has resigned from or current position\nNikki Haley America's ambassador to the United nations announced her resignation this morning\nThe earliest formerly the governor of South Carolina has somewhat international reputation for being willing to take on her boss from time to time she told the New York times she doesn't agree with the president on anything but it's on everything but says there was a right and wrong way to address that will pick up the phone call them or meet with him in person\nShe will also be remembered in part for striking back at White House adviser Larry Kudlow who suggested she might have been confused regarding Russian sanctions she told Fox News with all due respect I don't get refused to don't get confused\nShe and the president met today at the White House she lavish praise on him and his family he was part of what ambassador Haley said\nI Can't say enough good things about Jared ... guy Jared is such a\nGenius that no one understands I mean to redo the NAFTA deal the way he did um what I'd done working with him on the middle east peace time it is so unbelievably well done and an office in just a great friend and they do a lot of things behind the thing\nThat I Wish more people knew about because we're about our country because they're in um ministry and I often just have to say I'm certainly thinking of my family my ... at the same\nAnd on my two little ones I adore them and ... you know they sacrificed a lot they put a lot of time and energy into it um but they have a lot of heart and really wanted to make America proud and so with that\nI'm not leaving until the end of the year my goal is that we make sure that everything is in good flakes and on for the next disaster to come in but now\nI don't have anything that I'm where I'm going to go I think that um the main thing was I was governor for six years and we dealt with a hurricane a thousand year ... shooting a school shooting there was a lot and then to come in\nAnd getting years have Russia and Iran and North Korea it's than eight years of intense time and I'm a believer in her mind that I think you have to the south was enough to know when you step aside and allow someone else to be the job so thank you know it's been a\nLifetime and I will say that um if are all in here that are going to ask about twenty twenty no I'm not running for twenty twenty I can promise you what are we doing it for that point so I look forward to supporting the president and the next election\nBut as Nikki Haley the U.S ambassador to the United nations speaking just a few minutes ago at the White House announcing that she will be resigning from that post back now with our conversation with ... brown and maybe ...\nHillary who says I've noticed more attention since the twenty sixteen election of President Trump's how has that changed the work environment have you noticed a difference\nOh absolutely absolutely I don't think work I think this is the whole point work is not immune from the larger culture and I think we have seen just like we've seen\nIncreased polarization in our families and our neighborhoods among our friends is at work too and it feels dicey or at work um I think that\nPeople have to be careful and especially when there's power differential Z and it it's I I actually believe it's become a pretty significant source of anxiety at work and home\nJust being able to talk politics or culture or any of your other dividing line\nYeah 'cause everything feels like it's one step away from getting into a cultural debate where we find other people's opinions and comprehensible\nTo see I Wonder if that kind of for people who are not inclined to kind of open up\nIf that alters toward keeping the professional and personal separate that work I'd just needs to be this one person I Do to keep my head down and get to not make waves I Need to be obedient I Need to be efficient I Need to do the job and get the hell out of there\nAnd the minute that we start talking about emphasizing and being vulnerable and being urban and compassionate and ... that opens the door for me to say something about how I voted or you know whether I own a firearm or who I pray to or who I Love\nThat's going to turn into a gigantic wildfire at work like it almost feels like\nIt's an easy way to give yourself ammunition to put on more armor instead of ...\nI I think you're absolutely right and here's the hard answer I've never seen anything meaningful are significant come from mouth shut had down in my career\nThat's just not how we make contributions and so what we have to do is learn how to listen talk here each other and\nRumble and we use the term rumble because it really feels like a rumble rumble with the vulnerability of seeing other people as people and being seen as a person and it's a muscle it's a foundational skills that\nI don't think spending what ... what are we spent about ... about a half of our adult lives at work I don't think spending half of our adult lives in armor\nIs something that most of us are willing to do I think the psychological emotional spiritual and physical costs are too high\nAnd we're not solving problems I Need you to bring all of you to work I Need the combination of all of your experience as all of who you are to address the problems\nFrom reading your book and based on the research that fueled the book a lot of what you describe points to that kind of armor as an indicator of where something is wrong it's almost like a star yeah your scars tough because the wind is tender right and so if there wasn't something tenders there'd be nothing to protect\nNo that's exactly it and I think one of the big ideas that came from the book that really it was actually voided my hypothesis going in so where did you arrive\nYeah it just it completely ... just shot out of the water and I and I'm usually pretty good at gassy what I'm going to find but not in this case\nSo we asked a hundred and fifty sea level leaders that there is a lot of data that we use so interviews with a hundred and fifty sea level global leaders\nThree years building a daring leader assessments that people can see where they are and these were NBA and MBA students at Wharton catalog Rice University and then\nTons of data evaluation data to I thought when when when it was clear that the ...\nAnd more courageous cultures I thought the barrier was going to be fear but then we went and talked to several dairy leaders and said so you're not afraid very often and they were like\nWhat I'm afraid every day I'm afraid all day long and I was like so that blew my hypothesis have fear being the greatest barrier to dairy leadership the greatest barrier to daring leadership is\nArmor it's not the fear it's how we self protect when we're in the fear is the perfectionism the pleasing the defensiveness the anger that having to be the nowhere and get everything right instead of being the learner\nUm so really you know and it's interesting what you said about scars intend to places\nNot only does armor keep other people from seen us and sharing ourselves with other people armor protects the fear and less it faster and grow\nAnd metastasize so we need to create work cultures were armor is not rewarded or needed\n[noise] we are some of you to call in and tell us about your workplaces here's what two of our listeners left in our inbox first let's hear from Adam\nRunning as Adam and I'm calling from Nashville, Tennessee\nI'm a paramedic and fire fighter and that was such a definitely feel like I Need to do my job perfectly at all times because there are definitely times when ... you're on a lot of jobs on the other hand I worked for department it's very good about your organism blues\nAnd our co workers are definitely do a good job of trying to share and better get stressed the job\nAdam thanks very much for calling and sharing your story with us no contrast Adam's story which is the bill's story she works in a similarly strict workplace was a rather different take\n\n\n\nSupport for NPR comes from the station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nAnd from visiting angels professional caregivers assisting adults in bathing dressing Nielsen light housework nationwide visiting angels America's Choice in senior home care office locations ... visiting angels dot com\nMore with Renee brown and just a moment but first we love your help with the next installment of our special series the state we're in we're doing it on Mondays for the next few weeks the federal government is often deadlocked on passing legislation but there's a lot happening at the state levels\nThis Monday we'll dive into trends on new state health care law's from lowering prescription drug prices to expanding Medicaid to fighting the opioid crisis what's being debated in your state house on health care or drug pricing or Medicaid expansion or something similar on the ballot next month if so leave us a voice mail\nEight five five to three six one a one a\nWhat are your governors or your local lawmakers want to change about health care and do you feel like these proposals would hurt or help you access to care you or your loved ones may need\nTell us your story eight five five to three six one a one day where you can use our app won a vox pop to send us a radio quality audio file and to keep up to date on future topics you'll find one a vox pop\nV. O. X. P. O. P.\nIn the store and we'll share some of your stories on Monday when our series this state we're in continues\nOn one day back\nNow to our conversation with Bernie brown author of the new book dear to lead with regards to arm or Monday sold emailed can you address the differences between armor and establishing in maintaining healthy boundaries\nYeah I mean boundaries are actually a big part of this box batteries are incredibly important um we defined it very simply as what's OK and what's not OK and so armor is not about\nProfessional management of south it's not about four going boundaries armor is about defense in it is I Am going to put the protection of my ego\nBefore doing right by this business and the work that we're doing together I meant to protect feeling good about myself\nOver movie and I work for it to the difference between\nSo there's a difference between say armor and image such as kind of self that you portrayed other people to kind of keep bad things and it's it's more it's on a deeper level now\nIt's on a day but I mean the one of the greatest examples that armor armored leadership versus during leadership has one form of armor we see a lot and folks is the need to be right that it's that I've got to be the network and I need to be right and that's more important to me than being the learner\nHave comments from those of you about the way that race plays into workplaces and hope emailed can you speak about the ways in which racial power structures and broader society that manifest themselves in the workplace\nDisproportionately impact the contributions of people of color in their work and the extent to which they progress in their careers before you answer here's one example professor ... tweeted\nAs a woman of color an immigrant and an academic I've learned that showing vulnerabilities and even my own resilience can and will be used against me by those in power would love to hear professor brown talk about overcoming that distrust\nWell here's what are the biggest finance I think is that one of the greatest casualties of trauma\nIs the is the law says owner ability and when I talk about trauma I don't just mean a traumatic and said that I mean racism\nHomophobia poverty white supremacy I mean privilege\nDesert desert everyday traumas and it is real that that that you know the armor that you need to survive this thing's Israel which is why if leaders don't work to create a culture where when you're here you can take that off and be seen\nThan we can't I mean gender is another you know I I think the kind of\nAnita Hill criticisms that happen after the for testimony where you know Ford was more compelling because she was more vulnerable\nAs opposed to Brett Kavanaugh who is just kind of fun during a way that we're all got you know\nWho was you know but absolutely vulnerability can be used against us um and I think that is a that is in itself a form of systemic racism\nBefore we keep going I Would like to talk a little bit about something else you mentioned in your book you talked about\nValues and I don't think any of us has worked at a company that doesn't have some\nKind of mission statement or vision clarification or posters everywhere saying this is yes we're supposed to be and then it's really worth nothing more than the paper on which was printed I work at some companies\nWind been to some companies where their value statement was like Fifteen bullet points Laura I'm like well why don't we start\nYou suggest that we should limit our core values to to yeah just to and there's a long list in the book I'm trying to find a because there's a lot on the list that I really struggled to go down to my to why only two\nWell here's a big operation allies values into observable measurable behaviors that people can be held accountable for demonstrating then you just really do have a cat poster I mean it\nReally is [laughter] it's just really a poster [noise] so ... reporting on my head but little do yeah [laughter]\nYeah yeah yeah I've got a Thirteen year old son I Know it [laughter] you know and so what\nWas so you know operation allies values into behaviors fewer than ten percent of the organizations we've worked with had actually done that had taken the time to say you know what I some assumption of generosity is our value and hear the behaviors that we will hold each other accountable for endangered in\nAnd so the two is\nReally kind of backing into the data\nThat men and women who had the capacity to be the most courageous could identify their values and they had two to three values and you know I have you know\nThere's a long list in the book like we talked about and there's like Fifteen things on there that are important to me\nOut truism collaboration curiosity dignity diversity independence self discipline patriotism vulnerability wealth wisdom future generations Harmon\nWeb streaming is made possible by the ... room showcasing antiques accessories and the ancient modern line for the contemporary home on the Web ... antiques dot com or six one five seven eight zero twenty six hundred\nBecause it's a place where every other thing on that list is tested\nAnd so we really we had an we had a companion work buckets free it's downloadable it's on my website where you can do your own values exercise to figure out what your to our and an operational as an end to behaviors\nUm it has changed completely the way we all work together we all know each other's values we understand them we hold each other accountable for them\nAnd then we have our company values and that's actually how we assess you every quarter\nMix on the values that you were to do it\nLike for example one of our values is take good care taking care of each other ourselves and the community we serve and so one of the things that we measure is I don't talk about people I talked to people\nI mean you either do it or you dumped and so\nI think it goes back to something we haven't talked about yet that as a real core finding which has courage is one hundred percent teachable it's for skill sets\nOf the skill sets are behavioral and can be taught it's learning how to rumble of phone or ability living into your values which we're talking about right now it's braiding trust understanding how to talk about trust and breaking it down so we can talk about the anatomy of trust and learning how to rise how to get back up on your feet after a fall or a setback\nDo you need to clear as you saw use I mean I I Would be fascinated to know what you live near I now think my to core values are because I Know what they are I went to the list and I finally figured out my too but I don't know that anyone would guess what my two were based on who I Am the work I Do like I guess one\nSure can't try sure OK face no\nThere's not one of my two chords but it's incompetent one of my two cars but no for me and tell us that you two are I don't know maybe I should maybe I shouldn't and we're talking about vulnerabilities Joshua no but I'm the host I don't have to do and I'm just I'm In charge here here we go ... no not OK okay fine I'll tell you what they got\nFreedom and growth those are my two values\nGet the latest stories from WPN land new throughout the day and connect with Nashville public radio via Twitter and Facebook WPN land out or you can also find scheduled for all of our program channel and listen to a live stream of any of our programming online learn more about connecting with Nashville public radio WPN land down or [noise]\n\n\nI'm saying we made this mess and now we have to clean it up and time is running out a new report gives reasons for concern\nFrom W. A. M. U. and NPR in Washington this is what a\nHey there I'm Joshua Johnson today on one a controlling climate change their report is clear at this pace are warming planet we'll show major signs of irreversible damage by the year twenty four she\nWe know what to do but that's not the problem the problem is getting the world's governments to do it how do we overcome the political challenges of fighting climate change and how much do individual actions like planting trees or ... began really make a difference in saving the planet we love to hear from you\nEmail one at a at W. A. M. U. dot org comments on our Facebook page or tweet us at one egg [noise]\n\nMine from NPR News in Washington I'm ... and hurricane Michael is a little more than fifty miles off the Florida Panhandle with top sustained winds of one hundred forty five miles per hour it's a category ... storm very close to a category five\nSome parts of the Florida Panhandle and Big Bend region could see storm surge of between nine and fourteen feet enough to swallow some homes\nFlorida governor Rick Scott is urging people who've been told to evacuate to leave now\nListen to local officials you do not want to be the person who survived the storm just to put your life or your family's life at risk after passes because you didn't listen to local officials\nDuring the storm first responders cannot come out and said you it's too dangerous now is it time to prioritize to keep your family's states do not take chances\nThe storm is expected to crash into Florida in a few hours then rocket north through Georgia and the Carolinas before ... into the Atlantic ocean\nMeanwhile Georgia's governor is issued an emergency declaration for hurricane Michael from member station WBUR a bee in Atlanta task name ... reports the state is bracing for the storm this week\nState of emergency is now in effect for Ninety two counties in Georgia and head of hurricane Michael governor Nathan Deal says the state's watching the path of the storm closely\nIt appears that those southern counties are the ones you got to be most likely impacted and we will put in place all of the provisions related to an emergency declaration we just hope that it is not too severe and that it does not last too terribly long\nThe emergency declaration is in effect for seven days already Atlanta's Hartsfield Jackson international airport has canceled forty five flights today for NPR News I'm this name ... in Atlanta\nThe Russian foreign ministry says five party talks involving the United states north and South Korea China and Russia are needed to ease tension on the Korean Peninsula\nMatthew Bodner reports from Moscow the stayed commenced rather statement comes after Chinese and North Korean deputy foreign ministers met their Russian counterparts today in Moscow\nIn a statement released following the conclusion of meetings with the Chinese and North Korean diplomats\nRussia's foreign ministry now says the multilateral talks or the way forward the three parties also said and the joint statement that the United nations should begin looking at using sanctions on Pyongyang as part of a coordinated process toward denuclearization under President Trump the U.S has been actively engaging North Korea to end of the nuclear stalemate\nFollowing secretary of state Mike Pompeo's recent visit to young young\nSouth Korea said that North Korean leader Kim Jong un was planning an imminent trip to Russia for NPR News this is Matthew Bodner Moscow\nOn Wall street stocks are sharply lower the Dow was down two hundred sixty two points or one percent the NASDAQ down nearly two percent this is NPR a new report from watchdog in the U.S government Accountability Office find security problems with the Pentagon's latest weapons\nWeb streaming is made possible by wild birds unlimited hosting a fall fill your feet are than this month including winter blend square migrating in Tennessee feeder birds new holiday items arriving locations in Nashville Franklin it could fill W. B. U. dot com\nRemain at record high levels Jennifer glass reports from Kabul there are about eleven deaths\nA day eight thousand fifty Afghans have been killed or injured in the first nine months of this year says the UN's quarterly report on civilian casualties\nCombined uses suicide in non suicide improvised explosive devices constant most casualties fellow by ground engagements then targeted killings casualties caused by airstrikes art in all time high up thirty nine percent over last year\nThe majority of the casualties sixty five percent are caused by anti government groups such as the Taliban and Islamic state Afghan security forces are responsible for sixteen percent fighting between the group's accounts for ten percent international forces are responsible for five percent with a rat unable to be determined\nElection related violence has killed or injured three hundred and sixty six people of particular concern with parliamentary elections ten days away for NPR News I'm Jennifer glass in Kabul\nOfficials in Kenya say at least fifty people have been killed after a bust tumbled down slope and crashed in the western part of the country the roof of the bus was torn off children are among the dead officials said there are Fifteen survivors who were headed for medical treatment at a hospital\nI'm core of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nWith NPR News in Nashville this was Ninety point three W peel it\nNational Weather for today showers and thunderstorms are likely behind your eighty five overnight lows dropping down into the fifties there is a slight chance of rain for tomorrow mainly in the morning otherwise pearly sunny Anaheim you're Seventy one with overnight lows falling into the forties or Thursday looking at a friday sunny skies a high and you're sixty five\nSeventy six in Nashville at nine and six [noise]\n[noise]\n\nThis is one a I'm Joshua Johnson in Washington ten to fourteen years that's how long you and I have to do something about our changing climate now it's hard not to sound melodramatic reading the latest findings from the inter governmental panel on climate change\nTo limit global warming we will need and the reports words quote rapid far reaching and unprecedented changes in all aspects of society unquote the estimated cost fifty four trillion dollars there is no precedent for pulling off something like this\nAnd the report says we are rapidly approaching a point of no return but if we can make changes now we can limit the warming of our planet\nIs there the political will for different countries and industries to come together or should we just start taking lots of pictures of coral reefs now so we can tell our kids all about them when they're gone joining us to discuss it is Coral Davenport energy and environment reporter for the New York times Karl welcome back to the program\nHi great to be with you and in Tucson, Arizona one of the authors of the IPC report Diana Lieberman is a professor of geography and development\nAt the University of Arizona professor Lieberman welcome great to be with you we also welcome your questions and thoughts about this report and about the prospects for ... fighting climate change effectively email us one\nWe'd us at one a or comment on our Facebook page let's begin a professor live from and if we could with a comment from the chair of the eyepiece you see the group behind this report we suddenly here's part of what chair leaf said at the conference where the report was released\nClimate change is occurring already and author than people\nWill systems environmental all around the world every degree of warming methods\nOf this tremendous benefit unlimited through at one point five degrees such as in terms of their editors public as well as a kid in sustainable development\nProfessor maybe a good place to start will be to put the power of a degree in to contacts we'll be talking a lot about one point five degrees Celsius and ... and keep one Seventy degrees Celsius\nHow much of a difference just a degree or half degree really make when it comes to ice caps melting or reefs disappearing or the impact on shoreline give give give us a sense of how powerful a degree is\nWell every little bit of warming Max's um people can see that in that sense um if the\nYou know just even a little bit warmer the rates of calm\nThe amount of water that you have to put on your God will change but in terms of the some of the really significant difference is a\n\n[noise] [noise]\n\n[noise]\nSupport for NPR comes from the station and from bona with the bone a certified craftsmen program a network of hardwood flooring contractors committed to expertise in customer service contract to locate her and more information or at bona dot com\nAnd from Matthew ... committed to changing lives through math by building math achievement problem solving and critical thinking skills for thousands of students every day in nine hundred franchise locations math ... dot com slash NPR\nThis is one a I'm Joshua Johnson we're discussing climate change and how long we have left to stop or a warming planet from going past the point of no return and what we can do about it there is what we can do but are we willing to do it\nWe're discussing it with the University of Arizona professor dying of liver men who helped contribute to this new report and Coral Davenport who covers energy and environment for the New York times you've already had quite a bit to say we got this message from Andy who was an oyster farmer in Alabama here's what Andy left in our inbox\nWhen I moved here in Nineteen eighty there were Marsha ... shrimp crabs and dozens of peers no much of that has gone\nI bought my first appearance on each well it was destroyed two weeks later by Hurricane Isaac I rebuilt a lawsuit again tonight in twenty Seventeen and then again to Gordon in twenty eight team now watching my approach\nHandy thanks very much for writing in sorry to hear about what's been going on with your peers and I know that hurricane Michael is very worrisome it is just about\nTo hit the Florida Panhandle so I Know that you're watching that very very closely I Wonder professor liver meant if you could speak to part of what Andy\nSaid I've seen a lot of my friends on line saying the climate change and people say there's no climate change and look at these hurricanes that we've been having\nIt how much should the average person be packing things like hurricane Michael directly to what we're seeing from from climate change there's still a lot we don't know about the cycles of severe weather but what do what what would you say to people like Andy who are worried about this kind of thing\nWell first of all about what's heartbreaking I had paid that take hatred Michael\nBut um [noise] we can't say that the American\nDirectly related to global warming but we can say is that ... these ... increasing at the results of global warming because all my atmosphere I had no energy can hold more water ... to\n... says that they go to the extreme events whether it's ... or extreme rainfall all heat waves are increasing with every little bit search warming\nMedia through a few more of your comments Sarah emailed I feel overwhelmed by the talk about climate change\nAnd don't feel like there is a unified voice out they're letting families no what concrete steps that they can take to make a difference for our family this has led to ever present feelings of helplessness anxiety and guilt about the choices we make every day Sarah we will be talking about some concrete options and just a moment but let me get to a few more\nThoughts that have come in the U.S far Joel emailed\nYou should stop framing this as what will politicians do politicians reflect the people that voted for them half the voters in the U.S ... Donald Trump's tweet that global warming was a Chinese hoax and voted for him anyway that just goes to show how important the issue as to the people in this country\nCruel Davenport I Wonder if you could respond to Joel ...\nOut of the Paris Agreement he kind of questions the provenance of the agreement by saying well who wrote it up let me see wrote a mental believe it does Joel have a point\nOh well in in terms of um ... policies being the policies that address climate change on the U.S really isn't a a distinctive place right now I think I'm Around the rest of the world we do see an expression of will by leaders\nTo um enact policies to limit greenhouse gas emissions I think that there's a lot of questions on how strong list policies actually are um you know the analysis shows that they're they're not strong enough to limit warming even to that that initial two degrees but do you in the U. S.\nUm what we see is President Trump not only you know essentially questioning that the basic established of of\nClimate change but but also moving to undo existing climate policies I'm President Trump has already moved forward with policies to undo regulations on greenhouse gas emissions from power plants on undo or weekend um regulations on greenhouse gas emissions from cars\nUm and he had said that it is his objective to promote the use of coal\nBurning coal is one of the leading contributors to greenhouse gas emissions\nA President Trump wants to promote the use of calling us and abroad um one of the findings of this report is that in order to um limit greenhouse limit climate change to um you know to to to the sort of least destructive\nUm level of warming\nUm the use of coal will have to uh basically go down to zero\nI'm by by twenty fifty ... basically no more on just about no more coal and and and and it is you know that that is that is an extremely disruptive policy recommendation um there's no question that there are industries and people who will be harmed\nWho who will have their livelihoods disrupted by policies that go in that direction\nLet me let me just once I started could use your call but I Wonder in terms of the politics behind this I hear you on I I totally hear you on how disruptive dishes jolt colas so interwoven in the network of America's energy grits kind of hard to just take it all out\nI Wonder though in terms of the voices on the world stage who we we know that there was this who are saying well poll it'd be really hard to pull out\nTo get the sense of there's anyone in the world stage saying tough our planet has only home you light pole tough we got to get rid of it deal with on you or California so Jerry Brown the governor of California for sure\nAnd many of the ... on on the president of France has sought to kind of a step in and um\nHe he's trying to carve out a place for himself as a as a leader on climate change it's it's not difficult for France to take that position because France um doesn't really use coal\nUm so but but but we I mean we absolutely see world leaders saying you know this is what what needs to happen\nUm [noise] in China it's very interesting because um China is the world's largest\nUm greenhouse gas polluter and is a massive user of coal at the same time we're off to the the Chinese government has moved forward with I'm actually in acting um prices on carbon ah they're they're they're an acting a cap and trade system that would force\nUm carbon polluters called polluters to essentially pay a tax or the um I did in in order to pollute which is ...\nFrom from greenhouse gas has an idea that was invented in the United states is I'm considered sort of politically toxic here in China they can implement it by ... they don't have to deal with that Congress voting against at Iraq and in the United states\nTo do on a ... I Want to talk more about that idea of carbon taxes we continue in just a moment but let me get to a few more comments or Brian emailed\nWe have no leaders anymore with the skills or courage to do what's right regardless of the political cost we will keep polluting as long as the price of fossil fuels is low would be interested to hear from some of you listening who you trust who you think some of the leaders are politically in this country around the world\nWho you believe are sincere in their pushed to do something significant about climate change their anybody that you think is for real and saying that we're going to make this happen or maybe if you're active with\nA politician or a government leader or a government agency it's doing something tangible\nThat you feel people should know more about we love to hear from you what gives you hope that climate change is something that is actively being worked on where you are email is one a at W. A. M. U. dot org by the way we've been talking in terms of degree Celsius yes I Know where we are\nIf you need a little conversion one point five degrees Celsius we mentioned one and a half degrees and two degrees for those of you don't have a conversion calculator in your head one and a half degrees Celsius is about two and a half to point seven degrees Fahrenheit and two degrees Celsius is about three and a half degrees Fahrenheit about three point six degrees anyway\nTom posted on our Facebook page Wendy quote unquote global warming scare first appeared long ago it was made a political position by the Democratic party that immediately convinced me that the manmade weather change is nothing but a political hoax to fool the stupid professor live from and what would you say to tell them\nWell I grew up in a country Britain where it's not political and to set aside part of my life I Lived in a country where politicians and the public I'm caught that scientists and to\nAnd downtown dental a neighborhood dental practice focusing on enhanced his dental and cosmetic treatments to help reduce pain as Aslan the natural beauty and function of a healthy smile format downtown dental Nashville's dot com [noise]\n\n\nSupport for NPR comes from the station and from loved me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more at Goto meeting dot com\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\n[noise] more at alliance for a lifetime income data work\nBack now to our conversation with Coral Davenport if the New York times in University of Arizona professor dying of liver meant we got a number of messages from you in terms of how you are trying to make an impact with the fight against climate change here is a little mash up of two of the messages we got this is Amy from Chesapeake and Jeff in Michigan listen\nI'm getting a thought to slash ... thought flash feeling powerless and that I Can't do enough to stop that the path of destruction that Iran\nI pessimism comes because I Believe that what's happening to the world is happening at a corporate level and I'm Still\nMore companies get on board and care about the environment it feels like we're kind of inevitable um two thousand forty will be here before we ... we will reach the consequences\nThanks Geoff an Emmy for sharing your thoughts with us ah speaking of the corporate path there are some corporations who are taking a position in the fight against climate change including with regards to the carbon tax Melissa tweeted\nChina uses more than twice as much coal as the U.S hard to believe some carbon tax is going to make much of a difference considering their population let's talk more about carbon taxes with one more of our guests joining us from London\nTed holstead is the chairman and CEO of the climate leadership council Ted welcome to want to a\n[noise] good to be with you ... what is the climate leadership council\nIt is a group a debt is co founded by a by actually the brought us climate coalition in us history to back a national solution is pushing for a carbon tax where all the money is related to the American people in the form of ... of ... of a dividend\nWho were some of the backers of the council where does the funding come from\nSo um the council is a does not accept corporate contributions but our founding members include four of the\nAh oil majors the largest car manufacturer in the United states the largest utility but also the largest um solar company in the United states a very broad coalition it also includes two leading environmental groups\nAnd opinion leaders from across the political spectrum ranging from Ben Bernanke heater Janet Yellen to Larry Summers and of course our plan is named after former secretaries of state James Baker and George Schultz the Baker's shoulder carbon difference plan but Joshua let me clarify\nAwful decision that as a lobbying organization and that now has corporate funding including from Exxon okay\nImage is connected to the organization or use it as a spin off but it's still a connection with any way or completely separate uh it is a separate\nOrganization that is the advocacy arm of the climate leadership council so the council develops this ground breaking plan were all sides wind and Americans for carbon dividends which was co chaired by\nFormer Republican Senate majority leader trek law and a a sooner broke that group lobbies for this plan and it now has money from oil natural gas solar wind and nuclear power interests\nColder report let's take a step back before we get into the plan that the climate leadership council was advocating more specifically defined this term carbon tax force what exactly is a carbon tax\nShores so um [noise]\nThe idea of a carbon tax is um ... each ton of carbon dioxide emitted into the atmosphere um you can put a price on how much economic harm it causes\nUm and uh in in ... and important note on that as the the economist who came up with with that idea his name is William North house he's a professor at Yale I'm was just awarded the Nobel Prize for this idea on Monday\nI'm the same day that the IPC came out with this report which heavily sites I'm professor north houses work\nUm so he came up with the idea of every ton of carbon um traps heat in the atmosphere and you can put a price on how much each kind of carbon hurts\nA the global economy um and and there's a range for how much that costs that it it can range from um fifty dollars a ton to a hundred dollars a time when I'm you know there there's there's debate about about how much\nUm actual harm it can cost that once you sort of place that price on carbon um then you are can essentially um create attacks I'm at a price on carbon or attacks on carbon that you would impose upon polluters of carbon dioxide no no\nNo a war of carbon Muslims are going to be really clear in terms of who the taxes paid on I mean if I Am a car Baker do I pay the pollution from automobiles does the carmaker\nPay a carbon tax for producing the vehicle that ... carbon dioxide or does the oil company pay the carbon tax for finding the gas alone are likely\nMost likely you pay at a as a car driver a motor\nAnd in ... and ... so um we don't have carbon taxes in the U. S.\nUm so in some ways this this is sort of um you know in intellectual debate although other countries are are are working are sort of further along on this but the idea is\nUm if this would affect how you drive it would probably um be taxed based on how much carbon monoxide would be a produced by burning 'em by burning gasoline show it would most likely be added to the cost of the gasoline that you put in your car so if you're going to put in\nAnd mounted gasoline in your car that would produce a certain\nAmount of carbon dioxide when you burn it that would raise that tax would raise the price of gasoline and the idea is then you would be motivated to buy a car that use less gasoline essentially that that's how it would drive the market so consumers would want to buy electric cars would want to buy efficient cars\nNot because not out of some sort of\nA moral sensibility but because actually a a a price on carbon would make it cheaper\nGet technology to hosted the yesterday Exxon Mobil committed money to lobbying Congress for a price on carbon give us a sense of what that plant involves and why it's getting support now\n[noise] so um the bigger shields carbon defense plant is based on four pillars of the first is a robust carbon tax starting at forty dollars per ton which would actually be the highest carbon tax of any a leading emitting country\nAll of the money would go directly back to the American people in the form of a carbon dividend which means that the vast majority of American families including the most vulnerable would win economically from this plan\nAnd a third pillar is that we would\nTrade a high price on carbon in a growing price on carbon for some of the carbon regulation simply because a carbon tax is a more cost effective way to solve climate change\nWho I just wanna make sure I understand so the plan if the plan went into effect there would be a tax on the carbon that I Am it with my car or my motorcycle or whatever and then that the revenues from that tax would come back to me as a taxpayer in the form of a of a dividend\nIs that what you called [noise] yes so a family of four would get approximately two thousand dollars per year\nIn dividends and here's how the system would work the more you pollute the more you pay the less you pollute the more you win so Seventy percent of American families would come out economically ahead and that's what's so transformative about the dividend concept which is that we can have\nThe most effective climate lever which is a carbon tax in a manner that is popular populist and equitable for the American people\nHow much of that money would be spent on environmental programs are planting forests or doing research on cleaner energy with all of it just come back to us as taxpayers\nA hundred percent would go back to the American people and that is what makes the plan a popular\nAnd politically viable because in cap on Capitol Hill you'll never get the two sides to agree on how to spend the revenue Republicans will say well let's spend on deficit reduction are lowering the corporate income tax Democrats will say well\nLet's spend it on a renewable energy innovation or a low income support it opens up Pandora's box by contrast when you returned all the money directly to the American people it closes that box and what polling shows is that it's overwhelmingly popular most interesting\nThis is Ninety point three WPN land National Public radio Ninety One point five WTO mountains of Houma and Ninety One point seven W. H. R. S. Cookeville get the latest stories from WPN ... news throughout the day and connect with National Public radio via Twitter and Facebook W. P. L. N. dot org\nYou can also find scheduled for all of our program channels and listen to a live stream of any of our programming on line learn more about connecting with Nashville public radio at W. P. L. N. dot org\n\nIs a classic love story one that Hollywood has told for decades with her audience is saying now that this star has been born for the fourth time\nFrom W. A. M. U. and NPR in Washington this is one egg [noise]\nI'm Joshua Johnson today's a one a movie club reviews for ... for\nThis film had a lot going on Bradley Cooper is first time directing a feature Lady Gaga is first leading dramatic role and the remake of one of Hollywood's most revered story it also comments on the very music industry that made Lady Gaga star with lots to say about the price of faith\nWill review a star is born spoilers and all and we'd love to hear from you how many stars out of five would you give the film and why polish five five to three six one a one a four tweet us at one day [noise]\n\nLive from NPR News in Washington I'm ... and the national Hurricane Center says hurricane Michael is just off the Florida Panhandle with top sustained winds of one hundred and forty five miles per hour Florida governor Rick Scott is greater danger is from the water he says the coast will get at least twelve inches of rain\nSo think about that a foot of rain in some parts of the panhandle again prepare for major flooding from the store the national Hurricane Center is forecasting storm surge to be between nine and Thirteen feet that means water will come miles to ensure and\nCould easily rise over the roof so houses\nOnce the hurricane makes landfall it will move north east into Georgia it will lose strength but it's still expected to be a tropical storm then it will push into the Carolinas before excelling into the Atlantic ocean\nNow that Brett Kavanaugh has been sworn in as a Supreme Court justice abortion rights groups are gearing up for what they expect to be more difficult fight in the years to come Planned Parenthood is unveiling a new strategy designed to prepare for the possibility that roe versus Wade could be overturned NPR's Sarah McCammon has more\nWhere the cabinet on the court abortion rights opponents see a new opportunity to weaken or overturn roe the Nineteen Seventy three decision that legalized abortion nationwide Planned Parenthood's Don McGahn says abortion rights advocates expected increasingly difficult environment\nAlready women across this country have to access funding they have to access transportation they have to access housing they have to access support networks\nUp abortion rights in state legislatures expanding access in states with more liberal abortion lies and reducing stigma surrounding abortion Sarah McCammon NPR News immigration and Customs Enforcement officials will inspector privately run immigration jail in Southern California\nIt's been cited for violations including poor medical care and news is in cells from member station ... Romero reports\nContact us I I Will investigate the ad that ended up processing center which is operated by they deal with one of the largest private prison companies nationwide but as former detainee ... says he doubts they knew inspection will improve conditions by the up to two thousand people health there\nIsn't going on for years they know about this\nEvent goes that he repeatedly said detainees ... seizures and ... on the floor without proper medical care\nMedical gets there either or anything that one leading yesterday\nThe GEO Group says that company takes the federal inspectors report seriously most ice detainees locked up in facilities run by private companies according to a new report by Syracuse University ... news ... kept by NATO and San Francisco\nOn Wall street the Dow is down three hundred and sixteen points It's NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and has about who pair premiering October twelve on prime video\nWith NPR News in Nashville this was Ninety point three W peel it objects have been Wilkins\nDemocratic gubernatorial candidate Karl Dean has secured an endorsement from the state's largest teachers' union the political action committee for the tendency Education Association says they support dean because of his record of increasing education funding as mayor of Nashville\nThey also said he's opposition to vouchers which would allow families to use government funding for private or religious schools\nSharply reports ... was expected as the association has backed democratic candidates for governor for the past four decades but last week the superintendent of Memphis surprised many by announcing his support for Republican bill Lee\nRather for county schools say they will not be shutting down for the day despite fears of to escape inmates described as armed and dangerous\nAnd the message to parents officials say there'll be taking additional precautions the schools in the area were searched overnight and declare to clear box Seventeen reports that little after midnight to men escaped from the rather for county jail one of them Dwayne ... half acre was recently featured on the state's top ten most wanted list\nPolice or continue to search the area with canine you didn't in a helicopter from the tendency highway patrol\nMetro police say national uh seeing so many hit and run accidents they'd been forced to assign extra officers to investigate them sorted Bob Sheffield with metros traffic division till ws and be the department is asked investigators are normally handle fatal accidents to help with the workload\nAccording to metro records there have been nearly eight hundred and fifty more hit and run accident since January than their war than there were for the entire year in twenty Thirteen police are encouraging people involved in such acts and it's not the case of fleeing driver said they suggest taking cell phone videos and pictures\nSports Illustrated has announced a true crime of pride cat a pod cast focused on the death of legendary Tennessee Titans quarterback Steve McNair in July for two thousand nine McNair was killed by a woman he was having an affair with what police described as a murder suicide\nNumber a valid question that conclusion at the time added family members have been there in his Mr ... Jenny ... the ... castle focused on the investigation to form a natural police officer Vincent hill it's to six\nWeb streaming is made possible by him capital advisors formerly mass protests class at management new name and location yet the same team of professionals providing financial planning and customize portfolio management to young and seasoned investors alike more at Nashville money manager dot com\nThings that movie audiences love a passionate love story an inside look at stardom and the tragedies of fame\nThe first version came out back in Nineteen thirty seven then again in Nineteen fifty four and again in Nineteen Seventy six and now a new generation has its own version of star is born the directorial debut of actor Bradley Cooper\nA\nLot\n\n\nThat's of course Lady Gaga who plays the undiscovered musician singer songwriter who Cooper's character a wiry rockstar false for we asked you for your thoughts on a star is born here is some of what you left in our inbox\nIs Tammy from Wisconsin my husband and I both loved it we thought it was a beautiful love story and Bradley Cooper and ladies guy that were an amateur in their acting and they're singing and the sons they wrote together excellent movie I recommend it for uh\nMy name is Louise and I'm from Gainesville, Florida\nI saw a star is born this weekend and absolutely loved it\nBradley Cooper again proved as acting chops and lady got was a true revelation I Love also have they adopted the timeline to threatened by the inclusion of Saturday Night live and it's important in a career of a young singer and I think even the die hard Barbra Streisand\nVersion fans will absolutely love it\nThanks very much for calling in we'd love to get more of your thoughts on a star is born how many stars out of five would you give it and why we're taking your calls this hour at eight five five to three six one a one a\nLet's say five five to three six one to one to\nEmail us one a at W. A. M. U. dot org comments on our Facebook page or tweet us\nAt one a and fair warning as always we will be discussing this movie spoilers and all so if you have not yet seen a star is born but you want to you might want to listen to this conversation later you'll find that on line at the one a dot org\nJoining us to discuss this movie as he does every month is the honorary vice president of the one movie club John horn hosts the frame a daily program about arts and entertainment\nFrom Cape PCC public radio in Los Angeles John welcome back to the club always a pleasure joining us from Nashville is NPR Music critic and correspondent and power it's she's the author of good booty love and sex black and white body and soul in American music and we'll come back\n\n\nSupport for NPR comes from the station and from bona with the bone a certified craftsman program a network of hardwood flooring contractors committed to expertise and customer service contract to locate her aunt more information or at bona dot com\nAnd from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angel America's Choice and senior home care office locations are at visiting angels dot com\nWhich is one a I'm Joshua Johnson we're discussing this much movie club selection of star is born with John horn from Cape you see\nNPR's Linda Holmes the host of the pop culture happy hour podcast and NPR Music critic and correspondent and powers\nWe'd love to hear from you too we always are happy to take your calls and voice mail to eight five five choose three six one a one a weed especially love to hear from those of you who've seen multiple versions of a star is born or what price Hollywood and let us know how you think this one compares to the previous ones\nYou can also comment on our Facebook page tweet us at one a\nEmail one a at W. A. M. U. dot org and if you are just joining us I Will remind you one more time spoiler alert we will be discussing all the details of this movie so if you haven't seen the star is born yet but you want to you might want to listen to this conversation leader on line at the one a dot org\nLet's get to a few more of your calls Heather in Indianapolis is on the line hey Heather what's on your mind what'd you think of the movie\nHey well of course I loved it but I loved it for the entertainment value but my big piece was that moment when he brought her on stage you know I mean that was not her comfort down knowing what she'd been told that she wasn't going to be good enough that no one would care that no one would find her interesting or attractive\nAnd she just went out and she killed it and they loved it and for that house second ac that she realized they were wrong and everything they said to her that was a pretty important if you're ...\nThe same reasons it's kind of a date moment\nYeah I I I hear you on that just does that resonate for you in a way like was there something personal that that made you flash back to er San Fernando valley\nAbsolutely yeah I think you know I Do a lot of things where I have to go out in front of crowd or for people and you often hear you know to be dinner or project slower or beat this or that are younger and at that moment with kind of all of this it was kind of all of us will have that moment it we can personalize it whether it's in an interview or\nWhat have you and I think that was a part of it\nHas her what'd you think about that whole storyline was her nose like for me that kind of set up that moment on stage very well but things with her nose\nYeah yes I mean I'm just like a little bit sick as a person and for me her nose is like my weight so she owned it she's like this is my name is me to take me as I Am and she worked at it\nYou know got to accept that this is me and it's not going to change and I thought it it kind of the ill\nYeah yeah how do I really appreciate your calling and thanks very much for talking to us and I love Ann Powers I Love that kind of commentary on the music industry that was kind of baked into the film particularly the thing about her nose when they're standing on the roof top in LA and there's that Ali billboard and he says we should have just made the old billboard you're knows\nI mean I think the thing about the comments about her nose is also a guy guys\nHonoring Barbra Streisand one of the greatest performers and greatest noses to ever a exist and and thrive\nIn Hollywood as far as coming up the music industry it absolutely is a powerful comment on the music industry as\nThe music industry existed I don't know maybe ten years ago I think that where this thing has placed in time where there's a movie a space and time it's interesting to think about that\nBecause almost everything that happens still happens today and the music industry but there's really no acknowledgement of how things are rapidly changing with the advent of streaming playlists and um the major record labels having less\nPower than they used to so it's almost like we own fashion and its view of the music industry but only that view would would work for this film you couldn't really tackle a the collapse of the music industry in this in this movie\nLinda Holmes could you also trying to end but by the way which for those who have not seen the stars born will not be seeing stars ... just kind of want to be in on the conversation she\nTells Bradley Cooper character fairly early on that she's dealt with music industry people who were like yeah your songs are you saying well but your nose your nose just isn't quite right\nFor music and that was kind of one of those petty impediments that had prevented her from getting where she wanted to go\nWhen the homes I Wonder how you view that commentary on the music industry when I was watching the movie I felt like I was thinking about Lady Gaga because Lady Gaga herself has this kind of over the top persona that she created to kind of be the vehicle for her art\nI also thought about pink\nWho is very much and invention of pop music but who also have this kind of rye cynical style style but almost commented on it as she was doing it and that was what made people love her\nYeah I mean I think that um I agree with and that\nThe view of the music industry in this town in order to be aligned with the view of Hollywood and the previous films in some ways is very linear it's a very linear idea of there is the one\nI'm rose to fame there is one path you just simply offend or D than as opposed to there's no suggestion that either one of them that he or she\nMight have success in at a different kind of version of what it means to be ...\nOr you know that she would develop her own you know following through streaming without kind of going through that traditional path agree with and about that but I think\nThat um I'm not sure that you could do it any other way I think the purpose is to have them pass each other on this same ladder and I think he kind of have to construct it that way and what you're saying about lady got you know I'm the caller was talking about kind of seeing\nA alley the character\nTalking about well I have to and I'm really afraid and I don't have confidence in my nose or whatever it is funny to see an artist's like Lady Gaga who has been so able\nTo make such an indelible mark on the industry and on popular culture I mean the funny thing about this movie is she is way more important to consider than he is um if you're talking about the real people so it's kind of funny to see\nHer big personality taking advice from Bradley Cooper just had a much more traditional Hollywood leading man type of career right um it's odd in that way\nYeah except for that voice in rocket and guardians of the galaxy that's a little bit more of a diversion but you're right I mean she is much more of like typical leading man actor I Wonder also John in terms of\nThe story line you know one of the big parts of the storyline is the love story and Bradley sent a lot of time sitting up that first time meeting here's a piece of that moment from a star is born when they're falling in love in a grocery store parking lot and Lady Gaga is character alley use just improvising the love saw\nHim on the phone call\nTime to time can do\nTo [noise]\n\nNews or the [noise]\nBradley Cooper and Lady Gaga in a star is born Cooper spoke to NPR's MORNING EDITION with the host Rachel Martin about his work and said this about working with Lady Gaga\nAnd then we went to the piano and saying and it was just kind of wonderful thing I couldn't believe it\nSo that was the beginning of the journey and the first time we sang together I mean everything's ... we say we sing everything live in the movie [laughter] wow yeah there's nothing we let's lips thinking\nAnd I turned to Lady Gaga Hussein next to me and she was looking at me like I was Jackson, Maine when any when you're in a scene is actors fully believing that you're the character you cannot believe it yourself so she really gave me the confidence\nBradley Cooper speaking to Rachel Martin on NPR's MORNING EDITION John horn what did you make of the collaboration between Bradley Cooper Lady Gaga particularly how it came out in the way the love story played out\nThis is my big problem with the film and I think for a lot of people it's not an issue it was for me when her character an alley first meets jak he was a stumbling blackout drunk\nAnd I think it looks as if he's just spend a weekend at a bar do Kevin Cavanaugh KCUR\nThe estuary daughter were hand picked Tennessee October is the time for pumpkin picking wagon rides corn mazes and haunted activities local pumpkin patch is with family activities are listed on pick T. M. products bought Oregon and the pig Tennessee mobile um\n\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one NA\nFrom El severe a global information analytics business serving scientists and clinicians with a commitment to helping to manage their work more efficiently so they can spend more time making breakthroughs el severe dot com\nAnd from the John D and Catherine T MacArthur Foundation at Mack foundation dot org\n\nBack now to this month's meeting of the one a movie club which in power is Linda Holmes and John horn let's get to a few more of your calls now gene is listening in Indianapolis he Jean what did you think of a star is born\nHeater gene can you hear me yes I gave it by stars which why five stars [noise]\nActually I just loved everything about this I've actually seen the other versions and this one seem particularly well updated to today um I Wish the irony of being discovered\nBecause she was a drunk and looking for a drink and their life being torn apart at the end because of drink I mean that was\nThat continually say and one one thing I don't think other people have mentioned is the part that her agent I guess\nThe manager do agent played yeah what what is your main character\nI didn't like him\nAnd I I guess I wasn't supposed to but ah the minute he had that conversation with jacks and um and and basically\nAnd getting ready to accuse ... are accusing him of being a problem in that whole relationship I just I just knew that that was going to be the start as of something really bad happening\nYeah I'd I hear Eugene a hundred percent of it and I I figure I heard your charming and as well\nNo that was a male nominee go ahead yeah I think I think one of the tricks and this goes a little bit back to what you were all talking about about the mental health and recovery portions of the story one of the tricks with the manager and I think\nThey do such a beautiful job of explaining where he is in his recovery process and where he is I'm thinking about mental health and they made her seem like someone who is aware of what his problems are she's been wary of them\nFrom the beginning um\nThen they are ultimately headed toward this pre determined tragic ending in which um he dies of suicide and so\nI think the manager I think the conversation with the manager unfortunately seems like a forced element that it doesn't feel organic to the story it feels like it comes in to just drive that last you know to drive that ending and it doesn't seem organic necessarily to to the story as they've developed at\nBecause when he's been through these um recovery processes\nDoes it seem like without speaking to her he would hear that from the manager I mean obviously depression and an addiction can operate and a lot of different ways for sure but you know did the movie really do a good job of explaining why that conversation at that moment would be enough\nTo drive this enormous decision that that he makes and I'm not sure it did I think that's where I found the ending to be not as satisfying as I thought the rest of the film was\nBy agree with you on that and on top of that I think that the movie had a way you know I was always taught you know in in writer school show don't tell\nThere was this moment in the film where Ali says I Want jak on my tour make it happen or or we're done\nAnd I feel like there could have been a moment where for example she goes on to say to her with her and he can't keep up or he keeps we're getting the lyrics or he falls down draw like something could have happened to someone coming to him and saying you know your bad for her right so that would have like plead that whole narrative in a different way from like\n... ... exactly someone he doesn't really know someone he hasn't necessarily trust ed come in and is able to kind of up in his entire sense of his relationship with her I think that's part of that the narrative issue with the ending\nLet's all go ahead and go as\nWell of course of course the the ways in which a Hollywood and the fame machine or the same monster as Lady Gaga once called it and one of her album during a destroys people is a major theme\nThroughout all of the versions of star is born in there and in fact all the bridges of the SARS going to have that manager character in a different embodiment um that character in this film I\nAbsolutely agree was more personally slimy felt like you know a villain whereas in in some of the previous versions he almost was a sympathetic enabler\nUm of of the male lead and who then was like hey you know we're trying to keep them afloat but he's going to mess you up\nEsther Esther was the first name of alley or in the star is born versions so the story of Hollywood destroying people um requires that\nTo be part of being part of the cast you know has to be there um I also just want to say before we end got to get this out there that um\nThis is also the story of how a woman's arise leads to a man's fall [laughter] and that's an internal problem with the stars bar and you know it's a melodrama it's it's a melodrama is traditionally aimed at women we feel very sympathetic\nOr ... toward the lead female character but there is this underlying sense have to say it that even as Jackson, Maine is saves temporarily by the energy he he gets almost empirically from\nHis young protege ultimately he is destroyed because she has moved into the center and he has been pushing the periphery\nYemenis rating problematic\nFound well but you're not the only one who's brought that up I mean Julian wrote on our Facebook page I fear the story of a rising female star nursing a failing male ego is the wrong story in this meat to era\nWe get to a few more of your views of the film Harvey in Ann Arbor emailed I saw this film hoping to be moved crying deeply engaged that didn't happen for stars\nI deeply appreciative ... nuanced shyness in her early portrayal which made Maine's characters advising her work well\nI'd like to have the same Eliot brother character better developed possibly a moment perhaps a moment could have been written into the car rides the bar possibly dropping him off from the performance his scenes seemed a little too detached from Maine overall I Love the big venue concert treatments\nThat kind of gets to a comment from Argo in ... North Carolina who tweeted three stars a star is born was a story the performances especially the musical once more fantastic\nAnd the cinematography was incredible\nI expect a lot of nominations to come for deep ie the director of photography the cinematographer Matthew ... production designer Karen Murphy costumer Aaron been out score original song and editing\nJohn horn spoke with the cinematographer Matthew ... about shooting live performances which are not really straightforward spaces to navigate here as a part of that conversation from Cape PC sees the frame\nIn this film was very difficult to sort of navigate the stage performances because we had three different modes basically we had the Coachella mode which is I'm borrowing stages or that were already set up with a lady that was already existing\nAnd putting in our own crowds and then there was the I'm running guns sort of we have ten minutes to shoot in between two sets with a real audience\nApologizing in thanking the audience for I'm sort of I'm shooting a movie in between two bands and then we had the third which is the Greek theater which in which shallow was performed where we um we actually in more of a movie fashion was able to create the Greek theater as a set\nAnd put a certain amount of crowded and so that was my most controlled um scenario but the lighting of it had to have a consistency my my goal was that um\nYou know in creating a a character from St Louis and with our resemblance Jackson, Maine might as well be um [noise] oh I don't know Jack White and I had to make sure that the the audience maybe subconsciously feel that this was his lady [noise]\nThis is his road show and it's also in the film in the sort of visual movement of it all representation of rock and roll\nThat was Matthew ... seek the cinematographer on a star is born speaking to John horn on Cape he sees the frame John can you talk a little bit more about the making of this film particularly back to Kathleen question who wrote on Facebook how you can tell if a film is wild\nWay the Matthew described it presents all kinds of additional challenges to make it a well directed film shooting in so many different kinds of locations", "show_name": "1A Plus", "year": "2018", "city": "Nashville", "day": "10"}