{"month": "10", "state": "GA", "station": "WABE", "content": "For the tone in the country I think he's the symptoms not the cause right\nI'll grant you that I mean he was elected but but James how much and I I Know our time is short I'm really sorry to cut you short James but how much do you think President Trump is responsible for the tone in this country\nFor the tone in that country I'd say he's no Fifteen twenty percent responsible I'd say right I mean the overwhelming majority of the political discourse that country for the last Twenty years\nHas been down this line he's just wait better at it than anybody else right so that's why I say he's not the cause symptoms gushing point fingers at you know that's below sea and Newt Gingrich it's been going this way along thought gee what a finger at Karl Rove he's a good at first I was off\nDreams I hate to cut you short we're just about out of time I appreciate your calling in do I want to end with the words of a famous Pittsburgh during deer mentioned that she grew up in Mr Roger's neighborhood I think we should end with some of the wisdom of Fred Rogers for what to do in times of crisis my\nMother used to say a long time ago\nWhen ever there would be\nA catastrophe that was a hot on in the movies or or on the air she would say always look for the helpers there will always be help for\nYou know even just on the sidelines that's why I think that if news programs could make a conscious effort of showing rescue team of of showing who medical ... anybody who is coming into a place where there's a tragedy\nTo be just be sure that they include that\nBecause if you look for the helpers you'll know that there's hope\nThe wisdom of Fred Rogers Mr Rogers in the Nineteen Ninety nine interview for the archives of the television academy\nMany thanks to India relax went on at the Pulitzer center on crisis reporting in the Boston Globe rabbi Jill Jacobs of true off the rabbinic call for human rights\nAnd Charlie ... senior technology writer for buzzfeed news this conversation was produced by page Osbourne Stephanie Collette Amanda Williams was edited by Ilene Humphrey you can learn more about them and the rest of our fantastic staff on line\nThe one eight dot org slash staff [noise]\nUntil we meet again I'm Joshua Johnson thank you so much for listening and let's keep talking [noise]\nThis is one egg\n\nSupport for NPR comes from this station I'm from the Alfred P Sloan Foundation bridging science technology and the arts my\nSupporting exhibition such as program to the Whitney Museum in New York City on view through April fourteenth more at Sloan dot org\n[noise] from the doors to charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nAnd from the sustaining members of this NPR station\nThis year Americans are voting early often record turnout in some states is as high for the midterms as it is for a presidential race so far about Eighteen million Americans have voted for early what might that tell us about the results devoting explosion across America next time\nOne a week nights a ten Ninety point one WKBD\n\n[noise] this\nIs Ninety point why W. A. B. E. Atlanta your choice for NPR [noise]\n\n\n\n\n\nThe end of the year is one of the best times to buy a new car but what about the old one why not donated W. A. B. E. you can learn more about this tax deductible donation at W. E. B. E. dot org slash cars and thank you\n... W where you'd be you'd get landed resent the lender music city were Mormons is recorded in and around Atlanta produced by Tommy joy I understand the AC a digital recording of your host Robert ...\n... ... the land is simply used orchestra conducted by Stephen ... in the program presented it simply do you call a ... D\nTo open the concert we'll hear both gone ... Mozart's older mature to ... to ... six twenty the magic ...\nA\n\n\n[noise]\n[noise]\n\n\nNah nah\nNah\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou just George W sees previewed I'm not going to be de dum ball performed by the land is ... ... conducted by Stephen ... the next reform of spite the land is simply the youth orchestra will be this Sunday to report that three PM in symphony hall\nFor tickets and program information called for zero four seven three three forty eight hundred to close the first step to the program we'll hear excerpts from ... predicts\nHansel and Gretel which is ... in San ... song evening prayer and dream pounded by\n...\nDa da\nDa da da da da\nOn\nWhen will the\n\n\n\n\n\nUh\nUh [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n[laughter]", "year": "2018", "show_name": "This American Life", "city": "Atlanta", "day": "30"}