{"month": "10", "state": "GA", "station": "WABE", "content": "You know we should one of the things that we can do a much better job in this country is instead of always thinking about having to our criminal law and making this illegal in this little thing illegal why don't we act like smart American sometimes\nAnd use our tax laws and encourage people to do the right thing not just say it's illegal if you don't do this I mean we could encourage people to buy\nA firearm locks and ... and a safes to keep their guns and give them tax credits why don't we start thinking like smart people again in this country\nOf course we're low on time but let me give you last word on this and and whether or not there are certain states that you're targeting with this at particularly candidates who may have campaigned partly on gun legislation before we got to go\nShore I just want to say Richard I'm with you let's work on that together but the epidemic of gun violence we have in this country requires multiple solutions not just one and family fire is so important to us because we have lost\nAn opportunity for a long time now with Congress shutting down research into gun violence et cetera to really push information about safe storage four point six million children in this country live in homes with loaded and unlocked guns eight kids today\nAnd homes across America are shot and injured or killed with a gun in the home this campaign and directly at that and focuses and gives the word family fire to these incidents that are completely preventable\nChris Brown the president of the Brady Campaign to prevent gun violence Richard Feldman the president's will be independent firearm owners association\nAnd Scott Greenberg executive editor of state line thank you all for being with us thanks also to Lisa done with guns in America who helped produced this program you can find out more about that reporting project at guns and America ... for the show was\nProduced by Danielle night and edited by a lean Humphrey to learn more about them and the rest of our team go to do one a dot org slash\nThis program comes to you from W. A. M. you part of American University in Washington distributed by NPR until we meet again I'm Joshua Johnson thank you so much for listening this is one egg [noise]\n\nSupport for NPR comes from this station and from Americans for the yards committed to transforming America's communities through the arts in arts education supporting the nonprofit art industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nAnd from the Alfred P Sloan Foundation bridging science and the arts by supporting the history of scientific theory misused and eugenics crusade premiering October sixteenth on PBS more at flown dot org\n[noise]\nThis is Ninety point one W. A. B. E. Atlanta your choice for NPR [noise]\n[noise] it takes decades for patterns of social behavior to change but me to has been on the nation's mind for just one year\nSome hope it will bring about the kind of change not seen since to fight for women's suffrage what the me too movement means for those in power for our politics next time one week nights it head on Ninety point one W. A. B. deep\nWhen you donate your old car boats W E we'll take care of everything for picking it up to providing you the paperwork for your taxes learn more W. E. dot org slash cars or with a call to one eight six six nine zero one W. A. B. E. decks\nNinety point one at bat WABC ... presents the land the music she performances recorded you in and around Atlanta produced by Tommy Joel Anderson bases digital recording of your host Robert Hubert\nTonight's program features the Georgia State university symphony orchestra conducted by Michael Palmer and selections from to concerts\nBurst from program presented February for jeep twenty gene in the Florence ... hall we'll hear quoted there'll be seized ... am I going to be ... ... to be after dude\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\n\n\nMm\n\nMm Mm Mm\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] well\n\n\n\n\n\n\nNa na\nNa na na na\n\n\n\nUm the land or music scene if your State University symphony orchestra conducted by Michael Palmer has jumped reform Beethoven symphony number by it see Mike\nToo close to the program from a concert given November Fifteen twenty seven gene whether you're Bronx Schubert sympathy number by the ... made your dog for a ...\n\n", "year": "2018", "show_name": "This American Life", "city": "Atlanta", "day": "02"}