{"month": "10", "state": "GA", "station": "WABE", "content": "What are you quite far or who can you forgive and you know you know those yeah actually questions for example that Nelson Mandela asked yes very very ...\nSecondly given yeah he's been through that's right that's right [noise]\nSo we have a lot to learn all I Know we live up to his model but it's worth a good try\nEarly ... is professor America in the sociology department at the University of California Berkeley her many books include the managed heart the second shift and strangers and their own land anger and morning on the American right [noise]\nOn being is of course he really Percy ... Aaron ... Tony ... Bethany ... taco Christian Lynn profited do ... anti theft and\nSue Philips Gonzalez billion vote Lucas Johnson in ...\nA lovely the music is provided in composed by Joey cheating and the last voice teacher singing our final credits in each show is hip hop artist live though on being with created at American public media\nA funding partners include the John Templeton foundation supporting academic research and civil dialogue and the deepest and most perplexing questions facing humankind\nWho are we why are we share\nTo learn more visit Templeton dot org to George Family Foundation and supported the civil conversations project\nThe ... Institute helping to build that spiritual foundation for loving world\nSign them at ... dot org\nKelly pay a foundation working to create a future where universal spiritual values formed the foundation of how we care for our common home humanity United advancing human dignity at home and around the world to find out more and humanity United dot org part of the many our group\nThe Henry Louis foundation in support of public theology reimagining the ... foundation a catalyst for empowered healthy and fulfilled life and to really in ... in Indianapolis based private Family Foundation\nDedicated to its founders interest in religion community development and education\nOn being stupid it by P. I. X. to public radio exchange and do the Christmas ship it public production [noise]\n\nThis is not equally one W. A. B. E. Atlanta coming up and just a moment it's this American Life sunny today has only at sixty three cold again tonight down to forty one this is Ninety Portland\nSupport for W. H. B. E. comes from southeastern records presenting Jason is on the four hundred units live from the ride them alive album recorded at Nashville's rhyming auditorium in twenty Seventeen live from the Ryman is available October night treats people of\nColor could decide Georgia's bitter race for governor but we'll all the obstacles devoting keep them away from the polls\nThe races there is no longer you know where to vote in there and I think that's what we had trouble with them\nFor years Democrats ... Abrams when Republican Brian Kemp fought over in the boat I'm WABC reporter Johnny Kauffman we've spent months investigating voting in Georgia and then you can hear our story tomorrow evening during all things considered\n...\nEverybody up speaking to today from the stage with opera house at the Brooklyn Academy of music in New York City\nAnd I'm here or not but how safe for the story that is so small it almost feels wrong\nTo tell it in a room this ground\nIt's actually about a real opera singer not a super famous upper singer or anything like that person go free makes about half of our living singing the other half she makes a recording audio books\nAnd about a year ago she was staying in a hotel\nAnd she had a deadline when the children's book that she was supposed to be recording and hotel room was kind of noise is using a lot of noise from the street and digital driver quiet places you went into the causes put pillows all around to dead and the sound sound before with microphone and then the court and the microphone\nWent under the door of the closet out to her laptop because her laptop had a fair made noise that just because of the door so it's pitch dark\nExcept for the light from her eye pad which had the text of the book that you're supposed to read and she began\nBe exciting exploits an effort to send out written by Tricia sugar wreck and married it like ... free\nChapter one way or is Anna the enchanted forest\nWas deep and green and splashed with\nPlaces like would it be incredible if I just now play do the entire audio\nBook [noise]\nHe paid like eighty five bucks for this sort of [noise]\nActually I Can't tell you to hold audio book because current gets exactly like two and a half sentences into this book and she stumbled on words is I thought wait I'll just I'll just start again at the start from the beginning so she gets up to go to the cause it and start the tape began started recording again and uh she tried to get out cause it [noise]\n\nI just got researches lock them [noise]\n[laughter] [noise]\n[laughter] oh my God [noise]\nThe guy told me at first she thought like this isn't going to be that hard right after all she has the eye pad his wife I should call the front desk on Skype right and there was a problem\nThis wife I was like half of one bar and it kept just cutting out but I found the hotel number this ... is on the recording when two six six one nine six zero zero [noise] down there [noise]\n\nThank you for calling them outside of town we have a way to the fall and watching\nBoy this you know Im donation of alcohol is how we look at our website\nAnd then of course the longest hotel phone menu ever\nFought al ... or the night outing for\n[noise] for the human craft\nAnd like trying to pressure zero to get to the operator and I'm thinking the wife I was going to cut out at any moment so I'm listening to like this giant long menu and finally I hear\nIs that anytime you're listening to an operator from eight [noise]\nFor the ... the ... Hi I'm actually in room a lemon ... can you hear me can you hear me [noise] [noise]\nAfter that the seven minutes of silence on the recording just like total silence nothing happens except ... every now and then turn just laughed to herself\n[noise]\nOne minute and forty eight seconds after the phone call then it's quiet there's no other sounds from forty four seconds and then when the recording you're here\n[laughter] [noise]\nNow and then she tries to door handle again thinking she told me later you know this can really be true like this cat just got to be with us going to work on\nOne wall because it has the hallway on the other side and Eighteen minutes after car and locks herself in she hears people she hears some German tourists walking towards her down the hall and fortunately she actually has the skills for this very situation\n\nGermans come to the door of the room they whisper to each other for a little bit\nAnd then they do nothing [noise]\n[noise]\n\nHer husband is that an audition he's also a singer and it's from it's turned off she texture mom there's nothing bad\nShe finds her mom and ready then somebody taps on the door the hotel room and caused where are you okay\nCan you come to the door the person asks [noise]\nIn my\nHeart my [noise]\nMom my mom\nGod that was great\nCurrent will be so proud of me [noise]\nOf course the climax of rubber arrives at the entered the housekeeper what she'd she'd be like in the opera version of this story\nUm gosh I mean maybe she just keeps people all day\nMaybe somebody's having a baby and she delivers a baby and she cleans up after it and like she said the guy that\n\nOh [noise]\n[noise]\n\n\n\n\nNow I'm On\n\n\n[noise]\n[noise]\n\nSupport for WNBA comes from the beacon Atlanta presenting beacon family ... face painting magician music or more Saturday October twenty seven one to five PM at the beacon Atlanta more Facebook dot com slash the beacon Atlanta\nI'll let I got the\nYou know she didn't know where they are no no no\nNo yeah with the crowd doubled a great guy so not just the mob mob oh\nSo it's too late to be a deep\nThe heck I got\nGood\nFor you to go to\nRest of the Bronx yeah\nI\nThan I'll think about it\nAnd think about if they go out I think about that [noise] but\nGood about it they go about it I think about it about as I got about\n\nI didn't say yes I did they all think about it I Can't tell you my real name\nBut yes I can confirmed that I did get asked to the prom\nThe undercover officer who posed as my oldest is twenty five years old or new recruit with the Palm Beach who you\nThe senior and find out who's\nBuilder wean you would not believe how easy it is to get him\nI imagine a teenager and\nHere in leading me\nDoing my job man I'm doing it right and\nWe asked you to prop right so\nI guess I really commend then would you know\nBy the way\nFeel comfortable with all your friends\nYou mean\nMean these are\nOh let us know\n\n\nWe also have links to where you can get the official cast album recording of Twenty one Trump Street the musical\n[noise]\nPossibly the shortest cast album recording and Broadway history\nComing up\nBy ... and the secret jokes professional comedian usually only shares at home\nThat's an emitted from Chicago public radio when our program continues [noise]\nAnd you're listening to this American Life on Ninety One W. A. B. E. N. Leno [noise]\nThank you for joining us we appreciate the company and we appreciate all the help we had during the fall member drive over the past week or so\nWrapped everything up on Friday nights but if you commit to make that contribution and you didn't quite have a chance to do so\nYou still can at least through the weekend what we're doing is we're entering everyone into a drawing for a a one thousand dollar apple gift card this courtesy of leap frog extraordinary IT Services\nAll you have to do is make your contribution is six Seventy five five three Ninety Ninety or W. A. B. E. dot org so thanks to them thanks to Ira too deeply in a big part in the last Dr we really appreciate is they'll do what you can at W. A. B. downward\nThanks [noise] support for WNBA comes from Atlanta international school early learning sooner and intellectually stimulating environment for three and four year olds who immersion language programs in French German Mandarin or Spanish led by native speaking teachers details at a high school dot org\nAnd he spoke of his first broadcast twenty fourteen\nJust American Life Mara glass each got a program which is a theme bring your different kinds of stories on that theme today from the stage in Brooklyn Academy of music in Brooklyn New York City [noise]\nWe have\nJournalism memoir true stories stage as radio drama we have arrived at two of our show\nAt two of mice and men\nSo this next bit of radio drama is not an experiment for it's like a musical or an opera we thought it would be smart of one story in today's show where we know what we're doing [noise]\nDid radio drama we actually bring you now and then on the program a true story told on stage by the person that it actually happened to please welcome comedian Mike for big oil [noise]\n\nPretty easy following a musical\n[noise]\nI uh I think my favorite thing about being married is actually that you can share jokes\nWith your wife or husband better funny to you and that person and no one else other than maybe your cat a good when you have a cat your barometer for humor [noise]\nOut the window a [noise]\nLast summer my wife and I went on a trip to the Massachusetts and and I called it\nCats that you said [noise] which is not funny but in our house was would you agree with the\n[noise]\nI was just like we're going to get the Jews as my wife is our\nEveryone loves a good time when you have a cat and so [noise] so we drive a cab to choose that and when we arrive\nMy wife is a headache and she asked me if I were acclimated either and that's our cat to the bedroom 'cause you can't just put an indoor cat into a house because ... and [noise]\nSo I bring him in the bedroom but I'm so tired from the drive that I fall asleep which is the only thing\nYou cannot do when it happened ... an indoor cat their houses I wake up an hour later I mean is gone and he got ours now running around the house somebody I'm yeah my cats can explode I wake up my wife I say quo her name's Jan\nTies to [noise]\nMr Fantastic is gone and his his name's either [noise]\nAnd co gave me a look but I can only describe as divorce died\n[noise]\nJust before that point I was convinced that we would be married forever and then once I saw the divorce and I'm like oh I get this could end [noise]\nIf it ended it would look a lot like that and so now [noise]\nAnd the two of us are running around the house or something like my marriage is falling apart like cats load and refine diving but we have another major problem in the house which is that there were might\n[noise] actually\nWorse because they were there were terrorists they might say what's called the ... most of which means they have a yeah you you might know it just says they've a parasite in them and as a result they're under afraid of cats\nAnd the unafraid to people and the way we discovered that was that my wife was watching TV and she looked next to her and there was a mild [noise]\n\nHe was watching TV also [noise]\nThese games and he just looked up at her like you were a little like hey what's\nGoing on [noise] I don't like this show either [noise] I don't know why all those women who would want to marry that one guy [noise]\nShe pushed him off the couch and he didn't even run away he didn't even hurry which is a for instance did for my [noise]\nHe just walked in the kitchen like a room mate like five [noise]\nI'll go on the other room I just think you're overreacting [noise]\nAnd many did a confessional end of a mouse scam in the kids yeah [noise]\nHe was like I'm not here to make friends [noise]\nI'm here to when\nI was here before they came I'll be here when the John I'm I'm Out [noise]\nThat's\nA real mouse like cats and she was done [noise]\n\nThat night I'm unfounded with my wife wake me up by grabbing my face [noise]\nShe says mo my name's Mike [noise]\nMr Fantastic found the mouse you need to get the mouse and I showed up and I said oh\nWe have a cat and we do everything for the cat we give him food we give him an apartment that he thinks is the world [noise]\nSet aside in the area in the apartment for him to poop and weak lean more often than the area where we\n\nWe have a gentleman's agreement [noise] that'd be in the unlikely\nEvent that amount should walk in a jar [noise]\nAnd they will kill a mouse [noise] and we will\nNever allow miles a gallon [noise]\nNew we project [noise] I had some ... father [noise]\n\nMy wife does know get the mouse and I stood up and I see what maybe the strangest Cabo Iowa ever witness in my entire life\nI been mapping the mouths the mouse why\nDoesn't the air ... walks back sports [noise]\nI mean the\nFact\nThat I really real [noise]\nHe's toy is the law and [noise]\n\nI have a serious sleepwalking disorders do as I Am watching that I'm not even really sure it's happening [noise]\nI'm doing it I had this dream before [noise]\nMy wife has ... get the mouse and she hands me a call [noise]\nSet up a walk towards the mountains and the mouse walks towards me [noise]", "show_name": "This American Life", "year": "2018", "city": "Atlanta", "day": "21"}