{"month": "10", "state": "TX", "station": "KTDH", "content": "The executive producer is Steve Robinson McLaughlin thanks for joining us\nThis is the W. F. empty radio network\n\nWithout music a philosopher one said\nLife would be a mistake\nListening too familiar music reminds us why it matters well discovering new works provides an endless source of delight exploring music is dedicated to the deeper appreciation and pure enjoyment up music it comes to the station because up support from listeners like you together\nWe keep the music playing thank you\nThis is the W. F. empty radio network\nHurricane micro continues to wreak havoc through the Gulf Coast region the wind was so strong with fisheries you just about every ... voice again\nAnd the way he never danced the house you can't live with something major announce it changed the latest on the historic deadly hurricane it's afternoon on all things considered from NPR News corps clock central on high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva some high plains public radio available everywhere on line at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream and please thank patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\nLive from NPR News in Washington ... ... you went stocks are lower again today after a rally yesterday the push the Dow industrial down more than eight hundred and thirty points\nIn Washington ... ... you went stocks are lower again today after around yesterday the push the Dow industrial down more than eight hundred and thirty points as NPR's John Ydstie reports so far the losses are much smaller today\nThe Dow fell about a hundred and thirty points of the opening bell but a positive report on us consumer inflation help support the market which bounce back and forth between Washington gains in early trading then some negative news from the White House on trade tensions with China pushed doc slower\nAt the morning session the Dow is down over three hundred and Seventy points\nIt regain most of background later investors are worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the feathers out of control and making a mistake John Ydstie NPR News Washington\nPresident Trump says results of an investigation into the disappearance of Saudi journalist Jamal because she'll gay may be released soon in the meantime as NPR's Ayesha Rascoe reports Trump is pushing back against called from both parties in Congress for the U.S to stop arms sales to Saudi Arabia\nTrump says the U.S will take action against Saudi Arabia is determined that Saudi harm Jamal ... but he said he does not want to impose sanctions that will prevent the Saudi Government from buying US military equipment\nI don't like the concept of stopping and investment of a hundred and ten billion dollars into the United states because you know what they're going to do they're going to take the money to spend it or Russia or China or someplace else\nTrump said there are other ways to punish the Saudis though he didn't offer any examples Ayesha Rascoe NPR News the White House hundreds of\nThousands of homes and businesses are without power in the southeast us today after hurricane Michael it came ashore along the Florida Panhandle just shy of a category five before weakening to a tropical storm over South Carolina North Carolina governor Roy Cooper says it's now one of his state\nThe ragged but still raging remains of hurricane Michael have now come to North Carolina [noise] the storm has already been done to lash our battered state which crawl wins and heavy rain\nThat storm is expected to move into Virginia by tonight the national Hurricane Center says parts of North Carolina and Virginia could be life threatening flash floods the state Supreme Court in Washington today struck down the death penalty saying that it's been applied in an arbitrary and racially discriminatory manner\nWashington is now the twentieth state to outlaw capital punishment\nAt last check on Wall street the Dow is down a hundred and eighty nine points the S. and P. as down twenty three the NASDAQ down eleven [noise] this is NPR News from Washington\n\nA judge in New York state today that's missed a sexual assault charge against former movie producer Harvey Weinstein prosecutors did not object citing information they obtain since that charge was filed\nThere are five others sexual assault charges still pending wind staying it's played at not guilty to all of them as well as accusations of sexual misconduct including rape from scores of women going back decades\nOfficials in Indonesia are extending the search and rescue effort that began after a powerful earthquake and tsunami struck the island of ... wasting nearly two weeks ago Michael Sullivan reports the official death toll has their plants two thousand\nOfficials say volunteers and relatives of the missing will be allowed to continue their search is hoping to find at least the bodies of those they lost nearly two week then there's almost no hope of finding anyone to live\nTheir search is hoping to find at least the bodies of those they lost nearly two week then there's almost no hope of finding anyone to live\nThe official search effort we'll end with mass prayers in some of the hardest hit neighborhoods appalled at the official tally of the missing standard six hundred and thirty but no one really knows how many victims remain buried under the rubble the national disaster mitigation agency says the number could be as high as five dollars\nTomorrow the government will begin focusing on their next challenge rebuilding for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nAnother earthquake struck Indonesia today and had a magnitude of six and ... job on Bali islands officials say three people were killed\nIt appears the newest quake did not affect the international Monetary Fund and the world bank meetings in Bali this week the leaders of those urge the U.S and China escalate trade tensions I'm nor rom NPR News in Washington\nSupport for NPR comes from black men maker of go to meeting proud sponsor about how I built the summit taking place in San Francisco at the ... center October sixteen learn more and go to meeting dot com and the listeners who support this NPR station\n\n[noise]\n\n[noise]\n\n\n\n\n[noise] All right we've been listening to defy brown they are a family of ... the kids didn't maybe like five ... five brown signed piano as we heard the Eighteenth variation on the mid ... by Sergei ... ... client quite an act they have there\nAnd they in the cage and I were talking about the fact they're studying my artist and the reason is that cake that's\nExciting information about west Texas the name right now yes really\nWe're talking about the fact they're Steinway artists and the reason is that Kay has some exciting information about west Texas and am right now\nYes I'm really pleased to remind everybody that west Texas A M University in canyon has had to all Steinway designation that means all the piano students and all the piano it's within the WTC music department\nAre scanned ways and what's so great about this and set the students practice on Steinway they perform on Steinway so they know what great sand\nShould be like and they can strive to to reach higher goes uh when they made this designation\nStanway company sent their artist Arlington Jones over to entertain those of us that we're fortunate enough to go that evening to um witnesses the designation and also here Arlington Jones but I just really applaud the efforts that W T went to to\n... it's just not a small thing but that they went to to make sure Steinway piano it's we're we're there and available for all the piano students and thank you again Steve for cheating this piece I wasn't familiar with the browns but how much fun to have five of your children playing the piano\nMaybe tomorrow we'll do that I have them doing Rhapsody in blue just five yeah it's pretty amazing that would be just great great and what you were talking about the collaboration with Steinway and and a W T is a well that a collaboration and it keeps the quality high and\nI think we could draw a line that a parallel between H PBR and our listeners our listeners contribute\nAnd they keep the quality of programming hide your lifestyle keeps the quality of the WTC\nThat is so true and you listeners your action you know important to make sure that we can continue with these programs so college and one eight hundred six seven eight seven four four four or go online and contributed H. P. P. R. dot org [noise]\nAll right before we get back to the music I'm going to remind you that we have a three hundred dollars go this hour your phone call you're a Web pledge\nThey are important to us so the number is one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org if you're a new member we are are welcoming new members at this time at any level\nAnd if you're renewing member what better time to renew your membership\nWill now here it'd be concerto in the major for violin and piano or from Mozart and ... are violinist Christopher ... is at the piano\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\nYou've been listening to the first in their mid may be sorry concerto for violin and piano when the major\n\nViolin so loaded with Dorie Christopher ... piano in the in the hour symphony orchestra\nThe violin soloist with Dorie Christopher ... piano in the end the our symphony orchestra\nI'm Steve Johnson you're listening to send phony or on member supported mission driven high plains public radio were in day two of our fall membership campaign and we have a goal of three hundred dollars this hour if you're a new member it's a great time to call we welcome you at any level it's comfortable for you\nIf you're a new renewing member we love to hear from you\nIt's it's that time to support your public radio station high plains public radio and you could do that by calling one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org cake Kennedy is with me this afternoon welcome K.\nYou have given us great music to listen to I Want to remind viewers and listeners rather how important action is on your part\nHigh plains public radio is the only source for classical music and the high plains region so if you wanted to continue to be part of making that happen your support is greatly needed\nH. P. P. R. its mission driven and members supported and some of the support we any size gift is great weather is small when or large when you can do monthly gift you can\nJoin online but it is important to make sure that we do keep classical music I'm available for everyone H. P. H. P. P. R. it's always there when you need it wherever you are whether you're at home\nOr whether you're at work or whether you're in your car that's my favorite place to listen and you can even listen on land so be sure and make take action on your part be part of the group that is sponsoring classical music throughout the high plains area\nAnd came here from ... from Amarillo you're you you're kind of involvement classical music scene down there and we'll talk more about that tomorrow but\nThat would be great and one of my favorite why you're talking about what\nH. P. P. R. offers I also love Sunday baroque I Know\nIt always comes on at a time when I'm sort of had a church on the way to the grocery store and I just have those H. P. P. R. moments in the parking lot at the grocery store [laughter] listening to send Sunday baroque but I think I think this is a great um\nMenu of options for people that do like classical music and it's wonderful that\nThey should be PR his step forward and been able to present so many of these are the three hundred communities that we have within our planes listening area\nHigh plains Public Radio's really proud to be part of the the classical music community here on the high plains and one of the things we we have here that we offer is the uh Amarillo symphony present which features ... past performances of the emerald symphony and\nThis coming Thursday a week from today I'm really excited about this because I I Would say I'm reluctant for the presents but we will be featuring the routes and phoning in\nA performances from the ... from the last season of Amarillo simply presented and we're also going to be giving away vouchers for some concerts and he's in a great\nDeal that you ought to be sure and listen in so you can get a voucher to go if you don't have season tickets to the emerald symphony I Know their seats and has been excellent unfortunately I've been out of town for some of them but I certainly hear from my friends have fabulous concert was that I missed\nAnd and one of the great things about that is it the concert you miss you may hear next summer on the on the radio program could\nIf you are in Amarillo symphony fan give us a call one eight hundred six seven eight seven four four four\nGood go if you are in Amarillo symphony than give us a call one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org and make your pledge online all pledges on mine are safe and secure\nOur goal is three our director is looking at me three hundred dollars is our goal this hour so give us a call at one eight hundred six seven eight seven\nFour four four and I'd like to remind everybody about the theme for this and you'll fall Dr it's gain knowledge\nGrow community and give now with an exclamation point so we want to hear from you one eight hundred six seven eight seven four four four R. H. P. P. R. dot org\nBe part of the effort of member supported mission driven high plains public radio when they present classical music\nAlright coming up next we have a a legendary conductor orchestra and recording these are the historic recordings\nThat are true Tuscany made with the NBC symphony orchestra in Nineteen thirty so audio files don't expect stereo this is in ... but it has been re mastered the beautiful recording\nWill hear the first movement of Schubert symphony number eight and in the major it's also known as the unfinished here is ... ... Arturo Toscanini and the NBC symphony orchestra\n\n[noise]\n\n\n\nRemember high plains public radio classical music it's supported by listeners just like you so if you are a member we thank you if you're not pleased considered joining and become a member listener\nAnd do your part that calling right now and joining H. P. P. R. dot org that is one eight hundred six seven eight seven four four four thank you so much to all who called\nAnd thank you for tuning into some phony or this afternoon I'll be back with a Dale Bolton for the second hour in and uh right coming up right now we have news from National Public radio thanks for listening to this afternoon\n\nHurricane microfiche he needs to re Catholic through the Gulf Coast region the wind was so strong fisheries you here just about every ... in in ...\nIn the rain just hitting up against the house you could live with something major I Know that change the latest on the historic deadly\nYou know against the house you can tailor with something major I Know that change the latest on the historic deadly hurricane this afternoon on all things considered from NPR News or clock central on high plains public radio\n\n[noise] who says Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere on line at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\nLive from NPR News in Washington I'm nowhere rom hundreds of thousands of homes and businesses are still without power after hurricane Michael in Georgia the governor is telling people to be patient from member station W. A. B. E. Susanna Capelouto reports\nGovernor Nathan Deal says chainsaw strikes teams have been deployed two counties in southwest Georgia hardest hit by hurricane Michael more than a hundred and twenty state roads are closed and debris removal is key to get power trucks into the area he's urging the public to stay out of their way\nPast experience till they're one of the greatest impediments to restoring power is people who get in the way all the power trucks and the crews are working to make that happen\nDeal says more than fifty poultry houses were destroyed hospitals and nursing homes in southwest Georgia all running on generators for NPR News I'm Susanna Capelouto in Atlanta\nA lawyer for former Trump deputy campaign chairman Rick Gates called him a model cooperating witness NPR's Carrie Johnson reports gates is seeking less supervision before he sentence Rick\nGates is asking a judge to remove him from electronic monitoring and and the night time curfew\nHe also wants to be able to travel more freely in DC in Virginia gates has been living under restriction since he pleaded guilty to lying to the FBI and conspiring against the United states he's been meeting with prosecutors any testified against his former boss Paul Manafort at a trial in August\nAnd lawyers have gates is continuing to help authorities with the investigation into Russian election interference the special counsel's office did not opposed gates request\nMeanwhile a federal judge in Virginia has asked to hear from Manafort and special counsel next week the judge wants to know more about how Manafort's cooperating and that is sentencing date Carrie Johnson NPR News Washington\nWith twenty six days until the mid term elections Senate majority leader Mitch McConnell says he thinks the confirmation fight over Supreme Court justice Brett Kavanaugh makes it less likely the Democrats will win the Senate\nUm increasingly optimistic that we may hold or majority now that could make a huge difference\nAnd one of the good things about the Supreme Court fight as it underscores for Republican voters that the shuttle is on the personal business is a project of former judges is over for the last two years as President Trump\nMcConnell was interviewed by NPR's Kelsey Snell the medical device maker ... says it's disabled Internet updates for some thirty four thousand care linked programming devices used by health providers to access implanted pacemakers\nThe company says the system could be vulnerable to cyber attacks which could harm patients but ... says it has not received any reports of such attacks but his developing security updates\nIs another down day on Wall street at last check the Dow is down four hundred and Seventy one points that yes in the U.S down fifty this is NPR the Labor Department reports consumer prices\nSeventy one points the absentee is down fifty this is NPR the Labor Department reports consumer prices rose one tenth of one percent last month\nThe so called core index which leaves out the volatile food and energy component was up one tenth of ... percent last month for the second straight month\nSince consumer prices are up Social Security recipients are getting a raise a cost of living adjustment of two point eight percent it will start in January\nDozens of Taliban and Afghan security forces have been killed in Afghanistan as violence continues ahead a parliamentary election Jennifer glass reports from Kabul\nAt least fourteen Afghan border police in seven Taliban were killed in ... province northern Afghanistan when the Taliban attacked a series of police checkpoints in a district on the country's northern border\nThe Afghan intelligence services Twenty one Taliban were killed in might on ... in central Afghanistan and an air raid because they were allegedly gathered to plan attacks on the upcoming election the parliamentary vote is just over a week away with the Taliban ad Islamic state has vowed to disrupted\nThe United nations says despite significant security challenge it progress has been made by the security forces to create conditions for the majority of Afghans to vote\nFor NPR News I'm Jennifer ... in Kabul\nVisitors to the crop all is the most popular tourist attraction in Greece are out of luck today it's closed\nWorkers cold at twenty four hours strike because they feared some landmarks maybe sold as part of access to privatize it's part of Greece's international bailouts government officials say historical sites will be exempt from the program\nNor rom NPR News\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\n\nSupport comes from the office products of Garden City announcing their new location at ten sixteen what's Mary street offering business supplies would sail to service on new and used office equipment more information at key office products dot com\n\nMm Mm Mm Mm [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[laughter]\n\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\nAnd do\n\n\n\n[noise]\nMm\n[noise]\n\n\nSupport for H. P. P. R. programming is provided by listener members of the high plains public radio and by Amarillo College started here go anywhere Amarillo colleges on the Web at a CTX dot edu\nUnderwriting support is vital to providing you with public radio service support the businesses and organizations you here supporting each PBR\n\nWe just heard that Mozart's concerto for two pianos and orchestrate we heard the third movement there onto a leg grow our pianos swimmer a pariah ... and ... to ... and they played with the English chamber orchestra\nWelcome to send phoney and I'm Steve Johnson we have a\nAn afternoon as great music still ahead and we're also on day two of our fault membership campaign now it's time to support classical music on your public radio station\nHigh plains public radio the number to call to renew your membership or to become a new member is one eight hundred six seven eight seven four four four\nOr if you prefer to go on line you can do that at H. P. B. R.\nDot org del Bolton is our programming director here at high plains public radio and and del Webb and tell us about how how listeners support helps you keep up quality programming\nOh you know Steve and there's a lot of choices out there that I have to make as far as what programs are going to be aired\nUm we have a tradition almost thirty eight year tradition actually over thirty year tradition of presenting classical music in the afternoons on high plains public radio so I feel like there's a real responsibility there to find the best possible\nProgramming that we can\nWe invest money every year even acquiring new CDs or we receive a lot of new CDs a lot of new music uh every every month from a different distributors um and that's how we keep current in the in the program and it\nScares me the programming that we present [noise] we've got a lot of exciting things that are happening right now as well uh you mentioned it earlier but I remember listening for the president's ah really has turned into a\nSkews me that turned into a a tremendous partnership with a symphony or as soon as the season is over we start preparing their season is over we start preparing for our season Thirteen weeks of the best of uh\n[laughter] emerald symphony a highlighting the just past season then as we get closer to the beginning of the new season we will talk a little bit about that and coming up next week I Know you won't want to miss this will be here on Thursday Afternoon because we are going to have a\nSpecial celebration the emerald symphony next Thursday Friday\nAnd some of the pieces we'll be hearing how they're all from this last twenty seven teen Eighteen season or the Amarillo symphony and highlights will be a couple of moments from the first demolished symphony or we'll be hearing the Beethoven ... symphony\nAnd they'd be see ... those are just three of the things that are coming up next Thursday and even better yet man when Dale confirmed this yesterday right we're ... we're giving vouchers for for concerts and you can or will be doing drawings at the end of each hour and you'll be able to choose which concerts\nFor for concerts and you can uh we'll be doing drawn to the end of each hour and you'll be able to choose which concerts you'd like to go to this this season and Amarillo so uh it's all part of the classical music community here at high plains public radio and we're proud to be part\nOf the classical music community here on the high plains\nBecome a member and support that be be part of the community\nOf classical music on the high plains public radio you can become a new member at one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org I'm looking to see what music I have coming up next and we're going to hear the English chamber orchestra\nUh with uh um\nConducted by Herbert ... and we'll hear the box the third moment a box brand Brandenburg Concerto I can talk here now [laughter] we have something in the air here Brandenburg jirga number three in the major\nWe are going to give you a little call to action here to support your public radio station high plains public radio\nNow it's a great time to renew your membership\nBecome a new member so we can keep this great programming up here on the high plains as I'm K. mentioned earlier we are the only station on air station in the region to provide a classical programming\nAnd we do it in a band and we have since found in the afternoons evening classics that seven\nExploring music at noon and I believe that that's it repeated eight o'clock doesn't it down exploring music Sunday baroque classical guitar alive Amarillo symphony and New York philharmonic on Tuesdays to leave anything out there [laughter]\nThink yeah I think you've got it I Know is it is quite a line up in a\nI Would say that we probably dedicate more hours poor per week to classical music in any other musical form [noise] you know I was we were talking earlier about the great collaboration that we have with the emerald symphony and we're working on some others or some other great uh orchestras ensembles in our\nCommunity that we serve or when it comes to mind is chamber music Amarillo ... we are working on a project with them um and then uh we're also a made some initial ah conversations with the four days\nA state or the have symphony orchestra at school and go to school anyway or there's a lot going on out there in the world of a classical music and a live performance is happening all over I Hope you'll avail yourself to some of those we did talk about the ... coming up uh\nUh we talked about the Emerald City in the program and we're going to happen next week on the emerald simply they'll also have the Kurt ... concerto enough so uh if you're going to make\nProgram and we're going to happen next week on the emerald simply they'll also have the dirt Gershwin concerto enough\nSo uh if you're going to make an effort to get down there or get over there get across town or next door whatever it takes to get to Amarillo I wouldn't want to miss a concerto in half\nBy George Gershwin and that features Conrad dialing piano so should be a great performance at the ... next friday night and I just not tomorrow but a week from tomorrow\nAnyway a lot going on uh what are these collaborations and in these partnerships that we have with with symphonies are around our area and other orchestras around the world like New York philharmonic is made possible by listening remembers\nPeople like you making a pledge to support a\nA five hundred dollars a gift to public radio would be much appreciated would meet our goal for the hour but if you don't feel five hundred dollars is within your a financial grasp why not make a fifty dollar pledge to public radio it's just a simple\nAnd it has just about the same impact um every every every pledge counts just standing up and saying yes\nI like classical music I Want to make sure it stays on the air on public radio and I'm willing to put a little bit of my money towards it so\nThe way you do it is very simple good H. P. P. R. dot org look for the give now button fill out the one page for you've got it made if you don't like to go to your computer right now or your smartphone or whatever it is\nI'm just calling us eight hundred six seven eight seven four four four we've got a great people standing by to answer your phone call they love to talk to you\nAnd again it only takes a few minutes and you will have done your part to make sure that classical music stays on the air on high plains public radio\nAgain eight hundred six seven eight Seventy four forty four online at H. P. P. R. dot ORG\nAll right we have some exciting Russian music coming up next we have from Alexander bargain we'll hear the pile of that team dances and that they are performed by the Boston Pops orchestra under the leadership of the late Arthur Fiedler\n\nOne eight hundred again is that number to call one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot\nOr become a member today renew your membership today if you like carrying classical music on H. P. behind the afternoons now at the time to show your support for it okay we now have a Arthur Fiedler with the Boston Pops\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\nHere at the top of the hour three o'clock and then one more hours of some phony a police state June or if you can change course just a little bit to make a pledge of support to public radio whether it's on your smartphone or your tablet or your computer or go to age ... P. R. dot org and look for you've now\nIf you um\nBy telephone you know even if you have a rotary phone you could reach that eight hundred six or seven for forty four make a pledge do shopping is after moon that's going to make classical music alive and well in the high plains you're the only one that can do it\nOr you're the only one who will put on the effort who has the means and resources to do this to her calling on the eight hundred six seven eight seven four four four\nHurricane micro continues to wreak havoc through the Gulf Coast region\nThe wind was so strong ... fisheries you here just about every tweet cracking in breaking and and the rain just hitting up against the house is is you can tailor with something major\nAmounts to change the latest on the historic deadly hurricane this afternoon on all things considered from NPR News or clocks central on high plains public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere on line at H. P. P. R. dot org\nThe cost of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\nLive from NPR News in Washington I'm nowhere rom hundreds of thousands of homes and businesses are without power in the southeast us after a tropical storm Michael and battered the Florida Panhandle yesterday coming ashore as a category for hurricane before weakening\nNPR's Greg Allen found in from the road just south of merit not met Marron our Florida he said trees and power lines are down everywhere\nEven in areas are far because the place that Michael made landfall ... destruction everywhere you're an adult for pine trees forces toppled over just like matchsticks office the houses are questioning the largest reasons although that store there's no power little south of ... that lists nearly everyone cut off here\nGreg Allen in Marion when Florida Michael has been wrenching North Carolina which is still recovering from Hurricane Florence last month the storm is expected to move into southeastern Virginia by tonight\nThe future of the international space station is on certain after the failure of a Russian rocket that was supposed to bring up to a new crew members the pair returned to earth on harmed but as NPR's Nell Greenfieldboyce reports the Russian rocket is the only way to get people to the station and now it's under investigation\nKenny Todd as a manager at NASA for the international space station he says it's three current residents are fine they've got plenty of supplies\nThey were scheduled to remain up there it until mid December\nThat'll give our Russian colleagues or certainly the better part of two to three months to to try to diagnose this problem and understand what they need to do\nThe existing crew does have to return in early January because they're ride back home the Capitol with a limited lifespan if the Russian rocket isn't flying by then the station may have to do without a crew for a while a big change for an outpost that's been continuously occupied for about Eighteen years\nNo Greenfieldboyce NPR News\nStocks closed sharply lower again today today's sell off follows around yesterday\nGreenfieldboyce NPR News us stocks closed sharply lower again today today's sell off follows around yesterday that pushed the Dow Jones industrial average down more than eight hundred and thirty points NPR's John Ydstie has more on today's trading\nThe Dow fell about a hundred and thirty points with the opening bell but a positive report on us consumer inflation help support the market which bounce back and forth between losses in gains in early trading\nThem some negative news from the White House on trade tensions with China pushed docks lower the Dow was down almost seven hundred points at a low for the day before it regain some of the lost ground\nInvestors remain worried about trade issues and rising interest rates which are negative for stocks President Trump again criticized the fed for raising rates saying the fed is out of control and making a mistake\nJohn Ydstie NPR News Washington\nRight before the clothes the Dow had fallen more than one and a half percent the S. and he lost more than two percent and the NASDAQ was down one percent this is NPR News from Washington\nThe Labor Department reports consumer prices rose one tenth of one percent in September after rising to ... percent in August later the Social Security administration said Social Security recipients well received two point eight percent more starting in January to adjust for the higher cost of living\nThe average monthly Social Security payments for retired worker will be fourteen hundred and sixty one dollars next year\nScientists have quantified just how easy it is for police to use the genealogy databases to find such vexing crimes NPR's Rob Stein reports on a paper\nPublished in the journal science\nPolice have increasingly been using DNA posted on genealogy databases to track down suspects so researchers analyzed the genes of more than one point two billion people in one genealogy companies database\nThey discovered they could identify a third cousin or closer relatives for more than sixty percent of people of European descent\nMost of their customers came from a background\nThe researchers say the results show just how easy it is for police to use genealogy data and argue more should be done to make sure people using genealogy websites are aware of this and give their permission Rob Stein NPR News\nAnother earthquake struck Indonesia today measured sex and shook the islands of Bali ... officials say three people died on September twenty eighth a seven point five earthquake and tsunami it's still a ways the island killing more than two thousand people\nThousands more are still missing and feared dead I'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\n[noise]\n\n\n\n[noise]\n\n\n\nAnd it\nWas interesting [noise]\n\n[noise]\n\n[noise] and there will be\nThe\n\n\nOne\nDidn't\nJohann Sebastian Bach err on the cheap dream performed by the English chamber orchestra good afternoon your which in Bonita if you're just tuning in and I'm Steve Johnson I'm with Bob Davis executive director it H PBR and we are\nIn the middle of the afternoon in the second day of our a membership campaign are falling membership ship campaign\nIt's an exciting time for us here at high plains public radio\nAnd and it's exciting time for you because you can renew your membership or better yet become new members that high plains public radio with support this programming that you listen to an ...\nYou can do that by calling one eight hundred six seven eight seven four four four or going on line and pledging at H. P. P. R. dot org Bob\nUh good afternoon Stephen and good afternoon everyone and thank you for listening to high plains public radio this is a sort of programming that has a unique following people who listen to this tell us that this is a a relaxing part of their day in a way to a\nWay to sort of but the air out of the tire slightly and take a breath that that's the song we just heard I thought was that was the pants\nDale away to a way to sort of\nBut the air out of a tire slightly and take a breath that that the song we just heard I thought was a was a fantastic way to sort of come to mind and those those folks who tell us they love it we we would encourage them to think about why why you ... what are the other reasons you might listen\nAnd why you might value this music and the more importantly\nHow can you preserve it in that last question is one that I feel confident in answering and that is you can become a member supporter of high plains public radio you can\nRaise your hand figuratively and say yes I value this music this music which is can only be hurt on high plains public radio in this ... if you're in this region\n[noise] and uh and and join us your gift will make an immediate contribution and it depends on you as a matter of fact we are we're asking you to please consider\nJoining your fellow listeners who have already said yes I Want to support public radio and this of sort of music program\nFor the high plains you'll be paying it forward to future generations you'll be paying it forward to others who are like you that absolutely loved his music and want or don't want to see it go anywhere you want to keep it right on\nThe dial a great way to spend your afternoon the way to get this done is to go on line to H. P. P. R. dot org when you get there you'll see our home page\nA beautiful little windmill in a\nLittle landscape and the right hand side to see or read give now button you can click that button and it is a absolutely painless process to be guided through and make your contribution as little as\nTen ten dollars a month a little as five dollars a month if you prefer to do that on the telephone you can do it at one eight hundred six seven eight seven four four four\nMake the phones ring we have a we have a lot of folks out there waiting for the for the phone to ring and we don't want him sitting idle Steven we want I'm busy right right\nRight and Bob one thing I'd like to touch on you were mentioning reasons we listen\nAnd I consider myself to be a lifelong student of well everything but [laughter] including music though and\nAnd as much music as I have discovered over the years uh\nThere's always something else to find and I've I've heard things from Jenny on high plains morning a brother t-bone blue show\nThat I hadn't heard before wasn't familiar with so that's an and certainly aunts and found here and exploring music so it's a great opportunity for learning and expanding your musical horizon as well as your current events with the news programming here so\nHe's Matt fact I'd like to thank you for that and in fact I texted by wife earlier and I said that uh\nShe was doing a fantastic job and I'm loving this music and she said off because she's a lover of a classical music herself and she said I see what you did you turned me onto the beastie boys and the drive by truckers and I'm slowly turning you on ... and I went\nUm I'm Still live there already and I I really appreciate it it's a fantastic\nFantastic way to spend your afternoon and then it's a very it's a it's a it's a very\nUnique situation we have here with programming we we juggle a lot of ... it's a lot of programs\nAnd uh so keep that going for us here on the high plains one eight hundred six seven eight seven four four four there are folks were waiting to take your call or you can go online at H. P. P. R. dot org\nUp next we have a cellist yo yo ma performing an arrangement of the three piano ... George Gershwin they were\nNext we have a cellist yo yo ma\nPerforming an arrangement of the three piano ... George Gershwin they were originally written for solo piano but we haven't arrangement here in which ... ... plays cello and he's joined by Jeffrey ... hang on yeah\n\nNa na\nNa na na\n\n\n\nNa na na\nNa na\n\n\nNah\n\nSupport for high plains public radio comes from member listeners and Larsen engineering incorporated consulting petroleum engineers of own it Kansas\n[noise]\n[noise]\n[noise]\n\nTo know\nNa na\nNa na commercially Iran or\nRight now I'm\nActually a lot [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\nOh why oh why oh whoa whoa\nWhoa\nWhoa\nWhoa\nWhoa\nWhoa whoa whoa\nWhoa whoa whoa\nWhoa [noise]\n\n[noise]\n[noise] or [noise] or\nOr\n\nSupport comes from a marvelous company presenting concerto an F ... by robots conducting and featuring Conrad towel on piano October nineteenth and twenty seven thirty PM at the globe new center ... company dot org\nFrom a collection called better love composting conducted by Tom ... won\nSoprano we heard again this time of desire and I once dreamed you're listening to San Antonio on member supported mission driven high plains public radio we are looking for your support yes the ball membership campaign time\nAnd we are asking for your support for high plains public radio this is your radio station for the high plains and ...\nPain time and we are asking for your support for high plains public radio this is your radio station for the high plains and we want to keep it running so you can do that you could do your part by calling one eight hundred six seven eight seven four four four\nOr go on line at H. P. P. R. dot org I'm Steve Jobs that I host at\nA show called open range here on Saturdays\n'em and occasionally sin phony or for occasions like this in Amarillo symphony and I'm joined in the studio by Bob David the is the current executive director here at high plains public radio or good afternoon Bob\nGood afternoon Stephen and good afternoon everyone listening to high plains public radio this afternoon a with this wonderful selection amused with Stephen inspect out we'd like to thank you for a\nFor listening in and we would like to ask you to please consider supporting this sort of programming why do you listen what what compels you to hear this music which is part of the soundtrack of high plains public radio\n[noise] why do you do with other people tell us it's\nIt's a it's a calming and a a soothing way to spend the afternoon whether they are at work or whether they're doing their chores about town a it is a it has a unique program for the high plains you sort of music that cannot be heard anywhere else and if you value it because we we know that you value it\nWe would ask you to consider making a gift your gift will make a real difference\nThe way to do that is to go to H. P. P. R. dot org and click the red give now button and you'll be guided through a very easy process to\nLend your support if you prefer to use the telephone that's easy as well you can call one eight hundred six seven eight seven four four four\nMake the phone rang light up a little light in our studio shows is that the phones are ringing keep the staff out there waiting for your calls busy we don't want 'em sitting idle\nOr just enjoying the music we want them talking to you thinking you for your support as being the next caller in fact the next clicker or color and to lose your support Steven what do we have coming up next\nA legendary pianos relate Claudio a route who I saw a play rock Montana concerto ones that second Rocky Mount enough concerto when he was a towering man and he was very tall they are large man and he had complete command that the piano could get a huge sound\nSo I thought it'd be nice to in the afternoon of classics with a performance of arouse the Beethoven ... twenty three and a half minor so here now is Claudio route performing Beethoven on some tonia\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n", "show_name": "Sinfonia", "year": "2018", "city": "Dalhart", "day": "11"}