{"month": "10", "state": "TX", "station": "KTDH", "content": "That's all on tomorrow as we continue our exploration of the symphony over to enjoy this and I hope we can personal for another few minutes at least right now to continue listening to the radio 'cause there's more great program and coming up right now\n\nExploring music is produced by city killer to W. F. M. T. in Chicago and produced an engineer by bill segment that that'd be a cue acts are in New York City [noise]\nWe get production help from ... Marcos and digital islands studios major support is provided by the URL and British Shapiro foundation hello so Mr and Mrs Williams you brown and anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve Robin and I'm ... and thanks for listening this is the debate with empty radio network\n\nAnd run the country for even get them lying down harder on winning you can get written up for not closing your door\nGet written out or jumping on the phone without the men and a low level infraction\nCan have severe consequences like more time it was bad because I Know yeah I'm at home who the mole and an NPR investigation that onion on all things considered from NPR News for a clock central on high plains public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da ... or a service of high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nLive from NPR News in Washington on Lakshmi sang President Trump and first lady Melania Trump are saying the next few hours in Florida and Georgia being raised on the hurricane recap right angle an air force base this afternoon and Trump applauded what's been done so far\nBeing briefed on the hurricane recovery Glenn air force base this afternoon Trump applauded what's been done so far off it as far\nFar as your\nLast week hurricane Michael roared ashore in Florida Panhandle is a destructive category for storm with one hundred and fifty five mile per hour winds it level neighborhoods Mexico beach population of a thousand was nearly wiped out the hurricane wreaked havoc in four states from Florida to Virginia it killed at least Seventeen people\nA team of Turkish in Saudi investigators are searching the Saturday consulate in Istanbul, Turkey the scene of the disappearance an alleged murder of the Saudi journalist earlier this month NPR's Peter Kenyon reports that officials continue to deny any involvement in the journal it's his appearance\nIn the morning Turkish officials announced their intention to search the cubs to look as well as the Saudi consul general's residence and diplomatic vehicles but the search didn't begin until after dark\nTurkish investigators have claimed the journalists ... was killed inside the consulate on October second and his buddy disposed of Saudi officials reject the allegations investigators focused on the arrival of Fifteen ... on the day 'cause she'll be disappeared\nThem into part of the same day Saudi officials say 'cause Yogi left because live within an hour of arriving\nBut it provided no evidence to back up that claim\nPeter Kenyon NPR News Istanbul\nThe Russian Orthodox church is breaking ties with the head of the global orthodox community\nAfter the accurate medical patriarch head of Constantinople decided to grant Ukrainian clerics independence from the church in Moscow for the first time and hundreds of years since Russia annexed Crimea from Ukraine in two thousand fourteen calls for the Ukrainian churches independence have intensified\nStrong wind and dry conditions have prompted Pacific gas and electric for the first time to shut off electricity for some of its customers to prevent wild fires in parts of northern California from member station ... in San Francisco tied Goldberg has an update\nPG E has turned off power for some fifty nine thousand customers in three counties north of San Francisco and three other counties in the Sierra foothills the proactive electricity shut off live some school districts to cancel classes for the day\n... which is the largest utility provider in northern California says the move is in the interests of safety in a last resort due to extreme weather conditions\nThe national weather services wind speeds reached Seventy seven miles per hour or two locations in the northern part of the barrier on Sunday evening over the summer Cal Fire announce it PG nice electrical infrastructure cause at least a dozen fires in six counties last October\nFor NPR News I'm Ted Goldberg in San Francisco\nThe Dow Jones industrial average is up forty seven points that this is NPR any us defense secretary Jim Mattis is on his way to Vietnam Michael Sullivan reports this has managed to second visit this year\nMadison visited communist Vietnam's capital Hanoi in January he's visiting the country's economic capital Ho Chi Minh city on this trip\nTo meet with the Vietnamese counterpart and visit a Vietnamese airbase matter of his trips bookend to visit by the U.S navy aircraft carrier Carl Vinson to the port city of ... in March\nIt was the first such visit since the war and when the signal both sides willingness to grow military ties\nAs China continues construction on disputed islands in the south China Sea in June met us called out China for deploying surface to air missiles on some of those islands place there he said for the purpose of intimidation and corps and for NPR News I'm Michael Sullivan in Bangkok\n[noise] Stephen Hawking has more warnings for the world though it's been months since he died in his final book breached\nIt's all up in the bank Stephen Hawking has more warnings for the world though it's been months since he died in his final book brief answers to the big questions and build it of Lyndon lunch event day hocking writes an education in science around the world are in greater danger than ever before\nLate visited site to global revolt against expert strong the example of President Trump's election and the ... decision to leave the European Union speaking na ve he's attempted divorce the European Union\nStill hinges on one of the thorny issues in Nebraska debate how to avoid a hard border between Ireland which is part of the ... you and the u._k. northern\nIreland Brexit talks stole it over the weekend I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at a lion's for a lifetime income data work\nUm\n\n[noise] na\nNa na\nNa na\n\n...\nLearn\n\nNew book [laughter]\nOh no no no\nIn\n...\nOh\n[noise] [laughter]\n\n[noise] [laughter] [noise] [laughter]\n[laughter]\nAh\n\n\n\n[noise]\nSupport for our Public Radio's classical music is may ... possible in part by the emerald symphony during George Gershwin control torn up with ... conducting and featuring camera do I'm piano\nOctober Nineteen twenty seven thirty pm on the globe do sooner for the performing arts from Amarillo go to Amarillo super ... dot org\nAnd I'd just like to add to that deal if you go to the camera looks ... Facebook page or there's a little video with Conrad doubt talking about the uh concerto and his upcoming performance\nWe just heard a performance of rebel ... by the ballots symphony orchestra under the direction ... [noise]\nI'm Steve Johnson the system phony or our members supported mission driven high plains public radio where I'm In the first hour on a Monday of our membership campaign\nAnd this hour we have a two hundred and fifty dollar membership match from a supporter in University of Kansas I'd like to thank them and I'm going to turn it over right now to reselling who has a thank you\nIf you want to sound smart listen to public radio I listen to the music on public radio because in today's on demand world of social media you can kind of self select everything that you're supposed to answer you stop hearing new things and you sound\nI was so fascinated to hear music that wasn't being played on top forty radio in southwest Kansas [noise]\nMy name is Rachel Coleman I'm from liberal Kansas and you are listening to high plains public radio [noise]\nThank you Rachel Komen from liberal we do appreciate you contributing helping us to match that two hundred and fifty dollar membership to match that we have on the table\nNow because of the pledge that we have we see we only have about a hundred and ten dollars left\nIf that you have a moment just pick up the phone and give us a call one eight hundred six seven eight seven four four four or ... H. P. P. R. dot org as Rachel stated that it's fascinating to go somewhere where you're not\nListening to top forty music but you can depend depend on high plains public radio to provide such a fascinating array of music some that you don't normally hear every day but it sounds it could be a song that once you're hired a brings back a funny memory of something that you did your child to\nGo to a CPR dot org and make the contribution now so that we continue this programming\nWell one of the things you just touched on raises is something that's always amazed me about um H. P. P. R. even when the ... before I\nWorked here was that um they juggle a huge array of music I every genre I Believe is covered there's a good deal of it is classical there's also jazz folk um\nEverything there's there's a show dedicated to to the blues on friday night the friday night with with brother t-bone western swing fans are taken care of with Marshall Allen Bailey\nAnd a classical allergic to bonanza we have a dog and pony in the afternoon and bill McLaughlin exploring music\nWhich I have found to be an invaluable resource in just learning all kinds of things is this week he's talking about the development of symphonic form you know you go to the concert how you go to you're going to hear a symphony usually they're on every symphony program\nAnd the great composers dedicated a lot of their energies to to composing symphonies and ...\nThe great composers dedicated a lot of their uh energies to drew composing symphony and bill is talking about where that all came from this week it's been quite fascinating so all on high plains public radio\nDouble your dollars when you support classical music on H. P. P. R. this hour by calling one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org in this calendar we've been talking about\nIs a calendar that feature scenery from across the high plains and it's done by regional photographers the calendar is available to new members who pledge at a sixty dollar level that's five dollars a month\nAnd a renewing members or a sustained if you increase your sustaining membership even by five dollars you'll get a calendar as well and it's really it's well worth it these things are really beautiful Ruth\nInstead just take a moment go to a CPR that or I'd give us a call that one eight hundred six seven eight seven four four four if you're enjoying listening to this wonderful programming that we have available\nHere would send founder now's the time to continue that fight is calling one eight hundred six seven eight seven four four four spread the word encourage your neighbors also become members if you know that they're listening to the programming and then not membranes invites them to become part of the high plains public radio family\nKnow gas is too small you know five dollars is just a cup of coffee how many of us will spin that on the coffee Bailey\nNow it's time to make a different\nCollege that one eight hundred six seven eight seven four four four until all of those who have taken the time so far today we do thank you for contributing to help us get a bit closer to to go so there's still some other people out there that\nWe want you to give us a call that's just a hundred and ten dollars left on that matching gift of two fifty and two people but the sixty dollar contribution will just not that right out so we never know gift it's too small\nJust give us a call one eight hundred six seven eight seven four four four H. P. T. R. dot org [noise]\nRight now we're going to hear a piece or that that carries a lot of fond memories of my childhood my mum play the flute and when I was a kid she practiced WTC arrange\nEndlessly and I just loved it you do that that these were just go through the house and uh [noise] and my brothers and I were under the it's the the flu to pan and so my brother some orange and that and just kind of wandered through the house when she was playing this piece which he played beautifully I I'm ... and\n... are are plowed it's an escape is is um an annual ... who\nWe're hearing that'd be ... [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nNo\n\n\n\n\n\n[noise] the serene by Claude ... performed by the loudest Emmanuel ... who's good afternoon\nI'm Steve Johnson if you're just joining us dishes since Sonia we're live in Studio today and we're in them getting towards the end of an hour where we have\nA\nHundred and ten dollars left is that correct [noise] ah [noise] ah from our\nChallenge grant we have a membership match from a supporter and you listen to Kansas thank you and you'll double your dollars for the next few minutes\nOr if you pledge before the top of the hours so a five dollar pledge becomes ten and so on [noise]\nI think such a great yelling cheered storage for great classical music now great new tax the power to share your so\nYou know it seems you symphonic dances worth hearing the first movement not awake groped performed\nBy the\nNPR orchestra under the direction of John Elliott Gardner\nPsychiatry printed on your order on you can get written up for not close to your door you get written up for jumping on the phone without the mission and the low level attraction to your car like war time it was sad because I miss so yeah I\nI'm just going to go to an NPR investigation this afternoon on all things considered from NPR News for clocks central on high plains public radio\nNPR investigation this afternoon on all things considered from in your in your clock central on high plains public radio\n[noise]\nWho's who's Ninety One point five ... eighty nine point three ... H doll heart of service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or crawl eight hundred six seven eight seven four four four\nLive from NPR News in Washington I'm Lakshmi Singh James Woolsey former director of security for the Senate intelligence committee is pleading guilty to one federal count of lying to the FBI about his contacts with reporters under a plea deal with the U.S attorney's office in Washington DC\nThe fifty seven year old Wolfe was charged with three counts of making false statements he was arrested over the summer as part of an investigation into classified information links to reporters\nSenator Elizabeth Warren is calling President Trump's bluff a few months ago at a rally Trump went on a rant daring warning to prove\nThat she had Native American ancestry saying that he would donate a lot of money to her favorite charity if she proved him wrong today with the DNA results in hand Senator Warren tweet said she'd like Trump's donation made to the national indigenous women's resource center\nNPR's Asma Khalid has more on what could be warned campaign move\nThe DNA results show strong evidence Warren has a Native American ancestry that dates back six to ten generations\nThe DNA tests the part of an elaborate strategy to end questioned about her ancestry possibly ahead of twenty twenty presidential bad they were released in conjunction with a campaign style video that included clips of President Trump mocking her\nI say I want to pay for it like to have you take the test of the show here in this\nWar in results indicate she could be somewhere between one thirty second and one one thousand twenty fourth Native American Republicans were quick to dismiss the result saying it showed only a miniscule percentage of Native American heritage Asma Khalid NPR News\nDoesn't the people in the Florida Panhandle Mexico beach are still unaccounted for days after hurricane Michael made landfall\nWith one hundred fifty five miles per hour winds one person in that city was killed sixteen others lost their lives as well as the hurricane unleashed powerful winds generated floods and spawn tornadoes from Florida to Virginia\nThe hangar is to add tend to air force base near Panama City or in ruins from that hurricane but as wind daily of member station WFSU tell his Democratic Senator Bill Nelson says fears at the base might have to shut down our unfounded\nSenator Nelson says the basis eleven thousand personnel and most of its aircraft were evacuated prior to hurricane Michael landfall hangers was named heavy damage and some aircraft that remain during the storm are still being evaluated still melt in the debate won't be closing down\nAs a senior member of the Senate Armed services committed [noise] I can say the same goal will be rebuilt and it will be an example of a modern us air force but ...\nSays ... is critically located next to the Air Force's eastern Gulf testing and training range in the Gulf of Mexico the U.S military largest he called the training range quote one of our greatest national assets that\nTry and daily reporting this is NPR\n\nNorth and South Korea say they're going to restore rail enrolled links across their common border NPR's Anthony Kuhn reports it's one of many autumn degree to in the latest round of high level\nKorean shake their way to restore Raylan links across their common border NPR's Anthony Kuhn reports it's when many a decree to in the latest round of high level talks\nThe two sides agreed to break ground this year on roads and railways running up and down the east and west coasts since the Korean Peninsula later this month the two sides will meet to discuss a joint bid to host the twenty thirty two Olympics\nWell this is raising concerns in Washington that the inter Korean rapprochement is getting too far ahead of progress on the nuclear issue\nThat's NPR's Anthony Kuhn reporting the iconic retailers theory it's file for bankruptcy the American on a Cantor hardware appliance including story made the announcement after new single one hundred thirty four million dollar campaign and today NPR's Emily sounds than hands that\nSeriously enough well known mail order catalogs company at the Nineteen twenty century for decades it sold everything from diamonds watching in cars to home history and Jerry Hancock remembers the prominence\nSears taught America a about the modern world through this catalog\nToday it's five point five billion dollars in debt it was a long march to the and the company is seen store closures and tumbling stock in recent years I made a constantly changing retail landscape dominated by Amazon e commerce and big box discount retailer\nChapter eleven filing allows the company to reorganize and perhaps emerged from bankruptcy but some of its\nExistence still alive Emily solid an NPR News this is NPR\nSupport for NPR comes from progressive insurance committed to protecting cars and drivers weather on the open road or having a driveway moment while listening to NPR learn more progressive dot com or one eight hundred progressive and Americans for the arts and Americans for the arts dot org\n\n[noise] [noise]\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise] [noise]\n[noise]\nMm\n\nFace you know you ... live at age CPR dot org somebody come if you're out there you haven't joined jihad become one of our newest members\nWith a sixty dollar contribution you receive one of our new catalogs twenty Nineteen if you're sustaining our Yuri knowing that your membership it just takes an additional ... thirty dollars to receive\nThat wonderful calendar and with the holidays coming up what a wonderful gift to give everyone just stick them on a calendar and they can see all those beautiful photographs from across the high plains\nOkay and put things in perspective I was just thinking about this my partner has XM Radio in his pickup truck\nAnd we hardly ever listen to it we listen to a high plains ... public radio [laughter] still most most of the time H PBR is on the dial and that's what we listened to and even though he pays I think it's ten dollars a month for the satellite service\nWe still isn't dates VP are so you know if you're if you've got satellite radio in your car like we do and and you still listen to H. P. P. R. most of the time\nWhere you can take that ten dollars you can keep the satellite radio if you really want it but but what's another ten dollars to support what you you listen to the most we were thinking about that I\nSaid why don't you put another ten dollars each on you for your age PBR membership and you can\nGet rid of the satellite radio we'll see if that happens but that that that kind of puts it in perspective and and for for everybody high plains public radio is available for everyone and you don't have to pay ten dollars a month but your ten dollars a month makes a big difference\nHere at age ... because we are not we are a nonprofit organization and up\nIn the public in public radio is you know this is your public radio station so I'm asking you to support your public radio station this afternoon by calling one eight hundred six seven eight seven\nFour four four or go on line at H. P. P. R. dot org\nFrom savannah and sewer County Community college listen to some phone yeah\nWell I use it everyday in my classroom\nIt's always interesting when it's on and the kids come in and they'll take a double take but they never say anything they just walk on and then they all calmly do their assignments Mm\nAnd that was sent sprinkle out of ten of Kansas and she commented on how she enjoys playing classical music and her in her classroom\nAnd that it helps to calm the children down they're able to come they do their assignment and she's also bringing forth future high plain public with ... high plains public radio listeners who'll also grow up with an appreciation of classical music\nI Want to remind you that this afternoon we have a hundred and twenty five dollar go\nAnd they still a couple of lines it available so you can give us a call at one eight hundred six seven eight seven four four four adult to H. P. P. R. dot org\nWe do appreciate all of your support so far we are asking for those of you who are members that you have a new gym membership now it's a time just give us a call that one eight hundred six seven eight seven four four four or go to H. P. P. R. dot\n[noise] All right more music coming up we're guitarists several ... Romero performing Fernando sores variations on a theme of Mozart\nAll right more music coming up we're guitarists several ... Romero performing Fernando short variations on a team of Mozart\nMm\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\nWe had one of the other shows I forgot to mention Amarillo sympathy presents when I was to do the other classical programming\nUm we have a collaboration with this Anthony and we we play their performances from highlighting the prior season and during the summer here on H. P. P. R. and it's a wonderful program there that this Amarillo symphony ... is just sounding great I have to tell you [noise]\nAnd uh so Thursday during some phony or we're going to feature performances from the last season to twenty Seventeen Eighteen season of this Anthony well here um the Beethoven ... symphony Debbie sees ... those are just two of the highlights it will be featuring on Thursday\nDuring the program so you don't want to tune in for that right now we're going to hear the emerald symphony under the direction of ... virus performing ... Williams\nThe lark sending [noise]\n\n\n\n\n\n\nMm\nMm Mm\n\n\n\n\n\n\n\n\n\n\n\nOh\n\n\n[noise]\n\n[noise] [noise] [noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\nOf members listening to enjoy listening to classical music so let's keep it alive here at H. P. P. R. dot org or call one eight hundred six seven eight seven four four four\nOkay we're in the last minute one minute one color your call makes the difference one eight hundred [noise] excuse me six seven eight seven four four four or go on line at H. P. P. R. dot org\nWe're going to have a news breaks shortly from National Public radio and then we'll we'll be back with the last hour FSU phony\nThank you for all of those who have called in Oregon on line and pledged your support will be back after a short break\n\nAnd run the country prison discipline and come down harder on when you've written up for not closing your doors and get written up for jumping on the phone without permission and those low level infractions can have severe consequences like more time it was that because um this is\nWho is an NPR investigation this afternoon on all things considered from and your and your clock central on high plains public radio\n[noise]\nWho says Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere at H. P. P. R. dot org\nThe availability of age PBR Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nLive from NPR News in Washington I'm Lakshmi saying President Trump is getting a bird's eye view of the hurricane wreckage in Florida and Georgia one hundred fifty five mile per hour winds floods and tornados spawned by hurricane Michael days ago claimed at least Seventeen lines from Florida to Virginia\nNPR's Mara Liasson begins with one city where the president and first lady headed out bottles of water today\nAnd Lynn haven Florida President Trump surveyed the records left by hurricane Michael he said quote to see this personally is very very tough\nAlthough this is an official trip the president did meet with and praise Republican governor Rick Scott who was running for Senate in Florida this fall\nPresident Trump also plans to visit Georgia which was hard hit by the storm\nBefore he left Washington he did an interview with sixty minutes where he reiterated his doubts that climate change was exacerbated by human activity he said the climate was changing but then people may not be the cause as for the consensus of Ninety nine percent of scientists that global warming is caused by human activity\nThe president said quote scientists have a very big political agenda Mara Liasson NPR News the White House\nA joint Turkish Saudi team and searching the Saudi conflict in its tumbled two weeks after Saudi dissident journalists who's been living in the U.S was seen entering the building to get a marriage document his fiance says he never came out\nThe mystery surrounding ... is sending diplomatic shockwaves around the globe NPR's Jackie Northam says it inside Saudi Arabia the reactions different\nIn Saudi Arabia and you get in a completely different picture than you are really in the rest of the world that's very much that the world is against Saudi Arabia that basically real killer it's we're involved with that but you know as the rest of the world is looking at this is an international crisis and the disappearance and perhaps murder of democracy\nHas really touched a nerve worldwide\nIt's NPR's Jackie Northam the former security director of the Senate intelligence committees pleading guilty to lying to the FBI but James will maintains he did not share classified information with reporters\nDirector of the Senate intelligence committees pleading guilty to lying to the FBI the James will maintains he did not share classified information with reporters today the judge allowed will remain free until he ... just before Christmas he pleaded guilty to one count\nAfter another disappointing rented Brexit talks NPR's Frank Langfitt says British prime minister Theresa May is still holding out hope for a deal with the European Union\nThey wanted a deal in time for this week's use so many in Brussels ... Britain's held ... the two sides who couldn't agree on how to prevent the need for customs checks between Northern Ireland and the republic of Ireland\nI continue to flee the negotiated deal is the best outcome view of the European Union I continue to believe that ... to deal with achievable\nJeremy Corbyn the opposition Labour Party criticized me for inability to close a deal\nThere's really beginning to feel my grandpa died\nOf strange long run from traveled all our government\nIs run the gal UK schedule believe me at the end of march Frank Langfitt NPR News London this is NPR\nAnd he said he find teenagers see lots of images of smoking and vaping when they watch hip hop music videos NPR's Allison Aubrey reports researchers found that about half of popular music videos feature marijuana or tobacco use\nResearchers reviewed about eight hundred videos that had been on billboard magazine hot are in the hip hop songs list they found popular videos including hits by artist including Drake and beyond that had been you'd almost forty billion times over five year period the use of electronic cigarettes and the videos increased\nAnd did images of specific brand products at a time when a hip hop is very popular in the U.S especially with teens and young adults researchers say the widespread appearance of these products may increase tobacco and marijuana use and decrease the perception of harm\nThe study is published in the journal jama internal medicine Allison Aubrey NPR News\nA government report finds that low income people who live in states that have not expanded Medicaid or much less likely to get medical care than poor people in other states the government Accountability Office in partnership with the national Center for Health Statistics is that with a result of the survey\nConducted in twenty sixteen they surveyed low income adults ages Nineteen sixty four notable findings include nearly twenty percent of poor people in states that did not expand Medicaid\nSo they opted not to get medical care in the previous twelve months because they couldn't afford it in states with expanded Medicaid the figure was under nine and a half percent also a much higher number of people in non expansion states said\nThey could not afford to buy medication [noise] this is NPR any\nSupport for NPR comes from NPR's versions other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be\nFound and farmers dot com and the ... case he foundation\nSupport comes from chamber music Amarillo presenting the gym Laughlin quartet for the ... on six series friday October twenty six eight PM at the Fibonacci more information at C. M. A. M. A. dot org\n\n\n\n\n\n\nYour support matters so much to ask and every dollar camps so give us a call one eight hundred six seven eight seven four four four let us know what you would like to contribute to the high plains public radio to continue receiving such quality programming\nOur since ... classical music during the afternoon it's a wonderful way to keep not only your heart and you're so warm but just think of sitting in front of a rowing fire listening to this beautiful\nMusic how that would just inspired your afternoon one eight hundred six seven eight seven four four four H. T. T. R. dot org and I promise we're waiting to take your call\nOne eight hundred six seven eight seven four four four or online at H. P. P. R. dot org\n[noise] [noise]\nOh the calendar classical music is near and dear\nTo sit in the ... which is one of the main reasons to two planes public\nRadio you get to hear some that you haven't heard before on every once in a while he gets each year some that you like and you know that the other piece I'm really grateful for that part of what a dish and then you can catch in and\nGet to listen to really they do all of a civilized nation I'm Glad we have it\n\nI just love how she shares her enthusiasm of classical music I agree wholeheartedly you know it can inspire you\nThey can lift you up from the deepest darkest it can motivate you and warm years so so if you're enjoy listening to classical music during the weekdays here at high plains public radio\nWe're asking for your support to continue members' support at MIT's mission driven high plains public radio it's a matter of all of us just given a bed and then we'll make such a difference and we can continue breathing quality programming across the high plains\nThat H. P. P. R. dot org or call one eight hundred six seven eight seven four four four\nI think I've taken a year off of Dale bulletins life this afternoon ... he's ... he's producing our show this afternoon and thank you do for you\nI think I've taken a year off of Dale bulletins like this afternoon Rick ... he's ... he's producing art show this afternoon and thank you Dale for your your good work and your patients\nCalendars I'm going to talk to you about the calendars because they're really extraordinary it's the first time high plains public radio has offered our own calendar to listeners and and it's it's good [noise]\nUm I saw the layout for this it's a calendar of photographs from across the high plains\nAnd taken by photographers across the high plains and I think that pretty much says it all I saw the way out for the calendar I haven't seen the actual product yet but I saw the ... photographs featured for each month and they're really wonderful\nSo you can get that if you're a new member you can get that for as low as five dollars a month at sixty dollars a year you can do to sixty dollars in one month so I'm or you can spread it out five dollars in mind\nYou'll get the calendar and renewing members if you stay if you if you up your membership by five dollars a month you'll get the calendar as well we don't want to leave anybody out on that\nOne eight hundred six seven eight seven\nFour four four is the number to call don't miss out [noise] um we had music coming up [noise] by\nOur conjure low currently and we'll hear the concerto number seven in the major dishes performed by toppled music baroque orchestra under the direction of John among [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\nMm Mm\n\n\n\n\n\n\n\n\nNa\n\nYou've been listening to you from ... ...\n\nYou've been listening to your from Schubert overture and the major in the Italian style performed by the San Francisco symphony under the direction of Herbert blue instead\nLet's hear from you\nThis is your station and I was thinking Ruth ah we just heard the San Francisco symphony we heard we've heard from the New York philharmonic we've heard from musical organizations from around the globe all here on the high plains\nPlanes and that brings back it brings to mind the motto of a H. P. P. R. which is\nAt home on the high plains in touch with the world and and that's true ... as far as news goes and it's true with the music as well we bring you the great orchestras from around the globe\nRight here at home one eight hundred six seven eight seven four four four or H. P. P. R. dot org to make your pledged today Ruth\nWhen you take a moment to can treat too high plains public radio your insurance through your donation that we can continue bringing quality programming across the high plains so if you find value in that\nThen please encourage your neighbors and friends those you who you know our members encourage them to become members it's painless and yet it's so rewarding one eight hundred six seven eight seven four four four H. P. T. R. dot\nOrg and make a pledge today if you come in that's a new member with the sixth ... sixty dollars support\nA pledge you can receive a new calendar if you're a sustaining member or we knew in your membership it\nJust takes an additional thirty dollars and you too can receive the calendar for twenty Nineteen\nI think this this pledge drive is to gain knowledge grow community give now we're asking for everyone support throughout the high plains if we all just ... just a little\nUh a cup of coffee five dollars a month it quickly turned into sixty dollars and when we all stand together and contribute it go such a long long ways so few enjoying quality programming this afternoon of classical music as phonic\nPlease pick up the phone one eight hundred six seven eight seven four four four or go to H. P. P. R. dot org\nAnd that's where I Ruth and and\nWhen you plug your support to high plains public radio it's we're we're empathizing classical music this afternoon because we're doing the classical programming to um\nHowever there's a lot more here um I've always been impressed by the staggering volume of of and range music you'll hear\nOn H. P. P. R. everything from from the eclectic high plains more high plains morning blues with brother TiVo and western swing\nI'm jazz we have jazz time in the evening\nAnd uh and then the the um\nThe madness and in all embracing\nA spirit of open range\nAnd or in an educational\nValue bill McLaughlin I I I was I studied music and a and there's always something to learn though and bill McLaughlin has proven that I there there's just a wealth of information there and he presents that\nAh information in a way that it it's informative to everybody you don't have to know about music or\nHave been for ... and he presents that\nInformation in a way that it it didn't formative to every day you don't have to know about music or be a musician to listen to his programming miss a week if you're if you tune in he is\nTalking about the development of symphonic forming where the symphony comes from India it's really fascinating and I have friends who are not musicians are\nAnd who haven't studied music that they like music and they get something from that one eight hundred six seven eight seven four four four where each BP R. dot org to keep this kind of quality programming on the air\nMeeting we had music coming up we're going to hear a beep Boston symphony I perform one of the great favorites are caught deputies works a prelude to the afternoon of fine\n[noise]\n\n[noise]", "year": "2018", "show_name": "Sinfonia", "city": "Dalhart", "day": "15"}