{"month": "10", "state": "TX", "station": "KTDH", "content": "Executive producer is the Robinsons McLaughlin this is the ws empty radio network\n\nWithout music philosopher once said life would be a mistake\nListening to familiar music reminds us why it matters well discovering new works provides an endless source of delight exploring music is dedicated to the deeper appreciation and pure enjoyment of music it comes to the station because up support from listeners like you together\nWe keep the music playing thank you\nThis is the W. F. empty radio network\n\nMost Republican voters support Supreme Court nominee Brett Kavanaugh to spite sexual assault allegations against him that could make it difficult for red state Democrats up for reelection like West Virginia Senator Joe Manchin\nI'm hoping Mr Manchin will vote for Kavanaugh because we are conservative state even if we do put liberals in there\nThe view from West Virginia this afternoon on all things considered from NPR News for a clock central on high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da di di di ... point seven KGAN Hayes a service of high plains public radio\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nLive from NPR News in Washington and I'm ... nothing new here says the chairman of the Senate Judiciary committee after seeing a new FBI report on Supreme Court nominee Brett Kavanaugh the report was requested to investigate sexual assault allegation against Kavanaugh NPR's Brian Naylor has more\nSenator Chuck Grassley says in his words there isn't\nSalts allegation against Kavanaugh NPR's Brian Naylor has more\nRepublican Senator Chuck Grassley says in his words there is nothing in it that we didn't already know that neither the Judiciary Committee nor the FBI could locate any third parties who can attest to any of the allegations\nCapital has been accused of sexual misconduct by several women including Christine Blasey Ford who testified under oath last week that Kavanaugh assaulted her well both were in high school\nThe FBI was ordered to investigate that accusation and others the bureau interviewed nine individuals the White House source tells NPR the Senate could begin voting on the Kavanaugh nomination as soon as friday Brian Naylor NPR News Washington\nThe confidential that's beyond the cheerios are available to senators and secure room at the Capitol\nSenate Democrats continue to insist that the FBI review of new charges which too narrow his top Judiciary Committee Democrat Dianne Feinstein\nDemocrat agreed that the investigation still should be limited [noise]\nWe do not agree that the White House should tie the FBI's hands it's simply not credible to say that public testimony in last week's hearing is a substitute for interviews by FBI agents\nNot only to senators lack the expertise of FBI agents we were only given five minutes to question judge Kavanaugh\nSenate Democratic leader Chuck Schumer is on the opinion that something is in the new materials\nI disagree having received this a briefing on all of the documents I disagree with Senator Grassley statements that there was no hint of misconduct\nNine people question getting a supplementary inquiry World Trade organization summit in a couple of weeks will take place in North America but the U.S is not invited Dan ... explains\nWashington has been left off the guest list for the two day summit because the WTO is one of the organizations derided by president Donald Trump Canada's international trade diversification minister Jim cars has ministers from Thirteen like minded countries will attend and he says the hope is to ultimately persuade Washington of the continued value of the WTO\nBut the Trump Administration has gone beyond rhetoric in its disdain for the Trade Organization and\nEven blocked appointments of new judges to its dispute settlements body cars as modernizing the world body is the best way to reestablish of rules based system something that would be more difficult to ... have not preserve the dispute resolution mechanism in the new free trade agreement for NPR News I'm Dan carbon truck in Toronto\nTo gather down three Twenty one ditches NPR\nA navy veteran from Utah has confessed to sending four envelopes containing the substance from which the point that substance rice and is the bride thirty nine year old William Clyde Allen the third posted the envelopes to President Trump FBI Director re defense secretary Jim Mattis\nAnd the navy top officer admiral John Richardson authorities say the envelopes were intercepted and no one was hurt\nAnd Malaysia the wife of former prime minister now she brought jak has pleaded not guilty to a money laundering charges Michael Sullivan reports\nSixty six year old ... months or who something called the melt Amargosa Malaysia was charged with twelve pounds of receiving proceeds from unlawful activity and five counts of failing to declare those proceeds on our taxes her husband the jeep broke like has been charged with more than thirty pounds of money laundering abuse of power in criminal breach of trust\nHe too says he's not guilty and claims the charges are politically motivated the two have been barred from leaving the country after police raided several residents as belonging to the couple shortly after the jeep shock defeat\nThe two have been barred from leaving the country after police raided several residents as belonging to the couple shortly after ... shock defeat in may the general election\nPolice recovered hundreds of luxury handbags jewelry in cash value to more than two hundred and sixty million dollars for NPR News I'm Michael Sullivan in the non Vietnam\nFormer rapidly balloon to marry and should not yet been sentenced to twenty eight years and printed nearly four years after he killed him apple truck LA superior court judge Ronald Cohen handed down descended\nFrom running over in killing businessman cherry quarter I'll Try to Compton burgers dandy to San Francisco ... I'm ... at the army\nSupport for NPR comes from NPR stations or their contributors include workman publisher of a thousand books to read before you die a life changing list a readers compendium for inspiring hours of browsing the joy of discovery and the answer to the question what to read ...\nI'm an awful I'm Glad you're here these are some old Hungarian dances ... played by the press in debt when quintet\n\n\n\n\nWell no no I\nDon't\nKnow what I Do\nThink that\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise] ...\n...\n\n...\n...\n... ... ...\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\nOh\nOh\n\n\n\n\n\n\n\n\n\nThe cowboys in Nineteen Seventy two western kind of a very unusual western has a couple of plot twists and if that you don't expect that I'm not going to give anything away the big criticism received not sure what's Roger ... which critics\nAnd I can see the point when you see it is that the coming of age for the young boys who are the main cats and the cowboys along with the link to her and Brewster and and John Wayne or they're coming of age is is through violence and then in some said there was a certain amount of um of criticism about that\nBut the movie itself is very interesting in your path that part of it that was the Dallas when symphony and their new release of John Williams music they were led by Jerry junk and\n\n\n[noise]\nHe was a Mozart symphony number twenty eight states in the major the orchestrated the Eighteenth century the group led by France Britain\n\n[noise]\n\n\n\nOh\n[noise]\n\n\n\n... and the number twenty by Mozart's that was the orchestra the Eighteenth century led by France Reagan\n[noise]\n[noise]\nThis is polish music but from a Russian source Alexander glancing offer wrote the Missouri ... directed kind of covers\nTwo of the five national dances from Poland the ... is\nA need to spend an ... an intricate dance very energetic when it's the second apparently I'm most popular dance in Poland traditional dance after the whole sky map and their spines polish dances I kind of looked him up they are the holidays the Missouri ... the ... the ... and the back\nSo there you go here is a Missouri oh barracks putting together two of the dancers as I mentioned glad Saddam's wrote this is for violin and orchestrate you talked Perlman plays violin Lawrence Foster leads the Abbey Road ensemble\n\n[noise]\n\nI'm hoping Mr Manchin will vote for having all that we are concerned of state even if we do put liberals in\nThe view from West Virginia this afternoon on all things considered from NPR News ... central on high plains public radio\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three Katie da da da na ... point seven KGAN Hayes a service the high plains public radio\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or coal eight hundred six seven eight seven four four four\n\nNo way that's what the dancers said when they first heard the music Tchaikovsky wrote for a new ballet called the lake of this one no way or something like that [noise]\nComplained that it was too challenging to dance to end the musicians in the orchestra agreed as well cuts must be made and they demand\nThey complained that it was too challenging to dance to and the musicians in the orchestra agreed as well cuts must be made and they demanded in so cuts were me [noise]\nMaybe that's one reason why Tchaikovsky swan lake wasn't what you'd call hugely successful edits premier in Eighteen Seventy seven some critics even hated it the music one of them Roach has a poverty of idea\nOh how times change they closed for some highlights from one of the world's most popular ballets swan lake in Fifteen minutes\nLive from NPR News in Washington I'm Lewinsky of ... the debate over the nomination of judge Brett Kavanaugh to the U.S Supreme Court is a fever pitch in Washington Senators report to secure room to read the most recent FBI report prompted by allegations of sexual misconduct\nHundreds have gathered outside the U.S Capitol to send a message to lawmakers NPR's Windsor Johnston was there [noise]\nOut there can't have it all has got to go and have an all or not welcome\nHere the outrage they don't have it all has the temperament third on the highest court in Atlantic he's angry and it didn't fit to serve in a way that is can be a defeat for sexual assault survivors the court to come\nOut and met with smaller counter protests\nAre out here and they say they believe that having all of a court that you wouldn't make it the one woman that I saw that one in a liar he looks referring to for a while before the woman who was accused of having all sexual assault\nAnd parents Windsor Johnson at the U.S Capitol totally uncorroborated that's the White House read on a new FBI report regarding the sexual misconduct charted President Trump tweeted today have not had been subject to cold hard and unfair treatment\nDemocrats complained that Kavanaugh accuser Christine Blasey Ford should've been interviewed by the FBI over the past week she would not after her Senate testimony Trump press secretary Sarah Huckabee Sanders says at Fort it's had a full hearing\nAnybody that pushes back on the fact that Dr Ford wasn't given ample opportunity to make her cases they her case it's been living in a case\nOf first procedural vote on the cabin on nomination is scheduled for tomorrow in the Senate\nAnd the Netherlands authorities say they've disrupted a hacking effort against the world's chemical weapons watchdog as many Nicholson reports the attempted attack took place while the organization was investigating the substance use to poison former Russian spy Sergei Skripal\nDutch descendants minutes to an ... says Russia's cyber activities aimed at undermined ding western democracies must see his comments for the revelations about a group of Russian nationals who of course in possession of spying equipment to the hotel in the Hague\nThat case it next door to the organization for the prohibition of chemical weapons which collaborate closely with the un according to Dutch ministry intelligence the Russians have plans to travel on to an ... treat in Switzerland but at the same agency inspects chemical weapons some polls\nForeign ministry spokesperson ... denies the allegations for NPR News I'm ... and ...\nI ... down day on Wall street the Dow was off two hundred and thirty points than now decades down a hundred and forty eight this is NPR\nA new law changes how the federal government spends money on hurricanes wildfires and other disasters NPR's Rebecca Hersher reports the goal is to prevent damage and death\nDemocrats Republicans and economists all agreed that the most\nHere's NPR's Rebecca Hersher reports the goal is to prove that damage and ...\nDemocrats Republicans and economists all agreed that the most cost effective way to deal with natural disasters is to prepare for them before they happen\nBut for decades there's been no systematic way for the federal government to fund infrastructure upgrades things like making roads and electrical grid more resilient to flooding in fact until now communities weren't allowed to use federal disaster aid after a storm to upgrade infrastructure\nOnly to rebuild it as it was before the disaster\nThe new law changes that going forward a portion of federal disaster relief money after a storm will go toward making communities more resilient hoping to foot the bill for everything from making buildings more earthquake resistant to re engineering drainage systems Rebecca Hersher NPR News\nIn Paris the penalty is two thousand euros and six months in prison for a man who punched a young woman outside of Paris cafe the defendant has also been ordered to undergo drug and alcohol addiction treatment\nThat he loved to solve this past summer went viral it showed the offender throwing an ashtray and a woman he yelled at and walking back torture and punching her in the face the episode boosted effort to find people for sexual harassment on the streets of France lawmakers they're adopted allied POWs and I'm just not signed\nUp to seven hundred fifty euros for these types of assaults I'm Louis ... NPR News Washington\nSupport for NPR comes from NPR stations other contributors include the library of Congress\nWith the national library service for the blind and physically handicapped a program that offers thousands of books for all ages in audio embryo format more at one eight hundred three hundred six thousand\n\nThat thing about being a musician just living with the music all the time what British pianist Paul Lewis said earlier this year you'll hear Paul Lewis playing a ballad by Brahms later in the hour\nThanks for listening I'm Alina see and this is by Antonio Vivaldi each violin concerto number ten\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\n\n\nMhm\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nUp for reelection like West Virginia Senator Joe Manchin\nI'm hoping Mr mansion will vote for Kavanaugh because we are concerned of state even if we do put liberal in their\nView from West Virginia this afternoon on all things considered from NPR News ... central on high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three ... heart Ninety One point seven KGAN Hayes a service of high plains public radio\nThe availability of equal on high plains public radio\n[noise]\nThis is Ninety One point five ... eighty nine point three ... Ninety One point seven KGAN Hayes a service of high plains public radio\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n[noise]\nTranslation of stories is sharing and wrote a very popular satire called the school for scandal and it was in the spirit of that\nStory that Daniel barber wrote this piece you'll hear it in twenty minutes [noise]\n\nLife from NPR News in Washington I'm Louise ... outside both Congress and the U.S Supreme Court directly across from the Capitol Grounds fury\n[noise] over\nThe nomination of judge Brett Kavanaugh to the nation's highest court\n\nInside the Capitol Senate Judiciary committee Democrats are criticizing the FBI investigation into sexual misconduct allegations against Kavanaugh NPR's Kelsey Snell reports that senators are reviewing the confidential report and it's a cure facility in the capital\nDianne Feinstein the top Democrat on the Senate Judiciary committee says the FBI I did not interview many witnesses who came forward she also says they did not speak to Christine Blasey Ford the woman who originally accused Kevin ... of sexual assault\nIt looks to be a product of an incomplete investigation that was limited or perhaps by the White House I don't know\nRepublicans say the report does not support any of the allegations against Kavanaugh a procedural vote on the nomination is set for some time on friday and a final confirmation vote could happen as early as Saturday Kelsey Snell NPR News the Capitol\nThe Senate's top Republicans say there's nothing new or unusual and the latest FBI background check Senator Orrin hatch told reporters\nBut after an investigation for both the committee and the FBI we're from nothing absolutely nothing to cooperate accusations against him a\nPotential swing vote on the Republican side Senator Jeff flake today said the latest FBI report does not support allegations against Kavanaugh\nRussian officials are dismissing new accusations that Russian military intelligence was behind cyber attacks against international organizations like the world anti Doping Agency would get details from NPR's Lucian Kim hours before the Justice Department indicted seven Russian military intelligence officers on hacking\n... Russian officials are dismissing\nSince that Russian military intelligence was behind cyber attacks against international organizations like the world anti Doping Agency would get details from NPR's Lucian Kim\nHours before the Justice Department indicted seven Russian military intelligence officers on hacking charges Britain and the Netherlands accused Russian Spies of cyber attacks on international organizations in companies\nThe Russian foreign ministry called the charges western spy mania although Dutch authorities provided detailed information on how for Russian military intelligence officers allegedly tried to hack into the organization for the prohibition of chemical weapons\nRussian state TV said there was zero evidence of accusations are top news in Russia the Kremlin's message is that the country's myriad enemies are once again blaming Russia for crimes\nThat was due to the spread of toxic algae donates red tide NPR's Greg Allen has more\nIn high enough concentrations red tide algae emitted toxin that can affect fish dolphins manatees sea turtles and humans beach communities on Florida's Gulf Coast have struggled with red tide now since last fall moving tons of dead fish from beaches dozens of dolphins and more than a hundred manatees have also died\nNow state and county officials say red tide is migrated from the Gulf to the Atlantic carried by coastal currents in the Gulf Stream\nFish kills have been reported in St Lucie in Palm Beach county because it causes respiratory irritation most beaches in Palm Beach county had been closed red tide is now also been detected in Miami Dade County officials have closed beaches on the northern end Miami Beach\nGreg Allen NPR News Miami\nFor Americans at a certain age the image of indelibly etched in national memory the young bus boy from the Ambassador Hotel\nIn LA who rushed to the side of Bobby kennedy after he was shot holding his head off the floor wandering there was a teenager when he became part of history today it's reported that Romero died gets week after a heart attack he would sixty eight\nI'm Louise given a NPR in\nWashington support for NPR comics from indeed used by over three million businesses for hiring or employers can post jobs and youth screener question to build their short lived a preferred candidates learn more and indeed dot com slash higher\nAnd the corporation for public broadcasting\n\nWe've character names light ladies near well and sir Benjamin back night you can probably imagine what the main plot might center around those are characters in the play that inspired Samuel Barber to compose an overture something you're hearing about ten minutes\nThanks for the company this afternoon I'm ... and it's music by Johann Sebastian Bach next I tell her plays the ... with the Academy of St Martin in the fields here's a concerto by chance by in a major [noise]\n[noise] it's lovely a deep rich mellow sounds lower than oh well it's the ... and that's a concerto in a major featuring that instrument hobbies music my Johann Sebastian Bach\nI told her play the ... with the Academy of St Martin in the field I own a brown conducted\nMusic filled with light\n... will be very tough my ex ... you'll hear that in about ten minutes first it's the work of a young Samuel Barber he was about Twenty one when he wrote a play about some rather scandalous behavior and that's really inspired barber to write this overture\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n[laughter]\nMm\n\nSeventeen Seventy seven that's when Richard shared in published a new play called the school for scandal an aristocratic farce with characters whose names really describe their personality lady near well for example sir backbite\nMm\nMm\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nSo you're a need for clear unit horn challenges\n[noise] [noise] [noise] ...\nSerenade for clarinet but soon horn challenge double bass ... in nano Michael Nielsen chamber music Palm Beach for point\n\n\n[noise] [noise]\n[noise]\n\n\n\nHe's the Atlanta symphony orchestra conductor young Lenny ... sweet nice mainly\n\n\n\n\n[noise] [noise]\n\n\n\n", "show_name": "Sinfonia", "year": "2018", "city": "Dalhart", "day": "04"}