{"month": "10", "state": "TX", "station": "KTDH", "content": "Additional funding is provided by Mr Mrs Williams ... brown Brenda at Earl Shapiro and the members of the W F empty fine arts circle the executive producer is Steve Robinson I'm do McLaughlin thanks for listening\nWhatever your skill and playing an instrument from student to adult learner exploring music can support your pursuit with more than twelve hundred hours of programming exploring music dot W. F. N. T. dot com gives you access to composers and performers through recordings and illuminating demonstrations of musical techniques than theory\nThat's exploring music dot W. F. N. D. dot com from the W. F. empty radio network\n\nVoting rights advocates warn states are using new tactics to keep minorities from voting at the polls\nIt is almost a better way\nTo the answer played IT law that discriminated against racial minorities [noise] and I want them to be able to\nI'm Audie Cornish concerns over voter suppression in return this afternoon on all things considered from NPR News for clocks central on high plains public radio [noise]\n\n[noise] this is Ninety One point five Katie ... eighty nine point three Katie da da Silva serve high plains public radio available everywhere at H. P. P. R. dot org you're\nListening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find an occasion to thank them for their support\nFrom NPR News in Washington on Lakshmi saying the Mexican government appears to be looking at the caravan of an estimated seven thousand Central American migrants in humanitarian terms in southern Mexico\nThe Mexican government appears to be looking at the caravan of an estimated seven thousand Central American migrants in humanitarian terms\nIn southern Mexico food water and medical checkups are being provided to new arrivals\nIn recent days the sheer number of migrants most of them from on Dora overwhelmed checkpoints and Guatemala headed to the Mexican border many of the migrants are young men able to make the arduous journey but they're also many families children parents grandparents\nWho say they have to get away from deadly violence and poverty in their home countries\nPresident Donald Trump it's pledging to keep them out of the United states he hits threatened to seal off the border and he's threatening to reduce or end us assistance to Honduras Guatemala and El Salvador if those governments fail to stop the exodus from their countries\nCIA director Gina Haspel is in Turkey as part of the investigation into the death of us based journalist ... J NPR's Greg Myre is as the visit comes amid widely conflicting accounts in the case\nFor vice president Mike Pence confirms that CIA chief Gina Haspel is in Turkey reviewing the evidence surrounding the death of Joe ... show ... earlier this month that Saudi Arabia's consulate\nPin says the Trump Administration will demand that those responsible are held accountable his remarks come hours after Turkey's president rage uptight ... air to one described the killing is a brutal premeditated murder\nThis account is in stark contrast to the official Saudi version the journalist died in a fist fight\nThe U.S turkey and Saudi Arabia all say they're investigating Greg Myre NPR News Washington\n[noise] the first woman ever to serve on the U.S Supreme Court Sandra Day O'Connor is withdrawing from public life Claire Caulfield of member station kj is easy in Phoenix, Arizona reports of Conor confirms her health is declining in a letter oh\nHunter announced she has to beginning stages of dementia and possibly Alzheimer disease\nEighty eight year old O'Connor said short term memory problems and hit issues mean she's staying close to her home in Phoenix\nO'Connor was nominated by president Ronald Reagan in Nineteen eighty one and it was also the first woman to lead the Arizona State Senate chief justice John Roberts says he's saddened by the news but no illness can take away the inspiration she provides\nFor NPR News I'm Claire Coffee held in Phoenix\nNo criminal charges filed against Indiana attorney general Curtis Hill Hilda nice allegations that he got drunk at a party earlier this year and groped for female colleagues including a state lawmaker\nBut the women say he'll also made lewd comments during the gathering will special prosecutor Daniel secular says that after interviewing dozens of people he didn't feel there was enough evidence of sexual battery ... says he did believe the for women who accused he'll if misconduct were credible\n[noise] you're listening to NPR any\nLaw enforcement and volunteers are expanding their ground search in western Wisconsin for a Thirteen year old girl\nWhose parents were found fatally shot in their home last week Marin County share Chris Fitzgerald is quoted saying he's hoping some two thousand people will show up to help find Jamie clause authorities believe the teenager was abducted and believe she is in grave danger [noise]\nTwitter is cracking down again on accounts linked to conspiracy theorist Alex Jones NPR jobs that are reports of social media company says it has removed more than a dozen accounts\nTwitter has confirmed several media outlets that it has permanently suspended Eighteen accounts affiliated with Jones and his infowars Web sites CNN first reported the move saying Twitter remove the accounts because they attempted to help Jones get around a banned Twitter imposed in September\nWhen the company shut down ... main account and out of him for wars\nBecause he attempted to help Jones get around a banned Twitter imposed in September when the company shutdown jumped his main account ... saying they violated Twitter's abusive behavior policy Twitter then more that they would evaluate reports regarding other accounts that may be associated with jumped\nOver the summer Twitter drew criticism to temporarily suspended some Joneses privileges after other tech companies ban Jones and his main channels set of concerned about its content ... NPR News\nBMW reportedly expanding its recall the capital one point six million vehicles around the world it may be at risk of fluidly could lead to fires maker says discovered the cooling could leave for his equals ... circulation unit\nThat could lead to spark as long as the ... the operate the recall ... certain diesel vehicles between two thousand ten thousand Seventeen this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first\nLearn more at Raymond James dot com\nAnd when we're glad you hear a missile late October cheese steak this is a leash shut down the Russia has played Mozart's piano Saddam number eight in a minor\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [laughter] [noise]\n[noise]\n[noise]\n\n[laughter]\n\n\n[noise] [noise]\n[laughter]\nI mean\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[laughter]\n[noise]\n[noise] [laughter]\n[noise]\n[laughter]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\nMm Mm\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nMm\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise] [laughter]\nThe piano sonata number eight in a minor by Mozart played by Alicia ... decks the ballet that really changed the face of dance in Russia but it wasn't an instant hit people didn't dislike it they just didn't kind of catch on and tell a bit later for the sleeping beauty\n[noise]\n\n[noise] when the sleeping beauty had its premiere at the mirror Marion ski theater an Eighteen Ninety um people liked it they like it in Russia had had a couple of Russian a performance as a matter of fact it was staged\nI think probably about ... almost two hundred times in the first decade of its existence by Tchaikovsky never got to see it at least not initially didn't get to see it'd be very popular outside of Russia which is what he really wanted there was a production\nOutlook scholar in the line about six years after the Russian opening but ... didn't around a whole lot of bad of accolades it wasn't until Nineteen Twenty one when it was staged in London that people started really falling in love with the sleeping beauty here's music from the ballet ... music played by the Boston symphony led by ...\n\n[noise]\n\n\n[noise]\n\n\n\n\nMm\nMm\n[noise]\n[noise]\n\n\n\n\n", "year": "2018", "show_name": "Sinfonia", "city": "Dalhart", "day": "23"}