{"month": "10", "state": "TX", "station": "KTDH", "content": "Droplets aligned let us know how do you like the show you can write to us at exploring music\nAt W. F. empty dot com\nI'm McLachlan\nExploring music is produced by Noel Morris I W s empty in Chicago an engineer by bill Sigmund at the Radio Foundation in New York City major funding is provided by the national endowment for the arts with additional funding from Mr and Mrs William gee brown Brenda an Earl Shapiro and the members of the W F empty fine arts circle\nThe executive producer is Steve Robinson McLaughlin\nThanks for joining us\nThis is the W. F. empty radio network\n\nPerhaps you're going to a concert but don't scenario with the music on the program or would like to know more exploring music dot W. S. T. dot com it's a companion to this program and a quick reference for all things classical\nWith over twelve hundred hours of programming it's a one stop resource for newcomers to longtime music lovers exploring music dot W. F. N. T. dot com from the ws empty radio network\n\nChina has become the biggest lender to government in Africa Chinese loans have bumped up she booties debt to GDP ratio from fifty to eighty five percent so we're talking about a lot of money over to China\nI'm Ari Shapiro critics say many African countries are now at risk of a credit crisis that story this afternoon on all things considered from NPR News [noise] four o'clock central on high plains public radio\n[noise]\nThis is Ninety One point five Katie ... eighty nine point three Katie da da Silva supply planes public radio available everywhere on line at H. P. P. R. dot org if you appreciate having public radio\nSay many African countries are now at risk of a credit crisis that story this afternoon on all things considered from NPR News [noise] four o'clock central on high plains public radio\n[noise]\nWho's who's Ninety One point five ... eighty nine point three ... heart of service of high plains public radio available everywhere on line at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream then please thank him patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\nLive from NPR News in Washington I'm Windsor Johnston President Trump will crisscross the country this week in an effort to build support for Republicans a head of November midterms NPR Shannon van sand reports tropical whole campaign rallies in four states\nTrump will traveled to Iowa at Pennsylvania Ohio and Kentucky he's expected to help the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump's celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nAnd doing our students\nAnd you don't you join left wing mob and that's what [noise]\nOff four hundred and thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nA un report is calling on countries around the world to do more to combat global warming as Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and a lot of the she's\nThe only ... says even keeping the earth's temperature rise to the Jew degrees centigrade targeted greed of the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe IPC she says only by dropping to one point five degrees and the worst effects of climate change be avoided\nIts report says manmade CEO to emissions me to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now\nOne IPC sea board member warns there is only the slimmest chance of avoiding unsinkable damage to the climate system that supports life as we know it\nFor NPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal other Christian Woman who's been sentenced to death for blasphemy and the arts and the hippie reports it's emerged as one of the most important cases in years to reach the Supreme Court there\nThe court reserved it's judgment on the appeal and didn't say when it would be announced over the years the case against up your baby has led to the assassination of two senior officials one of them was noted by his buddy God who is now revered as a near St by the religious right\nThe case also released a powerful extremist movement and their leaders wound of terrible consequences if ... was granted leniency NPR ...\nReporting from his Lama bought the death toll from a powerful earthquake and tsunami that struck central Indonesia and nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on silhouettes the island searching for survivors thousands of people are unaccounted for\nDr trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three the S. and P. down nine this is NPR\nHurricane Michael is pounding Cuba with heavy rain and high winds ad that makes its way towards ...\nPR dandy reporting from Islamabad the death toll from a powerful earthquake and tsunami that struck central Indonesia and nearly two weeks ago is nearing two thousand search and rescue crews continue to come through mud and debris on ... island searching for survivors thousands of people are unaccounted for\nDr trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three B. S. and P. down nine this is NPR\nHurricane Michael is pounding Cuba was heavy rain and high winds and that makes its way toward the Florida Panhandle ... at the national Hurricane Center says the storm is predicted to gain strength and the next few days\nWe do expect that it's going to the Gulf of Mexico was closer to the for the for the forecasters\nSay Michael could come ashore along Florida's Gulf Coast as a category three storm the unemployment rate is at its lowest level in nearly sixty years which means American retailers might have to try a little harder to fill their seasonal hiring lots of the year NPR's Camila Domonoske reports\nThe beginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush sixty five thousand workers for FedEx eighty thousand Macy's target is looking for a hundred and twenty thousand but unemployment is low and American workers have more options and they used to\nConsulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks\nAmazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card\n... NPR News I'm Sorry\nCan canoeing to trade lower on Wall street the Dow Jones industrial average is down thirty nine points at twenty six thousand four o\nSeven and a composite down eighty five points the U.S in the five hundred down eight this is NPR News in Washington\nSupport for NPR comes from NPR's patients or their contributors include progressive insurance offering its home quote explore some shoppers can evaluate options in one place when buying home insurance costs in quotes in rates are available online learn more at progressive dot com\n\nYou need to be hard Wagner from Dutch Reingold is a section called the ... of the gods into ... and it's played by the London philharmonic hundreds or Adrian bolt\n[noise]\n\n[noise]\n\nMm\n\n... Horowitz used to play down it's an encore quite often that was music by Mr ... called ... park fire works it's time to ... ... ...\n[noise]\n[noise]\n\n\n\n\n\n[noise] composer older they're good it was born about sixty five miles south of wrong in the town that was famous for producing beer when he was twenty two he followed the path of many ... musicians today and he went to the end\nHe went to Italy after that for a few years in Paris and London kind of the world would travel back in the end he landed in Vienna\nWhich makes perfect sense when you listen to his music ears that ... the one with us\n\nComposer older Baird girl that was born about sixty five miles south of wrong in the town was famous for producing beer when he was twenty two you follow the path of many ... musicians of the day and he went to Vienna\nHe went to Italy after that for a few years in Paris and London kind of the world would travel but in the end he landed in Vienna\nWhich makes perfect sense when you listen to his music ears that simply no one with the London ... players conducted by the tea or\n\n[noise] [noise]\n\n\n\n\n[noise]\nNa na na na\nNa na\n\n\n... door that lived to be eighty seven years old he died in Eighteen fifty in his lifetime but shoulders with lots of composers and musician early on he was in Vienna and he met ... who became both friend and supporter of his music\nHe left behind some thirty opera eleven that there's lots of chamber music in over forty simply today you heard the symphony number one a jerk that's with the tea is ... and his London Mozart players\n\nHe was in Vienna and he met ... who became both friend and supporter of the music\nHe left behind some thirty opera a weapon that there's lots of chamber music in over forty symphony today you heard the symphony number one a jerk that's with the tea is ... and his London Mozart players\n\n[noise]\n[noise]\n\n\n\n[noise]\n\nHere's a concert overture that they told me about when he was asked to participate in the dedication of the renovated theater in the city of Vienna so cold the Consecration at the house so bitter played here by Nicholas Esther ... six six I'm yeah\n\n\n\nA ...\n[noise]\n\n\n\nBeing Nicholas extra ... and an overture by Beethoven was Consecration of the house I'm militia house like\nChina has become the biggest lender to government in Africa Chinese loan bumped up ... booty debt to GDP ratio from fifty to eighty five percent so we're talking about a lot of money or to try and\nI'm Ari Shapiro critics said many African countries are now at risk of a credit crisis that story this afternoon on all things considered from NPR News [noise] four o'clock central on high plains public radio\n[noise]\nThis is Ninety One point five eighty ... eighty nine point three Katie de ... service the high plains public radio available everywhere on line at H. P. P. R. dot org\nYou were listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find indication to thank them for their support\n[noise]\nEighty nine point three Katie da da da Silva supply planes public radio available everywhere on line at H. P. P. R. dot org\nYou're listening to high plains public radio on line right now is made possible in part by the financial support of the community sponsors you hear mentioned on the air please find an occasion to thank them for their support\n[noise]\n\n\n\nJust type it's romantic reputation parents is like the majority of the world and that winters there can get pretty darn gloomy gray and cold and pressing [noise]\nSo ... that sounds took every opportunity to flee parents during the winter months heading to warmer climate [noise]\nSpain Algeria the Canary Islands are among the favorites was Egypt [noise]\nIn fact this piano concerto reflects a little of that hot encryption\nPostcard from the ... in the form of the concerto number five by hand phone had this hour live\nFrom NPR News in Washington I'm Windsor Johnston President Trump is keeping a top Justice Department official on the job for now NPR's Scott Horsley reports deputy attorney general Rod Rosenstein traveled with Trump to Florida earlier today\nRosenstein state has been a question mark for several weeks since the New York times published a story saying among other things that the deputy attorney general had discussed secretly tape recording the president last year\nRosenstein has denied that report Trump spent about thirty minutes talking with the deputy attorney general aboard air force one as the two men made their way to a police convention in Florida a\nBroad I didn't know ride before but I've gotten to know but I get along\nRosenstein his job is politically sensitive because he oversees special counsel Robert Mueller's investigation of Russian interference in the twenty sixteen election Scott Horsley NPR News Washington\nHurricane Michael is intensifying in the Atlantic ad that takes aim at Florida's Gulf Coast speaking to a law enforcement group and our land do President Trump today are trends in in the heat caution\nAs hurricane Michael news landfall we're working with state and local officials in Florida to take all necessary precautions and we urge all residents to be prepared\nThe national Hurricane Center expects Michael to hit the panhandle or Big Bend by mid week forecasters say it's likely to come ashore as a category three hurricane new law aimed at the prevention of sexual harassment on the job go into effect tomorrow in New York NPR's Yuki Noguchi reports\nThe new laws take effect almost exactly a year from the start of the me too movement public allegations of sexual harassment and the resulting Alister of many leaders in industry and government have transformed the workplace culture\nThe new laws require every employer to conduct interactive prevention training of all its workers every year it also requires employers to publish and provide their policy to employees\nAnd inform them about how to file complaints experts say while many larger employers already had sexual harassment policies in place many smaller ones are unaware that this new law also applies to them you can ... NPR News Washington\nNational Transportation Safety Board is working to determine the cause of the dead\nTransformed a workplace culture the new laws require every employer to conduct interactive prevention training of all its workers every year it also requires employers to publish and provide their policy to employees\nAnd inform them about how to file complaints experts say while many larger employers already had sexual harassment policies in place many smaller ones are unaware that this new law also applies to them you can ... NPR News Washington\nThe national Transportation Safety board is working to determine the cause of the deadly limousine crash in upstate New York\nWhen is it said the limo rent a stop sign in So Harry outside of Albany on Saturday and slammed into a parked SUV twenty people were killed Eighteen in a limo and to pedestrians federal authorities say the accident is the deadliest us transport crash in nearly a decade\nStocks are trading mixed on Wall street at this hour the Dow was up forty points than not that down forty the S. and P. five hundred up a fraction\nYou're listening to NPR News in Washington\nThis year's Nobel Prize in economics is being shared by two American researchers one at Yale University and the other at New York university\nWant us to William ... friends whereas in climate change in the long run macroeconomic analysis of the author has deported him rumor for integrating technological innovations in a long long macroeconomic analysis\nThat the ... with the royal Swedish Academy of Sciences making the announcement today in Stockholm\nVenom is the new number one movie on the domestic box office charts ... feature took in an estimated eighty million dollars over the weekend NPR Trina Williams has more on the top five releases\nThem big opening of the record for an October new release the characters associated with marvel comic book universe Sony Pictures brings the former Spiderman them assist to the big one [noise]\nHold for ... per\nJazz jazz Tom Hardy Michelle Williams and ... a med star and it's a mix of science fiction fried action and a bit of wit a star is born remake with Bradley Cooper and Lady Gaga out paces expectation for strong debuting number too small for drops to third wall last weekend's winter nights ... falls to fourth\nThe house with a clock and it's long also did finishing fifth Trina Williams NPR News\nI'm with her Johnston and you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations other contributors include the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information is available at science rooms foundation dot org\nViolinist un Jang of the Shanghai Quartet says\nQuote I grew up with many of the traditional Chinese folk songs and the popular music on this album the album we're going to sample from next I played some of these pieces on the violin during the difficult days of the Chinese cultural revolution\nI asked myself why not arrange them for the string quartet which is the form I Love the most that way I can play beautiful Chinese music again and bring it to a wider audience is with my group the Shanghai Quartet here is un chunks arrangement of a ... written by ... Jew\nWith many of the traditional Chinese folk songs and the popular music on this album yeah we're going to temple from next I played some of these pieces on the violin during the difficulties with the Chinese cultural revolution\nI asked myself why not arrange them for the string quartet which is to form I Love the most that way I can play beautiful Chinese music again and bring it to a wider audience is with my group the Shanghai Quartet\nHere is un junk arrangement of like a piece written by ... Jew [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[laughter]\n\n\n\n\n\n... piano concerto that can turn on a ... fine fine commute since huh even half was just all the way with the economy around them leaving the city of Birmingham symphony orchestra\nMhm\n\nJust deliver something for the night time is shared by most sorry little night music\n\nI'm like music from the tech is I Know cleaning up this week with Neville Mariner and the Academy of St Martin in the dollar Rick he learned to lead to get that from time to me today thinks listening\nChina has become the biggest lender governments in Africa Chinese woman bumped up she booty debt to GDP ratio from fifty to eighty five percent so we're talking about a lot of money to try and\nI'm Ari Shapiro critics say many African countries are now at risk of a credit crisis that story this afternoon at all\nA little night music from ... is an exciting enough music with Neville Mariner and the Academy of St Martin in the field and Valerie came learns to lead you could spend some time with me today Thanks for listening\nChina has become the biggest lender to government in Africa Chinese loans have bumped up booties debt to GDP ratio from fifty eighty five percent we're talking about a lot of money or to try and\nI'm Ari Shapiro critics say many African countries are now at risk of a credit crisis that story this afternoon on all things considered from NPR News [noise] four o'clock central on high plains public radio\n[noise]\nWho's who's Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere on line at H. P. P. R. dot org\nThe cost of operating H. P. P. ours Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support and thanked him as well\n\nOn the way this hour rebel in the hands of the Tesla string quartet when asked why they chose that particular name well they responded [noise]\nThey found a quote by a nickel a Tesla he describes his feelings about the world and he said we're all connected like stars in for a moment with forces unseen [noise]\nEven though we can't feel those horses we can't see those horses\n\nWe we can see the connections we feel them we can't see them and we can feel them and of course that says that's something they feel is a very good description of music and we'll hear what that means that had this hour\nLive from NPR News in Washington I'm Windsor Johnston President Trump is dismissing democratic calls to impeach Supreme Court justice Brett Kavanaugh speaking to reporters before heading to Florida Today Trump called the sexual misconduct allegations against cabin all at democratic hoax\nWhen you mention a justice of the United states the British lord forwards adopts dollars off topic but I don't do nothing wrong with\nYou know of any size Trump\nPlans to host Kevin all at the White House that the evening for a ceremonial swearing in tomorrow the president will travel to Iowa for a campaign rally NPR ... reports Trump will crisscross the country this week in an effort to build support for Republicans ahead of November midterms\nTrump will travel to Iowa at Pennsylvania Ohio and Kentucky he's expected to tell the economy and urge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nMatch during our students\nAnd you don't you join and left wing mob and [noise]\nAll four hundred and thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nHurricane Michael is pounding Cuba with heavy rain and high winds ...\nKansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nDuring our students\nAre doing a left wing mob [noise]\nOff four hundred thirty five members of the house are up for reelection and one third of the Senate is one hundred seats will also be on the line Democrats need to win twenty three seats to gain control of the house ... NPR News Washington\nHurricane Michael is pounding Cuba with heavy rain and high winds says it makes its way toward the Florida Panhandle ... at the national Hurricane Center says the storm is predicted to gain strength\nMichael is going to quickly strengthening move northward through the Gulf of Mexico because of that it could be a major hurricane strength when it approaches\nForecasters say Michael could come ashore along Florida's Gulf Coast as a category ... storm by mid week the death toll from a powerful earthquake and tsunami that struck central Indonesia almost two weeks ago is nearing two sounds and NPR's Lauren Frayer reports from Palo near the epicenter\nOfficials say up to five thousand people may still be buried under rubble earthquake triggered mudslides that wiped out three big neighborhoods\nAnd those bodies may never be found the government says it plans to call off all searching by Thursday and its considering declaring those three neighborhood as national memorials which may never be inhabited again\nThat strong some criticism from survivors who want to locate the remains of their loved ones across the policy people are still sleeping in tents even if their homes are intact for fear of aftershocks electricity is coming back on and military planes are landing at the damaged airport delivering aid\nLauren Frayer NPR News new Indonesia on Wall street the Dow was thirty nine points this is NPR News\nFuneral procession for Spanish opera singer monster ... took place in Barcelona today who the ... report\nThe day's rainy weather seemed to reflect the mood as people from all over ... farewell to one of the most famous opera singers in the world among those in attendance where the singers family and Spain's prime minister ... says\nIt will be buried alongside her parents in Barcelona cemetery the funeral center was open to the public all day Sunday for those who wanted to pay their last respects\nBecause he had passed away this Saturday at age eighty five after starring and around Ninety opera roles she was born into a working class family in Barcelona and began showing her musical talents as early as age seven for NPR News I'm Lucy ... in Barcelona federal\nInvestigators are working to determine the cause of the deadly limousine crash in upstate New York twenty people were killed on Saturday when the limo plowed through a parking lot in the town of go Harry near Albany National Transportation Safety Board chairman Robert Sumwalt spoke to ABC News\nWe want to look at the company itself or the limousine off where ... where we want to look at the draw of or we will look at the roadway configurations see if there's any particular problems that my repressive\nThe limo was traveling to a birthday party at the time of the crash a vigil will be held tonight to remember the victims at last check on Wall street ... thirty nine points\nThan not die down fifty two B. S. and P. down a point this is NPR News from Washington\nSupport for NPR comes from be alarmed for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for\nAny particular problem was that my repressive\nThe limo was traveling to a birthday party at the time that the crash a vigil will be held tonight to remember the victims [noise] at last check on Wall street the Dallas up thirty nine points the NASDAQ down fifty two B. S. and P. down a point this is NPR News from Washington\nSupport for NPR comes from the alliance for lifetime income a nonprofit composed the financial services organizations working to educate Americans about options for securing protected lifetime income in retirement Morehead alliance for a lifetime income dot org\n\nI'm On the way it is our new recording of the rebels string quartet with the cats we got some dance music seeing bon ... to from Alexander ... and right now\n[noise] um let's stop the kind of dance is well maybe it is kind of it's not because I don't know\nIt's a Russian a it's a Russian dance from swan lake it's me by Tchaikovsky Joshua Bell not stop the at all giving us the elegant treatment with the Berlin Philharmonic Michael tell from Thomas conduct [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nMm [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise] [laughter]\n\n[noise] [noise]\n\n\n[noise]\n[laughter]\n[noise]\n[laughter] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nMm\nMm\n\n\n\n\n\nMm\nMm Mm Mm Mm\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nI'm a reach Middle East from what\n\n\n\n\nPeople can meet your project full time job I mean you know how that would be in your boarding gate to my mom distinguished career\nAnd he worked at a pizza for years here's one he's labor we can do you work at a dancer\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n...\n... [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]", "show_name": "Sinfonia", "year": "2018", "city": "Dalhart", "day": "08"}