{"month": "10", "state": "TX", "station": "KTDH", "content": "Over could join this for the last show of the week and I hope you give yourself a little more time to listen to the radio right now so enjoy yourself and I'll see you tomorrow\n\n... music is produced by city killer to W. with them tea in Chicago and produced an engineer by bill Sigmund that that'd be a cue acts are in New York City [noise] we get production help from ... Marcos and digital islands studios\nMajor support is provided by the URL and British Shapiro foundation hello so Mr and Mrs Williams you brown an anonymous gift and they lose their supporters of W F empty\nExploring music was created by Steve Robin and I'm ... and thanks for listening this is the W. with empty radio network\nA\nHair on the high plains we love our live music and that's why H. P. P. our living room concert series brings you inspirational song writers from across the world which I was in Amarillo Garden City and towns across the high plains joined the mailing list and learn more about living here in concert that H. P. P. R. dot org\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva says high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any troubles to H. P. P. R. to volunteer just email us at H. P. P. R. at H. P. P. R. dot org\nLive from NPR News in Washington on Lakshmi sang the markets experiencing and now they're sharp drop with the Dow down four hundred fourteen pointed twenty five thousand two hundred Ninety two all major market indices are down one point six percent a to point two percent following news\nThat treasury secretary Steven Mnuchin will not be attending an upcoming investment conference\nThese are down one point six percent a to point two percent following news that treasury secretary Steven Mnuchin will not be attending an upcoming investment conference in Saudi Arabia after all\nThe kingdom's royal family under global suspicion for the disappearance of a Washington Post columnist NPR's Scott Horsley reports the Trump administration's dealing with the fallout from the disappearance and suspected murder of dissidents ... journalist ...\nWhen there's an announces his isn't a boycott the conference after a White House meeting with President Trump and the secretary of state secretary Mike Pompeo had just returned from talks in Saudi Arabia and turkey worker show drew went missing more than two weeks ago\nTurkish officials say the Washington Post columnist was murdered inside the Saudi consulate in Istanbul charge the kingdom has denied\nIn recent days top figures from journalism and the business world so they will not participate in the investment conference in Saudi Arabia dubbed Davos in the desert\nWith him and his regime has so far resisted taking stronger action ... says he wants to give the Saudis a few more days to complete their investigation Scott Horsley NPR News Washington\nThe Chinese un it's still falling against the dollar down to six point nine four day it's a closed in the un come to crossing that symbolic threshold of Seventy one to the u._s. dollars at the end of twenty sixteen since April it has fallen nearly ... percent yesterday the Treasury Department issued a report in which\nIt avoided labeling China a currency manipulator\nIt's coming at a time when China and the United states are locked in a trade dispute\nHomebuyers are seeing it's breaking the costs of borrowing in the U.S after weeks of climbing toward the five percent mark long term mortgage rates\nHas to take down this week to four point eight five percent\nThe U.S commander in Afghanistan is reported to be unharmed after Afghan guards turn their weapons on a gathering and a security conference in southern Afghanistan three senior Afghan provincial officials including Kandahar as powerful police chief or dead though and for glass has more\nMaybe this is the commander of us and NATO forces general Scott Miller was not injured and the Taliban shooting in Kandahar three Americans were wounded provincial head of intelligence as well as the powerful police chief Abdul Raziq were killed an IQ was credited with pushing the Taliban out of Kandahar as he told NPR in two thousand Fifteen I can\nDrive you guys until Ninety two hours from here you can not find any thought along\nFor the group continued to have a presence and repeatedly tried to assassinate runs he he was criticized for alleged torture and running illegal prisons but admired for bringing security to the birthplace of the Taliban for NPR News I'm Jennifer glass in Kabul\nThe down down four hundred five points are one and a half percent this is NPR\nThe United states says it is closing its independent diplomatic mission to the Palestinians in Jerusalem Palestinian officials are condemning that move NPR's Daniel Estrin is following that story from Jerusalem\nFor years the ... has been an independent diplomatic mission in Jerusalem the de facto us representative to the Palestinian authority\nNow the U.S will handle Palestinian affairs through the embassy to Israel secretary of state Mike Pompeo says the move is for efficiencies and reflect no policy change but Palestinian official side Erekat said it showed the U.S wants to know future Palestinian state Israeli deputy minister Michael Oren welcome to move\nDan Shapiro former U.S ambassador to Israel under President Obama told NPR the decision downgrade us diplomatic relations with the Palestinians he said it is very unlikely that the Palestinian authority will engage the U.S government through the embassy to Israel Daniel Estrin NPR News Jerusalem\nThe Israeli Supreme Court is overturning a ruling and allowing it\nEmbassy to Israel Daniel Estrin NPR News Jerusalem\nThe Israeli Supreme Court is overturning a ruling and allowing a twenty two year old American graduate student to enter Israel Larry I'll call them was denied entry under a law that bans activists to promote a boycott of Israel\nA constant maintains that she is now focused on going to college and no longer supports the boycott\nShe was held at Israel's main airport for about two weeks while she appealed the ban\nThe down down three hundred Ninety nine point when you have ... percent twenty five thousand three hundred seven the NASDAQ down more than two percent at Seventy three three ... down one point six percent at twenty seven sixty three this is NPR\nSupport for NPR comes from the financial services firm of Raymond James offering personalized wealth management advice and\nBanking and capital markets expertise along with the legacy of putting clients by natural wellbeing first learn more at Raymond James dot com\n\n[noise]\n\n\n\n[noise]\n\nWhat the emerald symphony does it provides a\nKind of a respite from the crazy world and and you know the educational aspects of real big part of what we do too and we're very invested in bringing children and for Kander concerts\nOr we also have active amoral symphony orchestra programs and we have just taken over the greater southwest music festival as a program of amoral symphony within the last couple of months\nWell and just you know in terms of its educational exposure for children are tender concerts we bring in about forty five hundred kids from Amarillo in that area and a symphony kids which is fourth graders\nChildren are gender concerts we'd bring about forty five hundred kids from Amarillo in that area and a symphony kids which is fourth graders we have over six thousand probably that come in for that program and then we have over two hundred and our various\nSymphony orchestras symphony guild has been real good about providing scholarships\nFor students to have private lessons with teachers that they wouldn't otherwise be able to afford we and the good old are all very heavily invested in trying to give kids an opportunity to experience the classical music to play an instrument and hearing instrument experience to music\nI Am a big supporter of high plains public radio and have contributed for a number of years I think it's invaluable particularly our area of the country where a lot of kids don't otherwise have exposure to classical music\nUh gives them an opportunity to listen and learn to appreciate how fleas enjoy [laughter]\nRelax a little bit maybe we would love it if you could support high plains public radio they're a good partner with amoral symphony you wanted to contribute their number is one eight hundred six seven eight seven four four four or online you can go to H. P. P. R. dot O. R. G.\nAnd you can contribute on line\n\n[noise] that was their Butner she is currently the board president of the emerald symphony and as you can hear very active in in the music scene in education in Amarillo thank you were there so much for your tips for your testimonial\nWe have um will have an interview as ... virus coming up this hour and a roof Allen has got some exciting news about ticket giveaways\n\nWe have some exciting news to share with you today we will be giving away tickets and to censor tickets per hour to any of the performances in the twenty Eighteen twenty Nineteen season of Amarillo symphony so we know that lots of people listen to\nSince ... you enjoy classical music and what a wonderful treat to be able to catch the emerald Simpsons symphony performance\nUm during the season so every hour to set the tickets that will be given the way we ask did you give us a call at one eight hundred six seven eight seven four four four or you can also go to the H. T. T. R. dot org and we knew your membership\nPlease remember we are members supported mission driven high plains public radio we are your public radio station and\nPerform um this partnership ... emerald symphony it's just one of the many partnerships that we have to ask the communities that we'd sun so we're very excited to bring him or listening to everyone today\n\nAll right we're going to continue now with music from the emerald Simpson eat this is recorded during the twenty Seventeen Eighteen season and it's the first movement of WC Islam air from dawn to noon ... since the conductor\n\n\n\nMm\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\nAnd that was funny we have a stake tickets available doing this hour\nGets call one eight hundred six seven eight seven four for far you can enter your name for the drawing\nOh so there is a hundred and twenty dollars match lean he's semi can sense that we call him make your donation to play some of the radio your dollar will be matched dollar for dollar at two hundred twenty dollars\nWe're asking for your support as high plains public radio contribute now call one eight hundred six seven eight seven four four four H. T. T. I. dot org and why don't you al\nTo know that Chuck among the seventeenth music director at the emerald symphony um he's the director and he's also the conductor were so blessed to have him and a dear button there earlier talked about all the wonderful outreach programs at the symphony has\nRight now she may have mentioned that there eighty five musicians and Tibet you just one point seven million dollars\nSo apply to the emerald symphony for doing so well and make you wonderful performance is that we can also enjoy hearing\nAll right let's continue now with the second move into WC from America does this play of the way this is from that performance recorded march twenty ... twenty Eighteen at the globe new Center for the performing arts ... virus conduct\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\nMm [noise]\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise] you've been listening to move in to play the waves from Debbie sees ...\n... ... conducting the Amarillo symphony orchestra and a performance recorded at the globe Center for the performing arts march twenty third twenty Eighteen good afternoon I'm Steve Johnson Mrs Amarillo symphony afternoon nonsense Sonia [noise] you\nMay call us at one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org make your pledge for classical music and uh we carry as we do a show called the emerald symphony presents which\nFeatures performances from them I'm the host of that it's my pleasure and honor\nTo do that for this fine orchestra and we have tickets to give away\nFor upcoming performances vis a\nVis tomorrow in Saturday a pianist Conrad Dow is going to be playing George Gershwin concerto an F. one of the most exciting pieces and the ...\nAnd um that's something that you might want to consider or you can choose any of the current season performances and we'll talk about those shortly at risk and but you know about the tickets\nGood afternoon everyone I'm pleased to announce that we have some tickets available for any other performances this twenty Eighteen twenty Nineteen seeds in Amarillo symphony give us a call one eight hundred six seven eight seven four four four and well any your name and the drawing\nDot org you can help ensure the reliable operation of our Web stream by serving a signal monitor to Inquirer or volunteer just email us at H. P. P. R. at age ... P. R. dot org or coal eight hundred six seven eight seven four four for\nLife from NPR News in Washington I'm Lakshmi saying\nThe Washington Post published another piece by dissident Saudi journalist or ... it is is the paper puts it ... last piece at a deeper level a difficult shift for colleagues who suspect but don't know for sure that could show geez that\nHe was last seen alive walking into the Saudi conflict in his ... that was weeks ago his family and friends believes Saudi hit men loyal to crown prince Mohammed bin Salman were involved [noise]\nWashington Post's editorial page editor Fred Hi at talk to NPR's Mary Louise Kelly about what it was like publishing because she'll jeeze final op ed\nWe held onto this call him that he filed the day before he entered the consulate [noise] uh in the hopes that\nRecord edited with him as we normally did and [noise] um we waited and waited and I think the fact that we published today [noise] has kind of an acknowledgement to ourselves as well as to the world that we don't have much hope that we're going to be able to edit this one with him\nThat spread highest speaking to NPR's Mary Louise Kelly one of our hosts on all things considered one like other governments the Trump Administration is not saying if it believes it's a longstanding ally in the middle east was involved\nThe treasury secretary Steven Mnuchin will not be attending next week Saudi investments summit NPR's John Ydstie has more on that\nMission and asked the decision in a tweet after a meeting with President Trump and secretary of state Mike Pompeo\nMultiple CEOs for us and global companies have also said we'll skip the meeting\nA forum intended to highlight opportunities for investment in Saudi Arabia it's part of crown prince Mohammed bin Salman effort to diversify his country's economy and ease its dependence on oil\nAfter meeting with Trump Pompeo said he understands the serious nature of the situation he vowed to conduct a complete and thorough investigation\nAfter which he said the U.S would decide how or if to respond John Ydstie NPR News Washington\nCongressional Democrats say they have documents suggesting President Trump personally change the government that says you know enhance his own financial bottom line NPR's Peter Overby says the FBI was moved out of a new building near Trump's D.C hotel\nThe FBI needs more space the plan was to tear down the old headquarters across the street from Trump's hotel and sell the land to a developer who might build another luxury hotel\nYears ago Trump himself had been interested in the project but last January he vetoed it and said there should be a new FBI building on the same site\nNow congressman Elijah Cummings and for other Democrats have released documents from the federal general services administration emails among TSA officials disgust meeting with Trump about the project last January\nOne email refers to what Trump directed everyone to do\nThat to NPR's Peter Overby this is NPR\n\nThe wake of the Trump administration's crackdown on unauthorized data leaks to the media today at thirty nine year old former FBI agent in Minnesota is facing four years in prison\nTerry James L Barry wood sentence today months after he pleaded guilty to one count each of unauthorized disclosure of national defense information\nAnd unauthorized retention of national defense material prosecutors say he provided an online news organization with classified information related to how the FBI and says his informants\nPeter say he provided an online news organization with classified information related to how the FBI ancestors informants I'll breeze attorneys argue their client was concerned the FBI within gauging in racial profiling\nThe national institutes of health has a new plan for how it will handle former research chimps me deep too frail or elderly it'd be moved to a sanctuary NPR's Nell Greenfieldboyce has more\nThere's around two hundred and fifty chimps left that are eligible for retirement to a forested sanctuary in Louisiana and I aged completely halted its chimp research about three years ago and over the last decade or so research labs have already moved hundreds of chance to the sanctuary\nAlthough the NIH wants to transfer the last remaining chimps there's been concern that some may be too old or sick to handle the stress of moving\nNow the NIH says it will create a standardized way to assess each champion see to see if it can be safely relocated\nIf either the research lab or the sanctuary says a chimp is not healthy enough to go the end I H will have a separate panel of veterinarians also weigh in Nell Greenfieldboyce NPR News this is NPR\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring John Slattery Amanda Pete Paul Riser encapsulate hiring a new episode every Friday on prime video and the ... foundation [laughter]\n\n[noise]\nGood afternoon you're listening to some phony or on member supported mission driven high plains public radio I'm Steve Johnson if that means sounds familiar to you it's also the theme for the Amarillo symphony present program here on H. P. P. R.\nAnd we are in the midst of an Amarillo symphony afternoon here on some phone you looking for your support\nTo fuel for your public radio station\nYou can call one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org I'd like to give out a few sank use I'd like to thank you for all of you who called in our Web your pledges and I'd like to thank cake Kennedy for the lovely lunch you\nMay [laughter] thank you [laughter] and all you're most welcome [laughter] I'm a staff members and volunteers who are all working on this this drive and I'd like to thank everybody that brought lunch all the other days [laughter] true All right\nUh let's begin with them will have music from Beethoven we'll ... we'll hear the first movement of Iraq a symphony shortly but let's go to Kay Kennedy first\n[noise] yes I Want to let you all know that tomorrow on friday the nineteenth if it is friday sometimes I'm pledge drives these days rather run together [laughter]\nBut it'll be luncheon listening at twelve PM and this is something that um the symphony guilt sponsors\nYou can have a lunch and you can understand and have a little talk with a conductor or a guest artists about what's coming up this coming weekend or the next concert and it's it kinda prepares you so that you know when you get to those special spots that had been pointed out that makes the music special you'll just have a little better understanding of the music\nThe concerts are going to be friday and Saturday at seven thirty at the globe\nThat show he'll just have a little better understanding of the music the concerts are going to be friday and Saturday at seven thirty at the globe news Center for performing arts and we have chicken with that we're giving away with Alan\nYes we have tickets available to any of the performances for the twenty Eighteen twenty Nineteen season and to place you name and the dry call one eight hundred six seven eight seven four four four\nThat's one eight hundred six seven eight seven four four four and your name will be entered into the joined for those sets of tickets we have that's several sets of tickets available\nFor this afternoon of listening to Emily symphony and to partner with them these tickets are available for you to enjoy and there's no charge for them to call one eight hundred six seven eight seven four four four and your name would be in your image drawing\nHigh we've been hearing from Amarillo residents who are involved with the symphony in and classical music on H. B. PR this afternoon and\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMusic from composer Chris Rogers and\nHe is that is from four autumn landscapes that was cold and clear Don Chris Rogers and has been be\nA composer in residence for the emerald symphony starting in twenty fourteen and this season he's the serving as the an artistic advisor and that piece before autumn landscapes was commissioned by the emerald symphony\nYou're listening to some phony on member support in high plains public radio support for H. P. P. R. classical music programming is provided by\nCourtyard by Mary I am really medical center minutes from shopping dining and reach sixty six offering sweets with amenities for corporate and leisure travel or travelers Mariette dot com eight and a C why\nAre we are we about to do the drawing lady\nThat's where I found is that point you know I ... I'm excited let me check the sad [noise] ... oh let me choose like I actually am going to draw\nHow many ...\nI've been married ... within eight six phone number you are first lucky person to receive a set of two tickets for any of the performance\nFor the amyloid symphony and the twenty Eighteen twenty Nineteen season so please give us a call that one eight hundred six seven eight seven four four four\nAnd Mary will give you the information on how to acquire the tickets and why we're discussing is that just like to say the value of these tickets ranks sixteen now they said to around fifty five dollars it depends\nAnd while we're discussing this I'd just like to say the value of the tickets range from sixteen dollars up to around fifty five dollars\nIt depends on what's available ... ... each and were you choose to sit so you will find yourself with some wonderful seats to enjoy great performance of ... and you know if you're calling from\nGaiman are from war gr or from um\nGarden City and you're interested in attending these performances really make a wonderful evening out on the town to go down on a friday or Saturday Night\nAnd spend the night in Amarillo enjoyed an incredible performance from Amarillo symphony so I'd like to encourage we we did have several names that we drew from on the ground and we'd like to encourage them to please join in and this is a free gift that's available and the partnership through Amarillo symphony and high plains public radio\nSo call one eight hundred six seven eight seven four four four so that we can enter your name into this free drawing for an evening of Amarillo symphony\nYes and I'd like I have another statistic about or just a matter of fact about Amarillo symphony the Amarillo symphony guilt is a vital part this is a group of volunteers they they were founded in Nineteen fifty five\nAnd having been on that board for a number of years I Know how hard every one worked to bring in money for the symphony through special events\nThat maybe we ought to have an H. P. P. R. guild you know with people throughout the high plains but the symphony go work tirelessly with their lunch in listening with symphony ball\nThey have just numerous fundraisers and\nI'm a van that bring funds to the symphony 'em and help reach the budget help reach the goal of the symphony budget we're asking you today to help us to reach the high plains public radio budget for the year we nature gift and just like the symphony nature support\nHigh plains subject radio is members supported mission driven\nYour gift does matter it doesn't matter that size it can be five dollars that can be five dollars a month it can be ten dollars a month and if you wanted to do a hundred and twenty dollars you'd get your money matched which means if your gift would be two hundred and forty or we could have several people that would\nCould call in and get their dollars matched and make their gift doubled during this time period the matches from land use of similar on Kansas and we thank you so much land for that for those that are new members that college joined we have a beautiful calendar that high plains public radio has published this year\nOf with photographs by photographers that live in the high plane as a public radio region\nAnd their images of things that they see every day you're all you'll love it when you get it\nUm that's for new members will receive the er at the sixty dollar level will receive a ... or if you're a sustained member and want to make a thirty dollar additional gift\nYou'll get one of these wonderful calendars\nHigh plains public radio is yours source for classical music where the only station\nIn the high plains region that provides classical music in several different programs Amarillo symphony is one of the programs so if you support high plains public radio\nYou support high plains public radio classical music programs let's hear from you at one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org and don't forget lunch and listening tomorrow\nAt noon for the Amarillo symphony Seif\nAlright let's continue now with music from the emerald from me we'll hear the third movement from Beethoven's third temple ...\n\nSymphony whether you're the third movement from Beethoven sir Anthony the you're right\n\n\nMm attorney general Jeff Sessions is a defender of religious liberty but it just supporting selective and\nThen there's a public face of this government which is very protective of religious liberty and then the real work that they're doing is only protecting religious liberty rights of those who are religious conservative\nI'm Mary Louise Kelly when the administration's views on religious liberty conflict with other priorities this afternoon on all things considered for more clock central and high plains public radio [noise]\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\nLie from NPR News in Washington I'm Lakshmi sang pressure is building on the Trump Administration to respond more forcefully to the disappearance and suspected murder of Washington Post columnist or ... a U.S resident\nHe was last seen alive walking into Saudi consulate in Istanbul weeks ago secretary of state Mike Pompeo says the Saudis need time to explain Here's NPR's Mara Liasson\n... met with the president of the White House and told him about his meetings with Turkish and Saudi officials ... said the U.S takes this very seriously and expects the Saudis investigation of themselves to be completed in quote a timely fashion\nBut ... also stressed that Saudi Arabia was an important ally and suggested that there might be no consequences at all\nWe ought to give him a few more days to complete back so that we do have a complete understanding of the facts surrounding back which point we can make decisions about how the United states should respond\nTo show jeeze family is calling for an independent investigation and there is mounting evidence that the men involved in ... alleged murder and dismembered meant we're close to the Saudi crown prince Mara Liasson NPR News the White House\nTreasury secretary Steven ... latest high profile gas to bail out of Saudi Arabia's upcoming investment conference that much more unsettling for an already shaky us market where major indices are down one point two percent to over two percent but economist Mark Zandi says there are other factors in there's\nA confluence of things things have been bothering investors will at past couple of weeks the higher interest rates prospects but the Federal Reserve will continue to push retire overvalued stocks the people are nervous that the stock market has come too far too fast and of course there's a trade war or the typical eating with China and that's not good news\nThat smart Sandy of Moody's Analytics President Trump is threatening to direct the military to close the southern us border with Mexico as tens of thousands of Central American migrants have been attempting to cross to Mexico\nIt is threatening to direct the military to close the southern us border with Mexico as tens of thousands of Central American migrants have been attempting to cross to Mexico and then the U.S and its tweet today Trump urged Mexico to do something large number of incoming Hondurans Salvadorans Guatemalans\nFlorida officials are adjusting election rules because of hurricane Michael NPR's Debbie Elliott has detail\nWith entire towns devastated and still without power less than three weeks from the mid term election Florida is relaxing rules to allow for extended early voting and easier vote by mail options\nRepublican governor Rick Scott who was running for US Senate approved the changes with an executive order and allowed locally elected supervisors of elections to add more early voting locations and keep early voting open until election day arrived on November six\nNormally early voting closes the weekend before the election the order also directs local officials to make sure that emergency responders and people\nWho evacuated have a way to cast a ballot the panhandle typically votes heavily Republican that's Debbie Elliott this is NPR\n... it's suing Amazon for allegedly setting up ... accounts to quote illegally ... sellers to sell on Amazon NPR's Alina Selyukh reports\nEven alleges that since twenty Fifteen dozens of Amazon sales representative in the U.S stand overseas solicited hundreds of ... sellers to become sellers on Amazon you may says its rules prohibit these kind of solicitations as well as the change of outside contact information\n... Amazon wraps of inviting sellers to connect outside of the ... system and using tactics to avoid detection\nAmazon declined comment and we should note Amazon is one of NPR sponsors\nEven his lawsuit asks for jury trial seeking an injunction to stop Amazon use of the messaging system just elicits sellers and to get Amazon to pay restitution Alina Selyukh NPR News\nFacebook at sporting a new election war room design and shoot down fake accounts in fake news stories in the run up to them in terms that social networking giants been tightening measures to counter bogus accounts or pages and to protect users privacy\nAfter revelations that the date of millions of users were inappropriately mind by outside parties for political purposes\nFacebook says it's war room is the latest stepping cutting off the flow of misinformation however it opens a fair number of skeptics who see the war room is more of a publicity stunt\nThan a solution before the closed down down three hundred twenty seven points one point two percent or twenty five thousand three hundred Seventy nine yet to be with down one point four percent NASDAQ off more than two percent\nThis is NPR\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserved and manage their wealth learn more accountability dot com slash wealth fidelity brokerage services are wealthy and Americans for the arts and Americans for the arts dot org\n[noise]\nGood afternoon and welcome to the third our of sin phony or we're featuring the Amarillo symphony this this afternoon on ... and we'll have music this hour and also we'll be speaking with Amarillo resident Jim Jordan\nI'm Steve Johnson welcome to the program you can show your support we're trying to grow our membership this time around and you can become a member at one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org okay\nYes I Want to thank some people that we've heard from that have renewed their membership and we're very thankful we love all of our members Carol from Amarillo\nJoe from Amarillo George from Lawrence, Kansas Charles from all of the Leo Leo to Kansas and another Charles from here in Garden City Kansas thank you all so much for for calling in for new in your membership and for supporting the high plains public radio\nHigh plains public radio is the public radio for five states\nSouthern Nebraska most of Kansas eastern Colorado and the Texas and Oklahoma Panhandle area we serve thirty three hundred counties three hundred skews me three hundred pounds so we serve your town and we serve you\nThis is your public radio station\nAnd we're asking for your support\nH. P. P. R. is members supported mission driven college at one eight hundred six seven eight seven four four four or go online at ... H. P. P. R. dot org resounding\nThat afternoon everyone I Hope that you're enjoying this afternoon just insomnia with Amarillo symphony presents\nI Want to remind everyone that if you haven't called now it's time to call one eight hundred six seven eight seven four four four and give us your name and you will be entered into the drawing for instead of tickets to attend any of the performances for emerald symphony twenty eight team twenty Nineteen season\nAnd there's so many performances to choose from\nAnd there's the symphony for kids in January are in December happy holiday pops and and this coming weekend that's ... ... s\nAnd that's always fun and they're going to have a sing along than that so you know that the little children will be good and not not in that particular day and also in looking a little further ahead there was the Old West I Believe that was in the spring on\nMarch\nFriday march twenty second insanity much twenty third it sounds really intriguing I bet that would be a fun show yes\nThat they're going to have music from the magnificent seven and some of the spaghetti westerns my husband loved Clint Eastwood and although spaghetti western so I think they have a a season for everyone for people that like pop for people that like fun with the family and for people that love straight classical music [noise]\nI Know we have a guest at the moment or are we ready for I guess Steve\n[noise] [noise]\nOh hello Jim Carrey how're you doing today going well thank you thank you so much for\nGiving us some of your time this afternoon and I know that these has some questions\nAnd he wants for an official interviewed Jim so [laughter] I Know you know the answers to all of them and you're going to make a hundred like you usually do for our listening audience I Want you know we're talking to a gym charter Jim Jordan\nWho is ... aren't volunteer and her partner extraordinary he's been recognized for his on an\nUnwritten Herman in support of the arts and ... and I'm ... and my friend\nThe [noise] Jim thank you so much for being on the program today and welcome\nBack you're an avid may as I say on NPR\n[laughter] All right well the first thing I'd like to ask you about your involvement with cameras company\nWell [noise]\nI've been around a long time for the little luck out but you do you fix it up a couple of weeks and I remember my first call for was in the old for the ... or ... or ... or killed a guard was I got\nTo a crossover classical off a soprano\nHad they had a held a guard who was I kind of a crossover classical pop a soprano and I remember ... wonderful artist named Alex Templeton\nAnd then I just uh my uh tend to to the ... he was kind of ... pills that ivy Saddam became of tried to never miss a concert and uh\nTo me the symphony as a I'd call it the mothership the performing arts and ... because it serves so many other hard Saturday's like the ballet and they\nCheck their music Amarillo and let's begin you for the very wonderful faculty uh from the WTO in a new school believes he had a\nIt's a has something for everybody on any given night and a hobo barrels has been a very innovative conductor in a ... a leading to a much broader audience which way they these studies and those\n[noise] I've been a Radiohead forever I've always lived out in the middle of nowhere my father was a compressor station ... and the fact that I Love a radio so much I don't have time for television I get my TV till the salvation\nArmy to go so I'm a fan\nAren't touching on what you just do you do you do now you are listening to any any aren't in general you weren't you weren't using they bring to your community in into the region in general\nWell for one thing a ... and they pan out on general is a wonderful place and a highly developed buddy areas and ah\nThey symphony I Believe is\nPart of the ... on the cake care and that's a safer another a CEO looking for a new home for an industry\nIt's nice to know that there is a symphony here along with many other forms of entertainment that also and I think it has great commercial value it brings in a a\nBroader audience from a property at tri state area they stay overnight they spend money on the food and lodging and uh it's beneficial to performing\nVenue for the advanced students who graduates have WTO name you end up many others that I could think of if I had a little more time\nOn you mentioned I learned that you're you you said you were radio here and I'm Wondering what kind of we all are here and I'm a high plains public radio in general we're we're striving to bring the arms to the region in I'm\nIn the Emerald City where do you have any word seem out now you are I think I Would agree on one brings to an ... in the region in general\nWell for me\nUh life would be a desert without H. P. P. R. 'cause I I listen to your tap in forty four seven the b._b._c. and your daily broke as having your investigative journalism and or you give an autistic and courteous hearing to all sides politically and uh [noise]\nIt is a it fails and all the changes that are most of the ordinary right in my stream radio or or die radio just gives you a headline news and are you there are much more in depth\nInformation that I think we all need to know these days about all sides of the many many stories\nAnd I think we all did over many many stores in the book was\nAll right well ... thank you for your time after noon and thank you for listening and being a corner of our planes hovering around ... term hunting\nOr you're very welcome\nAround here and thank you for being on the program and to a gym [noise]\nIf he would like to be a supporter of H. P. P. R. call one eight hundred six seven eight seven four four four\nOr go on line at H. P. P. R. dot org and Jim is ride he gave away his TV and he is a Radiohead and we're glad to hear that they were glad that he's one of the supporters from Amarillo\nYou'd be one of the supporters from your community we have communities we have three hundred communities scattered throughout our lifting area we would love to have\nThe name of a supporter from each of those communities so if you are a member and you live in one of the towns within our listing area doing your part in colon right now one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org Ruth Allen\nJust to give everyone an update regarding our tickets we have dry for and another set of tickets around three thirty and you have a one in five\nChance of winning so we've had a few calls that we place the names and to then chief for the free tickets\nAnd if you're just joining us this afternoon call one eight hundred six seven eight seven four four four if you're interested in and placing your name and drawing for two tickets to see the twenty Eighteen twenty Nineteen\nEmerald seats in the season of the emerald symphony you have your choice of any other performances for the twenty Eighteen twenty Nineteen season\nThat one eight hundred six seven eight seven four four four and there's no charge for the tickets the value of the tickets however are from sixteen to fifty five dollars each\nSo it's a nice little bonus a great little treat to come to Amarillo and see\nAn emerald symphony orchestra perform than one of the events and that to get those tickets available from any one across the high plains if you're in border or in beaver or if you're in Fannie give us a call and we'll play she name and and the joy and you can have a wonderful evening in Amarillo and enjoy the arts\nAnd if you are going to become a member of renew your membership we have a hundred dollar match right now from Georgia Lawrence, Kansas so call one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org and your dollar will be matched up to one hundred dollars thank you\nSupport for H. P. P. R. classical music programming is provided by commerce bank with one hundred fifty years in business we're here today and you'll be here will be here tomorrow you can bank on the safety and soundness of commerce bank member FDIC\nLet's hear some music from Aaron Copeland right now this is a high plains favorite we'll hear two ... uh the cuts from before dance episodes row day or the Saturday Night ... Saturday Night waltz followed by hoedown ... virus conduct\n[noise]\n\nDo your part how one eight hundred six seven eight seven four four four or go on line at H. P. P. R. dot org\n[noise]\nAll right one once again that number is one eight hundred six seven eight seven four four four or online at H. P. P. R. dot org [noise]\nWe'll hear another piece of music now from Amarillo somebody this is from be twenty Seventeen Eighteen season we're going back to the rebellious violin concerto in D minor when you're the first movement Alexi Kenny is the soloist\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nMm Mm Mm\n\nMm Mm\nMm\n\n\n\n\n\n\nYou know a girl\nOr a\n\nMm\n\n[noise]\n", "year": "2018", "show_name": "Sinfonia", "city": "Dalhart", "day": "18"}