{"month": "10", "state": "MA", "station": "WFCR", "content": "From here comes up at six o'clock this evening here on New England public radio says you on any PR is funded by the EU and the Springfield public forum presenting ambassador Nicholas Burns on the future of diplomacy a symphony hall Tuesday auction\nStreaming of New England public radio is funded by ... rental architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nFinal story slam of our valley voices season to the Academy of music in Northampton twelve of the best storytellers in our area will compete as they share their true tails with you\nAnd then you get to help crowned the winner of the best of the valley voices story slap the show is tonight at eight at the Academy of music and arts happen tickets are available at the door\nThis is New England public radio WFCR in Amherst Springfield Hartford W to four to eighty Williamstown W to six six eight W north Adams W to nine ... W to five to be G lead and W. two five four hey you\nGrade Barrington in partnership with UMass Amherst added and E. P. R. dot net classical music was Deepak is next to a good afternoon at one o'clock\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and ask and applied laboratory science at operations enrolling now for August twenty seven applications that they pass dot edu [noise]\nEasing our way into an afternoon of great music with the fifteenth waltz by Brahms played by Byron Janice on New England public radio in Amherst and Springfield that eighty eight five also in Pittsfield at one of those six one ended and eat P. R. dot net\nIt's one or two I'm Steve Peggy thanks for joining me on this cool overcast kinda drizzly rainy day\nMaybe not the best day for outdoor activities like the Hartford marathon\nAnd kudos to all the runners volunteers and spectators at the twenty fifth annual running a bad event where do you are running the five K. or the half marathon or the full marathon cheering people on are taken care of the runners as they made their way up and down the\nConnecticut River valley a great day to be out and enjoy even we have some of the a cooler and damp whether\nGood time now to curl up with a hot beverage in uh enjoy some great tunes with me this afternoon that will include a Mozart wind diverted into coming up in about ten minutes and a sweet by personal that's all in our first hours together\nTurn next to a polling news really odd for channel and traveled by shop at the ... and the pianist is you know bar that too\n[noise]\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\n\n\nNa na na\nNa na\n\n\n\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n[noise]\n\n\n\n\n[noise]\n\n[noise] um\n[noise]\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES each certify technicians Massachusetts state inspections she keeps garage dot com\n\nThat that's\n\n\n[noise]\n\nSo here's they get to any PR is offering a special piece he'll deal on tickets for our Janis ... hall buddy party joined us for an evening of dancing take helpful taught sex\nAnd sipping some bubbly our side car in the speaking at the hotel not happen on Saturday December first few clients who really very discount before Wednesday October Seventeen\nGrab your tickets now in any PR dot net [noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\nOh\n\n\n\n\nStreaming of New England public radio was funded by you win Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall D. C. V. S. dot org\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\nUm\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench basis from board room to room with a the equipment and again house catering hotel north Hampton dot com\n[noise]\n\n\n\nScreening of New England public radio was funded by you and they passed the university graduate schools and asked in higher education administration enrolling for October twenty second applications that they pass dot edu\n\n\n\n\nStreaming of New England public radio was made possible by you and boy she keeps garage in Williamsburg offering foreign and domestic on the repairs AFC certify technicians Massachusetts state inspections she keeps garage dot com\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu\n\nMm\nFor years they get too many years offering a special treat failed the tickets for our Gen is the whole wedding party on Saturday December first grab your tickets no at any PR no no\n\n[noise]\nStreaming up the waitlist public radio was funded by ... Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling fall Gees easy yes dot org [noise]\nMm [noise]\n\n\n[noise]\n\nMhm [noise]\n[noise]\nMm [laughter]\nMm\n\n\nStreaming of New England public radio was funded by June ... architects forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n[laughter]\n\n\n\n\n[laughter]\nStreaming of New England public radio is funded by you when they passed university graduate schools MS and applied data science enrolling for October twenty second applications at bay past dot edu [noise]\n\n\n\n\nSo there's forty first keyboards to not I was played by pianist Maggie call on New England public radio in Amherst in Hartford at eighty eight five ultimately at Ninety eight three and online at N. E. B. R. dot net\nI'm Steve Pepe we spent a relatively relaxing first hour plus together type or something a bit more dramatic from ... next\n... is a busy man these days he uh recently stepped down as principal conductor of the Rotterdam philharmonic orchestra that's because he's got three other a top flight jobs he is the music director of the uh Montreal metropolitan orchestra\nThe Philadelphia Orchestra and the Metropolitan Opera he uh hops all over the world and maybe that commute a sheer stateside on this side of the ocean is probably a little bit more manageable with Montreal\nPhiladelphia and New York but still very busy man that talented one at that and here he is conducting the chamber orchestra Europe in ... for symphony\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\n\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n\n\n\nSo here's they get to any of the earth is offering a special treat failed the chicken or our Gen is the whole body already going us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in the ... the hotel north happened on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets no any PR yup\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n\nSo here's a good many years offering a special piece he'll be a lot of chicken origins the whole buddy party on Saturday December first grab your tickets no it's a PR no no\n\n\n\n\n\nSo here's the hip to any PR is offering a special ... tickets for our Janice baby oh buddy party on Saturday December first grab your tickets no at any PR net [noise]\n\n[noise]\n\n... English horn Ursula ... heart playing Bette homage to ... by Antoni ...\nIt's a birthday anniversary number one hundred and Seventy six for a Tony ... he was born in Palermo in Eighteen forty two and as he often did a transcribed ... works by operatic composers like believe me Don is eighty Verde\nRossellini into a works for oboe and hard sometimes Oberlin piano and in this case or English horn and ...\nAnd a little bit later on I'll have the all the oboe concerto you can relive the sound of the the read instrument and they'll have a park concerto coming up at three o five that's a ... by crumpled\nAs well as a music by handle and heightened and our next hour together I'm Steve Peck key here listening to New England public radio in Amherst and Springfield that eighty eight five in Pittsfield at one of six one ended and E. P. R. dot net turn next\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment at the house catering hotel north Hampton dot com or attention and the Hooper tall symphony orchestra\n\nMm\nStreaming of New England public radio was funded by us they pass university graduate schools and asked that applied laboratory science that operation enrolling now for August twenty seven applications that they pass dot edu\nSo here's they get to any PR is offering a special treat Silvio on tickets for our Janice baby call buddy party joined us for an evening advancing helpful taught sex\nSipping some bubbly our car in speaking at the hotel north happened on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets no any PR\nBy the mid seventies eighties from Joseph Haydn was a musical celebrity who enjoyed immense popularity throughout Europe\nAt that time he was commissioned to write six symphonies for a series of concerts in the French capital all of which were received with great enthusiasm\nOn Sunday Morning we'll hear the most dramatic of heightened this so called Paris symphonies along with works by currently by and lots more classical music with my good friend and colleague John ... begin Sunday Morning at ten here on New England public radio\nIt's three o'clock I'm Steve ... glad you could stick around on this Saturday I have another two hours of music ahead for you including a ... bike crumpled sin works by an adult and yes heightened head in the next sixty minutes right now it's an ... concerto by\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org she led by up after martini\n\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do now with rolling for full gee C. V. S. dot org\n[noise] [noise]\nStreaming of New England public radio is funded by you and cute little architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n\n\nAn ... concerto by faulty Alberto Martini leading the ensemble ill e feel have money cheap and the bus was Paolo ... street on New England public radio in Amherst and Hartford at eighty eight five also in great Barrington at Ninety eight seven you can hear us online at N. E. P. R. dot net\nI'm Steve Peck in twenty five minutes you can hear I knew recording of one of\nThe key parts we talked handle\nAnd I've got a string quartet by heightened still on the way in our next hour together\nWell let's barrel thought for John ... host he was probably the best hearts player of his generation that being in the middle part of the Eighteenth century\nBut things didn't work out as well as a compulsive might have liked although he worked very closely with one of the famous uh harp makers in Paris ... perhaps he was working a little bit too closely because he fell in love with a ... daughter they were separate\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nAnd uh after a labor married things didn't last too long apparently he's young bride ran off with a young lover possibly the pianist young a lot of salt do check yeah ended up in London and he looked there was a\nBeginning of a a sad ending for ah for compost\nHere is ... compost fifth heart concerto with Carter no ... no about ... as the ... John ... leads the south west German chamber orchestra\n[noise]\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org [noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel owners now offering six meeting at the bases board room to room with a the equipment to announce catering hotel north yup dot com [noise]\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asked and applied laboratory science that operation son rolling now for August twenty seven applications that they pass dot edu\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs and he asked each certifying technicians Massachusetts state inspections she keeps garage dot com [noise]\nAnd then\n\nThey do\n\n... [laughter]\nMm [noise]\n[noise]\n\n\n[noise]\n[noise]\n... son Giovanni playing the fourth of the second set of\nSo here's they didn't do any PR is offering a special pre Silvio on tickets for our Janice baby holiday party going us for an evening advancing ... taught sex\nAnd sipping some bubbly our side car in speaking see is a hotel not happen on Saturday December first few clients with an early bird discount before Wednesday our corporate Seventeen\nGrab your tickets no at any P. R. dot net [noise]\nEnded and E. P. R. dot net and in the same vein of new recordings have next a new recording of heightened is forty second string quartet by the ... have taken their name from the Serbian American inventor engineer and futurist Nikola Tesla\nAnd in addition to a winning lots of prizes a as a string quartet the ... is a tight involved in the community they've reached to a\nPlay in children's hospitals and soup kitchens libraries retirement communities and schools so a very talented group that is providing music to people who don't normally get a chance to listen to it [noise]\nHere's the tests the court that heightens forty second string quartet\n[noise]\n\nDreaming of New England public radio was funded by June ... architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\n\n\n[noise]\n\nStreaming up New England public radio was made possible by you know by sea cues garage in Williamsburg offering foreign and domestic under Paris or yes you certify technicians Massachusetts state inspections she keeps garage dot com\n\nMm\nNo\n\n\n[laughter]\n\nScreaming of New England public radio was funded by you and they passed university graduate schools and that's in higher education administrator show enrolling for October twenty second applications that they pass dot edu\n\nStreaming of New England public radio is funded by un they passed university graduate schools MS and applied data science enrolling for October twenty second applications at bay past dot edu [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\nHeightens forty second string quartet was played by the Tesla cortex in their brand new market classics recording\nIt's four o'clock this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ended and E. P. R. dot net\nSaturday classical on N. E. pi ours funded by you and nurture orthopedic associates an affiliate of Berkshire health systems providing surgical non surgical orthopedic services including anterior hip surgery\nAnd by Glenn metal retirement providing senior living in long metal and at home services throughout greater Springfield blend meadow dot org\nHurricane Michael cut a trail of destruction do the Florida Panhandle this week many people are without electricity and deaths have been reported in multiple states I'm ... will keep you updated on storm recovery efforts plus the latest news next time on all things considered from NPR\nStreaming of New England public radio was funded by you and cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\nAnd that's a head for you in just over just less than one hour at five o'clock this afternoon weekend all things considered I'm Steve picky it's for a one thanks for letting me share the music but you had that in just about ten minutes new recording of Beethoven's emperor piano concerto and let's wrap up our\nFinal hour together with the prince ... overture by bargain it's John ... leading me is ... ... ...\n\nUh\n\n\nStreaming of New England public radio was\nFunded by ... valley solar\nA local company install like Ruth ground amounts\nAnd do all access trackers\nHelping households lip carbon\nFree in the bar one three valleys\nSolar dot solar [noise]\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n\n\nNo no no no\n\n\n\n\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the basis for a board room to room with a the equipment and the house catering hotel north Hampton dot com\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\n\n\n\n[laughter]\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic under appears AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n\n\n\n\n[noise]\n\n\n\nOr or\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications at ... dot edu\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n\n\nStreaming of New England public radio was funded by un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise]\n\nWell\n\n...\n\nStreaming up New England public radio was funded by you and Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n\n\n\nNumber\nThen the next thing\n\n\n\nStreaming of New England public radio was funded by you and they said university graduate schools and I asked in higher education administrator ... enrolling for October twenty second applications that they pass dot edu\nAh no\n\n", "year": "2018", "show_name": "Saturday Opera", "city": "Amherst", "day": "13"}