{"month": "10", "state": "SC", "station": "WVOC", "content": "[noise]\nThat I mean we\nYou know I Want all of you know eight and a half million of you on terrestrial radio\nFive million of you and podcast God Knows how many on a streamlining and so forth satellite\nI Want you to do something in the mornings about three days a week when I have to exercise my buddy Justin or\nHis great at it my wife and his audience you know it's for cardiovascular and so we're in there right\n[noise] they send me a lot healthier that's for sure I don't watch news when I exercise you know what I watch traditionally around ten am in the morning\nI watch ESPN and there's only one reason\nWhy I watch ESPN I think it's called first take [noise] go Steven ... Smith is on their\nSky max count ends on there too I'm I'm liking him more he's a he's a flight out lip but you know he's he's interesting to some extent his eyes are always like glued to the monitoring but that's a whole nother story\n\nSteven nice missing our friends doesn't mean we agree all the time but we respect each other or both passionate about what we do\nAnd I bring that up because people with different backgrounds people with different beliefs although we have overlapping beliefs to get along and get along very well people who are passionate can get along very well\nBut uh he's a very good man and I love watching him on TV kind of reminds me of me no offense\nBut I'll tell you what is different than me the guys like the rain man when it comes to sports he knows every sport\nEvery player and every time ... how the hell do you figure all this out every player in every sport what they did yesterday or last night and the basketball game or what they did three years ago and a particular football game I mean the guy a smart as hell I don't know how you remember all that stuff\n\nBut it's a place I go to forget about all this to be honest with you because I enjoy sports too you know I'm no expert on it but I enjoy it but\nWhether you're talking about boxing or the UFC or baseball or basketball or football or whatever the hell what is he knows it\n\nAnd even though I strongly disagree with killing ... knee jerk liberalism I'm I'm I'm starting to like him more on that show\n\nAlthough ah if they probably track who spoke the longest be Kellerman typical lip typical lip\nTakes them five times as long to say what let the Stephen ... insane about thirty second there really is\n\nHave you ever thought about the word education means to lead force the word fourth raises another question which was forced\nHow do you know you're going in the right direction now the easy answer the knee jerk cancer is it just depends on\nWhich way you want to go\nTo my friend and he has a dear friend the president of ... college Dr Larry aren't says young people\nAlmost always say that and that they've been taught to say that you and I both know that's not the right answer in fact it's the wrong answer and let me tell you about a place that leads fourth\nHillsdale College at Hillsdale they understand the true education means pursuing the highest answer to the question which way is fourth\nHillsdale students are challenged to discover the right way for I reading the greatest books by the greatest minds in history and they learn the meaning of the three ultimate unrelated things the good the true and the beautiful\nHillsdale holds that unique an important role in American education today I strongly encourage all of my listeners to learn more about this remarkable institution\n[noise] just kind of live in Hillsdale dot com that's L. E. V. I. N. free Hillsdale dot com living for Hillsdale dot com Tony\nGrand Junction Colorado the great K ends easy go\nMark thank you for your time when I was talking about a jar and make a little earlier and you're all the violence the supposed [noise] ah when he was first elected there was a lady comedian open up a separate buddy head of the President Trump\nAnd I didn't notice anybody a complaining about that in all sounded\nLike a lot of them were kind of defend them out and you know my I I just wonder his kids are special bearing in the family you know talking about violence or how do they classify that\nWell you're quite right you're quite right Cathy Griffin\nWho is a a\nA a mouth ... she's not even funny she stupid\nUm she did that\nUh she was criticized by conservatives mostly she apologized and then she's come back with ventured mash and apologize winner of factors worse\nAnd um and she's not alone these people really aren't comedian Stephen Colbert a Jimmy Kimmel and bits to see how the climate I Can't remember all these fools along for the day of a Johnny Carson or\nSomebody like that um these guys have destroyed late night comedy ... they're not comics their gestures their court gestures that's what they are\nAll right Tony ... thank\nAlright brother thank you Tammy Savannah Georgia the great W T chaos go\nHey market the way to get to talk to you that night [noise] um you first of all I wanted to know that I didn't even know who you were him I Am a fourteen year old son told me during the presidential stuff that I Need to listen to this guy marked by then because he knew everything\nSo we follow you have a very who had a brilliant young men there and uh I understand unpopular among fourteen year olds\nYes he's Fifteen now he is every day what's his name his name is Caleb\nThank you Caleb and I love that name by the way\n[laughter] we were out today I'm doing our bowling practice and um they had to release it needs on in the bowling alley and we were watching the news about the ministry packages that you know shut up around\nAnd I understand why the Democrat side goes the way that why is it it is a travesty\nWhen all they have ... walk is good I think people's faces they get in a crowd and make us see as pushback\nOn your point is that the left has been agitating for a fight [noise] and ah why aren't they responsible for their own language and their own conduct thank you [noise] it took\nTo be more time on the ... bay area in the bombing name was ... ... ... ...\n... got a brand\n... read\nDon't miss your chance to win W. B. O. C. and all states seamless gutters one hundred thousand dollar blow home makeover think of the possibilities one hundred grand to spend on your home how ever you'd you enter for chance to win now\nAt W. B. O. C. dot com using the word home and let the remodeling begin that's W. B. O. C. dot com keyword home\nW. B. O. C. and all states seamless gutters one hundred thousand dollar blow home makeover power by AAA\nHeating and air breed um plumbing mayhem roving brawls space medic and all states seamless gutter\nRemember trafficking weather reports morning's\nNews radio five six\nWhen are you on a vacation or any event you know that you want to have the best pictures ever right I mean I don't I have been pretty good pictures that I posted on Instagram of my road trip but but then you don't get ads and the truth that's camera that it\nIs offering that to another level there's your camera has smart aged ER and advance portrait mode and jets control to make sure those portraits are looking stunning\nAnd then video recording you can get up to sixty frames per second and stable\nAre you getting ready for Halloween weekend do you have your costume ready I Love it and\nI have to take all the pictures I take seven years of strangers and pictures of my costume and sometimes I even live stream me wanting to finishing touches on my couch and because I tried to ... everything so luckily I have a Gmail also they have a very fast unlimited network I knew all of the streaming it's also nice 'cause if I\nAm going to be out in the middle of nowhere you know why\nIt took to not packed what about blankets you haven't okay how good enough\nSo folks may not work emergency water not a drop\nAnd what about food nope perfect we all know we're we're meeting if we're separated ya on Jones out the bus stop great and I'll be waiting here wondering where you all are sounds like we don't know what was that for many golf [noise]\nWinging it was not an emergency plan\nWith just enjoy Baltimore's champion is limited reviewers today launching renovations Facebook page\nWe've all seen every one talking about the new iPhone tan as on the Internet but now you have that in your own and I feel like if you want to get one but you also know that you need to get some good offers in order to obtain this brand new phone\nYou got a holler I T Mobile with their best offers now you gotta have the best photos on social media right with the I\nAsked you get the true jets camera that means more advanced perjure mode and smart HD are which to me is that ... plus year according\nTo the [noise]\n[noise]\n\n[noise] [noise]\n[noise]\nMaryland for terrifying attractions one location designed to get\nPolitical building that dream home\nNow the perfect time to talk with us about a mortgage loan\nMany options to consider refined you've alone right for\nCall a civilian storey\nThe commercial airline industry is booming\nWith this level of demand the industry needs more aircraft technician we are the aviation Institute of maintenance and we trained tomorrow's technician the bureau of Labor Statistics report the average aircraft technician in the DC area makes over sixty six thousand dollars a year\nVisit trait tomorrow dot com or call eight eight eight\nFive times the most iconic brand of the booming cannabis industry just went public joined me I peeled now pie time investor dot com dome as your chance to be part of history and making it high time investor dot com lifetimes investor dot com I sold\nThe corps offering will be made only by means of offering circular which has been filed with unqualified by the U.S securities and Exchange Commission the security's are highly speculative investing and shares a kind of stuff\nIf you don't just both of the unused ... prescription drugs in your home they might find a new one they get into this place don't\nAuction days fast approaching hero open up they don't weigh register online and only hope\nTo do more to\nGo at least among [noise]\nColombia's most dependable traffic on five sixty W. B. O. C.\nRadios to make sure you\nAs a seven seven three one two three one one [noise]\nYou're jaded everywhere data breaches Facebook breaches big companies mining and sharing your information [noise]\nThese are legitimate companies putting you at risk now you add in all the crux of scammers and the risk of ID theft it's insane\nTo look the best thing you can do is protect yourself and your family it's why I switched to my id care for identity protection [noise]\nNow they are the very best in the business with plant starting for less than ten dollars a month and only my id care offers you one hundred percent money back recovery guarantee you can sign up at\nId care dot com slash mark and our promo code mark my id care dot com slash mark in a promo code mark\nMy care has taken care of fortune five hundred companies for years but now they're protection is available but people like you and me\nAnd my listeners also get Fifteen Percent off at my id cared dot com slash marks from a code Mart learned more in the ... my id care take care of you and your family that's my id care dot com slash marks in her ... one more my id cared\nDot com slash mark ... hugely important governor's race in Florida that affects the whole nation is the third most populated state\nAnd of course the left would love nothing more than to control the governorship and the control what takes place in this day prior to the twenty twenty election as they would Texas and it's very important this rates the taking place in Florida and the Democrat is about as radical left as you can get\nAnd then left all over the country is pouring millions and millions of dollars into this including billionaires who the the usual suspects\nRun to scientists who have strongly endorsed Ron dissent is um Tallahassee\nIs a very corrupt government under this mayor there's been a a long going FBI investigation as I understand it and even the mayor himself that is the man who wishes to be governor Andrew Gillum he got caught up in this what exactly happened\nOh yeah no absolutely so he has a very close relationship with several lobbyists who are lobbying the city government ah to get basically sending money to to build the project they want it to a million dollars and so what these lobbyists did is they arrange the number of excursions one of which was the New York city\nI'm In a long for the ride on that was a undercover FBI agent who had punted infiltrated\nA he was posing as a contractor trying to do business with the city of but this guy got Andrew during that trip one thousand dollar ticket to go see the play Hamilton Rene people hear about the camel to take advantage of by going to be a movie\nThe tickets for at least a thousand dollars at that time um and so he gave it to Andrew Andrew knew that injures lied about that but now there's been evidence that shows that\nBut then those same lobbyist also arranged\nA luxury for night stay in this Costa Rica villa which ended up costing about a thousand dollars a free Andrew and his wife are in addition to some other folks and again the injured and pay for that and then what happens after all this mark low involved mayor Andrew Gillum turns around\nAnd he gives those lobbyists that two million dollar deal that they were looking for and so\nAndrew is getting things that that he shouldn't have had that did violate Florida ethics laws and then the lobby is God a exactly what they were paying for and so that's really the way the government run it's corrupt it's wrong I'm Andrew has you know he lied to the country on Sunday night when I confronted him about this\nBut then documents came out almost immediately refuted\nIs denial showed he was lying um and he's basically tried to blame everyone he can cause he just refuses to take responsibility but at the bottom line or the older that day tries to say he's not under investigation but mark you are very smart in the law you understand about\nWhat an FBI agent ever act undercover and give somebody a potential dry like that if they weren't investigating the public official bad now only reason you would do such a thing\nOf course nobody knows if he's in the clear now are not nobody knows if this is an ongoing investigation of among other people in him\nOh it's it's it's definitely an ongoing investigation I mean by that much for\nYour um it's interesting we re ran an ad uh basically uh talking about all this problem and his attorney wrote a cease and desist letter to the station and then the letter the attorney said a public reports have said that Andrew is not the subject\nOf the investigation but as you know more some of these bugs words you can be a subject of an investigation you can also be a target of the investigation his own campaign attorney\nDid not put in that letter that Andrew is not a target he just said Andrews that subject so that to me is is a is an interesting er mission or because the bottom line is\nWhy would they be investigating corruption in city hall if it had nothing to do with the mayor you wouldn't have had those FBI agent around him on these trips like they were on\n[noise] Enron descent as he immediately tried to racialized this issue that the reason you were bringing it up and for that matter I guess a local media is bringing up is because of his race\nNow last time I checked it has nothing to do with somebody's race when there's an undercover agent giving somebody I'm a value to try and see if they'll take it any took it has nothing to do with race and I notice he tried to do this over and over and over again in this campaign let me ask you a question your running mate who is your running mate\nWe have all of in search let's give all the support we can to run to scientists in Florida let's increases ground\nGame there and the grass roots there where people go if they want to help you\nRon these fans is dot com R. O.\nN. D. E. S. A. N. T. I. S. dot com we would love to have your support we can't let socialism take root in Florida\n[noise] All right my friend good luck to you take care of yourself\nOr a marker God Bless\nGod Bless you know a few years back when I back Ted Cruz in a primary that nobody thought he could win I told you I Know Ted Cruz personally use the real deal\nI'm telling you America run to Santa says the real deal I'm telling you Floridians run to St is is the real deal the problem is so is Andrew Gillum\nIt's Americanism versus socialism ladies and gentlemen it couldn't be clearer in the state of Florida couldn't be clear in the state of Texas couldn't be clearer in the state of Georgia and a number of these other states the state of Arizona I'll be right back\n[noise] much\nColombia is home for Rush Limbaugh news radio vine sixty WVU\nWish I could be doing something more than scanning groceries you can be doing something you love who are you in your career conscience you're in helping\nPeople right I mean we've had about becoming ... actually saving lives South Carolina has a great demand for health care positions and get trained in two years in this round\n... I'm a senior gone for all this again I'll do it now getting out of here and I made it and you came to visit I made it as the dot com and find out how to my family and the not going from recently South Carolina broadcasters and this patient\nColumbia help on the dot com bruising so world's worst boss but wonder if those jobs don't you just do jobs like smoking for anyone with a pulse will just call him a date [noise]\nHi Dave let's talk about that job you posted for a senior manager\nOkay I've got a lot of applicants already\nPaid you posted on that huge national jobs like what a waste one guy says he's but everything from top Walker to a stay at home uncle\nYou here saying home uncle and dog Walker and here's super fun guy who loves animals\nPosting on that huge national jobs I just wasted our time scrolling through irrelevant applicant book\nI said we're looking for people who are willing to take chances and have a great sense of humor and here's a guy who's this guy driving\nClown that sounds qualified to me we need serious applications from local candidate know resume that you've found me on a huge national jobs I please don't remind me Dave don't Rio de but find your perfect local employee you Colombia I Hope on the dot com local jobs but we're\nNot discriminate against people named Dave Dave is a common name fun to say and so we're using it as a catchall for like Lester buses everywhere they post jobs in the big national board because they really don't care if he's not write us to tell us your data was insulted by this that that would be a real they've moved Dave\n... whatever the boom you know people do you keep them from whom [noise] us drug Enforcement Administration multiple prescriptions performed on Saturday over twenty seven ... capsule might\nA balance of nature's fruits and veggies in a capsule\nI just wanted to keep you up to date on how things have procrastinate\nSo I'm getting down to nature every month maybe sometimes twice a month for my friend who had a ... CAT scan or last week a very good friend of ours too as a teaching ... told me two years ago she's going to be gone within six months [noise]\nI'm so happy that for balance of nature [laughter] because anything else with just not doing it for her\nYou call used discount code mark and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one that's one eight hundred two four six eight seven five one or go on\nWind to balance of nature dot com and use discount code mark\nThose words are used on the road after always drive more to bring the Knicks over was\nSmart but in\nRadio\n... morning news we have six to nine to five sixty W. B. O. C. [noise]\n\nAnd I've been\nSlipping on my Casper mattress I'd pick over every mattress I ever had helps me get the best night's sleep\nOnce you try Caspar you're going to love years to Casper is a high quality mattress at an affordable price I sleep cool uncomfortable every night thanks to the unique combination of phones or provide the right pressure relief in alignment\nCasper ships right to your door for free in a small how do they do that sized box\nLeaving pick it up for you if you don't love it and the refund your everything from its engineering to its packaging to letting you tried for a hundred nights it's no wonder Casper is over thirty five thousand five star reviews of all their products across Casper Google and Amazon\nBut Caspar to the test in your own home for a hundred nights risk free go to Casper dot com and use code mark for fifty dollars towards the purchase of select mattresses that's Casper dot com code mark for fifty dollars towards the purchase of select mattresses Casper\nDot com terms and conditions apply I remember when the Democratic party was a rational party I didn't always agree with it but there were individuals scoop Jackson Zell Miller individuals like that now the stars of the Democratic party or radicals they're extremists\nExtremists\nThat she was running for governor on the Democratic side in Florida that she was running for governor on the Democratic side in Texas that she was running for governor excuse me for senator on the Democratic side in Arizona that she was running for governor on the Democrats size in Georgia these radicals these extremists\nWho absolutely obliterate the success of the states but these states stand for\nIf an idiot log like Gillum has his way he will turn Florida in the New York he will turn in Florida in California if you want that kind of government thing go get it but why do you have to destroy all these actually properly functioning states\nPeople are voting with their feet these blue states\nAre deep populating every single blue state as depopulated and then you have several of these red states where the populations are booming and there's a reason for it because in our country people go vote with their feet and they're leaving\nNew York and New Jersey and Illinois and California for places like Florida and Texas so why destroyed Texas [noise]\nRhonda scientist for governor ladies and gentlemen Florida please give 'em all the support tree can run the same time we sold our armed forces police officers firefighters or an emergency personnel\nAnd fall of you I'll see you tomorrow God Bless\nPossible health introducing new Medicaid plans in Virginia and hoping you get the most from your Medicaid benefits were more likely to go family care dot com that's go family care dot com ... three three four six seven eight to five nights for Medicaid plans from up to my health\nWas cut your college football\nMostly non temperature ... prefer that one of my camera county falling into seven ...\nFrom the studios W ... high orange or anyone should be\nAnywhere you go on the eye heart radio at\nSmaller search area I'm Lisa like Sarah Fox news federal and local authorities now looking at Florida as an area of interest as they hunt for the person or persons responsible the series of suspected bombs sent to several high profile Democrats and the other day one was down to address the actor Robert Deniro package\nBureaucratic nightmare of an investigation going on merely to target their political enemies that's the whole purpose of it they now have\nMobs in the streets mobs on the Supreme Court steps mobs on Capitol Hill me in the halls of Congress\nThey pretend that they're not mobs\nAnd then when there was finally the first time that they think they have an opening to whack a finger at the other side over instability which remember it wouldn't be the instability of a mob it wouldn't be the instability of an entire movement it would just be maybe\nOne wacko\nWho is sending what increasingly looks like yard bombs\nTo very very prominent Democrats and leftists and\nThey want to lecture all of us and they claim that they're not do it which just goes to show you how much gas lighting goes on in our conversations with the left I I Will give you examples of as we will spend a\nBit of our time this hour working through just how dishonest the left is being with all of this just how delusional they really are\nBut I didn't want to spend them with you first on what we what we now know about uh about these bombs in fact I could have it it's just hear from the attorney general my buddy Jeff Sessions like with a please\n... apartment is responding to the suspicious packages that have been sent\nTo several political leaders and a media outlet in the last last few days yesterday I spoke with FBI Director Chris Wray and\nAnd deputy director they about it and we met with in brief the president to bring him up today FBI ATF are working on this for a profit ministry ration we condemn the actions that led onto a these ... these activities and the\nStrongest possible terms on terms\nInto determined to make sure that we get to the bottom of an injustice was done\nThey will find who is responsible for this I'm very confident of that\nI don't know how quickly though and I don't know if it will be in time for us to make a fully informed decision us being the American people you and I already know this doesn't if it doesn't affect my vote doesn't affect my feeling about Trump\nOr the Republican Party or anything else this has nothing to do black safety threat\nIs one\nVery very stupid and ah and agree\nJust an evil jerk I wanted to use another word but we're on radio\nUm who is going to spend the rest of his life in prison it's just a question of how soon we put him through that process but the judge bombs that have been found so far no good\nThey have gone off could they have detonated under any circumstances\nThere was a press conference today with the NYPD in fact one of my uh some of my former colleagues were named in the press conference I had a bit of nostalgia but they talked about how the bombs that haven't gone off and kept getting asked the question by the press are they real bombs or the ... the M y pd is going to have to\nSay you have to treat these as real threats because just imagine for a moment that the largest police department the country's as no these are these are\nThe odds and then the next suspicious packages that goes out whether it's by the same person or not but look similar person opens it up and goes well I Know what to do it and then we have a tragedy someone loses limbs site\nMaybe dogs from one of these pipe bombs or the NYPD can't take that risk not yet I Can't say that these bombs wouldn't have gone off under any circumstances but I'm here to tell you that I think that is increasingly likely to be the case\nAnd if that is in fact what's going on here let's just take a step back I Know I'm not supposed to say I know I'm not supposed to\nGo there but then again I actually professionally did this on like Ninety percent of the clowns going on MSNBC and CNN to talk about it and in the past when they've tried to tell me if those places what is and it's not real when it comes to terrorism or they have\nTended to get bucks slapped rather hard here's what I see\nIf you were trying to come up with a means to change the entire national conversation away from Kavanaugh which was toxic for Democrats in red states and Democrats in states where Democrats were struggling the Kavanaugh debacle self inflicted wound was toxic\nAnd the caravan making its way up through Mexico the far left active is when the Democratic party loves this story ah but the people and places like Indiana and Tennessee and Nevada who are figuring out who to vote for gas what they don't much like the idea that the Democrat Party\nIs effectively an open borders party\nPrivileges certain people from certain places of the world getting around the rest of the immigration system because it benefits the Democrats electro prospects they don't like that and so if you wanted to switch that narrative if that was the purpose it has been master fully achieved here\nNow is it in fact possible\nSome would even say probable I'm I'm not quite there yet I Need I Need more evidence is it possible a problem this is one\nIncredibly stupid reckless and a ... and really her doing whatever side he thinks he's on doing tremendous damage to it is it possible that this is somebody who wears a mock a hat and and loves Trump so much they thought that the way to\nThe way to show support was to violate hundreds of federal statutes threaten people terrified people and in the process put himself in a sure fire\nA position to be spending the rest of his life in federal prison is that possible absolutely that's possible I'm not discounting that at all we may find out that that is the case\nHowever\nAm I willing to discount am I willing to push aside that if this was in fact somebody whose purpose was to change the conversation right before the midterm I don't think anybody believes this is a coincidence in terms of the timing\nIf the purpose was to was to push aside conversations that were damaging for the Democrats and in the process make the anti Trump media seem sympathetic and\nGive them something to talk about that might sway some moderate to their side just in time the election would this be a successful strategy yes I Am talking about a false flag strategy\nI'm not saying happened I'm saying would these things all be true if this were a false flag answers obviously yes\nSo that's why I'm unwilling to just discount this out of hand and that's why I I refuse to take the position that well because the left has already started not just to blame the right for this but to blame the president of the United states for this\nThat's where I think we have to draw a very hard and fast line the Democrats have created not alone but primarily predominantly\nThey have created this vicious toxic political environment they have never thought\nFor one moment there was anything decent are acceptable about Trump they wanted to remove him from office I even had an author on impeachment on my on my TV show or in the week you said yeah this is the first time ever that there's been impeachment talk for a president who had not even been sworn in\nThey have a mass delusion problem they're having a collective nervous breakdown in slow motion over Trump and his movement\nAnd that's why things have become so tense and so nasty and so vicious so would one individual change that dynamic no we\nWill hold our final conclusions until we have more evidence but in the meantime\nI'm leaving open all reasonable options and some that the Democrats want to shut down or a long way from deserving that got a jam\nPacked show off it's not just the bombs that I by the way so uh I I Want you to be sure you stick around we'll talk about Megan Kelly ousted from NBC ah what that tells us about the culture right now by the way I don't really\nHave much to say about NBC ... and sweat neck referred to the OJ for possible conspiracy ally around the cabin all thing we got a lot a lot of stuff\nTo get through so we'll be right back views radio by\n\nDo you have something you want to say but feel you just can't express it especially on today's social media perhaps it's because you don't have a safe place where your opinions matter and where they can truly be hurt that's why I'm happy to tell you about a new alternative media site Snoopy dot com\n... is an unbiased platform that's all about conversation and community Snoopy not only encourages freedom of expression it guarantees its users the ability to discuss topics freely to express thoughts frustrations and ideas without any suppression front administrators\nShooter its founders vision it's a place where discussion is value and where we can all feel free to say exactly what's on her mind especially the things that make us frustrated and downright Snoopy it'd be dot com is free to join an open to all why not jumping let your opinions to be heard no shadow betting no character limit no suppression of conservative thought ever\nDays you just succeed that tolerates violence or the threat of violence as a method of political intimidation co workers your or control we all know that there is one\nOr the settler disagreements it's called peacefully at the ballot box the media also has a responsibility to a civil to stop the endless hostility and constant negative and oftentimes false attacks and stores\nNow I I think that the president should be completely allowed to say that but that I think you know some of the statements that he's made have set the meaty off even more because they they think they're in charge and they have the power to just construct\nA narrative here they think that they're allowed to just say the president is the reason this is happening and everyone has to say you know what you're right\nThe media has spoken that's the way it's going to be they they like the John Brennan version of events play six\nUnfortunately I think Donald Trump too often has helped to incite or some of these feelings of\nAnger and violence um when he points to acts of violence or also talks about [noise] you know a swinging at somebody or from the press the media hoping that this is going to\nMake it clear to him about what he has done here to for as far as a lot of this rhetoric\nReally is counterproductive\nIt is on American is on American says the guy who was a senior intelligence officer who without any evidence\nHas accused publicly accused the sitting president of the United states of treason which as we know is not just a crime that is a pro scribes view the constitution itself but is punishable under us federal code by the death penalty out so one would think that John Brennan is not exactly\nThe best person to be carrying the torch of civility now but then again one would be mistaken if one thought that the left hand any decency or any honesty to deal with your sleep ranges making a name for himself being the craziest Volpe liquid seven\nThis is someone who has a weaponized Trump's Twitter feed and made it into a hit list what we've seen to date is someone who whip up the crowd he is addicted to their response and their response they are addicted to his\nUm betrayal and while he might think that he's just putting on the TV all you need is one person\nWho doesn't realize that and one person who thinks it's okay to do this someone tried to murder Iraq and Michelle Obama bill and Hillary Clinton and this is not a coincidence\nSo now Trump is responsible for any single individual psychopath in the country that takes his words to mean something there not\nAlso did believe brings forget that just a few weeks ago Donald Trump junior [noise]\nHad a white powder sent us home and his wife open didn't had to go to the hospital [noise]\nIs that just not as important to the left as judge bombs being sent to people I I guess the answer is yes we'll get into this more stay with [noise]\n\n... what's new today on the free I her radio our heart\nCan fight the ... film tracks with labor in spite of we've got the cat everyone's talking about like\nThe famous people ... the Joe Rogan experience and make sure you voted for the first ever I her radio broadcast toward to show your support for your phone now if I get bored [noise]\nHere in college a former NFL Super Bowl champions signed the most important contract of his life to serve in the Army National guard\nNational Guard was a perfect fit around a lot of military my friend was part of what are my family's up for a long time I want to go out there make a difference I Want to be a part of the bigger somewhat self I didn't find that in the normal day to day life I didn't find that working behind the desk or real life being hands on and being a soldier was something that we can react to Jimmy outside in\nThe best environment that are craving that I knew so much and then the opportunities are marketing having served my country was just icing on the one in Boise idaho I Want to be home and National Guard during the opportunity to right where I was served my country and like here in the festival for a real why Bush planes in the last two and my\nDad I was fortunate enough him up our voices I wanted to get helicopters don't want it it is perjury Army National guard gave me a chance to fly helicopters and fixed wing aircraft\nTo learn how to be part of the Army National guard log on to the national guard dot com sponsored by the south Carolina Army National guard here by the south Carolina broadcasters association at this station the\nKey is holding the line for America bugs accent is back\nMorning America is different than less extensive plot to kill US government officials and prominent American history took place it targeted here former presidents their family cabinet official members of Congress and the free press the objective\nApparently about illegal spokespeople for the view of the Democratic party [noise]\nIt was a tack on reporters and on democracy itself [noise]\nPeople will say you can't blame the president for something that twisted personally to that is true that president they ... they didn't ...\nSorry for the last ... name and kill\nThat whole thing sounds out [noise]\nUnderlined American values and ... those are fair to say it caught up in Canada that type of favorite area the kind of race and politics and political party\nAnd it has the potential to lead to what the hell happened yesterday and we don't even know how far\nAre obvious question is does the president bears some responsibility obviously not for the the bomb making or or the or the recipients of but does he bear responsibility for the tone that allowed it sure\nSure he does and it's part of the reason why I never endorse them and I've never been personally critical of him about it yeah it does bear responsibility for the divisions are as the biggest megaphones\nTrump they say is not responsible for the bombs but he is responsible for the bombs\nThat the formulation that you get here from the anti Trump left that's really what they're saying I don't I'm not going to tell you that the reason this happened is Trump under saying that Trump is one of the reasons this happened this is why people despise the press the press deserves to be despised Russia's full of a bunch of self important\nCry babies and liars obviously not all people I'm In the press technically but a whole vast majority fall into that category and they have completely jumped the shark here\nOr there not waiting to find out who's responsible for this they're not even putting this on conservative ideology you're on the right in general\nThey're going right to the president this is yet again another attack on the president folks this is trumped arrangements syndrome that we are seeing\nThe president that states is a sponsor of this guy's sending bombs to all these people were so so I just need to understand the president's not allowed to criticize rock Obama's presidency not allowed to make fun of Hillary Clinton not allowed to say anything\nNasty about Eric Holder and it is that now the new standard if President Trump were inciting violence meaning you should be violent against people or here or violent acts you should do then he would be guilty of inciting violence I Know\nThis is the ... you have to talk to them like the first graders so to some of the first graders lifting 'cause you're smarter than lives but that's what you have to do you have to walk them through this\nNone other than a Mr fake tapper himself over CNN Today tweeted out that in response to Sarah Huckabee Sanders saying that the first thing the media did was blame Trump he said that's not the first thing\nWe evacuated CNN which is true in terrible on CNN should not have had to be evacuated because nobody should have ever threaten them and that's an awful thing but then he went on to say no one blames from not one person at CNN\n[noise] uh no that's not true\nAnd I know which half or would you because he likes this game he'd say no one blames Trump for the bombs oh okay that's right no one thinks that Trump was in the west wing putting together these bombs with his bare hands or whatever okay we're in the east wing no one thinks that what's happening but they're all saying including the president of the CNN network\nThat the environment around all of this\nIs from creation Trump's fault and the environment led to the bombing so in essence\nFrom does have responsibility for that is what they're saying and that's exactly what Mika Brzezinski did because I think her audience that's the end at the MSNBC\nDemands it you know the intellectual honesty be damned they simply do not care it does not matter to them\nThat what they are doing is indefensible that it is wrong on so many levels to talk about divisions in this country as though they're a bad thing and then two in the next breath maybe even in the next sentence maybe even in the same sentence\nSay that those are the\nWas that anthrax was at rice and am I going to live what will when my children think who will take care of a she had to have all those thoughts because of some psycho leftist\nYes\nOr mail bomb in a mail room is horrific and illegal and wrong but if we're really going to talk about who's responsible you're maybe we should base it on the facts and not just allow the left is wild speculation to score cheap political points\nWhen you to hold them accountable we'll be right back Rush Limbaugh\nWe have to bring use radio five sixty WVU the [noise]\n\nThe FBI calls home titles that's one of the fastest growing crimes my friend's brace yourself if you've ever had your credit card stone it's nothing compared to the hell you're in for when a feat steals your homes title everything's online these days including your home settled domestic and international thieves\nHunt American homeowners because we have equity in our homes and the bad guys are stealing it they take you off your homes title an add an alias then they borrow hundreds of thousands using your homes equity and stick you with the payments you won't know until you get a late payment notice\nIdentity theft programs and insurance policies don't protect you\nHome ... safeguards your homes title from cyber thieves and hackers by putting an on line perimeter around your homes title\nThe instant they detect someone tampering with their own it to shut it down for pennies today home town of luck protects my most valuable asset my family's home you needed to register for a free now says you have your homes title has been compromise that's a hundred dollar value free visit home titled rock dot com\nI think that the time and money and your business than to be attracted that talent when it did was your office that attracted him pulling today's workforce once in office act as noble an active it they are very desk standing desk solutions ... creating active where states were employees\nHappier healthier and more productive dairy products require little to no assembly for free and come within thirty days risk free guaranteed all married that product at ... dot com slash radio that the ... are I guess dot com slash radio\nHow does one never missed a customer again when customers call ... ... email expressed to me automatically engages them with your digital content simple text flyers coupons menus priceless video audio or anything else expressed to me it's much like sex codes but with voice and email too and more\nContent options without high costs or complexity learn more today at expressed to me dot com expressed to me never missed a customer again that expressed to me so I just discovered [noise]\nPresidents and it continues to point out contrast the policy between Democrats and Republicans people absolutely have the choice to make\nA on what they believe in and it couldn't be clearer and we're going to see that happen and the next couple of weeks when the election St place and the president's going to continue to lay out that case but at the same time we're condemning violence and calling on all Americans to come together\nThere's a difference between I comments made an accent take and the president is certainly not responsible for sending suspicious packages to someone no more than a Bernie Sanders was responsible for a supporter of his shooting up or Republican they fulfill\nThat should be pretty pretty clear line right\nThe standard here isn't some big shock it's not some huge surprise it's not something that we need to take a step back from an ... hold on a second ... how do we how do we do this how do we deal with this right you are not responsible for what someone else does because of your politics\nYou may be responsible for violence if you're directly incite violence and that's why even with our First Amendment there are some exceptions for incitement to violence right if you're in front of a big crowd and use a burned down that store across the street and then they burned down that store you or morally called the Boeing and legally\nLiable for that matter\nBut if you say I think we should have lower taxes in this country and then someone hears that and they run down and they light the IRS building on fire you are not responsible for that okay because if that were the case I\nThink about how that could be abused think about the way this would expand the hecklers veto think about how that would shut down discussion and debate\nAnytime somebody wanted to discredit a political believer ideology all they have to do is have one person yes that's right and false like fashion\nAct like a complete idiot\nAll they have to do and that everyone says oh see see that and it's just common by the way you see this with this is a a continuation of a debate you have with radical Islam\nThe left will always rush to say that radical Islam is not in any way representative of Islam and then any jihad or jihad is aren't representative of the broader Islamic faith that they will say that\nAnd then when you were responsible hold on a second I mean who are you to who are you to to declare what isn't is not Islamic member Obama sat at the un future does not belong to those whose land or the prophet of Islam one of the strangest things us presidents ever said and that kind of form a but they'll fight tooth and nail on that one meanwhile if some guy\nYou know somewhere who's white named Billy Bob\nUh says something mean to somebody and and says something racist or whatever to someone and commits a hate crime that one incident is magnified it did it by the media is oh my gosh there's look at all the hate in this country\nLook at how hateful we are there's three hundred and twenty million of us want an idiot somewhere did something bad but he's white and male and on the rights of that means that the right has to own this whole thing\nBecause because one guy said something racist because one racist incident when is it the exception when is it the norm this is a very important perception game that the media engages in all the time\nAnd this is where we can't we\nIf you have any ground we do not have a political culture that embraces mob tactic intimidation and violence similar to what the ... we just simply do not\nDoesn't matter that there's one incident this one individual has done this this has been roundly condemned we ... ... ... there's not a single conservative of any standing anywhere in the country who was at anything other than this was disgusting this person should spend the rest of his life in prison or work with persons\nIt's probably one guy but we'll see\nWhat ... you'll hear well there's no there's no such thing as mobs really there's no problem with getting up in people's faces and yelling at them there's no reason to demand civility when you're dealing with a political party that his show on on civil in his ideas according to\nPeople like Hillary Clinton [noise] the less as radical off [noise] we are the ones who are holding the torch of American values and freedom and western civilization in this country they're the ones who are kicking us a low during walls of all of that [noise]\nDo not forget that for one moment in this debate that we're currently having in this country\nDo not let the left get away with the wives [noise]\nI was visiting with book about his show on home title fraud with retired FBI agent demonstrated a crime dislike everywhere is called home title fraud\nIn a simple because all home titles are kept on line in fact the FBI guy and home title walk found the title to bucks family's home they forged id and showed him how easy it is to transfer title and lose your whole had of been real who's the foot of taking out loans using books comas equity\nThey wouldn't even have known until late payments or addiction notices showed up in that identity theft protection we have\nIt does not cover titled fraud look if you own a home or rentals or have elderly parents\nGet home title lock for pennies a day home title look puts a virtual barrier around your host title the instant they detect sinister activity their own and helping to shut it down they don't title may already be compromise you know sign up and get a free title scared and report\nMy friend Sean Davis over at the federal is has the following quote Grassley is criminal referrals of ... and sweat Nick also contains new evidence that sweating it has a history of making false rape charges\nUnder penalty of perjury an ex boyfriend says she explicitly threatened to falsely accused him of rape and have him\nDeported\nGrassley has criminally referred ... and sweat next to the D. O. J. the FBI for three specific felonies conspiracy to defraud the United states oh barring the over broad but\nGot to show both sides live under it um favorite tool of Muller\nMaterially false statements to federal officials and deliberate obstruction of a federal investigation\nWow\nOh yes this needs to happen I think ... ... is a serious and very powerful guy in the Senate\nAnd this referral is going to be tough to ignore the department of justice is going to have to look into this and that\nMeans folks that there could be unlike the proceeding that the left was so excited to use to try and smear Kavanaugh which was not\nA standard criminal proceeding right there they could not subpoena people they could not uh take their phone records it by the way they're no phone records to take the allegations were from thirty five years ago or whatever it was just the whole thing was insane and I'm so I'm going to say this I Am so proud\nOf what we did hear on the show me and bike and John the whole team and all of you supporting me when that was a really difficult a couple of weeks especially in the early days we knew it was garbage and we held the line we kept their shields Hi yes we did\nWe held the line on this one and people notice by the way\nThere was a front line on defending have it all and we hear in the freedom that we were on that front lawn publicly in every possible way I was in contact with the White House team I was trying to get in through the confirmation on a near daily basis\nSo um\nThat Grassley is not passing this thing up and saying okay you know we'll let bygones be bygones is the right move and this could this this will mean that the OJ now has the ability\nTo pull records\nYou know they they might be able to see some communications perhaps between sweat making other people but you know this ... you want to play in this game you want to try to lie and get somebody ruined and smear them you're going to sign\nRidiculous sworn statements with no corroboration that nobody would be able to tell you yes or no I mean the whole thing\nIf they can prove she lied if they can prove ... he was part of a conspiracy for her to lie they must both be criminally prosecuted the law either matters or it doesn't there's really not a lot of room\nFor interpretation here if they can prove it now there is the possibility that they won't be able to prove that sweating collide because her charges were so vague or the statement that she swore was so vague I was at a party in the eighties and there were gang rapes and I think maybe Kavanaugh was near the punch maybe he wasn't\nBut then again she changed her testimony publicly from what the sworn statement was which is when we all knew that this was not just a fix but an obvious fix my dad was when it was clear to anyone paying attention okay this really is\nToo much this person has a problem this person is ill is sick so um and that's where I think we are now\nBut if they they're they're going to try to do two things on the left now because by the way they really don't want can you imagine if Julie sweat neck faces criminal prosecution for what happened there what then we're supposed to think what the other two women just they were the ones that were really attack but Julie sweat and it just came out of nowhere to lie\nI think about what that does to the narrative\nAnd I am very clear on this one for if you can prove somebody makes a false criminal allegation against anyone they must suffer consequences because they are doing violence to the truth and they were trying to ruin someone's life is an attempted ruin nation of the human beings life that must be punished\nGail magnum I told you this this was the uh the stripper who claimed with Mike knife on that despicable district attorney down in Durham North Carolina that the Duke lacrosse team raped her it was a complete fabrication a total live she claimed the guy was raping or who was miles away at an ATM machine and they had him on video\nBut when using his card there so kind of hard for him to raping her when he's a few miles away a complete fabrication they didn't press charges against her they did just ... and he should have gone to prison for a long time but they just disbarred and\nShe went on to kill her boyfriend starving to death later on maybe she should have actually had to deal with justice supports you should have had to deal with justice\nPerhaps somebody would be alive today not only did Kavanaugh survive and therefore due process survive with him through this process but if we really do care about truth and decency and justice in our system if we care about due process\nAnd the right to protect your reputation the right to face the acute to face your accuser the right not to be destroyed at the political whims of the left for their convenience\nThan people who lie in order to destroy you under oath must be punished\nThe left is going to kick in scream over this one because it's a very bad look for them they know it now will they be able to prove this I Can't say quite yet\nIs it clear to me that sweating it as a liar absolutely absolutely\nI as I Know she's a liar and not just based on statements he made a base in the contradictions overstatement if you don't say I think someone's spiked punch at a party\nWhich what what would that even mean that was such a crazy thing to say in the first place he spiking punch he's drinking the punch how would you spiking the punch\nHe's gonna he's going to poison or very or get super drunk all of his male friends too so that they pass out and can't move\nThink about that she didn't she didn't say spiking of drinks spiking an entire punishable that everyone drinks yeah maybe he was putting alcohol in it so that everybody could have some alcohol but he was the whole thing it's just it none of it rang true it was a fabrication out of this woman's mind she's deranged she'd deranged I mean\nIf you want to be our be giant now and ... ... ... a message by ... by heart radio the national Highway Traffic Safety Administration project yellow light noise and the ad council\nScary David if you like me you probably think gutters are very expensive well the big box places yeah\nNot so that was all states the most got ours they could put gutters on most houses for less than twelve hundred dollars\nA matter of fact you mentioned you heard me talking about him you'll get forty percent off on general editor protection right now\nAll states the most gutters with a lifetime guarantee on got our protection their maintenance free all states the most gutters local yelled at half the price of the big pitch companies protect your home by cutting all states the most gutters eight three three five gutter online all states the most gutter dot com it took\nWhat kind of on the while McCain debate here in the dining room with the band\nMeaning\nDon't miss your chance to win W. V. O. C. and all states seamless gutters one hundred thousand dollar phone home makeover think of the possibilities one hundred grand to spend on your home how ever you'd you\nEnter for chance to win now at W. V. O. C. dot com using the word home and let the remodeling begin that's W. V. O. C. dot com key word home W. V. O. C. and all states seamless gutters one hundred thousand dollar phone home makeover\nPowered by lifetime cabinets and counter tops solar to from writers illusions Carolina pool tables plus and all states seamless gutter\nHello this is Keith Karimov with shape and furniture shortly after Jennifer and I got married I was introduced to one of her family's annual traditions Thanksgiving at grandpa Nixon's house in the north Carolina mountains tell them about a gym\nWell here all the cousins aunts and uncles I gather there and we lived right four wheelers mountains play into enjoy each other's company the guy's ... pet outside and as we gathered around the table to gather highlighted\nThe week in the ... on that huge to start the meal\nThose are great memories what were your traditions look like this year maybe this is the year you finally get that dining table that everyone can sit around whether your family as big or small we've got great news three Saturday November third are dining furniture is on sale\nCape and financial giant sail and it's going on now take twenty six to exit Ninety One in shape and and not for the big red chair [noise]\nThe weather in South Carolina ... even the most season whether I'm guessing about what tomorrow might bring out complex human error we never leave our customers guessing our technicians will identify the right thanks for every age ... problem we\nStop until the job is done correctly and that's the problem is we ain't\nIs your eighth limping to the finish line this summer having something you can get much of a break with winter on the way that you can have more on planes before it leaves you out in the cold winter time going between heat and air conditioning to write you and your system crazy\nIf you find yourself in need some help\nUs a call and we'll train technician not extreme fails ... plumbing heating and air than any one home at ... won three five seven\nMen\nIf you've got a whole new roof or you need a whole new roof you need to call mid state roofing three five six Ninety Nineteen for nearly a quarter of a century mid state roofing has established its reputation as the leader in the roofing industry whether it's above your head or atrophy perhaps a leaky foundation\nThree five six Nineteen Nineteen is the number to call for all your roofing and water proofing needs the quality craftsmanship of a mid state roofing system\nAre tops in the industry especially commercial and industrial roofing system\nIf you own or in charge of a large building warehouse or industrial facility\nAnd you're in charge of that roof and at some point a roof is going to need some attention so the number to call for advice of service result and a commitment to customer satisfaction is three five six Ninety Nineteen see all the mid state has to offer when you click on mid state roofing dot com tell a mid state twins\n... rather than take it'd be\nThree five six Nineteen Nineteen md stay roofing dot com\nCarolina faces civil Saturday Night or the FCC network set ready with the best getting caught coverage on news radio five sixty W. B. O. C. [noise]\nThat was you know because when it comes to the fight for so long never saw [noise]\nThat's what we intended it and I think that presence\nHarry ... can have a link to Congress country kind of tired of carrot and any kind of in our country and well they returned home\n\nOkay that's true but but but but\nThey're being coached along the way they are\nBeing told exactly what to say all they have to do was establish a record and that just means saying they don't even have to\n\nIt's it's sort of switched around it used to be that Central American immigrants at the border would would would lie and say they were Mexican because if they were going to be detained and sent back they didn't want to get flown back to Central America because they spend a lot of time and money often\nDo you get to the border and so they would rather just be released back into Mexico you their Central American but now that's changed because of this asylum claim situation and as long as as long as they can\nI'm\nConvinced a border patrol agent or a few border patrol agents and the uh immigrations and Customs Enforcement process that they are from Honduras um they're going to be part of this asylum deal right they're gonna get brought in and\nLetting the injured the United states and uh as I've been telling you that's not going to that's just there's never going to be real enforcement alright what can be done about this I'm not going to have a bucket or whatever\nThe issue the ultimately the thirty thousand foot level Congress needs to change the law so that it is very clear that asylum the the need to change the asylum process so that you apply in your\nIn your country or in the nearest country you can get you out of a U.S embassy and there's a process as it should not be that you just present yourself\nIn this way out of port of entry\nUm because you're in walking within walking distance the United states that's not that's not the way that this law should be but ah as important that there's something called a safe third part said third country agreement\nIs well I like to tell you things on the show that you want to hear from other people because I actually read lots of things and do lots of research because if you were kind enough to spend your time with me I have a mandate to make sure that his time well spent team\nSo the safe third a third country agreement would mean and we have one with Canada by the way so this is not some cream crazy concoction and we've we've discussed\nThe possibility of this uh at the government government level with Mexico but what it would mean is that we would set up\nAt the border but on the Mexican side of the border and were you yes we would probably have to pay for this and I was a book they should they should pay for it will go a lot faster and much more effective if we pay for it we would set up a centrally trailers you know a a holding facility sounds like it's not attention facility but it's\nA what would be somewhat similar to a a refugee camp situation it would be a place where people you know they have uh they're they're able to stay safe there's water there's food um but it's on the Mexican side of the border\nAnd we would move infrastructure down to the border so that you have\nAt port of entry courts so you would start would move the judicial infrastructure to deal with these immigration cases right down to the border\nAnd people that were waiting for their adjudication ... so that would speed it up obviously and people that are waiting for their education process would be on the Mexican side of the U.S border which means that they don't\nOr that they're not able to just go further and further and ensure United States and get some you know the immigrant rights lawyer to represent them pro bono to keep suing the federal government all the rest of it if their claim is denied guess what\nThey they get to stay in Mexico or or the Mexican government then can can hand them off to their country of origin I put that way you prevent what's happening right now which is using the legal system and it's very important we understand as they are not illegal immigrants\nThey may cross illegally so then they are in the U.S illegally but at the moment that they say I have a credible fear of my safety these Honduran immigrants\nGo into the asylum process and then there are due process\nAllows them to stay in the United states that is the law I've talked to senior immigrations officials about this is talk of lawyers about this that's how this works so we need to take action here beyond just working on force along the border that's great that's a good start\nBut if you have this caravan of seven thousand that gets all the way even if it's only a thousand that gets to the border this is going to be they're going to keep doing this they're going to keep doing this it's the best most effective way to get around the legal immigration system\nPercent chance yeah I had a line to allow anti that there is a ... percent chance at the bike I say that I find all it all the things that are going on to care that I'm a little attached to that at all I have a I think the cat and two it's like an incredibly\nSpecial ... can get to the border I'm at you know on a day ... again that's that's not right in fact I think to have to understand ... light pole\nSo okay\nI mean Bruce or Mike right I Want to bring you as an as an impartial observers here you know you can tell it's a little there's a little bit back and forth but I mean there's nothing to do crazy there right now that's a good conversation that is exactly the guy's a spirit of conversation\nAnd then things get a little a little more tests like Ninety\nThere was another way that's had the Democratic party is comprised of\nRacists white liberal that is correct\nI write the slight well let's go back and and like fat people on the ... are not aware of what's called ... part of this conversation that I Am concerned about the color and the White House um why why it lets you asked that question\nThere has to think about like I said well why why we got to laugh at that's why don't you ask that question for that because they care about that\nBecause you're bringing home credit that young African American leader so I found that that's something I talk about opposite of Atlanta with light levels don't realize that you put on\nTheir way of caution that they are I Am also a guy who had any place if only on how they're going to crash it that way I look I football had any kind of social that way for her that will shameful\nAnd that was fine that will show anyway I don't agree with that if I don't let the little quaint and high school or after a while I thought that a practical matter of fact I Try to challenge Congress ... surrounded\nBy way [noise]\nYeah I felt like I got a little like I look at their word yelling it was civil but I felt like a little bit\nTension there producer Mike yeah definitely it was fun I like watching it and I like looking at the [laughter]\nThis is the this is a problem whatever whatever we have a segment like this\nAnd I'm like well that's not really the ... the show every book shut up people are funny [laughter] I'm like well wait I thought I thought we were the trust tree I thought this was a mess that it I think we're all going to supposed to like you know block slap each other and I'm not even in a bind there there's more there I'm like okay because the control room because it kept going beyond replay their their\nControl rooms like we've got to go to break we got to go to break it I'm like okay we're going to go to Chris was like no not done I was like damn okay here we go\nSo uh yeah it was a spicy spicy one day\nWe'll get we'll get producer Michael one of these panels man and oh man my could we do that absolutely right yeah the bosses would never be the film that would be the same again buck I Know exactly what Mike slap slap so be like new truck bomb it like being left living\nI'm real quiet it on assuming tell them not yeah no no he's for your do your your feisty and I know the Irish are I'm I'm ... I'm One one thousand Native American but I'm half I'm good thanks thanks right see I I Want to make sure that we got producer Mike in with\nThe with the objective opinion there because you know for me it's like I mean I obviously ideologically agree with Candice I'm and I I think that she's very talented and but I also am very ah very fond of Christ all even though I think that her politics or\nOr I'm\nWrong [laughter] so you know we were just it was it was quite an exchange there and\nUm we'll see it tomorrow I'll give you a little preview later on in the show with the expectation is for a for tomorrow there might be I might be involved in a\nA shall we say more more spirited discussion tomorrow of things I might be the one that actually has to do a bit of a a bit of debating well we've got a\nI don't know we don't really have time to get to the ... ... the funding to say the man that guys\nThat guy's been treated\n... says well you know we we can actually do a little bit of it so I interviewed Papadopoulos weird this one today\nAnd here's what he said about the notion of Russia collusion play twenty\nGeorge what is what are your feelings now that it it has come out it's been a reporter here at the hill that there was a exculpatory evidence based on your conversation with an FBI informant that you weren't trying to do anything wrong that you oppose any trees in our collusion that that information may not have been presented to the Pfizer court what do you think about that\nOf course has for me it's a it's a very sad that it was I was impressed with John's reporting but for me it was a sad day to see that uh that was not presented to the price of the court\nAnd that in my entire image has been characterized by this false narrative that I Am some sort of patient zero uh about a Russian conspiracy and a a Russian a Coca Cola collusion conspiracy when in fact I have absolutely no Russian contacts whatsoever\nI've never traveled to Russia I don't speak Russian I don't even have Russian American friends are in this country so um when I found myself at the epicenter of this a conspiracy as somebody who actually has no rush of contacts something just to not smell right at all to me\nGeorge Papadopoulos who\nRemember when when it looked shaky on Carter Page you also had nothing to do with collusion or conspiracy running this stuff but it looks shake\nIt in his owner Papadopoulos that's how the FBI justify this investigation that that it was supposed to be Papadopoulos I'm telling you people who believe that Papadopoulos was\nPart of some of some crumbling back conspiracy will believe\nAnything don't believe anything ...\nNorthern rational person could sit down and look at the facts talked to this guy and come away with thinking yeah that's right he was trying to throw a presidential election that\nIs utterly insane orderly and said there's just no\nRationale to write all other than it it it explains for some people or gives them an outlet for their anti Trump rage and anything that gives them an outlet for anti Trump raged they are in favor of so if\nSomeone will tell them that there was a massive conspiracy to undermine the election everything and they have to believe that this total Patsy I don't mean that in a mean way seems like a nice guy\nYou only got a fourteen days and job we've got a felony on his record now which stinks owning a firearm no voting harder to get a job you know can't leave the country probably usually have a travel restrictions he's got and and also I I don't like that when he talks to me about this there even restrictions as part of his plea agreement about what he can say publicly\nI don't I don't like that you should be able to discuss any aspect of your case once you're once you're through the system there shouldn't be a gag order on you know once your your case as you know once you've served your punishment in your case is done but there was one on him [noise] so it's a battle thing which is nuts and he was testifying today on Capitol Hill which is why we were\nTalking about um better but it's the whole thing is just totally an orderly\nBonkers bill um\nAnd I don't know how anybody can sink\nWhere they were a year ago and there's just\nSo quarter period or Papadopoulos global book no no\nTotally orderly wacko let's talk about Megan Kelly getting fired what happened\nFolks don't get caught up in one of those Tommy corporate coffee brands okay start your day with a delicious cup of freedom\nIs the way to get fired up and ready to take it to all the lives in your life and by the way once they try black rifle coffee they're also going to know that they've been wrong all this time they don't need to drink that pajama boy green soy macho latte nonsense\nThey just need a delicious cup of black rifle coffee is how I started every morning\nAnd I got to tell you I distribute my black life okay cups all over the office it's a great way to make friends and bring people into the freedom revolution you need to join to go to black rifle coffee dot com slash book\nYou'll get Fifteen Percent off your order\nForget what ever coffee or drinking okay switch it up\nBlack rifle coffee dot com slash book\nFifteen Percent off your borders you can have it delivered to your door this is your coffee company you just don't know yet once you try though you will agree joined the coffee or die revolution black rifle coffee\nIt's one of the most successful bridal of Mm\nMe down here what are you a yellow butter and that being an issue like Steve well uh what are you doing in my mind your sense of ... [noise]\nDuring a traffic and weather reports mornings just radio five six\n\nI in fact there were other people doing the job before that we're getting better ratings and we're making a fraction of her salary people on them but executives at these\nPlaces these are big public companies places you know NBC and NBC Universal and they're owned by big paramount or big a parent a paramount parent companies and uh\nYou know they can they can determine what the salary is right that's I guess we've got shareholders public companies lots of ways to slash the money around without any Bruce or Mike oh no no no my kids in sixty nine mill none of them like I Know that for now that's her severance I'm In a year in salary that's for her full they're paying out her full contract that's what that sixty nine\nMill is I'm I'm Talking about you know the uh\nThe year to year so we should make a lot of money but if they go oh she really worth that answer was no\nUm you know they some of these people will get in touch with the corporate structure at these places and they get huge huge paychecks but anyway\nSouthern Megan Megan a had a few bumps here and there I forget exactly what they were but she oh she brought up a Jane Fonda is plastic surgery which I didn't realize Jane Fonda would be so sensitive about but she was and it was kind of a weird thing to bring up in the interview on the circumstances\nAnd that was kind of a bomb for a you know for her to bring up in that way just wasn't wasn't smart\nAnd anyway\nThe latest controversy which has gotten or ousted got booted from NBC\nWhich remember she gets booted right away for this folks you know special sex dungeon door closed by button under the desk Matt Lauer guy was there for decades and\nWas the the the chosen one I mean the the face of that network twenty million dollars plus a year I think it was actually making more like Fifteen when he was twenty five million a year they're paying ... unbelievable sum of money for a skinny balding we'd who was completely replaceable by about a hundred different people but\nAndy lack in these people that NBC make decisions like Matt Lauer that's all you have to do they like you you're good you know\nIt's not about the ratings it's not about the audience really what the what the exact thing in the in the east wheat or the C suite the corporate suite east we should be the way it's called so Megan decided and our segment on Halloween and political correctness\nDecided to tackle the subject well that was the subject and and here's what you let's start with what she said that got her in trouble John Cleese place that clip\n[laughter] you'll get in trouble if you are a white person by the time or a black person if I thought why we\nLike I Can't that was okay as long as you were trying to find that character trait and there are places in New York with the land as she is Diana Ross and she made her scandal darker than it really is and people said that that was racist\nAnd could she wants to look like an around one day I I don't know how like that that rate ... hollow\nSo\nShe didn't say anything racist what she said was that she doesn't think that\nPeople necessarily dressing in costume when they dark and their skin to be in costume should be considered racist now you could agree or disagree with her I Would note that a lot of you probably liked the movie Tropic Thunder I think it's a very funny movie I think the best part of the movie is\nUh what's his name Morton Downey junior right at the guy who plays Iron Man and that his name William ... what's his name again you guys leave me out here to dry well what is the name John\nYeah Robert died Robert and I'm more Robert Downey Jr and Robert Downey do more than ... yeah Robert Downey junior so\nSo he uh you know he ... he was in black face in that show I mean and that's a movie he was\nHe was driven by protecting me black men in black face and they make fun of it during the movie and it works and everything's pretty much it's a funny movie\nYou know there was no picketing there are no people freaking out about it at least not really and a movie did pretty well actually so there are situations in which culturally black face has not been deemed to be a insulting and racist I I just named one now I also can understand why given the history of\nSlavery and segregation in this country in the way people use to dress in black face in in in ... [noise] excuse me in mockery\nAh that that would be offensive to some people I I get that I'm not\nBut I'm just saying that she is not even really taking a definitive declared his position on all the she's just trying to have the conversation\nBut because she veered away from black face under any circumstances is racist is wrong is terrible really any darkening of the skin as part of a costume is racist and wrong and terrible NBC\nJust I mean they had different anchors coming after NBC just fed her to the wolves on this one\nAnd then that led to this which I always find\nSo depressing and and the whole thing is always so sad the Soviet style show trial forced apology\nI'm here is what she said in an effort obviously to keep her job one that was doomed to fail before she went on the air please play her apology\nShall I Megan Kelly and I want to begin with two words I'm Sorry\n[noise] who made her they answered a we had a discussion here about political correctness at Halloween costumes and that conversation turned that whether it is ever okay for a percentage of one race to dress up as another a black person making their face later or a white person making errors darker can make a constant complaint I defended the idea\nSaying as long as it as that was a respectful and part of the Halloween costume it fooled okay\nWell I was wrong and I am sorry one of the great types of sitting in his chair each day is getting to discuss different points of view and as I talk and sometimes I listen\nAnd yesterday I learned I learned that given the history of blackface playing an awful way by race it in this country it is not okay for that to be part of a costume Halloween or otherwise\n\nNow I could have told her magazine called me up and I have a soft\nSpot for her because she used to be nice if you know started my career and having on her show and used to tell me that I was very talented and had a huge future and that I was amazing when I filled in for Rush Limbaugh and I was you know her favorite of all the Rush Limbaugh feelings and and you know so so I have a secret soft spot maybe not so secret anymore from Kelly I'm just going to be honest about that okay I Do\nEven though I think that she turned over people and bitter horrible decision by going to NBC and was ungrateful for positions you had at Fox and all that okay fine I would've advised her because\nI understand how this game is played now because I have to deal with it from both sides and no one's paying me tens of millions of dollars\nNot even anything in the universe of that to do this kind of work that once you're in this kind of a gym you can't you can't take the oh my gosh I throw myself on the mercy of the politically correct court\nOh my gosh please please just just let me keep my job I'm so sorry I'm so sorry because there has been a a very clear shift\nWhere now when you upset the PC police now when the social justice warriors come for you you have two choices\nFights and go down fighting or enjoy ritualized apology humiliation and then let\nThem take your head those are the choices that's it\nAnd maybe you win the fight by the way maybe you're able to defend yourself and and see it through and but I promise you if you do the oh my gosh mayor cobalt I'm so sorry I'm so terrible I should never have thought such with a number to then it just\nGoes gee it's like a ... that's why I said it's a Soviet charge for all this is you've you've signed your confession now you're definitely guilty now they definitely have to destroy you now they absolutely have to\nRuin and they will\nHow Megan did not know that is\nI don't know beyond me she should have known that\nShe absolutely should have been aware that they wanted to get rid of her anyway her show's ratings were not strong the NBC audience was not warming sure she's not a morning show host this was not her go oh I Know you don't really care about all that but the political correct part of the social justice war aspect of this\nAnd how she came up against them it's a reminder to all of us\nWhen you have aired unless you feel a personal moral obligation to apologize to an individual\nYou don't apologize do not apologize to them up to not say\nYou know it lets you truly believe that you have ... I don't think you will appease the mob unless you have trends grass in your own mind unless your\nOwn honor missed sets the tapes apology and then you'll just deal with the consequences but do not think that this is now the penance is the apology oh no no no the apology\nIs the news that they will hang us that's how this works the apology is signing your own confession and the court so they can lock you away in the gulag that's\nHow this works\nThis notion that there is\nEqual blame on both sides yeah there's blame on both sides but there is not equal blame on both sides of the political climate in this country are ... Trump making fun of journalists who are the most pompous preening overpaid annoying people on the planet as far as I'm concerned Trump making fun of them\nIs not tantamount to a fascist state\nMeanwhile people reporting we're supposed to be serious journalists reporting on the existence of a creeping fascism because of Trump they are doing very real damage\nTo our ability to have any kind of political discussion in this country and they're obviously enhancing the likelihood of there being ugly incidents with all the stuff that we're going on so I I just I refused to play along the way that they want and say yeah you know what all sides have a problem here\nHow Trump even ... this is something I Want to I Want to leave you with on this and\nThen we got to talk about Hillary in a moment you're getting ready for it it's coming\nHow could Trump even comply with what they're saying here let's say Trump came out and said I won't use enemy of the people anymore for the media I won't say that any more\nDo you think that then they'd say oh okay that's reasonable\nYeah you know Trump toning down the rhetoric I guess he's not such a bad guy after all I Know I I guess I guess we gotta let it\nEven though they would do that you know that's not what would happen that's not what they say they would say oh that's not even a start to this oh he's so terrible they just want to hate him they don't really want him to change his behavior even if he did change its behavior wouldn't really matter to them\nIt wouldn't matter so I'm\nJust note that by the way you know one one little sudden I'll throw in there\nI've never really cooked bone and pork chop before and this\nWeekend I'm hoping to actually give it a try I went to a butcher especially Bush or and got a couple of big thick bone in pork chops I Want to make a little spice rubbed for them married them overnight tried to sue the my cast iron I miss talking to you all about my corner adventures it's been a while and I haven't had the time to cook recently\nSo this is the I'm going to try to bring this back because one of those things that when it's done right I just think some credible is they shared\nA shared bone and pork chop is something special as you can tell I haven't eaten yet and I'm doing\nThis radio show and I am quite hungry\nThat's what got me my mind my mind shift to deport Joplin because I'm starving and it's been a long day [noise] um but we do have to talk about Hillary coming up your and then roll call and then maybe I'll get this year and myself a pork chop so much more important stuff coming up so they wouldn't be doing [noise]\nBuilding a deck planning a tree or installing a sprinkler this season whether you're hired professional we're doing the work yourself called eat one one\nMore quick SCA one one dot com at least three full business days before digging local utility companies will be notified to mark underground utility lines under the dating site so you know where it's safe to be calling eight more one is a\nFree service and it is the law this message is sponsored by South Carolina eight one one aired by the south Carolina broadcasters association and this station [noise]\nMilitary matters of eating scientist at the Pentagon secretive research lab once seniors insects for good to protect crops from natural disasters such as drought flooding\nAnd disease the idea is to use insects that deliver\nViruses that contain genetic treatments for class Dr Blake ... is a program manager at the defense advanced research Projects Agency better known by its acronym DARPA she says safeguards had been put in place the insects have what we call kill switches\nWe didn't just ask for one kill switch we didn't just ask for to kill switch as we actually asked for\nThree Dr ... says he's program is intended only for peaceful purposes but in a recently published article in the journal science a group of European scientists argue the program could violate the biological weapons convention and easily be weaponized for hostile purposes something Dr ...\nDenies there's a part of the biological weapons convention that actually encourages work like that\nFor military matters at the Pentagon Lucas Thomas in Fox News\n[noise] with only a kite husky and wet hamstring\nBenjamin Franklin captured lightning in a bottle over two hundred and sixty years later with a little resourcefulness\nIngenuity and\nWe're not only capturing energy from the sun\nWe're storing ensuring Americans have the energy they need [noise] whenever [noise]\nHe's holding the line for America bug sex is back\nJean what can I Do that will uh brighten up your day a little bit it's been a tough week for America ride no question about it the market's\nBeen getting battered obviously we've got these uh bombs getting sent all over the country people are being nasty to each other there's mobs everywhere and\nAll that stuff right what can I Do that will just bringing all home and make us remember you know what it's all going to be okay um well what if I told you that Chelsea Clinton's\nThinking about running for political office I see what I did there that's right I got you ready for one thing and then I pulled out another how part Joe ...\nShe is thinking about it which means she's got to do it she's gonna do it\nFolks she was talking to the journal news\nAt a stop on the tour for her new children's book starting now you can make a difference just just try to you know she she really needs more cash she lives in a ten million dollar apartment in New York Her mom's worth a hundred million her husband is a hedge fund guy but you know what what whatever kind of cash crabs you can go and that's right having children's books ghost written for her\nOh man oh man\nIt's amazing she Chelsea said quote I think if someone were to step down or retire and I thought I could do a good job and it match my talents I'd have to think if it's the right choice for me\nShe added she doesn't have any plans to run for office but it's something I think about as I Hope every young person thinks about first of all no\nI Do not want put put aside Chelsea Clinton for a second here why put aside or Chelsea and just know that not every person not every person should be thinking about running for office at all okay there's there's a really very limited number of people that have the kind of\nA thick skin temperament\nSelf aggrandizing attitude and yes that feel called to serve but increasingly I think politicians are mostly megalomaniac um there there is an increasingly small number of people I think that really should do this and\nI think that everybody should I like this is where I Want to talk about term limits I mean this is just this notion that we have the political class that we do and they just stay in power forever is because the system is set up to the people that determine what the system is staying power but maybe the conversation about term limits will have to wait for another time\nI just think that the Chelsea Clinton the notion that somebody would want to vote for this person who's never had a real job\nA and who was sort of let's not forget according to even some leaked emails with star very poorly at the uh you know the foundation the bill and Hillary and Chelsea Clinton foundation where she was supposed to be a\nTime you go on line [noise] your Internet provider in advertising companies can track what you do and so your personal information [noise]\nPlus the NSA gobbled up virtually everything so how can you protect yourself computer experts recommend using a VPN mellow software I use called express VPN makes its super easy for anyone to stay private on line\nThey're rated the number one VPN service like tech radar now these days I don't use the Internet without express VPN express VPN apps take just minutes to set up and afterwards runs seamlessly in the background on my computer and smartphone\nYou installed the program and turn on express VPN protection with a single click\nThat's it couldn't be easier and it protects your privacy expressed VPN secures and makes anonymous your Internet to data encryption and hiding your IP address that means nobody nobody can record or access your online activity\nSo if you want to protect yourself from hackers spy agencies and your ISP visit expressed VPN dot com slash mark that's E. X. P. R. E. S. S. V. P. N. dot COM Express VPN dot com slash mark and get your special\nOffer their special offers three months free three months free with a one year package don't risk around online data anymore keep yourself and your information private from everybody does it expressed\nVPN dot com slash mark today [noise]\nThis guy Andrew Gillum I'd like to call Mandy going just because I'm sure it makes them upset and I like to make a left is upset\nHe's got other problems folks there's breaking story this evening this is from the Tallahassee Democrat I'm telling you it's the local newspapers they really are covering this race correctly\nFBI undercover agent paid food tab for Andrew Gillum fundraiser documents reveal let me tell you a Florida particularly you independence haven't voted yet or thinking about it you get a guy here who is under investigation for his entire governorship if you'll elect\nHim as your governor because this guy was taken freebies left and right you know about the Costa Rica trip you know about the Hamilton ticket you know about the hotel in New York City these things are worth thousands of dollars\nBut here's the breaking story tonight by the Tallahassee Democrat and undercover FBI agent posing as an Atlanta\nDeveloper seeking to do business with the city of Tallahassee where he was mayor Gillum\nPicked up the catering bill Frey twenty sixteen fundraiser for mayor Andrew Gillum nascent political action committee forward Florida\nThe pack would eventually become the war chest of gallons gubernatorial campaign it is the first piece of evidence linking the ongoing FBI pro to Gillum broader campaign for statewide office and that stuff's trickling out trickling out not due to the scientists campaign or the Republicans\nBut due to one of the people whose caught up in this lobby\n\nThe emails and receipts released friday today as part of a supplemental records requests from the Florida commission on ethics shows that the agent the undercover FBI agent Mike Miller was invoice four thousand three hundred and eighty six dollars by one oh one restaurant in ... lounge\nA restaurant owned by lobbyists Adam Corey at the time to this guy Korea's buddies\nOr was would Gillum\nAnd email exchange shows that Miller paid the bill and Gillum sent him a personal thank you I didn't say thank you note or for the food now Gillum has been a line through his teeth all along about the extent of this investigation and he knows the extent of the ... investigation\nIt's been lying about the extent of the FBI investigation he's been lying about his involvement and corruption in\nThe city of Tallahassee and it is corrupt\nAnd today again he's trashing police officers police officers that are forced to to to draw a weapon\nEven a taser well\nThen they've blown it according to him\nA month after meeting Mike Miller this is the FBI undercover agent for breakfast that the power plant cafe or at the Edison Corey that's the lobbyists and lifted the undercover agent to help foot the bill for a fundraising dinner recordings house on behalf of columns gubernatorial campaign I'll keep it", "show_name": "The Buck Sexton Show", "year": "2018", "city": "Columbia", "day": "26"}