{"month": "10", "state": "MN", "station": "KZSE", "content": "Programming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n[noise] the world comes at you fast on air on line on your phone at all things considered we cut through the clutter and take you beyond the headlines there's more to every story listen every afternoon\nWhen it comes to coverage of Saudi Arabia in fact most of the middle east reform is only\nOn the horizon and WNYC in New York this is on the media I'm Brooke Gladstone\nAn argument over what constitutes identity is renewed\nNative communities say a DNA test does not make you one of them their voices don't seem to matter who we are as people in a number of is not important we are only tokens that help most Americans feel comfortable when\nThat's been stolen but when the legacy of slavery shore new entirely of your\nDNA can be a marker and consolation if you know nothing at all the ability to even be able to get a genetic in France is still a in a lot of information\n\n\nLive from NPR News in Washington I'm Barbara Klein Russia is threatening to retaliate if President Trump follows through on his decision to withdraw from a long standing nuclear arms control treaty\nTrump says Moscow as long violated the agreement Moscow accuses the U.S of doing the same NPR's Geoff Brumfiel reports\nThe intermediate range nuclear forces treaty was signed in the Nineteen eighties when the Cold War was going strong it eliminated nuclear weapons that the U.S and so we\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\n[noise] I go out and weapons were not allowed to put arms\nControl experts warned the U.S has little to gain from withdrawing from the agreement and they fear it could be the beginning of a new arms race Geoff Brumfiel NPR News Washington\nOn Capitol Hill lawmakers from both parties say they do not believe Saudi Arabia's explanation of what led to journalists Jamal ... g's deaths at the SETI consulate in Istanbul this month\nAnd several are debating possible sanctions Republican Senator Rand Paul tells Fox News Sunday a one hundred ten billion dollar arms deal with Riyadh should be canceled\nI don't think arm should ever be seen as a jobs program bar on our arms are military arms the sophistication arms are part of our national defence these are some things that are just owned by private companies are owned by the country and I think we should never sell arms to any country unless it's in our national security interests\nThousands of mostly Honduran migrants are continuing their trek northward after swimming or rafting across the river at the Guatemala Mexico border after trying to stop them Mexican Mexican police are letting them pass\nIn North Africa hundreds of migrants have charged a border fence that separates Morocco from a Spanish enclave Lucy a benefit as reports one person died but about two hundred and made it onto the Spanish territory\n[noise] video shows the migrants walking down the street in a celebratory mood right after crossing the migrants who died is believed to have suffered from a heart attack the two Spanish enclaves in North Africa ... I separated from her up\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nEntry point for migrants crossing into Europe as a mid October forty seven thousand four hundred and fourteen migrants had crossed and sustained by land and sea for NPR News I'm Lucy ... in Barcelona this is NPR\nSupport for news comes from the lawless foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the arts for everyone ideas that last foundation dot org\nFrom Minnesota Public radio news I'm Mike mowing the feller Tim Walz enters the final two weeks of campaigning with the lead over Republican Jeff Johnson in the race for Minnesota governor\nCongressman Walz is up six points over Johnson the Hennepin County commissioner that's according to the NPR News Star Tribune poll of eight hundred likely voters which has a margin of sampling Arab plus or minus three and a half ... percentage points\nThe results reflect a slight tightening of the race for about a\nPoll a from a from a poll out the month before\nAnd they're still twelve percent of voters who describe themselves as undecided meaning either candidate could come out on top\nMinnesota schools are getting more help for students dealing with mental health issues over the next three years providers across the state will receive more than thirty million dollars in state funding to offer treatment in public schools Claire Wilson is an assistant commissioner with the department of Human Services\nShe says well funding has steadily increased over the years there's a need for more money she said they'll continue to press for additional dollars\nCash and there was that clear commitment on the part of the legislature and governor killing the Sunday and they glance um unfortunately it was an alternate lay included and uh\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAccess to mental health provider\nHistory buffs are getting a new look at St Paul today is a series of historic walking tours moved to the east side\nUrban geographer bill into key leads the free tours which started earlier this year along the bluffs below the cathedral of St Paul he says a century ago pedestrian access through the city was much more extensive and they said he connected many neighborhoods with long public stairways\nYou starting a four mile walking toward the east side later this hour to look at stairs around the ... brewery district they're kicking off at case and pain avenues\nThere's about four sets of public stairs that are still existing in the area but there's also a bunch that have disappeared over the years one of the fun things to do is try to be a staircase detective and trace out where stairs used to be a when people used to walk more in the neighborhood\nWhen the keys free tours climbed the remaining stairs and follow bluff lines through the area and in sports in the Minnesota Vikings lead the New York jets biased or twenty seven to Seventeen that game late in the fourth quarter and the twin cities right now fifty five degrees this is NPR News it's three oh six\nProgramming and supported by the Fitzgerald Theater bringing the radio experience to the stage with programs like live from here with Christie late talking volumes and films that defense more information is on line at Fitzgerald Theater dot org\nFrom WNYC in New York this is on the media lot guy feel this way this week I'm Brooke Gladstone\nThe time you hear that it's more maybe known about the October second murder or Saudi journalist juvenile show does she mean lie on the ... first published by a pro government Turkish\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nMove towards a form of already got a crown prince Mohammed bin Salman al ... who was often seen traveling alongside the royal\nThe New York times is reporting one of the suspects as a frequent companion of ground\nThree others linked of a security detail but of course there's the forensic Dr reportedly carrying on phones saw\nDonald Trump Saudi Arabia's public relations work for\nMatch the information is given from his own intelligence agencies\nAnother head scratcher is why in for so long the American press\nSeemed to be doing the Saudi royals PR work to thirty two year old Mohammed bin Salman the crown prince bitter noon as an B. S. arresting many of his own cousins in a sweeping crack down on corruption\nGuarded as one of the most conservative countries in the world [noise] Saudi Arabia is an authoritarian absolute monarchy women's rights are dreaming limited [noise] but under NBS [noise] things are changing rapidly\nHe is emancipated women introducing music in cinema and cracking down on corruption\nIn effect he's leading a revolution from above\nIt's a farming characterization that Jamal cut show she disputed in an interview with NPR earlier this year\nHe has no interest in particular the full he thinks he can do it alone and he does it really any cult that opinion do you want to share those changes in Saudi I Need to\nBe with him as New York times media columnist Jim route and Bert noted the NBS moniker has taken on a grim new meaning for what he refers to as the flood didn't set of Washington\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nIt's an election year from Minnesota as you choose to US Senator or governor and attorney general and the state and federal how [noise] keep up on and\nMeet the candidate and he didn't finish at NPR News for slash elections\nThree twenty here I'm Minnesota Public radio news more about the media coming up like ... looking in the hour and a good position to win their game against the New York jets today up twenty or thirty seven to Seventeen and\nLate in the fourth quarter and oh by the way Adam the lenders over one hundred yards again time the NFL record for most consecutive one hundred gay one hundred yard games to start a Steven season with seven this is NPR News\n[noise] this is on the media I'm Brooke Gladstone over the past decade Elizabeth Warren has become a progressive ...\nPerhaps the most powerful voice among the progressive right now I'd love to live with me and my friends I Love her to be anything I Want to be a female goes off and on\nBut the senator has struggled with the personal issues since she first ran for office in two thousand twelve\nThis war I Want to start with questions about your Native American heritage knowledge that you listen to yourself as a minority in a faculty or directory in Nineteen eighty six you continue to list yourself or in those days\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nWe are so my brothers are my family just picking up a box personal family lore small set of data points and yeah the ones on which warns opponents most notably President Trump announced she set\nBecause their votes were Hi was it and did that she was Native American in July he escalated I won't give you a million dollars for your favorite charity paid for by trouble if you take the test of the shows you earn it here\nThis week Warren responded by way of a five and a half minutes pre campaign video in it and she speaks with Carlos Bustamante a Stanford genetics professor who examine to DNA\nAnd the hunger genome we did find five segments from Native American ancestry with very high confidence taxes yeah that's what we have a Native American ancestry and you're better\nThe response was probably not what Warren had anticipated she\nCame out and thought she scored it first showed in the media and it sort of the men and got old Trump pay off the million dollar bet at all of a sudden now she is at war with the Cherokee Nation saying that are used to the DNA test is inappropriate and quote undermining tribal interests\nBoth the right and the left appropriate accusations that she's not native enough\nThat she is reinforcing biological essential Islam that she's falling for a Trump trap before the midterms that she's trying to claim native identity without ever defending native issues that she allowed a university to use her to bolster its diversity bond of five\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org\nTo learn more and more out in the world and we meet people and they said oh you're native oh my great grandmother was Cherokee our first response was to try not to roll our eyes\nKim tall ... is a professor of native studies at the University of Alberta and author of Native American DNA tribal belonging and the false promise some genetic science\nThis story for us has a much longer time line that I think many Americans understand\nElizabeth Warren's appropriation of native identity despite her disclaimer is I don't mean to sound cliche\nBut everything that's taken from indigenous people will be an actual land and resources or be it you know an image that can be marketed and used for a football team or taking claims to ancestry and making those part of the identity that one is a spouse into the world\nOur understandings of kinship and family and tribe or not governed so strongly by the idea of having distance unnamed ancestry\nWe have a much stronger sense of what it is to be Native American that is governed by our family relationships by lived social relations that matters to us\nWe now in the fifties Watson and Crick discovered the double helix structure of DNA\nAnd ever since talk of blood is lineage and fate\nHave given way to conversations about mitochondrial DNA and all the rest at the same time there are old metaphors that persist you can still be related to either by blood or by marriage so talk about how the contrast\nProgramming is supported by Huawei WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. dot org\nAbout something like blood quantum these are fractions on paper that point to very particular ancestors the ... at the turn of the twentieth century distributed hundred and sixty acre parcels\nOf land to heads of households and of course only men and settler ideas a family at the time to be has a household\nThey would get another eighty acres if they had a wife women become economically tied to men that's not how it was in many indigenous communities women were not economically tied to men\nAnd then the man gets another forty acres for each child but in order to manage those land allotments you had to have a register of Indians well tribes and first nations and other indigenous communities and didn't necessarily have lists with names of their people and they can these are fluid kinship groups right\nBut now we live with the legacy of those registers and that's how tribal enrollment has govern ... what we care about is proving that you are descended from somebody on the base role that was constructed during that time\nAnd by the base role you're talking about families that were listed at the end of the Eighteen hundreds yeah\nYou see on the back of my traveling rolling card that I'm One thirty second this one's sixteen this one quarter of this tribe those are all particular ancestors that they're pointing to that one quarter shy and Rob a whole blood quote unquote is my grandfather Randy tall there it's not as if blood the physiological substance is being examines\nWe're really talking about symbolic blood and were pointing to named people and so this is the problem with Elizabeth Warren taking a DNA test that's pointing to some distance probable unnamed ancestor that nobody knows who they were affiliated with or who they were for us it's who's your mom who's your grandmother who's your\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA and he'll S. dot org\nRole you if you are descended from somebody on the base role\nBut in my tribe in addition they have a requirement that you must meet a total one quarter Indian blood quotient they will accept the blood there's always scare quotes around that word from multiple tribes so even though I don't have one quarter quote unquote Dakota blood I have shining a rabbit hole blood\nThat's where you begin to see the racial inflection I think\nSo my daughter if you were to calculate all her ancestors because I'm supposedly Thirteen thirty seconds Native American my daughter would be one half of that because her father is non native\nNow if my tribe decides to move to a one eight total Indian blood rule instead of one quarter my daughter and her a couple of cousins who can't get enrolled will be able to get enrolled and we debate this every year we've got you know debates and conversations on our reservation should we go from one quarter total Indian blood down to money\nAnd I think eventually we will you do see tribes across the country moving away from a blood quantum standards more towards ... percent rules to try to make our rules more inclusive but that's up to us to debate we don't need the rest of Americans telling us what we should do and how colonized we are by race everybody's colonized by race\nTribal governments and tribal communities are doing the best we can to try to tweak those rules to include our traditional notions of kinship but within a structure that has been deeply shaped by colonial power word severe power imbalance with the U.S federal government\nDo you think that Warren was basically played by Trump drawn into this because it doesn't seem that she got any kind of educational our financial advantage by\nProgramming is supported by why WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more I'd YWCA M. P. L. S. subtle word\nIn the New York or you know all the things that Trump loves to talk about in order to defend herself against his times you know\nI don't think he has the intellectual ability to play somebody who is as intelligent as Elizabeth Warren ... I mean really I [laughter] she has for her entire life like many people in Oklahoma and the south and in the east of the U.S [noise]\nYou know certainly for African Americans even though there's very much a historical and understandable desire to\nBe able to lay claim to identities that are not just about race has cast mhm it's also the case that particularly in a place like the United states and twenty Eighteen that's deeply polarized and becoming\nDeeply racialized no one is making fine distinctions and the workplace\nAnd the housing market between forms of African ethnicity or whether or not someone is deemed to be just black or white and what those racial identities experience as they are entitled people to you or don't entitle people too in the world\nAlondra thank you very much it's a pleasure to speak with uber\nAlondra Nelson is president of the social science Research Council professor of sociology at Columbia University and author of the social life\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nThe twin cities on me [noise] on\nThe media is supported by target preventing future at heart upon cast on change makers and the projects their championing and communities nationwide future at heart available on apple pie cas or wherever pond caster found\nTwo and a half weeks before election day survey after survey shows healthcare is the issue voters care about most and Missouri Senate race has boiled down to a debate over covering preexisting conditions I Would never dream of the answer there\nIs taking away some of the most popular things that the Affordable CARE Act did I'm saying let's start over all the next MORNING EDITION from NPR News [noise]\nTomorrow morning from foreign 'til nine joined us from MORNING EDITION here on NPR News it's three forty one you're listening to on the media\nThis is on the media I'm Brooke Gladstone the double helix structure of the ... rival nucleic acid or DNA was discovered just sixty five years ago but mankind has been playing with the notion of what makes us who we are for millennia\nTwins especially played a prominent role in ancient miss allergies the founders of Rome remiss and Rami list twin brothers raised by a giant wolf\nCaster and pilots have twin brothers who's Gemini forms sparkle in the night sky the birth of twins has been interpreted as good luck and as bad\nAnd they themselves as two halves of the lightness and darkness of our nature that's never stopped you see\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nAnd convicted of plotting to kill her twin sister could be granted parole\nAs vehicles for conflict serendipity and comedies of error\n\nSo if if your mom is a sign [noise]\nAnd my issue I guess\nAnd we're all going on our brain laughing\nDoubtful\nWhat's when partners in crime are doing\nBut beyond mere novelty multiple births can provide scientists deep insights into the age old argument between nature and nurture\nA documentary released this summer three identical strangers tells the story of triplets David Eddie and Bobby adopted by three different families and studied under highly unusual circumstances spoilers I head\nThey separated these boys should [noise] parents had never been told that there were two other children what was the ... how could you not out there trying to conceal what they did from the people who did it too when you play with him and she did something very wrong\nTo come up with something was\nThe secret study orchestrated by psychologist Peter New power to examine how three distinct parenting styles might shape identical triplets weird apart not until the boys met by chance\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nUniversity at full attend the unruly study was likely inconclusive and definitely cruel\nWell I think this was a very unethical study keep in mind that even though in those times the practice and was it and you don't encourage contact but nevertheless these children were never told they were twins and most of his adoptive parents who are hungry for children would have gladly taken too\nSo to not tell people this very important aspect of their background I think is just horrendous it's really beyond my comprehension and either\nBecause being a twin is a very important part of one's identity ones knowledge of one's medical history and I can tell you that having worked with hundreds of pairs of twins raised apart just how happy they are to have met and how regretful they are they lost all those years together\nTwin studies often capture the public imagination but none quite like NASA's twin study which tracked the genetic profiles of two astronaut brothers one who spent a year in space while a twin lived on earth ... had a few with this Scott\nKelly and Mark Kelly are the only identical twin astronauts in history but following DNA altering space mission they may not be identical anymore\nOr you're in faith has already made got two inches taller than his brother ... seven percent of Scott's James did not return to normal after he returns on two years ago\nSo they're no longer identical twins that space travel altered genetic expression it did not older than the end they physically itself\nProgramming you supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA ... started a word\nLike schizophrenia or multiple sclerosis or diabetes you'd expect that the correlation should be about one they have the same genes but it's close to the forty fifty percent\nSomething has to trigger the expression in one and keep it quiet and the other an identical twins where it apart or identical twins who different some weight and help us find these environmental effects that might help us control and managed disease [noise]\nYou've profiled other twins that have been shaped by extreme events could you tell us about the subject of your book accidental brothers\nAccidental brothers follows the life history as of two sets identical male twins who are born a day apart in Columbia South America in Nineteen eighty eight one pair of identical twins was born in Bogota the capital city and the other born in a small remote town a hundred and fifty miles to the north\nBut one of the little babies up in the north needed immediate care at a good hospital so his grandmother brought him down to Bogota\nAt the same hospital as he got the twins were born\nAnd somehow an amazing twist of fate got exchanges one of the other twins so the wrong baby was brought back to the small town a week later\nSo they were essentially raised as two sets of fraternal twins when in fact they were unrelated and they didn't know this until they were twenty five when the brothers up north moved to Bogota\nAnd somebody confused a twin and one pair for twin and the other\nI went to Bogota two times to study them and they are wonderful guys\nAnd there were similarities in many personality traits between the ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nReally popping out and the medical life histories are amazing the one twin born in the city and raised in the city was basically symptom free as was his identical twin brother raised in the north\nThe other twin who was raised in the city who was not born there had a long list of medical complaints as did his twin brother up in the north so even the different environments and the different access to medical care did not make a difference in their medical histories and physical health which I find quite extraordinary\n[noise] so what does this tell you about nature versus nurture it was too small a sample I Know\nBut yes but it's a very dramatic case and so we told me a couple of things\nIn terms of the abilities one could certainly see that not having access to education left an indelible stamp on those twins but I Will say that one of the twins who was raised in the small town who should have been raised in Bogota", "show_name": "On the Media", "year": "2018", "city": "Rochester", "day": "21"}