{"month": "10", "state": "GA", "station": "WNGH", "content": "Anyway and later today American Life is tonight at seven on\nG. P. B. and she'd be news dot org serving village of ... and beyond his G. P. B. and Eighteen station service of Georgia Public broadcasting under dos and it's a minute before two o'clock film that gets underway and with political rewind it at three o'clock\nOh and this is Jean ... and Eighteen stations service of Georgia Public broadcasting under a minute before two o'clock bill not gets underway and with political rewind it at three o'clock it's fresh air on gp B. and B. news dot org\nSupport for TB comes from you our listeners our reporters have been honored with national awards for public radio news directors incorporated for our use of sounds soft feature and our coverage of breaking news thank you for your support which allows us to keep you informed about stories that impact your life\nAnd show your parts of Georgia you don't otherwise hear about killed on us to bring you comprehensive coverage of the state check out our Web site at gp news dot org TPP news stand with the facts\nOf Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. role portable Georgia Public broadcasting radio network [noise]\n\nLive from gp be news this is political rewind I'm Bill Nye today the latest pre election polls continue to predict the Democrats will make wrong games in the U.S house and may take control\nWhat will a national blue wave leave Georgia's democratic congressional candidate\nTo rent it out at the Brian ... Stacey Abrams get a food from out of state visitors Elizabeth Warren urges metro Atlanta voters to turn out for Abrams Donald Trump junior rallies UGA students for camp [noise]\nA Senate committee for setting your uniform days for the ... full state wide\nAnd it gets to mediate pushback from educator and why does democratic lieutenant governor candidate Sarah rich Jimmy goes sites the meat do movement and talking about Brian Kemp the agency's Greg's Lucy and in our panel joined me with those stories and more after the news [noise]\nLive from NPR News in Washington I'm Laurie London bringing catastrophic wins in a life threatening storm surges category for hurricane Michael has made landfall between St Vincent island and Panama City Florida\nIt has intensified with sustained winds now up to one hundred and fifty five miles per\nHour just barely shy of becoming a category five Dolores ... from member station W. U. S. T. as with emergency management officials in Panama City the storm is\nDolores ... from member station W. U. S. T. as with emergency management officials in Panama City\nThe storm is finally arriving here in Bay county where officials are telling me they've never seen anything like this to hit the Florida Panhandle hurricane Michael strengthened overnight and officials are warning people who did not evacuated to stay in place now and do the best they can to protect themselves the worst is expected to come throughout the day with the threat of storm surges and floods\nMichael is expected to remain a hurricane as it moves over central Georgia early Thursday meanwhile the federal government is coordinating with all of the states in the storm's path\nNPR's Windsor Johnston reports emergency response teams have been deployed along Florida's Gulf Coast in parts of Georgia and the\nCarolinas speaking alongside President Trump at the White House federal emergency management agency administrator Brock Long said Michael is a hurricane of the worst kind\nThe diameter is who is pretty wide which unfortunately is not good news is it may also some people may say similar to the three tornado making landfall in areas that are close to the\nPresident Trump has declared a state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response is Windsor Johnson NPR News\nThe director of the FBI says the bureau supplemental background investigation on then Supreme Court nominee Brett Kavanaugh was limited in scope but they followed standard procedure is NPR's Ryan Lucas has more of\nThe art director Christopher Wray is defending the bureau's background investigation of new Supreme Court justice Brett Kavanaugh rate tells the Senate Homeland Security Committee that the FBI followed its usual processing conduct in the investigation\nAs standard the investigation was very specific and scope limited in scope is the usual process my folks have assured me that the whole process was false\nRe also says that a background investigation is different from a criminal one he says in the background investigation of the Supreme Court nominee it's the White House that sets the parameters not the FBI the set of confirmed Kevin out to the Supreme Court last week after a bruising and highly contentious confirmation battle Ryan Lucas NPR News Washington\nOn Wall street stocks are on track for their biggest loss since April the Dow is down four hundred and twenty five points the NASDAQ falls a hundred and sixty two ...\nTheir biggest loss since April the Dow is down for a hundred and twenty five points the NASDAQ falls\nA hundred and sixty two NPR\nLive from the GB news from good afternoon Andre Dawson just ahead it's political rewind with Bill nugget but first in the b._b._c. news as you just heard hurricane Michael made landfall within the last three minutes in Florida as a strong category for storm that is bad news for South Georgia as gp be Cindy hill explains\nHater bands are already rolling three parts of south Georgia bringing gusty winds and heavy rain National Weather service meteorologist keep Feldman says Michael will be a hurricane well inland into Georgia\nThat's going to result in a lot stronger when they were expecting one or two days ago and it wasn't expected a strong which is also going to result in a lot more widespread outages in a tree down across the state\nHe said conditions in South Georgia well worse than after we had in the afternoon ... than Cindy hill\nCongress has approved a bill to improve the nation's ports dams and harbors protect against floods restore shorelines and support other water related projects\nThe massive water resources development act would authorize billions and spin things were projects nationwide including harbor improvements in Savannah and extend the federal program to improve drinking water quality\nThe bill also sets up a new framework for large water projects run by the U.S Army Corps of engineers\nThe changes are intended to increase local input and improve transparency Senate approved a bill today sending it to President Trump for signature\nAnd although Atlanta United one it's weekend game last one of its key players ... Elmer on has a hamstring injury from Georgia News Go to G. P. B. news dot org and follow us on Facebook and on Twitter\nSupport for NPR comes from NPR stations other contributors include me in makers ever go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more and go to meeting dot com\nAnd that listeners who support this NPR station [noise]\n\nTo political ... for being with us today we're understand that an awful lot of you who listen to this show regularly are down in South Georgia and in that area of the state number of areas of the state where in some cases you are under an actual hurricane or what\nThey are down in South Georgia and in that area of the state number of areas of the state where in some cases you are under an actual hurricane I'll watch you know there is you have tropical storm watches\nAnd if you've been listening to G. P. B. radio throughout the day you know we're staying on top of all of this bringing you bulletins as we get weather alerts you can go to ... be news dot org and stay updated\nOn what's happening I Do want to talk a little bit about the storm before we get into the political content of the today show 'em but let me introduce a panel first Greg loose ... political reporter for the Atlanta Journal constitution is here thanks for being here Greg glad to be\nA doctor Andra Gillespie a political science professor at Emory University is back with a microphone in front of her Hi how are you going to\nMarry Margaret Oliver a state representative from Decatur is with us again a today back from New York\nAccent or had a great time good good I Wish this weren't a weather related show because I Love to talk to you about seeing Kenny Leon American sudden his brand new Broadway Harry Washington on a pretty good pretty good and there were ten and black a long time or a\nBundler fundraiser for major Republican candidates for president United state's US Senate to 'em on down the ticket hire a five to ... and also I I always forget to say and former chief of staff\nFor former governor Sonny Perdue correct okay um so the governor at noon today to talk about this weather situation for just a few minutes grey cat a news conference ... ... ... an emergency preparedness news conference\nTalked about how the state is getting ready what you were there what can you tell us\nWhy activated Fifteen hundred ... George national guardsmen he extended the state of emergency to another sixteen counties now covers about a hundred and eight counties boasts of\nA south middle Georgia and in parts of north east George even as well now um and said basically get prepared hunker down he did not order any sort of mandatory evacuation says he trusts Georgians to side that for themselves to be prepared and be prepared for extended power loss after the storm which could cause additional problems\nBefore we went on the air ... told me that ah the storm hit the hurricane hit a landfall near Panama City with winds of a hundred fifty five miles an hour which puts it\nAbout a mile less than a category five storm so this is a very dangerous\nA hundred fifty five miles an hour which puts it about a mile west bend a category five storm so this is a very dangerous storm and it's going to move through as you've been hearing throughout the day and many news reports are just going to move into south Georgia very quickly murdered murder\nUm and so basically I Would need to see a difference between um a camp and Abrams of up about forty percentage points actually I think uh maybe smaller than that\nI'm In order for me to be able to say definitively that that's telling me anything so I'm gonna chalk this up to sample size and that just kind of a lego understand that there's a lot of statistical noise they're older\nI'm always curious and owner you are an expert when people say they're independents are they telling the truth and secondly in this hyper emotional climate which I perceived to be hyper emotional at this time out of the impact polling\nWell I mean so here's where people who are self described independence our I actually believe that the number of independents ... table and the country and it's actually a really small percentage of folks who are truly truly independent\nSo in survey questions when we asked party identification when people say that they're independent you usually follow up with a question about okay so do you lean democratic or do you lean Republican I'm\nWhen I see that question or when I'm working with data I take those people who claimed to be independent but we'll have knowledge leaning one way or the other I put them in the same category as part of science and the thing about all of these surveys is that they're not terribly clear I literally ask people\nUm at at eleven alive about this yesterday I was like okay so where did the leaders going this because I Can't tell from this\nAnd so what I suspect because this is a larger group of folks is that you actually have a lot of millionaires who are sort of being counted in that group soldiers cleaning Lewis I'm well it makes it harder to decipher it would it would make more sense for me to do what they are but I have no proof one way or the other that that's what's going on\nYou know I was just going to say that I think there are people or\nMake more sense for me to do that but I have no proof one way or the other that that sort of ... era\n[noise] yeah I was just going to say that I think that uh people are saying they're independent um this year probably more so than other years but I Do think because Georgia at least historically has been more right of center you probably have more of those independents that lean Republican but are saying that they're\nUm that they're independent and I think that uh\nThe the actions of the candidates right now are sort of determining how those people are split you know for example\nAnd I know we're going to talk a little bit more about this later but you know Elizabeth Warren coming in for Stacey Abrams while that energizes for democratic base which is really important and she needs that\nUh I think it will take some of those leaning Republican independence and move them more towards Republican because Elizabeth Warren is such a lightning rod a for those that are on the on the on that lean more Republicans\nFor the other things we're watching for news polls is Trump's approval rating and there was another poll ... from the public policy um polls pulling\nUp a pretty liberal organization from that showed um Trump's approval rating around fifty percent in Georgia which has a much higher than the agency's UGA pull out two weeks ago at about forty one percent\nI'm Still watches these polls you're seeing his disapproval ratings stay around the same ... you know fifty fifty one percent and most of these polls but if Trump's approval rating start to rise to more compared to polls just a few weeks ago that's another sign that there could be more Republican energy not just around a you know the events like Elizabeth Warren commission comment also got enough\nYet I I'd be interested to see what your poll says tomorrow that the change their with regards to the president 'cause I end this is just completely anecdotal I have found that those more independent leaning Republican voters\nThat Kavanaugh um nomination has really move them into more solid Republican ...\nAnd the messaging Republican messaging as a candidate to help the Republican that's coming out of the mouth and every single Republican talking head and senator or whatever\nYou feel it I feel it to not just what I'm hearing that marking\nSomething different ceiling obligations from my crown fried Democrats ceiling a a real um anger and enter\nSome ceiling looking from my crown fried Democrats ceiling a a real um anger and energy and this can't be happening again right you know it may be energizing both both sides I think it best it's going to energize both sides or worse\nSo I don't want to weigh in on the state I kind of want to go back and just correct myself actually had natural sorry okay um you know the Gallup sample the hundred people that margin embarrassed customize ten which means that it's got to be something greater than twenty percentage points and it turns out the difference\nIn order for it to matter ... ... what is going in the opposite direction of what we've seen before it is a Seventeen point difference I'm Seventeen point difference between ... and Abrams amongst independent survey okay bass ... which means that has to be greater than eight in order\nSo let me let me do this let me put it in a period I miss portion of the conversation but do it this way it is very difficult on radio without the ability to show your graphics to really grasp of this kind of data So Greg let me say this\nAnd you correct me if I'm wrong the surveys usa poll tells us very much what other polling has also shown us which you used the race right now between ... and Abrams is very very close\nAbrams right now according to surveys usa is getting about twenty five percent of the white vote\nThat certainly the threshold for what she needs of white voters if she expects to win and she's getting more than thirty percent of the African American vote and certainly needs a bit above that so this raises a horse race and it's those independent voters who are going to enter met actually more than Ninety\nPercent of African American vote which is you want to be a more than thirty percent of the overall\nLike that's what I was the thirty percent of the overall like\nExactly and as you look at these polls just keep watching for that the number of other side of the continued window in and look at the look at the floors forty five forty five ... poll a couple of weeks ago and we're seeing more polls show them at forty six forty seven percent it's a very narrow race\nBut remember keep in mind Stacey Abrams entire campaign is built on transforming the electorate she's always going to say these polls are are not going to accurately reflect her her support because she's trying to expand the\nKnow in line at this table it probably understand it enough to talk intelligently about it but my greatest fear is greatest\nIt is it enough to talk intelligently about it\nBut my greatest fear [laughter] my greatest\nFear is that a dead heat electorate is going to result in the libertarian getting at least three points and that's kind of dictator\nRun on camera tense run off and I\nMean I think that that's a possibility but in terms of sort of how pollsters should wait there surveys and an M M ... most of them are looking at about or they're hitting it or they're waiting it to be about a thirty percent black electric which would actually be an increase over medallions midterm year and that actually smart\nI mean I think it's why so I mean ... can get black turned out to be thirty five percent of the overall total that\nShe wins but\n... the whole no pulse during their right mind is actually going to sort of like set their demos to that because like that that you know you want to be conservative and making these estimates and you want to hedge your bets and the reality of it is is that all these surveys have six hundred to a thousand people were only going to be so accurate and actually being able to predict what the actual numbers going to be\nAll right I don't want to I don't want to bury the lead I mean Margaret just introduced the topic that we ought to at least spend a couple of minutes or ... it does raise if it remains is closed and who knows I mean the polling is a snapshot of the moment not a production of the outcome are we headed for potential runoff here\nWell if you take the numbers were just talking about and and um representative Oliver is correct with regards to the libertarians going to get a percentage of the vote however\nI just feel like as we get closer and closer to the election uh there's good this is going to break and I think I think Brian's gonna edge it out now of course I'm sure you're going to disagree with me I think it's all about energy but I I think that that's what's gonna happen and we will will avoid\nIt in the campaign stalking runoff quietly with few quietly I'll say this to the the libertarian four years ago ... was a vote ... you didn't have much money but he was a vocal presents he was out there\nUm ten minutes we haven't heard from him at all I'm just zero and I don't know how much that affects but poll after poll usually has the libertarian at two percent which is within the statistical negligible\n[laughter] I'm an accidental or\nIs two to three percent and if you're energizing young people young people tend to be in the Emirates Decatur community\nI Am saying normally that that's\nProbably an area of mine they are then see if we got the ad ran him\nThat he's already for years\nBars handle or what ...\n... where did that come from the she feels that the video and the audio were cut short she went on to describe the other thing you could push a governor out but she talked about me too and Brian Kemp\nYeah and and really I mean there has a prank campus focused on on his marriage throughout the campaign\nUm his his wife Marty has figured prominently in this campaign messaging um so so they take this as a as a deep insult um that that you have a democratic candidate for lieutenant governor questioning or basically and his his his his fidelity it it does feel like a terrible misstep\nOn ... yeah I mean the end it think it's because we're trying to figure out exactly what she said that we don't know anything about it actually is she talking about anything we don't know about well I mean I don't know and so I think that that's what makes this weird I don't know it's just\nThat we don't know anything about it actually is she talking about anything we don't know about\nWell I mean I don't know and so I think that that's what makes this weird I don't know if she's trying to reference of stuff about the massage parlors again but I mean again I don't see how that would take him down because it wasn't like he was at the massage parlor\nI think it could have been reference to the massage power issue which is why singer issues for the bad dentist and the bad that I used to be a hearing officer for those board so I Know yeah there's some terrible cases they could have been that it could have been a misstep\nIt could have been in the fact that he employs then secretary of state I don't know how many hundreds of people and that there's an employee issue under his broad management but I certainly have no information though rumors even about\nA specific me too and since that specifically related to him by\nI think it's so cheap political shot by political novice and I think utilizing things like me to for political purposes is disgusting\nAnd just before we got here the echo\nPairing us earlier how do you feel about\nThings that have come to light and the me\nToo movement but I think using it for political purposes as disgusted by it shows that she's enough before we\nGot here to echo Eric we had we heard from a conservative activists Julian Thompson who's often on this show who had about fifty names of grassroots Republican women who also to central same thing and and Julie ... was um this has intellectually insulted Georgia voters\nTo say here's the whole quote in Sarah amigos desperate attempt to obtain name recognition she is intellectually insult to Georgia voters Brian Kemp is a good man he's a man of faith a husband and a father I'm Mary Margaret this does it does this have legs\nI Can't know I Do know that the messaging coming out of the Republican leadership and the messaging at all levels is attack attack attack these women are just you know not to be believed their their ... their mobsters et cetera et cetera et cetera so it's consistent with the national message\nThat women should not be talking about being a victim if you talk about a victim that means you're weak that's the message came specifically from\nA Donald junior yesterday something\n... says that that's the national message if you look at the state leadership in this state the Republican leadership you don't hear a Johnny Isaacson you don't hear governor deal you know talking about\nDo produce that would say I'm just a little bit more in the Trump camp wonder now you will\nJohnny Isaacson you don't hear governor deal you know talking about that well do you do that I Would say I'm just a little bit more and the Trump campaign to know your journey as ... I'm On my ears\nAnd perhaps my ears are listening a little bit more closely I think the insults that are coming from the Republican leadership are significantly means\nThere are so okay so let me way and then they ask you about this on drugs so regardless of Republican or Democrat\nAnything that ... or\nThe grades this whole notion of women coming forward to acknowledge their history of sexual assault sexual harassment\nI'm at in this case it feels like in ... she wants to reveal to all of us Sarah Amigo throwing that out rather frivolously does no good\nTo the whole cause me to cars\nAnd I mean I agree it doesn't um it also doesn't do good for her you know and and so and I think that this is important to point out I mean when charges like this come out there should be taken seriously and that's the whole point of me too is is to take them seriously\nAnd so I think there was a certain responsibility to not throw out baseless charges I Would say that even when you do when people do that and there's always going to be somebody who does that that doesn't mean that when the next person comes forward that you've disbelieve them because somebody else with a bad actor\nAnd that type of situation so I think that you know that's important to point out I mean I think I'm willing to agree with Eric that this is I'm a a of a rookie mistake on her part it's you know and it's a potentially troubling one what I think she was trying to say was any event that the governor can't\nCarry out his or her duties who do you want in second place so she's trying to make the Sarah Palin argument\nBut she's doing it with an opponent who's running mate is young and healthy yeah right I mean the reason why that was an issue which is usually not an issue and and vice presidents on presidential sort of a teams is because the candidate that she was running with was old and had a history of health issue\nSo Eric I've covered Georgia politics for thirty five years and I don't know the answer to this question she and you should cause you retrieve staffer Georgia governor\nIs that right when the governor leaves a state that's another thing she said the lieutenant governor doesn't take over when the sun actually wherever they are or candidate for lieutenant that's not true yeah I was surprised by their PR ya market\nBecause you know and actually I have a former\nCandidate for lieutenant that's not true\nYeah I was surprised by that part yeah mark who didn't exactly takeover to see it was the case deal would have never [laughter]\nI should have to answer this I don't have a jazz for not knowing the answer to that I don't think we have any have I got twenty Fifth Amendment so here in Georgia I think that it set it up taking over about lieutenant governor would no I think in most people's Benjamin significant that unexpected health yeah does that get\nWell I mean I think it's safe to say\nThat if Sarah ... a has a chance to reflect upon that day I think in ... ... ... ... that's right ah she wishes that they had never happened to start over All right let's do this let's get another break either way and come back talk about congressional races right here in Georgia you're listening to political rewind [noise]\nIf you recently supported gp during our fall fund drive thank you were already putting your dollars to work to bring you the programs that mattered once the beep if you didn't get a chance to donate during the drive your online contribution now will still make a difference [noise]\nPlease take a couple of minutes to go to G. P. B. dot org and click the green donate but not the top of the page thanks so much for your generous supportive G. P. B. and the service we provide every day [noise]\nNext fresh air I Believe this nation in the may ... cheating the goal of landing a man and the more\nWe kept her Damien changed now who directed the new movies first man I met Neil Armstrong the first man to walk on the moon is also wrote and directed la la land\nWorst fears this afternoon at three here on G. P. B. and C. P. B. news\nBack to a political rewind were in the studio where it is a state representative democratic state representative Mary Margaret Oliver Republican insider Eric ... Andra Gillespie from Emory University and Greg boosting AJC political\nA report or a couple of quick items a number one again for those of you are having heard by now we are going to be in Savannah on the thirtieth of this month you can sign up to join us there if you'd like to be in the audience when we broadcast when we were court show\nOr just go to G. P. B. dot org slash\nCan sign up to join us there if you'd like to be in the audience when we broadcast when we were court show\nOr just go to the G. P. B. dot org slash community and sign up if you didn't get a chance you know we're going to do the show next Monday Night in front of an audience here in Atlanta but I'm told that has really that sold out by now and I am by what he said he sold out tickets are free but apparently all the seats are accounted for so\nDon't even look for that one online I don't think it will be there then I Want to remind you all a friday or next show a\nStacey Abrams will be here I live in the studio I'm Jim Galloway and I will talk to her about her campaign\nAnd I want to point out that we've invited we invited both camp and Abrams\nAnd made the same offer and uh the Abrams people said yes immediately and became campaign said they don't have time to come in here and be part of the show which is disappointing to us we're sorry I actually saw Brian Kemp here in the building the other day and said to him personally I Wish you do in our show Brian and he said look\nShe has a nine we can start now as we had to go through a runoff we're trying to catch up as quickly as we can but sorry he's not going to be read\nIt disappointing to me too and apparently there was a little bit of an eternal debate over there about whether to do it but I Will say he does have or something like three bus tour as this man it was all over the state last week he's got two more bus tour so he he was in Athens for about ... it seemed like an hour and a half yesterday before you had to go to another event that damage yeah\nI don't you know there was a time in my career when I Would have gotten all huffy about bad about this at this point I get it there are other things besides being on political rewind that matter to campaigns I'm", "show_name": "Political Rewind", "year": "2018", "city": "Chatsworth", "day": "10"}