{"month": "10", "state": "GA", "station": "WNGH", "content": "Teachers when later today\nWhich one is for this American Life tonight at seven here on gp\nServe in Boston and beyond this is Judy be an Eighteen station radio network of Georgia Public broadcasting under dos and it's a minute before two o'clock political rewind with Bill ... mixed on G. P. B. S. G. P. B. news dot org\nSupport for CPB comes from you our listeners and the Columbus at the New York is presenting the wild wild west featuring Copeland Billy the kid Sweden for dance episodes from rodeos Sunday October twenty eight that four pm that river center in Columbus tickets a C. S. O. G. A. dot org your support allows\nBilly the kid Sweden for dance episodes from Rudy on Sunday October twenty eight that four pm and reverse that are in Columbus\nTickets C. S. O. G. A. dot org your support allows CPB to bring you a great weekend programs that are both informative and fun like wait wait don't tell me asked me another and Planet Money check out our entire radio programs scheduled at gp news dot org [noise]\nBe seven forty seven FM W. J. P. B. S. W. A. G. P. H. D. room for the Georgia Public broadcasting radio network [noise]\n\nFrom GPS be news this is a political ... I'm ... long lines of voters are crowding holding places across the state\nAs early voting continue but chargers ... voters in Russian are escalated adding fuel to the fire in Jefferson County a busload of African American senior citizens were asked by county officials to get off the bus\nThat was taking them to the polls and the new ones surprised voter suppression controversy is unfolding along partisan lines democratic lieutenant governor candidate Sarah rigs Amigo claims are GOP opponent is lying about discrimination lawsuits\nBy employees of amigos family run trucking from is it an issue that could shape the final weeks of lieutenant governor's race ... Bush being an hour panel joined me after the news [noise]\nFly from NPR News in Washington on Lakshmi thing president Donald Trump says he wants to find out what happened to Saudi dissident journalist ... Jay but as NPR's Mara Liasson tells us\nTrump also continues to give the benefit of the doubt to the Saudi royal family\nThe president said he'll be brief soon by secretary of state Mike Pompeo who's on his way back from meetings in Saudi Arabia and turkey President Trump has compared the Saudi royal family to Brett Kavanaugh suggesting that they've both been considered guilty until proven innocent today he was asked whether those statements gave the Saudis cover\nIs that given cover with that being said Saudi Arabia has been a very important ally of ours in the middle east\nThe president also said he thinks the audio tapes of what could be ... genius torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us\nBut ... torture and dismembered meant at the hands of Saudi Government officials probably exists and that he's asked the Turkish government to share those tapes with us investigators Mara Liasson NPR News the White House\nCiting waste and fat in the federal budget President Trump says he's directing members of his cabinet to adopt what he calls\nThe nickel plan he wants them to find a way to cut at least five percent from their budgets for the next fiscal year which starts October first two thousand nine team the president is expected to release his twenty twenty budget early next year\nIn a move that likely irks China a U.S navy research vessel has docked in Taiwan NPR's Rob Schmitz reports this is a diplomatic diplomatically fragile time for Washington DC and Beijing they're both locked in a trade war\nThe vessel named Tom history Thompson arrived in the southern part of go shown to refuel and change cruise tones official news agency quoted the islands defense minister saying it's visitors unrelated to military activity\nChina objects to all governmental a military contact between us and Taiwan which claims as part of China despite as having its own democratically elected government flag and military\nIf not the first time the vessel docked in Taiwan but this visit comes at a sensitive time in U.S China relations\nThe world's two largest economies are embroiled in a trade war insurance has demanded us caring for three hundred and thirty million dollar sale of parts and support for Taiwan's us made F. sixteen fighter jets Rob Schmitz NPR News Shanghai\nRussia's investigating a mass shooting at a vocational college in Crimea today that ended in the deaths of Eighteen people\nAnd left more than forty others wounded local authorities encourage say that the gunman was an Eighteen year old student there reporting that he took his own life they say this was not a terrorist attack their categorizing this as again a mass shooting\nAt last check on Wall street the Dow Jones industrial average was down eighty five points to twenty five thousand seven hundred fourteen the NASDAQ is down ... points at Seventy six twenty seven the S P is down one at twenty eight oh wait this is NPR\nLive from the gp newsroom I'm Ellen Reinhardt a day after President Trump's visit to Georgia to survey damage to farms from hurricane Michael farmers are wondering exactly what help they can expect as cheap ... grant Blankenship reports the storm is only the latest in a string of disastrous for agriculture many south Georgia cotton farmers were already\nCan expect as ... grant Blankenship records the storm is only the latest in a string of disasters for agriculture\nMany south Georgia cotton farmers were already nervous about paying back the bank this year after they were extended credit when Hurricane Irma damaged last year's crop appeal is a cotton farmer engine operator and south Georgia's Marion County he says hurricane Michael leave struggling farmers with another big question\nHere we are again another year people think to a device go with the sushi or you know\nGeorge agriculture commissioner Gary Black says the restructuring of debt to keep farmers afloat could be so big it could take an act of Congress pecan farmers the last decades old trees is compounded by the one hundred million dollars in losses due to the trade war with China for the News I'm grant Blankenship and make it\nA California based sales software company as expanding its regional headquarters in Georgia sales force says over the next five years it will add six hundred jobs that its new sales force tower Atlanta\nThe company says its new space will include community spaces where local nonprofits will be able to meet free of charge sales force develops customer relation ship management or C. R. M. software that used by retail in service companies to track sales and marketing to customers\nPartly to mostly cloudy today there's a slight chance of rain in South Georgia along the coast in the northwestern parts of the state will be in the seventies and northern in central Georgia will get into the mid\nEighties and the rest of the state for more news check out our website gp news dot org\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\n[noise]\n\nTo political rewind I'm good thanks for joining us for today's show and by the way this is the first time we're back on live students we did our show in front of a live audience here uh on Monday Night and I just want to thank all of you who are here in Studio with us\nFor joining us being part of the show asking us the good questions you did I Hope you\nFound it is enjoyable as interesting as we found having you here that said we're going to be in Savannah on October thirtieth I'd ... a number of times and um our community affairs department told us this morning are still a few seats left\nWe're going to be in Savannah on October thirtieth I'd mentioned miss a number of times and um our community affairs department told us this morning are still a few seats left will be there October thirtieth seven o'clock at night and go to G. P. B. dot org slash\nCommunity and you can sign up just preserve a free ticket if you'd like to join us down there we hope you\nWill think about doing that a couple of other quick notes number one you could of course watch us on Facebook Live right now just go to the GDP be news page on Facebook\nAnd number two you can tweet us at politics G. P. B. finally we are getting organized for our election coverage here at gp be we're going to be on the air starting at seven P. M.\nOn November ... we're going to do the first hour of our coverage I Believe we're still kind of tinkering with this but we think from seven to eight will be on both radio and TV\nAnd then from eight o'clock on as long as I can keep Tom ... and Robert ... awake we will stay on the air until we have results of what we think will be one of the really most\nInteresting um gubernatorial races or as well as all the other down ballot races grade a boost in of course this year political reporter for me as you said before we go on with the rest of the panel what we think this quite a week and we're expecting this could be a really late night about November\nSex and I always expect an election to the polls and we have another one will talk about today but I Believe him when it says the race is close um I I reached out this this morning I reached out to a bunch of operatives in in campaigners and party staffers that I that I Know and trust about a possible run off because it's the latest poll shows that\nAnd they're saying you know we're ... we're sort of it's in the back of our minds but you know they're still along two and a half weeks\nRight a grey goose did of course a UC is ... every day in the dead tree edition of the paper and he also contributes throughout the day and the night\nTo the political insider blog at politically Georgia part of my AJC dot com Amy stagger wild is back with his political science professor from Georgia State university ah it's great to have you back again Amy thanks for having me again next to you Howard Franklin democratic strategist a consultant who\nThat's a that's right and the crosshairs what's interesting to me too is how this is playing on the campaign trail I just spent two days\nI'm On the trail with Stacey Abrams campaign and it has not front and center of her of her campaign speeches or the voter registration issues and certainly in it or something that she throws inter campaigns me to do it\nTo to mobilize the audience but it's still about expanding Medicaid criminal justice changes um an economy public school education but near the end of many for campaign speeches she brings it up and says essentially there's fifty thousand fifty three thousand pending votes\nHopefully all of them will get to vote but no matter what you go get another fifty thousand people to vote just in case so she's she's challenging the crowd to to come up and even you know an even bigger numbers behind her\nBecause of that there is one incident Howard that was reported a of the agency had it on the front page this morning and it does strike me as being quite a bit different than than the question of exact match or or you know uh other aspects that that people are are seizing upon\nAnd that's this strange story where a senior citizen Centre in Jefferson County\nUgh put together put together a group of mostly African and African American senior citizen Centre and they got on a bus to go to the polls to cast their ballots early and ah the bus was stopped\nAnd the vote the the the people on the bus were told they had to get off they couldn't use the bus they couldn't go vote a and the the the the justification given by the county officials was well we can ... this was organized by a woman who happened who's a democratic or a county official\nAnd are they considered this to be a political activity at a county run facility and therefore they couldn't do it that's the sort of incident which was really really riled up the opposition [laughter] well\nAbsolutely arouse us up I'll I'll go ahead and come up with the member if that's the sort of thing that passes as a as a rule making and and counties whether they're urban or rural um if it was somehow illegal or there was some policy against the elected officials of any partisan stripe organized\nWhether they're urban or rural um if it was somehow illegal or there was some policy against elected officials of any partisan stripe\nOrganizing their constituents thing helping transport them to the polls I mean we wouldn't have half of the electorate ally electoral activity we see in the city of Atlanta every four years I think a big part\nOf what we try and I've been a part of a dozens of these efforts a big part of what we are insistent upon when we organize a particularly these early vote\n'em caravans for seniors as senior high rise soon as of which there or something like fifty\nIn the city of Atlanta alone um we are very careful not to include part is in a campaign materials as a part of that transport and\nAll the same walls that apply to anyone who might be electioneering anyone who might have a preference for how folks are casting a ballot still apply that a hundred and I think it's fifty feet that you've got to remain\nFrom the from the ... point with a saw and still are in place I don't think there should be any rules that were preclude folks getting help up until you get to that so I mean what did you make of it when you saw this story\nIt was in the sense of what was the reason for stopping it and where are the suggestions of where it would be I mean I think what is in part coming up with a question of what the bus have been stopped if\nThe people that were on the bus look different or if they thought they were going to vote in a different way and those are the types of things that we don't want I don't want there to be right we don't want it to be that we think the buses going to be stopped if it has a group of older white folks and we definitely don't want it to be stopped if we think it's going to have a group of\nYou know older African American folks or Latino et cetera and so I think some of this is also making sure that again it's getting rid of that subjectivity that concern that you were asking about with the one person making the decision or the possibility that the rules are being applied\nIn one way in one county in one and another because sort of the concern about\nThe kind of massive decentralization we have with a hundred and fifty nine different counties is that you might have a hundred and fifty nine different rules on your ... Jackie\nFallon has to be pulling up I'm ... I talked to better the reason that they actually not that I didn't have that concern in part of it we did have a hundred and Fifteen hundred counties so you have a hundred and fifty nine different\nMake use of Mississippi and I know I didn't know about whether we should adjust that we need them\nAnd I know that there were ... we need them you\nKnow I don't think there were burned in ... maybe not right that the um Jefferson County Democratic Party chairwoman Diane Evans how organizing right now there isn't that kind of I mean and I don't know what the rules for but\nYou know I had to give people the benefit of doubt ... hopefully it was done in good faith clearly we don't want anyone stop from voting everyone should be allowed to that um we got\nMarried when she was hoping that the people on that bus we're going to vote for\nAnything any harder an up and killed an urgent trust me all the expenses of her body was not a new thing and that's where the kind of a vice chair or chair of\nThe local Democratic Party who is involved but look there's video of it um where where there was no overt political statements that was just trying to energize\nUm these senior citizens to vote and just the image of them being pulled off a bus that was getting ready to go to early voting site just and motor the boy there's nothing there were conversely preclude that same Republican vice chair Cher saying hey some of the voters who are here\nIn the senior center in this county facility might be Republican voters and we want to aid their transportation to the polls very well so I don't think that that should be the the qualifiers to I Want to get\nTo our first break but before you Amy just to finish this subject out um I said this isn't the notes that I shared with all the view of this morning about some of the things we wanted to talk about\nIt this has become this is more tribalism\nThis is not about a search for the truth or in most cases it is it it it is a search for a weapon an advantage to use against the opposition and as a result of that\nI'm hopeful that people like Greg Greg boosting them that way on this show for instance are able to say yeah you know there are understandable why some people may voter suppression of his happening but here's the reality what this business and then the other hand we can give the other side of it but the reality is\nThis is tribalism edits at its best\nIs and there was a really neat study that came out at least in an intellectual than maybe not for the findings that showed that partisanship has basically becomes the new sort of community tie that people look to it's much more like sports teams it as much more is that you knew the opposition as immoral or an ethical\nAnd it's even a clip things sort of our old sort of ways that we would\nIt's much more like sports teams that it's much more is that you knew the opposition as immoral or unethical and it's even a clip thing sort of our old sort of ways that we would a dentist five with in our community people sort of see themselves first as whatever their purchase an identity as and I think the concern there\nIs that then lead tend to sort of other concerns about how we process information and what we think of the sorts of information\nWhether or not we're willing to listen when we're given information about something that doesn't mean Ryan preconceived notions\nOne single Greg is it give you the last word and there's use\nWe will get to the bottom of a court several courts will infect\nRule on these lawsuits\nAnd they will give us some sort of definitive answer about these definitive might not be the right way because there's going to be going to be the twenty twenty battle and the twenty twenty to battle as well as I just rack and for all right let's do this let's get a vote to break out of the way let me come back let's talk a little\nGray you we do have new early voting numbers based on all of yesterday let's talk about them let's look at the demographic breakdowns\nAnd what they may tell us and also a brand new poll and oh we love him we know how much you love bowling out there in the audience and we'll get to that after these messages [noise]\nYou know selling a car can be a hassle but donating it is a whole different story let us take it off your hands off your driveway and turn it into public radio and maybe even had tax deductions ... resolve the host of marketplace here is how to do\nEight seven seven GP beat one car or donate securely on line a gp dot org slash cars ten thanks [noise]\n[noise] well come back to a political ... we've now had a two full days of early in person voting I mean we're by now this hour in the afternoon on Wednesday half a day into a third day\nGregg the turnout continues to be pretty astonishing uh the person turn out and then of course adding the absentee ballots the early ballots by mail it really is something\nIt it is something we had we had about Seventy thousand people vote Monday which was three times more than the same period and fourteen and we had even more than that though yesterday Seventy five thousand also hold if you can also kind of the roughly Seventy thousand mail in ballots that have been processed we've got about two hundred and Fifteen thousand\nToday Seventy five thousand also hold if you can also kind of the roughly Seventy thousand mail in ballots that have been processed we've got about two hundred and Fifteen thousand a total vote count which is again more than three times higher the number of early votes cast of at the same period and she doesn't fourteen\nSo um there's a website that I'm Robert give us and we ought to a tweet this out Georgia votes dot com\nThere's a a there's somebody out there who seems to be doing a pretty good job of keeping track of the data as it comes out of county officers um he has it around two hundred and twelve thousand people who voted early\nI'd at this point um as opposed to the last midterm swimming number was sixty seven thousand a white votes now the ... voting has started in person seemed to be a higher than a black votes women are voting it's somewhat higher levels than men are at this point\nYet but enough to ... enough to raise the possibility of a\nRunoff yeah you said the are where to go home [laughter]\nAll right so here's what's interesting it's ... I can I interject about because I Want them to know that the reason that that can be the runoff is not even that undecided vote apes that\nIt have you ever wins half to get to fifty plus ... plus one frame and so if there's any type of third party well we have a libertarian candidates or party then it pushes it tore especially in a close race that there's going to be a runoff and we've learned invited\nAnd he's been pulling a two percent and pretty much every poll which is getting his within the margin of error so um but Republicans are hoping and they're ... they're starting to see the numbers of their own showing that his his supporters taper off a little bit he'll probably get two percent no matter what happens but\nUm it it it yeah that that could raise definitely raise the ... and there's also a a force candidate um who's in the race to get you know a small sliver of the vote to\nUm what's interesting to me about this is the um I Love to look as across town or the other questions rather so for instance um writers ask God Georgia voters the most important problems facing Georgia today I'm ... I'm\n... I'm Sorry what's the most important problem facing the United states today but these are George ... respondents um I thought it was interesting that it's not surprising that Eighteen percent said health care because they\nThe United states today but these are Georgia respondents um I thought it was interesting that it's not surprising that Eighteen percent said healthcare because that mimics almost every other poll we've seen but but Jackie that raises this question of whether Republicans may be\nA pat on the wrong stream if they're not cautious about how they talk about uh uh uh not expanding Medicaid here in Georgia Brian Kemp doesn't want to expand Medicaid or do we think that Congress would if it's a Republican Congress would maybe go back and look at uh\nGetting rid of ... again I mean this is a tough issue for Republicans right now isn't it\nI think that if you look at a likely voters Democrat versus Republican Democrat but then a twenty seven percent and like the Republicans that matters but that the Seventeen percent\nSo there is a split among party lines and I do think that that is something that um that that when you think about very thoughtfully but it's really in reality if you don't have a system that works for all I mean it's it's bad for the country is a long term\nBut Republicans core beliefs as a single payer system doesn't work because I've been here and just doesn't work say you had to come up with a different solution\nThat if you look at the Republicans had their ... their top concern for better as immigration right so I Do think it's also that if you look at the kind of like what's happening with ... with the races that kind of reflect what the core issues are and both constituencies\nUm what other numbers in there were I was surprised I Want to share with you morality came in at twelve percent of Americans said morality was a big issue for them and in fact a more Republican likely voters than Democrats pick morality what is is that all of\nIt so it also but this was also interesting when when when asked about who would better handle these social divides that I guess morality would fall under voters gave Abrams advantage over camp also they gave her the advantage on health care as marriage mentioned in education the environment\nCamp at a slight edge over a bridge on economic issues there also mirrors AJC pull\n'em in a wider advantage on immigration law and order poses the issues that he's focusing on he seems to be doing better on the issues focusing on health care of one of them she seems to be doing better on a and again that that the health care one was a little different ... both of them neck and neck to this poll showed her with a clear advantage on the issue I I Want to\nAsk you a question about just what you're talking about a little while ago you said that you talked about Abrams\nTheir advantage on the issue I have I Want to ask you a question about just what you're talking about a little while ago you said that you talked about Abrams when you were out with her for two days and you've been out with with camp obviously for for tours of the states\nAre they both equally discipline in the way they focus on the issues that they say are the most important so eight rooms of course did our show last friday and was strikingly discipline share her message is clear ah she knows what she wants voters to hear from her I haven't been out with cap is kept doing the same\nThing yeah here as for the for the most part he his his his campaign appearances tend to be a little shorter the speeches at least and then he spends a lot of time taking pictures with folks afterwards um but his are much more sharper attacks on Abrams\nA and that's been like the way since he won the runoff up she's only more recently begun to lease her speeches with attacks on him and that I that really rung true the last couple of days or we wrote a story back in August or September saying that she's ... she's a larger laying off of him well that's not no longer\nThan two weeks but I think there's also I think we've gotten a clear sense of what the bottom lines are obviously this back and forth on whether or not I I think regulate decided well now these are two are elected officials who operated from underneath the gold dome for half a decade now all across the certain set of issues\nAnd now that there seems to be evidence or at least enough to to charge in an alleged other there's miss doing from the secretary of state's office that couldn't just be folly\nThey wouldn't just be bad administration I think she's got an argument that most voters understand intrinsically right you don't have to if we're talking about expanding access to the ballot or suppressing\nOr access to the ballot most people don't need you to identify which party might be guilty of which which offense right and I think that that in that obviously is embolden our I think to press down on the on the charge as opposed to doing what she initially started with which is I'm just going to bring more people to the party than you do\nYeah well I think that's nice though is we don't have to determine the policy positions of these two candidates there's actually been a lot of policy attention given they both have given very policy how he spent his they'd given a lot of information out there haven't been as much about I Would actually\nAll our disagree with that I you know we I was on political view on a couple of weeks ago when we were talking about a similar topic as are related to policy and I I did I uh actually mentioned this to Brian\nDisagree with that I you know we I was on political view on a couple of weeks ago and we were talking about a similar topic as are related to policy and I I did I uh actually mentioned this to Brian\nI'm often on and All right and Robin love and send in on it I went on both of the candidates websites and what I felt for the ... because I really wanted to be read up and prepared to have a discussion with many of the links on a website or press releases or there were endorsements from people who might be well\nOhio sorry we vet said Amy just to go back to you are what are you going to Stacey Abrams website they loose several a number of issues and then have very sparse bullet points citizens as if they're laying out ... big position papers ... so I'm not sure\nThat looking at what they've got an their weapons are saying this is Sara Lee an indication of whether they're talking about policy contracts are clearly there and that's what makes that race at least one of the voters or a contrast because we've had elections in the past where\nThe Kennedys agree on many of the things and disagree in a few big ones and this one there and there are polar opposites on so many of the biggest divides in Georgia I'm you know from criminal justice to to tax policy the budgetary issues to social issues when you name it guns\nAnd and so that makes it and I think that ... even if that's not available on their websites and it probably should be a we spend a whole week last week and AJC just writing seven stories in a row on different seven of a talk\nShow and at least a political scientist when I'm excited by is that the voters or recognize him these differences spy really of whether or not they have choices voters recognize that there are in fact competing caught and contrasting claims that they are going to go for and so it's giving them something to pick from so you want to weigh in on the yeah\nI think it's really interesting because I think it's much closer race if he's kind of step back and look at the big picture considering that whereas you know we're doing very well I can honestly the state we never went for business we've had a fantastic governor Nathan Deal I mean people thought when he was coming in and they weren't sure about him but he sent a great job with criminal justice reform means really weren't in education\nI think it's really fascinating that if you look at that and kind of step back\nIt ... it would look at that'd be easy for camp to win the same from a pure like this one were Carlos and what he said to me she she's a very good candidate I mean I couldn't say that to a couple of years ago that Hillary Clinton she wasn't a good candidate for the Democrats\nStacey Abrams is a great candidate but I Do think they provide very clear choices and I just hope I mean the people go through and look at the decisions because it's a it's a real decision I think that people need to be thoughtful about it and I do get worry sometimes that that they get so caught up in the back and forth and the the headlines from the media\nDecisions because it's a it's a real decision I think that people need to be thoughtful about it and I did get worried sometimes that that they get caught up in the back and forth and the headlines in the media now now it's ... it's an easy to get me to sit on my TV had to really dig into what the policy main\nAlright hum let's take on what are very quick let's do this quickly graying because we talked I mentioned at the beginning of the show I wanted to get into it and we got to get to a break um\nThis ... is suddenly are dealing with this issue that her family trucking business is the subject of a lawsuit filed by a ten or eleven of the employees of the company up in Indianapolis are alleging racial discrimination\nI think there may be at least one allegation of some form of sexual harassment\nHarassment or did did no surprise Jeff Duncan campaign her opponent Republican opponent is\nA going after her on this and and ... a Amigo now says hey ah you're lying about me and a ... a ... demanding that you withdraw the allegations you've made ... tell us a little about\nThis yeah that and and then I I I think it's fair to say this delighted Republicans because they got them to air this whole thing because it came from a lawsuit hum so ah but basically the the the ... campaign is calling on Republicans to retract I'm a attacks on her based on this lawsuit", "year": "2018", "show_name": "Political Rewind", "city": "Chatsworth", "day": "17"}