{"month": "10", "state": "GA", "station": "WNGH", "content": "Serving bluffed and and beyond this is to be an Eighteen station radio network of Georgia Public broadcasting under dos and it's a minute before two o'clock political rewind with Bill ... mixed on G. P. B. S. G. P. B. news dot org [noise]\nAnd it's a minute before two o'clock political rewind with Bill ... get his next on G. P. B. S. G. P. B. news dot org [noise]\nFor the first time high school girls will get a chance to play a season of football the land the falcons are sponsoring an all girls flag football league in Georgia schools\nWe always tell our kids the sky's the limit but then we put limits on them when girls can't play guys football so I think there's a huge\nFind out how this leak is about more than the game on all things considered this afternoon four to seven PM CPB news than with the fact\n[noise]\nWas Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. room portable Georgia Public broadcasting radio network [noise]\n[noise]\nFrom G. P. B. news this is political re wide I don't like it with election day now just three weeks away the Kemp campaign doubles down on accusations that Stacey Abrams is encouraging undocumented residents to cast illegal ballots\nAbrams forces are stepping up their claims that camp is engaged in an effort to suppress votes of likely democratic voters\nThese are lines of attacks that seem a parent to be playing out all the way to November six\nIt appears many Georgians won't wait until November six until they cast their ballots with one just with just one day in person early voting completed some precincts are reporting big turnout and mail in ballots are running well ahead of the last midterm election two\nPlus when President Trump wanted advice and how to fire up the GOP based he turned to Georgia Newt Gingrich we're coming\nTo you from the G. P. B. studios with a live audience will take their questions after the news\nLive from NPR News in Washington I'm Lakshmi saying the Trump Administration is engaged in a delicate dance with Saudi Arabia whose crown prince Mohammed bin Salman is globally suspected of having something to do with the disappearance and possible murder of dissident journalist ... two weeks ago [noise]\nUs secretary of state Mike Pompeo has met with the crown prince and his father he's not tipping his hand on whether he believes Saudi Arabia is claim that it was not involved and parents Michelle tell them and says the U.S is treading carefully around it strategically critical ally in the middle east\nRemember this is a president came in talking about Iran\nAlly in the middle east remember that a president came in talking tough about Iran and you know you still hear a secretary of Ontario focusing on Iran almost nonstop and not criticizing the Saudis and in that way at all\nOn their vote they pulled out of the Iran nuclear deal they're re imposing sanctions on Iran including oil sanctions that go into effect in early November and they want the Saudis to continue to keep the oil markets table at NPR's\nMichel ... reporting [noise] at least eleven thousand air force troops and their families are displaced as a result of hurricane Michael the storm made landfall in the Florida Panhandle last week as a category ... storm with one hundred fifty five miles per hour winds NPR's Quil Lawrence reports on the damage to tend to air force base in Florida the\nBases right on the coastline and the storm hit it directly base commander Colonel Brian laid law posted a message to airman on Facebook\nAnd I'm getting more than anything else once when I get back to what's in my house would go on I get that as soon as I work at all I can get paid the same as I S bring you back with\nFamilies want to retrieve belongings or take pictures to file insurance claims are apply for assistance\nBut every building on the base was affected or destroyed by the winds and surging waves including the hangers holding F. twenty two fighter jets those costs one hundred fifty million dollars a piece and it's still unclear how many were damaged Quil Lawrence NPR News Miramar Beach Florida\nAnd he lost ... states some George counties are unfairly rejecting mailing absentee ballots Georgia Public broadcasting Steven fell reports it's the latest legal challenge to that state's voting system\nMore than a thousand absentee ballots have been rejected across Georgia's so far about a third of them come from a predominantly minority metro Atlanta county libertarian candidate for secretary of state's my Duval is one of the plaintiffs\nAmong the town and he said to be\nOne of the most common reasons for rejection is putting twenty Eighteen instead of the voters birth year when signing off on the ballot\nThe suit wants minor errors like that to be accepted and counted groups of also sued over a state law that puts registrations on a pending list if their application does not exactly match the database for NPR News I'm Stephen Fowler in Atlanta\nAnd this is NPR\nLive from the G ... remind melon Reinhart the city of Atlanta has agreed to one point two million dollar settlement with a former Atlanta fire chief who was fired\nFrom the G ... remind Allen Rheinhart the city of Atlanta has agreed to one point two million dollar settlement with a former Atlanta fire chief who was fired after he wrote a book that compared homosexuality to be ... TB is Taylor ... reports the council approved the payout to Kelvin Cochran\nIn twenty Thirteen while serving as fire chief Cochran wrote and distributed a religious book which called homosexuality vulgar and the perversion he was then suspended and fired in twenty Fifteen Cochran filed a federal civil rights lawsuit against the city claiming he was terminated because of his fate\nFormer mayor casino read said Cochrane was fired because he didn't get permission to author the book and for promoting it at work\nLast year a federal judge ruled that the firing was not a free speech violation but at the city's rule on getting permission for outside work like writing a book was unconstitutional\nFor the News I'm Taylor dance\nHistorically black college in Augusta has lost a lawsuit seeking to preserve its regional accreditation\nA federal judge ruled against thing college in its lawsuit against the southern association of colleges in schools the Atlanta based a credit rating agency put paint on warning in two thousand eleven after a number of financial management problems losing accreditation could cut off students access to federal financial aid and make it harder for them to\nGet academic credit excepted to other schools\nIf you were affected by hurricane Michael food and water are available at distribution points across south west Georgia go to Gina dot G. A. dot Gov survivors and Baker\nDecatur dowdy early Miller and Seminole counties are eligible for a disaster assistance through FEMA\n[noise]\nAh we're really thrilled that we are recording\nThis show on a Monday evening in front of a live\nAudience you can hear them here in Studio be at Georgia Public broadcasting and throughout the show today will be turning to\n[noise]\nAh we're really thrilled that we are recording\nThis show on a Monday evening in front of a live\nAudience you can hear them here in Studio be at Georgia Public broadcasting and throughout the show today will be turning to them and asking them for their questions as we move forward so let me introduce a panel of course\nThere's the agency's Jim Galloway down or the other end of our panel he of course is the lead political writer for the AJC\nForward so let me introduce a panel of course\nThere's the AJC is Jim Galloway down or the other end of our panel he of course is the lead political writer for the AJC you read them on Wednesdays and Sundays in the newspaper and he oversees the political insider blog at uh my AJC dot com Hi Jim who the evening good to have you written ... did you want to say I'm Sorry\nI just I just like the purple drapery and everything is just very regal yeah [laughter]\nWe are Smith is a red next to you Jim Leo is a Republican operative used to work with the state party I'm an expert at engaging minority of voters and activists especially in Republican Party politics\nAnd are continuing to do consulting work you have one candidate you have a a ... note what district you have a campaign in ...\nHad a campaign he's on his own now and he's I took him to those they'll go to the water [laughter] okay [laughter] I'm like a survey though but this is the purple draperies are predicted a purple politics and George\nAll over [laughter] Stacey Evans or you know her as a longtime state representative\nAh and of course she ran against Stacey Abrams in the Democratic primary for governor Hi Stacey Hi thank you for coming in things are happening in poor I'm a Republican strategist she was governor Sonny Perdue Z\nA press secretary and continues to work she was also Carly Fiorina's co chairman of the Georgia campaign will Carly Fiorina ran for president in twenty sixteen and uh you continue to be active in politics policy seems to be your your feet right now\nYes I Do more in the policy side than I Do on the campaign is it nice apps and right\nNext to Michael ... Michael ... of course the\nChairman of the Democratic party of a Cobb County and were awfully glad to have you here as well Michael I'm happy to be here and get early voting started well that's what I really want to get our cat kick our conversation off with Jim so there's been one full day of early voting\nAnd anecdotal uh reports suggest that precincts have had big turnout people seem to really be invested in this race\nWe've got a two hour waiting in ... county is is what would I understand we've got enough pressure up in North full Johns creek area that they've had some technical issues of uh\nIn ... county is is what what I understand we've got enough pressure up in North folding Johns creek area that they've had some technical issues of uh to address their uh and and I think it was before we went on air you know we we gotta we sampled the crowd here in these days\nI Want to go back to that county for just a second I'm and I want to talk to you about this Michael Jerry Gonzales who of course has been a Hispanic a leader here for many years uh he ... he's a the George association of Latino elected officials\nJerry said that we should be he he thinks Democrats should be really worried about what happened in ... county\nBecause he wonders if this is an effort to suppress democratic votes which plays into a scenario that's becoming a big big topic of conversation in this election we're going to talk about that in a minute but\nDo you really see anything you haven't lifted that county specifically but no\nBut I I I Know Jerry's or find individual ... does fine outstanding work so if if if Jerry said something there's there's some truth there behind it um but I think it's worth looking at I think it's something we should continue to as as a gym sins early those numbers seem\nFar beyond just anomalies so I'm whiskey doing it's we if we start seeing that in other areas in other places and other counties\nThen uh it it when they start\nI think it also has a lot to do with the effectiveness of the New Georgia project in\nThe ... project she's no longer the direct right here but um that program has been very effective in registering people and there's a bunch of pending registrations out there\nBut to do that to have that much more in that that great of an increase in registrations you're probably are going to see I also see some things that ... had I haven't been done cleanly and and they are required any form filled out must be turned in even if there were mistakes on it\nAll right well this leads us to talk for a few minutes at least about this issue these two issues that have popped up in the really they've been they've been building but in in this past weekend and certainly moving in the beginning of this week uh there are two narratives that have taken shape\nOne of them is the ongoing campaign that the Abrams folks and the Georgia Democratic Party have waged a talking about voter suppression all of the ... ways they think that Brian\nIt was folks and the Georgia Democratic Party has waged\nA talking about voter suppression all of the ... ways they think that Brian Kemp secretary of state's office has been trying to suppress a democratic votes the most recent being the fifty three thousand people who\nBeen who who are ... what let's be careful their views are people who\nWere put out a list of a possible voters because of exact match right and what ...\nWas um the law's been put in place to basically says that you're in a strange and has to match exactly exactly exactly right um\nSo there are some potential problems within explained before is that when you look at particularly in communities of color you are going to see more names that are hyphenated have a ... views have accents sphere so when you look at it but fortunately it is going to affect the minority population at a higher rates\nSo you were in the legislature were you not when exact match it it's just it's just a statutory provision right\nIt is and it was that if I recall correctly I think a exact party line vote\nAgainst that legislation um because it it has the effect that um that Michael was just mentioning you have nontraditional spellings also more likely in minority communities and that's going to lead to mistakes just but not by um malice but just by clerical error data\nEntry errors and the fact to think about data entry airs clerical errors keeping people from voting on it very frustrating and I and I do think it's important and and I and I think you are starting to do this we we do want folks to know that if you're in this group of fifty three thousand you will be able to cast a vote if you bring an ID and and it is very important that\nThat folks know down and Stacey Abrams has been adamant\nEverytime she spoken on this issue\nThat I've heard where she said yes you can vote because we want to make sure that folks don't get don't get discouraged and I think some of the national media outlets have have confused the the the story a little bit you will be able to vote\nSo go and vote don't be discouraged but this is clearly something that um I Hope the next legislature will work to repeal\nAround as well just to declare the exact batch is that your voter registration form must exactly match or a driver's license or Social Security those are the two a barometer by which to match against\nAnd I'm Stacey point you can all of these fifty three thousand people are eligible voters they um just have to bring the proper form of id and can vote\nAnd it's my understanding that if it's not a proper form of id\nPeople are eligible voters they um just have to bring the proper form of id and can vote and it's my understanding that if it's not a proper form of id or doesn't match exactly they can still cast a\nProvisional ballot which happens that to happen to be a and I'm very glad this context I I'm very concerned about it because I think that the idea that there's this aggressive effort to suppress growth in a way can backfire on the very people who were trying to help\nYou and careful from you believe that exact match is ... and and say having things which are strict party line vote is a Republican effort to suppress democratic quotes\nI think the well I don't think it's a Republican effort to to to pro okay and what I thought I don't really use the term exact mess that term is\nMore used by Democrats and Republicans use terms like voter integrity and ... identification check that kind of thing that matters really not been part of the legislation I don't think it was mentioned is that the words that match went mentioned in legislation\nThat it is the fact and and you can ... there's something about things by the same name doesn't really matter of fact is certainly potential depression right on the way you\nWant to jump in you know a couple of things ... ... I spent most of most of today when I was not on air of going back through the through the uh the debate the it was a February or early February twenty Seventeen debate\nOr the legislator the legislature and and and and and and Democrats were very careful about us spelling out the hazards because this is this has already been litigated in fact something like nine days before this the the house took this up in the past it\nUh Brian Kemp had settled with these a voter registration registration groups\nAnd this legislation was designed specifically designed to overturn the settlement uh we have in our audience a state representative Brenda Lopez she was one of the people who spoke against it making the point that you know if you had if a if a if a data entry person accidentally put two spaces\nBetween ... a surname and and and your family name\nThan than you were done for a and the problem with this is that voters are notified what the problem is and yet they're being asked to fix it\nWe've got to get ... is this in the weeds I Love having a real audience here at it this is the people are giving me the thumbs up I'm Glad to hear that thank you I Want to take this up\nYou got to get ... is this in the weeds I Love having a real audience here at it this is no people are giving me the thumbs up I'm Glad to hear that thank you I Want to take this up as a campaign issue and then look at the other campaign issue that's getting a lot of attention I and that's a Brian Kemp\nAre suggesting that Stacey Abrams has made it clear she wants to undocumented residents in Georgia\nTo vote illegally we'll talk about that in a lot more you're listening to political rewind with our live audience in our studios in Atlanta [noise]\n[noise] for the first time high school girls will get a chance the ... the than a football the Atlanta Falcons are sponsoring an old girl flag football league in Georgia schools we\nAlways tell our kids the sky's the limit but then we put limits on them when girls can't play guy football so I think that the kids\nFind out how this leak is about more than the game on all things considered this afternoon from four to seven PM CPB news [noise] than what the fact\nWelcome back to political rewind or as I said we're coming to you from studio ... of Georgia Public broadcasting recording our show in front of a a live audience and political rewind or listeners um [noise]\nLet time why don't we uh uh play\nThe sound bite a first of all let's play the sound bite of Stacey Abrams on meet the press\nShe made the rounds of the national shows on Sunday a CNN or NBC she was on a ... both of them there's a big political shows and she went after the is a so called voter suppression issue let's listen to what she said\nWe know fought system that has a disproportionate effect on people of color but it also has the ability to ... and our system I know that\nSecretary can't is well aware of it and it's part of the pattern of behavior where he tied to tell the playing field in his favor or in the favor of his party this should not require the origin of public alright\nSo there Stacey Abrams dating her case this is this she says voter suppression campus aware of it he's doing it intentionally uh Brian Kim a has responded to that let's listen to what camp pet to say I think this was on Fox News on Monday morning\nThat's a smokescreen trying to hide her radical views those folks that are on the painting list all they have to do is go to the polls show their photo ID and they can vote\nIn trying to hide her radical views those folks that are on the painting list all they have to do is go to the polls show their photo ID and they can vote\nAgain this is just a distraction from her review of her group's follow the law suit to get non citizens to vote in a state of Georgia we're not going to allow that we're going to have secure excess full and fair elections in our state and by the way they're not talking about the fact that we have more registered voters on our roles now than we've ever had\nAnd she voted against own line voter registration that I helped create this improved our voter rolls and has more people participating in the process so we're very proud of that\nAre so there was a lot to unpack especially in was a a camp Joe said but let's start with the most basic uh effort her response or his response for two Abrams attack is it's a smokescreen to hide her radical politics and of course her radical politics is a big theme\nYou you weren't going to be held accountable as a governor as a president as a member of Congress for how quickly and well the government responds to your concerns so it it has worked our way to you you've got to be successful if your part of the Republican a team on the on the ticket\nYou've got to work this has got to be done successfully that's what I'm Talking about with relative\nWell and in our hearts certainly go out to those that are affected by the storm and and that's that's real life that's going on down there real law and it's heartbreaking so we're glad\nThat the president is down here and and shining um the resources of the federal government and that light on the state now politically talking about a different raw political terms I think camp in the winter on this because um it brings Trump to Georgia\nOn it brings Trump to Georgia in a way where he's presented like doing good for the state and it's going to be a positive a positive light for the president and\nThen he gets at a table and rally where he might be criticized as much as praise\nAnd it might save it might save or it might save Georgia from that visit from that political rally visit but still you have a sort of a warm and fuzzy feeling if you're a Trump supporter that he came here and you get the benefit of Trump being here but not the potential political downfall of him going off script OK hasn't left yet\nNot be potential political downfall and going off script okay he hasn't left yet [laughter]\n\nAll right let's I Want to take up another issue I have to do this kind of quickly I'm\nUp in the six congressional district a Karen Handel the incumbent is it a race against Lucy McBath that of course we all know by now the Lucy McBath is a ... a woman who really got engaged in politics Michael I'm going to come to you first 'cause your district if you're Cobb County as part of that district um\nShe got engaged because her son tragically was was killed by a gun Ina Garten incident\nUm she's seems to be behind she's raising money\nBut uh Michael Bloomberg with his uh I'm gun safety organization every town for gun safety he put a million plus dollars into her campaign initially and now we learn that he's come back and put another million eight into her campaign\nIs that a sign that he thinks McBath can win\nOr is that he's doing everything he can too because she's behind and he's worried that she can't\nNo I think it's a strong indicator that um that she has an opportunity to win this race you know I mean I I\nAlso started the sixth district taskforce where we actually you know put specific effort into the six send the D triple C has kind of came of all the more important I think that saying that\nUm she weighs almost made all of her own on this past cycle and that was through twenty almost twenty eight thousand individuals small donors that doesn't happen without a lot that way we talk about it doesn't happen without that so I think looking at that how much money she was able to raise just individually um outside of what every town is done I think is really what's telling storage him\nA just a quick question from Michael well what she's showing and catch on him because Karen Handel announced today that she's got nearly a million dollars ready to spend about nine hundred and Seventy three thousand\nI could be wrong I think it's around seven hundred thousand ... ... you know relatively haven't yet but that's before the infusion apparently of a million aid from the Bloomberg grew grind\nSooner but ... of ... in in in superPAC\nThat we should point out uh most of the prognosticators the data crunchers continue to keep that race as a Republican a victory so we'll watch how it plays out\nWell we don't we don't know how many of the small donors where in fate or out of state and that makes a difference because if they were in on that\nA victory so we'll watch out what plays out\nWell we don't we don't know how many of those small donors were in state or out of state and that makes a difference because if they were in state then that aligns with voters\nIf they if the if those donations were coming from out of state and those folks aren't voting they're merely sending in um contributions and we've seen across the country so that's kind of mirrors what's going on across the country if we look for example that\nTed Cruz's race probably the most glaring example of what the ... of this phenomenon this cycle as we paid or Rourke who is challenging renewal energy dollar raise a forty million dollars ... he's trailing significantly in the polls\nAnd so you know I think that while there's a lot of money flowing into some of these democratic racist that doesn't mean\nI'm that those candidates are sitting in a good position\nTo notice also that's ... that's right and also because you know everyone knows that Michael Bloomberg just kicking the tires on running for president so this gift you could be more about Bloomberg is spreading his own message for his own campaign agenda of\nJust like a devoted leisure joined registered as a Democrat construct well well ... has a lot\nOf a congressional races he can plan if he wants to build up relationships for a twenty twenty and he has an interest in backing people that are going to win I don't think he's going to throw a good money after bad he's he's put money in this race because he believes at least you can win and the ... she can win too she's only about two points back\nAnd the energy on her side of the amazing she almost out she outraged Karen Handel almost by double this last cycle and those dollars spent\nUm and I think for a Karen Handel or any of the Republicans to talk about potentially on outside money um or or out of state donations to Lucy is a little disingenuous because Karen Handel is in a position she's in she's in the U.S Senate because of though\nThey in pouring of money from out of state donors in her special election in twenty Seventeen you got there because of ...\nI got to get to do to break 'em so we'll do that and come back with\nA political ...\n[noise]\nOn the next fresh air growing up with an absent mother who is addicted to heroin and raised by grandparents who gain legal custody but talk with Jared J. 'cause Oscar about his new graphic memoir for young adults\nHate kiddo how I lost my mother found my father and dealt with family addiction it's nominated for a National Book award he also does the lunch ladies series China\nOr shared the ... you can live on my TV news dot org\n[noise] we'll come back\nSheriff who from Iran ... you can listen live online dot org [noise] welcome\nBack to political rewind we are in Studio be of Georgia Public broadcasting with a live audience watching us record\nThis show which ah you're all hearing right now I Know Tuesday Afternoon I I said I wanted to give the audience a chance to ask questions so let me start with you tell us your name and then ask your question I'm In a while\nAnd I'm In charge an educator I had a question if we think the five thousand dollars that uh Brian Kemp has promised to Georgia teachers do you think that that specifically for public school teachers are also private\nAnd we're all this money come from and also on who seems to have a discussion of who seems to have the better plans for the title in schools ha the ones that are more than fifty percent free and reduced lunch\nGreat question a gym you can answer the question first of all about five thousand dollar raise where where where would have come on what was the price tag on the thirty thirty million dollars already recovered at thirty thirty million dollars he says it would come from it will come from the general budget in one would come from the general budget\nIn one fashion or another uh what's interesting about that is that it got uh some rave reviews among many Republicans house speaker David Ross was not one of them out of control they they ... the controls the purse strings\nYeah you've got to get a speaker on your sides you know what's interesting about that it strikes me there was a big thing when it first was there now he really bug or caused a splash and with all the everything else has been going on I'm sure he'll still come back to it but it's kind of faded into the background\nA little rabbit built right if if I could just one thing that's really interesting getting up and and the less a kind of three or four days is that a Abrams has come up with the minimum wage for law enforcement which ... opposes right so you've got some really different ... you got some difference on these candidate\nIs is that a pay raise still going to be big deal for camp\nThe teacher pay rate there yes I mean I think [laughter] so I think we have to your first question we haven't heard much about it because there had been a lot of other issues um transpiring since then but I'm sure we're going to hear a lot about it during the debates when those occur and I think to answer your question [noise]\nUm you know when governors they have discretion and how they put together their budget um it'll be difficult for Brian kept in the first year because uh if he is elected 'em because typically\nThe ... they have discretion and how they put together their budget um it'll be difficult for Brian kept in the first year because uh if he is elected 'em because typically the previous governor is kind of setting that agenda and then you're tweaking it when you come in and your first term [noise]\nUm but they have discretion on how they prioritize those budgets and working with the various departments and so that's how that would happen it would have to come from somewhere else um but we also have some new revenue streams coming into the state in terms of the Internet sales tax and um and some up due to some of the tax reforms at the federal level\nThe first question was about whether is just for public school teachers or not I have a school\nSpecifically with the ah the fifty three thousand of voters can any does anybody know the number of white males since they have the standardized names and don't have to change them for any reason for I don't think anybody knows\nThat there's you know I saw the lists um the gentleman who's been the lead investigator on this interview me back in twenty Thirteen or with the same list um and and and so he was making decisions on whether or not the person was African American or Latino based purely on name and\nYou know and and you know Ron Brown must be a black person I mean he was actually doing that as you interviewed me for two hours file um I I\nThink I think that the the general estimate has been a Seventy percent African American once you throw throw in Asians and Hispanics who jumps to to eighty percent which means twenty percent white voters I don't know if there's a gender or what the gender break down there is", "year": "2018", "show_name": "Political Rewind", "city": "Chatsworth", "day": "16"}