{"month": "10", "state": "GA", "station": "WNGH", "content": "The next radio loud\nAnd it's a night at seven\nHere on gp serving midway and beyond the business G. P. B. in Eighteen station surface of Georgia Public broadcasting it submitted for two o'clock I'm Jude dos and good to have you along today bill not get the next ... political rewind on G. P. B. and GB news dot org\nWhen a life hangs in the balance what does beyond a reasonable doubt really mean\nTroy Anthony Davis joined them on my mind that\nGPA be present the radio play beyond reasonable doubt\nAnd they don't join them for my mom on your bumper\nGPA be present the radio boy beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis\nJoined us at ten am on Sunday October twenty first on G. P. B. radio [noise]\nNinety seven point seven FM WG Bebe and WG PHD room portable Georgia Public broadcasting radio network [noise]\n\nWhy from G. P. B. news is just ... I'm ... [noise]\nHe became well known as the host of a popular TV show his grasp on complex issues that face the nation was shaky as best he was Boyd by a loyal base of support for evangelical Christians and during his tenure in office the partisan divide grew wider\nHe was the forty is president of the United states Ronald Wilson Reagan the parallels\nBetween Reagan and Donald Trump are clear but so are the contrast in their style of leadership and the emotional chords they struck me American people today we'll explore the Reagan legacy with Bob spirit author of a sprawling new Reagan biography Reagan an American journey\nThe AJC Jim Galloway joins me for the conversation but first the new\nFlight from NPR News in Washington I winter Johnston President Trump pulled crisscrossed the country this week in an effort to build support for Republicans headed November's midterm NPR Shannon bandstand reports Trump the whole campaign rallies in four states Trump\nWill travel to Iowa Pennsylvania Ohio and Kentucky he's expected to help the economy in charge voters to head to the polls in November over the weekend at a rally in Kansas Trump celebrated Kavanaugh's confirmation and ramped up his attacks on Democrats\nDon't hand matches during our students and you don't give power to an angry left wing mob and that's what they become [noise]\nOff four hundred and thirty five members at the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house\nFor thirty five members of the house are up for reelection and one third of the Senate is one hundred seats while also being on the line Democrats need to win twenty three seats to gain control of the house Senate ... NPR News Washington a un report is calling on countries around the world to do more to combat global warming\nAs Larry Miller reports scientists are warning of severe environmental changes including heat waves devastating storms droughts and the loss of species\nThey argue cc's says even keeping the earth's temperature rise to the two degrees centigrade targeted greed of the Paris climate change talks is too high when the world is heading toward of three degree rise\nThe BCC says only by dropping to one point five degrees and the worst effects of climate change be avoided\nThis report says manmade sealed to emissions new to drop to zero by twenty fifty also renewable energy would need to supply up to eighty five percent of electricity compared with twenty five percent now one eye PCC board member warns\nThere is only the slimmest chance of avoiding unsinkable damage to the climate system that supports life as we know it for\nNPR News I'm Larry Miller in London\nPakistan's Supreme Court has heard the final appeal of a Christian Woman who's been sentenced to death for blasphemy\nNPR's the hippie reports that's emerged as one of the most important cases in years to reach the Supreme Court there the quarter is enough to judgment on the appeal and didn't say when it would be announced over the years the case against us he'd be has led to the assassination of two senior officials one of them was noted by his buddy God\nWho is now revered as a nice thing to buy the religious right\nThe case also unleashed a powerful extremist movement and their leaders wound of terrible consequences if BP was granted leniency NPR's ... reporting from Islamic bought\nThe death toll from a powerful earthquake and tsunami that struck central Indonesia and nearly two weeks ago is nearing two thousand search and rescue crews continue to come through a mud and debris on ... island searching for survivors thousands of people are unaccounted for\nStocks are trading lower on Wall street at this hour the Dow is down forty two points the NASDAQ down eighty three D. S. and P. down nine this is NPR\nLive from the G. P. B. news remind melon Reinhardt introduced awesome political rewind with Bill Knight is coming up at first in Georgia news the national Park Service is working on a plan to protect vulnerable nesting animals from predators GPA's Emily Jones has more\nLots of what the Park Service calls species of concern\nTo protect vulnerable nesting animals from predators GPA's Emily Jones has more\nLots of what the Park Service calls a species of concern hang out at national park sites throughout the southeast and dangerous loggerheads and can threaten the sea turtles piping clovers the southeastern beach now\nAnd he asked is working on a comprehensive plan to protect those creditors from predators like raccoons and coyote Doug Hoffman is a wildlife biologist for Cumberland Island national seashore he says experts will share knowledge across part\nWas produced is based on what we know from our mind parts but it can also the ...\nAnd other smaller cars they really don't have the knowledge base that some of those two\nNPs is hosting ... this week and accepting public comment through October twenty sex for keeping the News I'm Emily ...\nGas prices in Georgia rose six cents last week according to motor club AAA the average price per gallon was two dollars and Seventy eight cents\nThe most expensive gas prices are in Atlanta Athens and savannah the least expensive gas in the state can be found in Augusta Columbus and Warner robins AAA spokesman mark Jenkins says concern over global supply and demand continues to weigh on oil prices\nHe says OPEC output remains low and us sanctions are inspected to limit exports of Iranian crude oil while global demand continues to rise\nIn sports the Atlanta Braves kept their season allied last night with a sixty five when over the LA Dodgers Atlanta must win back to back games to advance in the playoffs pop and Dodgers only need one more victory to win the series\nSupport for NPR comes from NPR stations other contributors include progressive insurance offering its home quote explorer so shoppers can evaluate options in one place when buying home insurance custom quotes and rates are available online learn more at progressive dot com\n[noise]\n\nGlad to have you with us for today's political rewind build I hit a we've got a great show are lined up for you today we're going to be talking about the life of Ronald Reagan a new biography by Bob spits he's with us live in the studio\nBefore we get to that I'd like to make just a couple of brief announcements first of all a you know our pledge drive our fault pledge drive ended on friday afternoon and I want to thank you for two things are number one\nSo many of you supported G. P. B. radio and and told her folks you were doing it because political rewind this come to\nThings are number one so many of you um supported G. P. B. radio and and told our folks you were doing it because political rewind this come to me and a lot to you in terms of the way we talk about the political news of the day\nSo first thank you for that but second I Know believe me how frustrating pledged shows are I mean we talk for a few minutes that we go to a long pledge break we have to do that because it's how we used to stay in our work\nBut the fact that you stay with us and still want to hear what we have to say is is something that means a lot to me and I and I appreciate the fact that you did just that okay I'm\nWe're going to be as you know in Savannah and I'm an October thirtieth doing our show in front of a live audience we still have some seats left I'm told it's free of course but we want you to register because we want to know that we have enough seats for everybody just go to G. P. B.\nDot org gp be news dot org slash community and you'll see how to do that\nOr Atlanta that which is a week from tonight is sold out completely um whoa they all know you're going to be their Galloway court well even even if they come up a and a couple of other quick notes on friday\nOr we're going to have a Stacey Abrams live in the studio to talk about hurricane that's going to be fun job\nOr get your questions ready [laughter] in one way you can do that of course as you well know is by of watching the show on Facebook Live just go to the G. P. B. news page on Facebook\nAnd joined us and if you've got a tweet she wanted us to ever go to college the extreme the be All right ah ten fattest gotten all the announcements out of the way now\nHe's looking at a shape [laughter]\nOh election night we're going to be on all night election night we're going to start with I think TV at seven in the evening to an hour on TV then we're going to be on the radio on the state wide network\nFor the rest of the night bringing you on the news as in one of the most consequential elections in decades in Georgia and across the country All right that said we've already settle briefly to Jim Galloway the lead political writer for the Atlanta Journal constitution you read his column\nUp by the way we just got a Facebook Live posed from Eric Garner and he says something but I'd like to address very quickly sure he says oh definitely no fan of Reagan he was a total disaster\nTo the Republican Party I and other things and to my GB T community and certainly it's true that he was no friend of the ... the examination of his life\nWe're doing this we're not making any judgments about whether that visit him I'm not talking about Reagan because he was a great president I'm Talking about him and I think we all are because he was a fascinating human being who certainly had an impact on politics I met an American life for good\nAnd ill and had a and had a great story to tell too I mean look I feel the same way as your listener um as I said I didn't vote for Ronald Reagan but\nThe story was incredible and and I really felt that it was kind of like the way David McCullough quid right about Truman ah you know it's it's a page Turner and you can't put it down and we learn a little bit about ourselves by reading about\nThis All right so Reagan ends up going out to Hollywood or because he's kind of at a dead end in his life in in well you know what\nLet me just correct or had all this one thing that we forget about Reagan's broadcasting experience is that he was the voice of the mid west I mean people for eight states every night listen to Dutch Reagan and\nThey knew his voice he was a media star wherever he went and and uh in Illinois and Ohio right above Red Barber at one point was yeah incredible and so it it was only a dead end because it was a dead end for him for him to ... right he didn't\nHe didn't that's right okay so we ended up I'm a sports trip\nLA yes right he was he was going to spring training\nOr the cubs were playing in a ... cat arena thank you a senior moment there for me and I'm and Reagan he goes there but he knows that he's going to make a a detour to Hollywood because he's going to give it a shot he's going to see if he can do a screen test and who knows he didn't ...\nBut he knows that he's going to make 'em a detour to Hollywood because he's going to give it a shot he's going to see if he can do a screen test and who knows he he didn't expect much of it but he decided to give it a try\nSo and we know that and of course that gets what happened he ended up moving to LA wants to be an actor and pictures or his career this is another thing that I think you are really illuminate for us is how unsuccessful he was early ... and he just he was the activists to be actor yeah I'm\nThere were two parts that really put him on the map at least a little bit ... the biggest one I think you'd have to say is the picture kings row bullets play the famous moment and then tell us what that was all about listen\nRandi [laughter]\nThat was the line better whereas the rest ... he was playing a part in which he lost his lakes\nYup well actually you know he didn't have to lose his legs but uh he was dating this woman and a father who was a doctor was I'm very\nHappy with that and so when he has an accident and has to or the or has to have an operation that Dr decides to remove its way this fall or use or underwriting as we used to I mean wakes up and wants to know where the rest of them is actually a high rate of his career\nThat's exactly right and of course that wine lives to this day as one of the most famous lines in the movies of that era and a lot of its opponents have always been asking you know where's the rest of the fact of the other picture a ... you know with the new rock neat story yeah even when he wanted the part of\nWhat was he was he didn't wanna rock rock but then he looked at the part of a ...\nAnd he was in ... the producer didn't want him I mean because they wanted a real star and they weren't getting a big star several Reagan suited up in his own car would uniform and winning and through a few bullet passes to the producer and and that's how we got that job you know he ... over the\nSuited up in his own call would uniform and winning and through a few bullet passes to the producer and and that's how we got that job you know he ... over the producers objections making ... career forever yeah Jeffrey Wright trying\nWe one for the get free plays a part of the young Notre Dame kid who dies or early in his life as a real\nScoundrel by the way in real life I mean he was he was a gambler a smoker and drinker a gamble against games and he played in but they kind of rewrote fat All right\nWe're going to move on our guest is Bob spirits we got to get to a break his new book is a biography of Ronald Reagan and we're going to get\nTo the political career of Ronald Reagan in just a minute but let's pause for just a brief moment and then come right back\n[noise] shoo [noise]\nThis game when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which had been collected in a new book\nOn the next fresh air we talked with his son Adam Cohen who wrote the introduction Adam also produced you want it darker the album his father recorded shortly before his death join us ... shares this afternoon at ... ... ... ...\nFrom MORNING EDITION and on second thought Toyota ... split their support make everything you hear on the possible if we didn't hear from you during our fall fun to hide your contribution now will still make a difference [noise] please take just a couple of minutes to support the\nPrograms you rely on them enjoy on ... and do your part now at whatever level is right for you\nGood at ... dot org and donate and thanks so much for your support at Georgia Public broadcasting [noise]\nOr General Electric chair as Ronald Reagan bathing tonight John four or five dollars on the general electric there\nAnd it was the product report that show how in the thing that lead to a better life for General Electric [noise]\nProgress is most important product [noise]\nThere's another highlight from the entertainment career of Ronald Reagan we're talking about a Reagan's wife with Bob spit too is the author of a brand new biography a Ronald Reagan an American journey a gym galleries with me it's\nA Reagan's life with Bob spits who is the author of a brand new biography a Ronald Reagan an American journey a gym Galloway is with me it's Monday I'm generally so his career in Hollywood kind of stalled out he ends up in TV hit\nThe ... where I didn't want to be a T. V. guide because it was so new he didn't believe anything was going to come of it he didn't want to die and TV [noise] um but she was the only game in town they offered him a\nLot to be a host of their weekly anthology and and he took it [noise] yeah and it's it's it's just it is it that's one of the great coincidence the coincidences of American politics I think yes he ... he he went into this medium mastered it\nAnd then he hit his political stride just says that that same medium was taking over American politics yes and not only that this is where Reagan\nBeing the spokesperson for GE rarely finds his political voice it happens right here because part of the job was that they asked him not only to be their host\nBut during the week when he wasn't on camera to be their ambassador and that in town his going through a almost all the G E plants in the United states and there were many with\nTens of thousands of people working on them to just talk to people and hear what was on their mind or to talk about politics to talk about government and he gets a sense of the working person and what is missing in their own life\nAnd how the government is affecting them I I Know you ... did a lot of detailed research you did you did you did you ... it turned out where those GE factories were geographically\nAt our ... I mean the biggest ones were on the east coast but you know across the country there were there were many major plants a and he hit them all\nYou know Jim here's where we see one of the real parallels between a Reagan and and and Trump I mean first of all of course they both came out of the entertainment industry but it was during his time a General Electric Bob spits tells us that Reagan started to get a feel for the working man and woman in this country that\nThe blue collar the real working people of the country and he started to get a sense of what they needed once they want it and he started to get a sense of its own politics he had always been a liberal Democrat I mean he was one of the standard bearers for FDR's policies\nSince he was a little boy his father was a an FDR guy\nAlways been a liberal Democrat I mean he was one of the standard bearers for FDR's policies since he was a little boy his father was a an FDR guy and Reagan really believed in the whole package it wasn't until he got out there and talk to the people that she\nThat we see a shift starting to go right and it's it really goes to the right [noise]\nUm and and\nIt moved into conservative politics have a ... he ended up campaigning for for Richard Nixon and sixty\nRight and then I recalled water right to them he was still identify as a Democrat to win I think I wanted him to stay a Democrat or they get Nixon sent a note that said work and this guy is talk in Republican politics but we need him as a Democrat for our costs\nRealized they he knew what to do and don't want to go out of\nTime to pick the vice presidential candidate Reagan didn't want to pick Bush because of that night he said I don't want to man second to me who has no nerve who lost his nerve he could only focus on that night with\nGeorge Bush yeah um it was a remarkable moment and let's talk about what that this isn't an not unusual for the behavior of Ronald Reagan what are the reasons that he was either loved or despised\nWas his willingness to be incredibly forceful to push his will and to exit to exert his will um and that\nWe that scene plays out throughout his entire Providence absolutely\nRight he the one thing you know I Will tell you that Reagan was not always the smartest man in the room and he knew it he didn't understand the big complex issues but he had a gut instinct and when he believed him something\nHe was behind it a hundred percent he wasn't going to let anything stand in the way and so later on of course we get Star Wars and we get Reaganomics\nAnd we get the the the the index cards year after year after year which don't change which\nDon't change and when someone goes off script he's not able to uh to really follow that script and I had to go off script to comprehend something so\nBut as long as we're we're we're again we're comparing Reagan to Trump I think those are the one thing that strikes me out\nFreeway followed that script and I had to go off script and to comprehend something so\nBut it but as long as we're we're we're again we're comparing Reagan to Trump I think the one thing that strikes me out of out of your your book Bob is is that Reagan yes Reagan Reagan understood the power of charisma and the power of the the personal touch but he also understood he he knew what he didn't know\nHe did absolutely you know people always say to me well Reagan was in a big uh a deep thinker by his thinking was deeply fail that's the difference and people in to it and that right away and understood it and and I think that's really what made him so forth ...\nYou know ah you said a minute ago that you know Reagan didn't know how you deal with it wasn't the best informed a guy a guy who got ... one of the quotes in your book that really jumped out at me and I don't know where you found this\nWas a al Haig who worked for Mrs for secretary of state and I covered al have presidential brief\nPresidential campaign and I know what a difficult character he could be but how you quote him as saying rain and it's not a mean man just stupid yeah onto echoes what this is Bob Woodward writing about the Trump White house\nYeah well the difference is the word means you're say Reagan was not a main man I'm and he didn't have a hostile bone in his body\nI'm a ... and also the difference too is that Reagan was to unite or you know I mean that's that was his whole goal that if you want to draw a comparison to to the man today um Barrett is\nWell then before we take a break you call him a unite or yeah let's let's listen to a moment in which he really had to bring the country together you said that\nThe space shuttle challenger on it is but the manner in which they live their lives\nNor the last time we saw\nThey prepared for their journey and waved goodbye\nSlipped several bones other [noise]\nTo touch the face of God\nThe president of the United states addressing the country in the aftermath of the challenger explosion but you set this up force there was another method was supposed to take center stage that day was the Davis a state of the union\nAll live with the state of the union address aptly right and uh and and it wasn't going to be well thought out yeah he was having a rough time he\nThe union all live with his state of the union address has aptly right and uh\nAnd and it wasn't going to be well thought out yeah he was having a rough time he was in fact Reaganomics was a disaster disaster exactly right that people weren't buying\nThe strategic Defense Initiative and ... and his popularity believe it or not was it thirty five percent of the day after he gives that speech about the challenger\nHis his popularity hit Seventy percent [noise]\nThis is this is this is the key difference between Ronald Reagan and Donald silver lovely Ronald Reagan understood the power of a good script and he knew what a good script was said you had good script writers that\nHe was also a great performer he was a great performer and I have to tell you that a lot of those speeches and he gave he wrote himself believe it or not he wrote them out long hand\nHe had people polished them afterwards but he um\nHe was a pretty good uh a pretty good writer running on his own merits All right we got to get\nTo another break no let's do that we've got so much more to talk about um one of the things that Bob is your book ... ... ... ... it's you'd have a gripping account of the day or early in his tenure two months in\nThat uh he was almost murdered in this essay assassination attempt we'll talk about that and a lot more when we come back with Bob spits author of Reagan an American journey\nThis fall we're counting on the participation of everyone who listen to cover the rising cost of programs we bring you ... if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life\nPlease take a moment now to make an online contribution G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you fly out and cover the cost of the programs you love on CPB\nThank you so much for your support of Georgia Public broadcasting\nFive space and Jim Galloway with me in the studio today I'm five march thirtieth Nineteen eighty one that's literally two months for the day he was he was a knock rated on ... January twenty isn't a Nineteen eighty one two months later he is giving a speech at a hotel in downtown Washington what happens\nOr he's coming out of the speech in a speech he didn't want to give it was to a union people as a matter of fact ah people who weren't going to vote for him and so he went as a matter of courtesy because he said he wanted and as he's walking out on a young man appears from that\nUh people who weren't going to vote for him and so he went as a matter of courtesy of course he said he wanted and as he's walking out on a young man appears from the crowd and fires several shots let's listen to how CNN broke into its news programming to give their special report\nHas been elected a lot of shots reported fired outside the hotel or President Reagan spoke a short while ago ears Bernard shaw in our Washington state\nSales are very sketchy at this moment we don't know precisely what happened we don't know the sequence first of all the president has said we're told at shots were fired as fast as funny as you love the hotel\nThe district of Columbia metropolitan police report that at least one police officer and one Secret Service agents have been injured they were shot down their condition we do not know\nThe president was not safe it's understandable and the scramble to get this story out immediately apparently even the White House was putting out word that Reagan was safe even his Secret Service or\nA person ... when they ... they are determined to a car I thought that\nYou know he just had the wind knocked out of him he was he was he was thrown into the car the agent you describe it vividly throws himself right on top of Reagan Reagan said cherry get off me I feel like you're breaking my ribs I Can't breathe yeah um he he's taken the George Washington hospital yeah\nWhere he is closer to death than many people realize to this day it was touching go I mean the odd thing was he had just bought this gorgeous news\nAnd as he's laying on the gurney they're cutting they realize he's been hit and they're cutting the suit off of them and raking can at least ... in and out of consciousness but he comes to one point he says hey hey hold on you're ruining my suit I mean you know it was\nThere was a it was almost comical but it was it was touch and go and there was a very good chance that at one point that he would not make it you know Galloway you know how we always\nWe we we play in our mind certain things that people say to us in later we say oh if I had only said vis well the doctor who operated on Reagan had a moment in which he got it right Reagan says to him as sort of go into surgery I Hope you're a Republican and the doctor says we're all\nRepublicans today that's right and the doctor was a a lefty affect ah it it they couldn't find the wounded or no no it wouldn't be the bullet when I was just a tiny twenty two\nAnd uh it it they couldn't find the wounded or no no bit the bullet when they hit it was just a tiny twenty two was and I was at twenty two and a ... he had filed the he had filed the bullet but also when it went through it went through\nA groove in the car and it flat and so it was the shape of a dime and when I entered Reagan they they could barely see the sweat that went through his body\nAnd so they had a very hard time finding that that bullet\nAnd and and removing it to\nHis uh his numbers shot back up again in the aftermath of ...\nYou know you hate to think that that's necessary [laughter]\nReagan Reagan I think he said a joke and what you said you know if I could only get shot every day the way my numbers are going to get a prompt\nMe had was a course number one\nHis economic plan never accomplished what he believed what you know boy he hated George W H W. Bush among other things for about ... to economics forever and the campaign and never quite got over George W saying that\nBoat Reaganomics became as negative label as Hutu economics at\nBed no that's true and but even today the Reagan people in says that fat economic program saved our country out on it they were this is one thing that they're ... they're wrong longest\n... if I if I could take it back to the the the ... nation that took\nA James Brady of course we'll shut the was gunned down he was the press secretary for Reagan he was never the same after that now a ... but the but a a a an anti gun violence of organizations sprung up around him ... where was Ronald Reagan on on guns and gun control and the second amendment", "year": "2018", "show_name": "Political Rewind", "city": "Chatsworth", "day": "08"}