{"month": "10", "state": "FL", "station": "WFLF", "content": "You know I haven't worked shapes we also feature beautiful matching tool chess and furniture with hundreds of thousands of satisfied customers and a huge network across the U.S we've built our reputation on having the best built best looking and most convenience sake what great surface and warranties and you can get online financing so go with the best\nAnd get style convenience security and true peace of mind with rhino safe dot com today that's rhino safe dot com rhino safe dot com [noise]\nI've only counting of the great American thanks for listening and I didn't know is always a check to have on the president\nAnd a share his thoughts with you\nAnd uh I understand it's going to happen a more frequently or over the year twenty Nineteen and twenty twenty which I could not encourage it imagine this country imagine some of the fallout and what about uh three weeks three weeks in a day or two if the Democrats take the Senate\nOne consequence of that will be\nThere will not be any federal judge has confirmed\nOr by the U.S Senate over the next two years and won't happen and then if Trump is reelected and twenty twenty what'd you this point appears to be likely and the Senate stays democratic and twenty twenty they will not come from any federal judges for the next two years or for the next two years after that\nSo we're looking at possibly a six year timeframe that the Democrats take the Senate when there are no federal judges confirmed by the state Senate under Chuck Schumer thing about that and the impact that would have on your life in my life\nBecause CNN and the Democratic party and NBC ABC and CBS\nListening Leslie stall and sixty minutes few hours ago there in a complete meltdown over the possibility that Trump could be reelected they're doing polling already encouraging Joe Biden or Bernie Sanders to run and I can dent in twenty sixteen\nThe only Democrat that Trump could have beaten was Hillary Clinton every other one probably would have beaten the president\nAnd America would not be right now mourning in America revitalization a brand new American economy three point seven percent unemployment rate crack down on the southern border we're new ... new trade deals with Canada and South Korea and Mexico the president just talked about with you and I\nWe wouldn't have any of that stuff going on and so that's why three weeks in a day for now it is so important especially if you live in\nUh Ohio if you live in a if you live in Missouri if you live in North Dakota if you live in Florida if you live in Texas there's the fear in Nevada there's a few critical races that will determine whether or not the Democratic party will investigate\nOr whether the Republican Party will legislate\nJust think about two to six years ever having no federal judge has confirmed anywhere\nIf the Democratic party text US Senate they will shut down completely they will not work with this president to get anything done including criminal justice reform reforming marijuana laws whatever it might be the president is on the precipice\nAnd twenty Nineteen and twenty twenty of doing some great stuff and I do not believe I Do not believe the Democrats are necessarily going to take the house I Do not believe that the polling was so wrong and twenty sixteen it was a joke\nAnd so if the house in the Senate stay in Republican hands good stuff this is just the beginning on the other hand a wise man told me in Washington\nThat the first two years of the Trump presidency will be peaceful compared to the next two years if the Democrats take the house and or the Senate that what we're going through the past two years to fight coal and scream to move this country forward\nWill stop completely and there'll be investigation upon investigation and no legislation it'll be think Trump at all costs saying the ss Trump and you know and I know and so if you're in one of those contested congressional districts\nWhether it's California Texas Florida Ohio Colorado North Dakota wherever it is go out and vote Republican to keep the house in the hands\nOf ah the successor of Paul Ryan whoever it might be and especially if you're one of those five or six states that have a Senate race that is so competitive\nWhat like in Nevada or Arizona or North Dakota or Missouri even in Michigan Ohio Florida you've got to go out and vote imagine the world with Nancy Pelosi and Chuck Schumer completely in charge of the house in the Senate because at that point zero zilch NATO will get done\nCNN and et cetera is into destroy Kanye West mode because the most loyal voters in America are black voters for the Democratic party and when African Americans figure out what the Democratic Party historically has done to them and not for them hopefully the Democratic party ...\nThanks for listening and I think not I think having the president on is always a great joy also Bill O'Reilly the book is killing the ss and of course diamond and so can I don't know how we equal or exceed this kind of show next Sunday night but the great American built Cunningham\nWill do my thanks for listening tonight and fleas urge you if you're in one of these contests in house districts are one of these great Senate races please go out and vote to goes to the future of this country is still coming out the great American [noise] live with you and the president [noise] some [noise]\n\n\n\nMessaging ... burning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little lists sixteen months one hundred percent on line\nTo find out more text market to seven nine six four or five\nThat's an A. R. K. E. T. to seven nine six four or five\nStar cheer on line NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line text market to seven nine six four or five\nThat's an A. R. K. E. T. to seven nine six four or five\nThere are certain God given rights to be fit to have shelter medicine and clothing and many of our clients come to us they faced a great risk of losing much of what they have in some cases losing everything\nI'm John Morgan Morgan Morgan [noise] in one instance an accident a natural disaster or the potential acts of others can threaten our dignity [noise]\nWhether it's the loss of a paycheck pay medical bills in during the life of pain and suffering or a claim was your own insurance\nIt's also far from complete but it's all we have it's all we've got\nAnd there's no mention of the great pyramid [noise] in fact\nThere was virtually no information anywhere on the temples on piracy on ...\nYou would think that the great pyramid which is dominated the vision\nOf every Egyptian for thousands of years right the same as it does with us today by the way it it just dominates the skyline right there off the Nile you would think that there wouldn't be\nA topic of conversation that has carved into the walls the temples every burial chamber in the valley of the ... the walls of luck sir cardiac and so it is not\nToday there are thousands and thousands of books written about the great pyramid you've got documentaries and they are everywhere the earliest explorers all drew it they wrote about it but the Egyptians didn't\nObviously obviously we don't have the instruction manual\nSo it's true purpose is up for grabs we honestly have no idea why who or when it was built\nI look at it this way five thousand years from now if some archeologists dug up the u._s. be some drive that had the history of us on it music art literature\nWould they know how to use it would they even know what it is maybe I don't know but but I Would guess probably not\nBut today the great pyramid is starting to give up some of its secrets last year a new chamber was discovered above the grand gallery I've talked about a lot here on coast of my other show\nThree or four boys have also been found two months ago a paper was published about a focus to E. M. energies that were possible and last week by news save Saturday who is my guest tonight published a report about how the located additional chambers inside of the great pyramid [noise]\nWe had been told over and over again that there is nothing left defined inside of the great pyramid and today we know that this is clearly not the case\nAnd it's with his work and others that we may soon unwrap the gift that keeps on giving\nThat is the great pyramid of Egypt so turned on the lights and get ready for this is a very special presentation on coast to coast damn\nYou can follow me right now on Twitter at J. church radio and you know the drill Twitter is always lied to my left right here in the studio the lights are down it is dark in here\nAny questions or comments you can post it right there and Twitter and if it's good maybe your tweet we'll get read on the air now enjoy the bumper music tonight I Try to\nFold the little Egypt into things but I also wanted to have some fun with the music you know I like my rock and roll so tonight\nEnjoy all of that and we are going to open up the phones it is a very special show here tonight with my new and I know that all of you want to get involved\nThe great pyramid and the questions behind that we have been discussing not only for years here on coast to coast but for centuries with us it is part of our popular culture\nLet's do this I Am your host Jimmy church and I'll be right back with my guest my new save sad day this is coast to coast am [noise]\nCyber criminals can attack your laptop tablet or smartphone without warning or they can steal your identity and you may not realize it until it's too late lifelike identity theft protection now includes the power of northern security\nTo help protect your identity and devices lifelong accuses proprietary technology to help detect the range of threats to your identity like your personal info for sale in the dark Web\nAnd north in security protects against online threats that if there's a problem lifelong Norton agents will work to fix it\nNo one can prevent all identity theft or cyber crime or monitor transactions at all businesses but new life lock the door and security provides more detection and more protection against cyber threats\nGo to life locked dot com recall one eight hundred lifelike and use promote Georgetown for an additional ten percent off your first year plus a twenty five dollar Amazon gift card with the annual enrollment that's lifelong dot com promote George ten for ten percent off and a twenty five dollar Amazon gift card term supply\nMargaret Hogan won't try this televised thought I had I lodged top condition is also a killer is harder to stop talking kind of war it was just incredible feeling said I never felt that you can rent my when I have the editor and how long slide on\nSomething amazing which will taste while I was actually a contract almost staggering it that this was that you can check it out on top I can kind of weight that might have results coming for\nLike a kind of our ... ha excuse the pun well I\nThink that works beautifully owner Richard astro here we're talking about the power of waking up your immune system which has hailed this gentleman's haunt perhaps the immune system can be called one of the bodies fears this powers to he'll visit\nC. A. R. N. I. V. O. R. A. dot com or call one\nEight six six eight three six eight seven three five that's one eight six six eight three six eight seven three five when bags\nWeekdays Ninety until noon on news radio Ninety three point one [noise]\n\n\n\nWelcome back to the coast to coast am Merrill's Jimmy church beautiful Sunday evening here in Southern California and the great pyramid is ... and in Egypt and loss history it's it's something that I study and research nearly every single day\nAnd I want to get to the bottom up and I'm hoping I'm hoping that soon and it feels like we are getting close to breaking this whole thing wide open\nMy new saves the day is a practicing dermatologist right here in Southern California has a background in physical sciences trained in microbiology and molecular generics\nHis book the ... the cycle the idea behind the architectural design of cuckoo's Great Pyramid decipher the timing of the most sacred celestial objects observed by the ancient Egyptians first became geometry and then the court design of the most famous monument in the world\nHas also coauthored articles where the Robert shock and Robert Duvall were they explored the true origin of the greats banks are quest that led them all to yet another ancient Egyptian creation story\nAnd the code that started it all his website is right there are coast to coast am is Chiapas pyramid dot com you can click on it\nAnd I would like to welcome but the first time to coast to coast am Manu safe side a month my new good evening\nHello Jimmy how are you good happy birthday\nOh thank you so much that was a lot of the audience know that was a few days ago last week but ah ah do we have you we had you on my other show on my birthday didn't weigh\n... well that was built to put on a and I was the day before\nOh that's right that's right yeah yeah thank you to everybody out there for the birthday wishes and I'll just let everybody know I hit the double nickel I didn't think I'd ever get here but I mean it the I hit the double nickel well\nI'm I'm I'm a year past that I can tell you only get better\nYeah I Know I Know I ... you know it it's so funny my new uh I Would have been in my life uh and the fund that I've had a a growing up that uh fifty five seemed like forever right in the future I didn't think I'd ever get here but I don't feel any different\nThan when I was ... I Wish I had the brain that I have now when I was Twenty one it would have been a would have been a whole different story but let me ask you let let's let's start off a pretty directly hum\nYou're a dermatologist and how how did you get into where you are today working with you know guys like Robert shock and Robert ... ball and now you're one of the leading Egypt\nColleges type researchers in the world right now you've you've really done well for yourself but but what got to hear\nThis is a you know this is one of those things you look back and it's just incredible sometimes you just you know you you you take a moment and you you asked yourself how to get here but\nIt basically you know I I was just like anyone else watching\nHistory Channel Discovery Channel and you know off and on about Egypt and it was interesting but it wasn't really such a you know it wasn't really a ... and focus\nAnd then a ... years ago I um I think somebody gave me the wind mystery by Robert ... and that changed quite a bit for me that was just an amazing story um you know that the Germans were allied with the stars and it's just that that just kind of opens up the up\nAnd and so I started reading a little bit more and uh and then a couple of years ago is when it really took off and and then I said I had to you know I Want it to meet some of these people I\nStarted a you know communicating and I've met a Robert with us on a cruise and uh and I met Robert shock a few months later and um you know just one thing led to another but yeah it's been an amazing I'm with you\nThey are leaving off right now the coast to coast am are Meryl ... church or ... minute safe is ... and it's all the great pyramid all night long we'll be right back stay with us\nShe signed up more of us and I just [noise] ...\n\n\nI might be off the Supreme Court controversy continues Arizona Republican Jeff Flake\nI don't think that uh we should move forward because we're a certain way or with a with additional investigations either into the leak that uh that occurred that allowed to do a lot of a lot of it you know back and forth to go before between Democrats and Republicans\nFlake appearing on ABC's This week flake voted to confirm confirm Kavanaugh after a supplemental FBI investigation will President Trump impose sanctions on Saudi Arabia is found responsible for the death the Washington Post journalist Jamal ...\nPresidents call very swift and transparent investigation I think he's talking about this week\nNational economic council director Larry Kudlow on ABC's This week is just Fox News [noise]\nBackground\n[noise]\n\n\n\n\n\n\nHis\nDues coast to coast am no here's your just goes Jimmy church\nRemember when I was a kid [noise] and I heard that song for the first time I thought it doesn't get any better than that\nHow do you write songs that good but you know it floods up on what do you expect are you a coast insider\nI'm a coast inside or you can sign up right now today over a coast to coast am become a coast insider where you get to listen to the show live on demand computer mobile device you get everything delivered in crystal clear audio you can get the last five years of body archives audio streaming downloadable MP threes\nMedia access through the website or the mobile apps and you get to chat with the host and special gas\nYou get an eye tubes pod cash you also get a direct email to George all for just Fifteen cents a day go to coast to coast am dot com and sign up to become a coast insider tonight it's the great pyramid all night my guess is by news save Saturday\nAnd I've got some tweets in my hand right now but I'm going to get to right after the break follow me on Twitter at J. church radio any questions or comments post I'm right there and they're like these two tweets right here that are more to get to\nThey're going to get rid of their so called me right now at J. church radio this coast to coast am I ... church we'll be right back more with my new right after this short break stay with us\nBoy it's going to be a fun twenty Nineteen especially if you're a fan of the live feed her experience\nEverybody producer Tom here and we're in the midst of planning our twenty Nineteen lives date shows and we're kicking it off with a show in March twenty thirty beautiful Everett, Washington for tickets and information you can go to the coast to coast damn website in the event section where you can call four to five to five eight six seven six six\nFrom there will head on to Columbus ohio in Fort Lauderdale Florida so please keep checking back with the coast to coast damn website show details we found in the event section go now to coast to coast am dot com that's coast to coast am dot com [noise]\n...\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nBut what if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders\nAnd what if you could earn that degree in his little less sixteen months one hundred percent on line\nTo find out more checks path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line\nText path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nIf you've ever experienced heart racing shortness of breath or dizziness if possible you could have a trio fair relation one of the leading causes of syrup might out before do like what cardio mobile the FDA cleared personal EKG device ingest Ninety nine dollars to order the cardio dot com K.\nR. D. I. A. dot com do cardio mobile gets in your pocket you can take any Katie anytime anywhere right when you deal with them in that\nRegard immobile delivered the medical greedy cagey right to your smartphone and just thirty second you'll know your heart rate the normal report atrium ... attack in\nOrder to ... protect Ninety nine dollars mythic cardio dot com K. R. D. I. A. dot com [noise] pick unlimited Katie's morning noon or night you can always know how your heart is doing\nCardio Mobil much peace of mind in your pocket for only Ninety nine dollars [noise] ... party a dot com boom that K. A. R. D. I. A. dot\nCom [noise] ground zero ... Louis we did that news radio Ninety three point one [noise]\n\n\n\nWalking back to the coast to coast am I ... church it's the great pyramid all my big beef or we get to the great pyramid\nOr ... minute say Saudi and my new uh we were talking about the inventories do and the dreams della right before the break and I want to get back to the dream Stella briefly before we start to move forward and end the dreams dial up a top most support\nThe pay for that minute published last week is on his website we're going to be discussing this uh tonight on the show\nIt's like on my news website over a ... goes to I'm going to take his treat there there are a list of papers on the right hand side\nThe current paper is the one that is on the town now with your analysis here minute it gets a little complicated a little technical\nBut the idea behind it is actually quite simple in an elegant which is is some of the layers have a different thickness in stone that take us through bad\nYeah um when when you when you're standing in front of the pyramid and you look up the walls are you when you stand close you don't notice there's so much but when you go further away let's say you're in your hotel and you have a pyramid view\nYou start noticing that there is a certain texture to the pyramid and um ah the review are or who was it was very well known or ... or drop your who don't we reviewed my paper or he calls his waves um and I call it sort of a federal effect\nUm and so when you look at the details of that which was published by fitness petri a hundred and fifty years ago who actually measured each individual course as a function of total height\nYou then you actually see the numbers and so there is these uh you know you you start with really thick courses and as you get to the top of the courses get\nThinner but every once in a while there is a jump so you have a much thicker course\nAnd then the thickness tapers off and then it resumes the overall trend which is a thinning trend and then you have another sudden jump in thickness and just keeps on going and going for twenty three times as far as I'm as far as I see there's twenty three peaks like that [noise]\nUm and ah and then before each one of these jobs petri noted that uh if you calculate the surface area of course and you divide that surface area by the surface area at the base some of these peaks\nHave around fraction of twenty fifth so you know one twenty fifth to twenty fifth ... so he found that there are rounds fractions of twenty fifth associated with some of these ... courses and that was it uh it was not for interpreted what does it mean\nA it was just noted but uh it just sat there um until I took a look at it again\nNow how many layers total and ... and the forty two story great German how many rows\nYeah two hundred three left and probably two hundred and ten\nA originally\nTwo hundred and ten originally is there and I have\nTo have to immediately say there are some researchers who say the pyramid was not completed that was ah they say there was there was a virtual top so it was actually ... at the top\nAnd the rest was a maybe a as fear and you know one of the the most prominent researcher who was proposed this is Robert ... father John Paul ... and\nThe papers on I think it's on a Robert ... vaults or\nAcademia a page and it's also in costs me gloom uh his brother vote to attend these he's in the back of the book where he explains this theory so there are some people that I think the pyramid was not coming to a peek a and of course other people say it was and so theoretically at least you can say two hundred and of course\nNow we have is there a consistency to the ah repeating of the ticker layers\n[noise] um ...\nDoes it every ten steps that every twelve is there is some kind of ... you\nKnow that's a great question I I that was the first thing also I was looking for it but unfortunately I unfortunately no it's not that easy it's it's kind of what you know Jimmy it's kind of haphazard has to be honest with you I I'm I was just struck by when I first saw that I was just struck why did they do this\nUm because you know you were you could just you know simple mine that I thought each step they weren't just a applied the uh the pyramid and go you know in Egyptian the Egyptians designed their parents with the something called they call it the set that which is the pyramid angle\nAnd it's a you know when you walk up a staircase basically for each amount that you go up you go a certain amount forward and that's how the conceptual eyes a pyramid and go so I thought you know each course it should be the same amount like you're going up a staircase each step is the same\nAnd and it's not and and ah and all of a sudden you know the steps gets much thicker\nAnd to question again there's little regularity even to that thickness so when you know it's it's completely off hazardous but of course now I think I Know the answer it has to do with the interior architecture it has to do with spaces inside\nAnd we'll get to that or after the break but what is the most amazing to me about this is that with the different layers of which there are\nA couple of dozen veteran decker yeah that the orientation for the pyramid that it still ended up at the right angle on all four sides\nYeah a to complete the pyramid correctly without any errors but that's an engineering feat that is just beyond comprehension yeah\nWhich which to me I Want it to correct something I said in a shape to block interview I I think I said that uh the ... to ... um shot a shop to ... and ... published at al ... was disappearing or during\nThe twenty seventh century so I I wanted to correct that it wasn't an arcade into big tipper it was a star Iraq so it was starting to disappear in the southern part of the country\nAnd because of that because that constellation big paper was so important to Egypt shows that the authors propose that therefore they began to oriented oriented monuments to another part of the of the big tipper and why the pyramids ended up in that end up north south uh orientation do\nI gotta jump in right there this his coast to coast and we're going to take a break my new this ... to me George we'll be right back stay with us\n[noise] get Daily Show of the age of ... um [noise]\n\n\nThe effects of the administration carnival on clinical signs and cast as Pete challenged with feline herpes virus won the vents are heading this study we're laying a contrarian Stevie em\nAnd Michael lap and TV M. P. H. D. taken away George\nThank you rich we have indisputable proof for the power of carnivores some nature\nThis double blind study is being peer reviewed in an international journals and there was also the study Seventy five percent of the cats no longer showing any signs of their immune condition [noise]\nThis is big news folks the forthcoming study will include cats and dogs to amend shortly we'd like to think about the Michael lap and ... him for his amazing assistance in putting this altogether\nWe're also looking forward to this study with people in the United states\nNow that's carnivores ... dot com C. A. R. N. I. V. O. R. A. carnivores dot com carnivores dot com or call one eight\nSix six eight three six eight seven three five that's one eight six six eight three six eight seven three phone\nCalls today carnivore carnivores ... dot com\nDoes your dog it scratched tinker shed like crazy come to die like pro quarter in Ninety Days plant dynamite kind\nOf fight is trash pickup two bottles of liquor jobs get the third bottle free nearly apparently attacked we can make a three omega six vitamin E. and now six extra directed microbial even better for the ... and ... try and liquor jobs by to get one free pack dynamite dot com\nAnd now the I ... [noise]\nYour smart speaker say Alexa plain news radio not even ... Juan [noise]\n\nWe'll\nCome back to coast to coast am I going to church or guess Manu save Saturday and we're talking about his paper that was published last week and again I Want everybody to go over and get the reference to my news website it is a Chiapas pyramid dot com the links are at coast to coast am\nAnd go to the right side scroll down there's a list of publish papers right there we're talking about the top one now my new I Want to jump ahead and let everybody know in that PDF\nIf they scroll down to page three twenty six you strike three hundred ... a a scrawled on page three twenty six where you have an illustration there\nOf the layers and with a kind of way showing the grand gallery and of course the kings chamber and the queens chamber the descending passage way and the ascending passage way up to the grand gallery\nAnd so working from the bottom the first layer up a which we're talking about a road number eight Seventeen Twenty one and of course thirty for these must have been for you and I want you to take the audience through this\nBut these are game changing moments when you see these alignment these layers weren't they\nThat was a game changing bowl and you're right I'm I'm On this thing all the peaks you know the total number of peaks was twenty three some of these peaks a war specifically noted by peach tree\nTo have surfaced a ratios that were around ... a number of fractions of twenty fifth so you know six twenty fifty five twenty fifth\nAnd I'm a and those are also this that and it turns out that those courses that are associated with these round fractions tend to run\nA over ceilings in a in that of course we don't have a lot of feelings but the few that we have there seems to be a correlation and thirty four is the most striking one it goes right across the queen a chamber\nAnd based on this ... this observation that there is seems to be a correlation between round fraction twenty or you know courses that have a surface area that is around ... number fraction of twenty fifth\nI Am proposing that the top part of the pyramid where we don't know of any spaces and war but where we nevertheless also see these type of round fractions of twenty fifth that there must be space is just the same up there and I'm saying at least six if not then\nNow we're going to get to that ... exactly that's on page three twenty eight yeah but staying on page three twenty six with this cut away yes you need to have if you are going to propose these extra chambers above the kings chamber where there\nIs supposed to be nothing right but then you have to have some basis for this and clearly we have a I I'm just looking here one two three four five six seven eight\nAbsolute definitive uh marks on these roads starting with the descending passage way all the way up to the top of the king's chamber\nRight so for example a course on the Twenty one which is a ... which has a surface area that is around fraction of twenty fifth Nineteen twenty fifth that aligns with the uh the uh you know ...\nAh that guard the entry of to the great pyramid show right that that cost on the Twenty one is right under the V.\nUh so it is in other words if a soldier with a feeling than the than the one that we just talked about is a course number thirty four also has a round fraction of twenty fifth sixteen in this case and it runs right over the feeling of the queen chamber\nOr then the other courses don't don't have round fracture the twenty fifth and they're not associated with feelings so it works out very nicely and then we go to the top and there'll be have eight a we have eight twenty fifth\nUh and that goes across the feeling of the um off the ground at tower\nI'm now there are ... there are two courses nine twenty fifth and ten twenty fifth and those ... line up with a with a two of the relieving chambers in fact the tower\nUm and and then the final point I wanted to make is that the possible avoid which I marked in here\nThat was found last year is also aligning with eight twenty fifth so it's possible that that causes marking not just that granted power but maybe also the possible avoid if it's for real\nWhich we are talking about a rose sixty eight\nA that would be a that would be will eighty four\nNo roe eighty four is at the top of the king's chamber am I reading this correctly I\nYeah you are it's not the top of the king chamber and that also happens to be a you know within the resolution of this scanned that they were publishing that also approximately the top of the ... the big boys\nI got it yes yes of\nCourse we don't know exactly but we just it's kind of aid the image so I just kind of like you know painted that into this illustrations just to give up guide\nI Want to jump back a really quick I don't want this to get away from me there was a tweet earlier that is a pretty important and this is from eddy\nYeah and and he says does ah does my new see any connection between a dynastic Egyptian use of the lion and the use of the law\nI in at go back ... taffy and everybody's talking about go back to be today and its relationship with ... and the great pyramid and and the other things throughout dynastic Egypt is there a connection\nYeah that's a fantastic question um and I am actually I'm I'm currently looking into that uh with Robert shark we are um we're trying but I'm not ready to make a statement yet\nOkay but the the use of the lion see this is what I find fascinating when we go back on these dates\nAnd we constantly land at ten thousand five hundred BC for a variety of reasons one of course\nUh what was going on with the stars we understand that but then we have all of the uh cataclysmic event the end of the ice age the construction of go Beckley tabby the erosion on the banks all of these things are Leo Rising right all of these things happen\nAt ten thousand five hundred BC yet which makes go Beckley happy not an accident\nNo with his references of course with lines to as low extraordinary\nYeah no absolutely ... it's a fantastic question and I don't want to you know jump the gun because I Can't really speak with authority yet I'm so maybe the next show um maybe we'll have something more but it's a great question\nLet's go to a um I'm gonna get to the top down from the pyramid and we're going to work on that in a second but got some calls that have been holding for quite a while to speak with you my new let's go to Barry in South Carolina Barry welcome back to coast\nHello there ... and you know what I'm getting ready to say yeah man\nYeah go ahead Barry did yours\nGo back ... Kathy\nYou like that my news you like to the area [laughter] okay I\nExcellent question and I'm just going to give you a quick answer as quick as I can so um as far as we understand it the Egyptian language originally was a composite of two different cultures the one culture was the southern Egyptian culture\nAnd that script was mostly phonetic um and the evidence from that comes from ...\nA king scorpions and that is I think were the African roots sly\nOther script a that was intermingled initially comes from northern Egypt uh probably from Bhutto\nAnd Bhutto was a sort of a trading a settlement in in the delta and they were trading with ah probably Mesopotamia with the live on and so they had a different kind of script that was mostly a big Charles so it was picked up perhaps\nUm so what you saw what it meant while in the south what you hear is what it meant and so I think your question is very well taken and I think yes I think the uh the southern Egyptian script was probably a originally Africa maybe you know ... hair or maybe I'm maybe even further south and that\nAnd she brought up another really good point uh before we get to the break we've got about thirty seconds it was the Greeks adapting a bad analogy a chemistry coming from candidate\nRight yes the issue I think she mentioned it stinks so my we we think that speaks was making before uh before Africa game I think it was we were I think it was a line is and then they must make eat and by the way that's also probably an African of Africa or did you\nTake a break right here coast to coast am it's\nAll Great Pyramid all Egypt all night long or get tonight my new save da de\nHis paper is right there click on his website the coast to coast am we're going to discuss the rest of it after the break stay with us [noise]\nFind out more about tonight's gifts to log on to ... am dot com and\nGet it\nA in the meantime\n\nIn Maine raining when all takes me out on news radio Ninety three point one\nJust\nBall or the people that have ruled the earth to cool they didn't like that so for two hundred and forty two years they've been trying to get it back and we America has risen that's the fight that we see going on right now\nDoesn't it still feel out of kilter resolve to you know there's something wrong\nThere's a grand for this out there that need not just once they need to capture the soul of the world but I don't think they're going to win I don't think they're going to win\nHere's Stacey co and with the daily consumer on XM satellite radio well\nThat that is that like to see a little more to the online the Federal Trade commission said online data brokers and happy so consumers the information they collect about them either hold your breath and wait for this to happen but that it's not something we recommend should you have to turn over your Facebook password\nIs part of a job interview to US Senators don't think so and they're getting on building a jacket department investigation into what seems to be a common practice the [noise]\n[noise]\n\nNa na\nNa\nNa\nTo talk to to meet your gall the wildcard mind at eight one eight five zero one one zero in on the first time caller line is the one eight vibes zero one for seven to one to talk to Jimmy from east to the Rockies called eight hundred eight to five five zero three three\nFrom one to the Rockies toll free call eight hundred six one eight feet to fine fine uh\nThis is coast to coast am\nWith your guest host towels\nChurch earlier\nThis week I interviewed Brad plow soon be the artist for Pearl Jam and\nHis knowledge of the ... are in sculpture and how he incorporates bad into his artwork\nAnd what that caused me to do I I just love to research or all things Egypt right\nAnd so as I was preparing for the show tonight I just went through a Pearl Jam I could not stop for the last three days and I just had to get a that song in there it's just absolutely amazing also over on the coast to coast am website\nThere's a video that you have to check out the edge of the Boston Dynamics at was robot doing park corps\nHe is one of the most disturbing videos you are ever going to watch\nThe apple its programming upgrade has enabled it to do park core fight for real that I didn't see any cables holding it up this thing is full on Schwarzenegger Terminator action going on that's right it's it's this\nHumanoid robot that is jumping up and down offset blocks without breaking pace\nIt's incredible the control software allows the automation to use its whole\nBody to navigate these complex obstacles\nI'm Serious we might be witnessing the birth of the Terminator you've got to go see this video\nRight now over a coast to coast am dot com tonight it's all Egypt oh Great Pyramid all night long our guest is my new saves da de when we come back we're going to get to the top half of the great pyramid and what just might be there\nThis was coast to coast am I'm your should be church we'll be right back stay with us [noise]\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to ...\nEven getting up at night to go this is not okay listen\nThe makers of super beta prostate the number one prostate formula are introducing a new one pill super beta prostate piece three advanced with three key ingredients that are great for your prostate it's like taking three prostate supplements in one\nTo celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supplies free\nPay shipping and handling just dial pounded two fifty on your mobile phone and say the key word free bottle\nEarly research suggests that an ingredient in pain three advanced may help support an normal prostate sauce combine that with reduction in urges the pie and you have a formula you'd be crazy not to try try ... three advanced free\nDial pound to fifty on your mobile phone and say the key word free bottle again dial pound to five zero and say the key word free bottle method you ...\nIf you're considering going back to school I guess also following questions\nThe any of the flexibility to take classes in your schedule you have college credits to transfer do you want to earn equality degree from a world renowned university if you and said yes to any of these questions Arizona State university is the perfect school for ...\nArizona State university offered over one hundred and fifty highly Wayne degree programs one hundred percent on line\nYou learn the same degree if you went on campus from wherever you are on your schedule class only the one line except transfer credits for information piped fly ... three five sideline sapping\nLearned for yourself fly all the ... member one for innovation by US News and World Report and learned to thrive lay the Arizona State university for more information about all the one line ... live to ... and that's how the two three five five lines sat and\nLet's let's get one more call and maybe to be for the top of the hour they are completely a jam W looks kind of Thomas in law why Thomas Manu\nJeremy thank you for taking my call Manu ... search you know my question as we have the supply town and the pyramids the banks have there been any\nIntention to reconstruct the original boring a key subplot to do and I know that sounds radical but for example the great pyramid is missing the capstone and it just seems to me that\nYou could bring in architects archaeologist perhaps with special needs some remote viewing\nHim to an intuition and actually reconstruct the temples repair the temples have less been discussed\nYes and as such a great question I'm so there's two answers to that the first one is that uh the\nMinister of antiquities is trying to partially restored a monument so you get a feel for what it may have looked 'em but they don't want to cover it up all with you know modern reconstruction they just want to give you a sort of an idea so they may may they may do a section\nAnd then they leave the rest on touched\nSo that's the first part of your question but there is something even more exciting going on and I have to reference a\nA Harvard or it's called digital visa and what they're doing and this is on the direction of Peter I'm a new area and um they are basically recreating gays or a a ... in in the virtual world and I predict\nIn a few years you'll be able to uh descend into virtual world and it will be exactly like the way it looked as far as the way we think is look then you'd be able to go into all the chamber's look at the inscriptions and it'll feel like you know uh the real thing and I they're working on\nNow with these additional chambers in the upper half of the great pyramid where did you come up with the number six or eight\nRight so because we have we have a sequence of ah courses that conform to this uh you know the the simple rules at the surface area is around fraction of twenty fifth\nAnd so and I am pretty convinced that they that the architect wouldn't just waste I'm you know energy to create these sticker courses unless there is a purpose for so for every single of course that has a round fraction of twenty fifth\nI think there is a space associated with that\nMore and more phone call before the break let's go to school out west to Daniel in eureka California Daniel you're up next on coast\nHi um I had a quick question about the uh selling he'll watch uh I've heard him many times interviewed on coast to coast over the years and yes apparently he controlled and very closely guarded access to researchers in the public or\nOr to the pyramids and for research and just general public access and I had heard that after the um spring Arab Spring uprising or he resigned what is access like now with the new minister and our researchers are given better\nAccess for research in the general public and I'll take my answer on the air\nGreen question Daniel my new what's it like there now with you\nRegarding talked to have a lot so first of all I had a few email exchanges with him and he's been always very nice very courteous as as the questions and so I've had good experiences with him I've never met in person than he probably doesn't know why I'm\nI'm regarding getting a permit so we are currently applying for a permit um for a small study Robert Robert shock and I are on and I think I'm so I'm hearing mixed messages so on the one hand it solves like investigators are being invited to come\nOn and on the other hand I'm hearing is that the uh they've become more selective so you know it probably depends on the project they have certain areas where they won research to happen and other areas they feel like it's a it's been exhausted\nUm you know so it's really in their hands and there's nothing you can do about it other than you just try and see what they do well\nDo you think that the the ... one research would be ongoing like it is it ... was was a job of director there\nHe I think he is actually involved a Jimmy he's on the he sits on the on the ah the board of directors that reviews the data so he's\nIt's involved at the start maybe not publicly but it seems he's involved the opposite force at by a is input\nUm you know I think they're sort of a mixed back here you know there's the public's eye your boss or you know I was on TV and gives announcements and then there's the the scientist the archaeologist who loves what he does\nUm you know it's difficult to kind of sort it all out but I think um you know they they have to strike a balance between protecting the monuments and allowing people to research done and I to be honest with you I understand it you know some of the projects\nUh you know you want to do you can't do them because it might destroy the monument so I'm\nWell you're being you're being shaped him political right now and I understand that might do it and I respect that\nBut there's the other part of this where we have been told for so long ago that there is nothing to discover there\nAnd that they have not moved from that stance and now it looks like it's going completely in the opposite direction that's what are they going to have to open right are are they going to have to back pedal\nField though one plus one equals boomer effective superb each call one eight hundred five one five zero zero five three or go to ... beats dot com today\nThe back yard you look in great Rob thanks man I was planning on adding a deck to no one could contractors why don't you just ask comb advisor home what\nHome advisor dot com you just tell them about your project and they match you with local pros that can do the job nice but how much does it cost ... home advisors totally free to use plus you can reach customer reviews check pricing and book appointments for free what's the website again home advisor dot com or just download to bring home advisor at [noise]\nHere's the story of Laura who always wants to play pool parents the love of the game to him\nGrow scouts came to a bunch of games where Lawrence was playing\nWas never that go to the bull by the time we go to college but he also learn how to save them a lot of money on ... so he didn't say\nThis your story has a happy\nEnding after all\nAmerica's first news when Gordon Deal every day five 'til six AM news radio Ninety three point one [noise]\n\n\nWelcome back to the coast to coast am it's an all Egypt Great Pyramid evening right here are guessing I my new save Saturday and my new I've I've got to get to some of these calls they're coming in and let let's\nDo that let's get some of these out of the way some of been on hold for quite a while now let's go to the first time caller line Skoda Isaac in Toronto Isaac ... sad amount of\nTime you know like thanks\nThis is a great show was just trying to ... to ... to one show were which is the looming so\nIs it any other language or when you're ... or ... or you\nCan get a looming milk or fail a which is a believe a lot of the show are doing this for quite a so uh [noise] [noise] oh sorry about it a low\nOkay so I said well let me let me jump in I guess what you're asking my new is ah the origin of the word pharaoh and where did it come from from a which which people\n... to ... to ... to ... to ... the meaning of the pro which it ... the push language\n... Kush which which is of course ... ... to ... years ago yeah ... ... the you know we're talking about a quarter of the way it does for ... years ago\n... older than any other language you can put a little ... on that show ... which was\nOf people who is this big well it's a ... to ... which ... which are from the push which is do you think like\nOh this is a little late it was people well the pilot or\n... ... ... ... ... or ... or ... well\nI'm going to I'm going to pass that up to my new I actually have a couple of comments about that Isaac and and thanks for the phone call a\nMinute the origins of the word pharaoh and its meaning\nYeah I I couldn't quite some thanks for interpret I couldn't hear the whole question I I'm ... so so he chipped colleges are things that are in the old kingdom a that term was not use\nSo the term pharaoh it's technically speaking doesn't apply to the kings of the old kingdom I think the first ah I'm I and I can't remember if it were looking for new kingdom when you start using that term uh and that probably means that's when it first appeared and that's\nAll I Know about it offhand I said what I've read about this before but I don't want to say something wrong so I I this is what I remember\nRight in that there's two two points that need to be brought out here a bummer when we're going back to a man as a um and it the first and I'm going to say the word they were referred to as kings yeah\nRight right like in armor and men is uh the first ah kings of Egypt could be some are saying that the the same\nA menace unarm are may be the same or they could be two different kings they weren't called pharaohs back then\nRight and now there's another uh uh uh I have research that is a little bit and I find it fascinating that the Kurdish people were the original Egyptians and that the Egyptians that are there now\nI'm more more workers or possibly even slaves\nThe Kurdish people\nYeah um yeah I Can't really comment on it because I don't know enough about it um I I it regarding what the king was called I can tell you that uh by the fifth dynasty the king have five different title\nUm and in the very beginning um you know the kings were called horse came so it was horse in the armor and hors ...\nSo uh so that that was the first that was the first title and then quickly after a campaign you know the designation a nest when ... which is basically referring to operate in Egypt\nAnd then came to to lady's name a you know and then came to cartoonish name later I'm but I'm the as you just set yourself so Farrow came later ah I I just looked it up and I was like twelve hundred BC is the first time it was used\nThere you go let's go east of the Rockies let's go to Jay out here in Los Angeles in jail you're up next on coast [noise]\n\nHello hello J. lo J.\nHow you guys doing hello how high is there a first time caller long time long time listener\nI'm I Am actually um Egypt churn dissent on mom's side\nAnd I'm growing up as a kid I Would always hear my grandmother ... tell me a lot of stories that there was always passages from here there there's always secrets to the um\nThe great pyramid has secrets to this to tunnels here to there you know there's always stories that Graham you know grandkids hear their grandparents say the\nOne that always stuck with me that I really wanted to get clarification on I've seen stuff like on line but\nI Try to take it with a grain of salt um I really am glad that you're on the show a ... I really wanted to ask you for\nYour um [noise] uh expertise on this if you guys have ever heard is there an opening or any access behind the ... year old on top of their head or anywhere along in that area or maybe the bottom of the paw in the back\nSomewhere like that that has access to an insight chamber of this ... of the things that I'm holds or something very dear to humanity that we are uh [noise]\nWe're not being told 'em all the details of have you have you guys heard any anything like that\nWell gee you're in luck because [laughter] man who's been researching some bad ... paper about it so I I'm a ... now my new before we get to what's underneath the now the left or from the left from palm\nUh there has been photographs of the top of the banks fried in the ground up or what appears to be I had\nTo roll but and I have also read a lot of research about the right here uh an entrance behind the right ear that Jay is referencing year so let's talk about uh the head of this thing's first and possible entrances\nYes so there is a there is a space or in inside the head of the things and it's been a basically locked up there's a ... there was a little hatch\nAnd I'm I'm I think Robert de Beauvoir was telling me about this I think or you can there's you can't stand in there it's maybe six foot deep\nI'm but I'm not sure it goes anywhere I from my understanding is it's basically a blind LBJ but um but you know maybe there's some maybe there is a a hatch hiding somewhere but I don't know about that\nUm I can tell you that the uh you know the roasted ... um they have a ... of course they have an extensive labyrinth charter under this thing's a and this was published in the thirties by a a chronic a person that was chronicling there was a crucial\nAnd he proposed this if he's on the just stick space is basically to get the stones up the pyramid and the scan from last year didn't show it but I think the theory is all that I think it's possible that discount was not sensitive enough to detect those spaces\nAnd then of course I'm proposing that this that there are spaces that are not necessarily logistic I'm seeing that could be theological and chop you're dealt with probably disagree with me or you know your review paper uh but he still thinks it is possible that there are logistical spaces in it but you know beat out of it may so we agree there\nAre probably space is up there and um I just want to ask you a quick uh because\nThe pyramid of course who it's it's it's hot spaces inside researchers in the sixties went to Congress pyramid because they thought it can how can it be that we have all these spaces inside you know corporate pyramid buddy ... all we have his bills only chamber\nWell let me jump in I've got to take a break right there but this is something we need to talk about when we come back our gas my new stateside eight this is all the great pyramid on coast to coast I'll be right back stay with us\n... news ... every day five to six AM news radio money's going one of\nThe reporting the kingdom of sperm targeted with any action it will respond with greater action and that the kingdom's economy has an influential and vital role in the global economy\nIs so gee was last seen October second entering the Saudi consulate in Istanbul, Turkey a serious accident in California\nBy which sliding on the north side of the four or five when it flipped over the median that broke apart on a total of forty four people were reading on the scene\nFox affiliate Katie TVs Leo go at least forty injured in the crash and at least four in critical condition this is Fox News\nSuccess on their own and we\nWould max north Americans who are in\nMind that we wouldn't have done calm during a cylinder seventies and eighties or the one in ... and the art class in winds vegetable ... springs there's a ticket master dot com for tickets and into the one in ... at the aren't crafting wine festival ... foreign ... springs Saturday and Sunday November seventies any\nProject new Spain or been getting the entire kitchen is ready to hell\nIn Delhi kitchens and they'll ... delivering quality and value for over forty years thinking about an outdoor kitchen and make your own perfect for the occasion we take care of everything grills weatherproof cabinet maker show ribs and winter long when Melbourne in our new now\nGot in W. kitchens gotten calm\nYou know\n\n\nTo talk to Jimmy ... guard minded aid money by zero one\nThe first time caller line is they want to buy zero one\nMe from east of the Rockies goals eight hundred eight to five zero three three from wants to be wrong to recall have Hungary wanting me to ...\nThis is ... ... am with your guest host Jimmy ...\nI got to say and I'll do right now [noise] world's ... blood sweat and\nTears Pearl Jam and the great pyramid hall in one evening that's right here and coast to coast am I Am your host Jimmy church now again hanging out in the winter during the break I got some great stuff lined up here and I just mentioned earlier\nAbout the uh uh the atlas robot core right how crazy is that will listen to this the first mammal with two mothers is born\nThat's right in the gene editing breakthrough that's right\nCreated a mouse without a father to me you gotta stay with me is the breakthrough came in the form of twenty nine mice successfully born to same sex parents\nTo females yes spot the scariest thing you could think of not only were they born held the but they went on to have babies themselves\nAnd here's the kicker a similar experiment using to mail parents failed\nYou can read the entire article over at coast to coast am dot com strange days indeed are guests tonight my news save Saturday it's all Egypt all Great Pyramid all night this was coast to coast am I'll be right back [noise]\nAnd not to mention is chatting with back in the car at three times a week credit like scratching all night long bouncing on the side of the day keeping me awake whole entire night from scratch and chewing it kinda makes you never\nDoes your dog it scratch stinkers shed like crazy\nFound any count for all over the place come to a dynamite for help you know the I think if you want and how can you gotta feed it kind of ... diner fight is Tricia pie or legacy fatty I think\nOur vitamins in in science replace the nutrients cooked out most commercial dark moods\nKick up all night scratching his shedding animal and it is such a pleasure to have my calm relaxed non shedding puppy back and I had to think diner for\nYour dont it's scratch bank or said like crazy come to dynamite for help\nEight five nine four to eight one thousand eight five nine four to eight went out and I know the I think\nWhat happened you used to go hours without visiting the bathroom now it seems like you're constantly getting up to the end you're even getting up at night to go this is not okay listen\nThe makers of super beta prostate the number one prostate formula are introducing a new one pill super beta prostate piece three advanced with three key ingredients that are great for your prostate it's like taking three prostate supplements and want\nTo celebrate we're sending free bottles to men who want to cut down on bathroom trips yes your first thirty days supplies free pay shipping and handling just dial pounded two fifty on your mobile phone and say the key word free bottle\nEarly research suggests that an ingredient in ... three advanced may help support an normal prostate sauce combine that with the production and urges the pie and you have a formula you'd be crazy not to try try ... three advanced free dial pound to fifty on your mobile phone and say the key word\nFree bottle again dial pound to five zero and see the key word free bottle\nMemory has first news when Gordon Deal every day five 'til six AM news radio Ninety three point one [noise]\n\n\nWelcome back to coast to coast am on this beautiful Sunday Now Monday morning here in Southern California my new uh the phones have been amazing you ready to a head straight back to it let's do it let's go to speaking of Southern California let's go to\nFor the great pyramid is coated in the ... of the new\nUh numerically that is not not in writing but in the in the language of mathematics um and it's not complicated math it's actually some of the features that Jimmy and I've talked about and some other features that the basic features that we know about the great pyramid\nYou can find them in the ... in the dimensions of the ... of him you know\nAnd you know we don't have time to get into it today but the papers on my website Go check it out and tell me what you think but I think the answer the question is yes I think this is the world's first example of an architect using his own to him as a blueprint for monument\nAnd thank you for the call Joe and that paper is underneath the latest papers the second one listed over on my news website\nAnd one last question from Twitter before we had to the break from dino and do you know says are there any other pyramid in central and South America that carried the same traits as the ...\nTraits meaning but just what it says in the winter we don't know yeah um\nI I assume there would be a couple of things do you knows referencing here one would be size in orientation or to true north and maybe a something astrological ah within the alignment\nWell let me let me put it this way so I think I you know I've I've watched a documentary or which is intriguing they're basically saying is that all these monuments are lining up a across the globe and I find that fascinating I and I don't know how to explain it\nIf that is true that would definitely suggest that master plan that you know people were coordinating this this this this building activity and of course that's what Graham Hancock\nOr has been writing about four years and uh so I I think it's possible yes but just specifically some of the trades I Can't really comment because I don't know enough about it\nWell let me help you with this idea when we look\nThe the tops of the the the pyramids in Mexico in Mexico city and the mind structures throughout Guatemala and Honduras 'em and believes at the tops of these pyramids there's always something there\nWhat about the top of the great pyramid is what do not not the top top but could there be a chamber or something at the at the upper levels\n[noise] [noise] yeah well I think so I think that could be that there could be a space or that um connects that connected to the summit\nEr and of course the summit itself I'm you know like I said before John a\nDrop off a vow has proposed that the summit of the great pyramid was not at peak was basically a virtual top and a and it would've been a you know is here and it's interesting that the diameter of that fear is a meter\nA it's a very interesting a very interesting theory a and others have proposed similar things there's even I hear a clip I think I'm\nA this was first mentioned by a stitch Jeannie in a night in the Nineteen Seventy one book by Peter Tompkins that there was this fear on top of the great pyramid so not a German media and by the sphere so yes I I think I think those theories out there I but I don't know how you would otherwise prove it I'm\nNo you've got to anomalies in ... a a and one is clearly defined edge row one Ninety six and do you do have a ratio there could there be a chamber at the very top\nI acting so\nHow big would it be way I'm looking at those upper rose or the dimensions of the pyramid at that high um how big could that chamber be\nI think a chamber like that would be maybe no more than five feet something like that five feet by eight hide I'm saying right you know maybe maybe a five\nSix courses or something like that\nUm and it would be it would be difficult to detect it may be on a on the ... and especially if you have a grand gallery in between which you know the last year scan was from the queen chamber so I think in order to protect these spaces you have to put the place up in a in the uh in the or the chamber of that's off limits right\nNow yeah and how would you how would you detect more than one chamber will the new ones can show multiple chambers that were stacked up on top of each other\nYeah maybe not if they're stocked up maybe not but they might not be stocked up um they could\nBe you know like the one for example I mentioned that uh Rudolph gumption bring a is suspecting that will be a chamber that's in the southern part of the pyramid maybe close to the face\nYou know so they may not all be stocked up I'm a one way you could do it to me is by putting the plates into that knowledge that we talked about you know the one that ah who Don and fire investigated it's up on the south it's on the north east side\nYou know the north east corner right the north\nEast corner it's a fairly sizable space you know I mean I I don't know how big the plates are but I Wonder if you could set up to a place up there and then you might be able to actually discern the different chambers they made it might be possible\nHow expensive is it to perform these ... studies\nIt seemed like it wouldn't be that expensive because you're just placing the the wage throughout the pyramid and then of course running a computer system it's not like there was any excavations or right right it's not that expensive but\nYeah they have I think they've already spent the main capitals already spent basically uh you know making the plates\nAnd then you know the Jeff to pay the people to do the experiment I'm guessing multiple million dollars I think maybe ten ten million or something like that to do this project I'm a and most of that money has maybe already been spent and now like you were saying you know and now it's just you know you just to repeat studies [noise]\nUm but I think if you do any kind of invasive a project or in a project like this is spending several million dollars a which if we want to go back to things and ... that's a kind of money that will need for a project like that\nThis is coast to coast am I supposed to be church it's been an all Egypt the great pyramid evening here going into Monday morning more with my news said Sunday after this short break stay with us [noise]\n[noise] [noise]\n\n[noise]\n\nSo I just discovered ... dot com and it started out as the jewelry department at the hub can sign it centered and now they're in the ... find anywhere else all let a fraction of the price\nAnd with free shipping gasoline dot com today and see what the science is all about I'm going back on gasoline dot com tonight\nIn\nMarion or just dry then comes\nIn some very you know it just\nRight to enrich mortgage you think about it you don't do anything\nWhat to do about the missing Saudi journalist ... Fox News President Trump says wait and see what more is learned lawmakers say a multibillion dollar arms deal should be reconsidered\nText path to seven nine six four or five that's P. A. T. H. two seven nine six four or five\nThis online banks for closing on us they even have documents that I signed for home equity loan only I didn't want a nightmare\nShe's the victim of a devastating crime called mortgage fraud\nYour ... title and mortgage are kept on line where thieves foreign and domestic hack them it's simple they forge your title borrow every penny of equity you happen to your home like this police officer I Know about title fraud so I register with home title walk and discovered some faith had already taken over title\nThank God I found out on time no bank identity theft program or insurance protects you ... title luck will for pennies today hold tight a lock puts a barrier around your homes title and mortgage the instant it detects tampering there on it helping to shut down\nFind out if you're already a victim of title fraud get your hundred dollar shirt free with sign up visit home\nKind of luck dot com home title luck dot com [noise] America's\nFirst news when Gordon Deal every day five to six AM news radio Ninety three point one [noise]\n\n\nAlright welcome back to the coast to coast am beautiful Monday morning here in Southern California and like I said my favorite thing to research my favorite\nIs lost history and Egypt and our guest tonight my new safe side they published a paper that you can read all of his papers\nOver on his website Chiapas pyramids a dot com and the links to that are over at coast to coast am now my new before we get back to the calls I have talked to before and I mentioned this in my opening\nLittle rant here tonight on coast to coast which is amnesia we seem to have amnesia\nAnd it's all over the place but\nIt's it's ... ... ... it's not represented any more plainly than what happened in Egypt after Cleopatra and we have that example of it but it was going on for a you know she was the last pharaoh in Egypt before she\n\n... first news when Gordon Deal every day five to six am he was radio Ninety three point one\nThat can decorate may apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness as\n[noise]\nEasier than ever with aids list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases muscles size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide [noise]\n\n[noise]\n[noise]\nShe uses squeezes mayor for terrifying attractions one\nLocation designed to get news\nI'm like the ... war of words over missing Saudi journalist ... ...\nSo far Saudi Arabia has maintained a hard line on this issue deny deny deny without ever providing any substantiated evidence they took the opportunity to echo President Trump's reading about the global economy chatty state TV reporting the kingdom of firms if it's targeted with any action it will respond with greater action\nFox is Gillian Turner after suffering a heart attack last month the parents of nine year old papers someone's struggling to keep their daughter alive Fox is just my nose so\nThe family arguing their daughters still has a heartbeat and that there is hope as they continue to explore more legal options\nA judge has denied the family's request to extend the temporary court order keeping our lived her life support is set for removal later today\nThis is Fox News [noise]\nAnd the American advertising federation present at week DC\nAn annual conference area marketing advertising in communications professionals\nThis year's Avengers brands like Mars National Geographic ... such as box Daily Caller in CNN speakers from agency said just over will be adamant in ... if you're a member of the marketing and advertising community there's no better place to further your education and for\nStill putting off a building that dream home\nNow is the perfect time to talk with us about a mortgage loan\nMany options to consider will find you a loan that is right for\nCall today and let's get started\nGreat programs a hundred percent on line you learn to some degree in the ... from wherever you are on your schedule plus ... transfer credits\nFor information school two three five five length and learned for yourself by the wall Street Journal ranks asked you stay in the nation from producing the best qualified graduates and white eighty seven percent at ASU grab recruited within Ninety Days a graduation learn to grow their just exceed and learned at the right at Arizona State university\nTo learn more about you online degree\nPi times the most iconic branded a booming cannabis industry just went public joined me I peeled now tied time investor dot com dome is your chance to be part of history and uh making busy at high tide ambassador dot com that high times investor dot com I sold\nThe corps operate will be made by means of offering circular which has been found with unqualified by the U.S securities Exchange Commission the security's are highly speculative investing and chairs and kind of stuff\n[noise] [noise]\n[noise]\nTo talk to Jimmy church called the wild card mind at eight one eight five zero one for one zero in on the first time caller line is a one eight five zero one for Seventy two one talked to Jimmy from east of the Rockies call eight hundred to eight to five\nFive zero three three from west of the Rockies total recall eight hundred six one eight eight to five ...\nThis is coast to coast am with your guest host Jimmy ... walking back\nYou know it's funny when I listen to be a phone numbers here ... you know I've said many times I used to live across the street from the studios here and my phone number was one digit off from the coast number here\nAnd I was shopping at a supermarket you know you've got to the little shopping bonus card whatever\nAnd you punch in your phone number I had the same phone number down for twenty twenty five years that I punch in the supermarket and every time I punch in that number I think of coast to coast am isn't that funny\nIt's kinda strange how life works isn't it now if you if you like would I Do hear on coast to coast ah you need to check out my show which is called\nFade to black and it's easy to get to all you have to do is click on my name right there coast to coast am and it'll take you over to my website for fade to black church radio dot com\nAnd you can check out to this week's a gas station and everything that we do over there it's completely free to listen to completely a free to check out and we broadcast live\nFrom seven to ten pm Pacific time right before coast to coast so we do that for a reason\nSo why don't you can get a hour show and get to the end of that and go straight over to George and and coast to coast am where you're going to get seven straight hours of paranormal supernatural talk\nEvery single night of the week and it's it's easy to do you can also follow me on Twitter at J. church radio about big social media guy I hang out there and I'm always answering your questions at of course if you follow me on Twitter at ... church radio\nWe are constantly update that with not only our gas but what we do just like coast to coast\nI have Twitter running all day long during my show okay All right there you go let's get right back to your calls at our gas tonight my news save Saturday\nIt's been an all Egypt the great pyramid eat being here on coast to coast we'll be right back more with my new and your calls right after this short break stay with us\nTake one animal\nAnd bonded with one animal boxes June boom you just created nitric oxide a miracle molecule your own body makes that fuel is your cardiovascular health keeping you vibrant\nBut as we all age our bodies need help generating more natural nitric oxide super beach by human has harness the power of nutrient enrich beads and created a super food that helps your body make more nitric oxide on its own\nThe core philosophy of human is to develop heart healthy products for your body\nOne teaspoon of super beads daily supports your cardiovascular health and blood pressure levels we're talking real healthy natural energy call one eight hundred five one five zero zero five three or go to Nora beats dot com and find out how you can get a free thirty day supply of super beads and free shipping with your first purchase\nDeal though one plus one equals boomer effective superb each call one eight hundred five one five zero zero five three or go to ... beats dot com today\nGeico resents I witnessed interviews with inanimate objects\nDidn't believe in communism line on the scene in a recent ... here to just going to be an all\nPro I was just hanging on the roof when the ... storm starts dropping baseball sized hail singles got beat up a few we lived in broken Savage did anything to help\nNow ... I was in survival mode and your football can help you in a hailstorm but the guy go insurance agency can help you get covered for personal property damage and go go go to see our portable home owner's insurance can be\nI'm pretty handy around the house but now that I had kids I don't want to spend my Saturday installing a toilet or fixing an air conditioner but thankfully there's ... and\n... helped me find them back home in my area and the handle any kind of project you can read reviews of the ... ability even blame is on line and when my wife loves most is that ... completely breathing you\nAnd and you can read hieroglyphics Cantu\nYeah ... I I I started learning a and and I have to acknowledge a gym Alan ... he's an amazing teacher or he published of uh books about Egyptian grammar and I used as books and he sold well it's so well written that you can actually teach yourself so I'm self taught and I maybe early or intermediate at this stage\nAnd it goes to his credit or I mean we're probably among the most\nWell written text books I've ever read and that includes all the textbooks I had to read it in medical school or the one by Jim Alan it's really well written\nLet's go to west of the Rockies Arnie in Roseville, California out here on the west coast harm to Europe next\nUh yeah Hi I've heard the comment on the um [noise] a health and the uh medicine of the early ... tips in Egypt in a society from all amateurs ... of\nThe remains and ah of the workers as well as the ... and everything [noise] most of them than live more than thirty to forty years old so I have a hard time believing the medicine was really been kind of put gr really man I don't know if you have any comments on that but I uh even the pharaohs\nI think there was one that lived to be eighty almost daily but most of them die didn't or forties that ... ...\nWell I we have actually so that's a great question so I'm the worker village a you know ... a southern ... where mark leaner has been a excavating a they find actually workers that have a they broke a bone and it was limited\nUm so they were performing sort of you know surgeries are on on these workers when they injure themselves which goes to show\nThat there were not being abused or they were probably voluntary workers and ah they were being well fed and there will be taking care of so um yes the lifespan was definitely shorter than ours but there are if you look at if you go to Cairo Museum UC statues of people there were definitely the older than thirty or forty\nLook at him Illinois statue you know the person that I think designed the great pyramid\nUm he probably had diabetes from the looks of it and he was kind of heavy set you know he probably had a ... in the legs but to me he looks maybe fifties maybe even sixties [laughter]\nYou know so it kinda depends\nOne last call let's go to Mike in St Peters Missouri last call of the night Mike welcome\nOh hi always wondering a pyramid itself that we see that go is that all of it or is there like another mile underground you know just like the tip of the iceberg\nThere you go my new is the ... well aside from the sending passage way to the lower chamber is any of the pyramid underground\nOr as ... I'm I'm Sorry it was the question again he's he's asking if the pyramid is actually the tip of the iceberg ah\nOkay that's a great question so um I you know one way to marry the the the theory of a lost civilizations starting something ... and then the old kingdom\nAre Egyptians of a building on top of it is basically to draw the line exactly where you are asking a Michael I think micro is your name right yes\nSo um yeah so I think ... and in fact when even when you look on on the pyramid itself on the ... on the north east corner I I was there just a few weeks ago and you know what that is bad walk\nThat's not human stone that is actually the original hill that was there and it was molded to sort of\nYou know allow for storms to be placed on it but you're looking at something that was there before the pyramid was built\nAnd so it is possible that there was some structure there before and in fact Robert Duvall has insinuate it is that he thinks that maybe there were shrines on the in the three locations and they were lying to you know the bell stars of uh Ryan a dating to zip peppy\nAnd then you know in the old kingdom a Egyptians came they basically built their pyramids on top of these shrines\nAnd so uh and the softer so what's under the pyramid\nAlso you know the subterranean chamber from the looks of it it looks much older and when you walk into the red pyramid or you walk into the what's called the kings chamber\nThere's also a you feel like you are you are basically to phase monument like there was something there before and then the pyramid was built on top so it's an excellent question um proving it is a little bit difficult of course but uh it's definitely something that's possible\nThank you so much my new or just an absolutely perfect fascinating conversation tonight here on coast yeah I loved it thank you so much to me\nCruise with heavy equipment are scooping up to breathe in the Florida Panhandle town to Mexico beach the coastal\nCommunity of about a thousand people took a direct hit from hurricane Michael last Wednesday is the big storm came ashore with one hundred fifty five mile per hour winds several homes in Cape stamp laws were pushed off their foundations by the strong storm surge\nAs of yesterday more than one hundred Ninety thousand homes and businesses in Florida were without power along with about a hundred twenty thousand in Georgia federal emergency management agency chief Brock Long is calling the damage left by hurricane Michael some of the worst he's ever seen\nA lot is a lot of people in Florida law ... um [noise] you know we can't replace lives but we can rebuild\nJoke to absolve robot is overseeing the search and recovery missions in Mexico beach she said two hundred thirty people rode out the storm dozens are still unaccounted for Michael is blamed for Nineteen death by the way President Trump plans to visit Florida in Georgia today\nTo see the damage it's eleven minutes now after the hour on this morning Americas burst news [noise]\n\n\nCapital one is building a better bank one that feels and acts nothing like a typical bank it's why they're reimagining banking and building something completely different\nThey offer accounts with no fees are minimum they also offer one of the best savings rates in America and you can open a capital one account from anywhere in five minutes capital one this is banking re imagined open an account today inexperienced banking re imagined for yourself\nCapital one what's in your wallet capital one in a\n... Epps an ego tank printer available at your local staples comes with up to two years of income right in the box that's up to two years worth of reports and proposes up to two years of not running out of being when you need to bring five copies of a report for a meeting starting\nAnd ... pretty good men say one hundred dollars on the ... plus ... printers and yet another fifty dollars off up to two years were coming and no hassle pretty now at staples offerings ten twenty eight\nTwenty four seven three sixty five you haven't had an everyday thing you don't want something like Medicare part D to slow you down at Walgreens will take care of your Medicare part D prescription saving you time and money to switch to Walgreens today and get more earning a hundred dollars or more points\nThan seeing up to five dollars on these Medicare part D prescription ... has not suffered pharmacy flunking tested since Ninety One said as if I was an era when he thought it was another farmer stands on my plans point ... here in New York here I can apply\nWhen state ranks among the top ten in the country for major new and expanded facilities that's pure growth\nWhen it tops for four straight years that's pure Michigan law known as a world leader in the automotive industry Michigan is also a leader in advanced manufacturing cyber security agribusiness an aerospace\nInfect CNBC rates Michigan as the most improved state for business to learn more visit Michigan business dot or\nThis audio is for your review for ... Internet posting or distribution other ... on his property menial Washington DC\nOptimal health introducing new Medicaid claims and Virginia and helping you get the most from your Medicaid benefits were more on line ... family care dot com that's family care dot com recall eight three three four six seven eight to five nine for Medicaid plans from after my health\nI'm\n\nTotal access to them\nYou are listening to America's\nWith a new Supreme Court\nJustice Brett Kavanaugh took the bench last week it marked the combination of the Republican Party's fifty\nYear drives to submit a conservative majority on the Supreme Court Wall Street journal Supreme Court correspondent just brave and says over time justice cabinet is expected to provide a consistent vote\nTo implement the conservative movements legal agenda in a range of areas where the Supreme Court has failed to produce ideologically consistent results Jess explain\nBut he is someone who is a very a clearly a vetted\nA conservative about many many legal issues up and down the uh the scale and that he would be succeeding someone who was a somewhat more idiosyncratic perhaps more libertarian and in some areas Anthony Kennedy\nReally providing a solid majority of tested proven a hardcore for the most part conservatives or something that Republican presidents have sought to impose on the court for for almost half a century without the kind of complete success that they had expected so\nWho or what could be affected by this new Supreme Court makeup Jess\nSo what will change will I think we will see a lot more a solicitor food for a religious or ... or or religious exceptions to a general laws or a conscience based exceptions and that will probably play out\nIn the gay rights area where you all the arguments that are different merchants are businesses don't have to accommodate a same sex marriages are couples uh I think you'll you wait we may see more a\nRecognition of religious groups required of public universities and colleges or they may have to some of their policies that require equal treatment by student groups may change some things on the\nOn the margins are I think we'll see as well as a more a critical view of affirmative action programs kept a Kennedy and the and upheld affirmative action programs in college admissions there are test cases on the way in that area uh\nI think that we'll ... we'll see you know there's a you know in the in the realm of abortion regulation I think the question is not will additional state or federal restrictions on abortion and be upheld but rather will the court continue to recognize abortion as a write at all so I think\nThat the court now though the five member majority we much much more sympathetic to the state laws that\nRestrict abortion or make it more difficult to get out of the court will will view the state interest in protecting potential life as much more important than it had before they're justifying those kinds of laws and ultimately it may have to ask a it may consider whether a roe v Wade back in Nineteen Seventy three which uh\nDid a ... a women's right to to have an abortion\nWhether that was a an error and whether to overrule it\nSuggest ravens Supreme Court correspondent at the wall Street Journal is getting a fascinating piece about how new Supreme Court justice Brett Kavanaugh's nailed down this five four majority that Republicans have sought since the Nineteen sixties as long as we're talking about a five four majority here\nWhat are the whispers about President Trump perhaps getting another pick maybe with something involving Ruth Bader Ginsburg\nUh you know she's a she's eighty five years old or she has not made a secret of that fact um and but she's also says she intends to serve as long as she's able now mentally I was in the courtroom and she\nIs a legal issue on the bench or whatever so there's no sense as she is mentally not capable of this kind of job but you know no one no one will forever I guess we all we all know that\nYou had health issues related to financial threat that money travel depression and anxiety that people without a high financial threat that far more than the depression anxiety that he'd go\nOff their migraines beget I mean some people are just sitting there worrying about their money like the ... they're getting migraine I mean they um sanity that people are getting really she really really strong like rain\nUm and yeah I mean they tend to happen in times of the financial capital and I mean it it can happen with any kind of track of course that financial captured the really big part of our lives now that that's driving these I mean altered and digested issues that this is a pretty crazy bad here\nUm people who are under high financial stress are way more likely to complain about all the digestive problems twenty seven percent of them that they had to take it for eight percent of people who have a financial tracking the big thing here you're how these horrible headache older I get to the heat I mean you imagine your call it out of work too because\nYou're so uncomfortable and then the scariest one maybe as a as high blood pressure and heart attack I'm a big study at eighty four hundred that dog looking at at high levels of debt led to high blood pressure and people\nKatie Hill editor at ... dot com thirty minutes now after the hour on this morning Americas first news\n[noise]\nI just think back on the\nShows are on the producer\nFrom\n\nExpert in sight world class record\nYou are listening to America's first new morning\nActually being with us on this Monday October Fifteen Gordon Deal Jennifer ... some of our top stories and headlines President Trump called defense secretary Jim Mattis they sort of Democrats\nDoesn't still missing as Florida Panhandle towns being cleaned up from hurricane Michael ... filed for chapter ... bankruptcy this morning Prince Harry and Meghan Marco expecting their first child in the spring sevens though in line to the throne\nDiabetic kids selling pumpkins to raise money for a service dog story out of Michigan that story and about twenty minutes\nA business of watching by Capitol\nAlong capital one is reimagining banking offering accounts with snow fees are minimum that can be open in five minutes capital one what's in your wallet capital one in a\nSmall towns in central Maine that last mills are seeking smaller economic wins\nWherever you being too reliant on single industries mills once among the largest employers in Maine have mostly falling off the radar as a guaranteed a job out of high school small economic wins in the smaller towns should make their economies more sustainable but it can be a long path\nWall Street journal reporter John camp made a couple of visits to the region John what'd you see\nIt can be hard for any town or city with a big importer shuts down but the shock waves are particularly strong when you're talking about places but in some cases purpose built of towns to serve ... which one industry wild and the prime example is mowing docket Maine which is a fairly remote town\nI'm up in central Maine deep and the words and\nIt was a place that was really tethered very strongly to a huge meal there for a century\nAnd there was a time when people coming out of high school so they they pretty much had guaranteed jobs there there there was a way of life and it was really the heartbeat of town for for generations\nAnd it was also really the only game in town to get paid most towns taxes that provided also jobs and bad mouth shut down for a decade ago and met the town that was very badly by that population shrank\nAnd the town had to lay off a lot of employees they under was close to bankruptcy and they're trying to pull out of that dive right now I got some other things going but that was certainly a really major shock\nIn parts of who's doing what now because I there was at least a one guy I think captured maybe what others are thinking that you know I'd rather have a what ten employers hiring fifty people than one employer hiring five hundred\n[noise] well that's a very common theme all around me and all of these towns because like they all realize there's danger and being a one horse town it's great when you have one big bang on going hundreds or even what about the workers and you know paying most towns taxes but\nObviously it's dangerous when you have all your eggs in one basket and that basket has taken away the pounds or trying to do is rebuild\nBut we're really trying to help small economic when they realized that that's a long road it's not easy to do with the hope is that you know as you get further down that road that you're going to college to be more stable than less vulnerable to these kinds of sharks\nYeah we're speaking with John camp whole Street Journal reporter based in Boston he took a trip up the central Maine and wrote a piece titled means mill towns search for new life [noise]\nUm what kind of companies might they be looking for a state of a ... populate stores on main street or probably might maybe refurbished some of these uh empty mills\nWell that's a good question and certainly but bill fights themselves are large industrial property so that all of the towns CEO holding some potential for him to which they can really really utilize those\nProperties fairy tale and by the town of ... quite a lot of environmental cleanup has to be done or the middle need to be ... you know with our child which something like that\nUm one example box court that the town but it's actually doing All right a townhouse kind of a geographic advantage um it it's not quite as remote trips located near the coast to coast so near Bangor which was a pretty big commercial center that part of the main\nBucks toward actually has a ...\nA bit of activity around the seafood industry and they have a a start up about pending regulatory wants to open a land based family farm at the milk site\nSo that's one example of how what's the minds of a fire and something's going on up in mental knock it a more chose way up river ah there was a non profit that bought the ... site and is trying to turn it into an industrial park or commercial are corrupt shorts and you know that take all comers I think they're thinking of\nI'm certainly going after businesses that are involved in the forestry industry and that's something you hear corrupt these houses but you know we're printing one who drives around me you'll see right away the trees are still there so there's there's\nAttracting a business or something like cross laminated timber and other kinds of forestry industry of 'em\nIn the middle and knock it they say they have a commitment from a a a like a data processing for him but that would likely moved to the middle but\nI'm so they'll they'll take anything I think they want some diversity but but forestry\nOr it could be a one big part of it if they can get that going", "show_name": "Coast to Coast AM with George Noory", "year": "2018", "city": "Pine Hills", "day": "15"}