{"month": "10", "state": "AZ", "station": "KQTH", "content": "Let's talk trash on ... and I'm Josh you were the ... of Gibson's offer solutions\nTourists supplies are not the most glamorous of all subjects but they're in the ... to keep your business running smoothly and in tip top shape at Gibson's office solutions we have thousands of the highest quality janitorial and cleaning products to help you stay stocked up sanitized and squeaky clean\nCheck is out today at Gibson easy dot com or call us at six two to six seven thirty eight and remember to shop all go and buy local that gets into office loses\nDot com that Chris plants show morning\nRand Paul's wife sleeps with a gun next door now locks all of our doors in her home in her neighborhood where she used to be able to live the doors open all the time and never have to think about a gun\nBut now she has a gun packing momma because the left is coming and diet may become the zombie apocalypse and I have to start doubting him like it's a video game\nPlan challenging time we're now four one K. C. P. H. two sons news and talk in the hour follow us at ... for one you see a show on Twitter and Mike is on Facebook one oh four one K. you change the ... ... talk\nFrom ABC News\nI'm Richard can chew\nSome on apparently tried to bomb billionaire philanthropist George Soros it started with a call the police from ... New York city area home\nThey say an employee of the residents found a suspicious package in the mailbox opened it and found what appeared to be an explosive device investigators say the employee took a package to wooded area and called police the bomb squad safely detonated the device ... support for progressive causes has made him a favorite for oil of conservative groups and president\nTrump ABC's Dave Packer the case turned over to the FBI ABC News has learned the Fifteen member Saudi crew responsible for the killing of dissident journalist ... show gay planned the spirit I'm off to a safe house to pressure him to return to the kingdom\nOf Saudi official says the team that killed ... including a forensic analysts to white deceive house cleaned the evidence\nAnd the body double the workers shrug is close so they could sneak off with the realism all the new explanations are part of a shifting narrative from the Saudis that has been dismissed by many in the U.S as not credible CIA director Gina hospitals in Turkey Tuesday in mid that country's own investigation\nPresident Trump said Monday he's not satisfied with the Saudi response but still praised us economic ties with the kingdom Connor ... ABC News Washington\nA female student was shot to death on the campus of the University of Utah campus police have not released the victim's name but say they're looking for thirty seven year old Melvin Roland do is not a U of huge student campus police lieutenant Brian wall and\nWe do have law enforcement multiple agencies who are here responding an out assisting at this at this point in time investigators\nBelieve mills and rolling in the victim had some kind of relationship Mexican authorities are rushing to evacuate low lying areas instead of shelters category for hurricane will is selling for landing along a stretch of Mexico's Pacific coast that is dotted with high rise resorts surfing beaches and fishing villages you're listening to ABC News\nEver wonder why Europeans seem to be so many languages maybe it's because they use battle the number one selling language learning habanero novels award winning technology gets you speaking right away whether you're learning Spanish French or German and basketball you'll remember what you've learned\nI always thought I was bad at languages but after ... battle I can tell you I was just taught the wrong way using battles ten to Fifteen minute lesson you can be speaking confidently in a new language within weeks I was amazed that I can start having conversations right away so fast now\nYou know in a new language like Spanish French were more you can try babble for free to go to battle dot com or download the app and try and for free that's battle B. A. D. D. E. L. dot com or download the app to try it for free that's babble dot com\nShowing me around this kind of dig that looked like another act is whether they across south eastern Arizona or Tuesday scattered showers and under store and some of those could be on the strong side and uh we'll see highest Seventy nine degrees in Tucson and then for Wednesday it clears out pretty quickly I of eighty degrees\nUnder partly cloudy skies and the sunshine returns for Thursday and friday with ice in the low to mid eighties overnight lows in the upper fifties check whether anytime that Kagan nine dot com\nDave Ramsey show\nMidday it'd be told me you had a thirty thousand dollar truck I Would tell you the Charlotte because it's more than half your annual income and they would actually move the needle Tama forty thousand dollars for the bat 'cause you could buy a five thousand or a truck and you just put twenty five thousand Georgia forty and that that would that would make sense\nBut showing up ten thousand dollar truck and putting five thousand are tortured that na ten thousand trucks not a problem that fits and if that's what their lifestyle it's not a big deal it's not over done\nWhat's your what's your answer to your equation though is is to get on the ... budget jump on every dollar dot com download the free app and get your budget going every dollar and titan that up\nYou know going out partying I'm going to just lean and okay so if I make fifty thousand and I live on thirty thousand that's twenty thousand a year for two years and um that free that'd be pretty cool\n[noise] ... let a new one on one in four one K. K. C. H.\nS. on news and talk\nTo Dave Ramsey show snippet\nFrom my wife and I just came back from three weeks in Europe so it's it's a blast go do it\nIt and the only way you're going to pay for his have a plan the only way you're going to fight for schools have a plan and so you know talk to the school that you're thinking about going to and you know find out what it costs to go there\nThere have you know how to live on the shape you've got the roommate faded\nThe show you're doing Los Angeles the truth is it can be done right\nYoung single guy and the good news is you know when I'm In when I was in situations like here is how I didn't mind playing really really harsh but when\nIt might be that you say okay I'll take my Eighteen months to lay the foundation to do these two things the game all [noise] no\nFor Eighteen months I'm a pile\nFor Europe and for school ...\nLed into one on one in four one K. K. C. H.\nComes on news and talk\nEvenings you've you told me to shut up and the Senate was telling me this speeding up what the hell am I supposed to do [laughter] you got to pick on somebody was not big on the show another matter your mouth shut my mouth about which they end up when these people ... do they think that they are being affected I think she thought she was oh man\nI end up and shot at I think there should be a teacher from Maxine Waters\nThat killed ... four one K. Judy H talk from you and talk clinic dot org\n[noise]\n\nAnd thought and punk rock candlelight meth and shout\nMaybe it will and maybe it won't but it certainly adds to the fact that they could do a lot better job you look at the three countries in particular and I don't know what's going on with Mexico I guess it looks like the people are walking right through the middle\nYeah you look at the three countries in particular that I don't know what's going on with Mexico I guess it was like the people are walking right through the middle of Mexico so I'm not exactly thrilled they're either\nYeah Trump today talking about the uh well ... this caravan can we just be honest about the care of it to hire somebody like ... how big is the caravan like I Am looking at it and it's a thousand maybe today is much bigger than that\nI mean even the liberal organizations are saying it's approaching several thousand people it easy insane\nAnd that was like that's the big thing and what didn't help them and I talked to a a couple of people that that that I work with who live on the left side of the aisle if you will saying you know what watching them break through that whole thing that gates and Guatemala a was very very bad\nAnd at some point in time that we're going to have to act and\n... they're going to challenge Trump all they want and I'm I'm looking right at these countries these countries have absolutely failed\nThese countries have absolutely failed their people and now you got tons of people coming here and it is nuts\nAnd their families were children toddler the mail to the fed at first I tried to form a single form on the recall there being let in one of the time that you made really was but the crowd was just too powerful\nThe Bush the judge Lewis broke open the pod laws were greeted by the cop who are now the ... no ... a lot of firing you to smoke there's there's nothing in middle America but when the president in the middle of the\nYeah it's nuts it's absolutely nuts\nAs a nation we can have empathy as a human being you can have empathy I can have an empathy but as a sovereign country right like we can look and say I feel bad\nBut we we we got to put an end as we do we do\nDo we need to make it easier for people to come here and work yes I have no problem with it but we can't take everybody cause a good portion of the world would love to come here tomorrow a good portion of the world\nWould get outta here as fast as possible I mean out of their countries as fast as possible and get into here\nBoom look at least what these nations Honduras\nFail what am I\nFail El Salvador fail Mexico in many ways minus a few big cities fail fail fail fail\nWell all of that was false and Trump became president in ... when I think as a man who you know he didn't have a lot of male role models Donald Trump has been a friend for a long time it doesn't mean Donald Trump gets everything right personally we know he hasn't none of us do but I think that there was something profound and what he said\nThere's some Lori Andrews show one to four four one K. C. H. two sons news and talk to Laurie Ingram shell midday outweigh a second so\n... and\nBeyond say who were asked\nThe president's side and on speed dial I think they joke they're big policy experts and George Clooney because he testified before Congress he used to be on and on human rights and in Africa I mean I guess I'd call Kay he knows more than all the diplomats\nAnd all the people who have devoted their lives to this well I mean you could raise a question about that right but no one ever did they never raised questions\nAbout any of these folks and how about Miley Cyrus running from dorm room to dorm room\nKaty Perry running around college campuses ... trying to explain domestic policy to students okay\nThese people wouldn't know it domestic policy if it's bit him in the back side\nLori Andrews show one to four on one of four one K. C. H. two sons news and talk\nOf large large ... nice fifty years ago President Lyndon Johnson predict a bit of the civil rights law passed all have them in words voting democratic for two hundred years the party of slavery expected black citizens to vote the way they were told but consider what happens\nWhen Kanye West visited the oval office tug to President Trump and told him I ...\nPretty expected black citizens to vote the way they were told but consider what happened when Kanye West visited the oval office hug to President Trump and told him I wearing a make America great has\nMade him feel CNN declared him insane and worst showing us as well as the Negro's all read the ... of it of the Trump Administration is considering what black Americans\nAre saying President Trump only got eight percent of the votes in the election two years ago but Rasmussen poll showed black support for the president said nearly tripled the twenty three percent and the latest numbers show Trump with thirty five percent black voters support no wonder the Democratic party is in a panic\nThere is ginger voters seem to slip there changed and declared their free at last to support any one day was\nSo large large and show seven to ten and went on for one taking the apes Tucson news and talk [laughter]\nLars Larson show white nights I never thought that Lolita should be set free leaders the orca captured almost fifty years ago in ... John Doe do back then we called them killer whales\nThat's just one of the reasons I'm Glad she's had a home and Miami seek worry him for the last half century I did my first story in Lolita twenty five years ago even traveled to Florida to see her in person\nAnd she seemed relatively happy at least as much as you can tell by watching an animal anthropomorphic is a is a conceit of human beings\nThe fight over her captivity has been going on that long a lot of folks failed to recognize you served a purpose like I said we use called them your killer whales and back then the public doesn't have the positive you workers that we do today Lolita help to popularize her own species and fueled the demands to protect them\nTurner loose today and she's likely to end up dead in the ocean just like go the killer whale dead\nSo Lars Larson show seven to ten on went out for one taking the AIDS Tucson news and talk\n[noise]\n[laughter]\nThat's a sad to raise taxes show three the three five three eighty four to three three two three five three A. C. H. A. B. that fairly light as all the\nThey sit by and then the guy a side and\nThen they've got the call the ambulance and said call the bone person and I mean does that strike you as credible I'd say that right now is the restoration where more in the fact finding phase and uh we're obviously getting as many facts as as we can from the different places\nAnd that will determine which facts are are credible and then after that the president and the sectors day will make a determination as to\nWhat we are deemed to be credible what actions we think we should say\nYeah a not for this crap it was ... look he's dead we know he's dead lets\nThe most insulting thing as awful as\nThis is is the way that the Saudis have treated us right the way that they've treated and the rest of the world the lies they've told\nDidn't weren't even ... I mean you couldn't fool a two year old with these law but that's what they did so you punched him so hard he disappeared\nFor\nThey use the body double which wasn't even a good body double\nOfficials here are kind of event that killing us at ... gene with a premeditated murder and they are now calling the in all the way the how the winds were blowing fans holding body double here to however ... leaving to constantly and an attempt to cover up the killings and honor them\nThey have body double here to pose as his obscene leaving the consulate and an attempt to cover up the killing him into the hands of the schools that surveillance for as it is partisan government investigations and it appears to sow just that\nYeah it wasn't even good so why he went in wearing these clothes came out some alley grown somewhat of a beard instead of a guilty and they had full head of hair\nThis man could almost passed for Jamal ... G and that's the idea [noise]\nMeans are the last known images of shook gee alive moments before he entered the Saudi consulate take a look at the same clothes same glasses and beard similar age and fuzzy about everything except the shoes [noise]\nBut if you're a Turkish officials tell CNN but the man on the left his body double one is Fifteen Saudi operative sent to kill ... G ... cover it up\nNot even close I've seen it they don't even look alike and he somehow ... air it was awful it is horrible\nAnd the crown prince is to blame he is every us right is a bad bad dude a lot of people knew that\nKing Solomon says it was on him why doesn't it smell right to you about sort of Jordan you look at the\nPattern of this cramped branch over the past two years everything he has touched his current through disaster use orchestrated this incarceration of examples and cousins and businessman\nOther rich Carlton last November he's presided over in a terrible war in Yemen has abducted the prime minister of Lebanon he has put many many people in jail or detained them for a non violent descent and so I think you have to assume that his fingerprints are all over this this could not have been his inner circle\nCommitting this without his knowledge and approval\nYeah yeah bad dude but\nCrazy on the outside keeps crazy on the inside and that's what a lot of people think when it comes to this\nI think it's time that we say we've had enough Rand Paul over the weekend said it they need us more than we need them\nAnd this this entire area of the world is a giant cluster how it is it is it is not getting any better\nIt is at times getting worse and we have an ally there for all intents and purposes and that is Israel outside of that everybody who is semi nice to us either want something from the U.S or is terrified of us usually it's the first\nAnd they want no part of what we have to offer so we have to start asking ourselves that question at what point do we say you know what Fisher cut bait we're going to cut ... we are ... that Saudi Arabia is just as bad\nThe differences as we don't get along at all with Iran and we kind of do because of the finances and the oil with Saudi Arabia but their export of violence and hatred towards the west\nIs massive nine eleven it's all you got to say so what do we do that's the big thing at what point do we say we've had enough\nDon't need you to buy our weapons will be okay we'll move on with this and if you have something that breaks down well that's on you\nBecause it's our weapons and if we need to come show you how to fix it when you're going to have to learn how to play nice and stop what you're doing and until then enjoy your broken stuff if you can't fix it and you can fly three two three five three twenty four twenty three ... best in show is your Twitter tweet at us interesting character coming down that Michael does daily\nIt's like three two three five three twenty four twenty three ... best in show is your Twitter tweet at us interesting character coming down that Michael Daly wire whichever there was bench Barrow very interesting guy was talking about all kinds of stuff mid term scripts Yogi who knows what else can be fun though I promise you that ... [noise]\n\n\nStuck Chad bench and show\n[noise]\nDo you like saving money do you like knowing someone has your back as you're getting older and starting to be faced with the reality of Medicare and the future of Social Security my partners at the association of mature American citizens otherwise known as a Mac or focus on protecting the interest of mature Americans meaning anyone over fifty I'm partnering with a Mac\nPatient Jared Kushner gave an excellent interview was banned Jones today\nI was I think the first fair interview I'd ever seen on CNN and probably the last one that I'll ever see on CNN\nBut you know from the beginning of this story or you could tell it was a partisan job from the media and Democrats they had nothing to run on in these midterm elections so they focus on the killing of an ex Saudi Government official named ...\nWho for a couple of years has been writing for the Washington Post and they've tried to make them into a liberal secular western martyr he is not\nIs a radical Islamist he wept one Osama bin Laden died\nHe uh is a supporter of Hamas one of his chief\nCriticisms of the current Saudi regime is that they're too favorable toward Israel\nOr he is a decided Islamist he's been a member of the Muslim Brotherhood for a long time business justify an extrajudicial killings I don't know I don't think so I don't I don't defend the Saudi Government but there is no news story or the Saudi Government commits heinous crimes\nDay in and day out and it seems to me the lesson is if you ... around with radical Islam is bad things are going to happen\nUh fortunately President Trump has not spoken out of turn on this I don't\nThink but he would be a huge mistake for Republicans to get distracted by the story because we're winning on everything that actually matters to voters and it's a really desperate Hail Mary by Democrats to distract before the midterms\nYou know I might go over the weekend I saw a Rand Paul on and I I agree with him you know at some point in time we don't need Saudi Arabia they need us for more than we need them by hand discontinue it\nYou know the the the look you go back and look at Obama the only time he got over written as far as the veto was when he was trying to protect the Saudis not like he's the the trumpet some sort of\nSort of magically the only presidents ever done that they all try to do that at one point in time that we say you know what we're going to look elsewhere because whatever you think you're going to provide us\nA there's just too much headache come along with it\nWell of course you know we've had a long relationship with the Saudis Saudi ... has been the chief exporter of terrorists to the olive tree probably around the entire region that said it's a relationship of convenience because we use Saudi Arabia\nTo counterbalance the real threat to the global order which is in Iran Iran since the Iranian Revolution has been the greatest undermine or of the world order because they have one foot in at one foot out on one hand they tried to play nice nice at the United nations\nOn the other hand they fund terrorist groups all around the region and around the world so I'm perfectly happy to use that relationship of convenient to our advantage but we should try to use this is not to cut off our relationship with Saudi if not to kill arms deals or whatever\nUh we should at least use it to try to get some concessions out of them they should change their educational system they should stop being so strongly anti western anti American anti Israel what have you\nAnd if we could get some concessions out of them and maintain our relationship to counter the threat of Iran that's fine but you're right we don't we don't need Saudi Arabia and we we need them for energy less and less by the day\nYeah oh totally totally talking to Michael ... from the daily wire and a a former are you still acting at all what man\nI well I think when I did my best seller I think that other reasons to vote for Democrats a blanket comprehensive guide I think that may have destroyed my acting career or but I Will say I'm ... I'm In this movie or no safe spaces that Adam Corolla and Dennis Prager are doing it\nAnd I'm also during this great project right now with my friend Andrew clay than\nA screen writer and novelist who has this story called another kingdom\nAnd it's about a young sort of ...\nA screen writer and novelist who has this story called another kingdom and it's about a young sort of ... the guy in Hollywood who can't catch a break enters into a portal into a fantasy world with daggers and blood and dead damsel that its feet\nAnd having lived in LA I can tell you it's unclear which world is more absurd you know the medieval fantasy land or Hollywood um but that's been a lot of fun who just released the second season the first season was a big success and we're seeing we're seeing great numbers on season to she can check that out of the another kingdom as well\nCool right on a last question a\nSo midterms not too far away or you know I I I feel like the house is going to go to the way of the dams which is going to be you know two years of investigation investigation investigation I think that the Republicans even pick up a seat or two in the Senate\nBuddy it feels just like I mean you know I don't know because it looking at the polls I I don't always look at the polls and look at the you know the absentee ballots and things like that but it still feels like it's going to be closer than people think it's not going to be the blue wave but it's definitely going to be a little bit blue or purple if you will or in in the political world don't you think\nWell we can at least take solace the polling shows or at least suggest that we won't have that blue wave we might get the blue trickle and this is historical precedent you know the the\nParty that has the White House typically loses Congress and the first ... it happened to Obama it happened to Clinton had happened to Reagan it happens to Johnson grooming on and on and on\nUm so I as far as we would expect that\nWe know however that we're not living in normal times president go fat by Israeli up ended the political order so I'm I'm not sure I'm I'm not willing to bet\nThat a Republican sold the house but it's certainly plausible especially if Republicans get out and vote right now Joe the voter enthusiasm is as high as it's been since ... since that sweet tea party election\nUm a lot of that has to do with judge cabin on the ... mirrors and character assassination against them the downside is democratic voter enthusiasm is also very very high\nSo I think you're going to see probably record high mid term turn out\nUm I I think your analysis is right on the Senate I'm I'm a little more hopeful on the house but but we'll have to see a lot of these races are pure toss ups and who knows we still have a couple of weeks or ... anything could happen there's always a late term October surprise that could crop up and screw up all of our predictions\nOh absolute you get your lottery tickets because of you must be real the the whole game is let's just win the lottery so I take nine hundred million dollars six hundred after taxes and no longer care [laughter] you know this\nIs what I thought I I only play the lottery winners approaches a billion dollars\nAs if I wouldn't be satisfied with a hundred million it's only a only a billion\nAnd I do to I Can't tell you know when I did that length book reasons to vote for Democrats that really did it feel like winning the lottery are making this stack of nothing become a best seller so I'm kind of hoping that I can harness that again you know we're in this midterm election year and uh I don't know how are you going to spend your one point six billion\nYou know what I I I haven't really decided yeah I mean I've got some things I can get some exotic animals that's kinda my gym like an all kinds of stuff so but outside of that just a nice house and uh you know slowly just keep doing what I'm doing maybe just expand it a little bit more I'm not going to give up working I'm only forty seven\n[laughter] that's exactly how I feel I Do think it's a particularly good time in in the country and in the world where you think if I got a billion dollars I'd still keep doing my job but you know we live in a great country and things politically or looking up and up every day\nAbsolutely my man Michael's rent their daily weren't coming I look forward to talking to you again\nWe live in a great country and things politically or looking up in up every day\nAbsolutely them at Michael's right their daily wire appreciate you coming I look forward to talking to you again\nYou've got a great a great to talk to you and we'll have to have you on my show\nAbsolutely love that thanks so much rent on TALK to you see an adventure shows your Twitter C. H. A. D. P. E. N. S. O. and\nCheck 'em out go to the daily why are you going to spend a whole bunch Barrows ah thing he's got some good stuff there and Michael's there and ... they're a ... it's interesting and people ask me why do you bring people like him on well first of all I find it interesting secondly this weekend if you didn't see the fact that\nMix Sally in cinema each had a chance to be on with with Wallace over the weekend on Fox and and send them a turned it down the Democrats\nShould you everything you need to know no matter how many times I asked people to come on from the from the left side of the aisle rarely do they want to the right side of the I was always open\nEven today cushion or sit down with Ben Jones shows you everything you need to know three two three five three twenty four twenty three at you had mentioned shows your Twitter so Chapman says Joe\nI'm Danny live through what today's homeowner given you a few tips and being able to have a safer healthier home and one thing you can do for both of those as well as making your home a little more energy efficient is to add insulation\nIn your addict we're using a mineral wool insulation from rock will that I've used a lot over the years because his meal do resistant extremely easy to install and also it's very fire resistant it may give your family a little extra time to get out of the house and the unfortunate situation of a\nFire we're also trying to improve our indoor air quality by making sure all of our exhaust fans go all the way the outside and actually enhancing experience a little bit\nBy installing an MP three player that's part of the ... brand really cool to have that music while you're in the shower and video surveillance cameras from carrier the core system are so easy to install\nPut them on the shelf and plug them in more information available for you at today's homeowner dot\nCom here's your healthcare update with America's health care advocate carry hall\nDo anti accidents really have a positive effect on our health and reverse the aging process I'll be right back to tell you\nDo an hour and it's really reverse the aging process well here's some real numbers that should make a difference to you death rates for people to take it out to the entire down by fifty percent cancer death or down by Thirteen percent cancer survival rates are up by fifty percent\nHeart attack and stroke down by fifty percent skin cancer down by Seventy percent infections are down by fifty percent and cataracts or down by twenty seven to thirty six percent\nThose are some pretty powerful lovers ladies and gentleman that show that an ox didn't really do make a big difference in your life if you choose to take them they can really reverse the aging process and allow us much happier healthier life the costs of vitamins and minerals is small\nVisitor Gibson's ... dot com or give us a call at six two to six seven three remember to shop locally owned by local at Gibson's offer solutions\nDon't expectations has been adding a little excitement to love lives for years in Tucson they have ... pirate outfit and own natural enhancement pill to make sure you can rock the boat all night long they also carry a whole line of laundry and nightly\nAdult expectations is a will lick clean environment for couples to come and leisurely explore their wild side\nSo put a little spice back into your love life at adults expectations one block more the grand aunts don't\nDrill outfitters Pima County new as family really gone job thank you for making the annual spring shooters run up a success delving into purchasing a firearm jobs out there is a unique return policy allowing you to return your firearm and credit to a new bridges and always special offers for military law enforcement remember they wrap law firearm go last Saturday of every month robots arbiters\nDrive a little and save a lot since you know suddenly sales tax ... okay wrote about one or the turn of the two Seventy nine or visit them at ... dot com western hospitality with friendly prices\nUse would affect you southern Arizona in mid term election definition station it what oh boy one Ga Ga Ga she can't hear you on the news and talk\nFrom ABC News\nI'm Richard ... and one point six billion dollars the mega millions jak bought the largest lottery prize in us history across the country people heading to their local market convenience store or gas station to get their mega millions ticket Jose Reagan's in Maryland among them\nTotally crowded here I was able to get here they get a ticket a traffic I quit\nFor these players in California they're dreaming of debt payday caseworker channel\nThey are that grew up it's a horrible thing and it's a lot bigger than five thousand people and we gotta stop I miss the border and unfortunately you look at the countries that have not done their job in the\nPresident says he'll cut off us aid to Honduras El Salvador Guatemala for not preventing the migrants from leaving police or the suburb north of New York city is saying explosive device was founded the home of billionaire philanthropist George Soros\nOrdinance experts detonated it safely no one was hurt the airline passengers defense the president said it was okay\nYou know criminal complaint Bruce Alexander is accused of reaching around the window seat in front of 'em on borders Southwest Airlines flight from Houston to Albuquerque and inappropriate touching a woman sitting in front of a flight attendants receipt of the alleged victim after she realized what was happening\nAlexander was arrested when the plane landed on the ground in handcuffs FBI agent said quote Alexander stated that the president of the United states says it's OK to grab women by their private parts and like stoning ...\nYou're listening to ABC News\nHey guys can hear from the hip type cast today's growth who would win a three mile bicycle racing eleven year old girl or last year's winner the Tour de France\nIt all depends on the bicycle it depends on their vehicle full Senate ten speed in the ... gonna win every time but but the race run a trace Ikle and the eleven year old wins every time you see it's not the driver it's the vehicle when it comes to generating revenue it's exactly the same\nIf you have a job or a small business you are writing a trace Ikle you can only go so fast\nIf you need to make up ... it's not going to happen on a tray sickle no matter how fast you pedal it's simply not going to win the race\nWhy do many people with no schooling and no advanced degree often become very wealthy simple they choose to only right ten speed\nWhen it comes to helping people create their next revenue model both Forbes any recommend income store as a can't miss when it comes to putting people in a ten speed could your household or business using additional revenue model that doesn't solely depend on you if so you need to check out income store dot com that's income store dot com\nGoing near all this kind of ... that looks like another act is whether they across southeastern Arizona for Tuesday scattered showers and thunderstorms some of those could be on the strong side and uh we'll see a high of Seventy nine degrees in Tucson and then for Wednesday it clears out pretty quickly a high of\nEighty degrees under partly cloudy skies and the sunshine returns for Thursday and friday with highs and the low to mid eighties overnight lows in the upper fifties check whether anytime a Kagan nine dot com\nHere all your political insides from ABC News President Trump campaigning in Houston\nI how they've heading back out west to gang sound for want of if not better public and arrivals and get out and then he got into lying had occurred taken off Steve how third thick campaign rally now compare that to that point plan that former President Obama held during that same period of time a\nBCS Tara ... Mary midterm elections in two weeks the Democrats' best chances appear to be in the house\nYou have a field of maybe eighty Ninety a hundred and potential pickups mathematically probably the dice come up [laughter] good enough for Democrats enough of those districts but like they're not allowed guarantees\nNate Silver at the political blog FiveThirtyEight\nShow like a very wide range anywhere from a twenty seat gain if Democrats heavy disappointing night which is not quite enough up to fifty sixty seats if the turnout is is very high\nAnd those are your political insights Richard cancer to ABC News\nOf Lars Larson show ... nice fifty years ago President Lyndon Johnson predicted that of the civil rights law passed I'll have them in words voting democratic for two hundred years\nFifty years ago President Lyndon Johnson predicted that of the civil rights law passed I'll have them in words voting democratic for two hundred years the party of slavery expected black citizens to vote the way they were told to consider what happens when Kanye West visited the oval office tug to President Trump and told him I wearing a make America great has\nMade him feel CNN declared him insane and worse tell you what is what happens when they grow don't read the ... of it of the Trump Administration is\nConsidering what black Americans are saying President Trump only got eight percent of the vote in the election two years ago but grasp of some polls show black support for the president has nearly tripled the twenty three percent and the latest numbers show Trump with thirty five percent black voters support no wonder the Democratic party is in a panic\nThere is injured voters seem to slip there changed and declared their free at last to support any one\nDay walk Lars Larson show that an attack on one for one taking th Tucson news and talk with Chris Lamb show morning\nI'm happy about the wearing on you know I'm ... I'm happy on one hand I'm happy about the Democrats eating stuff all over the place because Trump gates winning and winning of the Supreme Court saying\nThey figured they pretty well had it in the bag that whole Kavanaugh scuttle jobs but didn't work out from the other big win for President Trump and other big loss for the Democrats\nBranch out into town went in for one ... two sons news and talk\nFive zero and say the key word nighttime\n[noise]\n\nIndependent and thought has punk rock in life is the best in show\nFell are Mexican officials letting these migrants pass through\nA no on uh they're not just by literally all of humanity to the central it broke open the gate the Mexico we're on a bridge but the ... the southern tip of much to go here there's about four hundred and why are we going better all us on the Mexican side behind that one is split\n... ... with a summary of the board is on the watermelons not let your humanity at\nBill we're right there uh ABC News is out there just following along as or a ton of reporters and a across the world and what has become a master of humanity and it is it is it is huge\nThey're coming here that's what they're telling everybody they're coming now are all of them going to reach here I don't know but what was once a thousand has become too and it's continuing to grow I don't know how many thousands are part of this I Do know when I see\nThe\nFar more than two thousand that's for sure when I see the pictures when I see the videos it is a map of humanity and it is on its way here to the United states of America according\nTo many that are in this mass of humanity they're coming here\nImmigration is been a very big issue\nUsually around election time both the right and left ignored as much as possible Trump is stepped up and said look I\nHis big theme was I'm going to handle that nobody else wants to do it I'm going to build a wall I don't know what the walls really going to do I've said it over and over it's more symbolic than anything else we're not looking at the ports were not looking at the people to come here and overstayed their visas which is a massive problem\nMassive problem but for the people in the states along the border this is a huge problem and here comes\nThousands potentially ten thousand who knows how many are on their way here and how many will actually get here it's a long walk this isn't like we\nThousands potentially\nTen thousand who knows how many are on their way here and how many will actually get here it's a long walk this isn't like we come through the border at from Guatemala to to Mexico and then it's a couple of hundred you know steps it's eleven hundred mile some of these people are five hundred miles\nTwenty five hundred miles they're making this this tracking they're hearing what's going on there seeing that's from come out and and and and you know do what Trump does\nJust think there are wonderful people you got some bad people in those groups you got the people in those groups and I'll tell you what this country doesn't want them I Will seal off the water before they come into this country\nSo you hear him say that they know what is being said they're hearing from the the the the reporters that are there are as well as following it on their their phones 'cause a lot of these people are seeing their phones in the ... and all of the stuff that they had their way down here and the reality or up your ... and the reality is is they don't care [laughter]\nRent a car for free so what are you waiting for save yourself thousands ... covered by the ultimate an extended vehicle protection do what I did call ... eight hundred cars sixty one hundred mentioned code Benson\nIt's eight under car sixty one hundred years go Beth and save your ten percent or you can check everything out online at ... dot com that's cause you'll dot com remember to use my current events and said you can present\nAdoptable may apply at you had mentioned shows your Twitter ca JD B. E. N. S. O. N. as ...\nAs far as sleep become a nightmare for you do you dream of getting a full night's rest boy am I going to have those days are long behind me\nThey see my pillow I'm sleeping like a baby these days and so can you my pillow adjusted the shape you want and need tossed those flat worn out pillows and let my pillow changed the way you sleep wherever they're the one and only solution to your sleepless nights my pillows are made right here in the usa with a hundred percent machine washable and Dr ... Khan\nAnd I'm like those other pillows my pillow comes with a ten year warranty you're not going to find a deal like this anywhere else by one my pillow get the second one free that's right when you order one my pillow\nYou'll get the second one free get to my pillows for the price of one call eight hundred nine eight three forty nine Seventy five\nOr go to my pillow dot com used promo code ... that's my fellow dot com promo code Benson or called eight hundred nine eight three forty nine Seventy five that website again is my pillow dot com and you must use promo code Benson [laughter]\nLars Larson show one night I never thought that Lolita should be set free flow of leaders the orca captured almost fifty years ago and ... channel do back then we called them killer whales that's just one of the reasons I'm Glad she's had a home and Miami ... for the last half century\nI did my first story on Lolita twenty five years ago even traveled to Florida to see her in person\nAnd she seems relatively happy at least as much as you can tell by watching an animal answer ... is a conceit of human beings\nThe fight over her captivity has been going on that long a lot of folks failed to recognize she served a purpose like I said we use called them your killer whales and back then the public doesn't have the positive you work is that we do today Lolita helped popularize her own species fueled the demands to protect them\nTurner loose today and she's likely to end up dead in the ocean just like go the killer whale dead so Lars\nLarson show that an attack on went on for one taking the AIDS Tucson news and talk\nAt the top and bottom of the hour stage and acted uninformed anytime at one oh four one K. cute ph dot com\nYou they Wildcats welcome the Oregon Ducks to Arizona Stadium this weekend listen to the Joe ... show forty seven for your chance to win a for a pack of tickets to the game\nThis month give local Tucson partner is handy dogs dedicated to helping older adults and people with disabilities improve their quality of life through the specialized training dogs they're looking for volunteer foster homes breeders and donations Forty Tales at one of our\nOne K. cutie H. dot com joins us on the morning news at six and seven AM for the first Fifteen everything you need to know about what's going on in this great big world or bars state of Arizona and the ... smart listeners love smart speakers we made a civil is in a one in four one K. cue th on your new device first teacher at or dot our name by telling it to enable one\nFor one cake you th skill after that simply ask to open one of four one K. U. T. H.\nOne oh four one K. cutie H. two sons news and talk on the line ... dot com [laughter]\nLars Larson show when America goes in a strange place these days we saw the circus like confirmation hearing of judge Brett Kavanaugh this scandalous charge against him and ...\nWhen America is in a strange place these days we saw the circus like confirmation hearing of judge Brett Kavanaugh this scandal is charge against him\nAnd Democrats who demanded an FBI investigation predictably even after the president agreed to such an investigation many independent sex crimes investigator brought in to do the questioning says the Christian forged testimony\nWouldn't even support criminal charges of salt now entered a chime in America were crazy allegations can be made against men and women that doesn't even matter if\nThey can be proved the person who's named as politically and professionally yet\nAnd it's a modern scarlet letter that apparently only applies to a conservative think of all the Democrats mayors and governors and members of Congress to been reliably accused of terrible things the God help you if you're conservative that goes double for supporters of America's Choice for greatness\nDonald J try so large large and show that went on for one taking the H Tucson news and talk [noise]\nSee entertainment news record breaking weekend for Halloween I take my family\nHorror sequel starting Jamie Lee Curtis slashed expectations with an estimated Seventy seven point five million dollars is not the best opening for a horror movie in October the best opening for any Halloween movie and the best opening for a film starring a woman over the age fifty five after some\nOf Blair got very real on Instagram over the weekend revealing to the world that she has multiple sclerosis she says you fall sometimes she dropped things and our memories fuzzy but she's gotten a lot of support jokes that by sharing she can give some support to others we can go\nTo the end of the road for a loop cage Netflix canceling the marble series after two seasons director Danny liners died the fifty seven year old best known for the comedy is Harold and Kumar go to white castle and dude where's my car and birthdays today Jeff Goldblum sixty six while the cue Jerry Maguire Jonathan look Nikki is twenty eight\n... I'm Jason ...\n[noise]\n[noise]\nI got twenty four seven as website that I had I had\nThat has Fredericksburg and thoughts of India county talking Cain heart is driving at the scene of cologne holds their baby and it appears this was not just a ride down the street there are reports of them riding with the baby over a six mile area south and west of the Fredericksburg city limits\nNow why is that weird because the baby on a moped in between the two of them without a helmet nice talking to British around the early ... and look we we we do live in a world where you\nCan't go across the street without you know like kids you know you need\nThe ... you know it's no need to parents you need extra Benji grandparents our kids are going across the street quick everybody out there let's form of line as shields album cross the street\nAnd what I and I was telling my producer a British rather for this is look when I was a kid not this young but I was a kid I was like eight nine ten my dad was at his Harley's and stuff and I would write on the back of it I Can't remember why the hell I'm sure it did maybe I didn't at times ... times when I was a kid I'd write in the back of my dad's truck on the freeway\nBut you can't do that nowadays the whole thought about but you have to be cognizant of what's going on in the world you live in if kids can't go across the street what makes you think you can just put a kid without even a helmet on your mum ... not a Harley ...\nPartway and cologne or in their mid twenties and both are facing two counts of felony child neglect\nBut both partway and cologne or in their mid twenties and both are facing two counts of felony child neglect there's lots of your county sheriff's office says after receiving a number of calls deputies caught up with a couple at the overlook terrorists apartments where they live\n\nSomewhere in the report somebody should and they're stupid that should have been it\nCan you filed a federal felony against stupid 'cause that's what I feel I feel and there's a there's a difference for me being stupid and and and being in you know uninformed right and I just think that these people are just not the sharpest tools in the shed and you just have to be you know\nYou are I mean it's not hard in this world to know where you are what does the climate of life have you never been on the Internet have you never ever\nWatched television\nDo not understand that this and and and and the top of that is the common sense just\nGone neighbors are horrified\nAnd there's no protection for maybe if they had not been an accent and maybe that would have been telling [laughter]\nDon't want to answer the door at the couples apartment Cain heart which was released from jail earlier this afternoon\nAnd that's that's with you for the rest of your life now that's with you\nAnd you are just it's it's amazing what's amazing isn't it somebody did this right because people do things all the time and what is amazing is the fact that you think that this is a good idea in this day and age that's the thing that ... knowing\nAt any given time\nSomebody's looking for somebody to do something and complain and you go and do something like this that's the amazing part it's it's it's just it's not that you did something like this it's just thought that this was a good idea in this day and age\nThree two three five three twenty four twenty three ... and Joe is your Twitter it's a new world we live in Mitch McConnell Nancy Pelosi are finding it out here to talk about that midterms are here and ... what do you think about vaccinations will touch on that ... ... ...\n[noise]\n... adventures show [noise]\nAre you fifth year older okay well I'm not going to ask\nYou to raise your hand so don't worry but I Do want to ask you have you sign up for a Mac yet if your answer is no why it's a free membership for one year you don't even have to give them credit card information and just for signing up here's some of the stuff you're going to recede just some forty percent off movie tickets\n... the ... you know Israel and you throw in anybody else that that differs from them the Kurds are sending other it is an absolute nightmare and there is no way in and I I understand what Trump's trying to say some I've always said is he's got a handle on things\nMeaning crazy on the outside can keep crazy on the at the tougher you are the harder it is for crazy to get out and that's true in a nation like that you want to keep crazy and\nYou want to keep radicalized end because they know what happens\nWhen radicalized gets out people start looking at some point in time we've got to just say All right we've had enough\nFor the president Somali caught the Saudis on this issue is so wrong presidents ought to be taking the strongest possible action against us out there are lots of things that can be done [noise]\nAbsolutely I agree just like Obama oh that's right the only time Obama was ever over written on a veto\nIs when he wanted to protect the Celtics Ninety seven to one they said yeah we've had enough let's think about that\nBush all of them have played this grab ass game with the Saudis at some point in time can't we just say we've had enough we've had enough now Jared Kushner sat down with the Van Jones today a in a very interesting conversation that and a lot of it was about this\nThere was a fist fight and then the guy a\nDied and then they forgot to call the ambulance and said call the bone person and I mean this does that strike you as credible I say there right now is mystery shop where more and the fact finding phase and uh\nI mean this does that strike you as credible I'd say that right now is and ms ... were more in the fact finding phase and uh we're obviously getting as many facts as as we can from the different places\nAnd that that will determine which facts are are credible and then after that the president and the sectors they will make a determination as to what we uh the team to be credible what actions we think we should say\nYeah I don't know what they're going to do I don't look it's yes is it about Iran we don't want to run to get any bigger but you know at this point in time it's just it's a difference between you had a rattlesnake over here and the other side you got to cobra both of them given their opportunity would love to get rid of you and kill you but the fact is if we stand back\nWhat happened right what happens I I it is it is an ugly horrible situation and the president stuck between a rock and a hard place\nAgain I think that our ministry she's made a lot of games in our fight against terrorism we have to deal with the long term ideology\nOf uh of extremism and Saudi Arabia is a critical partner that whether the custodian of the two holy sites a which is very significant and and the religion of Islam and a lot of the reforms they've been making there to help us track down a terror financing and then also to push back against people who are providing the religion\nOr have been a very historic of last year so we're hoping we can keep pushing forward with a lot of the initiatives that further American interests and that push back against the Ross aggression and so we're going to stay focused on\nYeah well I I don't know I just look at this thing and say it's it's a lose lose across the board and and Saudi Arabia is just as bad if not worse because of their mattresses because of their ... and because of all this stuff it is a uh [noise]\nI don't know it's it's an ugly situation but that's why you're the president you got to make that decision and uh not everybody's gonna agree with it doesn't matter which side\nOf the aisle you're on a ... there's going to be some winners and losers in this as far as some people are gonna be excited 'cause they think Trump's going to be hard on him and then they may not be as hard as you think and that fight is going to go on it is and a lot of people over the weekend protect me like why do we care about this guy\nLike what do we care I mean you know oh who cares about a a guy that wasn't really a citizen that was a bad dude at times hung out with bad people and now all of a sudden we see that's a good question I guess the question asked I absolutely do he did hang out with some bad people I think in that\nIn that part of the world he no choice but to hang out with ... right if you look at everything you get one side you see that oh he was a friend with Osama bin Laden up until\nNine eleven and the coal he begged bin Laden to step all\nRight well it's part of the the Muslim Brotherhood is might look he's part of a powerful family was part of a powerful family a wealthy family\nThere's a lot of issues there it's it's it's a crazy nasty world and you know at some point in time you you get to to a point where it's like the mom you know you're you're the odd man out no matter how much you've done for them you may be the odd man out three two three five three twenty four twenty three actually had been some shows your Twitter\nYou can tweet at us oh Mitt terms where we Thirteen Days away fourteen days away something like that I think it's now it's actually\nTwo weeks from tomorrow right she got midterms I look at this I'm I'm looking I have no idea what to make it I don't I think that the chances of of them winning the house the Democrats\nOver the Republicans I think it's very real and I think that they've got more than a a punch your chance and then some too when I think it's I think they're gonna win it and the other side of thing I think the Senate\nIs is they're going to pick up some places in the Senate which is going to be very interesting to see how the saying goes is there a democratic wave coming\nIs is they're going to pick up some places in the Senate which is going to be very interesting to see how this thing goes\nIs there a democratic wave coming we've got data supports that as a surge oppose having on ... for Republicans turn back the Democrats momentum there's data to support that or could this be a typical mid term with Democrats making just modesty there's data to support that too\nYeah Chuck Todd I have no idea I have no idea I don't I I look at one you know I like and I look at\nThings I look at polls I look at voter enthusiasm poles but I also look at things like ballots right ballot you you look at the absentee ballots and things that they should there's a lot of different things to look at\nNot just if you go with polls because poses so any as we found out with with five thirty eight and two thousand sixteen it's tough to buy in and do any of that and how much does the caravan and Kavanaugh\nPlay into what's going to happen Kavanaugh play it may play into it in the Senate but when it comes to the house\nAnd what potentially could happen there I don't know everything is too close to call it is crazy\nIt really is I look at this and I think to myself\nIs he going to get served in the house but as he can open it and I don't know what I Do know is what was going to be a sue nominee according to many ... that that's done and does it I don't think it's going to be a lot closer than people think\nPublic and this is only six months ago I think we were all talking about a blue wave that we knew was coming and was going to be very significant we're not quite talking that way anymore it looks kind of more interesting and complicated in this state by state\nYeah and I think it's going to be a very interesting battle\nIn two weeks because two weeks is a lot of time you're seeing a lot of the ... the voter momentum is its its neck and neck now for some out there may be too late for others out there there's still enough time\nRight like the Senate I still think the Senate is is there's just too much to defend we've been saying that a lot too much for the for the Republicans to to have a chance of taking because red state Democrats are up so the opportunity is more than there for the taking for them to pick off a couple seats maybe three states\nBut the thought process that they were gonna lose a ton\nIn the house and remember what happens in the house where everything's gonna originally you're going to talk about there's going to be spina of tax records there's going to be all kinds of things investigation of investigation this fight is going to be huge and Trump realize that's why over the weekend he was saying look\nLook at me as if I'm On the ballot because he understands how important is\nThree two three five three twenty four twenty three ... shows your Twitter you can tweet at us and I think this caravan is going to be another one of those things where in the next week or so depending on what Trump's damage is done could energized the base\nOr could piss people off to energize the other side of the base three two three five three twenty four twenty three actually I've been to Joe is your Twitter tweet at us my pillow\nTossing turning tossing turning tossing turning counting sheep tossing turning is that you been there I've got my fellow I tried it I was skeptical that said try it I said All right I'm skeptical more I\nAmazing those lumpy horrible pillow some of those tell us like the hardest rock other ones are like when you it's just like it's like a deflated accordion when you're on not with my ... my pillow is incredible vice you the covered I sleep you've been missing\nMade right here in the usa hundred percent mushy washable Dr ... and here's what they're doing for you right now right you get a ten year warranty buy one get one for you buy one get one free buy one get one free\n... I sleep like I've\nBuy one get one for you buy one get one free buy one get one free I sleep like I've like I've never slept as an adult it is incredible\nAnd I love it you're going to love it to buy one get one free ... eight hundred Ninety three forty nine Seventy five or go to my pillow dot com when you do use the ... and you get it better night's rest it's the world's most comfortable pillow my pillow dot com my pillow dot com ... eight hundred\nNinety three forty nine Seventy five from a convention at you had mentioned shows your Twitter C. J. D. P. E. N. S.\nO. N. but got your useless facts of the day wrap it up ...\nSuicide is a National Public health issue that affects all Americans but it is preventable the U.S department of Veterans Affairs is working to improve the health and wellbeing of our nation's veterans\nWith their be their campaign the initiative expands on the reach of mental health services in suicide prevention resources and connects at risk veterans with care and support Dr Quito Franklin executive director of suicide prevention for the U.S department of Veterans Affairs\nOf the coverage that you really need when you work with an independent insurance agent you get access to dozens of insurance carriers through one person that\nMeans lots of policy options and little work on your part our endorsed local providers are independent agents who will find the policy that works best for you it doesn't take long to get a quote\nAnd you could save hundreds sounds like a no brainer to me go to Dave Ramsey dot com defined the insurance he'll be in your area and see how much bang\nYou can get for your buck it's time to stop over paying and get the policy that works best for you go to Dave Ramsey dot com to connect with your local insurance E. L. P.\nP. Y. first lady of talk radio and most influential woman in radio lowering or shall starts next month one of the ... the H. A. C. K. U. T. H. Tucson [noise]\nABC News\nI'm Scott Goldberg the so called caravan of migrants headed to the U.S border is starting to shrink Mexican officials say two thousand people have requested asylum in that country leaving forty five hundred still trudging north ABC's Mack got man that's been traveling with them in southern Mexico we're still\nFifteen hundred miles away from the nearest us border in McAllen, Texas\nSo far over the past couple of days Mexican authorities have allowed them to proceed unimpeded but they're saying if they don't apply for asylum over the next couple of days they will begin rounding them up\nPresident Trump's threaten to use the U.S military to block the border the president's national security advisor says he spoke with Russian President Vladimir Putin's today about election meat meddling during a meeting\nAdviser John Bolton in Moscow after meeting the Russian President saying they spoke about election hacking the blood rebooting insist he had nothing to do with\nWhy it was particularly harmful to Russian American relations without producing a anything for them in return for\nPresident Trump continuing to do Russia oh lone act the American elections and says his campaign did not polluted country Andy field ABC News\nEarly voting ahead of the midterms started this weekend in some states the turnout already is breaking records\nEarly voting is underway in taxes than some of the biggest counties are already seen turnout numbers that far surpass\nTypical name terms and in many cases even the last few presidential election in Houston more than fifty three thousand people voted in person on Monday gnashing their twenty can record by more than thirty five pounds and vote\nIn some places long lines stretched around the building and people waited for more than an hour they cast their vote Emily ... ABC News Washington\nA mall street a pretty big rebound after a day that started out bleak the Dow is finishing down around a hundred and twenty five points that started down about five hundred points after the opening bell the NASDAQ down thirty one the ... five hundred down\nFifteen you're listening to ABC News\nTo find the latest coverage online anytime one of four one K. cutie H. dot com the fuse on news and saw\nTucson meals on what oh four one K. U. T. H. as we remember migrants making the way to the U.S border through southern Mexico continues to grow there's concern that humanitarian crisis is building meanwhile for\nCatholic community services and the Tucson city council of come together to collect donations for migrants already in Tucson dozens of donation boxes and bends fill up rooms to ward six officers in midtown Arizona State board of education says no to adopting education standards from a conservative Christian college\nOn our way out of office airs on the edge chief Dion Douglas at attempt to scrap newly revised sets of history and science standards in favor of standards written by a charter school initiative\nAt Hillsdale College private institution in Michigan\nBy sets of history and science standards in favor of standards written by a charter school initiative at Hillsdale College private institution in Michigan and looks like there was a million dollar Powerball tickets sold at the super proper Twenty one along highway eighty nine in Congress, Arizona\nOnce gold mining center in the ghost town Congress now serves as retirement bedroom community for nearby wiccan bird I my grand inviting you to join me for the first day if dean at six am right here on one for one Jake UGA\nHere on the table Madison a stormy afternoon expected from Tucson east into parts of the mountains and the southeast can decode cheese county all the way up into constant grind day the storms could last well into the evening hours otherwise we'll see tapering\nOff tonight dipping down to sixty overnight mostly sunny by Wednesday but the forecast high an eighty one eighty one again for your Thursday you can check first morning whether any time I take a nine dot com\nThese weather forecasts anytime on your Amazon Echo devices when we went out for a white cake you pay for these two sons and\nLet's talk trash I met you and I'm Josh you were the ... of Gibson's offer solutions\nTourists supplies are not the most glamorous of all subjects but\nThey're in the ... to keep your business running smoothly and in tip top shape at Gibson's office solutions we have thousands of the highest quality janitorial and cleaning products to help you stay stocked up\nSanitizing an squeaky clean check is out today at Gibson easy dot com or call us at six two to six seven three ... and remember to shop or go and buy local at Gibson's office solutions\nLeaking again the fact that and there's no hot water you fix that I tried okay I guess it's time to call professional I can\nTrust when property management professional realtors and homeowners need someone they can trust they called Silverado plumbing where most farmers have at least ten years' experience from a leaky faucet to putting in the latest high tech ankles water heater you'll have peace of mind working with Silverado plumbing conflicts nine six zero zero zero zero\nThe stock market can take big turns Jake Cagle of ... financial considers market volatility an opportunity\nJake Cagle of noble financial can help you rebuild your assets whether the marketing seen large swings up or down he can help you lock in the stock market gains\nJake and noble financial can assist you and making sure you have a diversified portfolio your money is not wasted on annuities that you may not understand [noise]\nJay Cagle as an investment advisor with ... financial services that has a responsibility to act in your best interest\nLet Jake and his team help you have a tailored approach your financial future [noise] called Jake today at seven four or five fifty five fifty five seven four or five five five five five or email Jake Adam ... dot com and secure\nThe money you have already or you\nKnow financial services are registered investment advisor\nQuality care I might grab next time I Do sons morning news the caravan draws closer to the Arizona border and the midterms are on the way will break it down on one oh four one K. U. D. H. your mid term election destination station\n[noise]\nYour health the\nRadio addiction starts now\nLaura Ingraham show\nLaura Ingraham show [noise]\nHas a massive migrant caravan defiantly inches closer to the U.S President Trump is calling us in a salt on our country selling USA Today but he will send as many troops to the border as necessary\nAs the car but I Love\nIs as I saw it on our country [noise]\nAnd you have some very bad if you have some very bad for you [noise] and we can't let that happen to our country and it's not we need a wall built that [noise] that\nYou are listening to the Laurie Ingram Joe eight five five forty Laura the president had a massive turnout yesterday in Houston, Texas and it was a son or this was like something you would see\nDuring the general election not during a mid term cycle and he had that place just it was lit on fire with energy and enthusiasm and optimism and you can feel it there's a there's a palpable sense of excitement excitement or in the Republican base and I think beyond the base\n... Raman royal was ah with the the crowd yesterday he was outside and inside\nA the a facility where the president was speaking and it was really fascinating to hear from the folks who were there and why they came ...\nWhy do they come this far some of them came as far as New York and Maryland\n[noise]\nComing from New York and Maryland and Florida to go to Houston for a rally during the mid term election cycle something's going on here\nAnd when the folks were talking about or when he was talking about the border and talking about the caravan or that's when that's when things really got jazzed up\nWhat's happening right now as\nA large group of people they caught a caravan\nI think the Democrats had something to do with it and now they're saying I think we made a big mistake because people are seeing how bad it is how pathetic it is how bad our laws are they made a big risk\n[noise] you're going to be maintenance free and time share free with the help of resort release so get out before the next round of maintenance fees are due and start saving for a vacation you really want to go on resort released had the a plus rating for the better Business Bureau now for six years\nYou're in great hands with my friends at resort release dot com [noise] put an end to your timeshare contracting the stress of paying those maintenance feet hall resort release at eight five five six explore that paid five five six six Laura or visit resort release dot com today\nRenowned medical correspondent and endurance race champion pop are not empty people ask me\nHow you keep competing at the age of Seventeen healthy living is important which so in a moment if you have paid you can't train so improve I discovered salon posh lie to keep watch this unique topical pain reliever contains too safe and effective anesthetics nothing as work better for\nSalon ... cream or role\nOr your word your identity could be held hostage you should be because ransomware does exactly that this is Tom Kelly studio a biology teacher making every American safer from the effect of ... served as a tall order but that's my goal so here's a tip the best thing you can do to help protect yourself from ribs and we're just a buck up your computer often\nIf you have questions about identity theft at even if you're struggling with fraud today my I Do care can help\nGet Fifteen Percent off my id care dot com slash Laura my id care dot com slash Laura\nHoney leaking again the toilet fat stuff and there's no hot water I\nThink that I tried okay I guess it's starting to call professional I can trust me\nHi leaking again the toilet and there's no hot water I think that I tried okay I guess it's time to call professional I could\nTrust meet someone you can trust working at your home at Silverado every plumber goes through a full background jak and most have at least ten years' experience when you have the professionals from locally owned Silverado bombing in your home you'll have peace of mind\nCall six nine six zero zero zero zero that six nine six zero zero zero zero\nYour copier isn't printing and scanning again so you call your IT company refers to your copier company blames your IT company and meanwhile you're valuable time and energy are being wasted instilled your systems aren't working\nCopy graphics has a solution copy graphics offers a complete suite of services including multifunctional devices managed I teach a comprehensive document management it couldn't be easier one call\nTo rings problem solved with today's complex systems you shouldn't trust just anyone trusts the local company with over Thirty Years' experience\nHi this is Jim Crawford owner copy graphics we know you struggle with who to call because we've been serving Tucson for over Thirty years when it comes to knowing what to do and how to do it right copy graphics has the answer is you need and fast\nPlease call us at seven nine two point nine nine nine to learn how we can help your business seven nine two four nine nine nine seven nine to nine nine nine\nBest stock market can take a big turns Jake Cagle ... financial considers market volatility an opportunity Jake Cagle noble financial can help you rebuild your assets whether the market is seen large swings up or down he can help you log in the stock market gains\nJake and noble financial can assist you and making sure you have a diversified portfolio your money is not wasted on annuities that you may not understand\nJ.K gal as an investment advisor with Nobel financial services that has a responsibility to act in your best interest\nLet Jake and his team help you have a tailored approach your financial future called Jake today at seven four or five fifty five fifty five seven for Bye bye Bye bye bye or email Jake Adam ... dot com and secure the money you have already or you\nKnow financial services are registered investment advisor\nDot org\nHey it's great to remember I'm On first resolve hours\nIt will I mean I Am now back in ... show on one on one shakes you\nCall Laura now one eight five five forty Laura\n[laughter]\nWhat do you think of this caravan we see what should the president and the Congress\nAnd the Marines in the military to the border to secure border\nYou don't know how many people are good I'm sure a lot of those people are good people but we can't we can't risk and the bad people coming in with a good exposure to stop [noise]\nYou know they didn't they didn't they should have\nStopped them but they didn't so\nNow we've got to stop all the while make our country great again I mean we have to be careful there are so many of them come in and I really feel for those families we come in the right\n[laughter] we found the families around the world who are suffering and we pray for them and we give philanthropic lead to organizations who can assist them in their home country [noise] true refugees [noise] true seekers have asylum\nMess Mexican officials\nAre and he was the guy who and they call them a human rights campaign or this is how lazy the media media are human rights campaigner and an ...\nThe guy put people's lives in danger he has no respect for US law no respect for us immigration law and apparently his goal is to do one thing\nFlood the United states with mostly indigent low skilled workers who cannot speak English and who just want to live here and not follow our laws because if they did they'd be filling out immigration paperwork like everyone else around the country\nNo respect for Guatemala's migration for Mexican migration law and now us migration that's three countries laws they violated by doing us busting pass police officials in some cases assaulting police officials it is a scandal\nAnd by the way other elements in this a migrant mob are present us border patrol officials have reported this\nThe majority of these people are not criminals\nThere no terrorists and they're not even immigrants that refugees and us our nation in the United states\nWe have to choose what kind of nation we are and then I was that we had our pre Josh than we are going to say all of them are are criminals all of them I represent that is not true so what do we have to do is to listen to them you're the cases and they just sort of political asylum Ben run a\nPiece he so uninformed he he refers to them as refugees\nA newsflash Jorge refugees under US law have to apply out of country they can apply at a port of entry so don't refer to them as refugees or not their economic migrants meaning they want to come here because it's a better place to live\nBetter place to live than Honduras well yeah a lot of better places are I'm sure a lot of places are not as nice as the United states but that's that's just the way it is\nYou don't respect our laws you do not deserve to be in this country period\nEnd of story respect our laws enough do apply legally and that is that\nWe cannot be mom out by these uh by these emotional extortion is no way\nThere are a motion all terrorists these people and and I and we know what they do they did it with the separation of families they don't give a rat's you know what about the victims of illegal immigrant crime in the United states they never and by the way when these midterms are over they won't even be covering the care about the only be covering it because they think somehow this is going to help them\nHere you have the president ought to states demonizing thousands of migrants coming towards this war that effectively shut down the border to asylum seekers and refugees and so on a who many of these people were actually qualify for that kind of status for you is going off on these migrants are describing members MS Thirteen or no Middle Eastern I I don't need\nTo hear that it's an bound Bangladeshis joined the migrant caravan in Guatemala according to Univision correspondents yesterday\nA Spanish language reporter who spent weeks embedded with the migrant caravan said said that people from Bangladesh had joined the mass of people trying to cross from ... in Mexico for an unsafe go Santa Ana reported from the bridge separate and Guatemala Mexico the bridge had been packed with thousands of migrants\nThe Bangladeshis he said were detained and immigration facility though it's not clear what happened to them after the detention\nThey infiltrated themselves in this caravan they tried to cross with the crowd that would have benefited them greatly but everybody ... everybody\nPhil turning themselves in his ... and they tried to cross with the crowd that would have benefited them greatly but everybody\nEverybody is here just to just to add to our are already rich culture because everything's melting pot and now we're literally sold a melting pot ask Western Europe how mass migration into Western Europe has changed Western Europe\nHas changed Germany has changed in Italy it changing Sweden as the European\nHow uncontrolled migration has affected their crime their way of life period eight five five forty Lara we got a lot more to get you don't go away\n[laughter] happier much here they're really mellowed a lot\nWell I mean that's that is for church or about Claire McCaskill or I mean he is a totally out of step with the state which has Missouri by the way right next door but\nUh how am I saying Illinois I'm this is a top breeding I Know slavery\nI'm Sorry about that of course\nI'm a whip yeah fourteen days to go in this campaign and uh we're at the state of the campaign hours seven days a week it is but listen here's the bottom line and in that campaign is that Senator McCaskill\nHas been in politics thirty six years that's about as long as I've been alive she's been in Washington for twelve long years she's become a party line liberal\nI mean whether it's immigration or shoot sponsoring the open borders bill with Diane Feinstein or whether it's the judges you voted no on just the Kavanaugh was all for the terrible smear that her party carried out she voted no on Gorsuch ... Supreme Court justices\nThat are at McCaskill is and she's just terribly out of step\nWith the state of Missouri of what the people at the state voted for\nAnd that's why we're going to replace so right now on this issue of this migrant mob I don't like calling in a caravan it does not now that doesn't really [laughter] it doesn't really capture it in my view\nI Wonder if people of Missouri thinking about like a crash like this on the border I mean it's a it's going to be a crash and it's gonna it's gonna cause a huge problem for immigration officials and it helps for the national guard\nThat I think that the people in the very really worried about it I mean I have as I travel all over the state I have I have people talk to me about it especially the last few days and they just yesterday every stop I made\nAll over the state people asked me they said what is going on and they what they say it thank goodness but we have a president\nWho is strong and who was willing to take steps to defend the country on like the Democrats unlike Claire McCaskill who they're open borders policy of course are what encourage this kind of lawlessness and this kind of a threat to the country and now they have Claire McCaskill up based this threat sponsoring an open borders bill\nI I just can't think of any war so I Can't think of anything all week I Can't think of anything that's more dangerous for months tutor for the country\nWell when you ah Josh look at uh the rest of America right now it seems that\nThe support for Donald Trump is growing you said is highest point in his presidency which is stunning given how perpetually negatives\nThe press is I mean it is a negative drumbeat coming out of almost every mainstream media outlet even with that he's at forty seven percent which is higher than bronco Obama was or how important is the president\nIn this race for you\nTo report you know Missouri voted for Donald Trump by almost twenty points\nOn that though that is a huge huge margin in Missouri which is still a swing state and that's because people want to what they want a stronger America I mean people voted to rebuild our country that's what they were voting for much they\nWhen they voted for President Trump and his policies\nAre rebuilding the country and they're good for Missouri You know we've got to the lowest unemployment rate it decades of the state of Missouri\nJob growth finally hitting new highs we've got blue collar economic growth job growth but its highest point since the Nineteen eighties in the state rural unemployment slow so we're finally starting to get those jobs back from overseas your wages grow but\nOne employment slow so we're finally starting to get those jobs back from overseas your wages grow but\nHere's what scared folks is that the Democrats Claire McCaskill want to take all that away throw it all and reversed reverse all the games and then go back to the policy of weakness overseas weakness on our border and uh you know we just can't have that that's what this election is about\nJosh how has these if at all these undercover videos of Claire McCaskill\nHarris her and her staff is that resonated at all what the voters where people are are saying that work for a while we have to kind of lie to the voters we can't really say what we really mean about a various issues\nThough I think it's been usually resident and you know the people to hate to to have a politician especially lifetime politician like Claire McCaskill the one thing to their face in the open up behind their back into the sea Claire McCaskill on tape\nSaying that she wants to take away the second Amendment rights you know he's a constitutional rights\nThe belong to people by virtue of our constitution to hear her talk about I was to take those away from all by citizens your staff talk about\nConcealing the donations from Planned Parenthood\nAnd other extremist abortion groups to talk about the fact that well you know the McCaskill really agrees with Brock Obama on everything but she won't say that publicly because you know Missouri voters are are so close minded I mean at the ... staff was caught thing over and over and over again it's it's really the condescension the contempt\nFor everyday voter is really remarkable and people are tired of that they want somebody who believes in the state who was not ashamed of our way of life and the state and it's going to go represented\nA Josh a when you look at the makeup of the Democrat Party today the\nPerpetual mob mentality that seems to be encouraged even celebrated or by some of their top leaders or how does this you know I mean it seems like maybe it's just a big cities and this is happening it's not so much and\nAnd you know in in places like Missouri but it it it's covered a lot in certainly certainly at Fox and other networks is that on people's minds of president says mobs not jobs ah and it seems like people just wanting to calm down and government work for them\nYou know I think that's absolutely true in Missouri or you know I I think that what the Democrats have on offer what Claire McCaskill is offering its chaos at home and weakness abroad and this this behavior it it is chaos than it is ...\nAnd I think with folks watch mobs driving people out of restaurants screaming them down and public banging on the doors of the U.S Supreme Court and shouting obscenity is I mean this is not\nThe United states of America or this was not\nCivil democratic discourse I'm all for strong disagreement that's great that's the first amendment but\nTo try and shut down speech and harassed intimidating even use violence against people I mean and have Hillary Clinton as you say Hillary Clinton and Eric Holder out they're encouraging it\nAs Claire McCaskill you know she is she's going right along with it I mean she is happy to see these ... employed that is not what the people in my state voted for that that is not who we are as Americans\nAre Josh I'm the concern I think a lot of a conservative religious voters\nHave is the social transformation of the country and the the idea that gender is something that is changeable and uh that you know that we should really celebrate these things in public schools and and obviously the conscience rights and the religious rights of many\nThat you know that we should really celebrate the things in public schools and and obviously the conscience rights and the religious rights of many say that's not what we believe we love all people but that's not what we believe how ... how are the social issues playing in your state this election cycle\n[noise] you know the Missourians are leaving the constitution and they believe in the first amendment First Amendment guarantees the freedom of religion to churches\nTo individual you know this was something where I spent most of my career hold a bit of politics for two years\nYou met him and I know you're doing a lot of girls out there\nYeah yeah but most of my career as a constitutional lawyer\nAnd as a religious liberty lawyer and the you know the people I said they are a fair minded people\nOr the you know we don't discriminate against anybody based on their religious views but you know what we believe in the importance of value face and we believe that the importance of value family community and those things built around\nFaith in churches in our houses of worship and we want to see those protected and I think to have the again the left wing agenda which has become so hostile\nTo people face a so hospitals are religious liberties just like a hostile through our Second Amendment rights just like it's become hospital to free speech really think about it what what the the left wing agenda really offers to\nUh you know you agree with us or you shut up into that it's just not what the people of ice they want people to this country\nI'll tell you Josh why I think that Missourians are going to do the right thing and vote for you I've met many reasons obviously substantive reasons when you have the right views on critical issues from crime to the economy and immigration so forth but I'll tell you why I think you're going to win is because the New York times is already writing ridiculous\nArticles about about your office in turmoil first of all you show me an office that doesn't have personality conflicts in in a and people moving in and out and departures and so forth\nBut it's this is the best that they can do with you that oh well we had a well you know of a surprising number of purging departing staff from the attorney general's office\nI started reading this today and I'm screaming laughing because it just like they can say that about pretty much everybody knows office\nYou know we are definitely getting the Donald Trump treatment I Love your time's up from the liberal you know the state and\nI Do I wear a badge of honor I mean you know and by the way I'm not going to apologize but all for taking up\nGovernment bureaucracy you know when I came to office I was on the first Republican uh twenty five years\nOr the office needed to be shake it up it needed to be made more efficient it needed to be a revamp and that's what we did and you know what a great result that I don't care if the New York times likes it or not I promised I Would do this for the people the theory I don't exactly what I said I Would do and that's what I'll do the senator too\n[noise] the stock market can take big turns Jake Cagle of noble financial considers market volatility an opportunity Jake Cagle of noble financial and helping rebuild your assets whether the market of seeing the larger swings up or down he can help you log in the stock market gains\nJake unknowable financial can assist you and making sure you have a diversified portfolio your money is not wasted on annuities that you may not understand\nJay Cagle is an investment advisor with no financial services that has a responsibility to act in your best interest\nLet Jake and his team help you have a tailored approach your financial future called Jake today at seven four or five fifty five fifty five to seven four or five five five five five or email Jake Adam ... dot com as secure the money you have already or\nNoble financial services are registered investment advisor [noise]\nRiver in Oregon Nice to talk of the most essential information you need to know during the first fifty four new seats whatever one taking the safety you see a Tucson\nI'm Scott Goldberg exactly two weeks before the midterm elections President Trump is saying without offering any specific evidence bad people may have infiltrated a caravan of migrants added to the U.S border\nBecause very well be that if you look at a I have very good information president have very negative emotions at\nThe White House that caravan of starting to get smaller ABC's Mac ... minutes\nOh more than a thousand miles from the U.S Mexico border secretary of state Mike Pompeo says the U.S won't tolerate the murder of Washington Post journalist ... who was killed at the Saudi counseling and ... says the department taking actions against anyone who may have been involved\nWe're taking appropriate actions which include revoking basis entering visa lookouts and other measures\nThe Saudis claim to show he died after he was put into a chokehold during some kind of altered Cajun but this morning the president of turkey said an investigation revealed it was an order to attack national security adviser John Bolton says he told Russian President Vladimir Putin about President Trump's plan to put pull out of a cold\nWar era nuclear treaty during a meeting today he says it follows years of Russian violations this question Russian violations is wrong and the\nRussia denies the clams if no one wins the one point six billion dollar mega millions jackpot tonight the Texas Lottery says the jackpot will roll over and reach two billion dollars friday experts say\nDon't spend all your cash buying tickets the ads don't get better when you do that on Wall street today the Dow finished down one hundred twenty five points you're listening to ABC News\nTo find the latest coverage online anytime one oh four one K. Q. V. H. dot com have you on the news in\nTucson meals on for one ... P H Senator Bernie Sanders campaigns with democratic gubernatorial candidate Garcia in Tucson and Phoenix today who wakes Catholic Relief services\nAnd the Tucson city council of come together to collect donations for migrants already in Tucson dozens of donation boxes bends fill up the rooms at the ward six officers in mid town council member Steve ... says he doesn't see\nAn end in sight for the need for more donations the McCain Institute of international leadership is launching his first initiative since the passing of Senator John McCain that calls for all mavericks to take a stand mavericks needed is a nonpartisan campaign\nThat's aimed to inspire and educate Americans about the importance of human rights and fundamental freedoms\nOn march two thousand Eighteen McCain Institute began to research project to understand the public's opinion on human rights\nStudy found a lack of common understanding these issues which helped to spur the new initiative I my crap you're listening to ... mid term election destination station\nIn Iran and get a phone Madison stormy afternoon expected from Tucson east into parts of the mountains and the southeast can decode teeth county all the way up and the constant grind day the storms could last well in the evening hours otherwise we'll see it tapering off tonight tipping down to sixty overnight\nMostly sunny by Wednesday with the forecast tired eighty one eighty one again for your Thursday you can check first wondering whether anytime I cannot\nLeaking again it's fast stuff and there's no hot water I think that I tried okay I guess it's time to call for fresh at all I can\nTrust when property management professional realtor and homeowners need some what they can trust they call Silverado plumbing were most farmers have at least ten years' experience from a leaky faucet to putting in the latest high tech anchors water heater you'll have peace of mind working with Silverado plumbing conflicts nine six zero zero zero zero\n[noise] the stock market can take turns Jake Cagle of ... financial considers market volatility an opportunity Jay Cagle noble financial can help you rebuild your assets whether the market uh seen large swings up or down\nHe can help you lock in the stock market gains Jake and noble financial can assist you and making sure you have a diversified portfolio your\n[noise] Hi leaking again the toilet and there's no hot water I think that I tried okay I guess it's time to call professional I could\nTrust meet someone you can trust working at your home at Silverado every plumber goes through a full background Jen and most have at least ten years' experience when you have the professionals from locally owned Silverado bombing in your home you'll have peace of mind\nCalled six nine six zero zero zero zero that six nine six zero zero zero zero\nThe stock market can take big turns Jake Cagle of noble financial considers market volatility an opportunity Jay Cagle of noble\nFinancial can help you rebuild your assets whether the marketing of seeing the larger swings up or down he can help you lock in the stock market gains Jake and noble financial can assist you and making sure you have a diversified portfolio your money is not wasted on annuities that you may not understand\nJake Cagle as an investment advisor would noble financial services that has a responsibility to act in your best interest\nLet Jake and his team help you have a tailored approach your financial future called Jake today at seven four or five fifty five fifty five seven four or five bye-bye bye-bye or email Jake Adam ... dot com and secure the money you have already heard\nNoble financial services are registered investment advisor\nSelling for Senate\nI might grab next time I'll do sons morning news the caravan draws closer to the Arizona border and the midterms are on the way will break it down on one oh one K. U. D. H. your mid term election destination safe [noise]\n\nYour healthy\nRadio addiction starts now\nLaura Ingraham show [noise]\n\nWages were arriving\nOn insurance rate was falling poverty was falling and that's what I\nTalk about economic marigolds\nAll the way the slowest recovery in history and we were heading down one percent GDP we were going out and we were loaned down fast so when I hear that and when professionals here that they left even professionals from the other side oh come on\nListening to Laurie Ingram show eight five five forty Laura president or former president obviously\nTaking credit for this economic miracle um do you know that in Ohio alone [noise]\nThis is my ... brown should lose\nIn Ohio alone or they were created more jobs between\nTwenty Seventeen and September twenty Eighteen than they've created in Twenty one years in the state of Ohio now that's because of Obama is that while because in the NBC Wall Street Journal poll Republicans have a Seventeen point advantage on trade\nAnd our trade policies have had a profoundly positive effect\nOn American manufacturing and American Jobs now today the markets are down because there's some earnings reports came out and they weren't great let's just the way it's going to go I mean these here's what I say caterpillars down and down for like five percent and um [noise] uh for early trading\nNear earnings well for decades manufacturers in the United states uh have been seeing our country sadly uh\nLose ground uh China Americans have seen our country lose ground to China there is going to be some temporary readjustment as we write this trade ship\nAnd it's happening and it's not going to be a straight line from a to B it's going to be difficult at times but we have there's no other choice we have to do it just didn't we didn't get into this trade mass overnight we're not going to get out of it overnight but Donald Trump's actually doing the only thing that is possible to do\nI'm my listeners also get Fifteen Percent off at my id care dot com slash Laura you can learn more and then let my id care take care of you at my id care dot com slash Laura enter the promo code Laura the Laura Ingraham show [noise]\n\nIt's your last week to get the Gen yourself sunspot correct or for free for sunspots age thoughts and even read inflame patches Renee from Boulder, Colorado raving about the brand new Gen yourself sunspot director she says it to go to product every day she has sunspots an eight spots can definitely see a difference in her skin since using it\nNow this is the last week you can get the sunspot miracle free time is running out you can try this wonderful special and watches sunspots vanish and your bags and puffing is diminished\nAnd for fast results the Gen you sell immediate effects is also yours for free so get ... dot com now or call them at eight hundred for eight zero fifty two zero you're still thinking order this week\nAnd you're gonna receive seventies luxury micro generation also free you can rejuvenate and clog your pores for instantly radiant and baby soft skin and right now shipping is also free fantastic special call them at eight hundred for eight zero fifty two zero six or go to Jen you sell dot com that's ... dot com\nBalance of nature's fruits and veggies in a capsule\nThat though I had a sinus headache for a few days but I had a massive brain ... image of the brain and stroke and I was on my desk\nBut I was on a respirator in a coma for thirty five days and three months later I came home and the wheelchair and double vision I have to learn to walk again to speak again one in one is to write the alphabet you know if I went out and did a little something might come home I'd be in bed now I'm up by like five thirty in the morning and go to the gym\nI Do shopping I cook I energy all day I mean I feel great overall my whole outlook just feeling about my mental aspect everything everything is better\nFor a limited time use discount code Laura and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one that's one eight hundred\nTwo four six eight seven five one or go on line to balance of nature dot com and use discount code Lara\n\nLeaking again the toilet fat stuff and there's no hot water I think that I tried okay I guess it's time to call professional I can\nTrust meet someone you can trust working at your home at Silverado every plumber goes through a full background check and most have at least ten years' experience when you have the professionals from locally owned Silverado bombing in your home you'll have peace of mind\nCalled six nine six zero zero zero zero that six nine six zero zero zero zero\n[noise] the stock market can take big turns Jake Cagle of noble financial considers market volatility an opportunity Jake Cagle of noble financial can help you rebuild your assets whether the market is seen large swings up or down he can help you lock in the stock market gains\nJake and noble financial can assist you and making sure you have a diversified portfolio your money is no wasted on annuities that you may not understand [noise]\nJay Cagle is an investment advisor with ... financial services that has a responsibility to act in your best\nLet's talk trash on ... and I'm Josh you were the owners of Gibson's offer solutions\nJanitorial supplies are not the most glamorous of all subjects but they are in the ... to keep your business running smoothly and in tip top shape at Gibson's office solutions we have thousands of the highest quality janitorial and cleaning products to help you stay stocked up sanitized and squeaky clean\nCheck is out today at Gibson easy dot com or call us at six two to six seven thirty eight and remember to shop all go and buy local at Gibson's office solutions\nSilverado router implementing knows that you're home is your most valuable asset we wants to help them you maintain that value one was the last time your home how to check you maintain the health of your body will help you maintain the help of your home coal Silverado router and plumbing and ask about our free hold inspection\nSix nine to exit the euro zero zero zero one more six nine six zero zero zero zero [noise]\n[noise] the stock market can take big turns Jake Cagle ... financial considers market volatility an opportunity Jake Cagle noble financial can help you rebuild your assets whether the market uh seen large swings up or down [noise] he can help you lock in the stock market gains\nJake and noble financial can assist you and making sure you have a diversified portfolio your money is not wasted on annuities that you may not understand [noise]\nJ.K goes and investment advisor with noble financial services that has a responsibility to act in your best interest\nLet Jake and his team help you have a tailored approach your financial future [noise] called Jake today at seven four or five fifty five fifty five seven four or five five five five five or email Jake Adam ... dot com as secure\nThe money you have already heard\nNoble financial services are registered investment advisor\nPlanning than wealth management your knee term election jak and they seem they can\nFind coverage online anytime at ... dot com [noise]\n\nCall Laura now one eight five five forty Laura private you\nWhen President Trump sees Hispanic cc's panic a and that is essentially what he is trying to sow at these rallies or he is trying to make the case that if these migrants somehow get into the country are going to find that many of them are with MS Thirteen the violent gang\nOr that we hear about so much she said he even said quote unquote middle Easterners are among these migrants [noise]\nYou are listening to the Laurie from show eight five five forty ... um [noise]\nDid did you have any sense of\nTerrorists wanting to use box cutters to take down planes before they did so I mean I guess we could have picked up some intelligence and they wanted to fly planes into buildings but we didn't really think about [noise]\nI always think it's better to just have a smart approach to law enforcement and constantly reexamine your vulnerabilities as a\nCountry given the threats that are out there [noise]\nSuitcase nuclear weapons\nRadioactive um dirty bombs uh\nMean I guess we can just pick a flyer and risk it just say well we hope everybody comes into the country is going to be economically self sufficient bringing no uh\nDo you believe that a free schooling is what what needs to be done for anyone who gets a foothold over the border though the Supreme Court ruled that we have to do that\nBut when is enough enough when when is when is the human tragedy of all of this both inside and outside the United states going to be enough for the Democrats\nI think it's important to stop this caravan impart to send a signal to Russia Latin America no you're not going to be allowed to come in and in part because in the process of stopping if we're going to learn a lot about the laws of need to be changed\nAnd frankly Congress maybe in the lame duck session audibly challenged ... not to know my comprehensive reform Bush said ten dumb things let's just fix one step at a time and begin to make it possible to manage our board half\nAs usual Newt Gingrich is one hundred percent correct\nDo not allow politicians to get away with these glib generalities oh we're ... we all were for border enforcement what does that mean you can't enforce the border that's being crushed by fourteen thousand people at one time can't do it so what do do they mean when they say they're for border enforcement\nDo they think the asylum laws as as they exist they shouldn't be changed so anyone who lives in fear of crime and their home country should be able to come here\nOr anyone that just wants a better life should be able to come here\nNo matter what\nThat's what the standards going to be so we better get ready to double and triple our population really quickly and all that entails environmentally with infrastructure with new schools that need to be built a with a massive changes demographic changes to our country we better be ready\nAll that entails\nI don't think America wants any part of that we want our country to be an orderly uh to be an orderly place a safe place a clean place where freedom and liberty is guaranteed by people who are informed about our history and our founding\nWho don't consider America just a place to go to get a to get a better job [noise]\nThat's just an economic migrant we can't we cannot keep our country unified at the end just as a people as a country period if that's all it becomes a place to make money [noise]\nDo you agree eight five five forty Laura is this one of the important issues on your mind don't go away [noise]\n\n\n\nIf you suffer from E. D. and you've seen your doctor about the little blue pill you know it can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle what if I told you that a certain little blue pill just came off patent\nA Senator Paul there needs to be significant changes made to our asylum process or to the entire system of immigration admission into the United states given what we're saying we had a thirty eight percent increase in family units crossing the border month to month\nUh in in August or September I'm asking me thirty percent year over year and it was among the highest crossing right we had since that two thousand fourteen disaster\nBecause people now if they bring a child and there'll be release or because you can't keep you can't keep them longer than twenty day so there'll be released together and then they never show up so it's the Senate and the is finally going to agree to move forward to change us otherwise we'll have a caravan every week\n[noise] [noise] yeah I think we ought to scrap what we've been doing there shouldn't be a lottery system people who end of the country should be based on merit we should be selective on who comes to the country with regard to those who come across the border\nI Would say look you want to keep people together and keep families together do it through it within twenty four hours and send them back and the thing is is we have an immigration office apply to come in\nAs far as refugee status what we've done is we take it away all the rules claim to be a refugee none of the rules apply so typically if you come in here and you can legally immigrate there are some decent prohibitions on getting on welfare and on getting on government assistance\nIf you're a refugee apparently all those things go out the window so everybody knows that when you come you have to be a refugees you can get on welfare and get into government housing and this is something that should change I'm fine with it we can absorb people want to come and we're\nEach year\nThe change I'm fine with\n... we can absorb people if they want to come and more\nEach year\nPeople that we can emitted into the country and how many we need and will make that decision each year but uh we can't allow just people just to to come across the border by the thousands\nUm we're talking Rand Paul here on the lower income shows Senator Paul what do you think um are the most important issues facing the country today given everything that we're seeing all the great\nAdvancement we've made in the economy the Republicans are leading by a historic margin in the handling the economy Seventeen point advantage in trade and the new NBC Wall Street Journal poll a those two issues are our math and plus it's for the Republicans in in a tough mid term cycle cycle normally\nSo what do you see especially coming from the Kentucky perspective\nI think the good news is overwhelming at all obscured by the media you know all the all him being carried away with all the Trump arrangements center of the good news is overwhelming we have an economy growing at just an amazing paste over four percent and your lives growth unemployment at historic lows\nThe main thing I see is I go round Kentucky when I talked to plant manager says\nThey said we have a shortage of workers a shortage of people who are drug free with work ethic and so the answer here is this is a time before but this is a time when we should convert or work programs that are on welfare programs to hey there's a job down the street programs and I think if we were able to do that\nYou know we have a great future coming ahead and most of it's because this is what Republicans off in the Washington don't get they keep calling it tax reform and the president directs them no it was a tax cut a significant tax cut will return money to his rightful owner leaves the money in the private marketplace and guess what\nThe private marketplace will boom when you leave money and the private marketplace and so\nAll of that has been great and I don't think we can emphasize that enough and I think in the election they come to fruition that not only the Kavanaugh excited the Republican base but there are reports that early voting in seven out of eight states that are reporting\nWhere people can uh decide how many a Republican and how many are Democrat the Republicans are are in a big upsurge with oh you're voting\nYeah which is is is you know music to my ears because Tom\nStyron Soros and others have really funneled an enormous amount of money into voter registrations on college campuses which are overwhelmingly I'm moving to the Democrat Party or a Senator Paul why should Americans\nCare about this Saudi killing of this Jamal ...\nWho ah was living in the United states he was ... or was he he was previously kind of a sympathize with the Muslim Brotherhood and he you know he was mourning the death of bin Laden although he thought bin Laden went off the wrong track and got to radicalize but\nMedia had been tied up on this story for you know a couple of weeks now\nI Would say that ah the killing of cars showed me by the Saudis is just one more incidents of things that they do that are not good for America they spent over a hundred billion dollars over the last several decades a supporting the ... around the world that teach hatred of Christianity Judaism and Hindus\nThey're over ten thousand madrassas in Pakistan supported by them the Hakani network which is a group of\nA bad actors in Pakistan that attack our soldiers in Afghanistan they all the leaders of it went to them the draw of funded by Saudi Arabians Saudi Arabians fun addresses in Indonesia as it used to have a relatively moderate form of Islam is a big Islamic nation\nProcess funded by Saudi Arabians Saudi Arabia and fund madrassas in Indonesia as it used to have a relatively moderate form of Islam is a big Islamic nation but there there's a growing faction of those who now believe in violence against civilians\nTaught by the Saudis so the Saudis are bad they have been doing this for decades and we sort of turn a blind eye say it's all Iran Iran Iran we have to support the Saudis\nI'm not so sure that the Saudis are lesser evil than the uranium to tell you the truth the war in Yemen is going to drag us into another war in the middle east thousands of civilians are being killed\nSo the killing of the journalist I Would say is just one more item\nAbad action by Saudi Arabia but Saudi Arabia sent arms by the hundreds of tons of it into Syria\nTo ... an al ... they they they supported the worst and most extreme elements of the Sunni extremists in the Syrian civil war\nSo no I Can't think of a reason why we shouldn't be hopping mad about this but what I've advised as we should quit selling them arms or should quit aiding and abetting them in what they're doing throughout the middle east and the world\nWell the administration and the president himself yesterday said you know they're and they're important partners of ours though in the middle east is that not the case I mean they've actually\nAssist in American interest in the middle east is specifically obviously with Iran which still is the largest state sponsor of terrorism\n[noise] yeah but I Would call the Saudis the largest state sponsor of radical Islam you know they really teach it throughout the world the people who came attacked us on nine eleven weren't Iranians they were Saudis\nIf you really look at worldwide terrorism is the Saudis and their form of ... and that is being sent an export around the world so uh as far as arms\nThey buy some of our I'm sure but I don't think the armed military arms are or something like any other private entity like widgets or whatever\nOur arms or something unique we paid for by the taxpayer the F. sixteen is not something that\nIf we could get jobs by selling up six team to China or Russia I Would still be against it because I'm not I don't see our arms trade as jobs program it's about our national defence and I think selling arms the Saudis actually puts a a set a greater risk\nIt increases or risk that Yemen's going to devolve into chaos and like Libya before it in Syria and Iraq before that chaos is where terrorists breed so if we want to stop terrorists we need to quit aiding and abetting the Saudis and creating chaos\nI download Jim ... who's the Saudi foreign minister responded to your uh view on the show you down and he said that\nI find it very surprising that some of these thousand miles away from the miles away from the intelligence on them at the center\nAll this is not the only thing\nI take a swing it that\nLot too excited to be lectured by some autocrat from a dictatorship you know the Saudis have three thousand people in prison right now without trial so he says oh we should presume the crown prince to be innocent until otherwise proven what about the three thousand people in your country that you have locked up in jail and you don't give a trial too\nSo I think it's pretty galling for him to take western standards our western standards a presumption of innocence and say oh we need to presume the crown prince to innocent it's a dictatorship nothing happens over there without the crown prince being involved\nThe Fifteen people that were involved with killing and dismay and bring this journalist apparently many of them are henchmen there travel with a crown prince when he travels it goes up to two people who their punishment now has been being fired\nOur henchmen there travel with a crown prince when he travels it goes up to two people who their punishment now has been being fired\nTo chop ups or to the chopping up and the ... member him and other journalists\nAnd you get fired my guess is they're uh they're banished met will be in royal exile somewhere with lots of money the lower level people they will probably executed an outlet talk to anyone because they would probably implicate the crown prince and this so no I'm not too excited it'd be lectured by these people\nA Rand Paul here on the ... Sen Paul thanks so much great to talk to you as always going to take a break on the lower income show eight five five forty Laura ah what's next in the midterms well it looks like more violence as vandals throwing a giant Boulder through congressman Kevin McCarthy is office window\nNow and this is just one of many instances of violence a and vandalism against Republican or conservative officers organizations will get into more of that as the mob mentality in the left continues to foment problems the Laura Ingraham show", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Tucson", "day": "23"}