{"month": "10", "state": "AZ", "station": "KQTH", "content": "Coming into the hot summer months here in Tucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old bull updated revenue fool unsolved\nDon't weigh gall to unseat Costa ... today remember seeing the won't send a salesman to your home GNC will send a hands on experience project manager\nTo give you your free no obligation quote hand guide you through the entire construction process\nDMC cost improved renovations will be offering the real deal new pools special all summer long so don't wait to get that Blue Bell call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the cost of pools or motivations today\nAt seven nine seven zero one six eight seven nine seven\nZero wants to say for on Facebook or GMC fools dot com CFC custom pools are automation simply the right choice\nThank God Almighty our\nFather was fought on four one K. to the age on Twitter and Mike is on Facebook one oh four one K. U. P. H. T. T. P. A. confident than talk\nFrom ABC News\nI'm Richard camps who\nDon't be surprised later today\nWhen your wireless device sounds an alarm laughing to Eighteen pm eastern time less than twelve hours from now\nThis afternoon you'll get a message on your phone that reads presidential alert this is a test of the national wireless emergency alert system no action is needed it's part of FEMA's first nationwide testable wireless emergency alert system mental let people know about things like nuclear attacks or widespread terror attacks\nFEMA estimates it will reach about Seventy five percent of mobile devices ... ABC News\nWith the FBI investigating allegations of sexual improprieties against Supreme Court nominee Brett Kavanaugh President Trump declared young men should be concerned right now\nHe was asked what the messages that he's sending two young men\nOf course all this with Brett Kavanaugh's nomination hanging in the balance and\nPresident says that this is essentially a scary time for young men in this country you can be guilty of something that you might not be guilty of and and basically you're guilty until you're proven innocent but it didn't end there he was also asked what his message for women is in the country and the president said women are doing great\nABC Sicilia Vega Indonesia announced the death toll from the earthquake and tsunami as top fourteen hundred\nWe are at the hospital in America saw which has been treating the engine or just a little and they went in to speak to a twelve year old girl\nAnd she described it almost as being in a dream she had no idea what was going on to break a leg up father ran out of the house ... he got injured as well the family are inside or they have all the ... of other in a similar position\nABC's James long then defense secretary James Mattis is attending a meeting of NATO defense ministers in Brussels it's expected the U.S will announce it will use its formidable cyber warfare capabilities on NATO's bath if asked as a counter Russian cyber attacks you're listening to ABC News\nAdmitted you probably want to eat healthy but getting enough organic fruits and vegetables into your diet every day is not only time consuming and expensive that's why in Texas super food we've created a blend of the best USDA organic vine ripe and fruits and vegetables powerful enzymes in probiotics\nAnd energizing herbs all in a convenient capsule or powder we call it Texas super food complete organic high on natural pathway Dr Denis black and I invented Texas super food almost Twenty years ago with one goal in mind\nTo help people like you who lead busy lives get the ...\nSee our full line of quality nutritional products to Texas super food dot com or call it an eight five five Texas fifty five ... five five Texas fifty five Texas super food dot com\nGoing when you're on this kind of goes we look ahead a little bit we're going to see some really nice fall\nWeather to round out the week with hides in the mid to upper eighties overnight lows dropping into the load of mid sixties but then this weekend that's when things start to change again the first significant\nCold front of the season will sweep through the area and drop our temperatures end of the seventies by Sunday and Monday believe and drop a few rain showers snow levels could drop down to eight thousand feet check Kagan nine whether any time a gay guy nine dot com\n[noise] ... you say that there is a poll you don't say\nWhat the questions were that were asked in the bowl and then you expect us just to accept the pole so here's the thing you just want to be very direct about those most Americans don't care who's on the Supreme Court\nI think the ... they're too busy with soccer practice and going to school and building relationships and and working for a promotion at work they really don't care much show the very small amounts of these legacy media outlets are going to give them before asking a question do you support common off if they're going to tell them\nBrett Kavanaugh as a guard at thirty six years ago it was accused of sexual harassment or assault on a on a girl with a party are you for that person being on the court why although [laughter] but oh no way if that's all you gave me and I didn't know what I Know I'd say you know as well\nHe'll pack ... forty seven bought one oh four one K. U. T. H. time from you can talk [laughter] Dave Ramsey show\nThat Nancy is on Facebook or reverse mortgages ever a good thing new what is the principal here let's see we work our whole life to wrap on Romney finally get completely out of that house and everything and the motivator washed up after his own an infomercial ... to get a new death now that they work their whole life to get out of the\nSome of my home every possible for us have randomly shout\nLet a new one on one in four one K. C. C. H. sized dog that prison plants show morning but this is all about\nThe Democrats and their love affair with abortion and\nRoe versus Wade and about their base which was angry that they didn't derailed Brett Kavanaugh may open hearings and southern Democrats started jet and stuff up and here they have this letter that Dianne Feinstein have been sitting on for weeks and weeks it was well pressed and the ... with that thing and we're up to the race\nOr creed branch LA Times and I'm Wondering four one K. key ph two sons news and talk\nPanic American African American et cetera but America and unity first\nOr American of Irish descent Italian descent Asian descent I Am an American of African descent we are all Americans first a common culture in heritage we might like to visit her ancestral homes but we don't want to live there\nOur ancestors came on different ships but we are all in the same boat now time for every citizen of the United states to say I am an American\n[noise]\n\nIndependent and thought has punk rock in life methods shell\nSays it in front has portrayed himself as a master dealmaker who turned a million dollar loan from his father into a multibillion dollar empire\nStarted off in Brooklyn my father gave me a small amount of a million dollars I came into Manhattan and I had to pay him back and I had to pay back with interest the New York\nOther empire I started off in Brooklyn my father gave me a small amount of a million dollars I came into Manhattan and I had to pay him back and I had to pay him back with interest the\nNew York times reports much of his fortune is built on what the paper called dubious tax schemes and outright fraud the president's attorney called the story one hundred percent false and highly defamatory but state tax officials said they're reviewing the allegations which are too old to be prosecuted\nTo be prosecuted finally people are talking about cabinet Kevin as I could\nNot talking about me talking about the trillions of dollars the Trump stole from everybody ads not your money's not your dad's money that's our money how do you see I I don't care about\nThis I Know it's weird to see because so many people are obsessed with\nOPM other people's money\nRight they're obsessed with like he had all this money but he didn't do it right he said he only did this do you really believe anything he says I mean sometimes he says that if that's true\nAnd even when he did something right a lot of times these stretches the truth\n\nI mean you know and it is what it is people are like well that's the only reason he's read some of the only reason he ...\nHe has been successful trust me go go go up the Silicon Valley talk to venture capitalists who have given out hundreds of millions and millions and millions and millions of dollars to start up companies to watch it go right in the dumpster\n\nRight we get five hundred million dollars to cylinder how that worked out for us\nIt didn't [laughter]\nIs what it is but it's the other people's money why are you so obsessed like Bernie this is going to this is going to Bernie and and Elizabeth Warren\nAre going to talk about this and it costs the oh Cortez food Jamie's in years does it they only reason it this way is because of this you stole money that's no that's not your money ... money that's the people's money\nAnd I've never understood that I've never understood why we tax the debt\nSo\nI've just I've never understood that so you die and we want to take some of your money why you've paid taxes on it why should you have to pay taxes again because it's not fair\nAgain it's silly I've never to me and and I want to see if they break this thing down over the next couple of days 'cause this'll be something that everybody comes on ... ... is OK okay did he really do something wrong\nUh you've got your fuel pump out next thing you know it's two grand to get all this thing sorted out because I got to do all kinds of things do your car\nOh my God sweating into your car she'll take care of it and utility mechanic he wants to take care of they're not going to tell you to take it some mechanic just to get to get you out of the door your favorite mechanic you're twenty four seven roadside assistance and rental car for freeway cars in the shop\nDo what I did get extended vehicle protection ... eight hundred cars sixty one hundred mentioned code Benson or visit cause you'll dot com use code Benson is going to save your ten percent ... percent or ... eight hundred cars sixty one hundred\nAdventure shows your Twitter C. H. I. D. B. E. N. S. O. in the champions you\nSleep played the super important a role in your physical health sleep is involved in healing in repairing have your heart and blood vessels ongoing sleep deficiency is linked to an increased risk of heart disease kidney disease high blood pressure diabetes and stroke\nThat's according to the national heart lung and blood Institute's when I found my pillow and started staying asleep longer and sleeping more deeply I vowed I Will never use another pillow\nThe difference is real and you need to experience it for yourself I was skeptical but I'm a loyal customer now and that's why I had this great offer for my listeners backed by popular demand the my pillow buy one get one free offers here\nCall eight hundred nine four four forty nine Seventy five or go to my pillow dot com used promote Benson to get to my pillows for the price of one get a better night's rest with the world's most comfortable pillow that's my pillow dot com promo code Benson\nCall eight hundred nine four four forty nine Seventy five or visit my pillow dot com and use ... Benson\nDave Ramsey show that if you told me you had a thirty thousand dollar per hour tell you the solid because it's more than half your annual income and they would actually move the needle on the forty thousand dollars\nAnd I would tell you the solid because it's more than half your annual income and they would actually move the needle on the forty thousand dollars\nBest 'cause you could buy a five thousand dollar truck and your foot twenty five thousand torture forty ... that would that would make sense\nSelling a ten thousand dollar trucking putting five thousand dollars torture death now since I was our trucks not a problem that fits in if us what their lifestyle is not a big deal it's not over done [noise]\nWhat's your what's your answer to your equation though is just to get on the written budget jump on every dollar dot com download the free app and get your budget going every dollar has tightened that I\nKnow going out partying I'm gonna just lean in okay so if I make fifty thousand and I live on thirty thousand that's twenty thousand a year for two years and um that free political\n... let a new one on one in four one K. K. C. H. San Susan talk\nThe entertainment even hard to believe but today it's been a year Tom Petty made sixty six rock and Roll Hall of famer died last October second another casualty of the opioid\nEpidemic dying of an accidental overdose or fentanyl opposite coat on an other prescription drugs and expensive box set and the hits was released last friday including an released songs like the Trump Gainesville which dropped a little over we\nEven go there is doing it live host alive edition of the Late Show on election night November six something common feeling Spielberg's\nWest side story is found its Tony baby drivers and so ... will reportedly star and the big screen adaptation no word yet on other caster the sons of anarchy spin off Mayans and see is getting a second season the FX series one of the new shows right now and cable season two premier next year and happy birthday\nKelly Ripa oh live with\nKelly and Ryan hostess forty today I'm Jason ... focus\nOn the White House president from taking a victory lap on the new trade deal between the U.S Canada and Mexico calling\nIt the most important trade deal the nation has ever made\nI don't want to see our companies leave and fire are workers and I work has never get jobs to replace those ships\nRather than at one point said he believed the new agreement with parents Congress easily later he said he wasn't continent lawmakers would approve it because of political considerations ABC's\nKaren drivers in one of the more happier due to use the president bestowed the medal of honor on retired army medic Ronald sure junior\nPinned down by fire in a remote part of Afghanistan in old age sure stabilized five soldiers and helped evacuate them down a steep mountain side using his body to shield the wounded from enemy fire\nNot a single American died in that brutal battle thanks in great measure to Ron's heroic\nActions sure enlisted a year after the September eleventh attacks Richard camp to ABC News\nDesperately trying to get aid into the quake and tsunami affected areas of Indonesia these on your world headlines from ABC News Matthew ... from the international Red Cross in Geneva\nLarge areas really close to the epicenter quite quickly access to even access to it all sort of getting some things that are pushing into those areas and they just have to work in the not so rich community in a pretty grim\nThe death toll continues to rise leads to searching a dozen homes in the headquarters of an association based outside a bunker in France in an anti terror operation a Chinese destroyers come very close to a U.S navy ship\nIn the south China Sea forcing it to maneuver to prevent a collusion and the south Korean officials told lawmakers that the north\nIs estimated to hold up to sixty nuclear weapons it's sold\nTo prevent a ... and the south Korean officials told lawmakers that the north is estimated to hold up to sixty nuclear weapons it's so first public comment about the size of ... weapons arsenal I'm home rivers that the ABC News foreign desk in London\n[noise]\nShown on fire and allowing it over to the way we have we don't really ill [noise] goals are\nGoing to join us here bottom of the hour [noise] bodily our workers enrolled is going to join us but radio did your voice so there's a a a\nCartoon that is out there on the Facebook and Twitter and\nIts\nDo I do I find it to be acceptable now but\nIt's free speech and it and it's a a cartoonist far left\nCartoonist name Chris Brett who did a cartoon and talking and it essentially when Kavanaugh talked about his daughter praying for Dr Ford instead it's his daughter praying for her you know ... or her drunk massaging as the father\nAnd lying father too but that in there and people are people like I posted it\n'cause I Want to know and I wanted to see the reaction of people because I think it's fair\nYou know I did something today that that pokes fun at the left for treating him as a boogie man and his evil that all of this stuff and the same people are cheering and a lot of those people are disgusted by this and this is the point I'm trying to make is is we live in a world free speech but I don't like I get you know\nBut that's a speech protect speech you don't like and I'm Amazed at how many people\nWere like that should be you need to take that down immediately I mean I don't I'm not going to but it but what I'm offended well then you don't have to look at it it's a great thing about the world we live in a free choice nobody's saying you have to look at\nI don't want the guy fired and he's already getting in trouble and you know me it's it's I don't look art is thought provoking it is it it's meant to get a reaction out of\nWhether it's comedy or music or acting or cartoons or whatever it can get a reaction out of you\nAnd it's meant to do that\nDo I think kids should be off limits I get some ways of always said kids should be off limits and never talked about Obama's kids that I never I never would Trump's kids got a lot more involved there a different story they're adults I Will never talk about anybody else's kids at the same time he did bring it up\nI did\nBut in a world of free speech this is ... it's the same for everybody in the snowflake generation of I don't want to hear it hurts my feelings I I read somewhere today that clapping now could potentially be a ... you know or that they should stop clapping because it could be a trigger warning\nCome on now for this but\nYou've got to be able to give and take any we either side and it's sad to say side we have\nTo be able to protect our speech\nThat's what I'm looking for is open minded people enough to go I don't like it just because you can't it's always I mean you should and that and that's more of a taste that right\nWhen I'm looking for is open minded people enough to go I don't like it just because you can isn't always mean you should and that and that's more of a taste that right like a fat guy and in in a in a banana\nHammock or a or a large lady in a bikini just because you can doesn't always mean usually three two three five to eight twenty four twenty three ... what was your Twitter she doesn't need to worry about that because she is a ... to say the least yes and told the judge is straight away she had been such a\nSuch adventure and show [noise]\nAre you fifth year older okay well I'm not going to ask\nYou to raise your hand so don't worry but I Do want to ask you have you sign up for a Mac yet if your answer is no why it's a free membership for one year you don't even have to give them credit card information and just for signing up here's some of the stuff you're going to receive just some forty percent off movie tickets\nIf you're going to brag about your wealth away Trump does and and and meet some\nIt's not just from women but um if you're if you're going to brag about your wealth away Trump does and\nAnd and meet so many reality t._v. types in playboy bunny types through um [noise] you know your entertain the entertainment aspect of your career I'm you're going to get a lot of nuisance suits um they did it with Clarence Thomas\nAnd uh it's worth familiarize yourself with\n... with the claims and the evidence in that case the the credible witnesses were all one Clarence Thomas suicide the incredible witnesses um we're all on\nThe role that were there were only two who ever ever backed up what I'm what I'm saying and they had big problems which is why I mean those hearings transfixed the nation it was it was very quick and at the end of the hearings a two thirds of Americans believed\nClarence Thomas but the media is set to work I'm over the next year or just you know we did what they're doing now\nJust over and over again lying to the public boy talk about fake news on the greatest thing about Trump is that is driving down I mean for people like you are and and me we knew um that the media were liars long ago but I think a lot of\nNormal people with with busy lives you don't pay that much attention\nI'm Still thought they were getting news from the media um a year after the Clarence Thomas hearings the percentages had reverse two thirds of Americans um claimed that they believed hill and not tell them so that's exactly what they're trying to do right here right now with Brett Kavanaugh um we've seen\nThere's no evidence we've seen that it's it's stunning that that NBC NBC the network that\nSpent months investigating Juanita abroad drugs rape claim against Bill Clinton refused to run the interview with her until after his impeachment trial was over to make sure I'm that ... that every Democrat would be\nWould be fine blocking the removal of Clinton from office but this woman last night this Julie sweat like the one claiming the the gang rape parties that she kept going to over and over again um\nNBC has to admit she gave us four witnesses one one witness [laughter] got back to us and said\nShe's never heard of Julie sweating it before the other witness is dead the other two have not responded and yet NBC puts an interview with her on on TV and hypes it to the max\nOh absolutely and that that's the insanity they give them a platform that they wouldn't give other people who had legitimate claims along the way\nAnd uh but you know this is the world we live and I've always said it's the stuff you don't see that the media doesn't want you to see the more dangerous to to them and and to their side if you will\nThan the stuff you do see it and this is the sad thing and and I'm looking for like two thousand twenty people talking about you know by by by and everybody's like how by going to live down what happened with Anita Hill because that's something that is now starting to come out in a lot of people making noise about that 'cause the right if you will is using that against the entire cabinet or a argument\nYeah he ran the hearing properly have outrage [laughter]\nI mean he didn't say he was I I think fair\nTo Clarence Thomas I Will give him credit for that you said before the hearings he was going to vote on purely I'd a logical ground it was a Republican nominee he was voting against Clarence Thomas something that Republicans might want to think about doing um but no it's it's ... Democrats of course have to\nHave to pave the way they were the first ones who can be absolutely naked vicious partisans once they've done it you'd think Republicans would say okay you did it to our nominees were voting against your nominees but Republicans have this idea that there are good sportsmanship will be rewarded by better with better\nAnd it's our nominees were voting against your nominees but Republicans have this idea that there are good sportsmanship will be rewarded by better with better behavior by the Democrats\nIt never ever ever works and yet they keep trying well let's try it again this time um but yeah ... uh he did at least run the hearings you know honorably unfairly\nYeah well I mean that but again that now will come back and bite him because as we all know that you like what do you make of this retro rage I mean that's what I call them retro rage where something you do a joke today on Twitter or whatever I mean you'd like today I got a bunch of people because we put up a fake movie trailer about you know cannot be the Boogie Man the people like I hate you and stuff like that\nAnd I expect that from certain people but you know you go and sweet something today and then all of a sudden six months a year from now what was funny we we we moved the goalpost and and now it's evil and bad\nI mean at one point in time there's got to be like a drop dead date where that's five years you can't go back five years now we're going back twenty plus years because he had a few drinks in high school or college and he gets in saying this retro rich\nThirty five with him while I really think it's ultimately it's ... it's the substance I'm I don't care how many years ago it was um [laughter] having beat her in college this hysteria over his beer drinking is is is utter madness\nUm they tried to as always ... um they take\n'em a silly charge 'em Trump used a bad word in the Access Hollywood tape and instantly that goes through this chapter two of my of my book now resistance those few tile um the hysteria over the Access Hollywood tape and how\nUh the left and the media ended up hurting themselves with their tight and outrage over that um if you listen to what he was actually\nSaying it was the same formulation as when he said he could shoot somebody on Fifth Avenue and his supporters wouldn't leave him he takes something that is axiom ethically unacceptable to describe the passion of a certain group of people in in the case of the Billy Bush\nAccess Hollywood tape when he was saying is\nThe craziness of celebrity culture when you're a celebrity they let you do it that's what he was saying and then an inside and something axiom radically unacceptable using a bad word yes he used a bad word um um it ... it would have been you know sophomore embarrassing\nBut known as the media instantly has to go to he's\nAdmitting to a sexual assault no he said they let you do it and we're seeing the same\n... dumb follow the same path right now with the\nBeer drinking 'em knowing it proves he lied he lied no he said he drank he said he cringed over some of the things he did um he said sometimes he drank too many beers on there are now taking a college kid getting drunk and claiming that blackout drunk\nNo no I'm Sorry not that I wouldn't care if\nIt ever um you know ... blackout blackout drunk [noise] um but you don't graduate number one in your classroom high school do so well end up at Yale and do so well at Yale that you go to Yale Law school I'm no he he's he's obviously someone who works very very hard that is not a raging alcoholic\nNo no it's not I don't and again it go ... here that's what they're trying to come up with perjury\nCrazy just to hold the region for anything talking at golden resistance is futile file\nOr how the Trump hating left lost his collective mind and they lost more than anything uh lets flash forward a week and they get some of this stuff done that they think they're going to get done because again there's no cold case files or not they're not going back and taking out something DNA there's no crime scene where do you think happens from here if\nSo I've done that they think they're going to get done because again there's no cold case files or not they're not going back and taking out something DNA there's no crime scene where do you think happens from here if it is it going to satisfy Murkowski Collins and flake enough that they did they get this thing done or is this\nI think that the way that Trump's looking at this now saying we can make lemons that dilemma we can take a we'd make lemonade out of lemons and make this big push for November and in maybe steal a seat or two in the Senate\nI wouldn't count on it I said look if that's what it takes and if it comes to that I'll discuss it then but um it's hard to keep an anger building\nUm we have a lot of weeks left ear and I think the number of people who will be angry\nOn our side will also be matched by the number of people who are demoralized they've got to confirm Kavanaugh um there are that pressure has got to be put on if if they're wavering\nUm and I probably shouldn't be attacking them so much on Twitter because they haven't precisely sad um but I tend to think we will get Murkowski and Collins I also think it's very likely we're going to get 'em mansion and hide camp\nLooking at the polls in their states and they're up for election and there is a lot of rage on the other side I'm On our side that is to say I'm for the first time real rage over there so don't start no I'm I'm I'm sick of Republicans saying just as a general matter\nOkay we lost this time but we're really set up oil for next time no I've had\nWith next time I Want to win this time and there is no reason this man should not be confirmed this report said so I think today they come back and we need nine justices on the Supreme Court there is there is a time limit on there are there are times not a time limit but there are time demands there are time constraints we need\nTo get Kavanaugh confirmed this is nonsense is just allowing the nonsense to go on and on and on it's been what how many ... a hundred hours since since\nDr Ford's literally substance all substantive lists\nEvidence free corroboration free allegations and an chock full of lies herself on her testimony has any additional evidence come out to support or no none none now now we're down to whether Brett Kavanaugh's a bureau ... know this is nonsense\nBeer like Ann Coulter love having you on resistance is futile how the Trump meeting left lost his collective mind look forward to talking to you again I appreciate that as always thanks so much\nGood to talk to you by by by\nUh she she you know what you don't have to agree with her she's got past year and she's got her thing she does her thing I don't always agree with everything she says just like I don't agree with everything that everybody says on either side a and it's and it's funny but she's got\nTo review your free no obligation quote hands guide you through the entire construction process\nDMC comfortable doing it rations will be offering the real deal new bull special all summer law so don't wait to get that ball bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the coast of bulls are motivations today\nAt seven nine seven zero one six eight seven nine seven\nYear old wants to say for on Facebook or GMC pools dot com CEO see cost them pools or whether they should simply the right choice\n[noise]\nIf you haven't been to the new diamond backs Shooting Sports you should get their ceiling they've they've devoted Tucson favor gun shop three years in a row and have an even bigger and better selection than before more firearm more personal protection items and more accessories if you have a special the item they don't carry and stop make yet it ordered and get it to you fat\nDiamond backs shootings court is one of the few classically dealers in town where you can get depressed or they have on site that's nothing including Sarah coding\nFor your personal protection nice pepper spray and pay their diamond backs Shooting Sports offers classes on everything you need to know about them safety at handling and they can help you get your C. C. W. permit\nDiamond backs shooting sport though to Tucson favorite God's dorm\nThirty is Broadway near the corner of Broadway and coal open every day an online ad in the back Shooting Sports dot com [noise]\nOr new shoe southern Arizona in mid term election destination station it one ... one K. juicy age age the age of ...\nA B C\nIt's where he evacuated initially to the county up bill fire station\nNo serious injuries reported it won't happen but a United Nations court has ordered the U.S to lift sanctions on Iran that are linked to a humanitarian goods and civil aviation the bureau of Alcohol Tobacco and firearms says most of the cache of around four hundred handguns stolen in Tennessee or recovered in the Chicago area of the ATF\nConfirming hundreds of guns taken from a UPS distribution center in Memphis, Tennessee had been recovered in mid loyalty in Illinois they have one suspect in custody they're still looking for twenty four year old suspect role in Jackson of Chicago the ATF is offering up a five thousand dollar reward for information leading to a conviction ABC's\nRyan borough in Chicago for neo Nazis from California are charged with incitement the rioting last year's rally in Charlottesville, Virginia that turned deadly all four are in custody each facing up to ten years in prison if convicted Toys R us not dead yet\nCourt papers indicate that the funk toy store chain is stop this bankruptcy action and put forth a reorganization plan to revive the toys R Us and babies are us names you're listening to ABC News\nOr you more than ten thousand dollars in debt feel like you're on a never ending treadmill staying in one place and never getting ahead with those minimum payments you feel like there's no\nWay out don't let the credit card companies bully you any more there are programs in place to help you get free of your debt\nAnd you don't have to pay the entire amount you owe the program at total financial freedom can help you get dead free and months instead of decades get off the debt treadmill and stop the harassment get free of credit card debt signature loan department store cards Internet loans and medical bills call now at eight six six eight four four Seventy three\nForty four for free information for about ten years total financial freedom has helped\nThousands they're a plus rated by the better Business Bureau to get off the endless cycle without having to declare bankruptcy you'll have the right to settle your debt from near a fraction of what you owe called total financial now\nAt eight six six eight four four Seventy three forty four\nThat's eight six six eight four four Seventy three forty four [noise]\nWe're going we're all just kind of ... we look ahead a little bit we're going to see some really nice fall\nWeather to round out the week was hides in the mid to upper eighties overnight lows dropping into the load of mid sixties but then this weekend that's when things start to change again the first significant\nCold front of the season will sweep through the area and drop our temperatures ended the seventies by Sunday and Monday only been drop a few rain showers snow levels could drop down to eight thousand feet ... nine whether any time a kid got nine dot com [laughter]\nMars Larson show ... nice it's amazing but the Democrats think their bad behavior on Capitol Hill is actually going to win the votes in November it kind of seems crazy to me at all the bad behavior you've seen on Capitol Hill\nDuring the hearings for which one purpose to set out approved and either confirmed Brett Kavanaugh to the U.S Supreme Court or disapprove his nomination\nNow the Democrats are still talking about is gathering petition signatures for a petition they would say that Brett\nKavanaugh cannot be approved and yet all the smartest political folks I have it I was going to be approved and the Democrats know is they're just doing this for show as though with all of the crazy left these who have been nominated as democratic candidates some of the Democratic party comes out ahead gifts they can behave\nIn the craziest way during these here and I don't think it's going to work for them but hey\nLet 'em do as much as they want I think it works best\nFor us so Lars Larson show that an attack on winning for wind taking the AIDS Tucson news and talk to combat in the bottom of the hour\nSaid connected uninformed anytime at one of four one K. cute ph dot com they Wildcats welcome the California golden bears to Arizona\nConnected uninformed anytime at one of four one K. cute ph dot com\nThey Wildcats welcome the California golden bears to Arizona Stadium this weekend listen to the Joe ... show four to seven for your chance to win a poor packet tickets to the game you know one of four one K. cue G H in the fight against\nBreast cancer ... real man by wearing pink during the making strides against\nBreast cancer walk on Sunday October twenty first then armory park you can't walk donate details at one of four one K. U. T. H. dot com this month's give local\nTucson partner is handy dogs dedicated to helping older adults and people with disabilities and improve the quality of life through the specialized training dogs they're looking for volunteer foster homes breeders and donations Forty Tales one for one cake UGA Chuck ... joins us on the morning news at six and seven\nAM for the first Fifteen everything you need to know about what's going on in this great big world of our state of Arizona and the old\nOne oh four one K. cutie H. two sons news and talk\nAbout and what I Want one K. K. P. A. dot com\nLars Larson show wing nice I'll confess I talk on the phone quite a lot when I'm driving is but I use my cell legally with a hands free device now a new law promises harsh punishments for those who drive and he calls illegally first offensive thousand bucks three strikes gets just six months in jail I understand we're trying to save lives\nBut is there an irony in a region were otherwise law abiding folks faced odd kind of penalty when more serious criminals get a pass to\nLars Larson show on one in four one K. can th Tucson news and talk\n\n[noise]\n\nIndependent in thought as punk rock in life or death and shell\nHere's my observation unless we're\nWe are in a zero sum game it's like\nThe flip a coin I flip the coin hands I win tails you lose or you flip the coin and it's you know you got ahead you win and I lose you can't run politics you can't run wife in a zero game environment\nAnd so it's like when you were in that environment all the tactics are permitted you can say anything about anybody you can 'cause it's all about me winning you losing we can't live our lives that way absolutely true\nWisdom from today's pop pastor John Case we\nCan't live in the world like that tribalism is insane the way that it's gotten in part of his because we give a voice to people\nNow in a way to get their anger out right we that that that movie the purge that came out a couple of years ago and it spawned several uh you know sequels since then where people can go out and have their night of crime in anything is legal from\nLike six PM to six am anything is legal murder you just can't burger certain people politicians and stuff like that outside of that you can murder rape do anything you want to do it's all legal\nAnd we'd given people a voice now\nWhere they can be a ... that's when I you know I posted something today about on a\nA a fake trailer about how they made him to be the bogeyman or Kavanaugh\nAnd you know ... everything it's not just he he he's a rapist potentially serial rapists but not really but we're going to make you think he's that he's also going to kill polar bears and he's going to do this that and the other and\nIt's it's crazy that we've gotten to this point so it gives people outlets and go on and they could just say whatever they want to say that gets it out there but we've gotten to the point where it's us versus them and that's something that we have to take a deep breath\nRight that's the way they tried to find common ground so people say they hate me hey if it makes them feel better to say that you hate me\nI'm okay with that right I I'm okay I don't care if they you know it there's\nSome feel a little better to say that you hate me I'm okay with that right I I'm okay I don't care if they you know there's five or six seven people in the world that\nThat I'm close with as far as people that are in my in my group right you know the kids and in my family on my mom and then we know we're not a close people now I Love them I'm just messed me but it didn't you know there's a closeness of of of my relationships and and things ... that I keep on the down low\nI care about their thought right outside of that\nYou know it's it's that I care about both sides of the the the listeners and everything and I'm okay with that but what if if we get to the point where the only reaction we have the somebody's\nI hate you and you don't know anything about me you know anything about me\nThat I'm a father right\nThat I ... that I'm a brother that I'm a big uncle that I'm a but I Do all these things oh you know is you don't agree with something I said\nBut the deep sleep was like five hours and Twenty one minutes and it's funny because I was in a hotel because he was I mean I'm sleeping and I didn't even move it was like literally I didn't move an inch\nAnd it was great that is what my pillow does for me I think might might go anywhere pillow everywhere I travel you need to get in my ... it's going to help you with everything you do at the aspects\nOf waking up in the morning no you're fresh you feel like you can take on the world heart health yeah big time blood pressure that's what sleep does for you what are you waiting for a hundred percent machine washable and tribal made in the usa backed by a ten year warranty here it is backed by popular demands about go buy one get one free\nCollate honored nine four four forty nine Seventy five or go to my pillow dot com use the promo code ... B. E. N. as though and get to my pillows for the price of one better night's rest world's most comfortable ... you're going to absolutely love it because my pillow dot com ... an eight hundred nine four four\nForty nine Seventy five promoted spent an adjunct method shows your Twitter C. J. D. P. E. N. S. so and it's ...\nThe last few years they've been riots over the alleged victimization of young black men by police\nThe fact is that most of the young guys who had these fatal encounters were victims long before they victimize or however was not the criminal justice system\nIs is bishop eat up all your Jackson president of stand staying true to America's national destiny consider these statistics fabulous homes produced sixty three percent of use suicide Seventy one percent of high school dropouts\nAnd Seventy five percent of all adolescent drug treatment patients in fact\nYoung men from five hundred times are twenty times more likely to end up in prison than men who grow up with a dad Seventy two percent of black children are born out of wedlock before any confrontation with a police officer most of these young men are victims on their fathers abandon and sometimes not knowing who their fathers are\nIf we want to keep black men out of prison we must be thinking about ways to rebuild the black family and restoring men to the important role of fatherhood\n[laughter] Lars Larson show when night track the hypocrisy of government in Portland you want to camp on public property no problem\nDecades in doorways same thing what about street protests even the ... the leaves storefront windows broken and piles of things on fire but let's say you're a federal law enforcement agency in this case a whole different set of rules apply\nThe ice agency that enforces immigration law runs an office in southwest Portland protesters shut down the office for a week not long ago city hall did nothing in fact they told police officers hands off\nIce then put a foot fence to keep the hooligans out now the city is cited eyes for violating the French rules and city council member closure you daily even ask the city attorney if the city can revoke ... ice operates in a tweet you says unfortunately we can't\nIt's indefinite unless there's a violation but this setback\nWill nonstop abolish ice momentum\nSo Lars Larson show having to park and went out for a while and taking the AIDS Tucson news and talk [laughter]\nThe Lars Larson show white nights liberals usually revere decisions from the United States Supreme court and often refer to those\nDecisions as the laws the lines of quarters delivered so many changes to the law the liberals find impossible to get through Congress with the state legislature lately not\nSo much in June the high court made it illegal for governments to take union dues from workers unless they hopped in as a union member only attorney general Ellen Rosen blondes just lifted a big middle legal fingers to the Supreme Court in a lot or a month ago announced that Oregon will keep on taking union dues out of the pay checks of state workers\nIt lifted up big metal legal finger to the Supreme Court in a lot or a month ago announced that Oregon will keep on taking union dues out of the patriarchs of state workers until the worker opt out she also cautions that the union sets the rules in the windows of time\nWhen members even allowed to quit the union so the liberty Justice Center just sent a cease and desist letter new Mueller should pummeled governor Kate Brown with this reminding voters that brown loves the Supreme Court when it comes to gay marriage and abortion but thinks the court can be ignored when it comes to worker\nRights Lars Larson show that an attack on one for one taking the age Tucson news and talk [laughter] Lars Larson show when night\nIf you think the Supreme Court always calls it writes let me remind you of some real bone headed decisions in Dred Scott decision ... once decided black people were not real citizens in buck versus bell which supported the forced sterilization of folks would low IQ's\nAs the great Oliver Wendell Holmes once put it those who are on fit cannot continue their kind Korematsu allowed lock you up in ... America these with Japanese ancestry plus ... versus Ferguson upheld separate but equal laws an segregation all of those were some law and that's not the whole list\nAnd all of the word dumb on steroids someday I Hope my now two year old granddaughter last me grandad did they really wants to lead a mommy killer baby just because it was convenient and alter the row long ago joined the list of dumb decisions by those men and women and\nBlack rope so large large and show that an attack on went on for one taking the age Tucson news and talk show Laura Ingraham shell midday what was the\nPaul Ryan said Paul Ryan the terrorists don't work okay Lauren still saying that today\nI just don't think the ... is this one way to go by understand the president's plan I understand what he's trying to do an interest in in the goal he's trying to achieve is a good one a better deal for Americans better trade agreements I just don't think tariffs are the way to go and our members are making that that pretty clear\nFirst of all Paul Ryan is supposed to be the guy who's all into tech\nThere the next generation of Republican they know the world the new intellectual property chapter of the nap to sixty three pages and contains more stringent protections for patents trademarks biotech financial services and even domain names many business leaders\nAnd legal experts believe these updates were necessary given the original agreement was negotiated a quarter century ago way before we had any concerns about any of\nThe lore and grim show one to four oh one oh four one K. U. P. H. Tucson news and talk\n[laughter]\nWelcome\nThey were invited\nAs they get to Senator Dianne Feinstein could be there at the hearing why was it important for you to be there\n[noise] so many reasons but uh I think most of all I'd I don't believe that that any man a ... should take precedence over a a survivor of humanity\nI've no idea like that so it's a mulatto I Know and she's so but this is that that thing we we we build something up on our mind right so\nHe's he's ... he's evil and and and the the\nIssue take politics look at where we are now rich versus poor black versus white\nRight man versus woman because conflict is it\nRight man versus woman because conflict is at least interesting\nThat's what the media plays on can conflict be interesting can I get you to fight sports is a perfect example\nBut the one thing about sports but I think changes is that for all intents and purposes after the game they bust harassed and they know there's a winner and loser and after the game they can shake hands and and move on\n\nWhat is happening in politics is you get somebody who like Melissa mulatto who is still smoking hot by the way but okay ah who [laughter] Chad your jerk can I say that was that like was that the massage innocent patriarchy whatever\nBut she can have the passion for the things that she has a passion for I have no problem with that it's the he's an evil bad person because these people say he's an evil by a person because he was going to do this this and this and we never look at the other side and will say this this this this they believe in that\nSo but no it's just he's evil he's bad he's a white man he's a rapist he's massaging as Dick and it's it's ... that's that's not a win for anybody it's not a wind and when you get to the point where the passion is clouded being able to say anything\nRight ... ... to to actually have a conversation with somebody because they're so angry that you may not\nBelieve what they believe that doesn't it that the any of us any good I don't see those cells not\nSad very sad three two three five three twenty four twenty three ... and show your short Twitter Amazon did they get ahead of Bernie Sanders very interesting and what they announced today and to not one but two kids playing football passed\nAway talked about it yesterday I think sooner rather than later high school [noise] other football places are going to start banning it and they're going to change everything altogether if they're just saved the sport ...\n[noise]\n\n... Benson show [noise]\n\nDid you know you can vote with your dollars by switching to patriot mobile patriot mobile is so much more than just a cell phone company they stand up against the crazy liberal agenda every day by donating to conservative causes patriot mobile provides nationwide reliable service with unlimited talking tax for less money and no hidden fees\nRather than say I don't like what you were there I think it's I think it's BS and I'll say well I think it's satire and it's funny and if I did it to the other side you'd be fine with it\n\nI thought one person day really 'cause I have a Trump and I've done ... about him and I never hear you say anything\nAnd she said well he deserves there you go\nThere you he deserves so as long as it's your side that has the the the the opportunity to make fun of the other side you're okay with\nWhenever I get something like that I always telling me how do you handle and like if you were you you weren't with a pride non or if you're that pays the my if I made you that upset about something usually it's because\nI have said something that has\nMade you think ... maybe he's right and so what that does that attacks that attack your belief system which automatically attack you and you believe automatically oh my God he's a horrible human being a this is who I Am it's not who you are you're just\nWhoever you are your purse no different than me your your quote unquote red and blue belief system is not one hundred percent of what it's it's a portion of what you are that's it period case closed\nThis morning or Georgia community is heartbroken half of the sudden death of Seventeen year old linebacker doing Thomas who love everybody have I Love her teammate gabbing Duncan was on the field friday when his friend had to be held to the sideline in the third quarter\nDid you know how serious it was or from off the field and the guy when he got\nFriday when his friend had to be helped to the sideline in the third quarter\nDid you know how serious it was or off from work off the field I thought it would be okay\nWhen he got the man or to complain and he couldn't play hoping\nThat he might have been hurt yeah absolutely horrible so here's the kid doesn't routine play\nAh we hear about these and with football in the position it's in right now with with the head in the concussions I'll tell you guys it's it's it's scary it is absolutely scary jak a couple of weeks ago my son a whopping eight years old\nOr was playing P. E. basketball\nAnd hit his head really bad\nHe had to come on that day he had to go to the doctors at night he just went back to school yesterday and they are going to do more tests on friday a ... and and he has had headaches and all kinds of stuff it is scary and if you play sports long enough\nYou're going to experience something that is not ... it's not and this was one of those things where I can I get hit goes to the sideline starts to lose feelings in his extremities and then it just goes downhill from there\nOfficials at pike county high school say doing suffered a brain injury but coach brand Weber says at the time nothing see none of the ordinary until doing became incoherent\nWas saying that you know he wasn't feeling right and that's where we're\nPretty much\nCan you imagine that now I have been in a horrible situation like this or with a kid I coach club soccer within his first highschool soccer game uh he was killed\nWent up for had her on a throw in the knock us play and smashed in somebody smashing at the back of him and he died centrally instantly\nAnd what they said was his neck broke and severed away from the skull it's horrible and it and and the doctors and everybody said if they did a thousand ... billion times can never happen again the way it did and on top of that\nIf it happened in the hospital they still couldn't save\nAnd people look at sports and football's one of those things because of the concussions because of the violence this isn't one of those things were a kid overheated and we saw that this year with the Maryland football player who essentially had a heat stroke that end up causing this was this this is a brain injury and that is what people are afraid of\nIt was an emotional we can not just in Georgia but also in Nashville where another young football players in critical condition after collapsing Saturday during a college game ... be a sophomore tendency said had also walked off the field wall playing Vanderbilt selling trainers yet a headache minutes later he collapsed\nYeah it is it is it is is crazy but when I was told many keeping in perspective right like we look at the football players and we say this is awful this is horrible\nBut people go out and they go in the woods and I get attacked by bears and they go into the ocean and we saw over the weekend a little boy and asking you know was attacked by a shark\nIt's not we think it's happening all the time at the long term ramifications of of of football is is a bigger worry than these things but again it's ... every time you do something like that\nYou put yourself at risk but nowhere near the risk just driving to the damn game\nThat's on the football field or rare last year the four million young people who played organized football Thirteen died from the sport four of them were from direct causes like head trauma the other nine from indirect causes like heat stroke\nSea so if you think about four million people\nDirect causes like head trauma the other nine from indirect cause like heat stroke\nSea so if you think about four million people in Thirteen died while that's awful than horrible that any of them died the reality is it's so small comparatively to other things how many people today will will will you know on their way to work today they thought it was kind of a normal day at work and aren't going to get home\nLast week the CDC came out something that we completely under the radar\nWrite something we completely under the radar that wasn't talked about and that was my bed I wanted to get to it eighty thousand people die a year from the flu eighty and not all of them are very young and very old there's a lot of healthy people in the middle that ended up dying from the flu because they let it go too long it gets worse they think they can eighty thousand people\nPut that in perspective to do something like this plus there's always the we never know what if when it comes to somebody\nIs really hard hearted kids who are\nBack in Georgia do and Thomas had known prior medical conditions the shock is still sinking in today he died when he loves to do [noise] rarely people get that oil is\nNow now it's awful but I always say we have to put it in perspective like I say I'm more worried about the long term with the head injuries and what potentially that causes\nBut still something to talk about absolutely three two three five three twenty four twenty three and she had been some shows your Twitter you can tweet at us and I and I ... I said yesterday like you know my son you just wants to play tackle football\nAnd I will ... will now when he gets older adults revisited when he gets older and you know there's a there's a game that they are trying to spread right now cold fusion which is a form of tackle ish football with a little bit harder to pull tags and there's blocking\nAnd things of that nature but it's there's no tackling per se I mean every once in a while you are going to fall over and things like that but um and Jews jak knocked himself out playing basketball for God's sakes be\n... it's just they've got to look at different ways of going about doing these things because we understand it and when you get to college and when you get to the point where you're in the NFL you know if I'm the NFL I just step away from the whole concussion\nLook these are grown as men All right they get it they understand the risk at this point in time they get it we're not putting a gun to their heads saying they have to be here they understand it and the risk reward is they're getting paid lots of money\nBut they understand what the risk is the guy twenty Thirty years ago they didn't because we hit from them we didn't tell them things just like people who smoke today forty years ago you smoke you you didn't know what it was because they were lying about it now just be a problem with it say they understand the risk\nWhen you're a kid\nYou got to hold back you do three two three five three twenty four twenty three at you had mentioned shows your Twitter a Mac hey you fifty and older you're somebody romance race a chat I really want to join a Mac but there's no way you get forty percent off\nSeaWorld legal and Six Flags Disneyland is and we're like yeah\nThat's just name a few right there's no it doesn't it yeah forty was a movie tickets on top of the fact that they're going to go out there and they're going to advocate on your behalf are all kinds of things like common sense immigration is Social Security or foreign things like that\nYou get these benefits and it's free to join\nOne year membership absolutely free that's it oh you have to do is be fifty year old discounts on retail restaurant hotel bookings so many other things and yet the forty percent off the theme parks in the movie tickets it's incredible then what your credit card\nSign up your free all you have to do is go to a Mac dot us forward slash Chad that's a Mac dot us forward slash chatter called eight eight eight three five five\nThat got us sports last chat that's a Mac dot US sports last chatter called eight eight eight three five five sixteen sixty eight eight eight eight\nThree five five sixteen sixty eight am a C. dot U. S. sports last yet ... method shows your Twitter C. J. D. P. N. as to why we got to useless facts of the day straight edge that meant that you\nEver wonder why Europeans seem to speak so many languages maybe it's because they used battle the number one selling language learning habanero dabbles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad at languages but after using battle I can tell you I was just taught the wrong way using battles ten to Fifteen minute lesson you can be speaking confidently and your new language within weeks I was amazed that I could start having real life conversations right away with so fast now I'm speaking Spanish\nCan tell you if you could save some cash each month they've helped thousands upon thousands of my listeners keep more cash in their pockets through a smarter mortgage\nI Want you to call Churchill for your check up and see if you can lower your monthly payment or better yet she how you can pay off your house early\nCash each month they've helped thousands upon thousands of my listeners keep more cash in their pockets through smarter mortgage\nI Want you to call Churchill for your check up and see if you can lower your monthly payment or better yet she how you can pay off your house early\nThink about it what could you do with your money if you didn't have a mortgage called Churchill a AAA alone two hundred AAA alone two hundred or visit Churchill mortgage dot com for your Churchill checkup that's AAA loan two hundred or Churchill mortgage dot com\nBusiness paid advertisements and email us id won five nine one ... consumer access dot org equal housing lender seven sixty one old hickory boulevard Brentwood, Tennessee three seven zero to seven\nPeople by first lady of talk radio and most influential\nWoman in radio Laurie anger shall starts next on one of the ... the ha ha ha duty aches juice on\nABC News\nI'm Scott over the White House says President Trump was just dating the facts and not mocking Brett Kavanaugh accuser Christine Blasey Ford when the president said this about her at a rally last night\nOne well do you think it was you know there was one of them are good how did you get home I don't remember\nWhite House press secretary Sarah Sanders\nPresident was dating the facts are frankly facts that were included in special prosecutor Rachel Mitchell's report he was stating facts that were given during Dr Ford testimony\nSenate majority leader Mitch McConnell says the vote to confirm Kavanaugh is still on for this week is the FBI investigation into sexual assault claims continues\nSenate Democrats won a briefing on the FBI latest investigation into Supreme Court nominee Brett Kavanaugh Republican Senate leader Mitch McConnell says Democrats are just wanting to lay a boat and accused Democrats of dragging Kavanaugh was named through the mud\nA literal mudslides mudslide awhile uncorroborated accusations has literally poured out democratic\nSenate leader Chuck Schumer says lawmakers have no idea who FBI agents are interviewing as part of this investigation\nABC Stephanie Ramos the White House also dismissed the New York times report detailing years of alleged financial fraud committed by the president and his father Sanders called the claims totally false attacks tax officials in New York are looking into the allegations\nSex assault to the topic of a Senate hearing on Capitol Hill this our heads of U.S Olympic sports are discussing ways to prevent the abuse of athletes they'll Andrews the c._e._o. of USA Weightlifting says he's doing away with new way and cannot be done within a single it therefore they closed\nThe heads of USA Swimming in figure skating also or their cell phones around the country buzzed a couple of hours ago the first test of the presidential alert system it was to see a famous nationwide emergency alert system would work in a real emergency\nAt the clothes on Wall street the Dow is up fifty five points as acts up twenty five you're listening to ABC News\nThings you find the latest coverage online anytime one oh four one K. Q. V. H. dot com the fuse on news and saw\nTooth on meals on what oh four one K. U. P. H. lucky we weren't directly in the path of tropical storm Rosa remnants of Rosa ... metro Phoenix hard with lots of flash flooding also impacted Utah elsewhere\nOne of the biggest names in the business just made a big announcement Amazon says effective next month it's raising is minimum wage to Fifteen dollars for all employees that could have a broader effect on Tucson\nAs folk tried to leave their current jobs to get that money at the new Tucson fulfillment center son Tran has new ride around town the size of a whale it's a sixty foot articulated buses little serve\nSouth sixth avenue service starts today and safe kids Pima County and FedEx or joining forces to promote safe walking on international\nThe avenue service starts today and safe kids Pima County and FedEx or joining forces to promote safe walking on international walk to school day the organizations will join with students from Whitmore elementary\nTo teach them safe walking tips as election day approaches advocates wrapping up for a local effort to educate felons about their voting rights the group or store your vote was the town yesterday spending that message I my ... one of one kick you G H your mid term election destination station [noise]\nI mean you're only getting a problematic than clown will continue to clear to partly cloudy throughout\nThe day we're going to hit the upper eighties those today and tomorrow near Ninety even through Thursday with mostly sunny guy then drying out we start to cool off as we approach the weekend and we're already tracking our next systems which should come in late into the weekend in early next week dropping tents down to the seventies and even bringing another chance for rain\nCheck first warning letter anytime that Kagan\nComing into the hot summer months here in Tucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old bull updated revenue pool installed\nThough way called GMC Costa pools or what of Asians today remember seeing the world sent a salesman to your home and see what's in their hands on experience project manager\nTo give you your free no obligation quote hand guide you through the entire construction process\nGMC customer pools renovations will be offering the real deal new pool special all summer long so don't wait to get that ball bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the cost of bulls renovations today\nAt seven nine seven zero one six eight seven Ninety seven zero was six eight\nFour on Facebook or the emcee fools dot com the a C custom pools are automation simply the right choice\nKiki th wonderful one K. cutie ages two sons mid term election destination station we want you to know about the propositions coming up on the November ballot\nAmong them Arizona proposition one twenty seven it's the renewable energy standards initiative a yes vote would require electric utilities that fell electricity in Arizona to acquire electricity from a certain percentage of renewable resources each year more details on proposition one twenty seven ad others go to one in four one K. U. T. H. dot com\nFor what it's worth I'm Sherry pressed and what would you do if it was you pizza delivery guy and won't do Wisconsin ring the doorbell enhance a pizza to the man who answers the door and\nHonestly kind of friendly and then I noticed when I was a woman I'm In the\nAt one point point or black guy as that I could see on her right I called the words helped me to me\nJust ... one short then he said that right so until we saw it again\nPart she pointed or black guy and then mount helped me\nThen it was maybe thirty seconds later the miles again call the police and that was just as I was about to leave\nSo he went to his car and called nine one one\nI happened to me if I'm right place at the right time it\nTurns out the woman was being held against her will buy an abusive ex boyfriend she got out safely\nAs for ... he's been called a hero but he doesn't see it that way\nI Would think that most people in my situation\nHad they've seen that would have dial nine one one\nSo what would you do if it was you for what it's worth cherry precedent anything at all the more you want to\nHold on UPA dot com I might grab next time I Do sons morning news another round of reforms to the U.S tax code tax cuts to point out with Martha McSally at seven forty eight on one oh four one K. U. T. H.\n\nIt's just the right person to sit on the highest court in the land for a life\nTime appointment alternatively not whether he's innocent or guilty this is not a trial the ultimately has no questions being raised that we should not move on to another candidate because ultimately the Supreme Court has not entitlements\nJust because he went to jail or prison in your class doesn't entitle you to the Supreme Court\nMy whole life I version of Joe proven guilty but now you're guilty until proven innocent that is a very very difficult to say\nListening to the lawyer Ingrid show eight five five forty Laura I'm there's a lot going on new information\nOn a this is Kevin ... or the president last night was just phenomenal uh he he's getting attacked for criticizing without mentioning or by name I don't think you mentioned by name but Christine Ford\nWhen he's going through thirty six years ago this young man\nI had one beer [noise] right I Am wondering\nWell is it goes you know it was one of them are good how did you get home I Do remember how'd you get there don't remember where is the place I don't remember how many years ago was when I don't\nKnow I don't know\nWhat neighborhood was it and I don't know where's the house upstairs downstairs where was I don't know but I had one beer that's the only thing a rumor\nLet me say that Donald Trump and we cut out the applause there but Donald Trump is a better closer than anyone in the Republican Party\nHe's a better closer he put things in stark terms do you what the future to be China's or America\nDo you want to continue to have sixty billion dollar trade deficit to deficits would Mexico I don't here's why not here's why this hurts America manufacturing a country needs borders the country doesn't have borders you not a country at all\nThese are very specific very specific\nA ways of looking at the world would issue after issue and he gets down right down to the point and last night at this rally in Mississippi Trump did it again we\nBetter start as a country getting smart and getting and not letting that has the right track there all those cameras\n\n\n\nYou guys heard me talk about a product for months that has changed my sleeping habits for ever it's called my pillow\nGuys I used to wake up with a sore head I often have one of those critics in my neck you know that's like you can't turn your head one way in your neck hurt forget about it I don't have\nThat anymore I didn't believe that my pillow was going to be so great until I tried it and guess what I tried it and I love it go to my pillow dot com click on that four pack special and type in the ... code Laura you get fifty percent off\nA four pack a pillow sets to premium my pillows and to go anywhere pillows my pillow was a hundred percent machine washable and tribal and comes to the ten year warranty and a six day money back guarantee you have nothing to lose to get fifty percent off at Fort pack a pillows go to my pillow dot com and click on that radio listener special or called eight hundred\nThree eight five fifty one sixty four and use the ... code Laurie get fifty percent off to my pillow premium pillows and to go anywhere pillows called eight hundred three eight five fifty one sixty four or go to my pillow dot com use that ...\nYou a stocker options trigger looking for real training strategies that you can use immediately [noise] Hi my name is Scott ... your process for training academy and I'm On a mission to become the number one options coach in America\nI'm a former vice president of Goldman Sachs I over twenty five years of options breathing experience and right now I'm giving away my most famous options guy was over twenty unique out some strategies that use every\nDay for free you can find this guy anywhere to claim your free options training guide simply call eight five five eight four four nine seven zero to now in mentioned my name's Scott sour and we were rushed to the guy\nCalled eight five five eight four four nine seven zero to and someone from my options seem will help you get this guy didn't hearing loss as quickly as possible quality five five eight\nFour nine seven zero to and someone from my options seem will help you get this guy in your inbox as quickly as possible quality five five eight four core nine seven zero to now and start learning to trade the right way that we call it five five a poor poor nine seven zero to prosper with options Dr\n... financial risk and is not suitable for all investors\nFrom NBC News tech trends are older iPhones handling the latest version of by OS update to Apple's mobile\nOperating system which described by many as being buggy especially by user to install the update on older phones some it's had those updates actually made their phone perform in consistently and that it shorten battery life\nThis time apple didn't make a point of saying that the new version of Iowa Iowa twelve can actually possibly improve performance on older devices and we decided to test that claim\nSeeing the woman is editor in chief of the tech blog and gadget one of the reviewers installed the newest operating system on an iPhone success\nDeep you found the foreman was nice it felt good compared to other releases where indeed um it's telling that new software really does take a toll it really does just bog everything down for the sake of adding new features\nAnd ... says you could see enough of an improvement to keep you happy with your older phone for at least another year or two with tech trends I'm Sherry Preston ABC\nComing into the hot summer months here in Tucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old blow up to the revenue pool installed\nDo weight goal GMC Costa pools are motivation today remember seeing the world sent a salesman a two year old DNC will set a hands on experience project manager\nTo give you your free no obligation quote and guide you through the entire construction process\nDMC comfortable doing it rations will be offering the real deal new bull special all summer law so don't wait to get that ball bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called GMC comfortable or motivations today\nThat summer night seven zero one six eight seven nine seven zero was six eight or on Facebook or GMC pools dot com fiancee cost them pools or whether they should simply the right choice\nNine nine nine four one K. Judy H Tucson news and talk\nMid term election destination station\nCoverage on line to any time at one point one K. U. T. H. dot com [noise]\n\nCall Laura now one eight by by forty Laura [noise]\n[noise]\n[noise]\nI Believe that by virtue of\nTemperament and fitness for office was demonstrated so rapidly\nIn that last year and when he threatened\nAnd came to us or bend our against an acrimony that this man\nShould not be on the Supreme Court\nI think he was fighting the will make you very tough charges against them and I thought he did very well\nHe's fighting very hard for his reputation for his family I don't know what happened was really\nListening Miller angered show little Kelly will is great song\nAnd let me tell you this ah this situation with Blumenthal [noise] from Connecticut what he\nMy son was Blumenthal [noise] from Connecticut what he\nHas a nerve to speak\nAbout [noise]\nHow people's um words\nShould be used against them against them given his past of a ...\nLook at Blumenthal he lied about Vietnam he didn't just say hey I went to Vietnam no no for Fifteen Years you said he was a war hero he fought in Da Nang province we call him dying Richard stunning the victim done a he never went to Vietnam\nAnd he's up there saying we need honesty and we need integrity this guy live when he was the attorney general's Connecticut He lied I don't mean\nThen when he got out he actually dropped out of the race that he won anyway because Democrats are always win in Connecticut oh\nMy gosh I was ... laughing watching Trump's last night he was hilarious absolutely hilarious now as they continue to pour over Brett Kavanaugh's notes about beach week\nOr two I'm Kevin ... we we decided that you know we were partying like every other kid in high school most of the kids and you know this is what we did in the eighties people do different stuff now some still do the same stuff but yeah this is this\nIs enough I think a lot of people have seen right through this let's go to I'm Melissa Missouri line one Melissa\nHi I just wanted to say I'm I've been on both sides I've been in in a doctor fourth position and I've been in judge Kevin opposition where um I was attacks there was a molested\nOr in a doctor's office in fact and then um another time a former friend accused me or spread rumors about me that I was sleeping with her husband and I had no way to protect my reputation [noise] um so I Would have believed her if\nShe had come out with Kavanaugh's demeanor and said you creep you did this to me and if he had taken her demeanor and said oh I don't remember I don't remember what I did when I was in high school I Would have really the story but I didn't believe it\nI didn't believe her allegations from the get go just because of the timing of the letter and I want to start a mantra on your show right now Dianne Feinstein must resign\nNah I appreciate it eight five five forty Laura oh let's go to Paul main real quick Paul\n[noise]\nUm I I just wanted to say I think um everyone tries to say so many people said a doctor for ... testimony was credible but that's because it's the polite thing to say it's the politically correct thing to say it's like saying Santa Claus exists\nI I think anybody that looks at her testimony objectively would say it wasn't credible and Mr Trump President Trump is willing to hope that balloon of the social why he's willing to say no Santa Claus doesnt exist we need to grow up\nAnd and I I just I I think that's you know I think that's what he's trying to do here\nI appreciate it a five five forty Laura uh this is going to go down as one of the hardest fought confirmations and Supreme Court history if not the most difficult\nBut in the end I think it's worth it you know why you can't reward people who make false charges you can't reward people who make allegations after the process has gone through with no contemporaneous preparation who have\nFalse charges you can't reward people who make allegations after the process has gone through with no contemporaneous cooperation who have some type of axe to grind can't do it\nAnd same goes with these people showing up in the Senate and cornering people in elevators none of this should be allowed it's a game of intimidation they're playing it we know people who practice emotional extortion a political extortion this is a this is like an emotional terrorism\nSo conservatives need not apply because if you've ever had a beer in high school and never partied too hard you can't you can't ever work again apparently\nIf you're tired of paying maintenance feats of the time she can't even use you need to call resort relief now\nThat that will get into sort of more about this but this is also very interesting\nIn the accusation letter construction now and that will get into sort of more about this but this is also very interesting uh joining us now centered David Perdue from the great state of Georgia senator how are you\nWell Oregon morning I don't know what the word ... means but I think I'm work 'cause I'm pissed this morning I'll apologize to your listeners going there but this is a sham it's a new low in America this level of character assassination I didn't think we would see again in my lifetime but I'm disgusted with the process this week\nUh the the fact that President Trump comes out yesterday and starts talking about it a and says look this could be your father your brother's son he's getting excoriated and the media or they're saying he he's attacking a victim how did you take it\n[noise] well I agree with the president a hundred percent but you know the war on women law has been perpetrated by the Democrats in this case\nYou know a doctor for whether you know I don't know the woman but she wanted this to be kept confidential and the Democrats exposed it they leaked it and they exposed it intentionally for their own purpose\nBut this is part of a bigger attempt by the Democrats to take this to a new level I mean the paid activists that are around right now or my wife and I were physically accosted at a public airport on Monday This week because of this these people were paid by the center of public democracy\nOr they get money from the open society foundation which is George Soros who is putting and listen to this more than thirty two billion billion dollars into this effort over the last couple of years this is a bigger issue and it's not going to go away when we confirm Kavanaugh this week\nNow and I think you're exactly right I think it's time for conservatives to stop playing defense\nAbsolute everyone on their heels all the time like Jeff Flake later this hour in the elevator and then you get rid of the ladies are yelling at me it turns out the woman is a co executive director of of the ... funded group as he said Center for democracy and I think it's time to turn the tables were again sunshine on you who are you people\nWho are working for this organization you are carrying on and I think you can make the argument senator that are in maybe a good lawyer plaintiff lawyer can do this or just go to good litigation attorney could do this this is kind of a\nIt's a cycle Rico deal like these groups are working together to deny other people their rights movement free movement which is guaranteed under our constitution free association\nOr they're ... they're acting in a way to deprive others I I Would say of there are inherent civil rights and totally agree meant to intimidate\nI totally agree but listen to what the senators are doing to incite the crazies in this effort this is senator Cory Booker you just had him on their here's another one\nThis is Corey Booker please get up in the face of some congresspeople representative Maxine Waters they're not going to be able to go to a restaurant go to a gas station go to shop at a department store\nTheir absolute get up and absolutely harass them Nancy Pelosi I don't know why they aren't uprising all over the country I mean it goes on to tell me again while we shouldn't confront Republicans where they eat where they sleep where they work until they stopped being complicit\nThis is outrageous law and it it if it doesn't do anything else to serve the wake us up you're exactly right Democrats had been playing off is for the last hundred years this time for Republicans to stop being a minority party in ... and and grow up in\nEurope and as you don't have to grow up and become a you know stop playing defense this is this is the time right now\nA senator for do ah there's so much a that is happening ... which is positive or in this administration the news has been\nOr in this administration the news has been a ... ... only negative uh because ... that's just where the media are they're not going to that ... I mean we just had this NAFTA deal pass okay a or B or negotiate has to pass the Senate\nEveryone said this couldn't happen they said Trump was a big of a ... a Obama ridiculed them is going to made his way this magical hours I'm going to renegotiate all these deals well you know didn't took actually work to do this like Nineteen months of work\nAnd and you must hear nothing on this huge lower milestone for this administration\nIt's huge but it's part of a as part of what's going on this this economy is growing at twice the rate it did under President Obama we have a new free trade agreement with South Korea were about to have one with Mexico and Canada Europe is talking about zero terrorists we have China paying stepping up and paying attention to us now we have a nuclear\nConversation going on with North Korea to to end up in denuclearization of North Korea this president's agenda is working at all we talk about is what the Democrats want us to talk about that is what you're saying is that we need to be on the off is talking about what's working in his agenda before we get into these elections in a few weeks\nI I can tell you the senator\nNo one's going to want to try to stop me moving in a public street or try to harassment a restaurant\nOkay this is I I Do I tolerate that anyone comes up in my family and my kids they they they better be ready they better be really ready because this is not intimidated\nBy some rich kid who lives at home with his parents and in his free time you know jumps on the move on dot org website to get his marching orders okay like go home to rich parents and and and who pay for your three square meals a day and you're you're\nYou know your your activism on the side I mean I just it just doesn't impress me I'd call these people right after their faces\nLaw that's what we're going to be ... this week and it starts right here in the United states at people who are supporting this\nActively encouraging and signing it we have a state representative that actually was involved in our altercation on Monday a state representative from from Arizona okay of all places here in Washington these are not genuine people\nWho are ... out of Dr Ford or anything else these are paid activists\nWas a George Soros conspiracy and it's time we wake up expose them in stand up and fight for our country because that's what's at stake here\nDo you think we have enough Republican money bags types\nTo counter the effort of style and Soros because they're just pumping tens of millions of dollars in Baltimore into voter registration and two are educating people in these training sessions on how to approach new voters\nUh this is you know they're going to the ... the new a Puerto Rican voters and in Florida and and land on line on them like oh Trump aides you and you had to throw the Republicans out in Georgia you see this\nTight governor's race which is really disturbing to Stacey Abrams ... left wing or Georgia could elect a left wing Stacey Abrams to be governor great state of Georgia\nThis is what you were saying earlier one of the one of the good byproducts of this is I think it's a wake in the Republican base\nA was a little pass it particularly in Georgia maybe this year but I'll tell you this\nUm that race in Georgia has drawn thirty million dollars from a a Mike Bloomberg and ... and two other California investors what they're doing is they're California investors and New York donors are trying to sneak into Georgia instill that governor's race because they believe that's the way to the presidency and twenty twenty to get those electoral votes down there\nAnd it's just not going to happen we're not going to let that happen Laura\nI'm David Perdue a hearing the learning them show\nA Jeff Flake yesterday seemed to kind of ...\nIt's just not going to happen we're not going to let that happen Laura\nI'm David Perdue a hearing the learning them show\nA Jeff Flake yesterday seemed to kind of shift the goalposts a little on Kavanaugh or maybe it was just commenting on his overall demeanor with the committee let's listen\nI was very troubled by the the tone of the of the remarks uh the initial a defense that a judge Kavanaugh gave ... was something I Hope that I Would sound that indignant if I were a if I felt that I was unjustly\nMaligned but then it went on\nAnd the interaction with the members was sharp and partisan and that concerns me\nA year reaction was that concerning to you Kevin ... in the face of the old club it's your\nFloor he did exactly what I Would have expected him to do he was in dignity and he should have been listening to what these guys are saying Chris Coons says if judge Kavanaugh seeking a lifetime appointment to the Supreme Court\nAnd who I think now bears the bears the burden of disapproving these allegations the presumption of innocence has been a trashed in this whole process is not convenient for the Democrat I mean they talk about him being Cory Booker again cause an evil\nOr the other one said a Yale alum said people will die I mean the vernacular here has risen to a level that we haven't seen in decades Laura and it's dangerous Republicans had better not be asleep at this because these people are now mobilized they're funded\nAnd quite frankly this is just the ... the tip of the spear of what their ... activity I actually\nA Center for do in Georgia just going back briefly to this very tight governor's race\nUh what is your sense what are the people need to know I'm again this was this poll by landmark pretty decent polling outfit\nI likely voters hum and it was basically a forty five forty five dead heat or the governorship is very important for so many reasons the state of Georgia a and the growth economic growth and George has been very strong ah but what could a left wing governor due to that growth\nWell here's what they what she's saying she wants a single payer and she wants to all these giveaway programs that would cause a state taxes to be tripled this is the most extreme liberal progressive candidate that Georgia has ever had and she's getting funded by a all these outside donors not donors in Georgia by the way\nAnd so what's happening is all of this conversation about war on women everything else has confused issue Georgia right now is rated the best state in the country in which to do business and she wants to tear that down we have a great Republican candidate Brian Kemp is go to bake a great governor and Republican so they get the vote out we will win that election\nTo give you your free no obligation quote and guide you through the entire construction process\nDMC cost improved renovations will be offering the real deal new bulls special all summer long so don't wait to get that ball bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the cost of bulls renovations today\nAt seven night seven zero one six eight seven Ninety seven zero wants to say for on Facebook or GMC fools dot com fiancee custom pools are automation simply the right choice\nAdvisor to look on the most essential information you know during the first one morning news is one of our one Eighteen P. A. T. V. H. Tucson\nFrom ABC News\nI'm Scott Goldberg the White House says President Trump was not mocking Brett Kavanaugh's accuser Christine Blasey Ford during a rally last night what\nWas it and I don't know\nWhere was I don't know but I had one that's the only thing I remember the White House press secretary Sarah Sanders says the\nPresident was dating the facts\nAbout the comments are not sitting well with a number of senators including Democrat ... Harris of California\nI Can't think of anything more not inappropriate is not it does not descriptive enough it's noon\nThe FBI could wrap up its investigation of sexual assault claims against Kavanaugh as early as today Senate majority leader Mitch McConnell says he still wants to vote on Kavanaugh's confirmation this week this afternoon senators heard from leaders of Olympic sports about how they're working to prevent sex abuse\nHearing comes after a number of sexual harassment and abuse scandals across multiple sport USA Swimming president and C. E. O. Tim ... says ending abuse requires a combined effort from the government us something\nMultiple sports USA Swimming president and C. E. O. Tim ... says ending abuse requires a combined effort from the government U.S Olympic committee and all forty nine governing body\nThere must be a comprehensive approach because anything else will be inadequate and she also\nSays over the past five months the organization's board of directors has expanded a fund for abuse victims and survivors Stephanie Ramos ABC News Washington\nThe Senate has passed the new bill to fight the opioid epidemic it unites dozens of smaller bills to help authorized programs for prevention treatment and recovery the first test of the presidential alerts founded on smartphones across the country today just after two pm eastern it's a new alert system by FEMA on Wall street the Dow gained fifty four points today the\nDow Jones closing at a record high as it neared the twenty seven thousand mark the Dow spend the whole day in the green giving up some gains in the late stages but still ended up fifty four points to close it twenty six thousand eight hundred and twenty eight yes in the meanwhile gain too and then as that gained twenty five\nThat's ABC's mark ... you're listening to ABC News\nComing into the hot summer months here in Tucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old bull updated revenue fool unsolved\nThough way called GMC cost improved renovations today remember seeing the will send a salesman to your home and see what's in their hands on experience project manager\nTo give you your free no obligation quote hand guide you through the entire construction process\nDMC customer pools renovations will be offering the real deal new pool special all summer long so don't wait to get that for Bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the cost of bulls renovations today\nAt seven seven zero one six eight seven Ninety\nSeven zero was six eight four on Facebook or the emcee fools dot com the a C cost them pools are automation simply the right choice\nHospital Tucson meals on what oh four one\nK. cutie age men are facing murder charges after a two year old girl sustain serious injuries while in his carefully say forty two year old George William Robinson who police say was a friend\nWas watching the trial when the incident occurred managed dog suffered second degree burns in the south side mobile home fire last night happen near Drexel and Bonnie around nine PM victim was treated the hospital and FEMA animal care center treated the dog cause under investigation\nAs election day approaches advocates are wrapping up a local ever to educate films about their voting rights the group or store your vote was in downtown Tucson Tuesday spreading the message about two hundred Twenty one thousand people in Arizona can't vote due to criminal conviction restrictions in about six million people across the country and the same boat\nDeadline to register to vote is October night ... has a new ride around town the size of a whale of sixty foot articulated buses little served south sixth avenue service begins today I might wrap inviting you to join me for the first Fifteen at six and seven AM on one of one cake UGA\nHere on a problematic than clown will continue to clear to partly cloudy throughout\nThe day we're going to hit the upper eighties both today and tomorrow near Ninety even through Thursday with mostly sunny skies and drying out\nWe started to cool off as we approach the weekend and we're already tracking our next systems which should come in late into the weekend in early next week dropping tents down to the seventies and even bringing another chance for rain\nCheck first morning weather anytime that Kagan\n[noise]\nYou haven't been to the new diamond backs Shooting Sports you should get their ceiling they've they've devoted Tucson favor gun shot three years in a row and have an even\nComing into the hot summer months here in Tucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old bull updated revenue pool installed\nDon't wait go beyond the cost of pools or what of Asians today remember GNC will send a salesman to your old DNC will say their hands on experience project manager\nTo give you your free no obligation quote and guide you through the entire construction process\nDMC cost improved renovations will be offering the real deal new bull special all summer law so don't wait to get that ball bill call today and make sure your pool is ready for you and your family to enjoy during the hot summer months here in Tucson called the on the coast of bulls renovations today\nAt seven nine seven zero one six eight seven nine seven\nZero wants to say for on Facebook or GMC pools dot com the a C custom pools are automation simply the right choice\n[noise]\nIf you haven't been to the new diamond backs Shooting Sports you should get their soon they've been voted Tucson favor gun shot three years in a row and have an even bigger and better selection than before more firearm more personal protection items and more accessories if you have a specialty items they don't carry and stop making get it ordered and get it to you fat\nDiamond backs Shooting Sports is one of the new class three dealers in town where you can get depressed or they have on site that's missing including Sarah coding\nFor your personal protection nice pepper spray and tasers diamond backs Shooting Sports operas classes on everything you need to know about that safety at handling and they can help you get your C. C. W. permit\nDiamond backs shooting sport though to Tucson favorite God's Jordan\nSeventy thirty is Broadway near the corner of Broadway and coal open every day and online I D backs shootings board dot com [noise]\nDot com I might grab next time I Do sons morning news another round of reforms to the U.S tax code tax cuts to point out with Martha McSally at seven forty eight on one oh four one K. UGA\n[noise]\nYour health the\nRadio diction starts now\nLaura Ingraham show [noise]\nHave you ever had discussions with anyone um besides your attorneys on how to take a polygraph\nNever\n[laughter] I was scared of the tests to solve that was ... all of that I could tell the information and it has to address the or whatever it's going to reveal I didn't expect it to be as long as it was going to be so it's a little bit stressful\nBecause you have you ever given chips or advice to somebody who was looking to take a polygraph test\nPaid five five forty Laura McConnell\nSpeaking live about the process will get into the polygraph issue in a moment when\nPeople are around here in the hall\nOr am I one time perfectly clear we will not be intimidated by these people\n\nWith everything they've got that predicted that\nAll the time the various supplemental background investigation for which my democratic friends had climber\nMr President would suddenly become and some fish are\nSuddenly become\nAnd some fish out\nThere no matter what accommodations were made no money that is very insufficient\nSanta Democrats would find more excuse to continue\nMoving the goalpost one more calm\nGranted this Walden exactly a radical production this\nBody on this notion have spent months watching their friends across the aisle graph at every imaginable excuse to delay this process\nOf flying tied spaces claustrophobia\nOr limited exits doesn't want to be coming\nAny fear of flying tight spaces claustrophobia or limited exits doesn't want to become involved however this ex boyfriend but signed a statement\nSworn statement this is this thing is falling apart faster than John Kerry face after bad Botox\nEight five five forty Laura I don't know where that came from All right oh wait a lot to get to another fantastic anger of angle on tap tonight make sure to tune in more details about Ford my question is by the end of it does she ... the whole thing and say it\nDidn't happen I I've I'm under enormous stress and\nI think anything is anything's liable to happen but remember seven hundred thousand dollars was raised for her\nAnd you think we need to know where that money what seven hundred thousand dollars that's some legal bills don't go uh\n\nDid you know any cameras in the room that\n... that computer set up so I guess I seem to have it somehow taping [noise] recording me\nOkay so you assume the who are being video and audio recording correct but you don't know for sure I don't know for sure okay\nThe Laura Ingraham show\n\nThe fun starts to move indoors with friends and family so make sure your most important home improvement project is handled with select blinds dot com interior designers agree that one of the easiest ways to improve rooms appearance is by upgrading your old blind shades and shutters\nSelect lines makes ordering blind on line simple and easy they have high quality easy to install blind shades and shutters you can look at them today on select lines dot com\nSelect wants to take the guesswork out of ordering blinds on line by offering unbelievable deals plus select lines has the most online reviews and five star ratings on the planet\nGo to the website you'll see five star ratings that'll make you smile that's more than a million by the way satisfied customers just go to select lines dot com the simple and smart way to get wants\nTo get these amazing deals on blind shades and shutters shop today it's ... dot com remembered I mentioned the lower income show check out using that dropped on many that's flick blinds dot com upgrade your home today at select lines dot com\nWhen my cardiologist told me I needed to take a stab in Rome to lower my cholesterol he also told me that it can lower my natural levels of ...\n[noise] he told me to take shoot all it has the number one cardiologist recommended form of computer in a very important nutrient for healthy heart healthy blood pressure levels Juno\nWith three times better absorption has the number one cardiologist recommended form of ... to June all the better co Q. ten [noise]\nRenowned medical correspondent and endurance race champion pop are not empty people ask me\nHow you keep competing at the age of Seventeen healthy living is important which so his name if you have paid you can't train\nSo improves I discovered salon ... plus this unique topical pain reliever contains too safe and effective anesthetics nothing has worked better for salon ... plus cream or role\nAt the top and bottom of the hour they connected uninformed any time at ... dot com they Wildcats welcome the Calif\nStand bottom of the hour stay connected uninformed anytime at one of four one K. cute ph dot com\nThey Wildcats welcome the California golden bears to Arizona Stadium this weekend listen to the job bad show four to seven for your chance to win a poor packet tickets to\nThe game you know World War one ... in the\nFight against breast cancer be a real man by wearing tank during the making strides against breast cancer walk on Sunday October twenty first then armory park you can't walk donate details at one of our one cake UGA ...\nThis month to get the local Tucson partner is handy dogs dedicated to helping older adults to people with disabilities and improve the quality of life through the specialized training dogs they're looking for volunteer foster homes breeders and donations more details at one of four one K. G. H. dot com joins us on the morning news at six and seven\nAM for the first Fifteen everything you need to know about what's going on in this great big world of our state of Arizona and the old\nOne oh four one K. cutie aged two sons news and talk about one K. K. P. A.\nComing into the hot summer months here in\nTucson which means this is the perfect time to take care of your pool projects you may have been putting off so if you're looking to get that old bull updated revenue pool installed don't weigh gall to unseat Costa ... today remember GNC won't send a salesman a two year old DNC will send a hands on experience project manager\nGave you your free no obligation quote and guide you through the entire construction process\nDMC cost improved renovations will be offering the real deal new bull special all summer law so don't wait to get that ball bill call today and make sure you're ready for you and your family to enjoy during the hot summer months here in Tucson called the on the cost of bulls are motivations today\nAt seven nine seven zero one six say that's the other night seven zero wants\nTo say or on Facebook or GMC pools dot com GMC custom pools are renovation simply the right choice\nFor your mid term election destination station ... in one oh one K. two ... two sons news and talk [noise]\n\nCall Laura now one eight by by forty Laura\n[noise]\n\nHow about the guy who gives you a little bit of scope and as soon as the rest\n[noise] from what I've heard they have not done and that's a fulltime review that\nI read the main thing she had not sorrow and wanting to\nBe able to find out what she knew about judge Kavanaugh I forwarded that letter to the FBI today I don't think they're doing a thorough investigation that we had hoped that they promised [noise]\n\nMorning show a five five forty Laura [noise] um let's go to\n[noise] about a moment we'll go to a standard ... that's ... bran of course it moving the goalpost I'm sick of that phrase everyone's using it but that is what\nHas been done and it's been done since from the very beginning when there was a vote scheduled for cabinet that Thursday to an ... two weeks ago\nOr they want to move for a reason they wanted more time to find more victims find more cooperation they couldn't find it after all this and after all the interviews they've done that they've they've scoured the country the Yale alumni directory the the prep school at Georgetown Prep alumni directory for anyone\nWho could be a corroborating ...\nThe prep school at Georgetown Prep alumni directory for anyone who could be a corroborating witness to this alleged attack\nConfined it no matter how they try they couldn't find\nSo now it's you know this is game day now this is where the rubber meets the road\nAnd they're exposed for what they are by the way a more information about ah Christine Blasey Ford's friend in Delaware a career FBI agent and likely was with her during the accusation letter construction\nUm this letter was not redacted Ford lived with Monica McLean 'em and during that time her boyfriend said it was my understanding\nThat McLean was interviewing for a job within the FBI and the U.S destroy us attorney's office eyewitness Dr Ford help McLean prepare for the polygraph as I told you before\nExplaining detail what to expect in a polygraph and how polygraphs worked and help McLean become familiar with less and less nervous about the exam Dr Ford was able to help because of her background in\nPsychology [noise] um and he goes on how we flew around the Hawaiian Islands together uh and\nHe ended the relationship once she he discovered that Ford was unfaithful while living in why\nI'm\n... Ford was continuing to charge on their credit card\nOr after they broke up well it's not that big of a deal when confronted Dr ... Ford said she did not use the card but later admitted to the use after he threatened to involve per fraud prevention I didn't speak again to Ford until after two thousand two\nWent forward contacted a her brief him briefly\nUm so\nThere you are you're listening to the lower income show All right uh we have more information more news will get to all your calls coming up congressman Andy Harris was a victim of the left intimidation campaign yesterday will talk about what happened when we come back\n\n\n\nBalance of nature's fruits and veggies in a capsule\nI just wanted to keep you up to date on how things are progressing so I'm getting down from nature every month maybe sometimes twice a month for my friend who\nWell again we're teaching these young people that this this is the normal course of business is just the way you interact you shout you know and for you to someone in their face use use screen at them and say look at me look at me and they did to Jeff Flake or and you prevent their movement\nOr they were blocking the ice officers in Portland not so long ago for weeks and weeks people can even come and go to their workplace without being harassed\nOr you know just it just shouldn't be just shouldn't be allowed and get it that's not how civil discourse occurs in this country or you can you can agree or disagree with with what what ice does but the fact is there a legitimate law enforcement agency if you don't like it\nYou know try to you know it's time to change the law obviously that's what some of these individual doing by tempting to elect people who said\nEither going to abolish ice I disagree with that but again we can have a public discussion but you don't have to get physical you don't have to threaten someone and again it it it uh it's sad when you know when when a member of Congress goes out and says\nUh this is the way you should protest is you know getting people's faces confront them uh it's not civil it's not right it's not the way I was raised and I guess some people are just raised differently in terms of what they think is acceptable and ended up in a free country\nA congressman Harris your thoughts on the overall political climate in America I Know you sit in the house of representatives but given\nWhere this Kavanaugh's confirmation saga has gone with unsubstantiated allegations most all of them are falling apart now of those people are finally coming out and saying well I Know this person she\nHelped to help someone take a polygraph wants clearly lied under oath if that's the case he's a firsthand witness of this or old a hurdle bow um and it seems to me that we have a lot of people with a lot of money\nThe firsthand witness a visceral the robo\nUm and it seems to me that we have a lot of people with a lot of money who are unhappy that Donald Trump became\nPresident and by any means necessary they will attempt to derail his agenda but not with substance with again these types of stunts\nOh oh absolutely Laura ... in the media is the right front and center on this\nI'll tell you uh you know I was ... physician and I watched the testimony and my comment was it was pretty clear that Dr Ford is a troubled person and I think anybody who watched the testimony a comes up throughout the inclusion and she admitted that she has had psychological issues\nI said that in a in a in a interview\nAnd I was accused of saying I said that she couldn't be trusted now\nI didn't say that but that's the that's what the media water to portray they have an agenda and and that's that's what's so different now than for Thirty years ago the agenda is so obvious and so parents\nAre from many numbers with the media the president thank goodness is speaking out against it or you know calling calling it on its face and uh that had that had to be done and of course he gets criticized when he goes out to\nA congressman Harris thank you so much for the update you're listening to the lower angering show eight five five forty Laura we'll get to all your calls in\nA more information on this ah Monica McLean\nI here we go she was a friend of she has a friend of a Ford's a so Ford was in ... beach Delaware on July twenty six twenty Eighteen and her lifelong friend ... Monica McClain who worked as an attorney\nOr for a P. O. Y. which is I'm In the D. OJ and FBI in a robust beach Delaware apparently both of them are there at the same time that she wrote her a letter to Dianne Feinstein\nA Ford and ms McLean her best friend or the best friend she actually coached on lie detector testing were together for the four days leading up to the actual writing of the letter from the twenty sixth of the thirtieth\nIt would appear this is a conservative a tree house it would appear that Ford was with McLean again the retired FBI agent and former former New York field office spokesperson at the time she wrote the letter the Feinstein\nThat would certainly begin to explain quite a bit about who exactly was handling ms forward and how there would be an intentional effort from a subject matter expert on how to best position the attack against Kavanaugh\nWho better to scrub the Internet history and know what process he is and people to enlist in such preparatory work than a retired lawyer who were deeply inside the FBI a lot of people are saying deep state was involved in all this not only did ms McLean possess a particular set of skills to assist system is forward\nBut ms McLean would also have a network of D. O. J. an FBI resources to assist in this endeavor\nA former friendly FBI agent to do the polygraph a network of politically motivated allies\nDoes the appearance of FBI insider and deputy FBI Director uh to Andrew Andrew McCabe Michael Brown which begin now to make more sense\nI think about it remember the lawyer she ultimately got with brown which brown which was as Andy McCabe lawyer Andy McCabe former deputy director the FBI\nAnd we know that ah\nFlight called McCabe before or not\nAnd we know that uh\nWell flight called McCabe before ... the um Rosenstein scares me before they he decided to ask for that extra week and that that that doesn't really bother me because they want to know what you can get done in a week an FBI background\nBut this FBI connection with the woman she was now reportedly within ... beach it's fascinating\nSo again if you want to examine whether she misled the committee put this country through a nightmare you need all her text messages all her emails\nAll of those who that have been deleted which are recoverable and that is\nFor Powell McLean anyone who is ... ... was talking to her at the time including anyone from Feinstein's office all of that needs to be out all of it do you agree with me that you cannot allow people to get away from this get away with us excuse me\nThe same thing with Julie sweat neck if you're\nSubmitting statements to the Senate Judiciary committee that are false knowingly false you should be prosecuted for that I don't care how long it takes I Would prosecute for that\n... and I bet that text messaging trail to Christine Ford tells a fascinating story about what really went down\nAnd I'd subpoena that therapists if the therapist even exists subpoena that therapist they look there is no patient a doctor privilege here apparently she was releasing notes and showing them to at least showing to the Washington Post she references them in her testimony gone no privilege\nA lot to uncover here so they want to go through other Brett Kavanaugh to use the word drunk in a handwritten note to friends or whether he threw ice and Nineteen eighty five I\nI'm not in July what happened that do you what would you\nBe curious to know that I Would I Want to know if a former FBI agent uh who has an enormous amount of institutional knowledge about how to scrub Internet history and other people in the FBI who would know how to do that Dr Ford knew how to do that on her own someone helped her in this process\nEight five five forty Laura stay there your reaction up next\n[laughter] God\nPlease don't just come here today and then go home go to the hill today [laughter]\nPlease get off in the face of from Congress people\nIn the left is going completely crazy [noise] the Laura Ingraham show [noise]\nI'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty\nIt's called ... and here's how it works with Rachel you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part of rates go down you get the lower rate with ratio we really have you covered\nYou're more reasons why you want to work with America's largest mortgage lender for eight years in a row now JD power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage rich nation and for the fifth year in a row they've also ranked as high as ... ...\nEighty power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio another way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nBasin right where he said in comparison to public records which will prove only balance or thirty or parts of transactions call for confirmation conditions equal housing wonder licensing office he said and wants to be thirty thirty additional conditions works loses may apply\nFor what's worth I'm Sherry pressed and what would you do if it was you pizza delivery guy and won't do Wisconsin ring the doorbell enhance a pizza to the man who answers the door\nAnd honestly kind of friendly [noise]\nUm and then I noticed behind them was a woman I'm actually\nAt one point point or black guy as that I could see on her right eye\nMouth or it's helped me through many just ... wasn't quite sure that he said that right so until we saw and again", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Tucson", "day": "03"}