{"month": "10", "state": "AZ", "station": "KQTH", "content": "Let's talk trash I met you and I'm Josh you were the ... of Gibson's offer solutions\nTourists supplies are not the most glamorous of all subjects but they are in the ... to keep your business running smoothly and in tip top shape at Gibson's office solutions we have thousands of the highest quality janitorial and cleaning products to help you stay stocked up sanitized and squeaky clean\nCheck is out today at Gibson easy dot com or call us at six two to six seven thirty eight and remember to shop all go and buy local that gets into office solutions\nTrail miles outfitters Pima County new as family friendly gun shop thank you for making the annual spring shooters roundup of success gal singing a purchasing a firearm job I was out there is such a unique return policy allowing you to return your firearm and cut it into a new purchase and always special offers for military and law enforcement remember they wrap a lot of fire on the last Saturday of every month robots outfitters\nDrive a little and save a lot since you know sitting sales tax on colossal Kaye wrote about one mile north of I tend to Seventy nine or visit them at ... dot com western hospitality with friendly prices\nNine nine nine\nIn the hour follow us ... for one take you'd be H on Twitter and Mike is on Facebook one oh four one K. U. T. H. T. T. P. A. confirmation talk\nFrom ABC News\nI'm Richard can't who there is at least one winner after Tuesday nights mega millions drawing let's see if I can make you a billionaire tonight had\nWe have a winner with a historic more point six billion dollars up for grabs at least one winning mega millions jak part ticket so somewhere in South Carolina the winning numbers twenty eight Seventy five sixty two sixty five and a mega ball of five mega millions are still waiting on other states to report the results to see if there was another winning ticket\nABC's Kennesaw Mountain the caravan of thousands of Central American migrants are still in far southern Mexico currently taking a break in Chiapas state on his way to the u._s. air\nHanding out water and milk and bread and juice and there is so much need so much desperation here there are little food\nA little water no bathrooms and what how these people together for a week now or more has been here numbers but now I didn't hear actually overwhelming every little town that they are going around a BCS\nMatt Goodman traveling with the caravan Yahoo getting out its check book the green to pay Fifteen million dollars in damages after the email address is another personal information were stolen from two hundred million people in twenty Thirteen and fourteen\nBut not disclosed until twenty sixteen\nIn Boston and the red Sox took game one of the world series eight to four over the Los Angeles Dodgers\nABC's Aaron ... was there\nThe red Sox game one of the world series here at Fenway Park by more wrong than feeling kind of came out jogging and we want mine called me and marketing\nAnd you want what do you think for the rest of the way\nThat someone vying for sure red\nSox and Dodgers lay their first world series game against one another since Nineteen sixteen in front of a sellout crowd of thirty eight thousand four hundred and fifty more moisture spends on a whole mall night\nABC their guitars ... you're listening to ABC to\nEver wonder why Europeans seem to be so many languages maybe it's because they use battle the number one selling language learning happen near a ... award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad it languages but after using battle I can tell you I was just taught the wrong way using battles ten to Fifteen minute lesson you can be speaking confidently and the new language within weeks I was amazed that I can start having real nice conversation right away\nConversational in a new language like Spanish French or more you can try battles were free to go to battle dot com or download the app and try and for free that's battle B. A. D. D. E. L. dot com or download the app to try it for free\nWe're going we're all just kind of doing this looks like we've got some beautiful fall weather\nMoving back in here and ah it starts with your Wednesday with a high of eighty three degrees partly cloudy skies gonna take a mostly sunny skies into Thursday Friday and Saturday with\nHide in the eighties an overnight lows in the mid to upper fifties him back we'll go to eighty seven degrees on Saturday and probably Ninety degrees on Sunday check ... whether any time it could go nine dot com\n[laughter] Dave Ramsey show\nThat if you told me you had a thirty thousand dollar truck I Would tell you to sell it because it's more than half your annual income and they would actually move the needle Hama forty thousand dollars for the bat 'cause you could buy a five thousand dollar truck and you just put twenty five thousand George or forty and that that would that would make sense\nBut showing 'em ten thousand dollar truck and putting five thousand are tortured that na ten thousand trucks not a problem that fits in if that's what their lifestyle which not a big deal it's not over done\nWhat's your what's your answer to your equation though is just to get on the written budget jump on every dollar dot com download the free apps and get your budget going every dollar has tightened that I\nKnow going out partying I'm gonna just lean in okay so if I make fifty thousand and I live on thirty thousand that's twenty thousand a year for two years and I'm Free will be pretty cool [noise] ...\nLet a new one on one in four one K. K. C. H. San news and talk show Laura Ingraham shell midday Donald\nTrump or as someone who defied the odds to when the president said that's what Kanye West is is is referencing there I Believe like anything's possible in America\nThey all said you couldn't do it they all said you your campaign would flame out they said\nYou would get transferred by Jeb Bush they said that they were Hillary was then going to destroy you and it was going to be a member of the all the protections that Trump would lose and a massive landslide you remember that I Do we played them every night and every day\nWell all of that was false and Trump became president in ... when I think as a man who you know he didn't have a lot of male role models Donald Trump has been a friend for a long time it doesn't mean Donald Trump gets everything right personally we now he hasn't none of us do but I think that there was something profound and what he said\nThere is some Lori Andrews show one to four oh one oh four one K. C. H. two sons news and talk\nTo Joe bags show evening if you're telling me to shut up overseas ... told me to stand up what the hell am I supposed to do [laughter] you got to pick on somebody who's been up a good show and other battery Amish of my mouth about it but it's been about when these people's Arizona Perry watching do they think that they're being effective I think she thought she was like oh man\nI end up and shot at I think there should be able to teach her from actually waters\nThat killed ... forty sevens on one of four one K. Judy H things on the news and talk ... dot com\n[noise]\n\nIndependent in thought and punk rock in life\nAnd show\nHappened that a lot of their ... were putting\nWe're taking care of ourselves version [noise]\n[noise] we're taking care of ourselves version [noise]\nGlobal is in order to global\nWants to blow to do well\nFrankly not caring about our country so much [noise] and you know what we can have\nIs sort of became old fashion is\nA nationalist and really\nNot supposed to use that word you know what I Am I'm a nationalist sub by God how\nDare he said that that is\nAll fall Trump is set it\nWhat is the nationals according to Miriam Webster devotion to nation especially a sense of national consciousness exam one nice thing about ... nice place in primary emphasis on promotion of a couch and interest as opposed to those are the other night\nSo you listen to Trump and you hear that and then of course outcomes everybody on the left too damn him across the board\nBecause he is the ... that's exactly what he is he's evil based on this\nI'm a nationalist\nUsed that word we're going to talk about that word tonight it is a favorite of the all right and is loaded with native is an racial undertones and global as well global is I've been uses a slur of sorts sometimes even against those in the administration often with anti Semitic overtone\nWhat's just happened to make president come right out and embrace nationalism openly [noise]\nAll right so he's a nationalist but according to the left that don't quit so for the white nationalist\nThat are out there that are coming out Trump spoke about this today right 'cause you you know it does with Trump's like hey quick I Need to I Need to talk to people about this I Need to talk to people don't understand what I'm saying people whether they they don't get it they don't understand here I Am I here I\nAm proud of our country but I Am a nationalist is a war that hasn't been used too much for people use it but I'm very proud I think it should be brought back\nAll right\nThat's a dog whistle that means you're white nationals I heard when you were talking I heard three needle because you were talking to the sound waves for coming by could peer through those sound waves Trump I could peer through them and what I saw was\nBlocks and rather than it was all coming at the all right All right you are a white nationalist\n... brand and Mazie Hirono and you know there is no presumption of innocence there is no due process they don't actually believe in the constitution of the law they don't believe in the last I also don't believe in human decency and basic human decency and then when I say they don't believe in basic human decency I made that I mean that they really don't believe in basic\nNotions of human beings and see the kind that most of us were raised with by our mothers and and sometimes by our fathers or the idea that you'd be fair and a decent\nHonest untruthful that what matters is the truth and\nNot ... shirt to political snakes\nUh and uh I guess those days are those days are gone those days are behind us\nHandwritten plan challenging time window four one K. K. P. H. two sons news and talk\n[laughter] Dave Ramsey show myth that they'd be told me you had a thirty thousand dollar truck I Would tell you to sell it because it's more than half your annual income and they would actually move the needle on the forty thousand dollars worth of that because you could buy a five thousand dollar truck and your foot twenty five thousand Georgia forty and that\nThat would that would make sense\nBut selling them ten thousand dollar truck and putting five thousand are tortured that na because I was our trucks not a problem that fits in if it's what their lifestyle it's not a big deal it's not over done\nWhat's your what's your answer to your equation though is is to get on the written budget jump on every dollar dot com download the free app and get your budget going every dollar has tightened let us\nKnow going out partying I'm going to just lean in okay so if I make fifty thousand and I live on thirty thousand that's twenty thousand a year for two years and um that free somebody pretty cool [noise]\n... let a new one on one in four one K. keep the AIDS tests on suicide\n... a year for two years and I'm Free will be pretty cool [noise] ...\nEleven to one on one in four one K. K. C. H. sons news and talk\nWith Dave Ramsey show\nThat my wife and I just came back from three weeks and Europe should it's it's much go to\n[noise] and the only way you're gonna be the ... the only way to fight for schools have a plan or so you know the school that you're thinking about going into and they'll find out what it costs to go\nCost of living there have you know how to live on the shape of the room mate faded away and\nShow you do in Los Angeles the truth is it can be done\nSingle guy and the good news is you know when I'm In when I was in situations like you're in or out of the month is laying really really hard but when\nHard [noise] and so it might be that you say OK so tricky Eighteen mostly the foundation to do these two things the game all low\nFor Europe and first ...\nEleven to one on one in four one K. K. C. H. two sons to use them talk show Laura Ingraham shell midday Donald\nTrump or as someone who defied the odds to win the presidency that's what ... is is referencing there I Believe like anything's possible in America\nThey all said you couldn't do it they all said you your campaign would flame out they said\nYou would get trounced by Jeb Bush they said that the ah the Hillary was then going to destroy you and it was going to be a member of the all the predictions that Trump would lose in a massive landslide you remember that I Do we played 'em every night and every day\nWell all of that was false and Trump became president in ... when I think is a man who you know he didn't have a lot of male role models Donald Trump has been a friend for a long time it doesn't mean Donald Trump gets everything right personally we know he hasn't none of us do but I think there there was something profound and what he said\nThere is some Lori Andrews show one to four ... four one K. C. H. two sons news and talk\nChange than down the hatches [noise]\nComical storm chat\nHeaded your way\nTo tell you guys just right now I'm cynical as it comes but at the same time I you know I Want\nTo believe and then you don't want to believe but then you do want to believe and\n... it's it's a tough situation you've got a kid a birthday party and lots of new shows\nAnd the story it just kinda breaks your heart right you know children they love their birthday it's especially when they're young they look forward to it to a well a kid in Tucson he wants to cross when nobody showed up to his party\nAnd his mom and you can imagine any parent would be just as heartbroken at to see your child going through that\nYeah yeah absolutely I agree so you've got this kid nobody shows up at his bart's right and apparently and I say apparently mom invited a ton of people\nHere is the story we're talking about ... shared this photo of her son's birthday party look at that and and and the table and ... year old pedal just sitting by himself that Peter Piper paint\nThe oh no yeah oh and it is that you look at this kid and he's just like oh my God this\nSucks right it totally\nYeah oh\nAnd it is that you look at this kid and he's just like oh my God this totally sucks right it totally it\nSucks mom invite a bunch of people and people didn't show but then you start going okay wait a minute here do you really nobody show or is mum trying to\nElicit sympathy and we've been debating this all day here\nYou know it may be and then there was this whole thought processes that mom was trying to get stuff out of it because when people see stuff like this it's human nature to want to be able to help it so hard to say and I've become one of those people were I'm cynical but with the ...\nThe ... an hour for a very them on a little boy ... Apollo Hospitals and no one show all\nThe first thing that came to my mind is what's ...\n[laughter] this is Chad you're an awful person [noise] thirty kids\nDidn't show up and then then it came to my mind as well wait a minute here there's no way\nLike thirty kids just don't show up just\nNo way like that's that that is and then I was reminded\nHim of jak showed up an amazing well jak is you're going to these things you may not like it but you're going somebody takes the opportunity to invite you to some of the think highly enough of you to invite you to something you're going to go\nAnd jak which there was a party with ... I don't know how many maybe twenty kids were invited\nJak in another kid showed up\nAnd I was like wow that's crazy\nLike twenty kids and they made the best of it they had a great time it was it was great and even when and and my thing is to is like you know we in so many kids RSVP and then they don't show up which drives you crazy don't give you an adult or kids still drives me crazy and yes stuff\nCan happen but in saying that even for me if jak can't make it because there is something because things do happen in life uh\nWe always make sure we get a little something for for the kid but I looked at this and and the first thing that went through my mind is oh that's\nAwful horrible and then I started thinking to myself well is it is it is it mom she playing a game and kid doesn't understand this she's looking for stuff because everybody's coming out the wood works but how about\nThis the Phoenix Suns they solve petty story and they posted this on Twitter how about we celebrate with thousands at our place ticket when they've sons versus the Lakers game is on us it's all yours petty\n[noise] so we get to go see Ron Brown and the Lakers play is going to go see the soccer team the ah ah\nIn Phoenix play so it gets to do all those kind of six meetings rising but it it\nTo me I just felt again I I I felt like it's horrible it's wrong\nAnd then the cynicism came out and said well wait a minute here is it wrong that mom did something and why would she posed it then I realized we post everything now it's it's tough\nTo say if it's true or not but have I seen it with Jack I have seen it I've seen him show up and be one of the only two kids that are twenty plus were violated and it does suck it absolutely\nDoes three two three five three twenty four twenty three ... and shows your Twitter you can tweet at us Krishna gay man this story changes a lot we're going from left to right right the left up down Middle East\nIs your Twitter you can tweet at us ... gay man this story changes a lot we're going from left to right right to left up down Middle East southeast up ... ... I'm over here [noise] I don't even know ... ... talk about that straight edge adventure [noise]\n\n... adventures and show [noise]\n[noise] as far as sleep become a nightmare for you do you dream of getting a full night's rest boy am I going to have those days are long behind me\nThey said to my pillow I'm sleeping like a baby these days and so can you my pillow adjust to the shape you want and need tossed those flat worn out pillows and letting my pillow change the way you sleep wherever they're the one and only solution to your sleepless nights my pillows are made right here in the usa with a hundred percent machine washable and tribal cotton\nFailed to improve\nI'm Glad that he's decided to use\nI'm Glad that he's decided to use his voice to kind of state has opinions to share how he feels\nYeah I'm I'm super glad do I am\nBecause you know this guy is the most unpopular guy in the history of unpopular guys in the history of unpopular guys I mean never in the history of of of of presidents eve has anybody been unpopular like this especially with the most beloved president and the history of blood presidents who was here just before him\nWell despite a slate a recent controversies President Trump's approval rating is in terms of how to next week's mid term elections now in your Wall Street journal poll shows that forty seven percent of likely voters approve of the job he's doing that's higher than President Obama's approval rating going into the twenty Penman terms\n\nThat's impossible he's the most pull of human being of all the time\nI don't think he's Catholic but they're working out a way to not only given the second Nobel Peace prize but also saint\nHim he's the most beloved character and the history of you and God just no way Trump can be as popular if not more so that's got to be a tae Bo\nIs funny right living rent free\nEven kids are getting a kick out of these Halloween decorations [noise] fighters are big hit but so is the start of this elaborate attraction [laughter]\nThe display has ground compared to last year and Daniel fears it will get even bigger next year it could be worse I don't know if you hit by [noise]\n[noise] [noise] but wait a minute he's more popular he's more popular\nIt just it it makes me laugh and again it's the rent free in your mind right I'm just going to allow this to happen I'm going to be so obsessed\nI Can't do it I got other things going on [laughter]\nDo and this is my job it's crazy though it really is and it's so funny when you listen to it because I've talked to so many people who the narrative is what because Ninety percent of the coverage is awful and there's\nA lot of what is the coverage has nothing to do with policy has altered with personality\nHas nothing to do with the actions when it comes to the political side of the thing has all to do with who the person is you may find somebody off all the human being but their work and their actions say something different when it comes to their actual job performance\n\nForget we we we go in and we\nWe look at history in a much different way when it comes to past presidents write\nMe Bush got a a people looking at Bush more fondly and part of that because they don't like Trump was like oh like Bush was this that and the other news you but that's the way that people approach you it's so different because we we look at it in a different way but with a with President Obama ... the media was starry eyed\nMinus Fox and Breitbart and a few other you couldn't find anybody have a negative word against Obama\nAnd yet when you look at the people that matter the voting public they're like doing pretty good job and they're like well it's it's wait this is the title because it says that people are prove he did say he okay it says it yeah but ... says that he he really is his approval\nPeople are prove he did say he okay it says it yeah but ... says that he he really is his approval ratings higher oh wow that's crazy no that's the reality of\nThree two three five three twenty four twenty three and she had mentioned show is your Twitter you can tweet at us love hearing from you Rand Paul was talking out so it was ... you could show geek\nShockey hush Yogi hockey whatever they call I mean every time I turn somebody on depending what accent they have his name is different but I talked about Rand Paul the other day and the things that he's saying first of all apparently Trump is is is fuming and his past that the Saudis and the way this thing has gone down\nAnd it is it is getting uglier and uglier and everyone has come out talking about this\nThe information [noise] Ninety evidence that we have so far collected indicates that ... was slain in a vicious violent ...\nYeah yeah absolutely absolutely\nI think we know that know people like why is this a big deal why some guy was a journalist to hung out with bad people who said some things that were awful at times gets a ... a pass and somehow we're all supposed to care about I said well it's not just to think of it like this it's not just this\nThere are so many other things because you don't you know a NBS the guy the the ... the prince\nThe things around the friends that have added up to it whether it be the way that he's treated many others\nThe way that he's violently crushed descent or anything like that the way that he's extorting money from family members that are fairly locked up his mother and and and they done so many things that the fear\nThat people this is just the straw that is breaking a\nThe camel's back if you will that is the issue that people are having this it's not just one because everybody's looking at in the micro why should we care about this it's not just this it is so many other things and this just happens to be\nMaybe the final straw for a lot of people\nThink oh this was just an accidental death or you send a forensic pathologist with the bones are just in case you might have a fistfight where you have to just member somebody I mean how horrific\nBut then also having a body double I think there's a lot of reasons to think this was planned and I think because they have such an authoritarian government nothing over there happens is not directed from above you don't act without orders so it's kind of a stretch as ... to think that the crown prince wasn't involved in this yeah\nYeah absolutely one hundred and ten percent\nWe were too easy to say I will give it credibility to the story and people are starting to do\nA step back and say well maybe you know even out Trump number of\nQuestioning at your Jared Kushner yesterday saying look we're looking at everything more and more people are are are\nAre saying stuff and don't take this just as this story and I think that's a lot of what's happening is the journalists obviously\nAre concerned because they're seeing somebody was working for the Washington Post than somebody who's been a journalist for a long time who's an influential voice in in an area of the world that doesn't have a lot of influence when it comes to a more modernized\nProgressive ideas but think of it across the board in how that this guy is gone and handle things while in some ways you saying look I'm going to hand you guys more freedoms in other ways he's cracking down over here he's doing the magician\nWell in some ways you saying look I'm going to hand you guys more freedoms in other ways he's cracking down over here he's doing the magician don't look at this and don't look at this and don't look at it because you're over here looking at this and and this is the hand that doing something and that's what's got a lot of people worried\nNow Saudi foreign minister attack you ... the crown prince here's what he has a\nPipeline that very surprising that some of the success of miles away and this was supposed to thousands of miles away [laughter] no access information or intelligence so this is the senator\nAll this is not going to see some of those and some of the nation [laughter]\n\nHow stupid do you think we are I mean we you know we were all born at night just wasn't last night\nWhat's your response to the Saudi foreign minister I think he's got a lot of gall to lecture the United states about presumption of innocence the Saudis currently have over three thousand people\nBeing held without any trial without any presumption of innocence in a prison these are political prisoners nearly a thousand of these prisoners have been there for more than three years\nThey recently in the last year or so killed a uh she uh she by the name of never I'll never they're holding his nephew who's been in prison is supposed to be in prison for life for attending a protest rally so no the south they shouldn't be watching and lecturing anybody about the presumption of innocence now\nNo there should this this this is a this is a joke this is but when you hear people talk about this and why there's anger understand\nIt isn't just a bout a singular thing it's the worry that this guy who we're going to sell arms to to the tune of a hundred and ten billion dollars are taking some of those arms and they're using them in Yemen and doing some other things the way that he treated not only dissidents but look at the way he treats his family my God he's put them in hotels\nHeld them hostage and extorting billions of dollars from a and while he's giving the women the right to potentially have an opportunity to drive down the street maybe or maybe not by themselves and to go see a movie and have the WWE at the same time he's cracking at three two three five\nThree twenty four twenty three and she had been some shows your Twitter you can tweet at us jets [noise]\nWith the Mayo Clinic radio health minute I'm Vivian Williams thing happens when your brain\nDoesn't get enough blood and you'll lose consciousness temporarily it off and brought on by an emotional triggers such as being upset or excited brain\nSays look you don't have to be so excited much slowed down to heart rate low down the blood pressure so that reflects sometimes goes overboard and the patient with low blood pressure or a little heart rate the combination of the two leads to insufficient blood supply to the head\nWe have office furniture that fits the needs of all industries give us a call today at six two to six seven three eight to start collaborating on your new space they will go and buy local ...\nOffice lesions Joe bags show evenings but one person I'm I'm assuming from my jury or are we should go where shall we call this the ... message update of the day oh yeah you got to be the\nPerson who sent me this said I'm sure you do as old as you're going to be worth a oh that was from while\nYoung lady named ... who voted killing ... forty seven on one of four one K. U. T. H. from you can\nTalk on the news that affects you southern Arizona mid term election guessing a steak and eggs and ... I Can't really talk\nFrom ABC News\nI'm Richard camp to South Carolina's lottery reporting it sold one winning ticket in last night's mega millions drawing\nThe mega millions ballooned to make billions last week breaking in a world record the jackpot just got bigger and bigger no winners this July\nThe jackpot and the unprecedented cash payout of nine hundred for a million dollars a lot of fever spreading across the U.S the winning numbers twenty eight Seventy five sixty two sixty five and a ... a fine ABC's\nKennedy ... President Trump will be brief this afternoon by U.S officials on the killing of dissident Saudi journalist demolished Yogi Bear Saudi Arabian operatives after that the president says will know pretty much everything there is to know he calls ... killing a total fiasco\nThey had a very bad original concept [noise] it was carried a poorly and the cover up was\nAnd a very bad original concept [noise] it was carried a poorly and the cover up was one of the worst and the history of cover ups\nMidterm elections in less than two weeks a judge in Jefferson City Missouri made clear his earlier ruling the local election workers cannot enforce a core requirement of the state's new voter id law essentially cutting that law\nA collusion involving a school bus claimed a life in Alabama the school\nBus was on interstate ... taking students from Tuesday Night Football game and the town of leads back to Roanoke on the eastern edge of Alabama State police say westbound pickup truck crossed the median and collided with the bus both vehicles ending up on the shoulder the freeway\nOne person in the truck was killed you love and other people were hurt including each student's the bus driver was taken by helicopter to a Birmingham hospital generally an ABC News\nMexican food recall California's release foods recalling two and a half million pounds of frozen to keep those beef and cheese buffalo glaze chicken ... chicken might be contaminated with salmonella and listeria they worship nationwide you're listening to ABC News\nHere's a special message for those of you who owe the IRS at least ten thousand or more in back taxes the IRS has special programs in place that could eliminate or reduce your tax that by the thousands of dollars with a call to national tax help blind you can stop the wage garnishment celebrities and tax liens now once you've qualified\nAnd enroll the IRS will stop all the collection activities against you means unique programs have been allocated to help the economy and significantly reduce or eliminate your tax burden the IRS is currently accepting reduced settlements and other favorable programs\nYou may qualify for substantial savings so get the help you need if you owe the IRS ten thousand or more call now for free information and to see if you qualify take down the number now for the tax how blind eight hundred eight oh five ten fifty five that's eight hundred eight oh five ten\nFifty five for free information\nEight hundred eight oh five ten fifty five that's eight hundred eight oh five ten fifty five [noise]\nBoy when you're on the other day it looks like we've got some beautiful fall weather\nMoving back in the air and ah it starts with your Wednesday with a high of eighty three degrees partly cloudy skies going to take a mostly sunny skies into Thursday Friday and Saturday with\nHides in the eighties an overnight lows in the mid to upper fifties impact will go to eighty seven degrees on Saturday and probably Ninety degrees on Sunday check Kagan nine whether any time it could go nine dot com\nSo angry Michelle de Paul Ryan said Paul Ryan the terrorists don't work okay All right and still saying that today\nI just don't think the ... is this one way to go by understand the president's plan I understand what he's trying to do an interest in in the goal he's trying to achieve is a good one a better deal for Americans better trade agreements I just don't think tariffs on the way to go and our members are making that that pretty clear\nFirst of all phone Ryan is supposed to be the guy who's all ended tack\nThere the next generation of Republican they know the tech world the new intellectual property chapter of the NAFTA sixty three pages in contains more stringent protections for patents trademarks\n... financial services and even domain names many business leaders and legal experts believe these updates were necessary given the original agreement was negotiated a quarter century ago way before we had any concerns about any more and groom show one to four on one oh four one K. C. H.\nTwo sons news and talk with Chris plants show mornings\nThe prosecutor being brought in from Arizona to deal with the questioning\nThis is talk show morning\nThe prosecutor being brought in from Arizona to deal with the questioning because of Democrats cries of sexism kind of ironic coming from the party of Ted Kennedy who killed that girl in our car Mary Jo ... and Bill Clinton who clearly raped Juanita Broderick she must be believed\nI Believe survivors and ... in the face of Paula Jones\nNow and that's just scratching the surface on Bill Clinton's the party of all of the sexual miscreants than they pretend now that they represent the interests of women whether what they mean is bimbos\nSay that the Democrats the bimbos must be believe we believe the bimbos and someone will change from last time around because the last time around they were in both of them ever smear there were slaughtered they were ruined they were wrecked they still can't show their faces in public because the Democrats did such a job on\n... on one oh four one K. K. E. T. H. two sons news and talk\nJolt tags show evening Jim ... says that she's gotten death threats but nobody is actually show proof of and she's being given an ultimatum to actually answer questions about this horrible thing that happened thirty six years ago she's the one that brought it up\nIf you can't question or the or judicial system work I don't understand going to put under oath and let's see what you know it's all about wasting time until after the\nMidterm that killed ... forty sevens on one of four one K. U. T. H. time from you on TALK of the key word nighttime\n[noise]\n\nIndependent in thought has punk rock in life and death and shell\nThat has happened in a lot of the guys were putting\n[noise] we're taking care of ourselves version [noise] but\nGlobal is in order to level as\nWants to blow up to do well\nFrankly not caring about our country is on line [noise] and you know what we can\nAs sort of became old fashion as\nA nationalist and really\nNot supposed to use that word you know what I Am I'm a nationalist\nMeli Trump saying he's a nationalist oh white nationalist according to some uh he's just coming out now and say he's a white ... he's a white nationalist you knew he was a white nationalist you absolutely no that's what they're saying that what they're saying let's break down national is what it means a lot of the devotion to nation especially a sense\nOf national consciousness insulting one nation above all others and placing primary emphasis on promotion of its culture interest as opposed to those of other nations now people are saying no no what I should say is I'm a Patriot Act patriotism\n\nI see people tweeting out a nationalist is a person who who hates other countries which from what he said was I'm putting you guys' first I'm putting America First put words in my mouth I'm going to go out and say\nThat's how it's taken and remember we live in the day and age where it's no longer what he said it how would you take it how do you take it\nIf he says I'm a patriot somebody will say he's just saying he's the national is just using something different right number thug we all know\nIf he says I'm a patriot somebody will say he's just saying he's the national is just using something different rights member thug we all know what sub means when you say thug you mean young African American man that's what you mean it's it's how it's take is there a better word to use\nHell yeah there is in this day and age yeah he got to understand\nBut Trump doesn't care about that he doesn't he doesn't care one bit about that\nThere's nothing wrong with loving your country is the wrong with loving your country you know I Lived in Europe off and on for a decade when I was in England I was an English is anybody else except when they played American Sport or something [noise] then I was an American\nThen I Want is not a patriot right she's an American\nThe way the Trump said this and set it up gives all the fuel to the fire that the left needs to come and do the things that he's that they want to do because just as Trump as they say is stoking the fires of fear and all of these things when it comes to what's taking place with this caravan the left does the same thing and they used Trump as the bogeyman\nMade him feel CNN declared him insane and worse ... grows al ... is the ... of it\nOf the Trump Administration consider what black Americans are saying President Trump only got eight percent of the vote in the election two years ago but ... some polls show black support for the president has nearly tripled the twenty three percent and the latest numbers showed Trump what\nThirty five percent black voters support no wonder the Democratic party is in a panic there is injured voters seem to have slipped their changed and declared their free at last to support any one day walk\nSo large large and show that an impact on went out for one taking the AIDS Tucson news and talk\nAbout combat bottom of the hour take connected uninformed anytime at one of four one K. cute ph dot com\nYou they Wildcats welcome the Oregon Ducks to Arizona Stadium this weekend listen to the Joe ... four to seven for your chance to win for Baca tickets to the game\nThis month get local Tucson partner is handy dogs dedicated to helping older adults and people with disabilities improve their quality of life through the specialized training dogs now looking for volunteer foster homes breeders and donations Forty Tales at one of our one ...\nJoins us on MORNING news at six and seven AM for the first Fifteen everything you need to know about what's going on in this great big\nWorld of our state of Arizona and the ... smart listeners love smart speakers we made a symbol of sort of one of four one K. U. T. H. on your new device first teacher at the or dot our name by telling it to enable one for one cake you th skill after that simply ask it to open one of four one K. U. T. H.\nOne oh four one K. cutie eight teams on the news and talk more\nWind ... dot com Lars Larson show\n... nice I never thought that Lolita should be set free leaders the orca captured almost fifty years ago in ... John Doe back then we called them killer whales\nThat's just one of the reasons I'm Glad she's had a home and Miami ... for the last half century I did my first story on Lolita twenty five years ago even traveled to Florida to see her in person\nAnd she seemed relatively happy at least as much as you can tell by watching an animal answer ... is a conceit of human beings\nThe fight over her captivity has been going on that long but a lot of folks failed to recognize you served a purpose like I said we used called them killer whales and back then the public doesn't have the positive view or cause that we do today Lolita helped popularize her own species and fueled the demands to protect them\nTurner loose today and she's likely to end up dead in the ocean just like go the killer whale dead\nLars Larson show part time went on for one taking the AIDS Tucson news and talk [laughter] Lars\nLarson show when America goes in a strange place these days we saw the circus like confirmation hearing of judge Brett Kavanaugh this scandal is charge against him and Democrats who demanded an FBI investigation predictably even after the president agreed to such an investigation and the independent sex crimes investigator brought in to do the questioning\nSays that Christine forge testimony\nWouldn't even support criminal charges of assault now entered a time in America for crazy allegations can be made against men and women\nThat doesn't even matter if they can be proved the person who's named as politically and professionally dead\nAnd it's a modern scarlet letter that apparently only applies to conservatives think of all the Democrats mayors and governors and members of Congress who've been reliably accused of terrible things but God help you if you're a conservative and that goes doubled\nThe nerves and members of Congress who've been reliably accused of terrible things but God help you if you're a conservative that goes double for supporters of America's Choice for greatness\nDonald J trough so large Larson show seven to ten and went on for one taking th Tucson news and talk\nSomeplace else formed opinions are in danger has\nOn the show\nSo a sky news [noise]\nSaying that they have found pieces of the journalist\nMan the stories just nuts right this is just the whole thing is crazy and and and we touched on it earlier stop looking at it from the lens of only this one thing when it comes to the Saudi Arabia I look at it from the\nThe the bigger picture which is\nThis is one of many things that the new prince has done\nAnd\nThat's kind of the issue that people are having this may be the final straw\nFrom the way that he's handled his family members and all the ruling party members by holding them hostage and extorting money from them too including imprisoning his mother and what some three thousand or who knows how many dissidents the political dissidents that they've that they of ah\nPut in jail or holding hostage and the way that they're cracking down plus what's going on in Yemen and several other things so don't look at this as just this person I think too often we get caught up in it it becomes this thing it's just that it's not it's in many other things but because you weren't paying attention\nMost people are you going back to your life you're hearing about this but it's bigger than just the the\nDemocracy okay it's much bigger than that three two three five three twenty four twenty three at you had mentioned show is your Twitter speaking of things that are much bigger I don't know how big it is I mean think about how many people flying how many incidents that are on air but we've got the latest a situation and it has some racial undertones\nAs you say that\nEverything was calm you know we're getting ready to take off and then a man came on board\nAnd I'm a writer for the seat and then spoke very harshly to a woman that was a ... in the street\n[laughter] [laughter]\nOh so you got a guy who sits down and then there's somebody in between those as like there's an empty seat and screaming yelling that helps somebody ... ... no ... well\nI I [noise]\nAnd you know it's funny it's like they're not even American and you know Trump will get blamed for this\nNext year I knew a lady came from the ... was the the the women's torture and structure to an argument structured\n[laughter] [laughter] [laughter] [laughter] [laughter] not using is [noise] [laughter]\nYou know what I like did you hear the guys like\nThis is gonna get no early and by the way this is Donna Ryan air\n[noise] you know what I like you guys like\nThis is going to get ... by the way this is on Ryan air a which is kind of like it's like spirit it's got the spirit of\nYou know it's it's it's a flying white trash [laughter]\nShadi are being made it right there doesn't have the best uh clinging tell as you can tell a it's a very cheap airline and so then he continues on and it gets a little more race to see\nWhat you're still only took ... to ... exchange of racial or ... or ...\nGot so many things going on getting they'd actually go to carry on\nThey've been doing this [laughter]\n... well it's amazing\nIs only one person steps up and I think we're in the world today where everybody's afraid to do something because you never know a who's filming it just everybody's filming their moral I guarantee you what one person may have stepped up fifty people filled\nRight\nAnd that's a problem and the other thing is and this day and age everybody's afraid to get a vote because I mean you get involved in something you never know what's going to end up happening in how in some way shape or form your going to get blamed for something\nThat's frustrating but we don't get to the point where this is how we deal with one another when we always I my sense is that there was a lot of this going on we just didn't have the cameras the cameras are just ... you know everybody's out there showing everybody chicken look at this take a look at this\nAnd that kind of my sense is that this is it's always been going on it's just now we film it and talk about\nThree two three five three twenty four twenty three ... Benson shows your Twitter you can tweet us ... okay socialist\nHas a new documentary out and uh it's good to talk about how great it is to be a social absolutely or is it ... interesting stretch advantage [noise]\n\nSuch adventure show\n[noise]\nHave you ever digging your car in for an oil change your mechanic mind something wrong and she brought your hit with a huge repair bill and what happens when you're not covered by the manufacturers warranty your paying out of your own pocket to fix it that's why I recommend extended vehicle protection from Garcia if your car has five thousand two hundred and fifty\nWho was a huge socialist until the point now get ready for this producer Phil her tax a hundred and ... percent\nThat was her tax and then she said yeah we're not doing this anymore this is ridiculous she actually wrote a story about a which\nIt was being chased by the tax collect that is incredible so they can only privatize right they privatized stuff and they said hey you know what let's let's get a little bit freer let's let's let's do some free stuff\nAll I hear it's sweetened the socialist paradise we do have a bigger well first aid from the U.S higher taxes and the west but in other areas or when it comes to free markets when it comes to competition when it comes to free trade Sweden is actually more free market fat free market pays for Sweden's big welfare programs\nThey are paid for and you quote in Social Security\nFor Eighteen months paid parental leave government paid childcare for working families\nThat sounds great right but\nHere's the funny thing so we talk about stuff we need more parental leave we need this that and the other we all of these things it'd be great\nHere when you hear Bernie and a lot of these other people what is it they want the government to be a huge part of what they do right\nYou want all of these things and it's about the government the government the government the government the government let's let the government would be the end all the be all how about the government being the end all be all it's always turn to the government the government needs to take more control the government needs more this the government and much more of that does the what's great about everything is the government\nAll the be all it's always turn to the government the government needs to take more control the government needs more of this the government is much more of that does the what's great about everything is a government government government swing\nHaving the government manage all of the things they were so we have to manage its in another way privatize\nWe realized in Sweden that with the government monopolies we don't get the innovation that we get when we have competitions and this is particularly true for the school system sweet and switch to a school voucher system that lets parents pick their kids' school and force the schools to compete with them\nYeah how good is that this is what's interesting about that private schools have gotten better schools around private schools have gotten better\nCould you imagine because we're screaming unions and we have all of these kinds of things that are going on all of this stuff is happening and we can't have school vouchers and we don't want competition we can't take money away from here that this that and the other and the reality is is the place that were screaming about if you told Bernie Bernie they've gone to a voucher system\nI don't want to do that of course you don't want to do that\nYou want to pick and choose the hubris of it all is that we can do it better because what you really are advocating for instance if you want to kind of what they have but you also want a bit of what the\nThe Venezuelans have any sense that you want to make everything\nGoes through the government when the Swedes or saying first we're free market there's nothing about us as socialized at all I mean we have socialized medicine but we're not a socialist nation and you're always saying that we're always having to correct you Denmark just correct you everybody's correcting you and that we're privatizing the Social Security which I found to be rather interesting\nPrivatize the pension system that terrifies me and obviously that scares people but when they realize that the alternative was that the whole pension system would collapse they hope that this was much better than nothing\nYeah oh and how they do it over there is when the market is good in life is good you get more if the market takes a bit of a hit you're going to get a little bit less\nBut the alternative was you can have a hundred percent of nothing or at times a hundred percent of good and sometimes fifty percent of not so good hearts jeeze\nWell chat then it's really all about tax right we've got to tax the wealthy wealthy wealthy something I've been screaming back over and over who people don't understand the way that the vet system works in the entire system over their worst they don't understand it\nIt's all about taxing the wealthy here that's always the one percent the five percent six percent and they need to go go look and you could see how much money the lung present pays enough I present pays the multi millionaires and blah blah blah it's still\nNot enough it's about the redistribution of wealth but here's the dirty little secret children\nWhat sweetened does may surprise you despite the fact the Sweden looks like sort of a socialist country which taxes rich exorbitant the high the truth is the only\nPeople who weren't below average income pay up to sixty percent in tax that the the little secret about the sweetest tactic them we don't take from the rich and give to the poor we squeeze the poor because they are loyal taxpayers\nYeah\nThey're loyal taxpayers because people have a lot of money are going to figure out a way to get around it they're gonna figure out a way to leave because people with a lot of money or what their mobile\nThey can go elsewhere so what is it it's the vet value added tax everybody participates in that\nThe people who are at the bottom end of the income world disproportionately get hurt by that we don't want that here right we don't we want to go\nIm world disproportionately get hurt by that\nWe don't want that here right we don't we\nWant all of the goodies one all the trappings we just want a certain group to pay it always argue with somebody yesterday and I didn't want to start as they ... they started I\nWas like I I don't want to argue about this but the thing that makes me laugh is the people who scream trickle down economics doesn't work out the same people who say we want trickle down economics but we want to be able to do it from the government standpoint\n\nSweet and has a lot of good stuff Europe has a lot of good stuff we should learn some of the things that I understand that so when you hear the Bernice of the world come out here and scream and yell about this that and the other\nUnderstand what they're really saying is we want more control from the government side of things we want more regulation from the government side of things we want the government to be the end all be all to your world that's what we want\nHow we're going to get there\nIs by floating all of these magical programs in saying that we are going to be the Robin Hood of the world by taking from the rich and giving to the poor just like Europe does then you find out the reality is that that's not the way it's done\nEssentially the middle class and the and the and the lower incomes Rob\nEach other and pay each other that's the Ponzi scheme that goes on over there disproportionally it affects them far more\nThan everywhere else in the income stratosphere senior they don't get that\nThey don't understand that and even if they did get it they don't want to it's like everything else you can hit them in the face with the facts\nThey don't care because they want it to be something else\nHaving been in Sweden for several months it's beautiful it's great everybody kind of lives the same almost like a cartoonish village at times like him I noticed that in a movie\nIt was wonderful I see a lot of innovating not like here but they're going to push it in a way that makes you think\nYou're going to get all of these wonderful things if only these people would do it and they would pay their fair share and even if you show them they pay more than their fair share in certain areas and they're never going to pay the amount that you really want and that should be the number stop telling me\nWhat a fair share is give me a number that you want somebody to\nRemember this and I said over and over again the greediest people you will find or not and Wall Street but they're in Washington Three two three five three eight twenty four twenty three and she had been some shows your Twitter tweet at us love hearing from your Caspar the mattress baby\nLove it why do I love at first of all asleep cool I'm a hot sleep right I think a lot\nOf you guys out there are ... it's hot you know you your your your your sleep and your wife or your girlfriend whatever and you and you're like oh\nYou want to hold you go to a hotel you was the first ... started all the way down you like it cool and that's part of that sleeping thing this is where cash for helping secondly for me it's my body the way that my body is able to recover I feel great because I Do work out and for years up on my body to the task playing sports a lot of sports\nAnd it's great for me and my back my legs I feel amazing so those were cast\nWas doing it's a no brainer situation hundred nights risk free which is it's risk free here's what they did at first they send you a box comma ready to go to Casper\nDot coms micro chat and you've fifty bucks off selected mattresses so you do and then they send you the same comes this box and you kind of walk around and go how is there a giant mattresses boxes doesn't seem right you open up there comes a mattress then you try it for a hundred nights risks\nAnd you go how was there a giant mattresses boxes doesn't seem right you open up there comes a mattress then you try it for a hundred nights risk free in your own\nAnd check it out and you're like wow this is incredible risk free\nWhat are you waiting for no risk the chance for you to get sleep like you've never had and what it's going to do for you is incredible trust me I Know go to Casper dot com he's my coach at save yourself fifty bucks up the purchase of selected mattresses\nThat's Casper dot com coach chat get fifty dollars off the purchase of slack mattresses Casper dot com coach in terms of conditions apply at you had mentioned show as your Twitter C. H. A. D. P. E. N. S. O. N. useless fact today stretch I that's what you\nAre you putting your retirement savings four one K. IRA or investment accounts then I have one word of advice stop\nMany experts warn of a stock market crash any day now and if it's anything like the last two crashes you could lose fifty percent or more of your heart or in savings in the wall street 'cause you know can you afford to lose happier\nWe'll see me along with every day millionaires and retirement expert Chris Hogan pastor and founder of the ... version Bible lap Bobby Grunwald and founder and CEO of charity water Scott Harrison\nDiscover what these top leaders due to disrupt the market place you can download the event workbook interact with other attendees through a live feed and get all the same great content as if you were attending in person know travel required\nMay get a day for you and your team to watch together registered today Dave Ramsey dot com slash advance or text any one day twenty Eighteen to\nForty four to twenty two for more information\nBy first lady of talk radio and most influential woman in radio show starts next one over on UPA tasty cake UTA excuse on\nABC News\nI'm Scott Goldberg investigators believe there's a common thread between the explosive devices send to a number of high profile political figures\nThe investigation involves six devices meant for George Soros Hillary Clinton Brock Obama Eric Holder Maxine Waters and John Brennan the intended recipient at CNN\nThe pipe bomb like devices appear to have been made the same way leading investigators to believe they were sent by the same person or group\nWhile investigators have made no conclusions they have noted all the intended recipients are critics of President Trump and frequent subjects of his attacks the president said acts or threats of political violence have no place in the United states Aaron ... ABC News\nEven though the bombs didn't detonate investigators tell ABC they believe the devices were built to maim or kill anyone who opened the packages investigators also say they don't think the packages were delivered by the U.S postal service which would have detected them sooner and they worried there could be more out there maybe these Pierre Thomas\nMy sources I spoke to earlier today we're concerned even when we just learned about the Clinton package is also the Pakistani President Obama that more can be in the pipeline and that proved to be prophetic enforcement officials said today that over the next twenty four hours they will continue to look for potential packages coming into our elected officials and others throughout the country\nAt least one of the packages at a return address belonging to democratic Congresswoman Debbie Wasserman Schultz in Florida investigators believe that is fake and she is not involved in any way\nThe Saudi crown friends without publicly denounced the killing of Washington Post journalist Jamal ... yesterday the president of turkey set of Saudi hit squad killed just show the while he was inside the Saudi consulate in Turkey the south Carolina lottery now knows where the winning one point five mega millions lottery ticket was\nSold it was at the that was at one point five billion mega millions lottery ticket was sold his old at the Casey Martin Simpson build the lucky winner has not come forward yet on Wall street at the closed the big loss for stocks the doubt down more than six hundred you're listening to ABC News Audi I'm\nJerry Simmons inviting you to join each Saturday morning at six am for the ... ... talk show right here on one oh four one K. cutie age Tucson news into\nSan meals on what oh four one K. cutie age very Sanders in Tucson and democratic gubernatorial candidate David Garcia yesterday senator spoke at the University of Arizona in the morning at\nIn the afternoon bullets flying at Glen and oracle last night officers tried to make a traffic stop looking for a person with a possible felony warrant\nHow say one individual in the car started shooting at officers CBD says competed in fire back\nAfter a short chase the car crashed in individuals inside the car took off running three admitted tang police are looking for one more individual health officials say Twenty one confirmed Arizona cases the seminal I have been linked to Rob be produced by a meat packing plant west of Phoenix the state department of health\nSay Twenty one confirmed Arizona cases the seminal I have been linked to rod be produced by a meat packing plant west of Phoenix\nThe state department of health services says J. B. S. tolls and recall nearly seven million pounds of ground beef and other raw beef products that may have been contaminated according to the department the beef was packaged between the twenty six of July in September seven\nWhere the USDA inspections market ... two six seven I might wrap\nAny early April Madison seasonal high returns today with lots of sunshine mostly sunny in eighty one today and again for your Thursday just a few degrees warmer on friday that high pressure built back in for the weekend we will the high near Ninety both Saturday and Sunday\nOvernight lows will be in the mid to upper fifty you can check first wondering whether any time at Kagan nine dot com\nFor all your financial at estate planning need called Mayfield financial today whether it's a whole market will bear market be prepared for any market with Mayfield financial three two Ninety seven Seventy three out of hand badges\nOn ours has to do an hour to an angry left wing mob and that's\nOver Congress don't get much worse I'm Wendy Rogers Republican for Congress running against tunnel ... can be the deciding vote to put Democrats\nBack in charge of Congress their agenda repeal the Compaq Scott promised I open the border to stop the president's trained deal just dry the economy then impeached tromp impeached Kavanaugh and replaced the rule of law with mob rule ... and\nThere are some collateral damage\nFrom others do not share our view while healthy it\nCollateral damage what does that mean doesn't mean you lose your job your home everything you've worked for jak ton of Democrats can push their radical agenda on America\nI'm Wendy Rogers I approve this message and to urge you to merge street Republican or we can keep America great paid for by Wendy Rogers for Congress Wendy Rogers dot org\nUncle Sam is licking his chops right now he can't wait for you to retire because he plans on taxing you would have returned including taxes on your IRA and four one K.\nTaxes on your investment income taxes on your Social Security benefits and taxes on your state\nIt could be a field day for the government unless you take specific steps to protect yourself now\nLearn how you could save thousands of dollars in taxes with a free guide from Jeff bogus of premier retirement planning and wealth management in Tucson just a registered financial consultant certified estate planner and if a ... year with over twenty five years of experience\nTo get your free guide be one of the first time caller is now at five to zero to one seven eighty five Seventy eight that's five to zero to one seven eighty five Seventy eight\nInvestment advisory service was offered to order investment Elsie and SEC registered investment advisor insurance and a duty products are sold separately through premier retirement planning than wealth management I might grab\nNext time on two sons morning news are continuing conversation with Senate candidate Martha ... Sally right here on one of four one K. cutie age your mid term election destination station\n[noise]\nYour LT\nRadio addiction starts now\nLaura Ingraham show [noise]\nOoh ...\nAnother immigration sob story\nYou know another immigration sob story ... ... to\n\n...\nThese folks you know seven thousand now how do you know the hearts of all of them are human beings but from what I was this is just touching humanity of people who are fleeing desperation at home or who have no other choice and they're thinking about their children\nPresident\nThinks that you were an invading\nBand of criminals possibly terrorists threatening you soldiers to keep you out or separate families what would you say to him\nThe first one was there we are an honorable people where workers where do you call a group of kids terrorists whom women who need out we're asking for his support but of course we know he has no conscience crazy\nWell MSNBC has no scarcity of future pundit bilingual major [noise]\nThat's very heartening to here\nThat's going to be a just what we want him to the United states people trashing our president before they've even arrived\nThat's quite something isn't it just American and everything except the piece of paper eight five five forty Laura\nAh this is now a a situation where\nOne begets another begets another meaning a\nMigrant band of a border crossers [noise]\nGetting all this publicity and assistance and I'm going to show you in a moment a more and play a more for you about what we found out and what what all the back benches are saying about who organized this and we're only exposing this on friday night [noise]\nUh but now another caravan is\nForming in Guatemala it just again it's all just organic there's there's no force behind any of this there is no individual or group of\nOf open borders organizations that are pushing these are these thousands of people to rush the border which all organic it's all this is just the natural process of migration as if people are talking about\nYou know a bird migration or some this is just natural flow up and a flow down north\nGuess what the north were never go southward when you flip fly north you never come south\nBrat seats has got to be saved this cannot be a situation where you allow\nA good hard working people or Virginia to take the prosperity backward and go backward in time here we want to go forward with it or prosperity boom made possible by Donald Trump and all the fantastic Republicans in Congress who agree with his policies on trade and immigration eight five five forty Laura and I'm going\nTo those who want to come here come here legally food legal immigration is a sure way to getting the better life you're looking for here in the United states of America [noise]\nThe Laura Ingraham show [noise]\nDryer Adam\nHave you ever taken your car for an oil change in your mechanic find something wrong and surprise your hit with a huge repair bill\nAnd what happens when you're not covered by the manufacturers warranty\nYou're paying out of pocket to fix it that's why I recommend extended vehicle service protection from my friends that car shield if your car has five thousand to one hundred and fifty thousand miles car she'll can save you from paying for high repair bills replacing your engine or even a simple sensor can cost thousands\nAnd when you're protected by car shield you can have your favorite mechanical dealership fix your car\nIt's your choice car shield also provides twenty four seven roadside assistance in a rental while yours is being fixed for free\nGet covered by the ultimate and extended vehicle service protection from car shield called eight hundred cars sixty one hundred and mentioned the code Laura or visit car she'll dot com and use the code Laura to save ten percent that's commercial dot com or call eight hundred cars six\nOur sixty one hundred and mentioned the code Laura or visit car she'll dot com and use the code Laura to save ten percent it's ... dot com or call eight hundred cars sixty one hundred and use the code lord saved ten percent\nDeductible ... balance of nature's fruits and veggies in a capsule\nThat though I had a sinus headache for ... days but I had a master ...\nImage of the brain and stroke and I was on my deathbed\nThat was on a respirator in a coma for thirty five days in three months later I came home and the wheelchair and double vision I had to learn to walk again to speak again what didn't want us to write the alphabet you know if I went out and did a little something might come home I'd be in bed now I'm up by five thirty in the morning and go to the gym\nI Do shopping I cook I energy all day I mean I feel great overall my whole outlook just feeling about my mental aspect everything everything is better\nFor a little bit of time use discount code Laura and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free call eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five what or go on line to balance of nature dot com and used discount code Lara\nIt's not safe to assume all investment professionals are the same\nThere are many differences about one in particular is worth noting most brokers are paid an up front commission to sell you a product and unfortunately you may never really realized what your fees are or how those fees affect your performance\nMy name is Jeff junior with trading wealth and we are completely different Trojan wealth is a fishery and what is called the only way we are paid incentivized to simply grow your portfolio are advisory fee is a low and you'll percentage set up front with you our client\nThis gives us the opportunity to invest in only know loaded investments without the worry of sales loads are heavy transaction cost the concept is simple you grow we grow it's a mutually beneficial endeavor and our interests are aligned if you'd like a second opinion we would be honored to help coal region wealth today\nThree two one forty one hundred three two one forty one hundred or visit us online at ... dot com advisory services offered to retreat in wealth and SEC registered investment advisor\nRules in bonded been Tucson number one book company for almost fifty years for poor design and construction and the most complete service before\nAnd after the damn we carry a huge selection of above ground fine I'm ... years of relaxation and enjoying that enhance their physical and mental wellbeing check out the new collection of me Eric I'm Marcie time when many colors and unique\nFeatures to choose from your shirt applying their plane falling for you a romantic bumper to bumper for even\nA parties filing for aging every line was deliberate set up the chemicals and hard lock encountered right now at ... named to one thousand dollars on election laws while they laugh we have three locations ... dirty and we're on line a patio proven ABC dot com politics or that they\nThe ultimate have experienced patio\nUniversity for them to really be when I did not patio\nMid term election destination station coverage on line anytime at one of four one K. C. T. A. dot com [noise]\n\nCall Laura now one eight five five forty Laura\n[noise]\nThey don't have a single dollar ... they don't have a single dollar to buy a bottle of water so if it's being finance well I'm not seeing it because these people have absolutely\nYou can go to buy a bottle of water so if it's being finance well I'm not saying that because these people have looked mean nothing nothing\nWith the prison in Honduras told me was organized by leftist groups in Honduras financed by Venezuela and sent north to challenge our sovereignty and challenge or more than\nYou are listening to your health a radio addiction eight five five forty Laura on do you find this to be among them one or top two issues in the campaign I Do\nI think immigration affects every aspect of American Life from national security to of course our financial sustainability or our national unity\nOur culture [noise] uh in a force our sovereignty these these issues\nAll coincide all end up\nI think smashing together on this one issue of of\nWho we let into the country for what reason and what we tolerate a at our border it tells us a lot about what we tolerate in our society at large I David in Texas on line one David\nOr one of them yes but the economy oh just a second [noise]\nOkay do you have to say go ahead David we miss I miss the beginning of what you said go ahead\nI'm Sorry yeah where I'm originally from ... in a Republican from the moment I was born already get my vote them for their religion or earlier a voting you're in Austin, Texas\nA are you you're a reporter yesterday was right on it you're learning you're doing was organized by your expressive ethical and grew up I'll get a couple of years back\nUh this guy her ... that's where the darker your has a ... what do you call it ... your relationship with gang members and your that's what they do is create chaos or people who are going over there and by the gang members of a rocky road jobs go out\nAnd they're just go round including women and children in front of it and they're the ones burning cars that they are for them\nAnd my question to you David is why would Latino Americans who fled Central America or Mexico because they [noise] for a variety of reasons applied legally to come to the country and we're allowed in\nI have a lot of friends who are Salvadoran they left a during the war in Nineteen Nineteen eighties uh Nicaragua's same thing left during the war came here settled here amazing people great families\nWhy would they think the Democrats plan is good for their future they fled they don't want our country to become more like Central America\n[noise] it it seemed to look for when we were as we look at our Web become coach Rick from your ... your mother's Thirty years\nAnd we can do for a report grading too on doors and covering or what countries are doing that they're likely be possible so I don't understand how you guys need to go over there in her life wrote her\n... in ... doesn't work\nBy the prompt the problem is once our system gets flooded with mostly indigent low skilled people\nWe ultimately lose that that strong core of conservative ideals because they've been led to believe that the only people they can trust or the open borders types who helped them get in and the first place that's the problem I appreciate it David ah we have a lot to get to hear on the lower income show I have a question\nThe open borders type to help them get it in the first place that's the problem I appreciate it David uh we have a lot to get to hear on the lower income show I have a question do you exercise every day I mean something do you do something every day and if so what do you do\nDo you find that when you don't exercise you feel worse mentally just mentally feel worse as you get more lethargic\nOr there was an interesting um study that came out yesterday I'm going to touch on about that weather exercise really helps you lose weight or and even a ten minute a day walk and actually be really good for your brain they were\nThe following is not an actor but a real life story from trinity debt management\nMy story began with that and a lot of debt credit card debt and I heard a commercial for trinity I gave them a call\n... about a month later a firm that conversation I had with my brother or very close works are passed away or we buried my brother\nLater ah from that conversation I had with him my brother who I'm very close with a passed away or we buried my brother on a friday or Saturday the following day Senator Casey began running commercials in Pennsylvania during my situation that I had told him\nI'm with the twins and cancer [noise]\nAnd the woman in the commercial said that if we were letter had his way children like mine would be provided health care and it was obviously devastated my daughter my family myself I pleaded with him to please take the commercial down that I felt that was a sensitive heartless\nHis answer to me was that boats have consequences and you will be held accountable and November it wasn't I'm Sorry it was an hour I didn't realize the parallel it was like I'm going to college you even more\nIn spite of what I've just gone through a and people in Pennsylvania and I just you know just cannot believe given his friends\nCan't understand what would cause him to do something to be so heartless evil\nThe sky you saying that he green let this commercial and he in twenty four hours he they wrote a commercial that used or or had an example I'm an anecdote that used your story or that it was already in the pipeline they should've taken it down\nI wasn't running yet so whether they already had they had it in the pipeline of what they were and I I've\nI've just found it pretty ironic\nLet's let's tasteless\nYet he was a commercial that had twins with cancer you know something you think about doing when you're doing a commercial and the fact that he ratted after he knew what happened and and and wouldn't take it down he he only will take it down in Scranton\nUh because his own friends and family chance than seeing a but yet it's still running as we speak today he's he continues to run this\nAd about just make the most disgraceful [noise] excuse me on but I think like the very least you should have\nJust taken a taking the thing down if he didn't know if it if it was some wild coincidence you should have just taken a down a little bit I think for you for you the best thing to do at this point is to run on the issues any issues are facing the country today\nAre are of course this immigration crushed at the border which affects every aspect of our lives from economic to national security and health and and uh all other concerns a sovereignty and so forth\nAnd what do you believe should be done with these ah roving hordes of border busters\n[laughter] well if they would have listened to me back in two thousand six maybe ... you know we wouldn't have had this problem you know I I I've been a standing up against illegal immigration this is an invasion there's no other way\nThere's no other way to put it and it's people like Senator Bob casey who supported a support catch and release a that is really just encouraging people at and you know for all these years\nOf these week politicians in Washington who who want to talk about a pathway to citizenship basically giving a green light to people all over the world come to America once you get here\nYou can't leave the American people are fed up with this this is white Donald Trump was elected president because they want people back on and say listen we are the most generous country in the world\nBut you got a follower rules we you know we we need to know who you are you know what your background your medical we need to do all this you can't just walk in here and tell us a you know whether or not you you're going to leave or stay and we have politicians were actually support that case you support sanctuary cities\nI it's just beyond me that that uh that we have people who who are in elective office the frying artist\nCentral cities I it's just beyond me either that or that we have people who are in elective office the frying our laws\nAre a little the state of pets Pennsylvania they've thought and twenty sixteen was going to be a you know the Waterloo for Donald Trump he ended up winning a and yet some of those numbers have\nAt the very least softened for the president in Pennsylvania what what's happening there that would that would cause an erosion in Republican support is it isn't isn't demographic changes due to immigration is that trade what is it\nNo it's nothing it's it's that these experts pollsters and Washington console things have it wrong and just like I told them in twenty twenty sixteen I coke then candidate Donald Trump in Gettysburg about a week before the election don't\nPull out of Pennsylvania ... his how in ... there are they're not getting them right in Pennsylvania they they don't understand people here in Pennsylvania and many of them were Democrats because their fathers and grandfathers were Democrats and they were JFK Democrats and this Democratic Party\nRepresents nothing that people here in Pennsylvania or can can associate with but they're not going to change their registration are not going to tell a pollster they're afraid of grandparents will roll over and her grave if they switched parties or or or should they were going to vote for Republican but they did ... and Donald Trump is markers to appoint\nPeople here in Pennsylvania one and the pollsters are wrong they they have our race Ron I'm going to be happy 'cause election day they're going to be surprised again we we got Pennsylvania wrong\nOr Lou Barletta so great to talk to you and you are way ahead of the curve on this a scourge of illegal immigration and the need for sensible legal migration merit based into the United states and we really wish you all the best in this race everybody get out there and vote for Lou Barletta in Pennsylvania\nI defy those posters once again Pennsylvania cannot turn its back\nOn this prosperity that was ushered in by this new era of deregulation and Washington tax\nCuts and smarter approach to trade ah you're listening to your health the radio addiction eight\nFive five forty Laura will take all your calls we find out more about how these caravans are being organized by groups in the United states working with other NGOs in Central America fueled by leftist politicians\nIn Latin America we'll talk about that what's driving this in what we the people who wants to do in order to protect this country that we know and love don't go away the Laura Ingraham show [noise]\n\nIf you suffer from E. D. and you've seen your doctor about the little blue pill you can be expensive and seeing the doctor and waiting at the pharmacy can be a hassle\nWhat if I told you that a certain little blue pill just came off pat in December eleventh in that scene active ingredient that's in the little blue pills no available in generic form available to you for thirty dollars for a month supply that's\nA big discount no more getting ripped off by the big pharma companies with four hymns dot com you can bypass the doctor's office pharmacy and see huge money on your prescription ... just go to Fort hymns dot com slash easy consult with a licensed physician ad following their confidential medical review you\nCan have the proper prescription deliver directly to your door threat fraction of the price and today we'll supplies less you can get started with a trial and wants to just five\nBucks that's right five dollars here's what you do just go to Fort hymns dot com F. O. R. H. I. M. S. dot com slash easy today and get started for just five dollars while supplies last visit for him to that\nF. O. R. H. I. M. S. dot com slash easy today and get started for just five dollars while supplies last visit for ... dot com slash easy right now for him is dot com slash easy see what's like ripple details mental services to him by former available if you say\nOne of four one K. cutie ages your mid term election destination station and we want you to know about the prompts on your November ballot like city of Tucson proposition for a way\nYes but would extend the terms of the current mayor and council members by one year beginning in twenty twenty and switching to even your primary and general elections for the office of mayor and council members\nFrom Warren proposition for all eight and other propositions go to one of four one K. cutie\nThrill outfitters Pima County new as family really gun shop thank you for making the annual spring shooters run up a success gal singing a purchasing a firearm job I was out there as a unique return policy allowing you to return your firearm and credit to a new purchase and always special offers for military law enforcement remember they write a lot of fire on the last Saturday of every month robots outfitters\nDrive a little and save a lot that you know ... ... okay wrote about one or the next two Seventy nine or visit them at ... dot com western hospitality with friendly prices\nH. dot com I'm Jay foreigners CEO of Quicken Loans America's premier home purchase lender today's fluctuating interest rates can leave you with unexpected higher mortgage payments at Quicken Loans we've created a new way to protect you from unpredictable interest rates so you can buy a home with certainty it's called ... and here's how it works\nWith the rate shield you can lock your interest rate while you shop for a new home so afraid to go up you don't have to worry and here's the best part if rates go down\nYou get the lower rate with rate shield we really have you covered\nHere are more reasons why you want to work with America's largest mortgage lender for eight years in a row now J. D. power has re Quicken Loans highest in the nation and customer satisfaction for primary mortgage origin nation and for the fifth year in a row they've also ranked is highest in the nation for mortgage servicing ratio\nAnother way we can save your money on your mortgage calls today at eight hundred quicken or go to rocket mortgage dot com\nIt's in writing were dating compared to the public data records racial upheaval only balance or eight thirty approach of transactions called the confirmation conditions equal housing Leonard licensing office he paid ... thirty thirty additional conditions or exclusion may apply\nAnd Madison is doing arson as you do in our doing and we left wing mob and that's\nOver Congress don't get much worse I'm Wendy Rogers Republican for Congress running against tunnel how can be the deciding how to put Democrats\nBack in charge of Congress their gender repealed the Trump tax cuts for ... I open the border to stop the president's trained deal just dry the economy that need to teach Tom ... piece Kavanaugh and replaced the rule of law with my rule relief and ... and\nCame in and take a turning three hundred ... delivers a container to you take your time filling it up and possible drive it to your new place across the street or across the country or distorted one of your local secure storage center the smartest solution\nTo moving definitely pot now let's talk storage right now receive free delivery just mentioned promo free local deliver qualified to zero three five to eight thousand five zero three five to eight thousand or visit pods dot com bubble restrictions may have lived through the storage stores to require\n... hot moving and storage off [noise]\nUsed to live on the most essential information you know during the first\nMorning news whatever one CPA the case you VH Tucson\nABC News\nI'm Scott Goldberg at least six that so many explosive devices officials say have been sent\nTo a number of high profile political figures including former President Obama the Clintons and also to CNN offices in New York police worry more can be out there investigators have said there may be\nMore devices in the pipeline the bomb squads have alerted law enforcement partners about the similarities among the six devices because they want everyone to know what to look for the devices arrived in ordinary manila envelopes the package delivered to CNN also included a smaller envelope with white powder\nABC's air and gets her ski as investigators searched for whoever's responsible they say the devices were made to maim or kill ABC's pair\nWe don't have a viable these devices for but I can tell you this they contain explosive material that from the NYPD and the D.C police chief so whatever this is this person or these people who are sitting on these packages have access to explosive materials and it'd be treated\nIs she for so whatever this is this person or these people who are sending off his packages have access to explosive materials and treat it extremely seriously\nPresident Trump and the first lady's spoke at the White House this afternoon president\nTrump condemned the situation and promise jak\nThe full weight of our government is being deployed to conduct this investigation first\nLady Melania Trump also weighing in they cannot do they do scholarly attacks and Raul ABC News in Washington\nAnd Kentucky belief a multiple people have been shot inside a Kroger grocery store near ... Jefferson town police department says the suspect has been arrested it's still unclear what led to the shooting in North Carolina military Humvee fell\nFrom the sky it dropped into a residential neighborhood near Fort Bragg after falling from a C. Seventeen aircraft luckily you know it landed in the middle of the woods there so\nThere was no damage their private property and nobody injured Adam Luther with Fort Bragg public affairs on Wall street stocks of not wiped out all their gains for the entire year the Dow plunged six hundred eight points today than as ... NASDAQ dropped three hundred and twenty nine you're listening\nSilverado router implementing knows that you're home is your most valuable asset we wants to help you maintain that one was the last time your home how to check you maintain the health of your body let us help you maintain the health of your home coal Silverado router and plumbing and ask about our free hold inspection\nSix nights the euro zero zero zero one more six nine six zero zero zero zero\nTucson meals on what over for a one page UPA bullets flying Glenn an article last night officers tried to make a traffic stop looking for a person with a hospital selling you warn somebody started shooting from the car\nOfficers did not fire back after a short chase car crash in individuals in so I took off running three had been detained police are looking for one more individual nobody hurting at one Arizona's adopted new public school standards that include education about various world religions including seek isn't\nThere is a state board of education about sixty four Monday to a new social sciences in history standards\nThat would include information about world religions including but not limited to Buddhism Christianity Confucianism Hindu wisdom Islam Judaism ... towers him three in a way they'll development district is moving ahead with five new hotel projects\nIt will close the ... theater for about two years so hotel developers can build a new building next to it I might wrap you're listening to one of her one cake you G H your mid term election destination station\nWas April Madison seasonal high returns today with lots of sunshine mostly sunny and eighty one today and again for your Thursday just a few degrees warmer on friday that high pressure builds back in for the weekend we will see high near Ninety both Saturday and Sunday\nOvernight lows will be in the mid to upper fifty you can check first wondering whether anytime at Kagan da\n... ... ... when it comes to crime Houston cinema protests all at risk listen to Leo Arizona and speak out\nSprint Eighteen years and law enforcement on the streets risking my life here since ... poses a bill to increase penalties for finally assaulting law enforcement officers that put everyone in danger\nAnd the mind doesn't support I please\nCinema put our police at risk and it's a disturbing pattern animal radical agenda at the for our safety over and over again\nWas against tougher penalties for gang members involved and drive by shootings you send them out even support sanctuary cities that hand cut our police and don't let them enforce the law review aren't\nSilverado ruder implementing knows that you're home is your most valuable asset we wants to help maintain that do you when was the last time your home how to check on you maintain that all of your body will help you maintain the health of your home coal Silverado router and plumbing and ask about our free hold inspection\nSix nights six zero zero zero zero one morning six nine six zero zero zero zero [noise]\nUncle Sam is licking his chops right now he can't wait for you to retire because he plans on taxing you would have returned including taxes on your IRA and four one K.\nTaxes on your investment income taxes on your Social Security benefits and taxes on your state\nIt could be a field day for the government unless you take specific steps to protect yourself now\nLearn how you could save thousands of dollars in taxes with a free guide from Jeff broken off from your retirement planning and wealth management in Tucson Jeff's registered financial consultant certified estate planner and if a ... year with over twenty five years of experience\nTo get your free guide be one of the first time caller is now at five to zero to one seven eighty five Seventy eight that's five to zero to one seven eighty five Seventy eight\nInvestment advisory services offered to order investment Elsie and SEC registered investment advisor insurance and the new the products are sold separately to permit retirement planning and wealth management\nI might grab next time on two sons morning news are continuing conversation with Senate candidate Martha Mick Sally right here on on a four one K. cutie age your mid term election destination state [noise]\n\n\n[noise] your healthy [noise]\nRadio with addiction starts now\nLow Laura Ingraham show [noise]\n...\nThe price to pay my wife and I take vacations and we pay for our own vacations I didn't get anything in life for free I got it by working for it so\nIf the Congress men if they just think that because I have friends that have I don't choose their professions that somehow that makes me in some way or less than ... but then you pay for him that he ought to check himself for and why would they may pay for that you have your time I will take my because you won't answered I Want to save my life [noise]\nYou're listening to the Laura Ingraham show a five five forty Laura Florida it's probably the most important to say for Donald Trump and funny funny it's critical for the future prosperity of the country\nOr for a host of reasons which will discuss this hour and now we learn the truth about Andrew Gillum Raymond a rodeo is with us here on the lower ... shall we have a great line up of gas [noise]\nUh we're going to talk to our Karen ... Minnesota state Senate or she wants to take Franken seat\nA and a lot more coming up a Raymond is Andrew Gillum issue it's critical uh he he made that claim at that first debate against his challenger Rhonda Santa's congressman around that Santa suit must win is a must win this governors governors a ship and he claimed again he didn't get anything for free\nWell now let's play the follow up\nThe idea that I accepted a gift never came to me I'm\nA what I Try to do throughout this whole process has be as open and transparent and that can uh be\nI've served honorably respect the respect or to be a and have served my community without so much as a stain on my record or on my name until I decided to run for governor oh really\nWell the ... yeah\nOkay now the truth he's talking about a tickets to the Broadway smash Hamilton and also we'll learn more about trips or that he also took Raymond what is the real story here which is now just coming out even CNN all obviously wants them to win is smashing him on that said well because\nThere was a lobbyist involved in an Adam Cory who's a friend of this Gillum you know the mayor of Tallahassee\nIf I had customers just go to select blinds dot com the simple and smart way to get wants to get these amazing deals on blind shades and shutter shop today at ... dot com remember mentioned the lower income show check out using the dropped on many that's like blind dot com upgrade your home today at select blind dot com\nIt's time to join the millions of people using zoom video conferencing during any size coverage through puddle room or executive office into a new\nWave flawless HD video crystal clear audio and that wireless sharing it'll even work with your existing hardware store your meetings with a single touch or use doom new voice command feature ... started meeting huddle happy\nVisit zoomed us is that of your friends do room trial today\nThat little dot US ... view video conferencing imagining a better bank starts with looking at the savings rates most banks offering saying really\nCapital one is building something better you can open a capital one savings account with one of the nation's best savings range from anywhere like here for here\nOne of the nation's best savings raining opened on line at a capital one location or from anywhere and bats banking reimagining what's in your wallet and for consumers only offered by capital one and a member of the copyright twenty eight and capital one out of hand marriages\nOn ours on us and you don't get ... hour to an angry left wing mob and that's\nThink over Congress don't get much worse I'm Wendy Rogers Republican for Congress running against Tom O'Halleran ... could be the deciding vote to put Democrats\nBack in charge of Congress their agenda repeal the Trump tax cut ... eyes open the border to stop the president's trade deal just dry the economy then impeach tromp impeach Kavanaugh and replaced the rule of law with mob rule leased into ... and\nThere's some collateral damage\nFrom others who do not share our view well hell bent\nCollateral damage what does that mean does it mean you lose your job your home everything you've worked for just on the Democrats can push the radical agenda on America\nI'm Wendy Rogers I approve this message and urge you to merge straight Republican we can keep America great paid for by Wendy Rogers for Congress Wendy Rogers dot org\nYour mid term election destination station wonderful one kicking the sauce do talk\n[noise]\nCall Laura now one eight five five forty Laura\nWhen when they don't have\nNo one else is in the ...\nWe did go or a toughie Hamilton I did get my ticket for Hamilton\nFrom my brother up at the time we believe that they were um ah reserved or by friends of of Adam's Mike Miller a and when I got there after work I got my ticket we went and saw it a assume my brother or pay for it and so far as I Know oh that was the deal\nIran the venue the venue payday\nRaymond I Wonder what he said that I meet the press or was it at the debate\nWith what was that channel actually it was during a live stream that he was doing from Florida where he was like us explaining to his followers what\nWas it yesterday yes okay good story was blowing up and this is how he addressed it yesterday what what what is\nReal truth you align you're hurting Mike you mentioned Mike ... he thought Mike Miller reserve the seats and his brother got them and pay for the Mike Miller is the FBI agent posing as a real estate developer whom he had a text message we now learn from a lobbyist friend who said my\nAgent posing as a real estate developer whom he had a text message we now learn from a lobbyist friend who said Mike Miller and the crew had tickets for us for Hamilton tonight at eight PM awesome\nNews Gillum responded now he's trying to shave and shape the story to make it seem as if oh I thought he only reserve the tickets and my brother paid for them and just handed them to me well that this story is starting to slip and slide\nAll over the place of critical race for Donald Trump this is probably of all the races across the country it's the most important or the governorship of the great state of Florida because of its effect on the twenty twenty campaign and of course that Florida is a bellwether state\nFor where the rest of the country's going uh but CNN is even hitting at the FBI probes centers on whether developers successfully influence city projects at one point in the program undercover agent successfully infiltrated Gillum inner circle\nNo one's been charged with any wrongdoing and killings repeatedly said he's not the focus of the investigation but his attendance at a Broadway show with lobbyists and longtime friend Adam Corey along with his brother and a federal agent\nWho went by the name Mike Miller has been used by political opponents to suggest Gillum it's potentially under more direct scrutiny\nYou want to elect somebody who could very well be a ... down the road indicted by the federal government given this given this story this is getting worse he he could be under even even more criminal trouble let's check in first with chip Roy\nA there's an interesting piece in Politico meet the next Ted Cruz and November ... likely to be elected to Congress top House Republicans worry\nThat he'll be to the rights of the Freedom Caucus that's music to my ears a chip of courses are running into Texas a twenty first congressional district against Democrat Joseph Kopser\nHe's a former chief of staff to cruise and he joins us now chip without would check in your uh your up in the polls but you never want to get too confident uh how are things looking out there\nA lot of things from 'em all the you know we're going we're really great event yesterday was senators Cornyn ... San Antonio he's on the door or we've had a number of events for the governor\nAbbott and even my old boss Governor Perry came down to the vet and we've got a lot to do them out there I'll tell you it is Knight and day clip the Capitol hearing the ... ... people who are frustrated with the status quo in Washington how\nCompletely insane Senate Democrats aren't they know that if you want to go on what the house will look like look no further going to be sort of issue committees clown show a lost art\nOh well you see this the situation in Texas where moral Latino and we and Raman array of found this out when he went to the Trump rally or this week are a special correspondent there\nThere are so many Latino voters Latino Americans legal immigrants into the United states is and what are we doing this is just ridiculous they're all for Trump to offer crews and obviously they're all going to be voting for you are a lot of them are going to be voting for you why do they want to turn this country and the countries they left\nWell there's no of course that early tell you that the strongest advocates that I meet on the campaign trail and I caught up this district and all the taxes\nThe strongest advocates for border security are those immigrants who come here whether those are not particularly static in Texas or come here legally they know what they've got you know determine what was what separates\nFrom places like Mexico and Central America and there beside themselves to see what the Democrat Party in particular and frankly some Republican or\nA supplement to their their beside themselves what they want to do to this country and so they look the message of order security strong immigration standing up for our country is selling well and by the way up\nTo ... months for immigrants that we have a secure border I'm tired of watching this girl was gonna\nUntreated selling well and by the way up to ... months for immigrants that we have a secure border I'm tired of watching this girl was sold as a sex trucking industry riding on the topic train cars Bob's dying it doesn't work you your base are sovereign ...\nShip a we know you're going to do really well uh and we know that uh you will be a force for law and order less government a smart fiscal policy deregulatory efforts where we need to deregulate and we can never let\nTexas ever let Texas go blue\nBecause Texas just like Florida I'm Talking about this Andrew Gillum isn't here isn't here and then he has a story to tell jokes ah but you know we both states are critical I mean all states are important but the the left has taken over California and we see what the result cannot let this happen cannot let this happen on Texas or Florida\nThat's absolutely right as Texas goes so goes America you're absolutely right in Florida was much better shape and they really\nNeed to get that election rock riding and I'm I'm quite sure hope will they will but also a say this I Can't bake to adopt\nGrabbing Christian Vargas on your show the other night or on a on Fox and for being a champion for that family of what a wonderful family who obviously lost a crust allows her nephew um or even just lost her son Jared ... in June they live in a round like just for a while but working hard of ever happen\nThere that's a great family and a thank you for highlighting Betty just standing up and willing to say that they want to just mean strong border security and the rule of law being reestablished on a ...\nAnd they said the Vargas family told us that you were really the the one politician who came out and really gave them support they heard nothing\nUh from the Castro brothers zippo from them including walking Castro who's a congressman from that district her nothing from so chip thank you so much I Know you're going to do fantastically well and we can't wait to interview when you become the next Congress men from the twenty first district of Texas so we've come on come on the show after you win\nObviously why did too I really appreciate everything you do and we can commiserate I'm also a University of ... uh but I Know you went to law school there so we can we can talk about our great Charlottesville is\nBut our I Walk a lot of you All right we're going to take a break on the lower income show a lot more to get to a care and housing up next\nIt's your last week to get the Gen you sell sunspot correct or for free for sunspots age thoughts and even read inflamed patches Renee from Boulder, Colorado raving about the brand new Gen yourself sunspot director she says it's her go to product every day she has sunspots an age spots can definitely see a difference in her skin since using it\nUh in one of the most beautiful states or one of my favorite places this Minnesota a car in a joins us now the races pretty tight uh the latest real poll shows that the Democrat is up\nI'm about six percent\nAnd I think that is within striking distance no doubt about it a car and it's good to have you with us how are things going on the trail\n[noise] ah it's gone just great Laura thank you so much for having me and yeah we have closed the gap in the cold that when you're speaking out was done by our our Minneapolis Star Tribune which we sometimes called the red star\nA and that one had the damage it fixed and then the one before that another Democrat or happy down three [noise] so it is going really well we are getting throughout the state and meeting ... talk and had a big debate the other night only state wide televised debate and my opponent I chose not\nTo show up the only Democrat who didn't show up for the debate\nWell how\nHow would that be even possible I mean the Democrats have made some fairly significant headway in in\nA both the Senate seat since Norm Coleman and\nUh since uh you know we've lost the governorship plenty and then he tried to run again and he he got a defeated obviously I'm In his bid for the Senate ah but where where are we now and trying to\nAnd trying to rebuild the Republican Party in that state Minnesota's economy has been doing so well and the Trump era of just two years we've seen a massive ah uptick\nIn the states productivity this is all positive why would people want to vote against that now\n[noise] or they doubt out we have or Minnesota is turning\nOpposite of why would people want to vote against them now\n[noise] or they don't ah we have a or Minnesota is turning red across the whole state people are feeling it they're happy with the way the economy is going and I think Tina Smith didn't show up with a debate the other night because she didn't have any answers to this and where she stands on the issue she's so far\nLeft and so extreme and and part of the resistance and obstructing everything good that is happening on the ground a and then she's also\nA for open borders and she wants to Minnesota to be a sanctuary state and she is directly tied to Keith Ellison still continuing to campaign with him\nYet uh being as hypocritical as as they are she's again you know wanting to impeach uh Brett Kavanaugh justice cabin on called for another investigation so Minnesotans are are\nSome of the most well educated people when they go to the polls we don't have to register Democrat or Republican were free to move without the cabin when we go vote and they do their research and and uh we have some of the ... we have the highest turn out\nIn the country when it comes to voting and so we go educated so it was really disappointing that Tina Smith didn't want to debate may or at least tell the people of Minnesota where she stands on things because she knows that's not what's resonating on the ground\nWell a Speaker Ryan Paul Ryan was in Minnesota uh yesterday and warned or the day before yesterday was warning of a\nGreen wave of democratic fundraising in a visit to drum up support for uh some of the house candidates ... and Jason Lewis and there are there are two of the more vulnerable in our house candidates I'm but I'm Ryan said there's an enormous amount of Democrat money flooding the state\nUh last week Gabby Giffords came and did a a star turn there for some of the Democratic congressional candidates are and they they believe that if they can fully turn Minnesota blue then that will be another blockade for a Trump and twenty twenty\n[noise] uh and and it's not happening I'm not feeling it anywhere even in the primary what happened to your ... so we go for it happened we could have told you what was going to happen um\nMinnesota is definitely turning red we flipped our state house in two thousand and fourteen to Republican our state Senate in two thousand and sixteen oh we've got up on the iron range which has voted Democrat for more than sixty years is now going to flip Republican we've got a great candidate up there and he's plus Fifteen\n... all of the rural areas are farmers are really on board with what the president is doing finally somebody is fighting for our farmers and putting their issues at the forefront of a campaign so\nIt's all it's all the the uh of fake media and their rhetoric and talking about the blue wave and it's I'm\nNot feeling it anyway and that's just me not just me as a candidate I really am not when I'm traveling throughout the state there's a lot of energy behind the president and and even when he came for the two rallies he's already done to rally this cycle here in Minnesota\nThere's a lot of excitement for my campaign and for the the rest of the candidates throughout the state\nOur current housley it is a fantastic to have you on a ... everybody needs to get out there and vote because the woman who was appointed Tina Smith\nOr even worse than Al Franken if you can believe that and she you know she uh obviously you know banks that she'll be able to just snuck or the Minnesotan voters for more liberal policies in open borders forget it ... the last thing the Minnesotans need our pilots\nVoters for more liberal policies and open borders forget it ... the last thing the Minnesotans need our politicians in the state\nOr in a a senators representing the state who believe that they need more regulations on the small business owners and more problems for the medical device manufacturers who have done such a great job\nTo ... to reinvigorate the Minnesota economy after the uh the great recession so care current house has got to win the seat that would be phenomenal news\nAs we march or even after this election toward twenty twenty I think Donald Trump can win twenty twenty and twenty twenty Minnesota He he didn't win it last time around but he made a met valiant attempt at the very end to try to pull out a victory\nA car and thank you so much best of luck in that race or for that Senate seat a that was vacated by um the grope or Al Franken All right we'll take a break eight five five forty Laura we have a lot more to get to a this Andrew Gillum Rhonda Santas debate tonight is going to be critical\nOf by the way oh by the way there's a story I forgot to I was going to mention the current Mexican man admits faking his own kidnapping in Saint Paul Minnesota to gain a visa\nAuthorities say a Mexican immigrant in the United states illegally was bound with duct tape and less near Randolph avenue and as part of his own kidnapping ruse to try to fraudulently obtaining a visa designed to help crime victims or I've heard of all\nYou want to let them into the country at this point because it's such a clever little Ruth creativity yeah I mean could need\nAlexandra Matteo Cortez forty six admitted to carrying out this game when he pleaded guilty and us district court in Minneapolis this week on one count of visa fraud and second kind of illegally entering the country\nAt his plea hearing Cortez confessed conspiring with his nephew of course born in the United states birthright citizenship or between April ever the August twenty nine to fix his own kidnapping in order to\n... it's called a huge non immigrant status visa for victims of crime that takes what's the word torture day for the kick in Spanish that takes the cake that takes out told us that you're listening to the lower income show stay there\nWe are going to work we are going to fight and we are going to win win win [noise]\nThe Laura Ingraham show [noise]\n\n\nTimeshare honors maintenance fees will be due sooner than you know it and if you want out of your contract for the next set of fees contact resort released today\nAll it takes is one simple call for a free consultation and a free quote pick up the phone and call resort release at eight five five sixty six Laura that's eight five five six six Laura or go to resort released dot com\n[noise] you're going to be maintenance free time share free with the help of resort release so get out before the next round of maintenance fees are due and start saving for a vacation you really want to go on [noise] resort released had the a plus rating for the better Business Bureau now for six years\n[noise] you're in great hands with my friends that resort release dot com [noise] put an end you're timeshare contracting the stress of paying those maintenance fees called resort release at eight five five six six Laura that paid five five six six Laura or visit resort release dot com today\n[noise]\nExplore that paid five five six six Laura or visit resort release dot com today\n... ... ... ... when it comes to crime Houston cinema puts us all at risk listen to Leo Arizona and speak out\nMy strength Eighteen years and law enforcement on the bridge risking my life here since ... pose a bill to increase penalties for finally assaulting law enforcement officers that put everyone in danger\nHere since in the mind doesn't support or please cinema put our police at risk and it's a disturbing pattern animal radical agenda before our safety over and over again\nShe was against the tougher penalties for gang members involved and drive by shootings you cinema even support sanctuary cities that hand kind of our police and don't let them enforce the law reviews aren't just radical\nDangerous reject the cinema radical agenda puts us on the ranch\nOf the main point is responsible for the content of this advertising not authorized by the candidate a cat it's W. W. W. dot ... dot org [noise]", "show_name": "The Dave Ramsey Show", "year": "2018", "city": "Tucson", "day": "24"}