{"month": "10", "state": "AZ", "station": "KAWC", "content": "A service of Arizona was in college more than forty five years this is Katie WC Yuma cage W ... eighty nine of spam and K. E. WC dot org NPR News for the Colorado River communities of Huma ... counties\nIt's mostly sunny in Yuma today highs reaching up to Ninety five degrees\nPartly cloudy skies in the evening with Lowes expected up around sixty eight degrees in Parker sunny skies in the forecast for today highs reaching up to Ninety four partly cloudy skies expected in the evening with loads up around sixty five degrees thanks for listening\n\nOr\nDon't want them to the global knowledge I'm Chris Hi\nDoes that mean the global village we travel to Cuba these small island nation has an amazingly large array\nOf styles and rhythm to music and also a long long line of impressive musicians who have come from that country urban influenced by it and we'll hear traditional music contemporary sounds ex pats and other artists from around the globe who have drawn on Cuban influences\nAnd there were so we'll get things under way with the music from a group that shouldn't things up in the eighties in America when they made an appearance at the Newport jazz festival this music from ... to ... as we begin this visit to the global village [noise]\n[noise]\n[noise] [noise]\nAh ... [noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nFact\n\nNo no no\nNa na na na na na na na na na na na na na na na na and\nIn and\nAnd the\n\n[noise] when I was going on in the\nBook to go to the pool to\nThe jumble a brass band illustrating musically there is some of the connections between about ... and New Orleans savannah to New Orleans is the name of an album that they did stand there from it we heard ... and we're beginning they were there it was a member of the group it a kitty\nAnd since going on to quite a stunning solo career we heard the title track of one of his album savannah cafe it coming your way here in the global village and crew time we spend a little bit of time in Cuba and in a Cuban related sound this time around to and we mentioned earlier the music of any kid and would have\nA profound impact they had when they appeared in the U.S at the Newport jazz festival a generation they had and the group point of is that social club had a similar impact reminding the world of the great musical riches of Cuba\nAfter a quick break well here's the music from guitarist ... who's worked with point of this that social clubs also been part of\n... which traces its history back to the late thirties was a member of that the afro Cuban Project that actually was the\nOriginal idea for the brain of a social club bringing together African musicians and Cuban musicians and it's also headed up his own groups we will hear him with a master guitars stand also an instrument maker by the name of ... from Cuba to giants\nOf Cuban music and that one that they did together and we'll hear some music from it will move back in just a minute here in the global village\nThis is Kate WC you can learn more about it or leave us a comment at Facebook dot com slash AWAC radio thank you for listening to global village AWAC is\nCalling their arts program will be having for dinner offerings of the fall semester the next meal featuring Italian Night with also bucco will be served Tuesday evening November six six meals are served in the learning resources building on the campus room a law one oh nine tickets are available through the ABC business office\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and rebuild publications in the world joined K. A. W. sea and retired Arizona highways publisher when hold and at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center\nFor information visit K. A. W. C. dot org ... made possible in part by a grant from Arizona humanities [noise]\n\nYes indeed little thing they called ... redoing the saber dance their class brothers and Cuba repercussions from classic meat Cuba to\nAs a the title suggests they had to go where the friday a familiar classical pieces dotted with some\nCuban rhythms and percussion to go along with it it gets down to shed a neat little thing from his brother Sandy Cuba percussion we also heard the bagel Valdez trio and so what a trail that was ... Valdez on piano he led a famous orchestrate the\nTropicana in Havana and the era when\nA that was the uh the hot spot to go to all over the nightclubs in casinos in such that were in Havana at the time and\nA lot of music going on to a lot of American artists that would go ... that's actually would say I work with a number of them and even record with a Nat King Cole was well\nEventually I left Cuba headed to Sweden but anyway he's or on piano on base the legendary bassist chow\nWho helped to create the style of music notice mambo and also a pioneer in the wet and jazz jam session or discard he do would leave Cuba and has actually yeah make his home in Miami also leading Cuba master percussionist Carlos the Taco Bell that's\nAh he rounds out the trio on this release called el ... del ... and we heard a medley ... from that release\nDoubt the trio on this release called el ... del ... and we heard a medley ... from that relief wells are the effort Cuban all stars\nThis recording that was done right around the same time actually is the original point of is that social club project and some of the members of that group or part of this project is well a total of ... the name of the release and we heard appeal mentor also from that\nAnd we started with ... show of who's worked with one of his and also another master guitarists sell a hundred ... a project they did to get a call two giants of Cuban music and from that we heard all sewn into Chico it come anyway here in the global villages were highlighting\nSome towns from Cuba this time here in the global village in Cuban music had a huge influence across Africa and I helped\nTo influence the style that came to be known as ... Roomba what are the master groups continued on or capture a free the Internet's you know we were to music from an album they did call Melanie went back and just a minute right here in the global village\nAnother mass shooting has shaken the country this time a gunman target worshippers at a synagogue in Pittsburgh\nThere is no place in America\nOr anti Semitism we will\nBe broadcasting from Pittsburgh with all the latest on the shooting that next time on all things considered from NPR News\nStay with us for all things considered coming up in about twenty minutes on key WC eighty eight point nine F. M.\nK. WC is supported by Dr Cheryl how go in the team at desert veterinary clinic advocating for pets like there are people to have their own family doctor regular wellness visit and preventative care help promote lifelong health and for dessert veterinary clinic nine nine five south Fifth Avenue and by phone Seventy three five zero one zero\n[noise] and [noise]\nNa na\nNa na hey\nNot married now\nMom", "show_name": "Global Village with Chris Heim", "year": "2018", "city": "Yuma", "day": "28"}