{"month": "10", "state": "GA", "station": "WNGH", "content": "Saw two underneath my\nHave\nMade him says it's yo\n[noise]\nNinety seven point seven FM W G. P. B. S. W. A. G. P. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nToday in Studio three sixty\nThe term that now in ... fantasy and science fiction and\nAll the adjacent fiction\nI have never written science fiction writers like Harlem Ellison for instance like calling Agatha Christie or railroad writer because she wrote murder on the cat I coach\nPlus my interpretation of Islam be our backs everything that you've suspected that is true which is that your friends your family and everyone in the community is a monster who wants to give you [noise]\nWhen the superb speculative fiction writer ... Whitehead tried his hand at full on horror\nThat's all part of the studio three sixty hour about various kinds of non ... right after the\n\nBlock from NPR News in Washington on trial Snyder President Trump says he find Saudi Arabia's explanation of what happened to the Senate journalist ... incredible\nAfter denying any knowledge of what happened to catch show gee the Saudi officials now say he was killed in a fist fight temp ears Tambor Keith reports on the president's reaction\nPresident Trump said the Saudi announcement about ... death and the arrest of Eighteenth suspects was a good first step Trump also praised the kingdom for moving\nTrump said the Saudi announcement about ... death and the arrest of Eighteenth suspects was a good first step Trump also praised the kingdom for moving faster than he expected\nOr they have been our ally we've had great relationship should and this is a little bit a\nBit as I've gotten a notice\nAs for what to do about it Trump said he would work with Congress one of his allies in Congress Republican Senator Lindsey Graham sketched out they're shifting narratives offered by Saudi Arabia and said it's hard to find this latest explanation credible camera Keith NPR News\nThe president has another campaign rally on his scheduled today the rally being held in El Paso Nevada and supportive senator Dean Heller he is considered one of the most vulnerable Republican incumbent polls are open in Afghanistan were long delayed parliamentary elections are underway and upper class has more from ...\nPercent voters are casting ballots and then a high school that beep as fingerprints being taken a last minute addition to these parliamentary elections to help ensure the vote is fair but there are ... some polling stations are experiencing technical difficulties\nUntil a bulky says here they're having problems locating the voter list with first names beginning with a\nI wake up at six o'clock in the morning I was too much and you know motivated to go and lost my wife\nLooks nine o clock and nothing has happened yet [noise] discouraging you know\nBut he and other Afghans here say they're determined to vote despite the difficulties hundreds waited patiently airline security is tight the Taliban at Islamic state has threatened the election for NPR News I'm Jennifer glass in Kabul\nPresidents Guatemala and Honduras due to me today to discuss the migrant caravan heading towards us James Frederick reports from Mexico the Caribbean is not turn back to spike clashes with Mexican police on a bridge that separates Mexico in Guatemala\nTo bridge connecting Guatemala and Mexico is now a makeshift refugee camp felon rain came pouring down most of the thousands of migrants in the caravan stayed on the bridge while some returned or bought a mall in search of water food and medical attention\nNext steps for the caravan are unclear but Mexico's human rights commission says migration authorities would be slowly letting women and children into the country at least one hundred and fifty had been allowed into Mexico and taken to shelters so far authorities say they will continue to gradually allow people across the border\nAs long as there requesting asylum in Mexico\nThere is so far authorities say they will continue to gradually allow people across the border as long as there requesting asylum in Mexico for NPR News I'm James Frederick in ... in Mexico and\nThis is NPR News stocks put it in a mixed performance at the end of a tumultuous week Steve Beck no reports of Dow Jones industrial throws a quarter of ... percent the NASDAQ Composite fell nearly half percent and the S P fell\nSlightly concerns about Wall Street complacency has been replaced by extreme volatility trade\nTensions interest rate fears and geopolitical worries have combined unsettled investors and offset strong economic and corporate earnings reports it's not just of domestic phenomenon foreign markets had been hit\nBy financial problems in both emerging market and industrial countries like Italy after plunging last week the majors dog ages rallied on Tuesday the Dow Jones five hundred and forty seven points but those gains were largely last leaving the Dow of just four tenths of a percent for the week\nThe S. and P. had a slight gain but the NASDAQ fell two thirds of a percent for NPR News I'm Steve back\nNow and major league baseball the best of seven series for the national league pennant is going to limit the Milwaukee Brewers forced to nights decide or with a seven to two victory over the Los Angeles Dodgers last night the winner of tonight's game will move on to the world series against the American league champion Boston Red Sox\nAnd not manned spacecraft has begun to seven year journey to mercury was successfully launched last night from Europe space sports infringe piano the mission is a joint one between the European and Japanese space agencies and\nIf successful would only be the third to study mercury up close um trials Snyder NPR News from Washington\nSupport for NPR comes from Conrad in health and foundation supporting shining hope for communities the Tony Eighteen recipient of a Hilton humanitarian prize nomination information for twenty nine team is a Hilton foundation dot org slash price and the any EKG foundation\nSupport for city essay sixty comes from ... European made to language learning program adult teaches practical conversation in Spanish French German and other languages and the elderly and the app store on line at B. A. P. P. E. L. dot com [noise]\n\nYes and they held all in the app store or online at B. A. B. B. E. L. dot com\n... sixty and I'm sitting on the steps of the Lincoln Memorial levels are the most generous vegetables I like\nTo have the roast chicken\nAll about timing I tried to get a little bit away from the actual\nDuty as very steak is good and\n[noise]\nIt's been said the science fiction and fantasy are two different things on\nThe line separating fictional genres can be blurry is rod Serling noted on the twilight zone in Nineteen sixty two\nScience fiction the probable made possible fantasy the impossible my [noise] what would you have if you put these two different things together [noise]\nWell what you have is speculative fiction it's an umbrella term that's kind of taken off during the last couple of decades lots of writers and readers prefer it to the older narrower genre definitions that encompasses not just I buy and fantasy but magical realism horror\nCounterfactual history dystopian fiction anything not strictly normally realistic Harlan Ellison wrote speculative fiction across a sixty year career publishing more than Seventeen hundred short stories in his lifetime\nHe also wrote novels such as the post apocalyptic classic a boy and his dog\nHe also wrote movies end worked on a lot of the TV shows I watched growing up such as the outer limits and the man from uncle he dreamed up the city on the edge of rubber which was the star trek episode about time travel to Nineteen thirty in New York that may be the best of the original series [noise]\n[noise]\nThe mental she died a few months ago age eighty four\nSpoke to him back in two thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and the in Harlem\nTwo thousand eight when he was the subject of a new documentary called greens with a sharp teeth I gave him a long Folsom introduction and then Harlem fucking studio three sixty\nI'm quietly humbling proud to be here a guy that did you you forgot to mention I'm a snappy dresser and a good dancer\nChristian there and is the actor who played the only completely likable character on game of Thrones but what he really wants to do is play dance music channel\nOutdoors speaks that's next on studio three sixty [noise]\n[noise]\n[laughter]\nBang bang\n\n\nBang\nSupport for studio three sixty comes from ... a language that teaches real life conversations in a new language like Spanish French and German apples ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot com\nMinute lessons are ... are online at apple B a B B. E. L. dot com\n\nIn this hour a studio three sixty we are exploring facets of speculative fiction psi phi fantasy or\nAnything otherworldly\nFans of the novelist George R R Martin have been waiting seven years for the next presumably final installment of his fantasy series a song of ice and fire that idea a multiply novel series never sat well with the consistently productive and considerably more concise Harlan Ellison\nIt only took dust I ask you one book to do crime and punishment why do these blow hards these bloated dating nit which need six books to talk about dragons\nBelow ... are not Martin those series of novels and its TV adaptation game of Thrones\nThe most popular fantasy franchise this side of middle earth and Hogwarts one of the most popular characters on game of Thrones was played by Christian they're such a perfect name for an actor and a medieval fantasy\nIt was the difficult part because he only spoke one word and had to use that one word to express everything panic anger confusion joy and two thousand Fifteen our colleague Sean Ron U.S foreign talked with him about playing maybe the oddest big role in big time TV history\nI'm Christian there and and I'm an actor a DJ um best known for my real probably in game of Thrones and who do you play a GED I play ... or you just want to hear me say that\nEven if you've never watched game of Thrones is a fair chance you heard of hotel where he stands out because he's really big he's really lovable and he only says one thing\n\nThe one dimension analogy of hold or makes him really valuable as locking hardly talking mean and the Internet has a ton of fun with them even search engines get it on it when you Google hold or the official Google Search results just say hold or over and over like forty times hold or had no idea it says something if you Google\nYeah desire but if it's it's bizarre that that's a really ...\nHold or had no idea\nIt says you can Google did it [noise]\nYeah I mean ... it's it's bizarre that that's a really take these affair\nI Googled the idiom takes me to the fair but my results were inconclusive outdoor belongs to a special league of TV characters that have found like far beyond their TV worlds online it's him that sailor moon the entire cast\nTo the office their gifts in super cuts in means for days dedicated to these people just imagine how much power wheeled when you're one of the most beloved characters on the most pirated TV show in the history of the universe the Internet's favorite TV show\nQuestionnaire is well aware of his\nUnique position and he's using it to promote his other passion is really into [noise]\n[noise]\n[noise]\nBecause you can't stop and won't stop either one not the hold or not the house even if everyone's constantly second guessing his true love\nWhen I first started acting um people would people ... are you going to do this you're you're you're a DJ you know how you're gonna act you don't know how to act I'm a\nCrucifix guys German some credit do I want dramas I wanted to draw on college zoom in and I know how to do is they are so hard to prove himself and then after this is a sort of like yesterday's diGenova is one of the celebrity bee Jay's harshly they tell you when you're an actor I'm a\nReally [laughter] I don't I don't want to do this all over you continually proving I can do things right I'm not just a one trick pony [noise]\nUm about um I live in Belfast still okay and where do you do most of the shooting for the show ended office is that how it happened you were there and you say oh no no I'm In a you know just in for a movie called ... park\nSo just by provided was a ... maybe five or six years later I got this round them coal want me to do that one tip 'em a part of the passenger actually just couldn't imagine that everybody else was part and like what does he mean to you now that you've done it for four or five or ... yeah you know I'm I like the guy that was the other person I've talked from a descriptor\nPart and like what does he mean to you now that you've done it for four\nOr five of his or her friends yeah you know I'm I like the guy I was as a person of a bit of talk from like a script to a [noise] a Muslim is not my life so like when the show ends you'll inevitably start to miss him well yeah of course I mean I must have last year wasn't Mr costs you ...\nWhat does it smell like death [laughter]\nSells them if ... corpses [laughter] it looks fairly comfortable album out bad is it the first one is that like can you describe but the cost to the edge\nAnd speck of will which was horribly warm in the first is that a season three you'll see a slurring Roberts [noise]\nGetting around that so yeah I just signed\nCivil ... [noise] I Know [laughter] we'll odds Seventy dead rabbits\nDo those claws I'm almost visit at the end of his journey yeah I'm like you have to do this yourself a little guy yeah I Can't help it anymore and that was really emotional for me it was almost like the tribes do yeah yeah yeah\nUm if if the producers of the show the writers of the show came up to you or George came up to you and said hey you know we really want to know since you've been body this character so well what would you like to see happen in season six is is there something in the back of your head that you really love to to see happen trout are um\nI use it as a holiday [laughter] some sort of a treatment those boxes so if you could ask for something more practical is there something [laughter]\nI just thought you like to know about ... will not have a little bit more of a his past yeah why why he'd only says that when we're there\nOf always wanted to them [noise]\nThat Christian there in talking with Sean ... I'm In two thousand Fifteen since that interview originally aired game of Thrones viewers did learn why hold or only says that one word in one of the most memorable and reliable moments the series\nGoogle thing does not work anymore\nAnd ask for our students we sixty alumnus Sean ... these days every day you can hear him on today explain the Fox news cash\n\nWhen I was growing up in the Nineteen eighties was seen as a girl and treated as a girl and it didn't really matter to me\nMm\nWhen I was growing up in the Nineteen eighties I was seen as a girl and treated as a girl and it didn't really matter to me\nI was in ... I just thought of myself as a kid\nHaving her card is a writer who lives in northern California\nIt was only one I started getting closer to puberty when I started to realize that I wasn't like other girls\nShe recently wrote about his childhood for a future in slate magazine called spark notes which is about people's light bulb moments of sexuality\nI wasn't allowed to watch much t._v. so books were at the center of how I saw the world and of course also how I saw myself\nThere were books for girls that I tried to decipher like alien hieroglyphics trying to figure out how I was supposed to be in the world\nOkay when it gets so hideous Jessica Wakefield grown do remember the sweet Valley High series of books\nShe Lyndon ... bedroom near as her twin sister Elizabeth rolls her eyes seriously ill is it's like somebody snuck into my room last night and whacked me with the ugly sick\nThat's next on studio ...\n\nIf you or your loved ones were affected by hurricane Michael food and water are available at multiple distribution points across south west Georgia a full list is available at ... dot Gov\nDisaster recovery centers are open this weekend and Doherty early Miller and seminal counties representatives from the state FEMA and the U.S small business administration will be at the centers to help residents through the disaster assistance process and answer any questions\nFor times in locations visit ... G. A. dot Gov the quickest way to apply for federal assistance is on line a disaster assistance dot Gov or by calling eight hundred six to one thirty three sixty two survivors and Baker Decatur\nDoherty early Miller seminal Chris Grady lead Michel ... Thomas and worth counties are eligible for disaster assistance through FEMA\nThose survivors should file claims with their insurance companies burst then visit disaster assistance dot Gov if you need help with debris clean up costs\nAre eligible for disaster assistance through FEMA those survivorship file claims with your insurance company's first then visit disaster assistance dot Gov if you need help with debris cleanup contact crisis clean up at eight hundred four or five one Nineteen fifty for\nSupport for city a three sixty comes from battle a European made language learning program battle teaches practical conversation in ... Russians Swedish and other languages available in the app store or online at B. A. P. P. E. L. dot com\n[noise]\nBook\n[noise]\nMost of course in white heads novels are speculative fiction the mega genre encompassing psi phi in fantasy and other non realist fiction of various times\nHe won the Pulitzer Prize for the underground railroad is great counterfactual historical novel about a literal underground railroad me sometimes writes fiction that is decidedly hope here\nInto doesn't love and eat published a novel about zombies called zone one end zone one is not some post modern take on the horror genre is smart and funny sure but it's also the real deal brains are eating and living go to war against the undead [noise]\nWhen's on one was just out I asked ... joined me for a live studio three sixty show [noise]\nSo uh so howdy I'm the only one takes place or after the end of the world people are pretty much bummed ounce or more than\nThey're walking around with P. A. S. D. or post apocalyptic stress disorder\nUm and when they get really found out that can look back upon last night the last night in the world before everything became really horrible and Mark Spitz are protectionist I'm not the actual Mark Spitz is an ironic nickname was [noise]\nUh is thinking about his last night's story [noise]\nWhen he was six he walked in on his mother and getting his father oral pleasure public television program about the precarious and this of life and is Aaron Getty glimpsed in passing had introduced him to dread and it had been eating out and the previous few nights\nBad dreams they hiding as entertaining\nThe need is needed to slip into his parents king size\nEating at him the previous few nights bad dreams they hiding as entertaining [noise]\nShe needed needed to slip into his parents king sized bed have you had when he was very young before even he had been banished to his own big boy dead in accordance with the latest child rearing philosophies and it was forbidden\nBut he decided to visit his parents he patted down the hall pass the green eye of the carbon monoxide detector that ever vigilant protector against invisible evil and the bathroom and linen closet he opened the door to the master bedroom and there she was gobbling up his father [noise]\nFather stopped his unsettling growls and shouted for his son to leave the incident was never referred to again\nAnd it became the first occupants of that corner in his brain attic cut he reserved for the great more vacations [noise]\nThe first occupants but not the last [laughter] it was naturally to that night his thoughts fled went on his return from Atlantic City on last night he opened the door to his parents' bedroom and witnessed his mother's grizzly administrations to his father was hunched over in\nKnowing your way with ecstatic forever on a flat but his intestine which in the flicker of a television adopted a phallic aspect [laughter]\nShe thought immediately when he was six not only because of a similar tabloid before him but because of that tendency of the human mind in periods of duress to seek refuge in more peaceful times such as a childhood experience as a barricade against horror\nThat was the start of his last night story everybody had one [noise]\nFreud called it the primal scene you you you have one up Freud [laughter]\nWell yeah I mean he didn't foresee the zombie epidemic or zombie plague working with what he had any in somebody else's yeah um I guess I have that in my\nCorner there you go so you're a MacArthur foundation's genius uh and now you're now you're characters are eating each other's Poland's um\nHow did you end up a writing or a novel\nI how much of a choice I was a bit of a shutdown as a kid or other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits and reading Stephen King\nSudden as a kid uh other kids like to go and leave their houses I send my afternoons watching the twilight zone and the outer limits and reading Stephen King and it's got to college I basically wander rights to black shining the black sea ... if you took any Stephen King titled put the black in front of it that's why I wanted to do\nSo for me I always knew I'd write a horror novel eventually and I'm from watching zombie movies as a kid I'd ... I'd ... dreams for the last Thirty years and I had one that led to the idea for this but really [noise]\nUh yeah well some normal people had anxiety dreams about being late for an exam or they had in a prepared for the big presentation\nCity escaping thing I I've had but specifically escaping zombies\nOh yeah they're fast or slow they talk they get me or I scape um this is my life and actually I'm since I've been on book tour people have come up to me and said like I have zombie dreams to um [noise]\nSo maybe a support group is in order um [noise]\nThe idea for his own one came 'cause uh I guess the summer of two thousand and non at house sketched out among island and uh [noise]\nUh is it the house has very thin wall and you can hear everything that happens or that woke up one morning they're laughing and playing and I was a bad mood and I just we want them to go but you can't really say that to your house I guess I'm\nA it's a no sex house which I Try to tell people before they come out because you can hear everything you can keep on your shoes you can smoke but just don't have to say yes to spare room is available or no sex house and you bring corn or will put on the grill [noise]\nI still I heard them laughing\nI didn't I couldn't join in because I was sort of in a depressive episode and so I Will myself back to sleep and had a dream that I was in Manhattan that's why I was a dream in Brooklyn um [noise]\nAnd I wanted to go into the living room but I wasn't sure if they have swept through zombies out and then I woke up and it was like that's a real consideration after the apocalypse how do you get rid of the zombies they they stick around like bad house gas and that became a book gotcha [noise]\nI I I remember a decade ago when my children were small and and just being amazed that they both as six eight nine year olds completely we're familiar with ... zombie political like what killed them what didn't kill them how they lived and how they got that way\nThis six eight nine year olds completely we're familiar with ... zombie political like what killed them what didn't kill them how they live how they got that way and I didn't understand how this information had propagated into my you know little kids'\nBrains ... why is why didn't zombies do you think the last whatever decade or so become so interesting to them to you to the world when\nI was writing about two years ago my daughter was like I Know zombies I've seen Scooby Doo and she thought that I should I should a\nTitle my book a wake up the undead army um which was you know longer than zone one um I can only talk about my weird orientation and mine's rotation of the ... is that everything that you've suspected is true which is that\nYour friends or family and everyone in the community is a monster who wants to eat you\nThey've been pretending for decades um biding their time and then one day you wake up and they want to your face so that speaks to my sort of Freudian troubles I guess um and that's what ...\nAnd ... it's a best seller now the highest amount of them there you go your parents I'll let you watch Georgia where they they let you do what you want it in terms of cultural menus will if you\nAllow your kids to go to crazy ideas and rent the big stack of beta max uh tapes every Friday you don't have to talk to them so um\nWe were allowed to see any kind of R. Rated movie I saw ... orange and I was like ten and I remember as a family a heaping and home and I remember being like mommy what's happening what are they doing to the woman and her being like it's a comment on society and um\n[noise] uh\nIt'll actual parents [laughter] so I think it's you know it's it's\nDuring my work and I think it helped even though it was not particularly appropriate", "year": "2018", "show_name": "Studio 360", "city": "Chatsworth", "day": "20"}