{"month": "10", "state": "AZ", "station": "KAWC", "content": "This is eighty eight point nine ... a double you'd see humor K. A. W. P. Parker and K. A. W. ...\nIt will be tomorrow in the morning from ... pm at the ... west woodland park which is located at two two zero zero water street in Yuma\nThis is eighty eight point nine F. M. K. A. W. ... K. A. W. P. Parker and K. A. W. C. dot org a service of Arizona western college more than forty five years trusted news for ... and the ... counties\nIt's five o'clock NPR headlines is up next followed by MORNING EDITION\nBit breezy today in Parker's sunny skies but the high end you're eighty eight someone gets up to twenty miles per hour\nMostly clear in the evening with the low around sixty four and humid today it's sunny skies a high and you're eighty eight someone goes up to twenty miles per hour during the day mostly clear in the evening with the Loeb around sixty eight some north winds of five to ten miles per hour thanks for listening to\nMorning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't by coming out\nOr mid term voter series shifts wet food here from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those she hasn't boys should be allowed to stay at a wealthy entrepreneur on why he's left the G O P after voting for Republicans turned and\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan Harlem entry elections\nViolence means some hard\nIt is friday October Nineteen actor\nSeventy three the news is next\nLine from NPR News in Washington encore of a Coleman President Trump within Montana last night campaigning for a Republican Senate candidate less than three weeks before the midterm elections Eric Whitney with Montana Public radio has more from Missoula\nThis was the president's third visit to Montana since July to campaign against Senator Jon tester who he holds responsible for sinking his previous nominee for VA secretary Dr Ronny Jackson\nWhat he did was unfair what he did what he did was vicious what he did was as they did was judge Kevin houses\nMore people came to the rally than the airport hangar it was in good hold more than a thousand also attended a protest rally on the other side of town for NPR News I'm Eric Whitney in Missoula, Montana\nPresident Trump said it certainly looks like missing Saudi Arabian journalists democracy ... gene is dead\nOfficial in Turkey has indicated they have audio evidence that ... was murdered inside the Saudi conflict in its Denver all the Saudi Government vehemently denies that turkey said today it has not shared any audio with the U.S government\nOfficials in the U.S southeast say that at least thirty people have died from hurricane Michael officials in Florida have increased the death toll there and people also perished in Georgia North Carolina and Virginia\nIn Florida's panhandle hundreds of families remain displaced NPR's Hansi Lo Wang reports many are still in emergency shelters in schools in the worst affected areas\nThe damage from hurricane Michael's high wind and storm surge has made many homes unlivable hundred sleeping in school gymnasiums around Florida's panhandle aren't sure where they will go in the emergency shelters close angel ... Panama City lived in an apartment building for seniors that was damaged by the storm\nShe says she's trying to take things day by day for now and I get too worried about what's next\nMaybe now you wrap yourself if you knew that as I sang it off but we have I live\nIs accepting applications for ... that can be used for\nThat is I sang it off but we have I live\n... ... is accepting applications for ... that can be used for a temporary stay in hotels or condos before residents by more long term housing undo along NPR News the County Florida\nWall Street had another down day on Thursday the Dow Jones industrial average drunk one point three percent the tech heavy NASDAQ Composite index down to point one percent marketing Andy achieved economist for Moody's Analytics says investors have a number of worries\nSo higher interest rates prospects that the Federal Reserve will continue to push rates higher overvalued stock say people are nervous that the stock market has come too far too fast and of course there's a trade war or the escalating with China and that's not good news so you combine all that together and investors are nervous\nWall Street opens in about Ninety minutes the national weather service says flash flooding persists in central Texas rivers are overflowing officials are releasing water from full dams along the Colorado River it's surging downstream towards saturated area is\nThis is NPR\nThe Justice Department has opened an investigation into child sexual abuse allegations against Roman Catholic priest in Pennsylvania that follows a wide ranging skating state and grand jury report released last summer\nThat alleged three hundred preached abused more than a thousand children for decades the grand jurors called for action by officials in state lawmakers and their report\nInterior secretary Ryan Zinke is drawing criticism after an internal watchdog report suggested he violated department policy on family travel NPR's Nathan Rott has more on\nThe report by the interior Department's Office of the inspector general found that I think he's white and others traveled in government vehicles and at the zinc he's heady park police security detail go with them on a vacation costing taxpayers twenty five thousand dollars\nThere's no policy prohibiting the ladder the report says but as it gets department rules to have family travel in government vehicles\nVicky did get permission from the agency's solicitors office for the family travel and a spokeswoman for the interior said that proves he followed proper protocol ... facing more than a dozen other investigations and he's been rocked NPR New\nElection officials in Afghanistan have postponed national elections for the province of Kandahar there'll be held on Saturday in the rest of the country this followed the Taliban attack yesterday in the governor's compound that left Kandahar as top police official an intelligence official dead\nThe provincial governor was wounded the top US military official in Afghanistan was present but it's ... injured three Americans\nWere wounded on corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include a log me in makers of go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at go to a meeting dot com and the listeners who support this NPR station\nThanks for listening to NPR's MORNING EDITION on K. A. W. see eighty eight point nine of them and gay WC dot org is ours lead story coming up and just a moment\nLearn more about us and visit cage WC dot org for our latest coverage files on her staff in more MORNING EDITION continues next it's five or six\nIn Yuma sunny with a high of eighty eight today north northeast when tend to Fifteen miles per hour and I mostly clear those around sixty eight Parker will have sunny skies in a high of eighty eight with north when into Fifteen miles per hour day night mostly clear lows around sixty four degree\nThe human county mean library will be hosting a ...\nThe day and night mostly clear lows around sixty four degree\nThe human county main library will be hosting a costly social to work on costumes and accessories with ... it'll be tomorrow from eleven AM to one PM at the human main library twenty nine fifty oneself twenty first drive in Yuma for more information you can contact us at nine to wait three or four seven six nine zero [noise]\nA brochure first produced by the air is on a highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world\nDoing K. A. W. sea and retired airs on highways publisher when hold and\nAt the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information does it K. A. W. C. dot org this have been made possible in part by a grant from Arizona humanities\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington and I'm David Greene in Laguna Beach California and the waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine\nWhether Republicans hang on to control of the house Republican congressman Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat hardly wrote a who seems to have a shot at and feeding have this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna\nThe gal with one of the super wealthy towns in the hills above the Pacific\nHere and this is where some very rich voters are changing the political landscape or did you ever get Eric McDaniel that was the editor\nEric giving his name so we could pull through the gates we then went up to a house where there was a Porsche parked\nIn front of this huge fountains and our hosted the raid and tone brought us inside David nice to meet to Antonio is Iraqi American\nHe moved from Baghdad to the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies as for his politics\nI was a Republican for thirty one years when I actually uh\nTurned Eighteen and and and joined the military we were just coming off of what you know Ronald Reagan being president and and really the strong stance he had against you know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nUse from the CBC airs this afternoon that to just before NPR's all things considered here on the age do you see eighty eight point nine of them and gay WC dot org\nVisit Kay AWAC dot org to find a programming schedule I was ... and more NPR's MORNING EDITION continues in a moment it's five Nineteen\nThe human county library welcomes Melissa Stevens with the course introduction to scraping or a software program for writing with more organization and options the word processor\nCores feeds on Monday October twenty second starting up six PM at the human lean library twenty nine fifty one ...\nAnd Parker sunny skies in a high of eighty eight degrees north when ten to Fifteen miles per hour today tomorrow mostly sunny eyes near eighty nine in Yuma sunny in a high of eighty eight today with north northeast when ten to Fifteen miles per hour tomorrow sunny skies eyes near Ninety degrees\n... county library presents solar viewing on the patio and the interview the sun through the libraries solar telescope to observe sunspots prominent foods and players it'll be next Thursday October twenty fifth at three PM at the library won three to six east south Bernays wrote in Yuma\n\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first learned more it Raymond James dot com [noise]\nFrom Rhodes Scholar and not for profit offering learning adventure for adults and natural settings across the country and learn more at R. O. A. D. scholar dot org slash retreat\nSo in offering learning adventures for adults in natural settings across the country learn more in R. O. A. D. scholar dot org slash retreats\nFrom gobble new kid company that delivered semi prepped meals to be finished at home in Fifteen minutes with one pan gobble sous chefs do the prep work like chopping and marinating this week's menu and the gobble dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections United States let's take a moment to check on democracy in Afghanistan the country has been planning parliamentary elections this weekend most of the voting will proceed brought in a very large and populous province the voting has been postponed that\nRun attack that left to senior officials dead including a top police chiefs\nPamela constable covers Afghanistan for the Washington Post and she's on the line walking to the program\nI'm Glad to be with you I guess we should figure out what was supposed to happen this weekend one of the original plan what's at stake and most of the campaigning bin Laden\n[noise] um the original plan was to have um a very\nBig nationwide election more than two thousand and five hundred candidates for two hundred and forty nine seats in parliament candidates of all all flavors uh and philosophies\nAh there was lots of excitement about the election but also lots of concern and worry\nPartly because of threats by the Taliban which has now come true uh and partly the widespread of widespread charges on that there was going to be massive fraud so you've seen a lot of a positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal of\nOf worry a and and and anxiety at the same time\nSo you've been reporting that in Kandahar Province really large important province the voting will be delayed for a week but this does raise a question what\nIs possibly going to be any different a week\n[noise] right and we don't know that obviously this is a a measure of taken on an emergency basis um just to to sort of calm things down and I'm the kind of hard to very large province which is tough lost\nIts police chief intelligence teeth and the governor has been gravely wounded um there's a huge security vacuum people are very nervous and worried so I think this is obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would think and hope that that elections can be held there because it's a favorite populist lots and lots of voters um but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not um and to what extent that happens how how bad it is I suspect\nA generally speaking out they're going to be taking famous one day at a time here\nDoes you'd feel and the rest of the country Pamela constable Mike or democratic process does do you feel like you're in the middle of a reelection campaign where the people's will might be expressed\n[noise] I Do it does ah it's been it's been a a a nice experience so to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates with it which is extraordinary\nA for a very traditional society like this one\nUp on the other hand candidates although they've been busy an active have not been doing a lot of public campaigning they've been proved that they've been cautious they've had inside events\nUm it had a loudspeaker trucks but you have not seen a massive public rallies a few have been held in the provinces and some of those have been attacked\nBut you have not seen massive public rallies a few haven't held in some of those have been attacked [noise] um so and and as we mentioned earlier that you had candidates have\nHeld wow okay Pamela constable of the Washington Post in Afghanistan thanks so much\nIt very well um\nMm\nThat music means that it's time for historic or this morning and you were a general being home with two years old when parents brought him to the United states from Mexico on a tourist visa they never left because I was allowed to stay in the U.S thanks to the deferred\nAction for childhood arrivals program or DACA he went to law school in two thousand twelve it was around than that he met our ... air most CEO on a bus you leader asked her on a date and that's when the cone told her that he was undocumented\nDoes it make you feel apprehensive about dating me\nNo it didn't make the apprehensive it was almost like it's okay it's cool to not even fully crafting what that meant I was a U.S born citizen and I think I didn't realize that I Would start living some of that indirectly through spending time with you\nSo I started working as an original\nJourney it's weird to be undocumented\nIt's weird to be in those offices with somebody else all sorts of the central to ration you mentioned to me that sometimes you're scared of yours or of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing [laughter] come you the truth have you ever been afraid\nI'm I'm always afraid [laughter] um when I went to my first I check in with a client on the fourth floor and just completely packed to the brim and you cannot walk around and it's very hot it's almost suffocating sometimes I'm curious if they know about my status\nYeah we've kind of unspoken system for you tiny in the morning that you will be and I check in and then I said please be careful and then you tax me when you're out and safe and they say\nThank God but it does way me down a little bit it is a very specific cloud hanging over us it just feels like we're at pause travel plans are paused\nLong term plans are caused you know we ... we want to buy a house\nWe really can't take too many steps in any direction until we have this resolved\nSo it is hard [noise]\nWhat did our wedding day feel like for you um I think I I thought that piece yeah like it's a it's it's a start up something new for us they've been together for over five years now\nYou've been very supportive and very caring and so many ways\nI Wonder how you feel when you no longer have\nTitle of undocumented person but I'll be there with you\nReady to her\nThat was your Kara become an already on it are mostly um although they were married earlier this year it's unclear whether it be calm or receive a green card to become a permanent residents\nAn interview is going to be archived along with hundreds of thousands of others at the library of Congress [noise]\n\nMajor support for StoryCorps comes from super and featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes a Subaru and super and learn more at Subaru dot com\n\nIt's what makes us Subaru and super learned more it Subaru dot com\n[noise]\nThis is NPR News\nThe Affordable CARE Act the central issue in Arizona have rain but the way voters perceives the law has changed we'll meet a mother who saw it as a lifesaver than a burden now chooses to go without insurance [noise] like I don't have it\nNow about three miles away in another hundred to a beach home we spoke with Shane and ... them\nInto the cabinet quarters it's all campaigned prisoners of war and everything else right back here for him\nBut she is a middle school teacher who's running for city council and we seem to have nothing at all in common with on a killer and again these are two women who politics are motivated by the same emotion fear she noises said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people are just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds of Latino students at my school that we're going to be terrified ... what was going them they were worried that their parents were going to be deported\nI had hundreds of Latino students at my school that we're going to be terrified but what was going them they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nWhen you're living in fear it's really hard to learn about things like cells and body systems and I have several students who we've been trying to get their parents to come in for conferences or to discuss their child's individualized education plan\nThat won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave\nThey can't they're afraid to come to school\n... this is a Democrat and that's the way she's going to be voting next month for heavily router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers who are willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together that this divisive mass I really want to believe that that's not who we are as a nation\nBecause it's it's amazing just as a journalist who watches these debates from afar um it seems like so quickly\nYou're labeled as someone who just want to protect immigrants in this country and doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges\nThat is how it looks if you're reading things on the Internet but if you're out there in the community and you're walking with us you'll see that there's far more than it does bring us together then divides us\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say that's that's not helpful let's let's try and work through this\nI I Would do that absolutely I don't know that I Would\nActually be able to come out and say he's not racist but I think I could say something along the lines of continuing to push that narrative is not helpful what is something that we can talk about that is helpful\nThat was the voice of Shane a life is and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News I'm Margo ... in the world is people looked sort everything to me I turned to books to deal with this feeling of being an al\n... and I particularly are trying to fantasy because in places like Narnia andme middle earth I wasn't scared little kid I was brave and strong and I was never afraid joined us and listen to the world [noise]\nBe our eyes the world there's this evening from six to seven here on K. A. W. see eighty eight point nine of them and gay WC dot org\nThanks for making a double you see part of your morning it's five forty three today's edition of Climate Connections is coming up next\nFrom floods and wildfires the impacts of climate change are no laughing matter but humor can be an effective way to motivate young people to get engaged young adults by and large believe climate change is happening stay believe it's human caused\nHumor can be an effective way to motivate young people to get engaged\nYoung adults by and large believe climate change is happening stay believe it's human caused and yet in spite of as they're not necessarily the most politically engaged generations\nTo study how to reach this audience Chris ... at Cornell University worked with comedians from second city Chicago they created a series of short videos about climate change all featured a weatherman but the tone of his report was different in each video in one he appears a bit confused\nOf our nation's panhandle with wanting poses a potential threat\nWeather man to wonder if they're doing both in the army\nI've noticed that when I put you on the stuff in my pool of water starts overflow\nAs the weatherman bubbles through his ridiculous report tax on the screen corrects him and cracks jokes I does expense the study found that the humorist video increase viewers willingness to take action especially among those under the age of twenty five\nSo ... says if you want you to act on climate a simple laugh can be a powerful ally\nClimate Connections is produced by the Yale Center for environmental communication\nDetail Climate Connections dot org [noise]\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the art for every one ideas at wallet foundation dot org [noise]\nFrom the ... foundation since Nineteen eighty five supporting advances in science education and the arts towards the better more just society more information that's available at size same foundation dot org\nAnd from the John de into Catherine T MacArthur Foundation asked Mac found dot org\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally this legislation will ensure that properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about how politics and the government work\nAhead of this year's election some states have already clued voter registration well other states allow people to register at their polling places on election day what is the deal with this patchwork system is the deal is All right here's our first listener question\nThis is claiming a heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five how laws changed since the Supreme Court granted black citizens the right to vote and white citizen or seized barriers to voter registration\nThe basic answer is yes voter registration laws were controversial at first people staffing the polls were just expected to know everybody didn't in their neighborhood but then in Eighteen hundred Massachusetts instituted the first voter registration\nAnd as the century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote a by the late Nineteen the early ... centuries a rural dominated state legislatures impose registration on city voters again it was aimed immigrants and at fraud by big city political machine\nWhat about the rest of her question there what about the effects on black citizens versus white citizens' well of course not men were given the right to vote and the fifteenth\nPolitical machines and what about the rest of her question there what about the effects on black citizens versus white citizens' well of\nCourse black men were given the right to vote in the fifties amendment in Eighteen Seventy but the Jim Crow laws in the south effectively stripped African Americans who they're voting rights in terms of rights of course white women and\nBlack women couldn't vote nationally until the nineteenth amendment in Nineteen twenty but you know before you're sixty five bill a lot of whites in the south couldn't vote either just because the registration frozen the roles they didn't want anybody new voting\nOr we have a couple of questions about current controversies\nMy name is Rachel ... from Shaker Heights Ohio why the candidate for governor allowed to purge voter rolls shouldn't he recused himself for secretary of state law he's a candidate\nI assume this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and then thinking about using himself he's provoked a lawsuit by buddy more than fifty thousand new voter applications on hold for minor inconsistencies\nThe lawsuit charges discrimination saying eighty percent of those applicants are members of racial minority groups\nThough they can't vote early or by mail they can still vote if they show up the right polling place with the proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is Amy payment tour and I live in Omaha Nebraska\nWhen I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me and I heard that a lot of Native Americans on reservations only have a post office address how is that going to affect their ability to vote\nWell they're complaining about it this has to do with the region Supreme Court decision upholding in North Dakota voter id law does require a current residential street address Native American groups say that off and on reservations they don't have those and planning I the irony that the nation's original residents are being questioned about their residency\nTrusted news where ... and ... counties it's six o'clock\n... presents solar viewing on the patio and the interview the center of the library solar telescope to observe sunspots prominent foods and players it'll be next Thursday October twenty fifth at three PM at the ... library won three to six east south Bernie ...\nIn Yuma sunny with a high of eighty eight today north northeast when and to Fifteen miles per hour and I mostly clear those around sixty eight Parker will have sunny skies and the highest eighty eight with north wind into Fifteen miles per hour day and night mostly clear those around sixty four degrees\nWho\nGood morning California is a heavily democratic state where the Republican congressmen won reelection for years what happened to this fall Democrats trying to retake the house MORNING EDITION\nComing up a California father and daughter in different generations and radically different politics I'm David Greene and Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also hear a critique of the influence of Saudi Arabia and money executives in Silicon valley welcomed\nQuestions after the suspected murder of a journal and\nAlso this hour Israel phrase in America was detained at an airport for more\nDid this Friday October Nineteen Michael Steele the former chairman of\nNews is next\nLive from NPR News in Washington I'm more of a Coleman the death toll from hurricane Michael is at least thirty people officials in Florida have confirmed new talent teens damage remains widespread in the Florida Panhandle and Georgia agricultural officials are reporting billions of dollars in hurricane damage\nSeparately Virginia authorities are reporting another death from last month's Hurricane Florence at least fifty three people die from that storm in three states\nLess than three weeks before the November midterm elections a new poll suggests many rural Americans are optimistic about their economic future NPR's Kirk Siegler takes a look at the findings from NPR the Robert Wood Johnson Foundation at Harvard University Chan School of public help some of the results in this\nPoll run counter to stereotypes we often see perpetuated in the mass media are being pushed by some politicians that rural America is dying and emptying out just like in a city it depends on where you are many small towns have strengthening economy is with businesses moving in and people drawn there by the small town life style and the ability to work remotely\nNPR's Kirk Siegler the Afghan government is delaying parliamentary elections\nThe people drawn there by the small town life style and the ability to work remotely\nNPR's Kirk Siegler the Afghan government is delaying parliamentary elections in the southern province of Kandahar this follows a Taliban attack Thursday that killed two senior security officials Jennifer glass reports from Kabul\nThe decision was made by Afghanistan's national security council after the Taliban killed Kandahar as powerful police chief in head of intelligence Thursday's attack inside the provincial governor's compound narrowly missed us and NATO Commander general ... Miller\nThe Afghan election commission which made the request to delay will announce the exact date the rest of Afghanistan is scheduled to vote Saturday turnout will be crucial for the first time there's an electoral role of a point eight million the Taliban and Islamic state had both founded disruptive vote and colon Afghans to boycott it\nVoter registration and political campaigns had been beset with violence ten candidates had been killed two hundred and sixty others had been killed or wounded\nFor NPR News I'm Jennifer glass in Kabul\nPresident Trump's former campaign chairman Paul Manafort is heading to court today NPR's Carrie Johnson reports the judge wants to move ahead with the process of sentencing Manafort\nJudge TS Eliot says he wants to clear up what will happen with ten criminal charges on which uh Virginia jury deadlocked the sheer prosecutors say they'd prefer to leave the usual known until after Paul Manafort finishes cooperating with their investigation\nBut they say they will not object if the judge wants to dismiss the count so long as they reserve the right to file them again\nA jury convicted Manafort filing folk tax returns failing to file reports of foreign bank accounts and bank fraud\nManafort had asked to wear a suit of course but the judge denied that request reasoning that Manafort should be treated like any other defendant who's been convicted of a crime and remains in federal custody Carrie Johnson NPR News Washington You're listening to NPR News\nFor K. A. W. see news in Yuma and couldn't Johnson\nMexican authorities are trying to stop a caravan of migrants that's headed to the United states from entering Mexico as Jorge Valencia reports from kj feces Mexico City bureau authorities are increasing police presence\nOn the Mexican border with bottom Mahler and meeting with the migrants\nMexican officials met with members of the caravan in Guatemala warning them of how dangerous their journey is but other Mexican leaders see this as a response to pressure from the U.S and they don't like it now they are not ... as a senator from the opposition party by\n\nNATO us any of those says in a press conference that migrants shooting the cannon fodder for the US's midterm election many experts agree Mexico has long been doing the US's work and he said that they got Alaska is an immigration law professor at the national Autonomous University of Mexico\nI think that immigration is in Mexico are ... of us immigration ...\nSecretary of state Mike Pompeo is scheduled for a visit in Mexico city on friday reporting from Mexico City I'm Jorge Valencia\nArizona democratic congressman Raul Grijalva has responded to tweet sent by president Donald Trump this week that threatened to use the United states military in order to close the U.S Mexico border because of the caravan\nIn a statement from his office ... said the president's ignorance about what he touts as a signature issue is quote astounding unquote\n... ads deploying troops on the border would only militarized border communities and do nothing to improve security he called on the president to modernize porch\nOn the border would only militarized border communities and do nothing to improve security he called on the president to modernize porch and improve processing of asylum applicants instead or K. A. W. see news in Yuma I'm Kim ...\nSupport for NPR comes from the daddy investments taking a personalized approach to helping clients grow preserved and manage their wealth learn more at ... dot com slash wealth fidelity brokered services El Al ... and Americans for the arts and Americans for the arts dot org\n... those big this is MORNING EDITION on ... and dumping the\nEighty eight nine of them\nAnd they ate WC nod or in the morning I'm chip strangling they were listening\nIn the next half hour on do you see\nThe only non lord no\nHuman sunny high near eighty eight nor nor these when they see around nine mostly those around sixty eight or Sonny nightmare eighty eight day and night mostly clear with low around sixty four degree in I don't usually thanks for listening\nThere's so many little bite of news you get throughout your day all things considered fills in the gaps between the day's most important stories so you get\nThe what's the last midterm election only about twenty percent of voters under age thirty showed up at the polls and the wives can only say young people tend to move around a lot and they often feel ... in local election here the bigger picture on all things considered every afternoon from NPR News [noise]\n\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California and I'm Steve Inskeep in Washington DC President Trump has acknowledged what increasingly seems like reality or a ... a reporter asked him do you believe a Saudi journalist us residential market show G used at\nThat [noise]\nIt certainly looks that way to make sure that certainly look this\nMarks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a shouting consulate and vanished in Turkey suspicion is falling on the Saudi Government get the president has suggested conspiracy theories about who could be responsible for a gruesome murder\nAnd said Saudi crown prince Mohammed bin selmont was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for a new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush to morning or\nGood morning Steve good to be with you know watching\nFrom the outside what does President Trump's goal appear to be well\nI think it's important that President Trump seems to have the knowledge reality as you said in your opening that this was a grisly murder of a journalistic criticized critic of the Saudi regime and that they're gonna have to be consequences for this kind of extra territorial illegal act\nBut the president also said unfortunately this has captured the attention of the world that's a quote from yesterday making it clear it seems that if this isn't really something he wants to be dealing with he would rather be making friends with the Saudis\nErin now airs today from tend to do on a double you see\nThe morning I'm strangely thanks for joining us for MORNING EDITION\nIt six Nineteen [noise]\nAnd humid today sunny skies in a high of eighty eight degrees north northeast when ten to Fifteen miles per hour and I didn't you know mostly clear those around six yang\nMarker has sunny skies in a high of eighty eight day with north when\nTen to Fifteen miles per hour night and are mostly layer those around sixty four degrees\nIs is a double you'd see\nToday's ... days sponsors Tommy Marino of yoga unfit encouraging listeners to celebrate evaluate your life day which is today Tommy believes we all need more yoga yoga unfit eight forty south Fifth Avenue in Yuma information about class schedules videos and more at yoga unfit dot com and on Facebook\nThe optimist ... Huma offers joined the optimists love as they close the thirty first annual catfish rodeo and ninth\nThe optimist Bob Vila offers joined the optimists club and they both the thirty first annual catfish rodeo and ninth annual nature fair\nThat Saturday from seven AM to twelve him\nAt the ... part we're more information you can contact a do you see\nThis is Kate AWAC eighty eight point nine of them a WC dot org and MORNING EDITION from NPR continues next\nSupport for NPR comes from the station and from little passports a monthly subscription service for kids each package includes games souvenirs and activities for him a new country designed to spark curiosity and cultures around the globe a little passports dot com slash radio\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template dragging drop email editor and twenty four seven customer service Morris campaign monitor dot com\nAnd from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at build on dot a W s\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here\nIn California is forty eighth congressional district voters here might really help determine control of the house of representatives and we have been spending time\nListening to what is on their minds so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon NTN Tom trend lives here she works in community affairs for a utility company she is raising two kids\nOr parents also live in this community but she\nSays their lives and her's are so different\nMy parents are pretty much their lives are in little Saigon my dad works at a pharmacy and sell them either in the ... and for me I go out in the world I experience race it that I Know what it feels like to be discriminate against I I think my parents haven't because really they their lives or hear\nTheir communities here they go to a Vietnamese math they go to their customers are meeting these are our ... our diverse now I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nSo when we went to visit the anthem tram we had heard there were some political differences in her family though I'm not sure she herself new quite how stark they were\nHigh high\nShe invited us into her parents' home her kids were playing around with eating snacks and they were orbiting around\nThe grandfather [laughter] how\nTran ... father he primarily speak Vietnamese and his everyday life including when he talk politics with his daughter he's been backing Republicans since he first started voting in Nineteen Ninety two and he told me he was certainly no fan of president bronco bomber who he said just wasn't tough enough on the world stage\nWhom a window like him very much and and then what now I guess we're today we have Trump what do you think of Trump so far [noise] sofa\nIn this country\nAnd and then what now I guess we're today we have Trump what do you think of Trump so far sofa\nIn this country who who do a good job what do you like what do you\nDo on them ... the the low uh-huh and um stock markets in a row seat in Greece and so the economy's important do you yeah\nAnd that this is this is um I open it [laughter] [laughter] I didn't realize how he he thought of Trump 'cause we haven't talked about that is the first time yeah I have a surprise because then I'll have a conversation\nAbout the other stuff that he does against the media\nAgainst like just civil society we grow up knowing how undemocratic Vietnam is the crackdowns on freedom of the press on basic human rights women don't have the same rights there and to see some of that happening now in America you know in some factions of government is scary because that was something that I never would imagine\nWe will be in a situation where we have a president basically calling to press the enemy of the people like we hear that from communist Vietnam but we don't hear a you know I Would never have imagined that would be reality here today\nCould you say that you're dead and yeah I'm just I just wonder why when Trump calls the media enemy of the people what your reaction to that\nMenu ally like all the whole ball and yelled out you know there\nAre some time in the press talk about what these changes but they don't care about the truth and you're just has so yeah CNN or didn't drum riff off to both him\nSo they're not they're biased yeah Fox News clearly as fire and I don't know if you're does to my mom and I have an el ... they spend a lot to go to law school I'm Trump boxes like trying to you know make a phone [laughter]\nDo you think you think the media is too negative about Trump\nIt's not for this or that Russia interfered in through the election in this country mhm but when they know that\nWas it on a shouldn't before the election [noise] the way on the hill from both elected and the money issue\nSo if if they find out that Trump worked with yeah the Russians where that would that bother you yeah you don't ask don't believe that yeah [laughter]\n... Gruber the mid to believe them\nYou know ... the ... FBI then just don't know which as job no to all he believes\nThat the Mueller investigation should continue so that they have we have the facts I agree with that\nYeah to some of your ground yeah there are a lot of families who've been divided over their views of from what you hear like dinner conversations that yeah the go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because of one person\nI clearly have strongly against you know what the president stands for\nBut I also believe it's important to me I respect my parents I Know what their experience has been and and we came here so that we can have the freedom to have different views to have these kind of conversation because they don't happen in Vietnam and so the fact that my dad has a different view from me on this particular issue that doesn't bother them because we have that freedom that's why my parents' lead Vietnam to be here in the first place\nEverybody got to go to vote yes you both for tours and for future the weird thing\nThink everybody should vote yeah\nYes you would fall toys and for future either we thinking so you think everybody should vote yeah\nAnd my father I didn't mention any he ... after the war he weighs a political prisoner for ... a two year three years he was held in a political concentration camp I Know they\nThey do the ... game\nYeah we're the communist try and stay there you know basically get him to change it thinking\nIt's powerful to hear you say that people should vote no man from mhm the history that you have\nYeah I just think we need to protect our democracy\n... we would wrong or right because the if we were wrong and that we make it dry ... have a ...\nThat was the anthem trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\n[noise]\nTime I replayed over this week on science friday a sleep scientists spill the beans on insomnia Knight animals\nThere is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties when the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield the privileged they wield that some of the people who founded these companies have been catastrophic Lee blind to\nOn a bearded us is the author of the book winners take all thanks very much for coming by thank you Steve are an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we have more from NPR's Daniel Estrin in Jerusalem lower\nCost them it's twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning active it's affiliated with the pro Palestinian campaign to boycott Israel\nAll cost them used to have a small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nThat I have some of the other than that\nDeputy foreign minister see peaceful to belly told Israeli radio last week that Israel the ban on all costs him was not very successful she said Israel should reconsider how it applies to entry band when it turns into an international issue we lose more than we when she said\nBut Israeli strategic affairs minister ... ... who led Israel's campaign to ban all cost them defended them of\nBringing the little guy and he said don't just look at article in New York Times and the media is critical of Israel he argued there are thousands of pro Israel students and the un contend with pro Palestinian activists on campus\nWho will support or move without cost them proponents of the boycott divest meant and sanctions movement say there peacefully protesting Israel's treatment of Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy of the country\nLaw customs case reached Israel Supreme Court which ruled that I'll toss them had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel [noise] she was released from the airport yesterday ... is her lawyer\nVictory for free speech academic freedom and there were a large ... ... ... so I think had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all cost them during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court that looked forward to having her on campus next week Daniel Estrin\nNPR News Jerusalem this is NPR News\nThis is K. A. W. see eighty eight point nine of them and pay WC God or [noise] um ... [noise]\nOr to be MORNING EDITION [noise]\nPainter mark Radford represented the United\nNor too to MORNING EDITION [noise]\nAcclaimed painter mark Radford represented the United states at the Venice being out in\nThe work he created is called\nTomorrow's another day\nAnd it's now on an exhibition involved [noise]\nThis is gay WC\nBird note is up next\nI have a wonderful riding [noise]\n[noise]\nIf you live in North America tear it can often seem like exotic ambassadors from the far off the jungles of Brazil or the wilds of Australia especially since North America is once common native species to Carolina parakeet has been extinct since the early twentieth century [noise]\n\nBut more and more parents are making this continent their home since the Nineteen sixties at least amongst parakeets have been free flying and reproducing in the U.S\nWhich is to say they have become naturalized amongst parakeet with lime green back gray and yellow under pirates in deep blue wings is also known as the Quaker parrot\nAnd it's a native of southern South America\nInitial fear that if we devastate agricultural crops haven't materialized and it's become the most numerous ... parents in the country [noise]\n\nEscaped most parents case now have self sustaining populations in many areas across the country Chicago Dallas New Orleans Portland, Oregon in Bridgeport, Connecticut among others\nSo clearly in the wild they can gradually acclimate to cold and most parakeets are not alone by two thousand Fifteen at least a dozen other foreign parents species were nesting in the U.S [noise] for Britain now I'm married his hand [noise]\nSupport for bird note comes from the Puerto Ricans tourism bureau insulin February's whooping crane festival and hundreds of species of birds to see year round and visit port Iran's is dot com\nSupport for NPR comes from this station and from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nFrom I drive maker of remote PC providing real time remote access to PCs max and servers from anywhere for use when telecommuting or for remote management learn more remote PC dot com slash NPR\nAnd from Americans for the arts\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border Mexico a country to the south is also trying to secure its southern border the border with Guatemala\nAuthorities are sending soldiers immigration agents and federal police there they're aiming to stop a caravan of migrants who are hoping to leave Central America and in some cases cross through Mexico on to the United states James Frederick reports from so you're not at all go Mexico\nTwenty three year old Honduran daisy crews who says she's flying an abusive gang member boyfriend cross into Mexico two weeks ago but then on Thursday she turned around if they're making a decision to head back south towards the border with Guatemala to join a rally for the migrant caravans\nWhen do they\nDo that\nTowards the border with Guatemala to join a rally for the migrate caravans\nWhen they\nCan and then\nShe says she came to support her fellow hunger and to be here so they don't feel alone\nCrew's joined about fifty other migrants an activist since you like to go a town that sits on the Mexico Guatemala border\nPolice and activists soon clashed in chaos broke out and you can hear in the cell phone video from the sea [noise]\n\nEating ... Mexican American migrant activists who helped organize a similar migrant care of and in the spring that first part to President Trump's higher federal police alleged ... previously vandalized an immigration vehicle as migrants tried to stop ... arrest crusade police got rough with everyone even women and children\nThey made me how she says an officer told her to shut up they pointed a gun or seven year old son and\nThreatened to kill it to others present during the incident corroborated her story spokesmen for Mexico's federal police tells NPR he was not aware of that specific incident and just activists initiated the aggression cautioned the Mexican border town is a foreboding sign of what has to come\nAs a caravan of thousands gets closer\nDozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala Mexico human rights commission came to see like you go to try and head off the tensions the group's spokesman it costs us ... says he wants to Mexican police to keep one thing in mind is the caravan approaches\nDissemble ... senior citizen uses for fighting for the rights of Mexicans to be in the U.S he says the least we can do is respect the rights of our Central American brothers and sisters here in\nMexico while most are still on their way about four hundred migrants from the Caribbean or already just across the border and the Guatemalan town\nOf mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico families relaxing the shade chatting and laughing and eating and drinking donated food and water\nAnd you're left a a twenty nine year old single mother for who says their families flee gang violence doesn't want any trouble with filling plus he got ... Sunday ...\nShe says we come with the spirit of peace with no intention to use violence nothing like that were just looking for a\nBetter life but as things stand now raised her children and the other migrants will be ... by force at the Mexican border for NPR News I'm James Frederick infused though you die go Mexico\nThanks listening to your public radio station which brings you MORNING EDITION you can get the latest news this afternoon on all things considered and follow us anytime on social media you can find all your morning edition has on Twitter if you'd like I'm nprinskeep\nGood morning I'm chips trailing\nIn Yuma sunny today with the highest eighty eight north when ten miles per hour night mostly clear lows around sixty eight ... sunny today hides near eighty seven north when five to ten miles per hour\nAnd tonight in Parker mostly clear with low around sixty three we have a report of sixty four in Yuma sixty Seventy Parker and sixty two degrees in San Luis\n...\nThanks for listening to K. A. W. see\nIt's seven o'clock\nWho\nMorning I'm looking out at the Pacific from the beach here in orange County California a long time Republican congressman from here wants to keep his job we'll hear why isn't such a tough\nOn MORNING EDITION from NPR\nOur mid term voters series just west we'll hear from an artist here in California Who's Afraid to go out at night in part because of illegal immigration yet she said some people here illegally like those she has employed should be allowed to stay and a wealthy entrepreneur on why he left the G O P after voting for Republicans and he turned and\nI'm David Greene in Laguna Beach California and I'm Steve Inskeep in Washington DC Afghanistan lands parliamentary elections\nThe violence means some are\nIt is friday October Nineteen actor\nSeventy three the news is next\nFrom NPR News in Washington I'm core of a Coleman President Trump says it certainly looks like missing Saudi Arabian journalist ... gene is dead Turkish officials claim they have recordings that proved ... showed he was killed and Saturday consulate in it\n... is dead Turkish officials have claim they have recordings that prove ... was killed in a Saturday consulate in Istanbul a charge the Saudis deny Trump says if Saudi Arabia is to blame the response will be quote very severe\nAfter talking about ... Trump attended a rally in Montana last night and praised a Montana Congress men who attacked a reporter last year NPR's Don Gonyea reports the issue involved congressmen Greg gene four day\nJune fourteenth was elected in a special election in twenty Seventeen that's when he assaulted a reporter from the guardian newspaper he pleaded guilty to a misdemeanor assault last night the president ... visited that attack calling Jean forte quote my kind of guy\nYour body [noise]\nPresident recalled first hearing of the assault and I said oh this is terrible he's going to lose the elections and I said well wait a minute\nI Know Montana pretty well I think\nIt might help them today from camping\nIn Arizona which has a close US Senate race Don Gonyea NPR News Missoula, Montana\nMore than a week after hurricane Michael slammed the Florida Panhandle cities and towns are facing the daunting task of trying to rebuild NPR's Debbie Elliott reports on the clean up in Port saint Joe a coastal Florida town Alicia smiley\nAnd her brother are clearing out the apartment she shares with her disabled grandmother ... [noise]\n\nThe apartment\nWas inundated by storm surge and now most of their belongings are piled on the curb\nDevastating a is depressing um\nYou know I Try not to think about it too hard but it's been a lot of people coming and helping all we can do is appreciate any and everybody that ...\nOut thank you is not good enough\nPower is slowly coming back but down trees into breed line just about every street in town Debbie Elliott NPR News port saint Joe Florida\nElection officials in Afghanistan are delaying upcoming parliamentary elections in a southern province and ... reports from Islamabad that followed yesterday's assassinations of the powerful police chief of Kandahar\nThe police chief was assassinated by his buddy got in a brazen Taliban attack in ... during a high level meeting in Kandahar to discuss security plan to parliamentary elections expected the Saturday\nNow voting will be delayed in Kandahar by one week it throws even more uncertainty around the elections which have already been ... by deadly militant attacks and contrary to the NPR\nThe DEA had deemed on Wall street the Dow was up two hundred and ten points the NASDAQ he's a well over one percent it's Seventy five hundred Seventy five this is NPR\nFor K. A. W. see news in Yuma on can transcend for the twenty second year of the ... tribe invites the public to learn more about their traditions and culture the tribe's cultural celebration tomorrow K W sees Victor called Iran has detail\nIf you've driven on highway Ninety five between human San Luis you've probably noticed the cocoa pockets you know in a resort in summer and but how familiar are you with the Indian tribe behind the name\n... community leaders hope you'll join them this Saturday or the annual cultural celebration the day begins at ten am at the ... museum and cultural center\nTribal chairwoman Sherry Cordova and vice chairman Jay deal gay open the festivities there'll be a chair volleyball game between tribal elders in youth arts and craft booths and the childrens fund area cultural performances include the southwest cooperate singers and dancers\nAnd Jason San Diego ... singer is\nAnd the childrens fund area cultural performances include that southwest caught the singers and dancers and Jason San Diego a ... bird singer\nIs the manager Joe Rodriguez said many in the region are not familiar with a rich history of the ... people\nCocoa pot is not just the name of our\nOn the side of a building or\nSome other businesses but it's also it is a people it is a language it as a culture that has a history is it is a heritage that embodies the people that live here\nAre K AWAC news this is Victor got that on\nBecause should increase student enrollment the Maricopa community college district governing board has approved a thirty one million dollar campus expansion project\nIt includes new thirty seven thousand square foot building at a stray amounts and community college\nWhich will house classrooms and expand the districts southwest skills center a multi campus workforce development program\nIn a statement the college presidents says the campus simply as depleted all available space for faculty in programs are gay WC news in Yuma I'm Kim transcend\nSupport for NPR comes from the three I owe the powering enterprise digital transformation with artificial intelligence predictive analytics and I oh these illusions learn more at the three I O T dot AI and the ... foundation at ... dot org\nIt's seven six this is MORNING EDITION on ... they'll see [noise] eighty eight nine of them and say hey W dot org\nGood morning I'm chip strictly\nA head on MORNING EDITION Saturday was supposed to be an election day in Kandahar Province but those elections are both shown ... Steve Inskeep talked to ... the Washington Post about why the voting delay that story and about Fifteen minutes on MORNING edition [noise]\nBanks were listening to a W E eighty eight point nine\nThem\nRemembering the enemy and fats domino\nNew Orleans rhythm and blues into rock\nAlso British guitars average Lee who grew up with American music on radio and came to the U.S to create a new ... roots rock I'm an expensive joined me for American roots he Iraq [noise]\nI mean I've been in front of him he'd be the eighty eight nine ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California and those waves behind me I Know they're not your typical soundtrack for election coverage but here in orange County California there's a really interesting race that could help determine whether Republicans hang on to control of the house Republican congressmen Dana Rohrabacher\nHas served the forty eighth congressional district here for nearly three decades but there is a political newcomer Democrat Harley ... who seems to have a shot at and feeding him this district that has been moving to the left and we got a hint of why that is the other night\nWe were in Laguna the gal with one of the super wealthy towns in the hills above the Pacific here and this is where some very\nRich voters are changing the political landscape words you're gonna get Eric McDaniel\nThat was the editor Eric giving his name so we could pull through the gates we then went up to a house where there was a Porsche\nIn front of this huge fountain and our host to raid and tone brought us inside [noise] they have a nice to meet to Antonio\nSo parked in front of this huge fountains and our host to raid and tone brought us inside [noise] they have a nice to meet to Antonio is Iraqi American he moved from Baghdad\nTo the U.S when he was six years old he served in intelligence in the U.S military and then he made a bundle running and then selling medical device companies that's where his politics\nI was a Republican for thirty one years when I actually uh turned Eighteen and and and joined the military were we were just coming off of what you know Ronald Reagan being president and and really the strong stance he had against\nYou know Russia and Gorbachev and his charm and charisma was really cool to be a Republican at the time\nThey're challenging or the people we don't like let me know so what are the people who don't like less than the people who don't like strong woman\nNext time on that he made us\nWe hope you can join us more Latino USA\nThis evening from seven to eight\nHere on a double the\nEighty eight point nine of them and K. A. W. dot org\nIt's seven Ninety\nThanks for joining us for MORNING EDITION\nAnd pay a WC dot org and\nIt's seven Ninety\nThanks for joining us for MORNING EDITION\nComing up in this week's story for we hear from a man who was brought as a child to the U.S from Mexico\nHe's now a lawyer who represents other undocumented immigrants\nAnd leader in California the Democrats are hoping to\nA reliably Republican seat\nFrom what I'm hearing if they get power all they're going to do his investigations into impeach that doesn't when my heart just ahead\nWith voters in the states forty eight this district are saying about the upcoming midterm\nThat's in just a few minutes on a to Z\nHuman sunny highs near eighty eight today\nI mostly clear lows around sixty eight\nBarker has sunny skies in a high of eighty seventh day it's a night mostly clear lows around sixty three\nSixty four in Yuma sixty seven in Barker\nAnd sixty two degrees in San Luis\n... supported by river city grill offering a unique menu of regional dishes featuring fresh seafood and all natural beef poultry inland river cities dining room and patio comfortably accommodate large private parties as well as intimate dining river city grill located on third street at sixth avenue\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John Slattery Amanda ... Paul Ryan's er and Kathryn ... on a new episode every Friday on prime video\nFrom T. I. A. T. I. A. as committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learned more AT T I Am a dot org\nFrom logged me in makers have go to meeting the collaborative meeting platform with over Eighteen million monthly users designed to connect to people from anywhere in the world on any device learn more it go to meeting dot com\nAnd from Americans for the arts\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep we're hearing all morning about elections in the United states let's take a moment to check on democracy in Afghanistan\nThat country has been planning parliamentary elections this weekend most of the voting will proceed but in a very large populous province the voting has been postponed that after an attack that left to senior officials dead including a top police chief\nPamela constable covers Afghanistan for the Washington Post and she's on the line more to the program\nI'm Glad to be with you I guess we should figure out what was supposed to happen this week and what is the original plan what's at stake and what's the campaigning been like\nA health plan was to have a very\nBig nationwide election more than two thousand five hundred candidates for two hundred and forty nine seats in parliament from candidates of all all flavors and philosophy is\nA there was lots of excitement about the election but also lots of current and worry partly because the frets by the Columbine which has now come true\nAwe and partly widespread of widespread charges on that there was going to a massive fraud [noise] do you have a lot of a positive uh campaigning a lot of new fresh faces a lot of enthusiasm but also a great deal\nOf worry a A N and an anxiety at the same time\nSo you've been reporting that in Kandahar Province of really large and important province the voting will be delayed for a week\nAt the same time\nSo you've been reporting that in Kandahar Province of really large and important province the voting will be delayed for a week but this does raise a question what is possibly going to be any different a week\n[noise] right and we don't know that obviously that says a measure taken on an emergency basis\nUm just to to calm things down I mean the kind of hard for very large province with this stuff last it's the least have its intelligence tastes and its governor has been a gravely wounded um there's acute security vacuum people are very nervous and worried so I think that there's obviously a measure designed for short term relief of that\nI'm obviously decision will be made later on I I Would take that help that that elections can be held there because it's a favorite populist lots and lots of voters but let's let's see what happens tomorrow um let's see if there's violence elsewhere or not\nUm and to what extent that happens how how bad it is I suspect a generally speaking out they're going to be taking famous one day at a time here\nDoes it feel and the rest of the country Pamela constable like a democratic process does do do feel like you're in the middle of a reelection campaign where the people's will might be expressed\nI Do it does ah it's been it's been a a a nice experience\nSo to speak out compared to previous\nElections here um you know record record numbers of candidates out and about a four hundred women are among the candidates with which is extraordinary\nA for a very traditional society like this one up on the other hand candidates although they've been busy an active have not been doing a lot of public campaigning they've been proved that they've been cautious\nThey've had inside events um it had a loudspeaker trucks but you have not seen a massive public rallies a few have been held in the provinces and some of those have been attacked\nI'm so and and as we mentioned earlier tighten your candidates have been killed and\nWell okay Pamela constable of the Washington Post in Afghanistan thanks so much\nIt very welcome\nTo\nThe music means of his time restore record in the morning and you were in general being home was two years old and you brought him to the United states from Mexico on a tourist visa\nThey never left the tone was allowed to stay in the U.S thanks to the deferred action for childhood arrivals program or doctor and he went to law school in two thousand twelve it was around than that he meant already on an air most CEO on a bus he leader asked her on a date and that's when the tone told her that he was undocumented\nDidn't make you feel apprehensive about dating me\nKnow and it didn't make me apprehensive it was almost like it's okay it's cool to not even fully crafting what that meant I was a U.S born citizen and I think I didn't realize that I Would start living some of that indirectly through spending time with you\nSo it started working as an original journey as we are to be undocumented it's weird to be in those offices with somebody else Olson's simply to ration you mentioned to me or the ... of nervous when I go to immigration court or when I go to eyes\nBecause I imagine you going in there and talking smack and just kind of standing affair clients and I just imagine you saying the wrong thing come you the truth have you ever been afraid I'm I'm always afraid [laughter]\nUm when I went to my first I check in with a client on the fourth floor and it's just complete packed to the brim and you cannot walk around and it's very hot it's almost suffocating sometimes I'm curious to know about my status\nYeah we've kind of unspoken system for you telling me in the morning that you will be\nYou know about my status yeah we've kind of unspoken system for you telling me in the morning that you will be and I check in and then I said please be careful and then you text me when you're out and\nSafe and they said that it does way me down a little bit it is a very specific cloud hanging over us [noise] it just feels like we're at pods travel plans are paused\nLong term plans are caused you know we ... we want to buy a house we really can't take too many steps in any direction until we had this resolved so it is hard [noise]\nWhy did our wedding day feel like for you um I think I I felt that piece yeah like it's a it's it's the start of something new for us they've been together for over five years now\nYou've been very supportive and very caring and so many ways\nI Wonder how you feel when you no longer have\nTitle and documented person but I'll be there with you\nReady to [noise]\nThat was your Kara become an ... or most CEO although they were married earlier this year it's unclear whether it be comb will receive a green card and become a permanent residents\nAnd interview was going to be archived along with hundreds of thousands of others at the library of Congress [noise]\nMajor support for StoryCorps comes from Subaru featuring the all new three row ascent seating for up to eight and a choice of second row captain's chairs love it's what makes us Subaru and super and learn more it Subaru dot com [noise]\n\nThis is NPR News\nThe Affordable CARE Act is a central issue in Arizona Senate race but the way voters perceives the law has changed we'll meet a mother who saw it and a lifesaver than a burden now chooses to go without insurance like I don't have a back\nNow about three miles away in another hundred new beach home we spoke with Shane and ... them\nInto the cabinet quarters it's all campaigned precinct last recent mal right back here\nShe is a middle school teacher who's running for city council and we seemed to have nothing at all in common with on a killer then again these are two women who politics are motivated by the same emotion fear she noises said she remembers feeling it at her middle school the morning after Trump was elected\nOn that day when I Know that so many people are just devastated and in shock and calling back into the covers I knew I didn't have the luxury of doing that because I had hundreds of Latino students at my school that we're going to be terrified ... what was going on they were worried that their parents were going to be deported\nAnd some of their parents were she told me only making her students more nervous\nAnd it definitely has an effect on how they learn\nWhen you're living in fear it's really hard to learn about things like cells and body systems\nUm I have several students who we've been trying to get their parents to come in for ... for instance or to discuss their child's individualized education plan that won't come because they're afraid of getting picked up and the students have shared with me and my mom doesn't have paper so we don't leave they can't they're afraid to come to school\nSheena life is is a Democrat and that's the way she's going to be voting next month for her Lee router over Republican congressman Dana Rohrabacher but she says what she wants most is lawmakers were willing to work with the other side\nI have to believe that there are people on both sides of the aisle that really do want to work together that this divisive mess I really want to believe that that's not who we are as a nation\nBecause it's it's amazing just as a journalist who watches these debates from afar um it seems like so quickly\nYou are labeled as someone who just wants to protect immigrants in this country doesn't care about the safety of people and people on the other side are labeled as racist and there's just no way to to actually build bridges that is\nHow it looks if you're reading things on the Internet but if you're out there and the community and you're walking with us you'll see that there's far more than it does bring us together then divide size\nAnd so you'd be ready to to to settle people down here we are just calling the president racist and say that's that's not helpful let's let's try and work for this\nI I Would do that absolutely\nThat's that's not helpful let's let's try and work through this I I Would do that absolutely I don't know that I Would actually be able to come out and say he's not racist but I think I could say something along the lines of continuing to push that\nNarrative is not helpful what is something that we can talk about that is helpful\nThat was the voice of Sheena laces and before that we heard from Donna killer there to voters here in orange County California and we're going to take you to other corners of this district elsewhere in the program [noise]\nThis is NPR News\nThis is K. A. do when you see eighty eight point nine of them\nAnd say hey do you see ... I'm ...\nMORNING EDITION continues in just a few minutes columnist Dan commentator Cokie Roberts talks to NPR's Noel King and they discuss listener questions about voter registration\nThat's coming up and just a few minutes\nWe're K there'll be you see are grateful for the almost two hundred sustaining members who have provided ongoing supportive KU to leave the monthly contributors have donated enough to cover programming costs for two months of the year so if you're one of our sustaining members think now more than ever we rely on you [noise]\nThanks for listening to pay them using\nLima connections is next to\nHave a great writer [noise]\nFrom floods and wildfires the impacts of climate change are no laughing matter but humor can be an effective way to motivate young people to get engaged\nYoung adult by and large believe climate change is happening they believe it's human caused and yet in spite of as they're not necessarily the most politically engaged generations\nTo study how to reach this audience Chris ... at Cornell University worked with comedians from second city Chicago they created a series of short videos about climate change all featured a weatherman but the tone of his report was different in each video in one he appears a bit confused\nOf our nation panhandle wanting Moses potential threat\nWeatherman to wonder if they're just doing boats in the army\nI noticed that when I put you on that stuff in my pool the water started to overflow\nDoes the weatherman bubbles through his ridiculous report tax on the screen correct him and cracks jokes that does expense\nThe study found that the humorous video increase viewers willingness to take action especially among those under the age of twenty five so ... says if you want you to act on climate a simple laugh can be a powerful ally\nClimate Connections is produced by the center for environmental communication and\nAt Yale Climate Connections dot org [noise]\nSupport for NPR comes from this station and from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go\nAnd from the alliance for lifetime income a nonprofit composed a financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nFor securing protected lifetime income in retirement more it alliance for lifetime income dot org\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep in Nineteen sixty five when President Lyndon Johnson went to Congress to propose the voting rights act he outlined some of the bill's provisions\nFinally there's legislation will ensure that properly registered individuals are not prohibited from voting\nBut even though when it comes to voter registration laws there is a good deal of confusion and in some cases controversy here's Noel King with commentator Cokie Roberts who answers your questions about our politics and government work\nAhead of this year's election some states have already closed voter registration while other states allow people to register at their polling places on election day what is the deal with this patchwork system what is the deal is going to jail All right here's our first listener question\nThis is claiming a heart from San Francisco California I'd like to ask Cokie whether voter registration laws were controversial before the voting rights act in Nineteen sixty five how last changed since the Supreme Court granted black citizens great develop a white could have been ... barriers to voter registration\nThe basic answer is yes voter registration laws were controversial at first people staffing the polls were just expected to know everybody didn't in their neighborhood but then an Eighteen hundred Massachusetts instituted the first voter registration\nAnd ... century moved on it became more widespread partly in a move to make sure that non citizen immigrants didn't vote by the late nineties early twentieth century is a rural dominated state legislatures impose registration on city voters again it was named immigrants and at fraud by big city political machine\nWhat about the rest of her question there what about the effects on black citizens versus white citizens' well of\nCourse black men were given the right to vote in the fifteenth amendment Nineteen Seventy but the Jim Crow laws in the south effectively stripped African Americans are they voting rights in terms of rights of course white women and\nBlack women couldn't vote nationally until the nineteenth amendment in Nineteen twenty but you know before you're sixty five bill a lot of whites in the south couldn't vote either just because the registration frozen the roles they didn't want anybody new voting\nAll right we have a couple of questions about current controversies\nMy name is Rachel ... men from Shaker Heights Ohio why as a candidate for governor allowed to purge voter rolls shouldn't he recused himself a secretary of state while he's a candidate\nLike Tim this is in reference to Georgia Republican gubernatorial candidate Brian Kemp who is the current secretary of state and isn't thinking about ... himself he's provoked a lawsuit by buddy more than fifty thousand new voter applications on hold for minor\nInconsistencies the lawsuit charges discrimination saying eighty percent of those applicants are members of racial minority groups\nThough they can't vote early or by mail they can still vote if they show up the right polling place with the proper ID\nOkay that that idea of proper ID that gets right to our next question Hi my name is Amy payment chart and I live in Omaha Nebraska\nWhen I heard about the Supreme Court ruling the ideas for voting would need to have a street address it didn't faze me and I heard that a lot of Native American reservations only have a post office address how is that going to affect their ability to vote\nWell they're complaining about it this has to do with a reason Supreme Court decision upholding in North Dakota voter id law which does require a current residential street address Native American groups say that off and on reservations they don't have those and pointing icy irony that the nation's original residents are being questioned about their residency\nK. A. WC dot org [noise] we are servants of Arizona western college and have been or more than forty five years we trusted news for the cause and you ... good morning thanks for listening\nAnd you must sunny highs near eighty eight today with north when ten miles per hour tonight mostly clear those around sixty a marker will have sunny skies in a high of eighty seven with north wind five to ten miles per hour day nights mostly clear lows around sixty three to breed\nA record of sixty seven in Yuma sixty seven and Parker [noise]\nSixty three degrees in St Louis thanks for listening to K W the [noise]\n\n[noise] ooh\nGood morning California is a heavily democratic state where he Republican congressmen won reelection for years what happened to this fall Democrats try and reading the house is MORNING EDITION [noise]\nComing up a California father and daughter in a different generation than radically different politics I'm David Greene in Laguna Beach California\nAnd I'm Steve Inskeep in Washington we also you're a critique of the influence of Saudi Arabia and money executives in Silicon valley wealth\nAnd also this hour Israel freezing American who was detained at an airport for more\nDo this Friday overnight Michael Steele the former chairman of\nCommittee is six years old\nNews is next\nLive from NPR News in Washington I'm core of a coalmine officials in Florida have reported new talent aides in the wake of hurricane Michael that has increased the storms death toll to at least thirty people across four states\nDamage assessment continues Florida governor Rick Scott is asking President Trump to boost recovery effort at ... air force base and fears on the low ... reports the hurricane wrecked airplane hangers and flooded buildings\nMore than twenty thousand Florida residents who worked at ... air force base last year according to the state's governor Rick Scott the base is a major economic driver in the region and it was home to ... billion dollar effort to stealth fighter jets\nSome were damaged by the storm in his letter to President Trump Florida's governor asked the president to quote direct immediate action to dedicate the needed resources manpower and funding to return to indoor air force base to pull operations as soon as possible\nDemocratic Senator Bill Nelson has been playing down the years that tend to will not be rebuilt\nAfter Hurricane Andrew destroyed South Florida homestead air force base in Nineteen Ninety two that'd be switched shut down\nOn you belong NPR News the County Florida\nA new NPR poll on life in rural America shows many people in small towns feel they are doing better than their parents and have a positive outlook on their economic future NPR's Kirk Siegler reports discounters stereotypes often portrayed by politicians and mass\nMedia the NPR poll was done in conjunction with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health many surveyed said their hometowns did face serious economic challenges but there's also optimism\nRob Clements lives in rural delta County Colorado one struggling natural resource base county that seen an influx of new people and jobs largely thanks to technology\nIt's fun to see you see people out on the streets with a smile on their face and you know I'm not worried about where their next paycheck gonna\nCome from climates daughter was recently able to move back to her home town to take a job with a local company installing broadband Kirk Siegler NPR News\nElection officials in Afghanistan have delayed parliamentary elections in the southern province of Kandahar\nElections in the rest of the country will proceed tomorrow Pamela constable covers Afghanistan for the Washington Post she told NPR's MORNING EDITION the election delayed in Kandahar follows a deadly Taliban attack yesterday on top of provincial officials\nObviously there are taken on murder [laughter] calm things down kind of very large product which is ... it's all you have different tastes governor integrate rewarded ... people are very worried that obviously they're dying for short term\nRelief that Washington Post reporter Pamela constable on Wall street the Dow Jones industrial syrup one hundred and Ninety five points at twenty five thousand five hundred Seventy one the NASDAQ is up nearly Seventy five Seventy five hundred fifty nine this is NPR\nA double you see news in Yuma I'm conjunction\nIt's Seventy five hundred fifty nine this is NPR\nFor K. A. W. see news in Yuma I'm can transcend amount accused of threatening the kidnapped and killed a U.S senator and his family has been indicted on federal charges here in Arizona\nArizona Daily Star reports the indictment filed October ninth against James Dean ... does not fully identify the victim\nOnly referring to him as the United states senator J. F.\nIn late September Arizona Senator Jeff flake said his family received death threats after he asked the Senate Judiciary committee to hear testimony from the woman who accused Supreme Court nominee Brett Kavanaugh sexual assault\nA spokesperson for the U.S attorney's office in Phoenix would not say of JFK and the indictment referred to Jeff Flake\nArizona western college and my great poets have teamed up to bring the community a series of stories and poems about life but the southwest border K W sees Jasmin our enough gives us the tale\nSoy tree then legs floor such topics as romance immigration education and relationships Martha Martinez Spanish professor at age WC says their overall goal for this event is to get the community and students and involved\nI think they will lean wave inspiration because that's one of the biggest hope you know that you get inspired to be able to even think about creating on where it you know after listening to what the point at the message that the ... getting their presentation\nMigrants a poet begins October Eighteenth and ends on the twenty first and then we'll be held in both ... and ... and in Mexico for more information visit our website Cade WC dot org I'm Jasmine I did not\nAnd for K. A. W. see news in Yuma\nI'm Jim Johnson\nSupport for NPR comes from NPR stations other contributors include log Meehan makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learn more at go to a meeting dot com and the listeners who support this NPR station\nData sick [noise] this is MORNING EDITION on paying WC eighty eight point nine of them and ... a WC dot org\nMorning I'm chip strangling thanks for listening to head on MORNING EDITION voters and California's forty eighth congressional district could help determine control of the house\nComing up why the Vietnamese American vote in orange county is key to the race that's in about Fifteen minutes on MORNING edition Yuma sunny highs near eighty eight today Parker sunny Eisner eighty seven\nSixty seven in ... and Parker sixty three in St Louis [noise] this is Kay a\nDouble you see this week on this American Life I'm pleased to present here in the Brooklyn Academy of music up or how they [noise]\nBut is it true stories like we always do this time to do a musical turned to the opera also play they\nWill never flew to a Muslim ... years later like perfectly or even married sweet ... for an evening at ... ...\nIt's MORNING EDITION from NPR News I'm David Greene and Laguna Beach California\nI'm Steve Inskeep in Washington DC President Trump has acknowledged what increasingly seems like reality are reporting a reporter asked him do you believe a Saudi journalist us resin\nWhat increasingly seems like reality or a ... a reporter asked him do you believe a Saudi journalist us resident Jamal ... is that [noise]\n[noise]\nIt certainly looks that way it's very sad [noise]\nThis marks one of the few occasions on which the president has endorsed the broadly accepted outlines of the case ever since the Washington Post writer walked into a shouting consulate and vanished in Turkey suspicion is falling on the Saudi Government get the president has suggested conspiracy theories about who could be responsible for a gruesome murder\nAnd said Saudi crown prince Mohammed bin Laden was being held guilty until proven innocent what does the U.S approach really mean for the Saudis and for Americans\nAnd for freedom of the press will talk that through with Victoria Nuland of the center for new American security she's on the line she was assistant secretary of state under President Obama ambassador to NATO under President George W. Bush came on\nGood morning Steve go with you know watching\nFrom the outside what does President Trump's goal appear to be\nWell I think it's important that President Trump seemed to acknowledge reality as you said in your opening that this was a grisly murder of a journalistic criticizing critic of the Saudi regime\nAnd that there are going to have to be consequences for this kind of extra territorial illegal at\nBoth the president also said unfortunately this has captured the attention of the world that's a quote from yesterday making it clear it seems that if this isn't really something he wants to be dealing with he would rather be making friends with this outage\nHere's today from tens noon right here on pay them you see\nI'm chip strictly thanks for joining us for MORNING EDITION ... it's a Nineteen Mm Saudi Arabia invested heavily in the U.S tech companies\nIf you have a start up and big dreams of changing the world making it a better place a lot of those people have been very happy to open up to Saudi investors more\nOn the close ties between the Saudis and Silicon Valley that's coming up and about Fifteen minutes on a double you see and later Mexican riot\nPolice are guarding the sort of southern border with Guatemala to prevent ... migrants from crossing on mass into Mexico there are part of the latest caravan\nOf Central Americans trying to make their way to the United states Yuma sunny today with a high of eighty eight degrees and I mostly clear lows around\nSixty eight Parker sunny eyes near eighty seven today and tonight mostly player lows around sixty three degrees sixty nine and ... sixty seven and Parker sixty five in San Luis ... this is K. A. W. see\nToday is Kay WC Dave sponsors Tommy Marino of yoga unfit encouraging listeners to celebrate evaluate your life day which is today Tommy believes we all need more yoga yoga on fifth eight forty south Fifth Avenue in Yuma information about class schedules videos in more at yoga on fifth dot com and on Facebook\n... this\nIs a double you see\nSupport for NPR comes from this station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first learned more it Raymond James dot com [noise]\nFrom Rhodes Scholar a not for profit offering learning adventures for adults and natural settings across the country and learn more at R. O. A. D. scholar dot org slash retreats\nAnd from gobble ... company that delivered semi perhaps meals to be finished at home in Fifteen minutes with one pan gobbled sous chefs do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep in Washington\nAnd I'm David Greene in Laguna Beach California there is a competitive race here\nIn California is forty eighth congressional district voters here might really help determine control of the house of representatives and we have been spending time\nListening to what is on their minds so this is Orange County it's home to the largest Vietnamese population in the United states' part of this district is actually known as little Saigon NTN Tom trend lives here she works in community affairs for a utility company she is raising two kids\nHer parents also live in this community but she\nSays their lives and her's are so different my parents are pretty much\nHer parents also live in this community but she says their lives and her's are so different\nMy parents are pretty much their lives are in little ... on my dad works at a pharmacy and so they'll either and the Vietnamese community right and for me I go out in the world I experience race it that I Know what it feels like to be discriminated against I I think my parents haven't because really they get their lives or hear\nTheir communities here they go to a Vietnamese math they go to their customers are being in these are our ... our diverse\nNow I realize my experience as an American very different from my dad\nAnd these generational differences extend into politics older Vietnamese Americans have tended to vote Republican many of them fled communism and they see Republican presidents from Reagan on as being tougher on communist leaders some younger people like ten term trend has been leaning more democratic and that is one reason\nThe party believe they can unseat the Republican incumbent here\nSo when we went to visit the anthem trim we had heard there were some political differences in her family though I'm not sure she herself new quite helped start they were\nHigh high she invited us into her parents' home her kids were playing around they were eating snacks and they were orbiting around the grandfather [laughter]\nHow Tran is ... father he primarily speak Vietnamese in his everyday life including when he talks politics with his daughter she's been backing Republicans since he first started voting in Nineteen Ninety two and he told me he was certainly no fan of president Barack Obama who he said just wasn't tough enough on the world stage\nWhom a window like him very much and then what now I guess we're today we have Trump what do you think of Trump so far [noise] sofa in this\n... Hindu roots do what do you like what do you\nYou're unemployed too you know low uh-huh and um stock market in a ... degrees so the economy is important to you yeah\nAnd that this is this is um I open it [laughter] [laughter] I didn't realize how he he thought of trying to see how they talked about that is the first time yeah I had a surprise because then I'll have a conversation about the other stuff\nThat he does against the media against like just civil society we grow up knowing how undemocratic Vietnam as the crackdowns on freedom of the class I basically writes\nWomen don't have the same rights there and to see some of that happening now in America you know in some factions of government is scary because that was something that I never really to match and\nWe would be in a situation where we have a president that basically calling to press the enemy of the people like we hear that from communist Vietnam but we don't hear a you know I Would never have imagined that would be reality here today\nCould you say that you're dead and yeah I'm just I just wonder why when Trump calls the media enemy of the people what your reaction to that\nMany of ally like I'll go call and tell you about GM\nNeither do the same time the press talk about what the ... but they don't care about it through thing you're just has so yeah CNN again from red fossil both him\nSo they're not they're biased yeah Fox News clearly is by it and I don't know if you're dead to mount the al ... and a lot I think it allows apple I'm Trump boxes like try to you know make a phone [laughter]\nDo you think you think the media is too negative about Trump but it's not fair\nTo say that Russia\nYou think you think the media is too negative about Trump that it's not fair to say that Russia interfered in to the left in this country\nMhm but when they know that why they don't last in before the election [noise] the way on the hill from\nBoth elected and the makers shoot\nSo if if they find out that Trump worked with yeah the Russians where that would that bother you yeah you don't you don't believe that yeah [laughter]\nThey're doomed proven that don't need to believe them\nYou know through the night on either at me I just don't know ... ... not at all huh he believes\nThat the Mueller investigation should continue so that they have we have the facts I agree with that\nYeah so something you agree on yeah there are a lot of families who've been divided over their views of from what you hear like dinner conversations that yeah that go really badly in I mean people get it from the table yeah it I mean this is it doesn't seem to be happening in this\nNo because I don't think our country should be torn apart because of one person\nI clearly have strongly against you know what the president stands for but I also believe it's important to me I respect my parents I Know what their experience has fan and and we came here say that we can have the freedom to have different views to have these kind of conversation said they don't happen in Vietnam and so the fact that my dad\nHas a different view from me on this particular issue that doesn't bother him because we have that freedom that's why my parents' lead Vietnam to be here in the first place\nEverybody got to go to vote yes you would fall choice and for future either we're tending\nTo think everybody should vote\nYeah and my father I didn't mention any he ... after the war he was a political prisoner for ... banging on the other two year three years he was held in a political concentration camp I Know they\nThey do a re education to get him\nYeah we're the communist tries to you know basically get him to change its thinking\nIt is powerful to hear you say that people should vote coming from mhm\nThe history that you have yeah I just think we need to protect our democracy\nHas no water bowl we both wrong or right because the if we were wrong\nAnd that time we make it dry how we have another chance we have a ...\nThat was ... trend and her father couch trend there to voters here in orange County California and we're going to take you to other corners of this district elsewhere on the program this morning this is NPR News\n[noise]\nTime I replayed over this week on science friday a sleep sciences spill the beans on insomnia night animals and that\nThere is a generation of younger people who frankly do not believe the stories\nThat their elders and their elders are like in their thirties and forties the case of Silicon Valley do not believe their stories a bunch of people coming up in the valley frankly have a much more sophisticated understanding of power the very power they wield and the privileged they wield\nThat some of the people who founded these companies have been catastrophic Lee blind to\nOn a bearded us is the author of the book winners take all thanks very much for coming by\nThank you Steve are you an American graduate student has been released from the airport in Tel Aviv after being detained for more than two weeks we have more from NPR's Daniel Estrin in Jerusalem lower\nCost them is twenty two years old and a recent graduate of the University of Florida\nShe landed in Israel at the beginning of the month for a master's program and human rights at an Israeli university but authorities at the airport denied her entry under twenty Seventeen law banning activists affiliated with the pro Palestinian campaign to boycott Israel\nAll costs I'm used to have a small chapter of a pro boycott student group but now she says she no longer supports the boycott she was held at the airport while she fought in court for the right to enter Israel\nHer story caught international attention following several other cases of Israel detaining left wing critics at the airport and border and it caused some embarrassment in Israel\nAnd then I have some of the other than that\nForeign minister cp ... two Bailey told Israeli radio last week that Israel the ban on all costs him was not very successful she said Israel should reconsider how it applies at century ban when it turns into an international issue we lose more than we when she said but Israeli strategic affairs minister ... ever done\nPlight adventure ... band when it turns into an international issue we lose more than we when she said but Israeli strategic affairs minister ... ... who led Israel's campaign to ban all costs them defended the move\nThe little guy and he said don't just look at article in New York Times and the media is critical of Israel he argued there are thousands of pro Israel students and the un who contend with pro Palestinian activists on campus\nWho will support or move without cost them proponents of the boycott divest meant and sanctions movement say there peacefully protesting Israel's treatment the Palestinians but Israeli leaders have called it a campaign to undermine Israel's legitimacy of the country\nLaura customs case reached Israel Supreme Court which ruled that I'll caught some had not been involved in boycott activities for more than a year and had demonstrated an academic curiosity about Israel she was released from the airport yesterday ... is her lawyer victory for free speech\nAcademic freedom and there were a large ... ... ... so I think had absolutely no place in a democracy\nA right wing Israeli activist groups that it would be closely monitoring all costs him during her time in Israel to ensure she did not promote a boycott the Hebrew University of Jerusalem which had supported al ... case in court that looked forward\nTo having her on campus next week Daniel Estrin NPR News Jerusalem this is NPR News this\nIs K. A. W. see eighty eight point nine of them and K. A. W. dot org I'm chip struggling\nYour tune to MORNING EDITION coming up John Carpenter maybe best known as a horror film director but he's also an accomplished musician scored most of his own film carpenters back with a new Halloween featuring his four [noise]\nK. A. W. the is supported by a federal credit union a not for profit financial institution that's locally owned and operated with five full service branches in ... and ... counties found it in Nineteen forty two eighty a has been helping members achieved their financial goals every day for over Seventy six years\nMore and more at ASTU dot org or note is up next [noise]\n[noise] [noise]\nIf you live in North America parents can often seem like exotic ambassadors from the far off the jungles of Brazil or the wilds of Australia especially since North America is once common native species the Carolina parakeets has been extinct since the early twentieth century [noise]\n\nBut more and more parents are making this continent their home since the Nineteen sixties at least amongst parakeets have been free flying and reproducing in the U.S\nWhich is to say they have become naturalized amongst packet with lime green that gray and yellow under pirates and deep blue wings is also known as the Quaker parrot\nAnd it's a native of southern South America\nInitial fear that if we get a state agricultural crops haven't materialized and it's become the most numerous ... and the country [noise]\n\nMost parents case now have self sustaining populations in many areas across the country Chicago Dallas New Orleans Portland, Oregon and Bridgeport, Connecticut among others\nSo clearly in the wild they can gradually acclimate to cold and most parakeets are not alone by two thousand Fifteen at least a dozen other foreign parents species were nesting in the U.S [noise] for Britain I marry me can support for bird and out comes from the ...\nForeign parents species were nesting in the U.S [noise] you know I mean we can\nSupport for bird note comes from the Puerto Ricans tourism bureau insulin February's whooping crane festival and hundreds of species of birds to see year round and visit port Iran's is dot com\nSupport for NPR comes from the station and from the ... foundation fostering improvements in learning and enrichment for disadvantaged children and the vitality of the art for everyone ideas at wallet foundation dot org\nFrom the science same foundation since Nineteen eighty five supporting advances in science education and the arts towards a better more just society more information that's available at size seems foundation dot org\nAnd from the John D and Catherine T MacArthur Foundation asked Mac found data work\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep the United states is not the only country debating how to protect its southern border Mexico a country to the south\nIs also trying to secure its southern border the border with Guatemala authorities are sending soldiers immigration agents and federal police there they're aiming to stop a caravan of migrants who are hoping to leave Central America\nAnd in some cases cross through Mexico on to the United states James Frederick reports from so you're not at all go Mexico\nTwenty three year old son during daisy crews who says she's playing an abusive gang member boyfriend crust into Mexico two weeks ago but then on Thursday she turned around after making a decision to head back south towards the border with Guatemala to join a rally for the migrant care of\nA winter they last the last\nTime\nShe says she came to support her fellow hunger and to be here so they don't feel alone [noise]\nCrew's joined about fifty other migrants an activist since you like to go a town that sits on the Mexico Guatemala border\nPolice and activists soon clash and chaos broke out and you can hear on the cell phone video from the city [noise]\n\nEating ... Mexican American migrant activists who helped organize a similar my grand caravan in the spring the first part to President Trump's higher federal police alleged ... previously vandalized an immigration vehicle as migrants tried to stop move because of rest crusade police got rough with everyone even women and children\nThey made me she says an officer told her to shut up they pointed a gun to her seven year old son and\nThreatened to kill him to others present during the incident corroborated her story\nSpokesmen for Mexico's federal police tells NPR he was not aware of that specific incident and says activists initiated the aggression cautioned the Mexican border town is a foreboding sign of what has to come as a caravan of thousands gets closer\nDozens of federal police in riot gear have already been stationed on the bridge connecting Mexico in Guatemala Mexico human rights commission came to the lady that was going to try and head off the tensions\nThe group's spokesman at the course of Sosa says he wants to Mexican police to keep one thing in mind is the caravan approaches\nTo assemble ... senior citizen uses if we're fighting for the rights of Mexican abuses in the U.S he says the least we can do is respect the rights of\nOur Central American brothers and sisters here in Mexico while\nMost they're still on their way about four hundred migrants from the caravan are already just across the border and the Guatemalan\nOf mine [laughter]\nIt's a peaceful compared to the clashes next door in Mexico families relax in the shade chatting and laughing eating and drinking donated food and water than you\nCompared to the clashes next door in Mexico families relaxing the shade chatting and laughing eating and drinking donated food and water and you have a twenty nine year old single mother for who says their families flee gang violence doesn't want any trouble with authority Sunday fast she says\nWe come with a spirit of intention to use violence nothing like that were just looking for a\nBetter life but as things stand now race for children and the other migrants will be met by force at the Mexican border for NPR News I'm James Frederick ... Mexico\nAnd thanks for listening to your public radio station which brings you MORNING EDITION and get the latest news this afternoon on all things considered", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Yuma", "day": "19"}