{"month": "10", "state": "AZ", "station": "KAWC", "content": "Dot com business eighty eight point nine FM chain a W ... J. A. W. P. Parker and K. A. W.\nYou may ninth ... use twenty street near the you make ... you can find the details that you'd be mad at ...\nDot com business eighty eight point nine F. M. T. A. W. see humor T. A. W. P. Parker and K. A. W. C. dot org a service of Arizona western college more than forty five years trusted news for ... and the ... counties\nIt's five o'clock NPR headlines is up next followed by MORNING EDITION\nSunny skies today in your mind you're Ninety One degrees some north northeast when throughout the day around five miles per hour clear skies in the evening with low up around sixty six to impress good sunny skies Jaime or Ninety One mostly clear in the evening with ... around sixty degrees and some north wins a five to ten miles per hour thanks for listening\nTo\nMorning President Trump replace some of his usual attacks on Democrats in to make news CNN with the call for civility last\nOn MORNING EDITION from NPR News\nPresidents still got in some being said Democrats his call for civility came after packages containing pipe bomb ... democratic leader I knew it came\nOn David Greene Alaska former FBI official how the investigation into packages going way out\nLater we'll meet a pastor who wants to give evangelical voters turning away from President from a home\nSaudi crown prince amid allegations over the killing of a journalist actively for more than they are over twenty fifth\nBirthday party I don't remember when Darrell from your office Dr Craig Robinson [noise] there's the new\nMind from NPR News in Washington on corporate Coleman believes in New York City are investigating another suspicious package that's been found in lower Manhattan New York state governor Andrew Cuomo told NPR's MORNING EDITION the latest package was discovered at the business address of actor and liberal activist Robert De Niro\nIt is a similar looking package or we don't know yet if it is the same as the packages that we've seen goes for\nThis appears to be the eighth suspicious package sent this week to several democratic leaders are liberal activist law enforcement of for authority said those were pipe bombs one was addressed to former CIA director John Brennan but was delivered to the New York offices of CNN\nPresident Trump is tweeting this morning that the anger today in our society is caused by the media he demanded that the media quote clean up its act fast exclamation point he was more subdued on Wednesday at a campaign rally as NPR's Tamara Keith reports\nAt a campaign rally in Wisconsin President Trump's skipped over his usual attacks on Hillary Clinton and congresswoman Maxine Waters instead saying those engaged in politics should stop treating their opponents as being morally defective\nTrump also pointed out that he was maintaining a comment even tone in contrast with is typical rally performances\nAnd I'm trying to say that very nicely in front of the [noise] she normally I screamed they want us socialists take over that was once a socialist took over [noise] I'm trying to be nice [noise]\nWe're all behaving very well he said it's not clear how long it will last Trump's next rally is friday with several more in the works before the mid term elections camera Keith NPR News\nProsecutors in Saudi Arabia now say the killing of dissident journalist ... was premeditated is this latest story changed by the Saudi Government about ... ...\nThe killing of dissident journalist democracy showed gene was premeditated this is the latest story change by the Saudi Government about ... genes death an ... NPR's Peter Kenyon reports Turkey's president had spoken with Saudi crown prince Mohammed bin Salman\nTurkey's state news agency quoted presidential officials are saying the phone conversation between president ... and the crown prince included a discussion of what step should be taken in a showcase separately to Washington Post report CIA director Gina Haspel\nHeard audio evidence related to show these killing which president air to one this week holiday Savage in premeditated murder the journalist was last seen entering the Saturday consulate on October second it took more than two weeks very odd to acknowledge he died in the consulate calling it an accident an explanation aired on dismissed\nAfter a lengthy delay the Saudis granted permission Wednesday for investigators to search a well on the consulate grounds Peter Kenyon NPR News ...\nThe national weather service says the east coast may see a nor'easter this weekend a storm system will combined with remnants of hurricane Wilma\nIt's NPR\nThe world famous Cleveland orchestrated fired two musicians an investigation found that men engaged in multiple instances of sexual harassment against female colleagues and some students from member station WBUR cp and Idea Stream in Cleveland Adrian mom reports\nThe findings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades producer was the orchestras concert master the ensemble leader after the conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player must be ... Rosa based on dozens of interviews and documentary evidence investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy and a confidential hotline for NPR News I'm Adrian ... in Cleveland the\nJoint type in warning center said super typhoon YouTube has crashed over the Marianna islands in the Pacific Michael Sullivan reports from Thailand the storms top sustained winds were one hundred eighty miles per hour\nThe Murray on his are used to typhoons but this storm ... Penn resident Glenn hunter told the Associated Press was different\nWe knew it was going to be big you said but while the island opinion was the hardest hit its medical center badly damaged and many of the commonwealth population abruptly fifty five thousand people are hunkered down in shelters waiting for the storm to pass Michael Sullivan reporting\nOn corporate Coleman NPR News from Washington\nSupport for NPR comments from NPR stations other contributors include a log me in makers of go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to meeting dot com\nThanks for listening to NPR's MORNING EDITION on K. A. W. see eighty eight point nine at them and K. A. W. C. dot org does ours lead story coming up and just a moment\nLearn more about us and visit Kay WC dot org for our latest coverage bottles on her staff in more MORNING EDITION continues next it's five or six\nIn Parker sunny skies and the high of Ninety degrees north west when five miles per hour today tomorrow sunny skies and a high of Ninety Yuma will have sunny skies and a high of Ninety do today\nNorth northeast when five miles per hour tomorrow in Yuma sunny eyes near Ninety two degrees visit you present the oldest is ...\nFive miles per hour tomorrow and you must sunny I near Ninety two degree\nVisit you present ... says celebrating craft beers from around the region would live music ... and long games it'll be the Saturday from five to nine PM at those are some stadium if you'd like more information you can reach us at nine to wait three or four seven six nine zero the weight as\nBelonging but it won't be long now are you ready to come a time when\nElections are about senator and governor is battling for power but the midterms aren't just about who wins and who loses or even which candidates at what they're about by you vote there about issues in your community there about you listen to all things considered and hear the bigger picture every afternoon from\nNPR News [noise]\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm now working in Washington DC police in New York City are investigating another suspicious package it was found early this morning in Manhattan's try Becca neighborhood New York governor Andrew Cuomo told NPR this morning it was sent to the home of actor Robert De Niro who is a prominent critic of President Trump\nNow that package It's MORNING follows at least seven packages containing but are described as pipe bombs centers senior democratic leaders yesterday including former president ... Obama and former secretary of State Hillary Clinton\nCNN's office in New York also got one of the packages and two days earlier an explosive device was founded the home of billionaire philanthropist George Soros\nNow these individuals and CNN of all been critical of the Trump administration's\nThis is now in the hand of federal investigators including the FBI so we reached out to former CIA deputy director John Pistole to find out what there'll be looking for going sir\nGood morning Noel\nAren't so we have a situation involving live explosive devices apparently intended to do harm what are the FBI and other federal investigators trying to determine at this stage\nWill surely the key is trying to do to fight the perpetrator or the the individuals who are responsible for marijuana devices\nAnd they're really looking at it from a two perspectives one is the forensics that is involved in each of the devices and the fact that there are multiple devices is actually very helpful to the investigators\nBecause they can compare and contrast and and just get a richer picture if you will of that forensic data set and so that includes things like is there are their fingerprints ... DNA or the hair fibers just different things that the\nJews from the CBC airs this afternoon from two to three on K. A. W. see eighty eight point nine of them and gay WC dot org I'm chip strictly thanks for joining us early on this Thursday morning\nNPR's MORNING EDITION continues in a moment it's five Nineteen\nYears in the western coast either department will be presenting performances of trials a murder mystery mix with social commentary\nThere'll be putting a performances friday and Saturday at seven thirty PM and Sunday at two thirty PM out to eat and we see the there on the human cap is if you like more information you can reach us on line to wait three or four seven six nine zero in\nYuma sunny skies near Ninety two today with north northeast when five miles per hour denied in Yuma mostly clear lows around sixty seven Parker has sunny skies and I of Ninety degrees with northwest when five miles per hour tonight mostly clear those around sixty one degree\n... learning center is hosting an exhibit on she got so out of this featuring female an artist was at least nobody's gonna sell is human is ongoing from now through November ninth Monday through Thursday from idioms and feminine PM and Fridays from nine AM to three PM at the ... learning center which is located at one three four zero eighth avenue in San Luis [noise]\nSupport for NPR comes from this station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks into Andrew rentals and new episode every Friday on prime video\nFrom it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at Lausanne dot com [noise] from the ...\nThe tools and practices to help teams plan track build and work better together more at Lausanne dot com\n[noise] from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go and from the listeners who support this NPR station\nThis is MORNING EDITION from NPR News I'm David\nGreene and I'm Noel King good morning the u._s. stock market looks ready to recover some of yesterday's dramatic losses when Wall Street opens this morning most Asian markets were down overnight the Nikkei hang saying that the Shanghai stock exchange was stable which was unexpected because\nChina stock market has fallen thirty percent since January and its currency is falling to its lowest level against the dollar in nearly two years\nNPR's Rob Schmitz is with us from Shanghai good morning Rob\nGood morning while I was thirty percent top pertain to stock market sounds pretty darn bad what's going on [noise]\nWell China's economy has been lagging for the last few years the government dealing with a lot of problems you've got public debt spiraling out of control you've got a fairly significant property bubble and through all of this Beijing's making painful changes in how China's economy runs moving from\nAn economy based on building things to one based on buying things and the downturn in China stock market this year reflects that\nBut it's important to remember here that when China stock market dropped by thirty percent like this year it isn't going to have\nAs big an impact on the economy like if the ... the Dow fell by the same percentage and that's because in the U.S much of the country's retirement plans are invested into the stock market but not in China it's still relatively young market and it isn't a great indicator of the overall economy at say the value of China's currency\nAnd let me ask you about China's currency the UN is edited weakest level against the dollar and nearly two years and President Trump says Beijing is keeping its currency low to make exports cheaper which could give China an edge in a trade war is China manipulating its currency\n[noise] well it's interesting hearing well is that China is likely many blending of currency what it's doing so in the opposite direction of what President Trump is accused China of doing\nYears ago China used to weaken its currency to make exports cheaper but that's not what's happening now what's happening now is that the u._s. dollar is stronger and this is putting pressure on the un to weaken and Beijing has stepped in to try and prevent it from weakening too fat\nChina is doing a China doesn't want its currency to depreciating too quickly because it can lead to inflation and that's the last thing China needs right now so if China should get out of the way and stopped managing its currency like the UN would likely we can much faster which is what Trump does not want because that could lead to an even bigger trade deficit between the U.S and China\nAre these terrorists that President Trump is imposed on Chinese goods having a a big impact on the economy there\nWell from a kind of I'm speaking to it's a little early to tell us tariffs are certainly having a deep psychological impact on the movers and shakers here in China's economy\nIn my conversations with business owners here I keep hearing stories of how companies are making plans to move parts are sometimes all of their supply chains to countries in Southeast Asia to avoid this trade war and that of course does not bode well for China's economic future\nBut it's important to note here that even without the trade war with the U. S. China's economy was already vulnerable from a host of economic problems that are finally coming home to roost\nNPR's Rob Schmitz in Shanghai thanks up ...\nAccording to a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change Silicon Valley has been at work on a solution for years often promising quick fixes blocks chain the technology\nFacts of climate change Silicon Valley has been at work on a solution for years often promising quick fixes blocks chain the technology behind crypto currency like bitcoin is the latest solution coming from big tech member station KCRW in December net has more\nUntil about a year ago hardly anyone in climate science\nIs talking about watching but at the recent global climate action some in San Francisco it was all over the place and they were an old papers people were talking about how he could help mitigate climate change in all sorts of\nLand use agriculture or if it's oil which of course racial\nOur common coaches the climate change coalition he came to the conferences spread awareness about ... [noise] so what is it\nA long chain or distributed electric technology really references a larger ecosystem of technologies okay [noise]\nI think of it like ... ... is like an accounting book everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank but it said on the computers of everyone on the block chain\nTransparency of the main advantage ... tons of new companies are springing up saying that they will use the transparency block Jane to solve all sorts of problems everything from curing cancer to ending human trafficking and now even climate change\nIts it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world pitches he's the CEO of a new Silicon Valley company called ...\n... the black chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credit systems the total number of carbon possible to admit it kept and then companies can buy carbon credits that let the amendment more\nEconomists love this market based solution but there's a problem when it comes to counting the carbon\nCarbon markets in the past have been plagued with issues of fraud and double counting\nNobody wants to use block chain to verify the accounting and to go one step further to create a market for people taking carbon out of the environment\nNot a company has been launched yet but that isn't limiting the ambition of the sales pitch\nYou want to make the whole climate change problem just go away so do scientists like Douglass McCauley yeah I Wish it was that easy\nBecause he's a researcher at UC Santa Barbara you said the danger of silicon valley's big promise disrupt everything eat those is that it suggests there's a quick and easy solution that things that fix climate change are going to be really hard like getting countries to cut emissions or people to stop driving cars the pollute\nBecause it before it was blocked Jane artificial intelligence in big data were the hot new things and\nThese are proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the shiny thing started talking about exactly how to apply it usefully\nIs watching could help with things like counting carbon credits or keeping track of say how many trees a company is planting to suck carbon out of the air Katherine mocking a climate scientist at Stanford agreed but she says it's dangerous to believe block Jane will be some kind of a miracle cure\nIt's essentially Ken kicking ethics where we won't be putting into place that ... that are actually more important to make the entirety of the problem something that's how people\nWith a clock ticking on climate change and ... there's no time to waste sorting facts from hike\nFor NPR News I'm Sam honey\nThis is NPR News\nThe Democratic nominee for governor in Illinois has contributed more money to his own campaign than any other candidate in history and voters don't like that it's\nThat says well please let me now ...\nThat's Katie say the organizer of voters not politicians she had put up a similar ... years ago and nobody in like that but this time people clicking the like button and they actually wanted to help\nAnd then here is very have higher frame than it is that our campaign has\nThey showing off voters not politicians knew which field office the redistricting initiative she launched had amassed hundreds of volunteers and raise more than a million dollars in donations and everything is donated from old computers to the furniture which at people's names taped to the bottom so that they can get their chairs and tables back I'm\nHoping to find that coffee maker that can be done on that some food and stuff like that and\nNow lawmakers in power get together and draw district lines of forgetting them approved by the governor Mike ... is senior redistricting\nThat and right now lawmakers in power get together and draw district lines before getting them approved by the governor Mike ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan's maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten so far more votes overall\nThe redistricting proposal would create a commission made up of for Republicans or Democrats and five independence a majority that includes a mix of all three would have to agree on the map\nBut the opposition calls the proposal an expensive way to change the system that already works when delete harbor is a Republican and has worked for for secretary that state she says this whole thing it's skewed to help Democrats\nThe gimmick bypasses\nAre elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government or any porn is president of ethics MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head and twenty sixteen\nPeople were dissatisfied with the government the federal level is really looking out for a members of Congress should their donors and corporations and their lift over the coals\nPulls looking at the redistricting proposal show it's been gaining popularity over the last few weeks when it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal\nWhy should the parts in an office get to decide like who gets to vote in that area when I have a right to choose in and it just makes me wonder well how much right to do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decision seem all but certain for NPR News I'm Shana wrong in Lansing, Michigan\n[noise] this is NPR News\n[noise] next I'm On the world residents love their small island town of ... of Alaska but climate\nChange is helping make their island disappear and leaders in Washington say they can't help what happens up there is an important bellwether for what's going to happen to the rest of the coastal areas stays Alaska on the brink it's on the world [noise]\n\nJoin us for PR eyes the world this evening from six to seven here on gay WC eighty eight point nine of them and the cage WC dot org\nNPR's MORNING EDITION returns in a moment today's Climate Connections is coming up next I'm chip strangely it's five forty three\nIrish friend going here I was raised in the Catskill Mountains of New York\nEarly age she experienced the hardships extreme weather because when I was six years old [noise] my family was forced to farming\nEarly age she experienced the hardships extreme weather this off when I was six years old my family was forced to stop funding for a living due to fly in the span of five years we had to one hundred year flights and won five hundred year five [noise]\nAnd when the five hundred year flood hit our field for washed away all of our top soil and put all of our equipment underwater it was devastating for my family today\nKilling him as a college student she said to the specially important for young people to demand that elected officials act on climate every\nDecision that is being made today it's going to have an impact on our lives so and young people in our own best interest to be involved and take action\nAs part of a group called zero hour she helped organize the lobby day and you'd climate march in Washington DC last July\nShe says it was inspiring and her peers want to keep the momentum going\nAnd we are going to continue to fight for our future for our lives and for our community is\nClimate Connections is produced by the center for environmental communications\nDetail Climate Connections dot org [noise]\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at ... dot org [noise]\nFrom the Pew Charitable trust celebrating Seventy years of serving the public learn more at Pew trusts dot org slash Seventy\nAnd from the John F. and James Alan nice foundation helping NPR advanced journalistic excellence in the digital age\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday paying tens of thousands of dollars to the families of top flight basketball recruits one of those convicted James gotcha worked for Adidas\nAnd steered certain students to Adidas sponsored colleges schools with storied basketball programs such as University of Kansas and little for among them ... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nNow joining us to talk about this case and what the NC double a can do to clean up corruption and college athletics is Washington Post sports columnist Kevin Blackistone also familiar voice on our program had their Kevin hey how you doing I'm good thank you so what does all this mean for college basketball as a whole what happened yesterday you know I'm not sure it means anything for\nBasketball um in in total because what happened here was a pretty isolated incident um but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball\nFor as long as I can remember and that is basically channeling of money from a one source um to the families of talent\nUm to ensure that that talent goes to a particular school and what has happened over the years is that the uh manufacturers of of basketball shoes Adidas\nA Nike or those those uh operations has gotten people in the middle of them um to help transfer the money so that the surprise here is that it has been criminalize or by the federal\nTo help transfer that money so the the surprise here is that it has been criminalize or by the federal government as opposed to be policed by uh the NC double A. as it's been done for years\nAnd it used to be that the worst thing that would happen in that situation is that a someone would be banned from the NC double a a coach who was who was caught um funneling money or or some middle man\nNow there's like ... which is which is a step ...\nNow you could possibly go behind bars which is uh what these uh these three men are facing\nWhat you have these three men facing that you say um but I Want to your colleague at the Washington Post Sally Jenkins room recently that the real defended here should be a university but the universities are actually considered victims and all of this did you see at the same way that she does\nI I don't see it that way but that was the way that the federal government decided to get involved and it's basically they said that the ... universes were being defrauded 'em by the system ah because by funneling this money um\nTwo players are are players families um these people knew that they were making these players in eligible under NCWA rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the university that he'd given them scholarships\nAnd therefore they had to fraud at the universities of of value which is a very strange thing to me because I still don't know\nHow that's fraud I mean universities or a University of basketball programs and football programs are still going to get these talented players under they're very um a low level of remuneration a for athletic talented brings them um tens of million dollars in revenue every year\nTrusted news or ... and ... counties it's six o'clock\n... resumes ... celebrating craft beers from around the region would live music deed and long games it will be the Saturday from five to nine PM at those are ... if you'd like more information you can reach us said nine to wait three or four seven six nine zero\nIn Parker sunny skies in a high of Ninety degrees northwest wind five miles per hour today tomorrow sunny skies and a high of Ninety Yuma will have sunny skies in a high of Ninety do today north northeast wind five miles per hour tomorrow in Yuma sunny eyes near Ninety two degrees\n\nWho good morning who said pipe bombs to prominent figures three we're central locations in New York I'm more suspicious package was discovered this morning when your governor Andrew Cuomo on MORNING EDITION from\nTimes we have to unify those are the words of President Trump as the bomb scare unfolded later at a rally in Wisconsin He again took aim at the News I'm David\nGreene and I'm Noel King owns it is our New York paternity generally suing Exxon Mobil claiming the oil giant misled investors about climate change\nAnd it's super typhoon swept across the northern Marianna island devastating of\nManila for the latest news there's too many\nThirty four years old and the news is next\n\nLive from NPR News in Washington encore of a coal miner news reports say yet another suspicious package has been intercepted in Delaware mail facility it's apparently addressed a former vice president Joe Biden the Democrat has a home in the area\nI mean I'm a law enforcement officers in New York are investigating a suspicious package found earlier today at an address associated with the actor Robert De Niro\nNPR's Hansi Lo Wang reports similar packages with explosive devices were recovered by authorities from the address is a top Democrats and the New York office of CNN\nSpokesperson for the New York city police department sets the package which sent to an address link to a restaurant owned by Robert Deniro it was discovered early Thursday morning in Manhattan's tried that can neighborhood and why pd says look similar to a package the police recovered from CNN to New York offices\nThat package contained an explosive device near governor Andrew Cuomo told NPR's MORNING EDITION that law enforcement are trying to find out more about the package sent to the nearest business to dress\nFuture great New Yorker he's also has a political voice and he's also spoken out on his political science\nWeek authorities had intercepted bomb Center for President Obama and\nHe's also spoken out on his political\nThis week authorities had intercepted bumps into former President Obama and former secretary of State Hillary Clinton undo along NPR News New York\nThe Dow Jones industrial average in the S P five hundred are poised for some gains when stock markets open in about half an hour stock futures are trading up despite it's still often most Asian markets as NPR's Yuki Noguchi reports\nYesterday us sell off brought both the doubt an S. and P. back down to the same level where they started a year those declines were led by technology companies and the losses continued to ripple through Asian stocks overnight\nMost of the Asian markets closed down with Japan's Nikkei taking the toughest hit losing three point seven percent\nEuropean tech stocks started their days in a down to as well but markets there have mostly rebounded dimmer forecast from corporate earnings and concerns about a slower global economy had made investors jittery and the world's markets volatile ... NPR News Washington\nOn Saudi Arabian prosecutor says the killing of dissident journalists democracy showed gee was premeditated that reverses the earlier claimed by the Saudi Government that is death was an accident NPR's Peter Kenyon says the latest shift came in a statement from the Saudi foreign ministry\nAfter insisting for two weeks they showed you left the Saudi consulate in Istanbul freely Saudi officials acknowledged his death saying it was an accident during a fight now that story is also been abandoned in the face of growing evidence that killing was premeditated Eighteen people are under arrest and president ... they should be tried in Turkey\nNPR's Peter Kenyon automaker Ford says it's recalling about one point three million of its focus Compaq modeled there's a problem with the fuel system that could cause engine to stall affected Ford Focus models were produced from twenty twelve to twenty Eighteen\nIt's NPR\nThe joy typhoon warnings Duterte said super typhoon YouTube has crossed over the Murray on an island the U.S territory in the Pacific\nIts current top sustained winds are one hundred sixty six miles per hour although there are reports the winds were much stronger when they passed over the islands a settlement has been reached in one state's legal effort to revoke the licenses of an operator of shelters for undocumented immigrant children\nFrom member station kj ... Matthew Casey reports on the deal between Arizona and the company called south with key programs\nSouthwest key programs will pay or ozone uh Seventy three thousand dollar fine surrender two of its day licenses and stop taking in more immigrant kids that it's eleven remaining Arizona shelters until state officials say they can continue\nOverly economy as as what the un Cajun reunite families coalition which has demanded Arizona do more to protect children at southwest key facilities\nWhere especially glad that they instituted a third party healthcare consultant to secure compliance\nOne of the licenses southwest keep plants to give up his first shelter that federal officials closed in September following allegations that workers had physically abused kids for NPR News I'm Matthew Casey and Phoenix\nThe national weather service says the first nor'easter of the season will develop this weekend frontal systems are absorbing the remnants of hurricane Wilma and will spread thunder storms across much of the southern east coast by tomorrow\nAs the storm moves into New England by Saturday forecasters are predicting wintry precipitation along the coast\nI'm more of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow\nWho believes in modern approach to wealth management starts with asking questions and providing straightforward answers\nCharles Schwab own your tomorrow learn more at ... dot com Andy any e Casey foundation\nSupport for NPR comments from NPR stations other contributors include Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at ... dot com\nAndy any each case the foundation\nIt six six [noise] this is MORNING EDITION on paying double ... eighty eight nine of them and paying a W dot or coming up in the next half hour on MORNING edition listen for birds\nAnd humans sunny day lives near Ninety two degrees north north easily under five miles per hour [noise] night mostly clear lows around six seven marker has sunny skies and I am Nineteen degrees in the northwest within five miles per hour pay\nNight mostly clear those around sixty one this is Kay hey WC [noise] I'm chip strangely paranormal\nPsychics by hunter is not a plot twist from stranger things it was a U.S army project and\nIt appeared to me first as a shark and over the course of just the trouble remote viewing shows will determine that they were showing\nHow the U.S army's psychics to spy on Russia for the\nNext time onto the best of our knowledge NPR\nSunday mornings and continuing on ... the ...\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC and I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mocked people he disagrees with\nA very dishonest person look at ... first thing is I don't get paid by so rose or somebody\nI have no confidence and a guy like Brennan I think is a total loss of life remember\nWhat President Obama that you cannot manufacturing\nJobs that they don't know what's going on when you listen to Eric Holder talking about kicking Mack say low IQ individual\nNow though he is calling for civility after at least seven apparent pipe bombs were male to his political opponents at a rally in Wisconsin last night President Trump condemned these incidents\nThe full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice we will spare no resources are expense in this effort\nAnd speaking yesterday at a campaign event in Florida former secretary of State Hillary Clinton said much the same thing\nIt's a time of\nDeep division\nAnd we have to do everything we can to bring our country to gather\nOkay so what we know at this point suspicious packages were sent to at least three destinations in New York including the offices of Hillary Clinton also the home of billionaire philanthropist George Soros one addressed a John Brennan the former CIA director under President Obama ended up at CNN New York offices\nThis was actually center bought walls\nMeant well some in the\nWe're in now airs today from noon on a chip trailing thanks for joining us for MORNING EDITION six Nineteen\nMen Parker sunny today with a high near Ninety degrees in northwest when ... miles per hour denied and Parker mostly clear those around six one in Yuma sunny today with a high of Ninety two degrees north northeast when five miles per hour\nMen's denied and human mostly cleared flows around sixty Seventy degree is Kay ... do you see [noise]\nArizona western college theater department offers try\nA murder mystery mix with social commentary it continues every Sunday with a friday and Saturday shows are at seven thirty in the Sunday performances at two thirty PM at the WTC theater on the humor camp [noise]\nMore and more information\nYou can contact a W the\nAd nine to a report born seven six nine zero [noise]\nSix nine zero [noise]\nIs K. A. W. V. radiate point nine of them and they do well you see God or MORNING EDITION from NPR continues neck rings we're listening [noise]\n\nSupport for NPR comes from the station and from log me in makers have go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learned more if I go to meeting dot com\n[noise] from the F P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane now will widely Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm David Greene eight out of ten white evangelicals voted for President Trump's been twenty sixteen impulse suggests they continue to strongly support him\nBut the head of the midterm elections new group is trying to carve out a space for evangelicals who find themselves at odds with the president's rhetoric and policies Sarah McCammon reports they're asking conservative Christians to think differently about issues like abortion it sounds a little bit like a church service\n[noise]\nAnd a bit like a campaign\nRally review hundreds you must be like a Republican we're here to remind users\nOn a recent evening under the heavy branches of live oak trees here Doug Padgett stood before a couple of thousand people gathered on folding chairs on the Rice University campus in Houston\nBack home in Minneapolis Padgett the pastor and he describes himself as a progressive evangelical but right now he's traveling the country by bus preaching a message that just opposes Trump's campaign slogans against quotes from the Bible\nFor years to be reminded the first the kingdom of God on behalf of all of them [noise] [noise]\nWe must not before we're here to be reminded that you're doing the whole world and you're very so\nHow'd you organization it's called the common good and their focus is evangelicals and other Christian voters who feel out of place in President Trump's Republican Party\nHad it that the group has about a million dollars in private donations their touring the country ahead of the midterms visiting more than thirty congressional districts chosen in part based on their religious makeup\nCongressman Ted Lieu of the Democratic congressional campaign committee has informally advised the group\nAt an event in San Antonio this week Tracy Goodrich who still home schooling two of her for kids that she and her husband quietly left their evangelical church soon after the election\nThat kind of feel like I'm In the base where I grew up and eventually go home\nAnd with the\nSeveral years has kind of not having feeling like I have a home as the things that I was about representing pricing Christ likeness had been completely the opposite things I haven't supported by family and friends and community\nCoverage says she voted for Republicans until twenty sixteen but she doesn't like the way Trump talked about vulnerable people she says like immigrants women and the poor\nSays she voted for Republicans until twenty sixteen but she doesn't like the way Trump talks about vulnerable people she says like immigrants women and the poor she says many ever evangelical friend initially opposed Trump until it became clear he would be the Republican nominee\nLiterally out of a sudden Donald Trump you know we couldn't see anything wrong with Donald Trump it was just like [noise]\nNow were blind to everything Donald Trump but it was on the abortion issue which describes\nHerself as pro life but says a lot of other issues like helping the poor should be just as important to Christians that's in line with the message the common good preaching as the group toured the country\nSinger me up have been traveling with the group performing him\n\nHe's grew up in a predominantly black Baptist church unlike\nTheir white evangelical counterparts black Christian overwhelmingly vote for Democrats he says people who face the history of the ... off into the abortion debate\nWhen you are fighting to keep your family together when you're fighting to keep your children face from criminals and from when you don't know if someone's going to pick up your resume because of your name us fighting about in issues\nLike this is something that we feel we can leave in God's hands\nDon Pettit says since the buck began visiting parks in churches in early October the issue has come up again and again\nNot thought or talked about abortion in Fifteen Years as much as I have the last three weeks patch it published an\nOp ed in USA Today this week arguing that evangelicals should put more energy into reducing abortions and trying to criminalize them and should vote against politician to support Trump's agenda [noise]\nChristian Hawkins who runs the anti abortion rights group students for life is a former evangelical who converted to Catholicism she says she's heard this argument before and doesn't think most conservative Christian voters will buy it because of how they view abortion there are\nCertainly a lot of issues that Christian care about when they go to vote but at the end of the day we know that there is a human rights atrocity happening inside of our country not atrocity is abortion\nHowever the issues are framed poster Robbie Jones of the public religion research Institute says moving white evangelicals away from the G O P would be an uphill battle\nYeah once you have several generations that are voting eighty percent Republican I'm it's left that they're doing that because of one particular issue and more than it has become in many ways a kind of tribal identity that's just inextricably tied to evangelical identity I think that that is the tie that binds much more than any single issue\nThe common good is trying to push beyond those identities talking to small groups have Christian voters almost daily in the weeks leading up to the mid term they say they're planning more events for the twenty twenty presidential cycle Sarah McCammon NPR News San Antonio\n[noise]\nHere to some real and very edible evidence of something we've been reporting on NPR high interest in the mid term elections election day is still twelve days away but in many states voters are lining up at the polls for early voting\nYeah and one organization is helping them stay motivated to stay in line by sending pizzas it's a group called pizzas to the polls and it delivers free pizzas to crowded voting stations\nWe spoke to one of the founders of pizza to the polls his name is no among gr you says they started in the twenty six you know what to do that\nBy the end of the election on June twenty sixteen we raised over forty\nHe says they started in the twenty sixteen election season\nBy the end of the election and Tony ... and we had raised over forty thousand dollars and cents or she doesn't get the country\nThe project founders use social media to make sure that those thousands of pizzas head hungry voters that real actual polling locations\nWe out for some sort of picture or report from social media to verify that there is a long line or a crowd at the place and when we do that we don't look up verify the actual polling place to make sure it's a real ...\nNow it's important to note that they are a nonpartisan organization and anyone at the polling station is welcome to the pizzas they deliver\nCoworker volunteers waiting in line to vote their kids you know\nAnyone can participate and you can donate today by going to the website pulls dot pizza\nThere according to the site you can help feed democracy and feed them hungry\nYou're alive this is NPR News\n\nWhen one size does not fit all this sort of box that pun intended black box that we've often been put in\nWell I think first and foremost what this morning has made clear is that there may still be more packages out there um this is not something that has a done deal at this point\nI'm that's in fact something that the FBI warned about yesterday when it came out with a statement about what it knew at that point in time what the FBI is doing is they've collected all of the uh the materials that they have so far all of these suspicious packages\nUm the ones that I had yesterday had been taken to a lab at Quantico, Virginia for analysis to look at the types of material used for fingerprints or other evidence but this is very much the early stages of this investigation\nNPR's Ryan Lucas ... thanks you guys you know I'm going to give\nThem the energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for ... shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold Exxon Mobil liable for helping to create climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\n... who is the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to write down the value of its fossil fuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they understood what reality was and another more nuanced reality if you will for the investment public\nThe allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations are a product of closed door lobbying by special interests political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved to afford the investigation by attorneys general and three states alleging it's a conspiracy involving the Rockefeller Foundation ... lawyers environmentalist and democratic gay jeeze\nMichael Berger is a professor at Columbia Law school who specializes in climate change law burger doubts axons conspiracy theories are going to hold up in court this is\nAbout climate change it's about the risks that regulation hoses to the fossil fuel industry over the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\n\nThis is NPR News\nThis is K. A. W. seeing eighty eight point nine up in an ... a double UC dot org ... your tune to MORNING EDITION\nAhead commentator Cokie Roberts talks with NPR's Steve Inskeep and they discuss listener questions about the history of relations between the U.S and Saudi Arabia him a county library is celebrating the two hundred anniversary\nAbout the history of relations between the U.S and Saudi Arabia Yuma county library is celebrating the two hundred ... anniversary of Frankenstein by Mary Shelley and they're holding a special book club meeting tomorrow at ten am at the wealth in library or more information you can contact\nA WC bird notices neck [noise] thanks for listening who have a wonderful day [noise]\nIs bird [noise] the writer\nPaul ... said nothing just happen it depends on who comes along for the Audubon Society in Washington state that who like hazel off\nShe was a labor activist environmental campaigner and a lifelong champion of causes she believed in [noise] from Nineteen sixty nine until Nineteen Ninety seven he's a little organized Audubon chapter throughout the Pacific northwest she made a difference for birds nature and people\nBecause someone had made a difference for her it was a calling though that nearly\nDidn't happen one of my friends belong to the Audubon Society\nAnd she was always wanting me to join it costs a dollar and I put her off and I put her up I didn't want to get committed you know sometimes they finally just shattered I gave her daughter so you know to put in the dark you don't know what people are going to have a tremendous influence on your life he's long gone now\nI think they're within difference to me to my life one where I'd be now it hadn't been through Irene assisting I joined the Audubon Society\nThe voice of hazel will learn more about her amazing contribution to birds and conservation at bird no dot org [noise] I mean we can [noise] support for Blue Note comes from ... saving Keystone places for people and veterans in the Pacific northwest [noise]\nUm [noise]\nSupport for NPR comes from the states and from the University of Florida we're solving for next it's powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more ad campaign monitored dot com\nThis is MORNING EDITION on K. A. W. see\nDemocrat January ... is the first time candidate for public office as she seeks to become the state's next attorney general\nContrary spaces incumbent Republican Mark burn a bitch in the general election hey W sees Lou gum spoke to ... about how the job of attorney general has changed in recent years and why she thinks burn a bitch is focused on the wrong issues\nLet's talk a little bit about the role of attorney general which changed over the last ten Twenty years it used to be a fairly consistently bipartisan position now that seems to shift a little bit what is your understanding your your view of that\nAttorney general traditionally in Arizona has been the least part is in a position in state government and I think we need to get back to that quite frankly uh as I watch you know our current attorney general to to take away health care from Arizona and\nYou know he's suing to eliminate the only protections that exists for people with preexisting health conditions\nTo to take away health care from Arizona and you know he's suing to eliminate and the only protections that exists for people with preexisting health conditions\nAh I Know maybe because I was in health care for governor in ... it's going to impact us here you know the human regional medical center people will lose their jobs if he's successful at taking away healthcare\nIt's estimated that Arizona could lose up to forty two billion dollars if his lawsuit is successful I think we need to go back to looking at an approach of issues that\nYou know how does this affect Arizona's\nAnd if it harms Arizona's and guess what we need to be on the side that's fighting\nFor our people instead of against them what issues do you see on the horizon you'd like to see a a bipartisan or a non partisan attorney general's office right now\nAh my opponent has the attorney general's office in court defending secrecy of donors to the Koch brothers network so that they don't have to disclose their identity the same way that the rest of us do\nA you know we don't need to be in that kind of litigation where we need to be you know on issues where attorneys general around the country are taking the lead like the opioid epidemic\nUm you know we need to be collaborating at the attorney general's office with local law enforcement with local communities and going after the the drug manufacturers and drug distributors and we've seen a little bit of action\nOut of the current attorney general all in the last year and one month um but boy other attorneys general are just you know ... taking storm a this issue to make sure that we can prevent the harm that coming out of it\nBeing from Arizona you know that it's much bigger than just the Phoenix area or the Tucson area there are a lot of rural parts of the state that feel a little left out of the conversation um maybe even feel like the attorney general has nothing to do with their day to day lives or talk to those people about why having someone they can trust and its position is so important\nWhat I've heard because I visited every county most of them more than once\nI'm what I hear from people is that you know they're not used to seeing the attorney general around anymore um we used to have a tradition of an attorney general a ... on your side and we'd come out and not only the attorney general but staff would\nCome out once a quarter and meet in a library or another public space where people could bring their concerns in their questions uh you know Arizona is one of the top ten targets for financial scams\nThat's in part because so many people choose to retire here uh and so we need to educate we need to mobilize we need to make sure that we're\nAccessible right here in your own home town so that you know we know what's going on there you know if there's a problem and a trend that we know you know who to go after\nThanks for listening I'm chip strangely\nIn Parker sunny today highs near Ninety degrees north east wind five miles per hour and ... and Parker clear skies lows around sixty three you will have some of these guys in a high of Ninety two today north northeast when five miles per hour tonight in Yuma clear skies with\nA low of sixty seven we have a report of fifty nine and Parker sixty four in Yuma and sixty one degrees in Fort ...\nThis is K. A. W. see eighty eight point nine of them it's seven o'clock ooh\nGood morning President Trump replace some of his usual attacks on Democrats in so called fake news CNN with the calls for civility Latin more on MORNING EDITION from NPR News\nPresident still got in some things that Democrat and his call for civility came after packages containing pipe bombs were sent to democratic leaders I knew well king\nAnd I'm David Greene Alaska former FBI official how the investigation into those packages is going to play out in the Saudi crown prince and made allegations over the killing of a journalist actively courts foreign investors we didn't Thursday October twenty ... birthday party the under ... Darryl from the office after ... Robin turns forty seven\n\nLine from NPR News in Washington on corporate Coleman additional suspicious packages had been found today in New York City and in Delaware and want to Delaware was addressed a former Democratic vice president Joe Biden the one in New York was sent a liberal activist and actor Robert Deniro\nBoth are similar to several others suspicious packages sent it to democratic officials are supporters this week New York\nThe ... the actor Robert Deniro both are similar to several others suspicious package and sent it to democratic officials are supporters of this week New York state governor Andrew Cuomo told NPR's MORNING EDITION investigations are underway\nTo have the actual police she was ... who sent the packages fingerprints on the pay a postal inspection inspecting the devices themselves then you have a second level of investigation what is the motivation\nPresident Trump is also set a robust federal investigation is underway this morning he tweeted that some of the anger in the U.S is the fault of the media he demanded that the media quote must clean up its act fast exclamation point\nGeorgia election officials have until noon today to file a response to a judge's order to accept absentee ballots with questionable signatures from member station WBUR a B. E. and Atlanta ... Sharma reports\nA federal judge in Atlanta says absentee ballots signatures that don't match what's on file must be accepted as professional ballads Sean Young of the ACLU Georgia represents one group of plaintiffs and says there were special concern for elderly and disabled voters\nI think the judge recognize that for many absentee voters foods ballots are retracted because if a signature miss slash many of them will be permanently disenfranchised because they cannot voter are secure that ballot\nIn total more than twenty two hundred absentee ballots have been rejected so far civil rights groups have filed lawsuits sitting secretary of state Brian Kemp over the rejections Kemp oversees elections and is the Republican candidate for Georgia governor for NPR News I'm listening to some in Atlanta\nTexas based Exxon Mobil has been sued by New York's attorney general in his alleged the energy giant defrauded shareholders by miss dating the risk of greenhouse gas emissions to the company from Dallas NPR's Wade Goodwyn reports\nThe legal action is the result of a four year investigation by attorneys general first or New York that other states are doing whether Exxon Mobil engaged in a long running fraudulent scheme what was the village scream\nEssentially the company claim but the cost of combating carbon emissions would be so high that no meaningful government restrictions could or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon called the legal action against the ... list a tainted of blaming Al Gore Democrats and environmental is Wade Goodwyn NPR News Dallas\nOn Wall street the Dow Jones industrial average is up more than one percent the NASDAQ it's up more than two percent this is NPR\nGood morning for key WC I'm Jasmine I did not the Mexican state of so no doubt has seen a jump in the ... cases in recent weeks\nPrompting a warning from Maricopa County from the ... from that as a ... an animal seal sonata Murphy what House report\nThe Maricopa County department of public health is warning pregnant women about travel to Arizona southern neighbor Sonora Dr Rebecca sunshine is the agency's medical director of Disease Control\nWith the recent report of about forty five cases of the guy in the last two weeks we definitely want to make sure that pregnant women are aware of the risk of traveling there\nThat compares to be easy for keeps a scene in the states and twenty Fifteen there has been one case of travel related in Maricopa County this year only one in five of those infected show symptoms which include fever rash headache in multiple pain can be sexually transmitted in southern China recommended that men use condoms for three months after returning from affected areas\nFrom animals you know Mexico I'm Murphy would\nIn sunshine recommended that men use condoms for three months after returning from affected areas from animals you know Mexico I'm Murphy would house\nArizona western college women's soccer team is at the top of the rankings after they're undefeated twenty and no regular season record and they remain untouchable after Wednesday night semi final game\nAgainst Scottsdale community college team was ranch first in the national junior college athletic association pull for the first time in human history on Tuesday five AWAC players received recognition from the air than a community college athletic conference\nGreasy honorable a tank of Donna was named to player of the year well it was also named it the first came along with teammates a sorry there\nAnd former you Catholic shamrock Gehring Melendez\nBurst of your head coach Nicole coastal was named to coach of the year AWAC host region one final Saturday October twenty seventh against paradise valley ... I'm Jasmine I did not\nSupport for NPR comes from NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future by Baylor bowl where books are sold\nIt seven those six words is MORNING EDITION on pay double you see eighty eight point nine of\nThem and a double UC dot org in the morning I'm ... the head on MORNING edition the u._s. stock markets opened higher this morning\nAfter an intense sell off wiped out this year's game that story and about Fifteen minutes on MORNING edition [noise]\nThis is K. A. W. see\nThings were listening [noise] we hope you have a wonderful day [noise]\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K. A. W. sea and retired Arizona highways publisher when Holden at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California we have confirmation now of two more suspicious packages that were found this morning a law enforcement official says a suspicious package addressed to former vice president Joe Biden was found in Newcastle county Delaware\nAnd a spokesperson for the New York city police department confirms to NPR that another suspicious package was sent to the actor Robert De Niro who is a prominent critic of President Trump\nInterest hungry all along is in New York reporting on this story Hi there Hansi the morning David All right let's go through these let's start with the package that um was apparently sent to former vice president Biden what do we know at this point\nWe'll details are really still coming in but what we know for sure is that as you mentioned that it did was sent to Newcastle county Delaware and Delaware's courses the home state of former vice president Joe Biden and that was confirmed by law enforcement source who spoke to our colleague Ryan Lucas\nAnd do we know anything about whether this is similar connected to these other packages that were sent a prominent Democrats um like Hillary Clinton yesterday that we've been we've been speaking about this morning\nWe'll explore with a source who spoke to our colleague Ryan Lucas did confirmed that it does resemble other suspicious packages\nYesterday that we've been we've been speaking about this morning\nWe'll explore with a source who spoke to our colleague Ryan Lucas they confirmed that it does resemble other suspicious packages haven't discovered this week and it's already there really still investigating exactly what ... side of it and and what we may learn that the motives here\nThat the governor of New York Andrew Cuomo we spoke to him this morning um he was telling us about this package that were sent to Robert De Niro his home in Tribeca he said that that is another one seems to be similar to the other ones we've been talking about um what so far or police in New York saying about that one\nCannibalism is all about intimacy empower\nGets on the next travel with Rick Seaney\nWe hope you can join us for travel with Rick Steve this evening\nFrom seven to eight right here on K. A. W. see eighty eight\nNine of them and say hey do we use the dot org it's seven Nineteen ...\nThanks for joining us for MORNING EDITION coming up there's a lot of buzz about big data and now blocked Jane will solve climate change scientists are concerned that the high\nComing up there's a lot of buzz about\nBig data and now blocked Jay will solve climate change scientists are concerns that the high leads into dangerous ideas that there's a technological magic later an expert on redistricting is Michigan's congressional maps are among the most use in the country\nIt's very clear that their number one goal was to maximize Republican political power\nComing up we'll have a new proposal in Michigan that could take the power to draw those districts away from the politicians more on that story and Fifteen minutes on gay WC ... sunny today highs near Ninety to ... Sonny ... near Ninety\nSixty foreign Yuma fifty nine and Parker and sixty in courtside\nK. A. WC is supported by a federal credit union a not for profit financial institution that's locally owned and operated with five full service branches in ... and ...\nFounded in Nineteen forty two eighty a has been helping members achieved their financial goals every day for over Seventy six you learn more at ... dot org\n...\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nFrom his Cox insurance providing customized insurance for small and medium businesses so they can do more and being more learned more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage and from Subaru featuring\nThe all new three row ascent with feeding for up to eight at a choice of second row captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dies Tom\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning us markets opened up this morning after a rough day yesterday the Dow was trading up about point eight percent this hour\nBut I don't think the market volatility we've been seeing in the past couple of weeks is not over NPR's Yuki Noguchi joins us now to discuss some of these markets swings can morning ... good morning oh All right so it has been a choppy October yesterday markets closed down and the Dow innocent pie basically erased all their gains for the year what has been going on\nIt's because investors are conflicted and one of their biggest underlying concerns is the global economy you know how the trade war will play out and how higher terrorists might effects it might affect U.S companies\nUm you're starting to see some of that already a caterpillar which makes farm equipment and three am which is a huge conglomerate that makes everything from sponges to car parts\nAh this we talked about how that's starting to affect their bottom line now on the plus side the economy and labor market are and have been chugging along so there are no clear indication that that's going to hit a wall uh some companies are beating expectations\nAnd although interest rates are heading up there still historically low All right\nSo some good factors some bad factors one of those sectors that's been hardest hit in recent days is the tech sector yesterday the NASDAQ which is made up of a lot of tech stocks I had one of the worst days in seven years and this morning we should say it is trading up but what is going on in the technology sector\nIt well the technology sector has been on an even steadier and stronger Bull Run in recent years I'm apple this summer or you might recall became the first company to reach a trillion dollars in market value\nAnd stronger Bull Run in recent years I'm apple this summer\nOr you might recall became the first company to reach a trillion dollars and market value so basically ... tech stocks have already risen very high end of a lot further to fall a and when you have a ... few companies talking as you saw this week about week sales or miss profits\nOn that makes investors nervous that perhaps as stocks are overvalued and tech is a great example actually of how the volatility kind of spreads around the world yesterday you had some us tech firms including Texas Instruments and\nAT and T. reporting some weaker earnings which then prompted the Asian tech stocks including Sony and Sampson to fall overnight\nBut then by the morning you had stronger results out of European tech firms and send U.S companies including Microsoft and Twitter this morning and that's helping shore up some of those losses so it kind of good contagion they're eating is nerve wracking though to see the markets lose like six hundred points in a day\nAnd analysts say this could continue for a while really quickly why is that\nIt's largely because we don't have clarity on some of the questions that I outlined at the outset where's the global economy headed how much of a trade war is going to affect companies\nAnd until investors feel they have a clearer picture on that you are likely to see strong reactions to any kind of news that could be interpreted as a significant development and we'll get another chance or later today with Amazon and Google's alphabet reporting their earnings NPR's Yuki Noguchi thanks so much thinking well\nAccording to a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change Silicon Valley has been at work on a solution for years often promising quick fixes\nBlock Shane the technology behind crypto currency like bitcoin is the latest solution coming from big tech\nMember station KCRW in December net has more\nUntil about a year ago hardly anyone in climate science was talking about watching but at the recent global climate action some in San Francisco it was all over the place their animals papers people were talking about how he can help mitigate climate change in all sorts of\nAgriculture or if it's oil to show\nOur common coaches the climate change coalition he came to the conference to spread awareness about watching [noise] so what is it\nA long chain or distributed electric technology really references a larger system of technology\nOkay ... ... is like an accounting book everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank but it said on the computers of everyone on the block ching\nTransparency is its main advantage tons of new companies are springing up saying that they will use the transparency blocked Jane to solve all sorts of problems everything from curing cancer do ending human trafficking no even climate change\nIts it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world pitches he's the CEO of a new Silicon Valley company called ...\n... the black chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credit systems the total number of carbon possible to admit is kept and then companies can buy carbon credits that let them in more\nLove this market based solution but there's a problem when it comes to counting the carbon\nCarbon markets in the past have been plagued with issues of fraud and double counting nobody wants to\nThis market based solution but there's a problem when it comes to counting the carbon carbon markets in the past have been plagued with issues of fraud and double counting nobody wants to use block chain to verify the accounting and to go one step further to create a market for people taking carbon out of the environment\nNow the company has been launched yet but that isn't limiting the ambition of the sales pitch you want to make the whole climate change problem just go away so do scientists like Douglass McCauley yeah I Wish it was that easy because he's a researcher at UC Santa Barbara you said the danger of Silicon Valley is big promise disrupt everything eat those\nIs that it suggests there's a quick and easy solution that thing is that fix climate change are going to be really hard like getting countries to cut emissions or people to stop driving cars the pollute\nBecause it before it was blocked Jane artificial intelligence in big data were the hot new things\nAnd these are proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the shiny thing and started talking about exactly how to apply it usefully\nIs watching could help with things like counting carbon credits or keeping track of say how many trees a company is planting to suck carbon out of the air Katherine mocking a climate scientist at Stanford agreed but she says it's dangerous to believe block Jane will be some kind of a miracle cure\nIt's essentially Ken kicking ethics where we won't be putting into place the solutions that are actually more important to make the entirety of the problems something that's how people\nWith a clock ticking on climate change and ... there's no time to waste sorting facts from hike\nFor NPR News I'm Sam honey\nThis is NPR News the Democratic\nNominee for governor in Illinois has contributed more money to his own campaign than any other candidate in history and the owners don't like that\nThis as well please let me know smiley face that's Katie Faye he the organizer of voters not politicians she had put up a similar posed years ago and nobody even liked it but this time people clicking the like button and they actually want it to health\nAnd then here's where we have our printers fancy printers at our campaign has\nThey he is showing off voters not politicians new field office the redistricting initiative she launched has amassed hundreds of volunteers and raised more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names tape to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donated [laughter] um but some food and stuff like that and\nRight now lawmakers in power a get together and draw district lines before getting them approved by the governor Mike ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise and Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten far more votes overall\nThe redistricting proposal would create a commission made up of four Republicans four Democrats and five independence a majority that includes a mix of all three would have to agree on the map\nBut the opposition calls the proposal an expensive way to change the system that already works when delete harbor is a Republican and has worked for for secretaries of state she says this whole thing it's skewed to help Democrats\nA gimmick and bypass as\nOur elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government or any porn as president of ethics MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head in twenty sixteen\nPeople were dissatisfied with the government the federal level is really looking out for members of Congress should their donors and corporations they're left over the coals\nPulls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nWhy should the parts in an office get to decide like who gets to vote in that area when I\nHave a right to choose in and it just makes me wonder well how much rights do we really have\nRedistricting measure passes that's not the end of the road legal challenges to the commission\nMakes me wonder well how much rights do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Shana wrong in Lansing, Michigan [noise]\n\nAnd this is NPR News\nThis is Kate WC eighty eight point nine of them and take a double you'd see dot org good morning I'm chip straight early\nMORNING EDITION continues in just a few minutes sports columnist Kevin Blackistone and NPR's David Greene discuss a federal jury in New York they found three people guilty of fraud or paying top tier basketball recruits to choose certain colleges\nWe occasionally they'll be you see are grateful for the almost two hundred sustaining members who have provided an ongoing supportive K. C. monthly contributors have donated enough to cover programming costs for two months of the year [noise] so if you're one of our sustaining members thank you now more than ever we rely on you [noise]\nThis is Kay hey WC\nClimate connection is up next [noise]\nIrish and killing him was raised in the Catskill Mountains of New York\nEarly age she experienced the hardships extreme weather can cost when I was six years old my family was forced to stop funding for listening to to fly in the\nSpan of five years we had to one hundred year floods and won five hundred here five [noise] and when the five hundred year flood hit our field washed away all of our top soil and to all of our equipment underwater it was devastating for my family today\nKilling him as a college student she said just a specially important for young people to demand that elected officials act on climate every\nDecision that is being made today it's going to have an impact on our lives so young people in our own best interest to be involved and take action\nAs part of a group called zero hour she helped organize the lobby date and youth climate march in Washington DC last July she says it was inspiring and our peers want to keep the momentum going\nAnd we are going to continue to fight for our future for our lives and for our communities\nClimate Connections is produced by the center for environmental communications\nAnd yell Climate Connections dot org\nSupport for NPR comes from this station and from the alliance for lifetime income a nonprofit composed to financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for lifetime income dot org\nAnd from Harvard Business school executive education for executives that any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot Emmy slash executive\nMORNING EDITION from NPR News I'm Noel King and I'm David Greene a federal jury in New York has found three people guilty of fraud they were convicted yesterday\nNPR News I'm Noel King and I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday of paying tens of thousands of dollars to the families of top flight basketball recruits one of the convicted James gotcha worked for Adidas\nAnd steered certain students to Adidas sponsored colleges schools with storied basketball programs such as the University of Kansas and little for among them\n... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nNow joining us to talk about this case and what the NC double a can do to clean up corruption and college athletics is Washington Post sports columnist Kevin Blackistone also familiar voice on our program Heather Kevin hey how're you doing to I'm good thank you so what does this mean for college basketball as a whole what happened yesterday you know I'm not sure it means\nAnything for college basketball um in in total because what happened here was a pretty isolated incident um but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball\nFor as long as I can remember and that is basically they're channeling of money from a one source um to the families of talent um to ensure that that talent goes to a particular school\nAnd what has happened over the years is that the uh manufacturers of of basketball shoes Adidas\nA Nike or those those uh operations\nHas gotten people in the middle of them um to help transfer that money so that the surprise here is that it has been criminalized a by the federal government as opposed to be policed by uh the NC double A. is it's been done for years\nAnd it used to be that the worst thing that would happen in that situation is that a someone will be banned from the NC double a coach who was who was caught um funneling money or or some middle man\nNow there's like ... which is which is a step\n... now you could possibly go behind bars which is uh what these uh these three men are facing\nWhat you have these three men facing that you'd say um but I Want to your colleague at the Washington Post Sally Jenkins room recently that the real defended here should be a university but the universities are actually considered victims and all of this did you see at the same way that she does\nI I don't see it that way but that was the way that the federal government decided to get involved in this basically they said that the ... universes were being defrauded 'em by the system\nAh because by funneling this money um two players are are players families um these people knew that they were making these players in eligible\nUnder NCWA rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the universities that have given them scholarships\nAnd therefore they had to fraud at the universities of of value which is a very strange thing to me because I still don't know\nHow that's fraud I mean universities or a University of basketball programs in football programs are still going to get these talented players under they're very um a low level of remuneration ah for athletic talented brings them um tens of million dollars in revenue every year\nDot org ... we are a service of Arizona western college\nAnd have been for more than forty five years we trusted news for low pause and ... counties good morning thanks for listening on ... you might have sunny skies in a high of Ninety two today with north northeast within five miles per hour denied in Yuma clear skies and a low sixty seven\nMarkers sunny today with a high of Ninety degrees northeast when five miles per hour tonight blaring Parker lives around sixty three\nA report of sixty seven in Yuma fifty nine and Parker and sixty two degrees in Port side this is Kay WC eighty eight point nine of them didn't have to walk\nWho\nMorning who said pipe bombs to prominent figures the total ten suspicious packages of intense of politicians and other well known people all critics\nOf President Trump the New York governor Andrew Cuomo morning in New\nYork Times we have to unify those are the words of President Trump has the bomb scare unfolded later at a rally in\nAnd these times we have to unify those are the words of President Trump has the bomb scare unfolded later at a rally in Wisconsin here again took aim at the new ...\nAnd I'm Noel King also this hour New York's attorney general is suing Exxon Mobil blaming the oil giant misled investors about the costs of the climate change leader will meet a pastor who wants to give an evangelical voters turning away from home Thursday October twenty fifth\nHappy birthday to sing or Katy Perry's she's thirty four years old today\nAnd the news is next\nLive from NPR News in Washington I'm core of a ... at least three more suspicious device and have been discovered today that are similar to those that were sent democratic officials and activists this week\nTwo packages were addressed to former vice president Joe Biden they turned up in the Delaware postal facility the third was sent a liberal activist an actor Robert De Niro New York city Mayor Bill de Blasio told CNN Today that package was found early this morning in lower Manhattan\nWhat we have to recognize is we should expect more of these in the meantime so yes this morning Robert Barrows office a thank God because of an eagle eye security employee or no one was hurt or the device was removed successfully about in life you do\nAt least ten suspicious packages have now been sent some of the people addressed her former president Brock Obama and former secretary of State Hillary Clinton\nPresident Trump is calling for civility in light of pipe bombs being sent to his political enemies but as NPR's Tamara Keith reports Trump is not let up on his attacks on the media\nPresident Trump told a rally crowd he wants all sides to come together in peace and harmony but not even twelve hours later he tweeted out blame to the media quote a very big part of the anger we see today in our society is caused by the purposely false and inaccurate reporting of the mainstream media\nThat I refer to as fake news\nFormer CIA director and Trump critic John Brennan who was targeted with one of the packages responded on Twitter telling the president to stop blaming others and look in the mirror saying Trump's inflammatory rhetoric and encourage mental physical violence are disgraceful the package was addressed to Brennan care if CNN\nNetworks Trump frequently attacks camera Keith NPR News\nBoston has taken game to the world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers four to two last night from member station WVU are Shira Springer says Boston hold the two games to none lead\nThe games big hit was a single to right field by the red Sox JD Martinez the hit with the home team ahead for good and because it came with two outs and the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless often\nShe ... them to produce the emphasis on ... and just keeping the line and\nMeanwhile on the mound Red Sox started David Price got the when he grounded his way out of the bases loaded ... in the fourth and pitch six solid innings allowing only two runs on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Sheera Springer in Boston\nOn Wall street the Dow Jones industrial gr up two hundred and fifty six points or more than one percent the NASDAQ up one hundred sixty points or more than two percent you're listening to NPR\nK. WC News I'm Jasmine out enough a U.S border patrol agent who's six years ago fire just through the Arizona border fence into Mexico killing a teenager went on trial\nWhen I did not a U.S border patrol agent who's six years ago fired ... through the Arizona border fence into Mexico killing a teenager went on trial for manslaughter Wednesday morning from kj these these front that desk into San ... reports\nThat this is the second time prosecutors are trying to convict him\nIn his first trial last spring a jury ... Schwarz not guilty of second degree murder but it was conflicted on whether he committed manslaughter\nNow the U.S government is trying him again on manslaughter us attorney Wallace Clinton's told the jury Schwartz was but up with rocks being thrown over the border fence and that was why plead has gone between the bars of the border friends\nShot sixteen year old ...\nThan reloaded and shot him again a total of sixteen times short set expressionless aside as attorneys lawyer Sean Chapman told the jury the teenager was helping to drug smugglers\nBy hurling rocks over the fence and said Schwartz frailty another law enforcement officers lives were in danger and that only seconds to react from Tucson amateur muddy school\nThere are so many ... neighborhood that the team officials are considering using paintball guns to run them off\nPacks with as many as seven ... have been seen at one time in the Catalina invest in neighborhood in midtown Tucson, Arizona Daily Star reports\nCity Tucson council man it's Steve ... says the goal is to deter the animals without harming them and without chasing them into adjacent neighborhoods the humane society and the Jews on police department\nHave both approved the paintball gun plant the pain balls will also allow officials to mark the ... better assess their numbers brigade WC News I'm Jasmine I Do not\nSupport for NPR comments from NPR stations\nOther contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed the chicken neck people from anywhere in the world on any device learn more at go to meeting dot com\nIt's said of sick [noise] this is MORNING EDITION on gay WC eighty eight point nine of them and K. A. W. C. dot org [noise]\nGood morning I'm ... the head on MORNING edition a Minnesota pastor is trying to persuade his fellow evangelicals to think differently about abortion and other issues these leading an organization which aims to help lift the house this fall that story and Fifteen minutes on MORNING edition\nYou must sunny highs near Ninety two Parker sunny skies near Ninety sixty seven and ... fifty nine and Parker sixty two in court side\nI'm again of course next time on the USA's Alex Saturday I got to put it this done the Democratic party by winning the thing\nI don't have to be a provocative for it's just the truth is from our cat\nWe get to know the woman behind one of the biggest political upsets of the year that's next time on a\nFriday evening at seven on K W the eighty nine us and [noise]\n\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California well the count just keeps going up we now have at least ten suspicious packages center prominent figures including former secretary of State Hillary Clinton one of those was sent to the home of billionaire philanthropist George Soros\nThe New York police department is now confirming that too suspicious packages addressed a former vice\nAnd one of those who sent to the home of billionaire philanthropist George Soros the New York police department is now confirming that too suspicious packages addressed a former vice president Joe Biden has been recovered and one to the actor Robert Deniro earlier this morning I spoke to New York governor Andrew Cuomo governor good morning and thank you for taking the time for us\nThis morning thank you for having ever\nCan we talk about what's happening at this moment on this investigation into another package it sounds like in Tribeca what do you know\n[noise] ah there is an investigation into a suspicious package a trifecta as you said correctly or at the business residents of Robert Deniro the act a reactor a who is a a\nGreat actors of personal friend of mine is a great New Yorker ah he's also a has a political voice and he's also spoken out on his political opinions so that song going literally as we speak\nUm the other packages had been described as pipe bombs by officials do do you know if if this one is indeed that as well and if it if it's related to the others\nIt is a similar looking package or we don't know yet or if it is the same as the packages that we've seen thus far\nI I Want to ask you yesterday afternoon you said you were directing state law enforcement to double security as vital transportation assets across New York um if there is some reason to believe that that transit systems in your state could be targeted as part of all this\nThis was actually center bought walls you see\nWell completely in the\nWe're in now airs today from tend to do right here on\nK. A. W. see I'm chip\nStrangely thanks for joining us for MORNING EDITION\nIt's eight Nineteen [noise]\nDemocrat January ... running to be the state's next attorney general coming up she tells K. A. W. see\nWhy that is in the next half hour\nLong K. A. W. sea and coming up we have the latest on the investigation into the suspicious packages containing potential explosive devices since a democratic political figures this week that's about Fifteen minutes on K. A. W. UC\nAnd later NPR's Steven Inskeep dogs with commentator Cokie Roberts who answers listener questions about the history of relations between the U.S and Saudi Arabia\nAnd you must sunny hides near Ninety two today\nAnd I ... around sixty seven Parker sunny highs near Ninety degrees tonight and Parker clear with low around six three\nSixty seven and ... the nine and Parker and sixty two in quartz site Arizona western colleges theater department continues ... murder mystery mixed with social commentary tomorrow in Saturday at seven thirty and Sunday at two thirty FDA WC\nTheater on the campus [noise]\nThis is K. A. W. see [noise]\nEighty eight point nine\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks into Andrew rentals a new episode every Friday on prime video\nFrom it less than a collaboration software company empowering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com\n[noise] from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene\nEight out of ten white evangelicals voted for President Trump in twenty sixteen and poll suggests they continue to strongly support him\nBut the head of the midterm elections a new group is trying to carve out a space for evangelicals who find themselves at odds with the president's rhetoric and policies that NPR's Sarah McCammon reports they're asking conservative Christian to think differently about issues like abortion\nIt sounds a little bit like a church there\nAnd [noise]\nAnd a bit like a campaign rally you've heard it said that you must vote Republican we're here to remind you want to read an email under the heavy branches of live oak trees your dad Padgett did this for a couple of dozen ...\nWe're here to remind you go\nOn a recent evening under the heavy branches of live oak trees Doug ... said before a couple of dozen people gathered on folding chairs on the Rice University campus in Houston\nBack home in Minneapolis Padgett the pastor and he describes himself as a progressive evangelical but right now he's traveling the country by bus preaching a message that jumped opposes Trump's campaign slogan against quotes from the Bible\nWas there for ... years be reminded she first came to my daughter from all of them were [noise]\nWere not before we're here to environment you can go home for a very so\nHow did the ... it's called the common good and their focus is evangelicals and other Christian voters who feel out of place in President Trump's Republican Party\nHad it since the group has about a million dollars in private donations their touring the country ahead of the mid term visiting more than thirty congressional districts chosen in part based on their religious makeup\nCongressman Ted Lieu of the Democratic congressional campaign committee has informally advised the group\nAnd an event in San Antonio this week Tracy Goodrich who is still home schooling two of her for kids that she and her husband quietly left their evangelical church soon\nAfter the election kind of feel like I'm In the base where I grew up in the event of Oklahoma\nAnd with the last several years it's kind of not have been like I have a home as the things that I was felt represented Christ and Christ likeness had been completely the opposite things I had been supported by family and friends and community\nCoverage says she voted for Republicans until twenty sixteen but she doesn't like the way Trump talks about vulnerable people she says like immigrants women and the poor she says many ever even ... friends initially opposed Trump until it became clear he would be the Republican nominee\nLiterally out some Donald Trump you know we couldn't see anything wrong with Donald Trump it was just like [noise]\nNow were blind to everything Donald Trump but it was on the abortion issue the rich describes\nHerself as pro life but says a lot of other issues like helping the poor should be just as important to a Christian that's in line with the message the common good is preaching as the group tours the country\nSinger me up have been traveling with the group performing him\n\nHe's grew up in a predominantly black Baptist church unlike their white\nEvangelical counterparts black Christian overwhelmingly vote for Democrats [noise] he says people who faced the history of disenfranchisement often see the abortion debate\nWhen you are fighting to keep your family together when you're fighting to keep your children safe from criminals and from ... when you don't know if someone's going to pick up your resume because of your name [noise] us fighting about an issue\nLike this is something that we feel we can leave in God's hand\nDug padded says since the bus began visiting parked in churches in early October the issue has come up again and again\nNot fought or talked about abortion in Fifteen Years as much as I have the last three weeks\nPatch it published an op ed in USA Today this week arguing that evangelicals should put more energy into reducing abortions and trying to criminalize them and should vote against politicians who support Trump's agenda [noise] Christian Hawkins who runs the anti abortion rights group students for life is a former evangelical who converted\nAgainst politician to deport Trump's agenda Christian hocking to rent the anti abortion rights groups students for life is a former evangelical who converted to Catholicism she says she's heard this argument before and doesn't think most conservative Christian voters will buy it because of how they view abortion there are\nCertainly a lot of issues that I shouldn't care about when they go to vote by the end of the day we know that there is a human rights to try to be happening inside of our country march off duty is abortion\nHowever the issues are framed poster Robbie Jones of the public religion research Institute says moving white evangelicals away from the G O P would be an uphill battle\nYou know once you have several generations that are voting eighty percent Republican I'm it's left that they're doing that because of one particular issue and more than it has become in many ways a kind of tribal identity that's just inextricably tied to evangelical identity I think that that is the tie that binds much more than any single issue\nThe common good is trying to push beyond those identities talking to small groups have Christian voters almost daily in the weeks leading up to the mid term they say they're planning more events for the twenty twenty presidential cycle Sarah McCammon NPR News San Antonio\nHere is some real and very edible evidence of something we've been reporting on NPR high interest in the mid term elections election day it's still twelve days away but in many states voters are lining up at the polls for early voting\nYeah and one organization is helping them stay motivated to stay in line by sending pizzas it's a group called pizzas to the polls and it delivers free pizzas too crowded voting stations\nWe spoke to one of the founders of pizza to the polls his name is no among gr he says they started in the twenty six you know ...\nBy the end of the election I'm twenty six and we had raised over forty thousand dollars and cents or to to get those across the country\nThe project founders use social media to make sure that those thousands of pizzas had hungry voters that real actual polling locations\nWe are for some sort of picture or report from social media to verify that there is a long line or a crowded place and when we do that we don't look up verify the actual polling place make sure it's a real place\nNow it's important to note that they are a nonpartisan organization and anyone at the polling station is welcome to the pizzas they deliver\nCo workers volunteers waiting in line to vote or kids you know\nAnyone can participate and you can donate today by going to the website pulls dot pizza\nThere according to the site you can help feed democracy and pizza hungry\nA lot of\nThis is NPR News\nWhen one size does not fit all this sort of box that pun intended black box that we've often been put in\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations are a product of closed door lobbying by special interests political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved to afford the investigation by attorneys general and three states alleging it's a conspiracy involving the Rockefeller Foundation ... lawyers environmentalist and democratic agencies\nMichael Berger is a professor at Columbia Law school who specializes in climate change law burger\nDoubts axons conspiracy theories are going to hold up in\nCourt this is about climate change it's about the risks that regulation hoses to the fossil fuel industry over the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas\nA super typhoon name due to blasted across the U.S commonwealth of the northern Marianna islands today devastating wins tour of Ruth and level small buildings now there has been no reports\nOf debts on the Pacific island chain but the national weather service called you to the strongest storm to hit any part of the United states this year and we have more now from NPR's Julie McCarthy in manila\nResidents described the wins that how old over the northern Mariano as as horrifying\n[noise] agree became shrapnel would you choose ... sustaining a hundred and eighty miles per hour according to satellite reading\nThat well in excess of any hurricane that has struck the United states this year\n... however that play out shopping or whatever they away that meteorologist Michael ... with us\nStates this year with a randomly stopping them out or whatever they want\nThat meteorologist Michael's yo bro with the national weather service you chew is being compared to typhoon men coot that rage to to the Philippines last month the old world says the intensity of you chew what's so great that the wind instruments gave out\nAlong with the ... the Mary on his other western those territories of the United states with a population of fifty four thousand the Mary on his lie about sixteen hundred miles east of the Philippines under grey skies residents of the typhoon torn islands\nCan be seen on social media today sifting through what is left of their homes searching for their belongings the storms I cross directly over a teeny an island\nAnd scraped sigh pan the largest in the chain of fourteen volcanic islands the mayor of ten Ian Joey Patrick's on Nicholas assess the damage\nBut we're still without power of a deal is without water is the last year so we have here are actually a clause in while he was a whole\nGeneration some residents expected outages to last week's the mayor said the power plant has been compromised and the distribution system\nCompletely destroyed Julie McCarthy NPR News manila\nThis is NPR News ...\nThis is gay WC eighty eight point nine of them and K. A. W. C. dot org I'm chip strangely\nYour tune to MORNING EDITION Democrats January ... running to be the state's next attorney general coming up she tells K WC why that's in five minutes on MORNING edition\nCage do you see is supported by river city grill offering a unique menu of regional dishes featuring fresh seafood and all natural beef poultry inland river cities dining room and patio comfortably accommodate large private parties as well as intimate dining river city grill located on third street at sixth\nAvenue bird notices up next thanks for listening [noise]\nBird [noise] the writer\nPaul ... said nothing just happen it depends on who comes along for the Audubon Society in Washington state that who was hazel off\nShe was a labor activist environmental campaigner and a lifelong champion of causes she believed in [noise] from Nineteen sixty nine until Nineteen Ninety seven hazel wolf organized Audubon chapter throughout the Pacific northwest she made a difference for birds nature and people\nBecause someone had made a difference for her she was calling though that nearly\nDidn't happen one of my friends belong to the Audubon Society\nAnd she was always wanting me to join it costs a dollar and I put her off and I put her up I didn't want to get committed you know to some place they finally to shatter I gave a dollar so you know to put in the dark you don't know what people are going to have a tremendous influence on your life she's long gone now\nI think there was any difference to me to my life one where I'd be now it hadn't been thriving insisting I joined the Audubon Society\nThe voice of hazel will learn more about her amazing contribution to birds and conservation at bird no dot org\nAnd Mary and you can [noise] support for Burn Notice comes from ... saving Keystone places for people and the truth in the Pacific northwest [noise]\nSaving Keystone places for people and the truth in the Pacific northwest [noise]\n[noise]\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at ... dot org\n[noise] from the Pew Charitable trusts markings Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\nAnd from listeners like you who donate to this NPR station\nThis is MORNING EDITION on K. A. W. see\nDemocrat January contrary is the first time candidate for public office as she seeks to become the state's next attorney general\nContrary spaces incumbent Republican Mark burn of itch in the general election WC is Lou gum spoke to a ... about how the job of attorney general is changed in recent years and why she thinks burn a bitch is focused on the wrong issues\nLet's talk a little bit about the role of attorney general which changed over the last ten Twenty years it used to be a fairly consistently bipartisan position now that seems to shift a little bit what's your understanding your your view of that\nThe attorney general traditionally in Arizona has been the least part is in a position in state government and I think we need to get back to that quite frankly uh as I watch you know our current attorney general sued to take away health care from Arizona and\nYou know he's suing to eliminate and the only protections that exists for people with preexisting health conditions\nAh I Know maybe because I was in health care for governor in ... it's going to impact us here you know the human regional medical center people will lose their jobs if he successful at taking away healthcare\nIt's estimated that Arizona could lose up to forty two billion dollars if his lawsuit is successful I think we need to go back to looking at an approach of issues that\nYou know how does this affect Arizona and\nAnd if it harms Arizona's and guess what we need to be on the side that fighting for our people instead of against them\nWhat issues do you see on the horizon you'd like to see a a bipartisan or a non partisan attorney general's office\nRight now I'm my opponent has the attorney general's office in court defending secrecy of donors to the Koch brothers network so that they don't have to disclose their identity the same way\nThat the rest of us do you know we don't need to be in that kind of litigation where we need to be you know on issues where attorneys general around the country are taking the lead like the opioid epidemic\nUm you know we need to be collaborating at the attorney general's office with local law enforcement with local communities and going after the the drug manufacturers and drug distributors and we've seen a little bit of action out of the current attorney general all in the last year and one month\nUm but boy other attorneys general are just you know ... taking storm a this issue to make sure that we can prevent the harm that coming out of it\nBeing from Arizona you know that it's much bigger than just the Phoenix area or the Tucson area there are a lot of rural parts of the state that feel a little left out of the conversation um maybe even feel like the attorney general has nothing to do with their day to day lives I talked to people about why having someone they can trust in this position is so important\nWhat I've heard because I visited every county most of them more than once I'm what I hear from people is that you know they're not used to seeing the attorney general around any more um\nEvery county most of them more than once I'm what I hear from people is that you know they're not used to seeing the attorney general around anymore um we used to have a tradition of an attorney general a ... on your side we'd come out and not only the attorney general staff\nWould come out once a quarter and meet in a library or another public space where people could bring their concerns and their questions or you know Arizona is one of the top ten targets for financial scams\nThat's in part because so many people choose to retire here uh and so we need to educate we need to mobilize we need to make sure that we're\nAccessible right here in your own home town so that you we know what's going on there you know if there is a problem and a trend that we know you know who to go after", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Yuma", "day": "25"}