{"month": "10", "state": "AZ", "station": "KAWC", "content": "November second from three to five at the human many library which is located at twenty nine fifty one cell twenty first Dr you can find for the details are you my library dot org\nBroadcasting from the Robert Hardy radio studio complex on the campus of Arizona was during college for more than forty five years this was a WC Yuma G. W. B. Parker idiot point nine ... WC dot org it's five o'clock in the MORNING EDITION is coming over here and just a moment\nSunny skies and humid today ... eighty degrees a bit breezy out there with an earth wind up ten to Fifteen miles per hour just as high as twenty five mostly clear this evening Loeb around fifty five in ... sunny skies with high and you're Seventy eight today breezy out there as well gets his highest twenty five miles per hour mostly clearing the evening with the Loeb around fifty one\n\nGood morning one year after the me too movement changed the way we look at sexual misconduct poll says more than forty percent of Americans things are\nPresident Trump denounced anti Semitism after the mass shooting the tree of life synagogue but critics say his rhetoric in flames and I'm Steve Inskeep\nAnd I'm Rachel Martin in part two of our series ... David Greene visit attacked the high school where the ball players during the national anthem\nAnd Nina Totenberg has a Supreme Court love story it is when they had to over thirty were happy Halloween birthday that Adam more of it we heard from\nEarlier this week on the show in day to be a boy known as al ...\nThe news is that\nMy from NPR News in Washington on corporate Coleman three funerals are plan today in Pittsburgh for some of the eleven victims from last Saturday's mass shooting at the tree of life synagogue Joyce Feinberg Melvin whack sand Irving Younger will be laid to rest\nPresident Trump who visited Pittsburgh yesterday is holding a rally near Fort Myers Florida Today NPR's camera Keith has more\nWith less than a week to election day President Trump has eleven campaign stops on a schedule all aimed at boosting Republicans in competitive Senate and governor's races take Florida a state Trump will visit twice this week\nThere are hotly contested house races but he isn't going to those districts instead focusing on heavily Republican areas where a boost in turnout would help the Republicans running statewide\nTrump ... to be making to stop the each in Missouri and Indiana states he won in twenty sixteen both have Democratic senators in tough reelection fights camera Keith NPR News\nThe spirit lake Sioux tribe has sued the state of North Dakota in federal court alleging its voting id requirements are unconstitutional North Dakota requires voters have a provable street address which not all Native Americans possess on a reservation\nLaw suit seeks to overturn the voting rural even though it's been upheld by the Supreme Court\nA new NPR Ipsos poll showed that just one year after the me too movement took off more than forty percent of Americans think it's gone too far as NPR's Tovia Smith reports that survey also shows a deep partisan divide\nTwo thirds of those surveyed said to me too movement has created a climate where those accused of sexual misconduct will be held accountable but forty three percent think it's gone too far\nThat includes three quarters of Republicans and less than one quarter of Democrats the party divide as much wider than the gender gap on that question has on others like whether victims should be given the benefit of the doubt\nThe party divide as much wider than the gender gap on that question and has on others like whether victims should be given the benefit of the doubt far more Democrats say yes and whether false accusations are common far more Republicans agree with that about a third of those surveyed suggests the movement has not yet gone far enough\nWomen and Democrats were most likely to believe the allegations of sexual harassment these days still get ignored Tovia Smith NPR News\nThere are fears of violence in Pakistan after that nation Supreme Court acquitted a Christian Woman and the or do you have a deed reports from Islam and by the woman was facing the death penalty for blasphemy the chief justice of the Supreme Court took less than a minute to order\nA sea of BP's release nearly a decade off to she with accused of insulting Islam protesters chanted against the judges saying they'd ruled against Islam baby's case has led to the assassination of a minister and a governor who defended her his ... to executed and he is now ... by many impact on\nNPR's ... this is NPR\nThe Pacific trade pact that President Trump pulled the United states out of will take effect at the end of this year Australia has become the latest country to ratify the Trans Pacific partnership\nA loving nations remain in the TPP and other nations have expressed interest in joining it although the withdrawal of the u._s. meant the loss of its large market\nThe utility Southern California Edison says it's electrical equipment is at least partly to blame for an ignition that started last year's deadly Thomas Fire and the earth Emily Sullivan reports the company has released a statement\nWitnesses saw the firing nightmare an S. E. E. power pole at one of at least two origin points to companies sad\nS. E. E. hasn't determined if it's equipment was involved in the second ignition point\nThe company says it's cooperating with investigations being conducted by California fire agencies which have yet to release an official cause the fire burn for over a month and devastated over four hundred and thirty square miles it was blamed for two deaths including one of a firefighter\nThe fire badly burned Santa Barbara county it's wooded hills turning them Baron which coupled with heavy rains led to mudslides that killed at least Seventeen people in January Emily Sullivan NPR News\nRescuers in the northern Philippines are working to free people trapped by a massive landslide that was triggered by the powerful typhoon you to which crashed into the northern Marianna islands with top winds of one hundred eighty miles per hour in the Philippines at least Eighteen people are missing rescuers are using shovels and their hands\nTo dating encore of a Kuhn NPR News\nSupport for NPR comes from NPR stations other contributors include a Rhodes Scholar offering educational travel experiences with an elegy BP accusing him to learning adventure aboard the queen Mary in twenty Nineteen more at R. O. A. B. scholar dot org slash cue him to\nThis is MORNING EDITION on K. A. W. see eighty eight point nine of them and K. A. W. C.\nDot org thanks for spending part of your early morning with us this hour top story is coming up next and today's edition of climate connection is coming up within the hour it's five oh six\nIn Yuma sunny today with a high of eighty degrees north when the ten to Fifteen miles per hour tonight mostly clear lows around fifty five Parker has sunny skies and a high of Seventy eight today north wind Fifteen miles per hour tonight and Parker mostly clear flows around fifty two\nMarks on his sponsor the ...\nMostly clear those around fifty two\nK. E. W. see that you must send them to you mark center sponsor the film series Thursday at the theater the November film is in Syria a film in Arabic with English subtitles it'll be tomorrow evening beginning at seven at the historic human theater which is located up to five or ... main street in downtown Yuma\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved into one of the most respected and revered publications in the world joined K. A. W. sea and retired Arizona highways publisher when Holden at the next spirited discussion to learn the story of this remarkable magazine\nWednesday November seventh from five thirty to seven and St Paul cultural center for information visit K. A. W. C. dot org this event made possible in part by a grant from Arizona humanities\nIt's MORNING EDITION from NPR News I'm Steve Inskeep Rachel Martin and I'm David Greene President Trump wants to next week's mid term elections to be about him in fact he has said as much\nAnd I'm not on the [noise] but I Am on because this is also a referendum about me\nBut this is also a vote about you at the end of the day politics is personal and that's what we've called our series this week\nWe've been traveling to see how some of the biggest stories of the last couple of years have played out in communities and in lives and how those stories could sway votes yesterday we visited a town that was hit by steel tariffs and today\nAnd I should warn you you're going to hear some language that may offend you we are entering the culture wars that you have to stand proudly for the national ...\nGet that son of a job the field right now\nThose protests during the national anthem have been discussed and\nDebated at dinner tables in churches in office lunch rooms at bars but all of that was from the sidelines the community we're visiting today lift it\nWho would ever think somebody didn't care what happened on sale down in Texas football field office lay a lot of people\nThis is Ronny mention he runs a roadside church\nIn Crosby a town outside of Houston passions include God Country and football\nI Love football coach and I had a coach who tell me as a young man is a Christian you know how important football can be used to help teach Christianity\nChoose from the CBC airs this afternoon from two to three on K. A. W. see eighty eight point nine of them and K. A. W. C. dot org I'm chip strictly thanks for joining us early on this Wednesday morning\nNPR's MORNING EDITION continues in a moment\nThe education foundation of human county is accepting nominations for the county education hall of fame nominations are on several categories reflecting the many ways individuals and groups impact education in ... county the deadline for nominations as December seventh and can be made that tiny URL dot com slash human at hall of fame\nIn Parker sunny in a high of Seventy eight today north wind Fifteen miles per hour tomorrow mostly sunny on your eighty five in Yuma sunny in a high of eighty degrees today with north when ten to Fifteen miles per hour and tomorrow sunny in Yuma with a high near eighty five degrees\n... learning center is hosting an exhibit on she got so out of the few drinks you know an artist who say the least nobody's going to lose the money is ongoing from now through November night Monday through Thursday from idioms defending PM and Fridays from nine AM to three PM at the ... learning center which is located up one three four zero eighth avenue in San Luis [noise]\nSupport for NPR comes from this station and from that less than a collaboration software company towering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ... dot com\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template uh dragging drop email editor and twenty four seven customer service\nBy more than two hundred thousand customers worldwide with email tablets and drag and drop email editor and twenty four seven customer service Morris campaign monitored dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial wellbeing first learn more at Raymond James dot\nCom\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel\nMartin when mass shootings happen in this country we often don't ever understand them out if\nThat's not the case with last weekend shooting at the tree of life synagogue in Pittsburgh according to court documents the alleged shooter said he wanted to kill Jewish people President Trump who visited the synagogue yesterday has repeatedly denounced anti Semitism\nBut critics say his division of rhetoric contribute to climate in which anti Semitism can take root NPR's Tom Gjelten assesses document\nAnti Semitism is the ideology that Jews are malevolent out to control the world Jeffrey her a historian at the University of Maryland says the ideology depends on a certain type of argument a way of thinking most importantly a willingness to buy into conspiracy theory\nThe world is governed by small groups of people who operate behind the scenes and are enormously powerful and enormously evil\nThere's no question Donald Trump at times deploys conspiracy theories like TV networks and big newspapers produced fake news like the protesters they interview are actually hired by somebody like philanthropist George Soros\nThey'll go to a personal you know so I don't get paid by sorrows or somebody that\nFrom a rally earlier this month in Missoula, Montana\nNow George Soros happens to be Jewish that mean that President Trump is promoting anti Semitism seems unlikely a large segment of the Jewish population in this country supports him and his agenda especially on matters related to Israel\nBut Geoffrey ... that any promotion of conspiracy theories is dangerous because the logical conclusion of such thinking is anti Semitism\nI Can't think of conspiracy theory that at some point or another dozen bumped into the most famous conspiracy theory that the Jews run the world\nHas written extensively on the anatomy of anti Semitism another key element he says is deep distrust of intellectuals and the elite class in general again a biased Trump is personally promoted as he did in August speaking to a crowd in Ohio\nHere the smartest people [noise]\nAbout the the leaf given the the elite\nSays when people are encouraged to resent the elite Jews get nervous\nThe danger for the Jews is that we are very small in number but we are prominent Hollywood academia thinking the print press\nAny connection of Donald Trump and his rhetoric to an environment in which anti Semitism grows is controversial his own daughter and son in large Jewish and Herve is careful in what he says about Trump\nI think he loves his daughter and he has a lot of Jewish friends so I don't think that his intention is to bring harm to the Jewish people know\nSo then what's the connection\nHe wants to win and he has a special talent knowing how to appeal to the resentments and hatred in order to win he needs to fan the flames of conspiracy then it's perfectly willing to do it\nBe sure other factors may be at work behind any worsening anti Semitism like the growth of social media Nathan diamond is the director of public policy\nTo be sure other factors may be at work behind any worsening anti Semitism like the growth of social media Nathan diamond is the director of public policy for the orthodox union representing Orthodox Jews\nYou can have individual and guy somebody who might have been very isolated but now have these platforms with ... other people that share their views and nerves them on and it's fostered an accelerated a climate of anti Semitism\nWhatever the reason it does seem to be an increasingly dangerous time for Jews the Anti Defamation league says the number of anti Semitic incidents has risen sharply over the last two years Tom Gjelten NPR News\nThis is the time of year when once bacon stores take on a temporary new life is Halloween or Christmas shops that temporary model is becoming an increasingly popular marketing strategy and not just for the holidays from member station WBFO easy in Chicago Suzie on reports\nAt a pop up Halloween store in downtown Chicago shoppers are trying on math sword fighting with prompts\nHe used to be a lens after a few weeks around Halloween Chicago costume company it's bringing the shop back when the dead Halloween shopping is big business it's expected to generate nine billion\nDollars this year and pop shops are all about getting some of that retail dollar Courtland ... general manager of Chicago costume\nAnd people are looking to get costumes we want to be where they are you know it is a very delicate balance for small business like ours the cost of doing business can be quite high so we have to make very good and thought out choices\nHe says in the past they've opened as many as eat pop up shops but this year they only have one he says they're facing more retail competition and getting squeezed by more expensive short term rent many landlords ... short term leases that is the short with commercial real estate service jails says that view appears to be changing\nI definitely think it's a benefit um it really allows a landlord to activate the storefront in activating storefront in any way is always a good thing Halloween shops you know they're fun they're positive they're engaging they attract families\nIn shorts notes that pop ups aren't just holiday themed anymore he points to online retailers and digital companies that are adopting the model to build their brand and interact with customers in person\nAnd they're using that pop up model to sort of test the waters so I think that the Halloween stores may have invented it but some of these brands are perfecting it\nOne company helping them perfect the model is New York based storefront think of it like the air being bea of commercials faces CEO Mohammed oh wash says everyone's using pop ups from small Internet retailers to large companies like Facebook\nWould also be pushed coming from ... to regret and we walked in the bus which on that and we've seen a lot of celebrities in like fingers and commerce function their own brand\nHe says record labels have even set up pop up centered around a specific artist oh washed as as recently as five years ago many landlords would rather sit on a vacant property for a year and entertain a short term lease but now he says more are seeing the upside of getting rent from a pop up store\nYou're changing the traditional model of long term is\nIn your ... by a space which is getting booked every day or every week\nHe says in some cases the pop up and it turns into a permanent tenant\nThere is a solution to adopt right now the shorter than your doctor\nWhen it comes to pop ups landlords can charge higher rent in some cases making that more attractive than long term retail leases for NPR News I'm Suzie on in Chicago\nYeah I mean I'm Suzie on Chicago [noise]\nThis is NPR News\nHundreds of black women are running in federal state and local elections this black women have been the most reliable evolving constituency for many years for the Democratic party [noise]\nNPR's Tovia Smith digging into that hole for I think it's a much thank you and you can hear more of Toby is reporting on the poll findings this afternoon on all things considered listen to that story by asking your smart speaker to play NPR or your local member station by name\n[noise] um\nSome secrets are so well kept would even family members don't know them sodas with the story of two Supreme Court justices and their proposal of marriage and pure legal affairs correspondent Nina Totenberg has the story\nNineteen year old Sandra Day entered stand for last\n... says and their proposal of marriage NPR legal affairs correspondent Nina Totenberg has the story\nWhen Nineteen year old Sandra Day entered Stanford law school in Nineteen forty nine her frequent seat mate was twenty six year old bill Rehnquist the too soon dating regularly but by December of their second year she broke up with him while somehow retaining what she called their study buddy friendship\nBy Nineteen fifty two Sandra the only woman in her class was dating another Stanford student John O'Connor and she was smitten\nBut in March she got a letter from Wayne quest to had graduated early and was in Washington DC he wanted to see her to talk about quote important things\nTo be specific Sandy will you marry me this summer that future chief justice of the United states was proposing to the woman who years later would become the first woman to serve on the nation's highest court\nTheir proposal is disclosed in a new book called first by author Evan Thomas to be published in March Sandra Day would marry John O'Connor becoming Sandra Day O'Connor in Nineteen fifty two\nAs for rank list not long after Sanders said no he would start dating men car now the woman he would marry in Nineteen fifty three according to author Thomas Rehnquist would tell a French shortly before his death that men who died fourteen years earlier was the only woman he ever loved\nIt appears that even the rink within O'Connor children did not know about the marriage proposal O'Connor's saying Jay says he and his siblings were surprised by the news though as J. observes dating in the Nineteen fifties was pretty innocent\nMultiple men proposed to my mom when she was in college and law school and a optimally my dad was the one who was the real deal\nMost remarkable was that O'Connor in rank question remained close personal friend for ever they both ended up living in Phoenix socialized together often and stayed in touch even after Rehnquist appointment to the court\nIndeed he was said to have suggested O'Connor's named to President Reagan for potential appointment to the court in Nineteen eighty one J O'Connor\nWas just an amazing accident of history that my mom and a and her friend and law school classmate ended up on the Supreme Court together not only\nDo they have a wonderful working relationship for over twenty five years on the court they had a wonderful friendship their entire life Nina Totenberg NPR News Washington [noise]\n[noise] oh\nYou hear Nina Totenberg reporting right here on MORNING EDITION from NPR News\n\nI'm Carol hills artistic visionary I way way left China to be able to create freely now he's moving to the U. S. but he's not assuming anything about American freedoms\nYou know on the surface us a defined here to memorize but deeply us also costs and a lot of problem for other people other nations I weigh ways new home on the world [noise]\n\nListen to the world from PR I denied from six to seven right after NPR's all things considered here on gay WC eighty eight point nine at them and K. A. W. C. dot org Climate Connections is up next it's five forty three thanks for listening\nIs one of the sunnier states in the U.S but it has been slow to adopt rooftop solar one reason is that the state's largest utility charges an extra seat or residents who generate\nBut it has been slow to adopt rooftop solar one reason is that the state's largest utility charges an extra seat residents who generate their own electricity\nAt five dollars per kilowatt per month that Alabama Power is charging customers who install solar panels on their home and connected to the grid a typical system in Alabama is around five kilowatts so if you're being charged five dollars per kilowatt per month that's twenty five dollars per month and then over the course of the year that's three hundred dollars\nThat's Michael hands enough gas to a local environmental nonprofit he says the feet cuts into a homeowner's return on investment so it's a disincentive for people considering rooftop solar\nTo help offset the fee gases partnered with a solar company in Birmingham to offer a five percent discount on solar installations for gas members\nIt doesn't off at the entire amount of the fees that you'll end up paying but it does help\nThe group hopes to boost residential solar in the state\nAnd we have an opportunity to improve our health in our environment and our economy all at the same time if we really take advantage of clean renewable energy\nClimate Connections is produced by the center for environmental communication\nHail Climate Connections dot org [noise] Mm\n[noise]\n\nSupport for NPR comes from the station and from the little market offering artisan made goods and home decor with a commitment to fair trade a nonprofit founded by women to empower female artisan in marginalized communities around the world more at the little market dot com\nFrom the John ... Catherine team MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information alright max found dot org and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the country is mourning the shooting deaths of eleven Jewish people at a Pittsburgh synagogue last weekend\nWe are also days away from an important midterm election these two trains collided in Connecticut this week where voters got a political campaign mailer at some see as overtly anti Semitic Connecticut Public radio David to rush reports\nThe full color double sided mailer shows an altered image of Democrat ... who is Jewish with large shiny eyes holding ... hundred dollar bills on the back of the mailers the tagline\nMatt Lesser will take everything you worked for the campaign of letters Republican opponent a charm it sent out the mailer both men are seeking to take over an open state Senate seat\nMother says the flyer and the timing of its release are troubling\nNew line it's been crossed and\nTwo days or after a horrific attack in Pittsburgh is alive and we expected was to see something like this in Connecticut\nHe didn't get the mailer but started getting messages from supporters when it landed in their mailbox is eventually lesser did get his hands on one\nI've been in this business for a while and I'm used to look at the accent certainly there's been quite a few this year to be honest I was shocked when I saw them I never seen anything quite like that\nCharlotte has not responded to requests for comment Alan Greenspan is Charles ... campaign treasurer and he says lesser space was digitally altered\nHis eyes were altered look bigger and greed was his nose altered at all I didn't do the artwork I Can't specify what the artist\nThat is true that had been here for hundreds of years I get you anywhere\nOn ... philosophy and human rights professor at Quinnipiac University in Connecticut\n\nGood to be here again is anywhere\nOn ... and human rights professor at Quinnipiac University in Connecticut\nIt's automatic things that go with anti Semitism addicts a chilling should very telling\nGreenspan who himself is also Jewish so there's nothing in the altered image that's anti Semitic\nNot not ... not wearing his star baby not holding a tour there's nothing in this said that the concern was Jewish\nHe says the intent was to show less or as a greedy politician but let's see says that's not how she sees that\nSomeone can say yes we're we're trying to emphasize that different contacts were showing how greedy bankers are greedy people with money I you know the food out of your mouth you know you can say that the contacts and then it's a legitimate\nArgument except in this case given\nThat eleven people were killed on Saturday her being given that there is an outcry and anti Semitism in the past two years like we've never that's the context in which I\nCan much more easily understand it\nLast year the Anti Defamation league reported that anti Semitic incidents across the United states rose fifty seven percent over the year before that was the largest single year increase and bleed began tracking these figures almost four decades ago Charles Lansing studied the Holocaust and the third Reich at the University of Connecticut\nHe says the altered image is an explicitly anti Semitic but he understands how it could be interpreted that way\nCertainly the beauty eyes that seemed to kind of [noise] accentuate a a kind of a big nose and holding the money it seems conceivable that people have imagined this to be anti Semitic\nThe Connecticut branch of the Anti Defamation league is calling on the ... campaign to quote clarified its position and intent and disseminating the image\nThe chairman of the state's Republican Party initially said that it's only Democrats are raising a stink about the mailer later issued a statement calling it offensive Matt Lesser says it leads to local Republican officials have contacted him with concerns including one who said it resembled something from the middle ages for NPR News I'm David erosion Hartford [noise]\nThis is a WC humor a W. P. Parker eighty eight point nine F him an ... a WC dot org it's six o'clock\nThe ... county library is hosting small business workshops presented by Andrew Tilghman this week there'll be featuring creating a profitable company it will be this Friday afternoon November seconds from three to five at the human many library which is located at twenty nine fifty one south when he first Dr you can find for the details are you my library dot org\nIn Yuma sunny today with a high of eighty degrees north when the ten to Fifteen miles per hour tonight mostly clear lows around fifty five Parker has sunny skies and a high up Seventy eight today north wind Fifteen miles per hour tonight and Parker mostly clear lows around\nFifty to\nMorning fade impossible election does he think Congress has been Trump's intend to buy and sell them on restricting immigration when he says that he could do on MORNING EDITION from NPR News\nPresident talks about finding a way around the Constitution's guarantee of citizenship to people born in the U.S [noise] I'm Rachel\nMartin and I'm Steve Inskeep at a device of time on voters says she feels stuck somewhere in the middle\nPakistan's top court made a dramatic ruling it created a Christian Woman\nAnd Jewish students in Pittsburgh reflect on a shooting at a synagogue\nIt's Wednesday October thirty first day and he's Seventeen when Martin Luther denounced abuses of the Catholic\n\nLive from NPR News in Washington on corporate Coleman there will be funerals and Pittsburgh today for three and the eleven people killed in the tree of life synagogue shooting last Saturday\nJoyce Feinberg Melvin wax and urban younger will be laid to rest there were three funerals yesterday President Trump visited Pittsburgh on Tuesday and paid a visit to the synagogue many protestors gathered near the building to voice their opposition to the president Pennsylvania governor and Pittsburgh mayor declined to join and\nMeanwhile President Trump will be in Florida Today as he continues his push for Republican candidates Adam next week mid term elections NPR's winter Johnston reports\nTrump is scheduled to hold a letting campaign events in the days leading up to the midterms today whole rally supporters and heavily Republican league county along Florida's Gulf Coast there he is expected to make a last minute push for Republican gubernatorial candidate Ron to Athens and US Senate candidate Rick Scott\nTrump will also make campaign stops this week in Montana Indiana and Missouri\nParents Windsor Johnston teams are still searching for\nSo make campaign stops this week in Montana Indiana and Missouri\nAnd parents Windsor Johnston teams are still searching for victims of the lion air passenger jet that crashed into the job at sea on Monday just after taking off from Jakarta\nOne hundred eighty nine people were killed Indonesian authorities are inspecting they're bowing seven thirty seven max eight planes NPR's Julie McCarthy reports from manila\nLying areas under intense pressure to provide answers for family members of the victims of flights six ten there are questions about the technical state of the three month old plane mechanics reportedly had just six and a half hours to examine why the Boeing seven thirty seven max ate a sophisticated jetliner\nHad taken steep dies as it uh send it on a flight from Bali to the Indonesian capital Jakarta the night before the airlines CEO to the issue had been resolved\nData show the aircraft repeated the same unusual pattern the next morning before it crashed into the sea lion air has recently been removed from us and EU black lists but the accident has reignited concerns about safety in Indonesia the airline industry\nJulie McCarthy NPR News manila\nAustria says it will not sign up to a new United Nations packed on immigration carries guy ring reports from Vienna the right wing government sites sovereignty as a concern\nThe coalition came to power last year promising a tough line on immigration now they decided to join the United states in Hungary in rejecting the global compact on migration approved last July by old un member states the agreements that standards for the treatment of migrants and supports country's hosting large numbers of refugees\nHowever chancellor Sebastian coats claims the pact blurs the line between legal and illegal immigration and could restrict Austrian silver into Austria as mine opposition parties say the decision is a movie and are responsible for NPR News I'm Carrie sky bring in Vienna you're listening\nTo NPR\nOkay double you see news shouldn't humor I'm can transcend\nThe fifty two hundred US troops being sent by President Trump to the border and will be extremely limited in what they can do because of a law that prevents the military from engaging in law enforcement on us soil\nThe troops will not be able to detain immigrants she's drugs from smugglers or have any direct involvement in stopping the migrant caravan that's coming toward the U.S\nBut engines high court asking the Trump Administration on whether or not a border patrol agents should be held liable for shooting and killing of Mexican team through the border fence you know gallons a double UCs Jasmin our initial report\nMonday the U.S Supreme Court asked at the federal solicitor general were views on whether Loni sworn can be sued in civil court for the ... of whole ... Elena Rodriguez sorts is on trial in Tucson on criminal charges of manslaughter\nSwords attorney Michael Blum says his client as a federal employee is entitled to qualified immunity from civil litigation\nSorts does not deny that he shot and killed Ellen ...\nThrough the U.S Mexico border fence\nSorts sounds Rodriguez was throwing rocks and him and other agents and wasn't involved in drug smuggling an autopsy conducted in Mexico concluded the teenager was hit ten times in the back of sorts can be sued in civil court it could mean a financial implications for the federal government\nSince employers are generally liable for the actions\nOf their on duty workers capital media services report assistant attorney general Henry Whittaker told the court the location of the shooting in a foreign country coupled with the boys lack of contact with the U.S means the federal\nThe general Henry liquor 'til the court the location of the shooting in a foreign country coupled with the boys lack of contact with the U.S means the federal courts have no jurisdiction and a two to one ruling earlier this year the Ninth Circuit court of appeals concluded otherwise ... I'm Jasmine I did not\nSupport for NPR comes from the financial services firm of Raymond James\nPersonalized wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial well being first learn more at Raymond James dot com\n... this is MORNING EDITION on K. A. W. scenes eighty eight point nine of them and K. A. W. scene dot org and in the next half hour on a double using\nJoin us for bird no in Yuma and partly sunny today with a high near eighty degrees tonight mostly clear lows around fifty five marker will be sunny today with a high near Seventy eight degrees\nTonight mostly clear lows around fifty new degree this is K. A. W. see mom chips drilling thanks for listening\n[noise]\nSometimes I met in relation mark has been at a party\nOkay then what happened in the coal in nature intense I contact and says look and cynical in jeans you they're drinking plate so that they can just hear more freely\nAnd the period Bradley says wait on let's go where near that played this week one way with words Wednesday evening at ... the eighty nine is and this is MORNING EDITION from NPR\nNews I'm Rachel Martin and I'm Steve Inskeep the fourteenth amendment to the constitution is clear the first sentence begins all persons born or naturalized in the United states and subject to the jurisdiction thereof are citizens of the United states all persons born here are citizens\nPresident Trump says he can go around that\nDays before an election that he wants to make about immigration the president talked of trying to eliminate citizenship for children born in the U.S to immigrants who are here illegally he says he could use an executive order although the Republican speaker of the house Paul Ryan says that is not possible\nMichael Anton is with us next the former White House aide who was written in support of ending birthright citizenship in that particular case Mr anti walking back to the program\nHi thank you for having I have to know the president raised this idea in his campaign years ago but hasn't tried it sense now raises it suddenly days before the election is this anything more than an election ploy\nWell I think so first of all he raised it in response to an asked questions so everyone who was looking for some kind of um you know deeply cynical motive here is wrong or he was asked the question apparently at something he had been discussing with the staff for many weeks\nYeah he did say he'd been talking\nA reporter got wind of that and ask him about it and he gave an honest answer I also I have to take issue with what you said in your opening that the\nThe fourteenth amendment is clear and therefore requires this practice what you read the amendment right and I think you I I'm pretty certain I Know you're misinterpreting the central cause subject to the jurisdiction era\n\n[noise] here and now airs today from tend to noon on K. A. W. see good morning I'm chip strangely thanks for joining us for MORNING EDITION it six Nineteen ... sunny in a high end eighty degrees today\nNorth when ten to Fifteen miles per hour tonight mostly clear lows around fifty five Parker it's sunny and a high of Seventy eight today with north when Fifteen miles per hour then tonight mostly clear lows around fifty two\n[noise]\nToday's ... you see day sponsors the moody garden club inviting listeners to their annual plant sale on Saturday November ten from ten till two at the Robert J moody demonstration garden twenty two hundred and west twenty eighth street proceeds from the plant cell will be used for maintenance of the garden learn more on the Robert J moody demonstration garden Facebook page\nFor you in the community libraries hosting a Halloween spook tacky lurk between movies games puzzles crafts and more that today from three to six forty five PM\nHalloween spook Dracula between movies games puzzles crafts and more that today from three to six forty five PM\nAbdullah wealth in library twenty eight seven nine zero San jose avenue in Wheldon van more information you can contact do you see nine to eight three four four seven six nine zero [noise]\nThis is Kerry WC MORNING EDITION from NPR continues next\nSupport for NPR comes from the station and from loved me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more it goes to meeting dot com\nFrom gobble immune kit company that delivered semi prepped meals to be finished at home in Fifteen minutes with one pan gobbled sous chefs do the prep work like chopping and marinating this week's menu of the global dot com slash NPR\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose to euro price T Rowe price invest with confidence\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin election day is coming November six voters will go to the polls to cast their ballots but they will also on that same day take care of it is a relative of a difficult conversation with a loved one maybe start a new career basically live their life\nThis week we're bringing you personal conversations that illustrate the ways in which that lived experience affects how we vote today we'll hear from a young woman named Alexa groom and she's twenty four years old from a family of Democrats in Minnesota at a recent job is changing her political identity\nDid I hear that you've been taking online quizzes to figure out where you actually live in the U.S\nBecause I think so too\nI I I just feel stuck somewhere in the middle and generally it it feels pretty hard to talk about it the\nMiddle is not such a comfortable place for a lot of people I mean are you feeling not as both parties kind of moved to extremes\nYeah I almost feel guilt that I no longer a line with some of my my previous ideas and and I think that's part of the problem is that\nIt seems like if you want to appear as a as a liberal and society you either have to believe everything on the table or you're out you're out of the group\nAnd there's so much going on but I feel like I Can't speak up because you're just asking for people to come after you did you grow up in a in a family that talked a lot about politics\nOr we talked a lot about politics [laughter] I was fortunate that my whole family lives nearby we would go to my grandma's house every Sunday and the kids go play that I like to sit and listen to you know my parents and my aunts and uncles talk and it was generally about you know politics social issues that we were always encouraged to\nVoice our thoughts and growing up in Minnesota which is pretty ... pretty democratic that's when I grew up hearing [noise]\nAs you started to develop your own political identity how did that take shape short it was after\nTwenty sixteen election I felt man I Need to get more involved and that's what led me to working and immigration because I saw all these families who were being deported and it broke my heart and I got a great opportunity to help a lot of people but\nEverything that I had been hearing about ice and conservatives in the news is there these these evil people who don't\nI had been hearing about ice and conservatives in the news is there these these evil people who don't care about these families and they don't want\nPeople coming to our country and\nAnd some of the most and lightning moments I had were when I did work with us when it would go pay bond or go down to the government center and what I saw is and it sounds kind of silly now saying out loud but they're not evil people there people who are looking at the same problem as me\nAnd believing that there is another solution that there's a different solution [noise]\nSo I guess it it gave me a lot more compassion towards the right that I hadn't had before in my personal development yes I still feel like I have my roots in liberalism but\nI I feel like we should be listening to each other a little bit more because I I had thought before that I'd been listening and I I found out that I hadn't and [noise]\nI understand you also watched the Supreme Court nomination hearings of Brett Kavanaugh really closely I did how did those\nHow did those hearings shape how you're thinking about politics or the election\nIt's an issue that hits very close to home I have personally experienced sexual assault um people in my life or very close to me has been raped so it's it's not something that I take lightly whatsoever [noise] um I\nBelieve doctor for it and I I ... I Believe that she experienced what she says she experience but I don't know that I Believe that it was Kevin not and I there was just not quite enough\nEvidence brought forward for me to fully believe that yes this man committed this crime so I don't know who to believe but I don't think that we should put this guilt on someone when we we just don't\nKnow [noise] so how how does that affect how you vote\nIt's made me uncertain I think the way that the liberal party at least from what I've seen in the media has been handling it with you know chasing after people and in restaurants and yelling at people and and it just seems like a lot of\nBullying and and I guess some people would disagree with me and say that it's no that's activism but I think with everybody just yelling at each other we're not really getting anywhere\nYou don't think the right has participated in that same vilification of the other side\nI think they have I I think they're equal problems on both sides because you hear the right calling the left snowflake said and you know they're just whining about these issues and and I I think it comes from both sides but I haven't personally seen it on the left like this up until this past year\nWhat do you think about President Trump I'm not a fan I voted for voted for Clinton I I don't like Trump I think you know going back to the calving of questions I think what he said about Dr Ford was horrendous\nI guess I I don't feel like I'm afraid of him as much as the liberal party feels like they're afraid of him and not afraid to angered I guess I feel I feel more passive because I'm tired of it\nSo you are still considering your choices but what I hear you saying that you would perhaps vote for Republicans for the first time despite President Trump\nCorrect and because it's more than that it's I Would rather look at things issue by issue and decide based on that rather than based on strictly party lines and and rather than going out and filling out all of the Democratic check boxes I\nI Want to feel like I've done my due diligence in at least gone through and\nAnd in rather than going out and filling out all of that democratic checked boxes I I Want to feel like I've done my due diligence at least gone through and and considered the other side so yes I Would consider voting for a Republican and not coming election [noise]\nHave you talked to your family about your about your evolution\nI has been avoiding it\nYou know prior to this conversation I decided well I yeah I suppose I should let them know before the hearing on the radio and I I don't think that they would ever think ... they're very very accepting people although they might hear me say things and go to say that so I just\nIt's it's taken me some time because I'm Still trying to work it out myself so I'll do my research and whoever I think is you know that for the job then yeah that's where I'll put my check mark and that's where all focus my optimism\nAlexa groom and they get so much for talking with I think you really\n[noise] I mean this is NPR News Mm\nHow cities have become the new front line for integrating displaced populations around the world\nEnacted anti\nActor and she was\nAt a remembered service he organized with other eighth graders at the community day school he called for action though did student Christina Greg\nThis hour man why are they like they have to check\nThe adults of the day school also wanted she didn't know where they were coming from history teacher Jackie gold Blum says she told her class she felt helpless in scared I\nSaid how many of the cell phone or of all and they all raised their hands and that was it the floodgates open and they were all presenting the air you know what emotions they were going through and I think they had a hard time processing but I told them that's okay because adults are having a hard time ... I think\nOne of her eighth grade students said she was concerned that the attack on the synagogue would soon be forgotten because mass shootings have become a regular part of life and\nI didn't know what to say to her sometimes the teacher\nDoesn't know what to say but then I came back with you are the voices and you can they change or not to young\nGoldblum says her job is to help her students understand religious identity and cycles of persecution\nHer students have a sense for justice they've been active and marches for refugee and immigrant rights she says they're now connecting those movements to their own Jewish history\nThey have felt very strongly about this because they know from studying the Holocaust how the doors are shut down\nAvi Baron Monroe is the head of the school she says well older students process their grief through learning and reflecting about anti Semitism some younger students were scared\nA lot of them were like I go there or my family goes where I Lived there last week and one child that about um when I go back and my going to have to see the bullet holes Doris\nBarren Munro says she directs teachers to listen first and ask questions before giving answers\nTo see what are you know about it and find out where they're coming from usually it's a much simpler places in the adult\nShe says teachers are not only helping students process tragedy there also teaching them that it's their job to make the world a better place\nIn the birds she could not them which is basically repair of the world so from a very young age we the families and the school share and partner in helping kids understand their place in the world their place in history and what that means\nDuring the school's remembrance service rabbi Jeffrey Myers who leads the tree of life congregation thanks students forgiving him strength he's enjoying them in a prayer of healing\nMe\nFor NPR News I'm Teri Schneider\nYeah yeah [noise]\nAnd this is NPR News this is Kate WC eighty eight point nine of them and said do you see dot org good morning I'm chip strictly\nTuned to MORNING EDITION Connecticut voters received a campaign mailer depicting a democratic state Senate candidate who is Jewish Greeley holding fits the cash many are calling the Republican ad anti\nDepicting a democratic state Senate candidate who is Jewish Greeley holding\nFifth the cash many are calling the Republican ad anti Semitic [noise]\nK. A. W. sees supported by prison he'll Brewing Company a locally owned a restaurant and craft brewery on main street in humans historic downtown humans and visitors alike are invited to remain themselves to join the prison population for a memorable lunch or dinner stand featuring a wide range of many options and craft beers more about prison held Brewing Company on Facebook\nBird notice up next [noise]\nThis is burned out [noise]\nLet's assume for a moment that you have a yard that a pair of Robin says nest it in for twelve years [noise]\nYou may be surprised to learn that it hasn't always been the same pair mortality rate is high enough to know your songbirds for robins it's around fifty percent each year once young birds have pledged\nIf Robin survives timid winter it lives an average at one point seven years after that the oldest Robbins in your yard might be about six years old\nAlthough one banded bird lived almost fourteen years so in a dozen years you've probably had at least a half dozen Robbins and each sex involved in nesting\n\nRobbins and most other migratory birds don't maintain their pair bond over winter so they made a new each spring [noise] but at the same male and female return to the same territory they're very likely to made again\nIt's the male has died another male will likely take over its territory and the living female mate with him\nSimilarly [noise] the female has died a new female a mate with the resident mail [noise] the main nest in the same shrub\nIf it's a favorable nesting spot and our eyes it looks as if the same pair of Robin is returned [noise]\n\nTo learn more come to burn no dot org support for bird and out comes from the Puerto randomness tourism bureau info on February is whooping crane festival and hundreds of species of birds to see year round and visit port Iran's is dot com\nSupport for NPR comes from the station and from ultimate software dedicated to putting people first with cloud based solutions for HR payroll and talent management learn more and ultimate software dot com ultimate software people first\nFrom Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse in recovery starring Steve corral and Timothy ... now playing and from Americans for the arts\nThis is MORNING EDITION on K. A. W. see this election season city of human residents will vote on a classic election day issue the condition of city streets and roads proposition for one one would raise the city sales tax by one half of one percent beginning in January [noise]\nK. A. W. sees Lou gum spoke with Jeffrey polston an accountant and member of citizen initiative for one one\nPosted in work with other human residents to help get the issue on the ballot\nSo the only people that can vote on this or actually those who are registered voters within the city limits of you mom it's a house in sales tax\nThat will go into it designated reserve fund that can only be used to fix our current roads\nAnd so it can be swept to you know buy a new fire truck or anything along those lines as does the funds that can only be utilized\nIt can be swept to you know buy a new fire truck or anything along those lines is designated funds that can only be utilized\nIs on the ballot in which has to fix repair our current roads and that's the most important thing and it's a half percent sales tax and that will be charged anybody that buys goods within the city limits of of humor\nAnd for example that that the economic implication that is if you go spend ten dollars and buy something at a local store for ten dollars within the city of you mom isn't it costs you an astronomical\nWe need the money to keep our roads from falling apart if this does not pass I've been told by a city by the city I'm a\nThat our roads will be in such disrepair that will never recover from it if there are a lot of people who are very dissatisfied already with the state of humorous roads and I'm One of my I own a business off of Catalina kennel in Arizona avenue\nAnd that I I feel like I'm playing dodge ball with the bottles\nUm my good friend back in ... I'm Talking about having to replace three tires and about a twelve month period\nOr the damage to their cars and and the key things to this is is that you either pay the sales tax and less six arose and controlling our own destiny or you're going to be paying all the auto dealerships and the mechanic local mechanic to fix your cars\nNot to mention and my fear is you can only six a car but what about the accident where somebody is um gets worse because of a pothole it gets out on accident and loss of life\nThat's what my concern is and he was a growing city to looking ahead roads are only more important exactly ... and those people are coming to look at you ma to bring comics are looking and saying these roads are terrible we don't want to invest our company into this community\nI put one in the winds of invite people over your house to have you know dinner and you don't clean the house talk a little bit about the the citizen involvement level of this particular opposition this all started about six months ago there was about eight of us who were asked to sit in and talk about\nWays that the city of of humor 'cause increases revenue stream and we were told there were several issues that are underfunded\nAnd the key when that came up was about the lack of money available to fix our roads\nAnd the only reason I'm involved in this is because it's a segregated designated funds that can only be used to fix or roads and to be clear it's not that's not because you said that it's actually word it that way it is worried that way that's correct we worked on that language a long time had an attorney looked at and make sure that it was correct\nAnd you know sunny today with the highest Seventy nine north wind Fifteen to twenty miles per hour tonight in Yuma clear skies lows around fifty six degrees Parker will have sunny skies in a high up Seventy eight today north when Fifteen to twenty five to twenty miles per hour\nTonight mostly clear blows around fifty degrees [noise] we have a record of sixty seven in Yuma sixty five and Parker [noise] and the sixty six degrees [noise]\nIn summertime [noise]\nThis is K. A. W. see [noise] it's seven o'clock [noise] ooh\nGood morning one year after the me too movement changed the way we look at the sexual misconduct poll says more than forty percent of Americans think the reckoning\nDenounced anti Semitism after the mass shooting at the tree of life synagogue but critics say his rhetoric in flames and I'm Steve Inskeep and I'm Rachel Martin in\nPart two of our series and politics and you know David Greene visit attack the high school football players during the national anthem\nAnd Nina Totenberg hand a Supreme Court love story it is Wednesday October thirty were happy Halloween birthday that Adam ... we heard from\nEarlier this week on the show in day to be going on as a wrong\nThe news is that\n\nLine from NPR News in Washington on corporate Coleman three more funerals will be taking place today for those killed in a shooting at the tree of life synagogue in Pennsylvania for days ago NPR's Brakkton Booker has more from Pittsburgh\nMelvin wax was eighty eight years old he was described as a sweet guy and his greatest passions included his grandson\n... was ... years old he was described as a sweet guy and his greatest passions included his grandson who's Judaism in the Pittsburgh Pirates Joyce Feinberg was Seventy five and those who knew her say she was someone who cared for others who needed a helping hand\nOr even younger was sixty nine and with the youth football and baseball coach they will be the next to be buried shooting rampage took the lives of eleven Jewish worshippers during ... service on Saturday morning\nThe suspected gunman is charged with twenty nine counts and is due back in court on Thursday\nBrakkton Booker NPR News Pittsburgh\nPresident Trump traveled to Pittsburgh yesterday to pay his respects to the victims of the shooting several hundred demonstrators gathered close by the synagogue to protest his visit saying his rhetoric has emboldened racist today Trump tweeted that he was received warmly and that he did not see the quote small protest\nA new NPR Ipsos poll shows that more than forty percent of Americans believe the me too movement has gone too far NPR's Tovia Smith reports that public opinion divides along political party lines three quarters\nOf Republicans and one quarter of Democrats Samy too has gone too far\nRepublicans are also more likely to believe false accusations are common and less likely to say alleged victims should be given the benefit of the doubt on the other hand a third of respondents believe allegations of misconduct these days still get ignored\nNPR's Tovia Smith reporting\nPakistan Supreme Court has acquitted a Christian Woman who had been sentenced to death for blasphemy\nThat Cain said transfixed Pakistan and now the country is on high alert for a tax NPR's dia de reports from Islam of on the chief justice of the Supreme Court took less than a minute to order a sea of BP's release nearly a decade after the illiterate fond hand was accused of insulting Islam\nAre advocates say her fellow Muslim farmhands what angry because maybe try to drink water from the same bowl of them\nAs the chief justice issue devoted security forces shut down the area around the Supreme Court\nDozens of protesters gathered at a distance they chanted against the judges saying they'd ruled against Islam baby's case has royal Pakistan it's led to the assassination of a minister and a governor who defended her\nHis Motorola was executed and he's now revered as a ... by many in Pakistan do you date NPR News Islamabad on Wall street the Dow Jones industrial are more than one percent an ad that gives up more than two percent\nYou're listening to NPR okay\nWC news this morning I'm Jasmine out of not a week to go before mid term elections president Donald Trump path revisited one of his presidential campaign themes\nRunning claims he can end up birthright citizenship and an interview with ... Trump vows to end the right to citizenship for the children of non citizens and an authorized immigrants born in the U.S Arizona Congress men ... last as it is all part of President Trump's agenda\nTo save the Republican Party in the upcoming elections and continue by adding whether militarized border communities\nHolding our doors with islands seekers are violating the constitution and ending birthright citizenship Trump's baseless accidents and you're hungry and it falls would put his own political goes ahead of American values and law the fourteenth amendment says all persons born or naturalized in the U. S.\nAnd subject to the jurisdiction of our citizens of the U.S\nIn the states where they reside president Donald Trump said the executive order\nIs still being drafted a volunteer for a group that tries to prevent immigrants from dying in the Arizona desert\nPresident Donald Trump said the executive order is still being drafted a volunteer for eight group that tries to prevent immigrants from dying in the Arizona desert is scheduled for a January ... trial on charges that he illegally harbored people in the U.S\nThere was on a Daily Star reports Scott Daniel Warren was arrested in January after federal agents conduct surveillance on a building and I don't know where to immigrants were given food or water beds and clean clothes worn has pleaded not guilty to the charges weren't as a volunteer with the group known more debt\nHis arrest came after the group released videos of the border patrol agent taking over water jugs meant for immigrants and of another age into pouring water on the ground immigrants who sneak in the U.S through the desert base many charges including orange gene heat\nThe more than fifty two hundred active duty troops being sent by president Donald Trump to the U.S border states will be limited in what they can do under federal law for ... I'm Jasmine out in\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes in modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more at ... dot com and the anti you Casey foundation\nHere to seven oh six this is MORNING EDITION on K WC eighty eight point nine of them and K. A. W. C. dot org and good morning thank you for listening\n... head on MORNING EDITION President Trump has repeatedly denounced anti Semitism following the synagogue massacre but\nSince he took office anti Semitic incidence of reasons and his critics say his rhetoric may be to blame lead story in about Fifteen minutes on MORNING edition is K. A. W. see thanks for listening\nThere's so many little bites of news you get throughout your game all things considered fills in the gaps between the day's most important stories so you get the what's the last midterm election only about twenty percent of voters under age thirty showed up at the polls\nAnd the wives can only say young people tend to move around a lot and so they often feel less invested in local elections here the bigger picture on all things considered every afternoon from NPR News [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin and I'm David Greene President Trump wants to next week's mid term elections to be about him in fact he has said as much\nAnd I'm not on the [noise] but I Am on detectors because this is also a referendum about me\nBut this is also a vote about you at the end of the day politics is personal and that's what we've called our series this week\nWe've been traveling to see how some of the biggest stories of the last couple of years have played out in communities and in lives and how those stories could sway votes\nYesterday we visited a town that was hit by steel tariffs and today and I should warn you you're going to hear some language that may offend you we are entering the culture wars you have to stand proudly for the national\nGet that son of a job the field right now\nThose protests during the national anthem have been discussed and debated\nAt dinner tables in churches in office lunch rooms at bars but all of that was from the sidelines the community we're visiting today lift it who would ever think somebody didn't care what happened on field down into\nBut all of that was from the sidelines the community we're visiting today lift it\nWho would ever think somebody didn't care what happened on sale down in Texas football field office lay a lot of people\nThis is Ronny mention he runs a roadside church\nIn Crosby a town outside Houston passions include God Country and football uh\nI Love football coach and I had a coach who helped me as a young man's a Christian you know how important football can be used to help teach Christianity\nAnd the period abruptly says wait on let's go you were there to play this week one way with words do we hope you can\nUs for a way with words this evening from seven to eight right here on K. A. WC eighty eight point nine of them\nAnd K. A. W. C. dot org it's seven Nineteen I'm chip strangely thanks for joining us for MORNING EDITION coming up Halloween pop up stores occupying temporarily vacant store\n... thanks for joining us for MORNING EDITION coming up Halloween pop up stores occupying temporarily vacant storefront are back in the pop up concept is expanding\nNow online retailers and digital brands are taking the pop up model and refining it and later back when former U.S Supreme Court Justice Sandra Day O'Connor was Justice Sandra day she had an active social life\nMultiple man proposed to my mom when she was in college and law school and ultimately my dad was the one who was the real deal\nBut here's the thing one of those suitors would later serve on the highest court with her that story and Fifteen minutes on K. A. W. see human sunny high near Seventy nine today partner sunny pioneer Seventy eight sixty seven in Yuma sixty five in park\nOr in sixty six degrees in summertime ... supported\nBy visit human presenting large events such as the Rio de surveys of Rufus unique activities like agricultural tours and providing current information about the ... area learn more online at ... dot com or at the visitor's center in the ... crossing national heritage area [noise]\n\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with features for a range of customers from ... to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information at a double us is how dot com\nAnd from the University of Florida we're solving for next it's powered by its land grand heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin with mass shooting happened in this country we often don't ever understand them out if\nThat's not the case with last weekend shooting at the tree of life synagogue in Pittsburgh according to court documents the alleged shooter said he wanted to kill Jewish people President Trump who visited the synagogue yesterday has repeatedly denounced anti Semitism\nBut critics say his division of rhetoric contributes to climate in which anti Semitism can take root NPR's Tom Gjelten assesses document\nAnti Semitism is the ideology that Jews are malevolent out to control the world Jeffrey her a historian at the University of Maryland says the ideology depends on a certain type of argument a way of thinking most importantly a willingness to buy into conspiracy theory\nThe world is governed by small groups of people who operated behind the scenes and are enormously powerful enormously\nThere's no question Donald Trump at times deploys conspiracy theories like TV networks and big newspapers produce fake news like the protesters they interview are actually hired by somebody like philanthropist George Soros\nThey'll go to a personal you know so I don't get paid by Soros or somebody that\nA rally earlier this month in Missoula, Montana\nNow George Soros happens to be Jewish does that mean that President Trump is promoting anti Semitism seems unlikely a large segment of the Jewish population in this country supports him and his agenda especially on matters related to Israel\nBut Geoffrey ... that any promotion of conspiracy theories is dangerous because the logical conclusion of such thing\nIsrael but Geoffrey ... that any promotion of conspiracy theories is dangerous because the logical conclusion of such thinking is anti Semitism\nI Can't think of conspiracy theory that at some point or another doesn't bumped into the most famous conspiracy theory that the Jews run the world\nPurpose written extensively on the anatomy of anti Semitism another key element he says his deep distrust of intellectuals and the elite class in general again a biased Trump is personally promoted as they did in August speaking to a crowd in Ohio\nHere this artist\nAbout release the elite you ever see the elite\nSays when people are encouraged to resent the elite Jews get nervous\nThat danger for the Jews is that we are a very small in number but we are prominent Hollywood academia banking the print press\nAny connection of Donald Trump and his rhetoric to an environment in which anti Semitism grows his controversial his own daughter and son in large Jewish and Herve is careful in what he says about Trump\nI think he loves his daughter and a lot of Jewish friends so I don't think that his intention is to bring harm to the Jewish people know\nSo then what's the connection\nHe wants to win and he has a special talent of knowing how to appeal to the resentments and hatred that is the editor in order to win he needs to fanned the flames of conspiracy then it's perfectly willing to do it\nTo be sure other factors may be at work behind any worsening anti Semitism like the growth of social media Nathan diamond is the director of public policy for the orthodox union representing Orthodox Jews\nYou can have individual and guys semi school might have been very isolated but now have these platforms and what they can find other people that share their views and urged them on and it's fostered an accelerated a climate of an anti Semitism\nWhatever the reason it does seem to be an increasingly dangerous time for Jews the Anti Defamation league says the number of anti Semitic incidence has risen sharply over the last two years Tom Gjelten NPR News\nThis is the time of year when once bacon stores take on a temporary new life is Halloween or Christmas shops that temporary model is becoming an increasingly popular marketing strategy and not just for the holidays for member station WBFO easy in Chicago Suzie on reports\nAnd a pop up Halloween store in downtown Chicago shoppers are trying our ... sword fighting with ...\nUsed to be a lens after a few weeks around Halloween Chicago costume company is bringing the shop back when the dead Halloween shopping is big business it's expected to generate nine billion dollars this year and pop shops are all about getting some of that retail dollar Courtland ... general manager of Chicago costume\nWhen people are looking to get costumes we want to be where they are you know it is a very delicate balance for small business like ours the cost of doing business can be quite high so we have to make very good and thought out choices\nHe says in the past they've opened as many as eat pop up shops but this year they only have one he says they're facing more retail competition and getting squeezed by more expensive short term rent many landlords ... short term leases but the short with commercial real estate service Jay Aloul says that view appears to be changing\nDefinitely think it's a benefit um it really allows a landlord to activate the storefront in activating storefront in any way is always a good thing Halloween shops\nAnd if it um it really allows a landlord to activate the storefront in activating storefront in any way is always a good thing Halloween shops you know they're fun they're positive they're engaging they attract families\nIn shorts notes that pop ups aren't jak holiday themed anymore he points to online retailers and digital companies that are adopting a model to build their brand and interact with customers in person\nAnd they're using that pop up model sort of test the waters so I think that the Halloween stories may have invented it but some of these brands are perfecting it\nOne company helping them perfect the model is New York based storefront think of it like the air being bea of commercial space is CEO Mohammed oh wash says everyone using pop ups from small Internet retailers to large companies like Facebook\nWhich also push coming from ... to regret and we walked in the ... and we've seen a lot of celebrities in like fingers and homers function their own brand\nHe says record labels have even set up pop up centered around a specific artist oh washed as as recently as five years ago many landlords would rather sit on a vacant property for a year and entertain a short term lease but now that's more are seeing the upside is getting rent from a pop up store\nYou're changing the traditional Moldova for long term is and\nYour ... by a space which she's getting booked every day or every week\nHe says in some cases the pop a banker turns into a permanent tenet\nThere is a solution ... right now the shorter than your doctor\nWhen it comes to pop ups landlords can charge higher rent in some cases making that more attractive than long term retail leases for NPR News I'm Suzie on in Chicago [noise]\nThis is NPR News\nHundreds of black women are running in federal state and local elections this year black women had been the most reliably bowling constituency for many years for the Democratic party\nWould have been a year ago NPR's Tovia Smith digging into that poll for I think it's much thank you and you can hear more Tovia supporting on the poll findings this afternoon on all things considered listen to that story by asking your smart speaker to play NPR or your local member station by name\n[noise]\nSome secrets are so well kept would even family members don't know them sodas with the story of two Supreme Court justices and their proposal of marriage NPR legal affairs correspondent Nina Totenberg has the story\nWhen Nineteen year old Sandra Day entered Stanford law school in Nineteen forty nine her frequency mate was twenty six year old bill Rehnquist the two were soon dating regularly but by December of their second year she broke up with him while somehow retaining which he called their study buddy friendship\nBy Nineteen fifty two Sandra the only woman in her class was dating another Stanford student John O'Connor and she was smitten\nBut in March she got a letter from Wayne quest to had graduated early and was in Washington DC he wanted to see her to talk about quote important things\nTo be specific Sandy will you marry me this summer the future chief justice of the United states was proposing to the woman who years later would become the first woman to serve on the nation's highest court\nTheir proposal is disclosed in a new book called first by author Evan Thomas to be published in March Sandra Day would marry John O'Connor becoming Sandra Day O'Connor in Nineteen fifty two as for rank list not long after Sanders said no he would start dating nan Cornell the woman he would marry in Nineteen fifty three\nAccording to author Thomas Rehnquist would tell a French shortly before his death that men who died fourteen years earlier was the only woman he ever loved it appears that even the rink within O'Connor children did not know about the marriage proposal\nO'Connor son Jay says he and his siblings were surprised by the news though as J. observes dating in the Nineteen fifties was pretty innocent\nMultiple men propose to my mom when she was in college and law school and my dad was the one who was the real deal\nMost remarkable was that O'Connor in rank was remained close personal friends for ever\nThey both ended up living in Phoenix socialize together often and stayed in touch even after Rehnquist appointment to the court indeed he was sent to have suggested O'Connor's named to President Reagan for potential appointment to the court in Nineteen eighty one J O'Connor\nWas just an amazing accident of history that my mom and a and her friend and law school classmate\nIn Nineteen eighty one jail Connor\nWas just an amazing accident of history that my mom and a and her friend and law school classmate ended up on the Supreme Court together not only did they have a wonderful working relationship for over twenty five years on the court they had a wonderful friendship their entire life Nina Totenberg NPR News Washington [noise] [noise]\nMm [noise] ooh\nYou hear Nina Totenberg reporting right here on MORNING EDITION from NPR News\n\nThis is gay WC eighty eight point nine of them and K. A. W. C. dot org good morning I'm chips ... MORNING EDITION continues in just a few minutes\nMany Connecticut voters are calling all Republican ad anti Semitic the ad depicts a democratic state Senate candidate who is Jewish Greeley holding fits some cash\nYou rely on K they will be easy to bring you trusted news and intelligent civil discourse and now more than ever listeners support is the heart and soul of gay there'll be you see our\nNext pledge drive begins next week and we hope you'll show your support or to help us get a head start on our drive visit us at ... dot org and make your gifts securely on line thing [noise]\nThis is K. A. W. see thanks for listening [noise] Climate Connections is up next [noise]\n\nAlabama is one of the sunny states in the U.S but it has been slow to adopt rooftop solar one reason is that the state's largest utility charges an extra feed a residence who generate their own electricity\nAt five dollars per kilowatt per month that Alabama Power is charging customers who install solar panels on their home and connected to the craft a typical system in Alabama is around five kilowatts so if you're being charged five dollars per kilowatt per month that's twenty five dollars per month and then over the course of the year that three hundred dollars\nThat's Michael hands enough gas a local environmental nonprofit he says the feet cuts into a homeowner's return on investment so it's a disincentive for people considering rooftop solar\nTo help offset the the gases partnered with a solar company in Birmingham to offer a five percent discount on solar installations for gas members\nIt doesn't off at the entire amount of the fees that you'll end up paying but it does help\nThe group hopes to boost residential solar in the state\nAnd we have an opportunity to to improve our house in our environment and our economy all at the same time if we really take advantage of clean renewable energy\nClimate Connections is produced by the center for environmental communication and\nAnd yell Climate Connections dot org [noise]\nSupport for NPR comes from this station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Kara data dot com\nAnd from that less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nEDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the country's morning the shooting deaths of eleven Jewish people out of Pittsburgh synagogue lots\nMORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the country's morning the shooting death of seven eleven Jewish people out of Pittsburgh synagogue last weekend we are also days away from an important midterm election these two trains collided in Connecticut this week\nWhere voters got a political campaign mailer that some see as overtly anti genetic Connecticut Public radio David direct reports\nThe full color double sided mailer shows an altered image of Democrat ... who is Jewish with large shiny eyes holding festivals a hundred dollar bills\nOn the back of the mailers the tagline Matt Lesser will take everything you worked for the campaign of letters Republican opponent at ... sent out the mailer both men are seeking to take over an open state Senate seat\nLeft her son's a flyer and the timing of its release are troubling\nA new one that's been crossed and you know two days or after a horrific attack in Pittsburgh ... the last thing we expected was to see something like this in Connecticut\nHe didn't get the mailer but started getting messages from supporters when it landed in their mailbox is eventually lesser did get his hands on one\nI've been in this business for a while and I'm used to look at the accent certainly there's been quite a few this year to be honest I was shocked when I saw that I'd never seen anything quite like that\n... has not responded to requests for comment Alan Greenspan is ... campaign treasurer and he says lots of his face was digitally altered\nHis eyes were altered look bigger angry was there's no altered at all I didn't do the artwork document specify what the artist that\nThat is true that has been here for hundreds of years I get you anywhere\nOn ... philosophy and human rights professor at Quinnipiac University in Connecticut\nHe's are such an automatic things that go with anti Semitism medics a chilling should very challenging\nGreenspan who himself is also Jewish so there's nothing in the altered image that's anti Semitic\nNot not ... not wearing his started David not holding a tour there's nothing in this said that the ... and was Jewish\nHe says the intent was to show less or as a greedy politician but ... says that's not how she sees that\nSomeone can say yes we're we're trying to emphasize that different contacts were showing how greedy bankers are greedy people with money I you know the food out of your mouth you know you're going to say that the contacts and then it's a legitimate argument\nExcept in this case given that eleven people were killed on Saturday from being given that there is\nAn outcry and anti Semitic and in the past two years like we've never that's the context in which I can much more easily understand it\nLast year the Anti Defamation league reported that anti Semitic incidents across the United states Rosa fifty seven percent over the year before\nThat was the largest single year increase in the lead began tracking these figures almost four decades ago Charles Lansing studied the Holocaust and the third Reich at the University of Connecticut He says the altered image is an explicitly anti Semitic but he understands how it could be interpreted that way\nCertainly to be the eyes that seemed to kind of [noise] accentuate a kind of um big\nNose and holding the money it seems conceivable that people have imagined this to be anti Semitic\nTo Connecticut branch of the Anti Defamation league is calling on the charm of campaign to quote clarify its position and intent in disseminating the image\nThe chairman of the state's Republican Party initially said that it's only Democrats who are raising a stink about the mailer it later issued a statement calling it offensive Matt Lesser says it leads to local Republican officials have contacted him with concerns including one who said it resembled something from the middle ages for NPR News I'm David erosion Hartford\nI'm chip strangely in Yuma sunny today with the highest Seventy nine north wind Fifteen to twenty miles per hour tonight in Yuma clear skies and a low of fifty six Parker will have sunny skies in a high of Seventy eight today\nNorth wind Fifteen to twenty miles per hour tonight and Parker mostly clear lows around fifty degrees a record of sixty seven in Yuma sixty five and Parker fans sixty five degrees\nIn summer and this is K. A. W. see thanks for listening it's eight o'clock\nThis morning facing possible election defeats in Congress and President Trump intend to buy his focus on restricting immigration when he says I'm going to get out on MORNING EDITION from NPR News\nThe president talks about finding a way around the Constitution's guarantee of citizenship to people born in\nThe president talks about finding a way around the Constitution's guarantee of citizenship to people born in the U. S.\nI'm Rachel Martin and I'm Steve Inskeep with a device of time on voters says she feels stuck somewhere in the middle\nPakistan's top court made a dramatic\nAnd Jewish students and reflect on a shooting at a synagogue\nIt's Wednesday October thirty first the Seventeen\nNews is that [noise]\nLive from NPR News in Washington encore of a cool and President Trump is traveling to a political rally near Fort Myers Florida Today I had of next Tuesday's elections White House spokeswoman Sarah Sanders says that Trump is going to start campaigning for Republican gubernatorial and Senate candidates\nThey're awful places where the president overwhelmingly\nIn a those locations and I think that the president the best messenger for the party he's had an incredible historic first two years in office and the other great story to tell\nTrump has eleven campaign stops on his schedule before the election I mean on the president continues to tweet today about what he wants to do about changing birthright citizenship\nThis is guaranteed and the fourteenth amendment to the U.S constitution Trump falsely claims that it is not he's also threatening to take the matter to the U.S Supreme Court to get the constitution changed the constitution has only amended through action by the U.S Congress and state legislatures\nNative Americans in North Dakota are suing the state over voter identification requirements NPR's Jeff Brady reports the lawsuit comes as tribes are scrambling to make sure their members have the required id to vote next Tuesday\nThe spirit lake Sioux tribe and members of other tribes are suing the state to overturn a requirement that voters have a street address on their identification\nMany Native Americans in North Dakota live in rural places and some don't have a street address that get their mail at a local post office Native Americans are an important voting bloc for Democrats in North Dakota\nIn recent years Republicans who control the state government have changed identification requirements citing concerns about potential voter fraud earlier this month the U.S Supreme Court let stand a previous decision that the address requirement is constitutional\nJeff Brady NPR News Bismarck North Dakota\nThere are three funerals planned today in Pittsburgh for some of the eleven victims of last Saturday's mass shooting at the tree of life synagogue joins Feinberg Melvin wax and urban younger will be laid to rest\nDuck boots begin rolling through the streets of Boston this hour it's a parade to celebrate the world series victory of the red Sox from member station WB you are in Boston Bob Schieffer\nReports this is the fourth time since two thousand and four that the red Sox won the world series and also the fourth time players of piled onto the duck boats to celebrate with rolling rally through the city\nThe boats are leaving from Fenway Park and will make their way through the streets with hundreds of thousands of fans expected to cheer them on Marty Walsh says that while parade like this might be a familiar sight in Boston this when and his team stand out\nThis is a an all time great team that we had I think a lot of people enjoyed watching this team uh everybody contributed these plays a role models and we want to celebrate them in Boston style\nDoes your socks team won a franchise record one hundred and eight games in the regular season for NPR News I'm Bob Schieffer in Boston on Wall street that I was up more than one percent It's NPR\n... this morning I'm Jasmine out enough that you know police department in cooperation with the human county fair will have a safe place night for you my area kids too\nIt's MORNING I'm Jasmine had enough that you know police department in cooperation with the county fair will have a safe place night for you my area kids to trick or treat the double ... Johnson reports\nIt's called the scary and save trick or treat taking place at the county fairgrounds him a police department spokesperson sergeant Murray Franklin says area public service agencies businesses nonprofits all will be on hand to give away save treats in a safe environment\nAnd she says there's another purpose for two nights of at\nThe help raise money for Special Olympics and it goes to our athletes within the community a hundred percent of the proceeds go to Special Olympics\nThe scary and save trick or treat begins with five thirty ending at eight thirty at the fairgrounds but sergeant Franklin reminds everyone that many kids will be doing\nThe traditional trick or treating city neighborhoods cheer just drivers to be on the lookout for trick or treaters and kids going from house to house for candy to watch for cars she says children should stay on sidewalks and warns trick or treaters not to eat any candy until an adult as examined it\nI'm Kim Johnson K. A. W. see news\nThan more than fifty two hundred active duty troops being sent by president Donald Trump to the U.S Mexico border states will be limited in what they can do under federal law that restricts\nThe military from engaging in law enforcement on American soil the troops coming to Arizona would not be allowed to detain immigrants sees the drugs from smugglers or have any direct involvement in stopping him migrants caravan and it's still about one thousand miles from the nearest border crossing\nAnd set their role will largely mirrors out of the existing National Guard troops ... use the news any Yuma I'm Jasmine I did not\nSupport for NPR comes from NPR stations other contributors include a Rhodes Scholar offering educational travel experiences with an algae BP cute theme to learning adventure aboard the queen Mary and twenty Nineteen more at R. O. A. B. scholar dot org slash cue him to\nSay to fix this is MORNING EDITION on K. A. WC eighty eight point nine of them and K. A. W. C. dot org [noise] good morning I'm chip stray late head on MORNING EDITION we talk with a young woman from a family of Democrats in Minnesota [noise]\nShe's long considered herself a proud liberal but a recent job change is changing her political identity that begins in about Fifteen minutes on MORNING edition in ... near Seventy nine Parker sunny highs near Seventy eight\nSixty seven and ... sixty five and Parker and sixty five in summer and\nThere has to be a better way to do elections\nCompulsory voted in Australia or we could let children vote on\nWe can charge people money is\nMaybe they should be a national holiday with parades and parties and cake\nElections to point out next time onto the best time knowledge our\nSunday Morning and ... you see any ...\nMORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep the fourteenth amendment to the constitution is clear the first sentence begins\nAll persons born or naturalized in the United states and subject to the jurisdiction thereof are citizens of the United states all persons born here are citizens President Trump says he can go around that\nDiction there of our citizens of the United states all persons born here are citizens President Trump says he can go around that\nDays before an election that he wants to make about immigration the president talked of trying to eliminate citizenship for children born in the U.S to immigrants who are here illegally he says he could use an executive order although the Republican speaker of the house Paul Ryan says that is not possible\nMichael Anton is with us next the former White House aide was written in support of ending birthright citizenship in that particular case Mr Hands on walking back to the program\nHi thank you for having I have to know the president raised this idea in his campaign years ago but hasn't tried it sense now raises it suddenly days before the election is this anything more than an election ploy\nWell I think so first of all he raised it in response to an asked questions so everyone who's looking for some kind of um you know deeply cynical motive here is wrong or he was asked the question apparently it's something he had been discussing with the staff for many weeks\nYeah he did say he'd been talking\nAbout a reporter got wind of that and ask him about it and he gave an honest answer I I also I have to take issue with what you said in your opening that the\nThe fourteenth amendment is clear and therefore requires this practice what you read the amendment right and I think you I I'm pretty certain I Know you're misinterpreting the central cause subject to the jurisdiction thereof that does not mean simply\nHere and now here's today from noon right here on K. A. W. see I'm chip strangely thanks for joining us for MORNING EDITION it's eight Nineteen\nAn initiative on the ballot in the city of Yuma would Institute attack specifically to fix the city's rose something local residents and business owners say it's badly needed more on proposition for one one coming up and about\nThe next half hour on K WC a teacher in a Jewish school in Pittsburgh tries to help her students understand the mass shooting at a nearby synagogue\nMore on how these students are processing their grief and fear coming up and about Fifteen minutes long pay double usually and later China is testing a new plan to make it easier for citizens to do business but also to help them trust each other more\nIt's called the social credit score [noise]\nIn Parker sunny today highs near Seventy eight tonight mostly clear those around fifty degrees you must sunny in a high up Seventy nine today tonight clear lows around fifty six degrees [noise]\nWe have a report of sixty five and Parker sixty seven in Yuma and sixty five in summer and this is K. A. W. see\nToday's Cade UC day sponsors moody gardening club inviting listeners do their annual plant sale on Saturday November ten from ten till two at the Robert J moody demonstration garden twenty two hundred and west twenty eighth street proceeds from the plant cell will be used for maintenance of the garden learn more on the Robert J moody demonstration garden Facebook page\nSupport for NPR comes from this station and from it less than a collaboration software company towering teams around the world committed to providing the tools and practices to help teams plan track build and work better together\nMore at ... dot com from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a dragon drop email editor and twenty four seven customer service Morris campaign monitored dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more at Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin election day is coming November sex voters will go to the polls to cast their ballots but they will also on that same day take care of it take relative of a difficult conversation with a loved one maybe start a new career basically live their life\nThis week we're bringing you personal conversations that illustrate the ways in which that lived experience affects how we vote today we'll hear from a young woman named Alexa groom and she's twenty four years old from a family of Democrats in Minnesota and a recent job is changing her political identity\nDid I hear that you've been taking online quiz is to figure out where you actually lined the fat\n[laughter] because I just don't know I\nI I just felt stuck somewhere in the middle and generally it it feels\nBecause I don't know I\nI I just feel stuck somewhere in the middle and generally it builds pretty hard to talk about it\nThe middle is not such a comfortable place for a lot of people I mean are you feeling not as both parties going to move to extremes\nYeah I almost feel guilt that I no longer a line with some of my my previous ideas and and I think that's part of the problem is that\nIt seems like if you want to appear as a as a liberal and society you either have to believe everything on the table or you're out you're out of the group\nAnd there's so much going on but I feel like I Can't speak up because you're just asking for people to come after you did you grow up in a in a family that talked a lot about politics\nOr we talked a lot about politics [laughter] I was fortunate that my whole family lives nearby we would go to my grandma's house every Sunday and you know kids who go play but I like to sit and listen to you know my parents and my aunts and uncles talk and it was generally about you know politics social issues we were always encouraged to\nVoice our thoughts and growing up in Minnesota which is pretty ... pretty democratic that's what I grew up hearing [noise]\nAs you started to develop your own political identity and how did that take shape short it was after\nThe twenty sixteen election I felt man I Need to get more involved and that's what led me to working and immigration because I saw all these families who were being deported and it broke my heart and I I got a great opportunity to help a lot of people but\nEverything that I had been hearing about ice and conservatives in the news is there these these evil people who don't care about these families and they don't want\nPeople coming to our country and\nAnd some of the most and lightning moments I had were when I did work with I Want to go pay bond or go down to the government center and what I saw is and it sounds kind of silly now saying out loud but they're not evil people there people who are looking at the same problem as me\nAnd believing that there is another solution that there is a different solution [noise]\nSo I guess it it gave me a lot more compassion towards the right that I hadn't had before in my personal development yes I still feel like I have my roots and liberalism but\nI I feel like we should be listening to each other a little bit more because I I had thought before that I had been listening and I I found out that I hadn't been\n[noise] I understand you also watched the Supreme Court nomination hearing of Brett Kavanaugh really closely I didn't how did those\nHow did those hearings shape how you're thinking about politics or the election\nIt's an issue that hits very close to home I have personally experienced sexual assault um people in my life were very close to me has been raped so it's it's not something that I take lightly whatsoever [noise] um I\nBelieve doctor for it and I I ... I Believe that she experienced what she says she experience but I don't know that I Believe that it was Kevin not and I there was just not quite enough\nEvidence brought forward for me to fully believe that yes this man committed this crime so I don't know who to believe but I don't think that we should put this guilt on someone when we we just don't\nKnow [noise] so how how does that affect how you vote\nIt's made me uncertain I think the way that the liberal party at least from what I've seen in the media has been handling it with you know chasing after people in in restaurants and yelling at people and and\nMedia has been handling it with you know chasing after people and in restaurants and yelling at people and and it just seems like a lot of\nBullying and and I guess some people would disagree with me and said that it's no that's activism but I think\nWith everybody just yelling at each other we're not really getting anywhere you don't think the right has participated in that same vilification of the other side\nI think they have I I think they're equal problems on both sides because you hear the right calling the left snowflake said and you know they're just whining about these issues and and I I think it comes from both sides but I haven't personally seen it on the left like this up until this past year\nWhat do you think about President Trump I'm not a fan I voted for if I ever Clinton I I don't like Trump I think you know going back to the cabinet questions I think what he said about Dr Ford was horrendous\nI guess I I don't feel like I'm afraid of him as much as the liberal party feels like they're afraid of him and not afraid just angers I guess I feel I feel more passive because I'm tired of it\nSo you are still considering you're towards this but what I hear you saying is that you would perhaps vote for Republicans for the first time\nDespite President Trump correct and because it's more than that it's I Would rather look at things issue by issue and decide based on that rather than based on\nStrictly party lines and in rather than going out and filling out all of that democratic check boxes I I Want to feel like I've done my due diligence in at least gone through and and considered the other side so yes I Would consider voting for a Republican and upcoming election [noise]\nHave you talk to your family about your about your evolution\nI has [laughter] then avoiding it you know prior to this conversation I decided well I'm yeah I suppose I should let them know before they hear it on the radio\nAnd I I don't think that they would ever think less of me they're very very accepting people although they might hear me say things and go why would you say that so I just\nIt's it's taken me some time because I'm Still trying to work it out myself so [noise] I'll do my research and whoever I think is best for the job then you know that's where I'll put my check mark and that's where all focus my optimism\nAlexa grooming thank you so much for talking with us I think you ...\nAnd\nThis is NPR News\nHow cities have become the new front line for integrating displays population around the world\nEvery two seconds the person's forced from their homes by fearing for I was at the same time the world is going to be Seventy five percent of the urban by twenty fifth\n\nActed and she was\nAt a remembered service he organized with other eighth graders at the community day school she called for action though did student Christina Greg\nThis hour man who disagree if they really\nThey have to check\nThe adults of the day school also wanted students to know where they were coming from history teacher jacking gold Blum says she told her class she felt helpless and scared that how many\nOf these cells honorable and they all raised their hands and that was it the floodgates open and they were all presenting the air you know what emotion they were going through and I think they had a hard time processing but I told them that's okay because adults are having a hard time\nPracticing [noise] one of her eighth grade students that she was concerned that the attack on the synagogue would soon be forgotten because mass shootings have become a regular part of life\nI didn't know what to say to her sometimes the teacher\nDoesn't know what to say but then I came back with you are the voices and you can make change or not to young Goldblum\nSays her job is to help her students understand religious identity and cycles of persecution\nHer students have a sense from justice they've been active and marches for refugee and immigrant rights she says they're now connecting those movements to their own Jewish history\nThey have felt very strongly about this because they know from studying the Holocaust how the doors are shut down on them\nAvi Baron Monroe is the head of the school she says well older students process their grief through learning and reflecting about anti Semitism some younger students were scared\nA lot of them were like I go there or my family goes where I Lived there last week and one child asked about um when I go back and my going to have to see the bullet holes Doris\nBarren Munro says she directs teachers to listen first and ask questions\nOne child asked about um when I go back and then going to have to see the bullet holes Doris\nBarren Munro says she directs teachers to listen first and ask questions before giving answers\nJust say what are you know about it and find out where they're coming from usually it's a much simpler place in the adult\nShe says teachers are not only helping students process tragedy there also teaching them that it's their job to make the world a better place\nIn the birds he could not them which is basically repair of the world so from a very young age we the families and the school share and partner in helping kids understand their place in the world their place in history and what that means\nDuring the school's remembrance service rabbi Jeffrey Myers who leads the tree of life congregation thanks students forgiving him strength he's enjoying them in a prayer of healing\nMe\nFor NPR News I'm Teri Schneider\nYeah yeah [noise]\n\nAnd this is NPR News\nThis is K. A. W. see eighty eight point nine of them and say hey do you see ... Oregon I'm chip strangely your tune to MORNING EDITION China is testing a new plan to make it easier for citizens to do business\nIt also helps them trust each other more it's called the social credit score\nHuman community library offers a Halloween spook jak you learn that this evening from three to six forty five PM at the wealth in library for more information you can contact gay WC [noise]\nBurn Notice up next thanks for listening to pay double UC [noise]\nThis is burned out [noise]\n\nLet's assume for a moment that you have a yard that impair Robbins has ness didn't for twelve years [noise]\nYou may be surprised to learn that it hasn't always been the same pair mortality rate is high and are familiar songbirds for robins it's around fifty percent each year once young birds have pledged\nFor Robin survived to mid winter it lives an average at one point seven years after that the oldest Robbins in your yard might be about six years old\nAlthough one banded bird lived almost fourteen years so when a dozen years you've probably had at least a half dozen Robbins and each sex involved in nesting\n\nRobbins and most other migratory birds don't maintain their pair bonds over winter so they made a new each spring [noise] but at the same male and female returned to the same territory they're very likely to mate again\nIf the male has died another male will likely take over territory and the living female mate with him\nSimilarly to female has died a new female will mate with a resident mail [noise] they may not asking the same shrub if it's a favorable nesting spot and to our eyes it looks as if the same pair of Robbins has returned to [noise]\n\nTo learn more come to burn no dot org support for ... comes from the Puerto wrenches tourism bureau\n[noise] to learn more\nCome to burn dot org support for bird and out comes from the Puerto rent just tourism bureau insulin February's whooping crane festival and hundreds of species of birds to see year round and visit port Iran's is dot com\n\nSupport for NPR comes from the states and from the little market offering artisan made goods and home decor with a commitment to fair trade a nonprofit founded by women to empower female artisan in marginalized communities around the world more at the little market dot com\nFrom the John de ... Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information alright max found dot org and from Americans for the ...\nThis is MORNING EDITION on K. A. W. see this election season city of ... residents will vote on a classic election date issue the condition of city streets and roads proposition for one one would raise the city's sales tax by one half of one percent beginning in January [noise]\nK. A. W. sees Lou gum spoke with Jeffrey polston an accountant and member of citizen initiative for one one\nPosted in work with other human residents to help get the issue on the ballot\nSo the only people that can vote on this or actually those who are registered voters within the city limits of you mom\nIt's a house in sales tax that will go into it designated reserve fund that can only be used to fix our current roads\nAnd so it can be swept to you know buy a new fire truck or anything along those lines is dead and finds that can only be utilize\nThat is all about which is a fix repair our current roads and that's the most important thing and it's an asset of sales tax and that will be charged anybody that buys goods within the city limits of of humor\nAnd for example that that the economic implications that is if you go spend ten dollars and buy something at a local store for ten dollars within the city of you mom caution astronomical\nWe need the money to keep our roads from falling apart if this does not pass I've been told by a city by the city I'm a that our roads will be in such disrepair that will never recover from it\nIf there are a lot of people who are very dissatisfied already with the state of humans roads [noise]\nAnd I'm One of my I own a business off of Catalina kennel in Arizona avenue and that I I feel like I'm playing dodge balls with the bottles um my good friend back in ... I'm Talking about having to replace three tires and about a twelve month period\nOr the damage to their cars and and the key things to this is is that you either pay the sales tax unless six arose and controlling our own destiny or you're going to be paying all the auto dealerships and the McCann local mechanics to fix your cars\nNot to mention and my fear is you can only six a car but what about the accident where somebody is um gets for because of a pothole it gets out on an accident and loss of life that's what my concern is\nAnd he was a growing city to looking ahead roads are only more important\nAnd and and those people are coming to look at you ma to bring Congress her looking and saying these roads are terrible we don't want to invest our company into this community I put one winds of invite people over your house to\nSaying these roads are terrible we don't want to invest our company into this community\nI put one in the lines of you invite people over your house to have you know dinner and you don't clean the house talk a little bit about the the citizen involvement level of this particular proposition this all started about six months ago there was about eight of us who are out to sit in and talk about\nWays that the city of of humor because increases revenue stream and we were told there were several issues that are underfunded and the key when that came up was about the lack of money available to fix our roads and only reason I'm involved in this is because it's a segregated designate your funds\nThat can only be used to fix or roads had to be clear it's not that's not because you said that it's actually word it that way it is worried that way that's correct we worked on that language a long time had an attorney looked at it make sure that it was correct and for the best interest of the city of Yuma and as residents", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Yuma", "day": "31"}