{"month": "10", "state": "FL", "station": "WJCT", "content": "Is Edward Blum really trying to help the Asian American community in your estimation your reporting or is he really using this as a as a pawn if you will in a broader strategy\nI'm a I guess I Would hesitate to say he's using them as upon because a lot of the activists were already organizing like they were already organizing around issues of college admissions and\nYou know there is precedent for elite institutions like Harvard or you know tweaking admissions plans when it comes to Asian Americans in the eighties and nineties or a series of cases that the D O G looked into\nSo it's not beyond question and I think bloom is tapping into this sense of paranoia he's giving a sort of larger narrative shape to a lot of the activism those already existing\nWhether or not he actually cares I Can't really say but I think there's a real I'm sort of synchronous in these interests that benefits both sides\nAnd the Harvard says that getting rid of race would overwhelm English benefit white students is their aid argument here for other things like looking at class which is often come up in affirmative action\nDebates absolutely you know I think that to me these are not either or right we should be able to think about underrepresented minority groups because of the history of racial exclusion in the United states\nBut we also need to do a lot better I'm In college admissions in class diversity you know these ah universities are predominantly serving well to do families\nYou know admission to these places is higher than median household income in this country and while many students are on financial aid\nAnd over a representation of fans who are not a fan of financial aid so absolutely we need to do a lot more about class but I don't think that this has to be an either or question\nWell I'm curious your reporting focused on Chinese uh immigrant community and I'm Wondering we often use these terms Asian American you know is it cetera to to really um lumped together very distinct groups of people\nDo you think that this case is revealing anything about the limits of how we define quote unquote Asian Americans in the United states\nThat's a great question and I think we're starting to see some of that fracture because even within the\nChinese American population or spend a lot of time with there's a lot of differences in how they see the world and and sort of how I see the world how my parents all the world so I think a lot of it has to do with where you're getting your information or sort of what your social network is literally but also on line\nA lot of those folks I talked to decide completely different inflection point in their political awakening than someone my age or or someone who had been a culture it in the United states\nAnd we're going to assume that we're a little older than some of the college students right we don't have to be specific to your include we don't have to be specific there I'm twenty two\nAnd it has a curious if you can tell us a little bit about Harvard personality reading um because that seems to be something that also factors into this and could negatively impact that an Asian American students\nYeah so I looked at these other parts of the economists and there does seem to be a small penalty for Asian Americans on the personality rating so they do that um the plaintiffs economist\nDoes this analysis where he controls for all of these other factors and then shows that on balance age markets have a slightly and it's uh it's pretty small but do have a slightly lower on average um personality reading that personality rating on is a kind of subjective measure it's supposed to include things like ... you know overcoming hardship\nThat sort of perseverance these kinds of qualities and you know I I think that it's possible that there is some kind of input\nRacial bias at play here you know it's hard to we know from the research on implicit racial bias that that that image visualize these towards minority groups are pretty widespread in this country and you know there's no reason to think that admissions officers would be different but there might be something at play here about stereotypes about Asian Americans I'm willing to um\nUh to believe that that that might be the case I think we don't have enough information to know it is\nBut it seems to play a pretty small\nRole in the overall decision making when you look at a call kitchen\nWell we've got about thirty seconds left but I'm just curious did the students that you interviewed were they concerned at all about this impact how this might impact other ethnic and racial diversity at Harvard or not\nParticularly among the Asian American students although I didn't speak to as many um\nBut I Do think it brings to mind one of the problems with this debate which is that it's about this principle diversity which was never the original impulse for production right it was about desegregation it was about the right to go to school at all and the fact that it's been a window down to this conversation about sort of what the diversity policy of Harvard University is\nIt's sort of sad when you think about how and vicious affirmative action was once as a sort of a philosophical approach to improving Americans cheating America\nThe Tasha worry go is an associate professor of education at Harvard University and why she was a staff writer for the New Yorker thanks to you both thanks for having me\n\nAnd a lot of you have thoughts on college admissions\nMeal card West Palm Beach Florida I Would eliminate ... also made the process of blind assessment due to bias against certain races on a group of children who fall into those groups have a higher hurdle clear to get a permit to\nMy safety and I'm from the greater New York city area\nI think for college admissions process is definitely is very very unfair several changes need to happen first you need to get rid of preferences for legacy asked me\nAnd hit a VIPs and donor typing\nThe current affirmative action then needs reform\nJoshua brothers holiday Utah the college admissions process\nIs fair but we've got to remember that these institutions are businesses first and what affiliate done is unfairly propped up secondary education is the gatekeepers of our society and I don't fairly diminishes the value of technical schools apprenticeships and other forms of learning extended the length of public education to a point\nWhere citizens are forced to pay to play the swapping McCoy from Castro Valley California\nMy child had college admissions counselor she's a smart\nKid got good grades have had an excellent ac Peace Corps but I still feel that not everyone has the opportunity she had and that for a kid who like me was pouring in good parental support it wouldn't be much harder to get into college especially now\nOne of my favorite parts of the show and everyone calls and says thank you for your comments you can always find us on Facebook and leave a comment there or if you miss something and want to listen back again you can check out our podcast thanks so much for being with us today I'm tending to Vegas and this is the take away the tomorrow [noise]\nSupport for the takeaway comes from battle I Europe handmade language learning program\nBabble teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at ... a B B. E. L. dot com [noise]\n\nEighty nine nine W. J. C. T. thanks to following business partners for their generous support Jenkins quality barbecue genes eco gr PA Florida Capitol bank for more information contact Ana Marie Stanford at three five eight six three nine zero\nMany places in downtown Jacksonville being considered for demolition or redevelopment have had their history last\nHow can we bring you stories back to life while determining a future for these sites W. J. C. T. and partnership with modern cities present\nThe Jackson forgotten space Tuesday October twenty third at W. J. C. P. studios the evening begins with a reception at six followed by a panel discussion at six thirty artist VP with is free events at W. J. C. T. dot org slash about sponsored in Port downtown some\nWG ACTs jaguars season parking is still available\nTo the heart of the coolest tailgating downtown\nIncludes pay an indoor bathroom access contact holy men\nThree five eight six three one\nOr log on to WDC dot org slash for\nReserves doors face today [noise]\nShe's eighty nine nine and a huge ACT Jacksonville your community your world patchy fog overnight low around Seventy three continued sunny and hot Tuesday highs and the upper eighties too low nineties\nMarker woman edits the world [noise]\nIs this confusing music from the TV cause like Miami was put on steel pen drums from Trinidad played by a group from Germany bandleader can explain\n... of the eighties some but fame just talk and was played a techno pop over here in Europe so it's actually a dance truck over here also today\nI ... on the Arctic Circle my voice sounds really strange right now because I Am looking into an enormous Wall Street [noise]\nWhy is there a giant ball of concrete on the Arctic Circle you're going to find out today on the world\nHas never actually happened in the middle east and I would challenge anyone to come up with an example maybe you'd have to go back you know three quarters of a century or something but even there might be difficult\nShow you how many senior fellow at the Brookings Institution thank you so much good to talk my pleasure thanks for having me\n...\nAnd I'm\nA big election yesterday and the German state of Bavaria things did not go well for German Chancellor Angela Merkel and her already strained coalition Merkel's party of the Christian Democrats as a sister party in Bavaria the Christian social union and that party lost its long held absolute majority in Bavaria yesterday\nAnother ally the Social Democrats also fared badly the big winners the center left Green Party and the far right AFDC the alternative for Germany party Melissa Eddie is the Berlin cars\nThen for the New York times I think what we're seeing here is that migration itself remains a really hot button issue on the one hand you have the far right that has pushed back against the migration issue\nBut at the same time that has galvanized I wouldn't say the far left but the central laughed a lot of voters who feel they want their country to be open they want their borders to be open they want a dynamic pluralistic society and they are starting to push back against the far right\nSophie ... a little on on that push back because I'm a support for Merkel drained away to the greens are in Bavaria but also some votes went to the day but they're also previously undecided voters or people in twenty Thirteen who didn't vote who wound up supporting both the AFC immigrants so\nToday do the greens on the left have more support than the AFC on the road\nThe greens are are making a stronger come back and the interesting thing is is the greens were originally themselves a fringe party that grew out of the environmental movement of the late seventies and eighties and\nOnly came into power at the federal level in Berlin and in the Nineteen nineties so it's been very interesting to see them sort of move into this vacuum\nIf you will in the center that as being left by the collapse of support for the main centrist parties which is Merkel's party and then the Social Democrats\n[noise] so what does the Green Party doing right because they walked away with more than doubled their results in Bavaria than in the last election\nWell the Green Party tends to be very strong in urban centers or you know climate change is a really big concern for a lot of German here it has been for many many years and so the Green Party that has been there a key issue a since their existence and I think that\nHas helped them out the greens have also always banned for the idea of a very multicultural pluralistic society and\nYou know the the history of what the Nazis did in this country what the right is capable of has\nAlways been very strongly in the minds of many Germans and the greens have just been able to capitalize on that idea of we do not ever want to go back to a dominant the far right we have seen in the past century where that will lead us\nSo just tell us a little bit more about the Green Party like how big are they and how president are they in German politics right now and should we expect to be hearing more about them in the future\nRight now they've been polling as the second strongest party interestingly enough at the national level and that certainly wasn't the case last year and the election they really struggled to get in so I think they benefited very much in the past year from the entrance of the AFC into opposition\nUh by sort of insisting they don't want to lead the opposition over to the far right and people have rallied around that idea\nMost uh ... what does this mean for ankle America because after the federal elections last year a winner coalition fail to get a strong majority in the program and a lot of people said this was the end of the road for Merkel at least the beginning of the end of the road so after this regional upset and Bavaria how much further does is take us down toward the end of the road for Merkel\nWell that's really the central question to come out of this election we're going to be looking to the state election in ... which is coming up in two weeks' time where her party holds the governorship and if\nThey are to lose that it could really make things difficult for her in December when her party goes to vote for a new leader\nWhat was the editor of the New York times correspondent in Berlin thanks very much for your time thank you\nGermany's complex politics make me think of a German artist an artist who's got a complex relationship with another country's music\nViewing Wagner leader the Hamburg based but count rhythm and steal banned\nThe music he loves steel pan from Trinidad we're going to hear an example ... complex musical mind but first I Want you to imagine Don Johnson and pastel our money watching the waves roll into Biscayne Bay yeah this is ... take on the music ... road for the classic Nineteen eighties cop show Miami Vice\n[noise]\nOld German man things upon\nGerman men playing steel pen in Hamburg and I gotta say environmentally musically hamburgers not really the kind of place where you would find much reason to hear steel pen music or any reference to Miami Vice so when it comes to a cover of the Miami Vice on steel and my question simply is why\nI ... I can tell you I mean I'm I'm a kid of the of the eighties but fame just stuck with play that techno parties or cost me parties over here in Europe so it's actually part of a dance track over here I'm just didn't get it off my head [noise]\nCovering old phone console and hip hop is kind of the currency of a book how rhythm and steal band or I Know you lived in Trinidad for a while so that must have been pretty influential on your music when was that in why were you there\nUh totally yeah that was a long time ago that was I think right after September eleventh I was in my early twenties twenty five of the time I had a friend who was early on a ... a pound movement and he built man is tremendous and he showed me the first steps [noise]\nTell me about the cover of the Lenny Hitler tune 'cause that Texas right into the caravan doesn't it\nThe survivor phones probably close to a ... uh I just played in the uh for kicks and then I said to myself while that\nLets them but just [noise]\n\n\nSo what is it like to tour with a book out with them and feel bad I mean is it or is it hard to do the uh the load in with the steel pan drums\nUm we don't to over ... for several reasons one of the Lowden maybe and I'm real is left um we do a lot of over ... because we are free instruments and maybe three players don't they also play over and when it's like to play guitar lessons Texas one of those who plays\nOn the record hum hum so we have done a couple of shows just special like TVs all a wall so [noise] but we don't want to do a proper truck or test or two over the logic [noise]\nDuring the ... the leader of the coal rhythm and still banned their new album is called the surface mouth thanks very much for being with us thank\nThe Brexit talks hit a roadblock on the Irish border that's ahead from World\nThe world is supported by al ... hated to helping entrepreneurs freelancers by offering business thing that is designed to be accessible and straightforward with building in voicing mobile deposits in online account set up to learn more at age the L. O. dot com\nAnd fight babble a European made language learning program ... teaches practical conversation is Spanish French and German and other languages available in the app store or online at ... a BBC L.\nDot com\nPresident Trump says he's spoken with Saudi Arabia's king sell them on about missing journalist Yamanaka showed the\nFor the world is watching the world is very important to get to the bottom of it\nI think he understands that very well what\nCould the incident mean for us Saudi relations on the next MORNING EDITION from NPR News tomorrow morning starting at five and\nThe nine nine W. J. C. T. your community your world\nThe Cold War is over but the Cold War is just getting started this is the most significant breach of federal networks in us history North Korea China or Iran and Russia have all come after the\nUs [noise] former assistant attorney general John Harlan explains why everything we rely on is a potential target [noise] next time on one of the\nWeekdays at eleven on eighty nine nine W. J. C. C. [noise]\nThe European Council president Donald to cause told you leaders it is more likely than ever before the Britain will leave the EU next march with how to deal writing to them before if someone's in Wednesday he sat preparing for new deal must not lead them away from making every effort to reach the best agreement possible\nIn a major split in Christianity the Russian Orthodox church says it's breaking off all relations with the Constantinople patriarch hit the ball into the wheels authority over the world three hundred million orthodox Christians\nIt's in protest against the patriarchs decision to recognize the Ukrainian Orthodox church as independent from Moscow\nKenyan officials are counting on to review of primary school textbooks off criticism that some of the content to some suitable for children one of the books appeared to celebrate the ... lifestyle fictional politician who had his own helicopter\nThe Nigerian authorities say at least six two people are known to have died in a fire in front of the on an oil pipeline and the southeast of the country shortly after the incident the state owned company said sixteen people had died as they try to to pump the oil we should think caught fire and engulf them\nSlush funds in southwest from ... left at least eleven people dead with one person reported missing flooding around the city of ... left to try and live overturned cars damage Ruth\nOn cannot tones and that's the summary from BBC News\nMore for the world comes from babble European made language learning program babble teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nA marker woman and you're with the world we're co production of the b._b._c. World Service P. R. I. N. W. GBH here in Boston long before he became president Donald Trump wrote in a tweet in which he called climate change a hoax now in an interview with sixty minutes he's reversed himself\nPresident Trump told the CBS program yesterday that he does not believe climate change is a hoax\nBut he also says he's not sure if climate change is manmade\nLook I think something's happening something's changing and it'll change back again I don't think it's a hoax I think there's probably a difference but I don't know that it's manmade I Will say this um\nI don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put in a disadvantage\nSo the president told sixty minutes we're going to fact check some of what he said and for that I'm joined by the world's environment reporter Carolyn Beeler Hi Carolyn hey markup [noise] so let's start with this moment\nLook I think something's happening something's changing and it'll change back again\nHeroine will the climate change back again\nSo Trump there seems to be talking about the natural cycle of earth warming and cooling on this has happened in the past that's why we've had ice ages and glacial retreat\nBut humans in the past century or so have pumped so much carbon dioxide into the atmosphere that we are now literally off the charts when we look at and natural variation and we're not going to go back to the way it was anytime that's relevant on a human timescale\nAll right here's another Trump statement\nI don't think it's a hoax I think there's probably a difference but I don't know that it's manmade\nOr we know there is a strong scientific consensus that climate change is in fact Mamet wrote\nThere is even among Trump's own scientific and the and this is what a NASA website has to say I'm quoting here the current warming trend is a particular significance because most of it is extremely likely to be the result of human activity since the mid twentieth century\nRight greater than Ninety five percent likelihood of by the way and finally this argument from Trump about acting on climate change causing us lots of money\nI Will say this um\nI don't want to give trillions and trillions of dollars I don't want to lose millions and millions of jobs I don't want to be put at a disadvantage\nRight and that's a common argument from politicians pivoting away from fossil fuels would cost a lot stronger false\nWell there are a couple of different ways that people poke some big holes in this argument\nThe first is looking at the cost of changing our economy versus the cost of inaction and many studies have shown that there will be a significant drop in global GDP if we don't do anything to combat climate change because of a loss of productivity increased storm damage et cetera\nAnd that is true specifically for the U.S as well as globally another thing to look at is jobs it's true that with any structural shift in the economy there will be winners and losers think about folks who lost their jobs and factory that automation has risen\nBut there's also the argument to be made that there are a lot of job opportunities that come with shifting toward a green economy and right now there are about two and a half times the number of people working in the solar industry here in the U. S. I there are in the coal industry\nGrowth Carolyn Beeler effects well You're welcome back into\nThe Arctic is feeling the effects of climate change faster than anywhere else we're going to be looking at those changes and the people living through them we'll get help from our partners at the threshold podcast\nHost Amy Martin will be sharing tales from her travels in that region over the last year here's a very basic question what is the Arctic or more specifically what's the Arctic Circle\nAmy found out that the answer is not so simple\nI'm On the island of ... of the northern coast of Iceland standing in front of the huge concrete ball it's nine feet in diameter and it has a great pockmarked sort of lunar looking service and a big hole in the center that the wind is blowing through\nI'm standing on the Arctic Circle my voice sounds really strange right now because I Am looking into in Norman wall during\nThis fear is wonderfully weird it feels like I might have found a stone from from the slingshot mythological Nordic giant it's called orbits and global that Latin for circles fear it was placed here to mark this line we've drawn around the top of the world called the Arctic Circle\nSo it helps answer one fundamental question what is the Arctic there's a seemingly simple answer everything north of here but\nThere's a twist we put the flying on our maps in Globes as a fixed permanent thing but the sculpture was designed to move\nWhy is there a giant will result in circles and why ... every year to stay on the Arctic Circle [noise]\nOne of the most fascinating things about the Arctic is the way it's scrambles our relationship with light\nIf you're north of the Arctic Circle in the summer solstice the sun never sets on the winter solstice it doesn't come up at all\nThis is why the Arctic Circle is where it is it's supposed to mark this region where there's twenty four hours of light for at least one day each summer and twenty four hours of darkness for at least one day each winter all across the Arctic their signs marking this line little spots for tourists to get their\nPictures taken maybe buy souvenirs and that's the way it's always been on the island to until these two guys got involved\nAnd I'm Steve Chrysler and I'm an architect\nBut I'm ... and I don't know just\nHow did you say you're laughing corruption UC\nChristian and Steve both live in Reykjavik Iceland capital in twenty Thirteen they heard about a competition to make a public art piece marking the Arctic Circle on currency and as Christian looked into it he got intrigued by one small detail about the project\n... a crush on smaller numbers that the Arctic Circle is moving forward to ... meters a year on the phone was rather strange show out of all let ...\nHis research led him to the third character in this story\n... ...\n... is an astronomer he's retired now but he used to work at the University of Iceland\nOr too much pressure to use the effect of sun on youth\nAnd he told them it was true the Arctic Circle is moving and that's because the axis of the earth is moving slowly racking up and down between twenty to twenty four and a half degrees foreseen says this movement happens in a predictable cycle\n... forty thousand years ... years and years and one grocery store and you can use for\nIt's called ... and it changes the amount of the planet that goes into total darkness in total daylight every year when the earth's axis gets closer to straight up and down the Arctic Circle shrinks when it gets more tilted the circle spreads out\nRight now we're somewhere in the middle of that cycle heading closer to straight up and down so the Arctic Circle is moving north and for Iceland this means that it's slowly slipping away grooms he is currently the only habitable spot in the country touched by the Arctic Circle\nAnd not so drawn tourists here for decades as the Chrysler describes\nWhat they did his you know just when you arrived in the plane is that it was assigned the maid of honor minimum un thoughts were so they all of the tourists will there ever been to go walk around the science gives them a certificate and send them back home again\nIn twenty Thirteen the local government decided this simple Arctic Circle marker was due for an upgrade so they launched a competition and like Christian said earlier the information they put out said that the Arctic Circle is moving fourteen centimeters a year\nBut stores team told them it was actually moving a whole lot more than that an average of fourteen meters a year in the spot and at that rate the Arctic Circle only touch currency for a few more decades", "year": "2018", "show_name": "PRI's The World", "city": "Jacksonville", "day": "15"}