{"month": "10", "state": "MS", "station": "WURC", "content": "Boy\nAnd one do you oh\nYou judging\n\nYou're listening to your face some that truly cares Wu artist the ADA point\n... FM hot springs raw scarlet support for this program comes from the id will Barnett museum a cultural center of African American history featuring African and African American exhibit genetic theater and community program in Holly springs at two twenty\nNorth Randolph Street six\nFor getting an African American exhibits dramatic theater at community program in Holly springs and two twenty north Randall street six six two to five to three two three two out of me will Barnett museum preserving our cultural heritage [noise]\n\nThey go away and we\n\n\nNo one knew oh nothing\nDo they\n\n\nKnow\nThey were\n\nThough may you\n\nKnow I'm kinda young I got a ...\nAlmost ... don't worry [noise]\nMuch appreciate you [noise] which were my baby to be you know you make it better [noise] ...\nYou make your men\nWaking up\n\nYou make it you know I didn't mean with the man\nNo\n\nMm\n[noise]\n[noise]\n[noise] [noise]\nAnd this way\nAnd\n\nThen we didn't have\nEvidence that you know [noise]\nUm [noise] and yeah and\nBe\nA move to misnamed\nAnd you can you can do many many\nGod\n\n[noise]\n\n[noise] [noise]\n[noise]\nShe'll\n\nI was able\nNo the Boston Boston my way to great all up to do what was the last time you know what you think about making you\nIf they last the ... down to take the flu could you know\nThe decree though you know\nWhen they do but you know\n\n\nI Want to get just don't remember but\nAnd I think there might be the world because everybody needs something\nMore\n\nThe\n\nWhoa\n[noise]\nIt is do ... do you want to be maybe you wanna do that from the party's spring [noise]\n\n\nThis program are sponsored in part by cutting shale gas stations six Twenty one highway seven south Holly springs cousins shell has four different locations offering auto washing polishing\nBeverages hot deli and frozen delicacies six six to too far to two five eight six or email cousin L. L. C. at ... dot com\nDelaying shortstop provide support for this program Elaine shortstop two Ninety five no what the ... street Holly springs across from the rest college campus Serbian Russ college students and Holly springs community\nHealing shortstop open twenty four seven the hot food delicacy and cold drinks in a fast and friendly environment at Elaine's shortstop you may also build up your gas tank while you shop six six two to five to three six six zero\nHello this is Brian Sallee Dina ... services that Russ college are you interested in the continuing your education considerate of college for your educational needs for more information on attending Russ college contract me it ... says two to five to eight thousand stitching for zero five nine\nOr visit us online at W. W. W. dot rush college dot edu rush college for tomorrow's leaders are students today [noise]\nYou made me\nDo\nHow\n\n\nAnd\nOn\n\nYou know\n[noise]\n[noise] [noise]\n\n\n[noise] I Can't\nI Can't\n\n\nBe a real [noise]\nKnow I'm\nDo\n\nDa da da\n\nSure you'll call\nAnd\nWe don't na\n\n\n[noise]\nNo no no\n[noise] [noise]\n[noise]\n[noise] ... ...\n\nKnow [noise]\n\n\n\n[noise]\n\nMe [noise]\n\n[noise]\n\nReally [noise]\n", "year": "2018", "show_name": "Putumayo World Music Hour", "city": "Holly Springs", "day": "28"}