{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. V. S. national I. eighty eight point three\nW. E. V. H. Hanover Ninety One point three\nW. E. D. in teen Ninety point seven WABC Gore on the one in seven point one\nW E v J Jackson Ninety nine point\nFive W. E. V. S. called brook Ninety point three\nAnd W. E. D. cute little ten Ninety One point nine an online at an H. P. R. dot org\n[noise]\nFrom American media [noise]\n\n[laughter]\nHere in the ... theater in Saint Paul Minnesota\nDealing with musical director Mike Elizondo and ... year old John Irvin and [noise]\nWe have a fantastic house\nPlan for you tonight David Palmer on keys Brittany halls on federal Chris Albert John ... Lawrence junior on the drawing ...\nI guess in Idaho man why do we have a show for a comedian again last saw\nGabriel campaign [noise]\nAnd the war and the treaty\nRide from your support by carbon night offering secure data\nProtection solutions for businesses including automatic ... servers in advance and point protection high ability and disaster recovery solutions an automated data migration learn more carbon I dot com knees\nAnd buy their\nEmployee owned in independent\nBarrett has kept clients financial interests merge\nW. dot com has more information\nAnd by Sierra Nevada Brewing Company standing up for independent voices and beer since\nNineteen eighty [noise]\nShe would you want to see what's happening here on stage tonight you can watch video at life from here dot org\nHere is produced by American\nPublic media [noise]\nAnd the whole way there I Hope you've had a nice week my wife and three year old or out of the country so I had the house to myself for the last few days to that not used to that and I can tell you it's been it's been a sonic ally jarring experience\nUh I've worked closely with the live from here sound design team to to ah recreated for you and your your queued up their Jason okay here we go this is what it sounds like in my home right now\n\n\nIs this hour and a toddler Les Mis [noise]\nPretty amazing\nFor about Fifteen minutes at which point it turns into abject lonesome ness\n\nI spent most of the week looking out\nAt the river feeling like quarter damning when he wrote in a city here I'm\nKnown the banks do there is um\nThe lonesome waiting\nRooms trying\nNot here who\nWill\nAllow varying the darn\nHere\n\nNo longer rose\nI also remember didn't die [noise]\nYeah I'm sure\nYou Green Bay to\n\nBuild a bomb or no\nShe means is mommy\nAnd don't want to\n\nVote keeps me busy I\nWish to no one to the\n\nKeys me do\nI\nKnow I guess the main difference between me and a\nQuarter Stanley\nIs good I don't think he was on the banks of the East River in Brooklyn when he wrote that song and and also I'm pretty sure my wife is coming back [noise]\nAlso I've known that at the end of my we can get to see what people like evil Donovan and Chris so rich [noise]\nAnd if you if you're up for it there\nIs no cure for long enough like singing with people you love except maybe also singing with strangers when's the last time you did that was what can we can we do now to be up for doing it now what's up with something we all know I mean hard times we all know how hard times ... says\n\nLet us ... sin lives pleasures hand\n... men need to well\nWe um so so\nWhen the ... there's\nJust so bad but the thing is for ... years\nOr hard times come\nAgain though is the ...\n\nYou do we\nHow times\nCome can no more men\nMe days you have many good I'm Ross\nDoor\nOr hard\nAgain no oh\n\nWow we see the beauty and use\nTheir fame needs to be able to\nDo\nWith all this\nActually was very\n\nThe\nUm [noise]\n\n\nThe\nSeason\n\nOh\nSounds like a him doesn't it\nCertainly feels like a him to me just a pop star no ... I mean it's a really really really good pop songs from Eighteen fifty four but it's not a [noise]\nSpiritual songs strictly speaking isn't it amazing though how any piece of music can become a him if we sing it together\nThis week's new song is they ... him to all of those non him out their purse if you will [noise] spelled like murder only with an H don't you think it's funny on paper I promised [noise]\nI don't want to send the song out to all you lay men and women who have the urge to harmonize and to address voices to the choir without drowning out your fellow singers it's a pleasure to be with you this evening to make some music\n\nOh\n[noise] but no longer shall we say in\nThe U.S [noise]\nBut then was should we seen no\nHas we gather\nGlow in the dark Cassie he'll breathing\n[noise]\nWe spoke [noise] let's not go them turn [noise]\nLet's see what I'm doing\nThe blood through this whole ... good attorney\n[noise]\n[noise] [noise] Mm [noise] [noise]\n... the the satellite phone [noise]\nJake and come home [noise]\nJason do it all the soldiers flown\nBack to the [noise]\nThe shady Asian snake [noise]\nMaturity I'm a Jew creating all in the state\n[noise] three she had planned to let me give you a\nPain to treat\nThese huge you can follow him sales\nBoth his tales sand\nTo family\nBack to Baltimore\nThe tall law convenience store\nThe un's assuming the ambulance will\nHa no there is a no with it is not known ... any more but I\nHave to go who\nSome some well to do for [noise]\nMy family was broke\nWe became friends [noise] the parking lot that shooter field [noise]\nThat's it and the ... just because he was going in a ...\nFan for sending kids my mom would kill me to\nReally treat me under the\nLaw would be a good ... for the\nGreen and Blue Ridge planting trees and some guy in the pitch\nThis ah ... ... is is it that I'm going to be going\nBack to boats in\n\nThe ... the convenience store [noise] the in the food and the\nAh ... ah no I said you know with it is and I don't need any more but I have to go ...\n... ... got him too soon to sign\nUp to ... related to that now building serious show but next morning he died in the satellite phone with the cruise which made\nI'm thinking the town for much salt [noise]\nGood things that may be may QC L\nMom you know take a walk\nIn the neighborhood block\nAnd a ...\n[noise]\nIt's very real hand\n\nGo get your book or travel or [noise]\n[noise] [noise] yeah\nThey\nThe music to your pin that baggage nobody's accusing if you've been managing\nRip up the ticket because he didn't you just\nDon't want to begin to keep the route so bad so you'll be promoted to pin that bad you end up ... ban has been a little bit of some match\nThe woman and assemble the task\nNot so you've been at baggage band the ... the ... but you're saying so bad\nTo get a window on taxi cab but yeah\nLike I'm not I think you'll die\nLet's back today and they don't die\nKnow you don't get because\nWhat you lose\nThat hey look when they have a cup of judgment and\n[noise]\nYou're going to have been that bad\nBut if you've been that bad\nLiving in the middle of an angel\nThe bum you buy\nStock Julie in age to\nDoppler the game you know you don't get what you might lose ... being that hey look what may have come a day and not me yeah not not not by\nHave gotten a judgment day\n\n\nTime now for our local break which which is going to be some some votes for yeah I mean I Know what you think\nHoped that first record they made trace which you know it's kind of one of the things that the bill that that that all countries swell up to a fever or was recorded in Nineteen Ninety four in Northfield, Minnesota [noise]\nMinnesota town which as you may know if you've been listening to this show I might still be banned from\nMore on that never [noise]\n\nNa [noise]\n\nTo which you\n\nCan I can see you know I think the na\n... smooth churn the that the that\nHe'd be keep it didn't see the sitting down\nAnd I started walking back are traveling corresponded comedian Tom Papa in a second we caught up in America are you there Tom\nHere ... that was a beautiful song it was fun listening to it from inside this parking garage [noise]\nBut I'm ready to go on behalf of live from here I'm resuming my journey across the country sharing the good stories of our fellow Americans\nThis week I traveled to Buffalo New York along Lake Erie were the sky was cloaked in a constant gray missed allowing for just occasional peaks of the colorful leaves\nThe forecasts was calling for the first snow fall of the year but for the good people of buffalo that's not even cause to wear a long sleeve shirt when you live in Buffalo complaining about the weather is complaining about life itself\nI was picked up at the airport by a woman named Charlie she's been driving for twenty two years and our cat was filled with stuffed animals\nThey line the dashboard hung from the rear view mirror and the monkey was attached to the steering wheel these are my co pilot she said some people have Jesus I have these guys\nSupport for any PR it's live stream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you online at or cash Reno dot com\nCollege down in Arizona because they wanted to go to the hottest place I could find but it turns out I'm not built for the desert seems more like a place for lizards\nPeople who stay there too long start to look like a sponge that was left out in the sun\nShe came home after school and it's been in Buffalo ever since we have a lot of moisture here and I love it I'm like a plant water me and I grow when it's not\nRaining it's snowing and when it's not doing either we can count on them is from Niagara Falls are you here to see the falls have you ever lied your cab driver about seeing Niagara Falls because he didn't want her to know you planned your entire trip around eating buffalo wings [noise]\nTo drop me off downtown and I went out looking for a bar if you're looking for a bar or tavern buffalo is a good place to look save a lot of them and last call his four AM they say they're staying up to open later gives the snow plows time to clear your way home\nI entered what looked like one of the older bars in the city covered in lights and years of science coasters stuck to the walls to kind of place where it's always midnight the kind of place that so tired that even the ceiling seems to be hunched over at the end of the bar\nThe bartender was a big bear of a man named Chris he had a giant beard and big pause and then grab while he worked\nHe said that he's been in this bar for Thirty years and that he's been there so long he doesn't even smell they're famous buffalo wings any more people come in all the time and they say they smelled them all the way down the street but I don't smell a thing who knows maybe it's me they smell\nI eagerly place my water there's something great about eating food that makes a city famous\nIn addition to whatever natural elements are involved the water the air the ingredients there's also a pride and the love and his corneas it might sound the love the people add makes all the difference\nHave you ever been away from home for so long that you started professing your love for a plate of deep fried chicken wings\nI have\nChris had a big hartfield laugh his kids are grown in just him and his wife down the kids all moved away which means that his grandchildren are too far out of reach for his liking\nI don't understand what everybody's after I mean sure moving to another city you might get you a little more money but when you lose from being away from your family is too big of a cost\nEveryone complains about their parents until they shell out twenty dollars an hour for a babysitter and then suddenly we're not so bad\nHe keeps busy with his bowling league he said people like to knock bowling but it's a damn good game especially when you have your own shoes he pointed a wall of bowling trophies behind them that his team and one throughout the years their name is great falls a fire\nBut this year we're a little nervous we lost one of our guys to a heart attack and there's a young team called the kings that's been gunning for us but we refuse to lose to a team whose name isn't even a little funny it might be a different story if it was the lick any splits\nThe trophies was the fate of newspaper article featuring a high school football team there was a picture of Chris he was the cats\nThis was a different life it's all just a memory now he said just like this will be one day have you ever started to tear up about bartenders glory years only to realize it was just your eyes watering from a plate of piping hot buffalo wings\nAnd boy were they hide my lips were on fire tears were rolling down my cheeks I wasn't thinking clearly have you ever tried jak cool and in front of a bunch of locals until one of them pointed out that you were sweating from your bald spot [noise]\nI stumbled outside to get some air and the first snowflakes were starting to fall the first snow falls like a visit from your family who you're happy to see before they hang around too long and becomes difficult I looked up to the sky as a snowflake landed on my cheek and I brushed it off\nHave you ever forgot that you would wing sauce on your fingers touched your eyes and had to run into a bar to beg a giant bartender to throw beer in your face\n[noise] I have\nAnd that's why I'm not a local\nBut I'll return to buffalo just as soon as the snow melts and I buy some gloves until next time this has been Tom Papa out in America [noise]\nIt's supposed to come out on the road\nCity Missouri to trim and Peter on November first\nHey this is more in treating\nUh\nHere are already yeah\nI [noise]\nPounds in\nAnd so on and [noise]\nThe rescue they kept saying me also ask\nMuch more at live from here to work life from here is produced by American public media\nIt's live from here on N. H. P. R. and coming up at eight o'clock it's selected shorts support for an age PR comes from you our listeners and from flying monkey performance center presenting an evening of America with David Rhomberg band and loud and Wainwright the third on October twenty seven flying monkey on H. dot com\nAnd from St Joseph hospital now she was a member of carbon analysis specializing in breast health fan experience in partnering with women on their health needs to learn more had your guest U. N. H. dot org\nPartly cloudy tonight chance of showers and the overnight low temperatures and a load of mid thirties for tomorrow it'll be partly to mostly sunny breezy northern New Hampshire is a chance of rain or snow showers in the morning with high temperatures in the low to mid forties on Monday it'll be mostly sunny hot temperatures low to mid forties\nIt'll be mostly cloudy chance of showers on Tuesday with high temperatures mid forties to the lower fifties\nThis was on HBO or are\nThese other stations up New Hampshire public radio W. E. V. O. conquered eighty nine point one W. E. V. S. natural he points three W. E. D. H. had no the Ninety One point three W event keen Ninety point seven WABC ... one of seven point one\nW. E. D. J. Jackson Ninety nine point five W. E. B. S. coal Brooke Ninety point three and then he ... he little ten Ninety One point nine and online at any age PR dot org [noise]\n\nPeter in St Paul Minnesota Welcome back from from here with critics feeling just a reminder you can watch what's happening here and live on stage live from here dot org\n[noise] he was in an age\nYou must be the new Dr ... how'd you do find things started to be with you but the ear can get stressful you know I'm not going to live we're stretched pretty\nThin hadn't any jolt enough to be done there is an enemy son of yes whatever\nI'm Glad you're here anyway here is your patients list let me know so many things and see what we have here you are yeah I figure swallowed attorney you know you didn't look wet and it'll have you been getting enough exercise\nNot really recognized five minutes of time each morning\nIt's where you've done on the roof and click your heels overall sweeping a chimney I live in a basement wonderful then you can just pretend and I'd like you to stop eating coins and stopped taking these pills and remember a spoon a full lives should go\nOn during the better a spoonful of sugar will literally German [noise]\nNah but if you don't take your medicine I wouldn't have to tell your mother and father that you are a rather not have a little boy I'm forty students yes you are stuck there oh we have a severe hand lacerations possible nerve injury I\nHave any friends would ever come out\n\n\nWe have to stop the bleeding give me one hundred species of morphine driven to turn to get that right away\nBut just turn into a panic at the\nI supposed to talk about that\nReal quick to talk of calls and how what happened when you turn on your phone upside ya oh\nThat's\nWonderful we are going to have to amputate well\nLet's get her into surgery so perhaps one long way while you still\nMiss his past the bottles and crushed I think we've lost her nose and let's see what we have had\nNice to be the sheep but like I said well you know what I always say when I'm feeling sad and confused and I don't know what to do I have no idea the the\nTopic is\nHow does that help right\nNow but it's much more fun than thinking about dead sorry please let me see what I have here in my bag allowed some strobe recall Joel I'm Brett are typical uh yes irritated id super nice to have a clear\nHere she come [laughter]\nOh it was so strange I was moving toward a night and then I had one singing about birds and I knew\nTo come back to find out what the hell it up and says [noise]\nWell that's for next time we have changed my work is done what am I on the coal mine did that lady fly out the window with her on\nThe top and you know\nShe's not the best your doctor but she was perfectly practically perfect in every other way\nTells her if she bled out on the table before we can advocate Daniel [noise]\nIt's been a heck of a week for musicians birthday is starting with Kesha co Q. should call her birthday was this past Monday Kesha move from Oakland LA at Eighteen and\nPromptly ascended to R. and B. stardom on the strength of her stone and voice and songs like this\n\n\nI just think that\nAnd then you should think that I\nThe novel ways not\nSee\nWell you\nCan do that\nThey did what\nYou\n\n\nCheese in\nOh\nFleas fully celebrated his birthday on Tuesday we may know him as the head banging hand bloody getting basis the red hot chili peppers but let's not forget him as a hilariously ineffectual ... in the Big Lebowski\nThey've given us so much like ... and also this ridiculous baseline for [noise]\nYou got to get the ball up and you keep you you know you know when\nCome by you know jumping up and down by\nYour mode jewelry on the bottom of Cuban you'll know this brings me said\nMom is walking around you getting your\n[noise]\nAnd struggle Lawrence junior on the drone\nThe great Lauren Niro would've celebrated her Seventy first birthday on Thursday Lauren Niro her songs have been recorded by everyone from blood sweat and tears to Peter Paul Mary to Barbara Streisand to herself\nKnow I should clarify he's also not a pants guy [laughter] um where are your leaves our\nReally leave yes you\nKnow leaves like from trees you know he wears mostly fig but I think it could totally Rocco palm fronds\nYou don't know what kind of clothing store is the normal\nBut now we know huh I mean this weird isn't it I mean so like okay when customers coming around asking for leaves for their boyfriends birthday is like where do you send them to treat\nIt is the first time I've heard that you\nDid you see and I'm like a Yelp are\nLooking for your\nA serpent told me to eat an apple and I did and then my boyfriend and I looked at each other and we were like oh gee you're soup new huge\nAnd it felt weird though he started wearing a leave and I pretty much wore my hands over the important parts [noise]\nHe's pretty weird that you're ... yeah the mole is pretty ...\nWell that's\nGarment uh we've got these nice\nOutta the loon breathe for no fruit a sense of it for [noise] um I already wrecks the world was you know\nHim\nDang\nAnd back there on the piano Mr Gabriel ... [noise]\nBefore there was\nBefore there was to emerge analytical\nAnd before there were rough controls and before even there was Facebook before my spirit there was a website called Craig's list I'm back in two thousand six I wrote a song cycle called Craig's list leader was said actual ads from Craig's list to music I'm going to do one movement from that cycle this is called neurotic and lonely [noise]\nTheir auditing lonely or already tried brown eyes is likely disproportionate brown curly hair Jonesboro\nYears old Twenty years old\nSlightly hunched occasionally employed anthropologist chain smoking Jew but we're leaving with parents through school off from school [noise]\nTo deal with emotional problems\nMedicated neurotic\nSikhs\nGorgeous it's hard to see and Jeannie your one man\nIn service in the militia the score\nMaking out TV moody losing\nSo Loni is mark\nChinese food is Thomas ... ... did you\nKnow I can loan\nNeurotic and lonely lonely well\nMust enjoy videogames must do the video games this ... must enjoy menial teams must be then you'll\nGet them to my parents are used to buy one for me my parents are abused apply for me my parents ... parents are beers and parents heritage parents parents my parents were used to buy one for\nMe no\nNo no no\n[noise]\nOr neurotic and lonely neurotic among many neurotic demeanor about learning you've only neurotic sporadically erotic\n[noise]\n\nBut just so much of an official with one more from from Brooklyn travelers\nMen can bite my dear friend Chris ... to play along this is called little of [noise]\n\n...\n... um goes\nYou do we understand about the things we miss the most ... little\nLittle or no no\nNo middle though [noise]\nI Hope we die you know road\n\nMm\n[noise] case the show to do is so deeply committed suicide doggedly issue the time and time when they\n... the [noise]\n... love [noise] ... [noise]\nI Hope we die you know [noise]\n[noise]\n[noise] [noise]\n[noise]\nIt's real and a lawn chairs by the\nBowl shrunken twisted ... speech [noise]\nAssume for scientists to gather the breeze\nWent into the real close ... runs ... new peas little loans noodle no\nLove love\nLove middle though I Hope we die when we're all\nThese ... little no I Hope we do you know [noise]\n[noise]\n[noise] [noise]\n\n[laughter]\n\n[laughter]\n[noise]\n\n\nBecause I'm not a pick an instrumental break him Mr instrumental break is supported by Sierra Nevada Brewing Company crafted to be instrumental to your weekend [noise]\nWeeks to come to us from Brittany how would he go burning now are we didn't to and from the awesome partying or fiddle player on the ... and\n...\n\n[noise]\nIs what our relationship is like a according to Jeff Sessions [noise]\nSeveral more time for the war and reading\nJobs who need to grow\n\nNo blue ...\n\nOh he got\nA ... and you know I'm\nCold here in the ...\nOh he was so\nThe the two of\n'em so [noise]\nThe Syrians\nOh talk\nTo her\n\n[noise]\nWhere do you\n\nRead for using as we ...\nDo you um do you want\nBe yeah that\n\nGo\nAnd see\nIf we [noise]\n[noise]\n\nWell not really for using the ...\nMy mom my mom my mom\nYou\nThese Tommy oh you are\nBoth here bringing you\nMe just say\nWell the\nWay you say\n\n\n[noise]\n\n[noise]\n[noise]\n\nSupport for an HBO ... live stream comes from you our listeners and from service credit union supporting businesses throughout New Hampshire from the generic development projects the fundamental thinking needs programs and services designed for businesses who are ready to grow more I grow with SCU dot com\n[noise]\n\n\n\n\n\n\nSomebody did real hand out to tell the story that he told me right after he got back from that train trip you mentioned earlier that was amazing [noise] they let me off from my kids to be on the piano [noise]\nI said before I took this trip right after the election to try to get out of my New York bubble which is a bubble and to try to have some encounters with folks that I might not have met otherwise I'm On the second day of my trip is is two days after the twenty sixteen presidential election I was standing\nOn a platform to get on the empire built up between that goes from Chicago to the Pacific northwest and I'm standing there and I see these six guys\nDressed in plaid shirt suspenders dark denim work boots\nAnd they're here which back severely in kind of shaved\nSeveral inches above ... could have been hipsters from Portland Ore Brooklyn but something with like a little askew and I thought well this is it I've finally I've gotten out of my bubble and these are the guys are going to talk to but what am I gonna say to them\nSo I get on the train I put my things down and I walk into the observation car and they're sitting there playing cards silently\nIt's just a table away from them stealing glances at them trying to think of a conversation starter and I can't think of anything and then I see this kid who I recognize as being Amish he ... he walks up to them and starts to try to engage them in conversation about the card game", "show_name": "Live from Here", "year": "2018", "city": "Keene", "day": "20"}