{"month": "10", "state": "NH", "station": "WEVN", "content": "W abs Nashua eighty eight point three W. E. H. Hanover Ninety One point three W. E. V. in Keene Ninety point seven W. E. V. C. ... one of those seven point one W E v J Jackson Ninety nine point five W. E. B. S. cobra Ninety point three\nAnd W. E. B. Q. Littleton Ninety One point nine and online at an H. P. R. dot org\n[noise]\nFrom American media [noise]\n[noise]\nAmerican public media\nMy yard and gr than yours truly the arena rock now of course the news\nDirector Mike ... know [noise]\nMartin or\nNight comedian\nThe Buckingham\nHarrison Ford is fair to employ owned an independent\nBarrett has kept clients financial interests for since Nineteen Nineteen\nOr W ... dot com has more information\nAbout carbon I offering data protection solutions for businesses to including automatic back up for\nPoint protection availability and disaster recovery and data migration learned more carbon I dot com\nBy Sierra Nevada Brewing Company\nStanding up for independent voices\nGood to be here in San Francisco\n[noise]\nJust grieving breathing deeply [noise]\nOh I Wish you folks home could see where we're all seeing right now just look deeply into your radios\nIt's a lovely side a lovely so I think you'd ever want to hear and everyone back home listening in radio lab for making our dreams come true yet another year we are [noise]\n\nThen ... and\n... for the new friends\nAerosmith to archery is hardly strictly bluegrass [noise]\nWe're just totally appropriate here at hardly strictly bluegrass them you know don't bark\n[noise] it's hard to put into words just how special this festival is but if my pile Steve Earle\nSupport for an HP our live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swan CSI and all of Chester county giving back to the community for over Thirty years ... dealerships dot com\nNice nice to see all of you to see all the view [noise] there's also usually a stricter there's usually a drinker\nBut that's beside the point I Know the question on everyone's mind today is\nHow was my summer I had a great summer thank you for asking I spend a lot of time on a tour bus with my fellow punch brothers drinking my ties because they paralleled with the news cycle and I got to spend\nMany a happy afternoon on a playground in Brooklyn pretending to be chase from pop patrol\nSometimes if I was lucky my son would play too\nBut I also spend a lot of time this summer thinking about a different children's television program after watching a documentary about Mr Rogers\nCalled [noise] won't you be my neighbor have you seen it\nWell have you stop crying yet her\nAll the tissues on delta flight three Ninety were not enough to soak up my parents\nWere not an official consider this my formal complaint twenty five thousand bonus miles deposited into my count on to cover it [noise]\n\nOn a series now there's been a lot of confusion lately about what it means to be a map a real man Fred Rogers\nWas a real man\n[noise]\nI never thought I'd want my son to be more like a daytime TV star who played with puppet\nThan a Supreme Court nominee [noise]\n\n\nThen they prided days they'll be days\nYou do when she's chain going to turn this thing around like go insane [noise]\nDid she go ...\nNews you know\nShown on the show\nOh\nThe few\nWe can choose\nBegan and shoes and he's you know\nFeel like we wanted to do something that's just really bleed red\nBlue [noise]\n\nHe [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\nBoy speak and boy I'll be should be given what's my ... my boy John gentlemen's channels from\nBars to ban with the harder so the lover says the holder still just trying to introduce him to them and he won't do you\nFeel the\nThe baby [noise]\n\n[noise]\n\nWell [noise] I\nMean come\nOn\n\nKnow we happen to me\n\nWhat's that\n[noise]\n\n\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\nOf the show is brought to you by San Francisco board and you are in them and our new slogan\nPrince let's go in for you you rent taking visit the fresh food at great Nightline\nThan San Francisco is there for you I'm a software engineer and father to San Francisco is for you know visual artist in a life to San Francisco is for you I'm In the ER doctors studying to become a Buddhist monk\nSan Francisco is definitely for you\nDo other cities make you feel like a weirdo just because you\nI'm a studio musician in transcendental meditate or was counting on the days till November sixth avenue calendar [noise]\nFrancisco I use the cloth diapers and law sandwich bags\nYou know it's I don't go to the doctor because I discovered the healing power of quartz crystal\nThan friends for you baby hey do you want to be a part of the new economy ... get on your computer and Shaq us an\nIdle limited my carbon footprint and I agreed to a new test every year it's [noise]\nI'm the kind of guy I was looking for a place to live that slightly more expensive than Manhattan but as an LA\nSan Francisco and definitely for you\nDowntown and make two hundred and fifty thousand dollars a year and can't afford a studio apartment in Selma maybe open just for you [noise]\nVolunteer on a ... because they live off my parents' trust fund\nThan friends for years\nI'm a Reagan who wants to be buried in a mushroom bag\nMarathon\nI Am an eyebrow coast mostly made it for [noise]\nAt this time a number of our stations need to take a break to tell their listeners\nWhat station they're currently listening to and what the weather is like in the place where they currently are we'd like to take that opportunity to play a piece of music that comes from where we currently are this week's local break features the great Oakland band tower of our\n[noise] saw and what is hip [noise]\nIt slowly from here on an HP armed good evening support drainage PR and comes from you our listeners and from flying monkey performance Senate presenting an evening of Americana with David ... expand and loud and Wainwright the third on October twenty seven flying monkey on H. dot com\nAnd from Portsmouth bath company local an independent bathroom kitchen sale show Roman specializing in helping contractors designers and homeowners was refreshing ideas Portsmouth bath co dot com [noise]\nIn Nineteen eighty five three boys discovered a blue fifty five gallon drum words of ... state park keys was\nTrying to pull the top of the barrel off we got hit with like the smell of like rotten milk\nAvailable now from an HP are bare Brooke pod cast about a cold case that changing how\nMurders will be investigated for ever learn more and barrier broke pod cast dot org [noise]\n\nBegin by the by the whole\nIn the\n\nYou know it's our ... our what is it about ... be more\n[noise]\nGabby I'm so excited about this you have a brand spanking new song for us and I mean brand\nNew ... couple of weeks and\nThree minutes of the improv three minutes of improv [noise] we have no idea what's going to happen\nBut I Know that it's one of the great pleasures of my life to play music what Mike Elizondo search for this first in the ...\nOf three minutes of improv\nWe're going to check a timer for three minutes start playing\nAnd see what happens\nWish us luck this is a beautiful place right\nLike how does it sound in your heart and had to end figured you right now being in this place\nIs is this your first shows researcher alright move your mouth\nYou know I think you got to take this from Chris I bet you I think you got to take this one that it's it's it's all you\nAlright alright tough tough but fair I'm okay\n[laughter]\n[laughter]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nI Can't believe that my life including it's getting to do something\nFor radio\n... Lindsay Buckingham talk show\n[noise]\nOh yeah\n...\nCan dream\nOf ...\nNow\nIn a\nHealthy yeah\nI Know a\nTreaty you on a ... not\nLow\nTo go\nA little mom and my\n... and\nHe\nDidn't have a oh Mm\nHe is he is\n...\nCan he\n\nClearly yeah\nI Know\nMust have a simple\nJust\nThe ...\nAnd your ... it's\nA\nA\n\nRat\nHas no\n\nAnd ...\n\n...\n\nAnd how and and then um\nYou clearly yeah\nNew book or\nKnow the job I\nAnd ...\nIs is\nLaw a\nHas no\n...\nBuy a\nAnd this is about to be with\n\nI got the penny away but um maybe they do that is another thing\nThey get to stay away\nYou know that right now do you live\nThe other\n[noise] mhm\nWhat about\nYou know this does he do what\nThis next song is called by them saying\nThat we're by no means to move forward and that's where we got to go no matter what [noise]\nGet some things\nAre just wonderful and\nBased on the\nAnd some say\nNot mess it up\nBill now than when I Am\nTreated as a non white man\nI don't know uh there's no there's no [noise]\nReally good\nMean [noise]\nThey\nBe something\nThat they tell you do you'll\nBe some [noise]\nWhen lately\nTo be hard\n\nTo judge it in my last night [noise]\nI Love my friends but do you [noise] [noise]\nThey read a bomb on me but\nI I think the you know the time\nAnd then they\nBeen moving slowly I don't know I'm going to do\nIs give Mitt time\nYou'll any day now\nTo any day now\nSupport for an HP ours life's dream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how we're in Reno can help you online at or dash Reno dot com\n\n[noise]\nAnd\nThen the ... the album in ...\nKnow how my bill then he's\nKnow having to weigh the lead us opens and get on the job and it doesn't really bother me I went to the number seven bulldog Marlboro [noise]\nThe model that is so not ...\nVote tonight I'm In my\nTo day\nWell how\nThis June when\nA ... year low low [noise] strange when the\nTo ...\nGot to be a question that\nI've shopped his birthday segment with the one and only Julian ... well\n[noise] first there was\nYou know whenever I get down about the world\nI remind myself that it contains a whole lot of ...\nAnd that makes me feel better\nThere's a piece of profound music by going all out for any occasion including this one\n\n\n\n\n\nDon't\n\nKnow do\nTell them by name [noise]\nWhen you know\nThey've\n\n\nKnow and then\nCan go\nTo Jay well why not go\n\n\n[noise] [noise] [noise] [noise]\nThat was that it's time for an instrumental this instrumental break is supported by Sierra Nevada beer craft to to be instrumental to your weekend\n\n... sports for an HP aren't comes from you our listeners from flying monkey proponent center presenting the evening of Americana with David ... love and Wainwright the third on October twenty seven\nFlying monkey on H. dot com and from ... proud to be true the so kids zone and the king challenge bike ride October twenty get the benefit individuals with brain injury details educating challenge dot org\n\n[noise]\nThe rising stars awards recognize outstanding young professionals in innovative companies around the state I'm Keith McDermott data independent nations reporter I. N. H. P. R. and we're partnering with the work place to celebrate this year's class of captures rising stars will be the courier museum\nIn Manchester until this day October ... with the delicious food entertainment and wrap get your ticket that an H. P. R. dot org\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[laughter] [noise]\n\n\nCalled gold rush for a ride so [noise]\nFor our target is on the Federal Reserve Chris over on the guitar [noise]\nYou had seen her on ... and you can check out his show on Comedy Central it's not very funny and the only\nThing that you came from you know I'm telling jokes\nIn San Francisco [noise]\n\n\nOh I always wanted to say that dream come true uh\nHow can I mean I'm I'm On tour with Lindsay Buckingham [laughter]\nI mean you know it's not official\nYou know I haven't met 'em but ah he's on stage I'm onstage or like we're basically on tour so\nOh you've got someone call my mom it's all working out a I Love your city I Love San Francisco it's such a it's a no brainer it's wonderful a very expensive city that's a transition sentence and um\nI Love spending money I don't have any love to spend money or to be careful I have to be careful I had a change banks a couple of weeks ago had to take my bag of coins elsewhere\nI'm\nSure that I\nWas it yeah\nMeet you too [noise]\n\n\nYeah\n\n[noise]\nMm oh\nThis is my favorite yeah me too\nIt's my favorite surfer he is so what what's my tight skinny eighties nerd is going to grow up and did that Grey's Anatomy guy\nThe guys welcome back I'm Chad can I start you off with some drinks tonight\nI yes yes so well\nAnd thank you had\nYour bed I'll get that out you guys ... okay thanks [noise]\nAnna may I point out to you that you were just totally rude to my favorite server uh may I point out to you that your favorite server just called this guy is what\nYou guys he said it twice I didn't even notice of course now we've been called dies our entire lives we don't even hear it anymore but once you start noticing it it's the men are only\nA few days ago my nephew from high chair was saying to me and my mom well what did he want from you guys hummus and that's not funny [laughter]\nBut come on women call each other guys all the time that's the point where all too happy to be like she was in with the most valued gender is cool he's coming back chat coming\nGuys house read for ya which you guys like two or three days first oats outfit or sets the little spill their Kay how man oh boy ... guys\nMy\nGod oh it's fine if I'm really why don't we just order um I have like the all of the book a teeny yeah the ... for the woman and I another woman with like the ...\nOh okay oh get that right in and again those are I guess yeah\nI my sister's fork in my uh crushes over\nIf you walked up to a table as dudes and was like hey gals can I say often during their fight there would be afraid getting fight they'd be like what do\nYou just call laws\nWere not chicks dude he's let's go pee on ... yeah\n[noise] you\nAbout that you know I think it's weird that the mom carries the baby for almost a year you know risk her life and childbirth and then we named the kids after the dad\nAnd what are the dad do the equivalent of ...\n[noise]\nBut you're right their names are on everything yeah every street I walked down is named after him in every building I Walk into is named after him and when I was born I was named after a man and if I ever marry all have the option of changing from being named after one man to be named after a different man oh\nJames Brown was right it's a man's man's man's man's world [noise]\nIt's just three man says it's a man's man's man's world I could've started with man's man's man's name oh you're thinking of it's a mad mad mad mad world oh I Am\nHere's one beyond say who runs the world's okay who'd win a fight between Beyonce and James Brown queen bay would clean up dude uncommitted oh sorry\nHe do you hear some fresh bread for ya but be careful the plate is hot [laughter] just like you to come on they um maybe this is to forward but ah I see you in here a lot I was I was wondering if maybe you'd like to get coffee sometime\nOh well Chad that took some over read oh I'll tell you what is that if you have a single friends maybe we could double date with you gals\nUh I don't know what's happening right now I was just wondering if you'd like to go out and get some coffee\nYou know what she'd like how about a little R. E. S. P. C. T. were not lesser then we're tired of being called guys at the end versus considered derogatory\nSo that's a no on the coffee\nAt a girl [laughter]\nKnow\nJust got him or her at all [noise] the Reno broke and how we run [noise]\nSay [noise]\n...\n... ... ... ... ...\nYou know yeah and hit me yeah\nIt made me see well uh-huh\n... yeah\n\nYou\nKnow going back to the keys\nMm [noise] [noise]\nDon't know me too\nWe yeah\n", "year": "2018", "show_name": "Live from Here", "city": "Keene", "day": "06"}