{"month": "10", "state": "PA", "station": "WVYA", "content": "Well this was W. B. I. eighty nine point nine a pound WB I each one Scranton Wilkes Barre case Wilton W. B. Y. eighty nine point seven after Williamsport nobody TI eighty eight point three of them ... Mansfield and W. P. A. U. Ninety One point five FM Palmyra township\nStreaming live at W. V. I. A. dot org\nWe have translators in Allentown that Ninety nine point three and in Bethlehem at one of five point seven\nListener supported public radio W. V. I. S.\nT. opioid epidemic using a men's public health crisis of our time [noise] now WB I Am a proud partner with family service association of northeastern\nPennsylvania for the ninth annual national family we conference a community built to conquer opioid addiction\nFriday October twenty six at the best western plus genetic hotel in conference center in books very [noise]\nTwelve workshops focusing on different aspects of the opioid crisis details on registration essay\nAnd EPA dot org\nGood morning now that Nikki Haley has announced her resignation as ambassador to the un President Trump's weighing a replacement looking into my ... coming up with our MORNING EDITION\n... departure give national security adviser John Bolton more influence over America's relationship with the ... and I'm Rachel Martin\nTrump announced his plans to lift sanctions on ethanol in gasoline that may help Iowa born\nAlso have to fight over Supreme Court justice ... playing out in West Virginia Senate race doctors are finding some people prefer after effect\nWent back to pretend to David Lee right in front\nMusic that\nLive from NPR News in Washington I'm Dave ... hurricane Michael is now a category ... storm with Tom sustained winds of one hundred forty miles per hour it's been called potentially catastrophic with landfall expected this afternoon in the Florida Panhandle or Big Bend area\nA half million people are being ordered or advice to evacuate the time running out to do so kind of gas it with Troy public radio has more\nLuke ... has lived in Panama City beach for Thirteen Years and in that time he's number needed to evacuate\nFrom NPR News in Washington I'm Dave ... hurricane Michael is now a category ... storm with top sustained winds of one hundred forty miles per hour it's being called potentially catastrophic with landfall expected this afternoon in the Florida Panhandle or Big Bend area\nA half million people are being ordered or advised to evacuate the time running out to do so kind of gas it with Troy public radio has more\nLuke Hensley has lived in Panama City beach for Thirteen Years and in that time he's number needed to evacuate his home because I'm an approaching storm this time hurricane Michael motivated him to low to put the car with things he didn't want to lose\nEverything ... why why my cat in the car but [laughter] you know those are viable but you know everything else pretty much ...\nAnd ... says he knows that some of his neighbors have decided not to evacuate their homes state officials in Florida I have said they're worried that not enough people are heeding the mandatory evacuation order at the large and dangerous hurricane heads for the Gulf coastline for NPR News I'm ... in Montgomery\nPresident Trump wants the EPA to back year round sales of gasoline blended with Fifteen Percent ethanol currently sales of e Fifteen fuel are banned during summer months over pollution concerns\nRepublican senators who met with the president yesterday at the White House said that's when they were told that the decision it's designed to help farmers hurt by tariffs and GOP candidates in the mid west in the upcoming midterm elections\nLast night the president promoted year round ... Fifteen at a rally in Council Bluffs Iowa\nAdministrator is acting ethanol All right that's right [noise] we are\nThe power of the Fifteen to\nCountry all year long\nThe mid term elections are in four weeks the international Monetary Fund is warning risks to the global financial system have risen over the past six months and may soon increase sharply NPR's Rob Schmitz reports\nThe IMF whose oughta meetings with the world bank get underway in the resort island of Bali this week issued a report which said financial conditions are contributing to a buildup of vulnerability such as high debt levels\nIns capital markets directors had potential shots of the global financial system could come in many forms such is higher than expected inflation that triggers a sharp drop in interest rates were disorderly exit by Britain from the European Union\nAnd the report the IMF said economic growth appears to be in some major economy has one of the gap between advanced countries in emerging markets was widening\nThe U.S continues to grow strongly but the economies of you in Japan are slowing as is China's who's lagging economy could be exacerbated by trade disputes with the U.S Rob Schmitz NPR News Shanghai\nThis is NPR News from Washington\n\nIn major league baseball the American league championship series is now set the Boston Red Sox will face the defending World Series champions the Houston Astros last night Boston advance to the A. L. C. S. by beating the New York Yankees ... three in game for their AL divisional series\nThe red Sox won that series three games to one\nThe ale cs begins Saturday Night in Boston\nThe first African American drafted by an NFL team has died as NPR's Tom Goldman reports the former running back coups teams included the Baltimore Colts and the Philadelphia Eagles was Ninety One years old George\nTell a pharaoh was the star running back for Indiana University in the Nineteen forties Chicago took tell a pharaoh in the Nineteen forty nine draft but he'd already agreed to play in the rival all America football conference after that he played six years in the NFL in ...\nThe red Sox won that series three games to one the ale cs begins Saturday Night in Boston the first African American drafted by an NFL team has died as NPR's Tom Goldman reports the former running back coups teams included the Baltimore Colts and the Philadelphia Eagles was Ninety One years old George tell\nA pharaoh was the star running back for Indiana University in the Nineteen forties Chicago took tell a pharaoh in the Nineteen forty nine draft\nBut he'd already agreed to play in the rival all America football conference after that he played six years in the NFL in was named the pro bowl three times\nTele Ferris said the thing he'd like most about football was hitting people because it let them vent his frustration about discrimination he told the Indy star than in Nineteen forty seven he went to a segregated movie theater in Bloomington\nAnd took down the colored sign in the balcony\nAnd I took a screwdriver with me and to this side and put it in my pocket and I've had a ... threat\nBeyond football tele pharaoh taught and worked in the administration at several universities Tom Goldman NPR News\nStocks in Asia ended the day mostly higher analysts say that's despite ongoing investor concerns that trade tensions between the U.S and China might slow global economic\nGrowth that's an issue raised in today's IMF report I'm Dave mattingley NPR News in Washington\nSupport for NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites you point detection and sixteen programmed massages including warning night and stretch sessions retailers nationwide more a dream wave chair dot com and the ... foundation\nTaking a look now at the forecast will see partly sunny skies today with high in the upper seventies there'll be mostly cloudy this evening long with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent\nShowers and thunderstorms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties\nThis listener supported public radio W. V. I. F. ...\nThis is Ari Shapiro host of all things considered by the time you turn on our show in the afternoon you've probably seen headlines maybe you've read it sweet and you might have heard the news cast so we want to tell you more than just what's happening we want to give you reasons why things are happening the context around what's happening\nWe want to tell you something that will stick with you while you're driving home or making dinner all things considered listen every afternoon [noise] weekdays for weekends and five on W.\nV. or am I on Christmas Eve from\nLive from here with Chris Stevens [noise]\nWe're proud to be the highest rated to our live musical comedy variety show on public radio in time slot [noise]\nDo it in this weekend for our show in policy leader in Saint Paul Minnesota with the school are rather miss Madison Cunningham\nAnd dirty projector [noise] fly from here we make great radio for\nSaturday Night at six Sunday night at eight on W. V. I. A. F. N. [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin in Washington DC\nAnd I'm David Greene in Culver City California hurricane Michael has grown rapidly now to a category for storm over the Gulf of Mexico heading for the Florida Panhandle\nRight so rapidly in fact that forecasters are saying that it's growth quote defies traditional logic it is expected to hit land around midday today carrying heartland life threatening storm surges along Florida's northern Gulf Coast here's Florida governor Rick Scott on Tuesday\nThis storm is that do not take a chance to think about the destruction we've seen before with storms like her\nCovert City California hurricane Michael has grown rapidly now to a category for storm over the Gulf of Mexico heading for the Florida Panhandle\nRight so rapidly in fact that forecasters are saying that it's growth quote defies traditional logic it is expected to hit land around midday today carrying heartland life threatening storm surges along Florida's northern Gulf Coast there's Florida governor Rick Scott on Tuesday\nThis storm is definitely do not take a chance to think about the destruction we've seen before with storms like Hurricane Irma the panhandle and then we'll likely see when the next one hundred and ten miles per hour south of thinking about one hundred and ten our car went\nRight to keep in mind that what Scott talking on Tuesday hundred and ten miles per hour now officials are predicting when speeds up word of a hundred and forty miles per hour\nWell this this could be a bad one let's turn to NPR's Greg Allen he is in Tallahassee monitoring the arrival of this storm Hi Greg how David I'm just trying to get my Florida geography and play some how close are you in Tallahassee to to where the storm is is already having impact\nAll right NPR's Peter Kenyon in Istanbul Peter thanks Thanks David [noise]\n\nThis is NPR News next time on ask me another actor Diane Guerrero talked about her writing process and immigration activism\nI thought maybe my voice could be an asset um I Know what this feels like I Know what family separation is so I decided okay All right from thing the new the needle in any way the joy meal for your eyes burn for NPR's our that those word games and trivia\nSaturday at all that but I Am on W. V. I. A. F. out\nTonight at seven on all that she has its recent piano trio recordings then mixed bag start today with the day new releases at eight thirty to set of new music\nBy longtime veteran artists ended nine it's our weekly album review this time the Scottish do all the ... daughter and they're recording cold dead rent you\n\nThis is George Graham joined us tonight starting at seven on WB I [noise]\nPalm and every disease is one of the most common medical conditions in the world millions of people in the United states suffer\nForm of lung disease including asthma\nFor why someone they develop one or more disease\nPulmonary every\nTown on the call a doctor\nThe IRA he be\nTaking a look now the forecast will see partly sunny skies today with high in the upper seventies there'll be mostly cloudy this evening along with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent\nShowers and thunderstorms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties\nThis listener supported public radio W. V. I. ...\nSupport for NPR comes from this station and from the doors do charitable foundation who critical scientists development awards support promising early career physician scientists and their research efforts to improve human health from the state of Joan be crock whose book\nWith eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties this listener supported public radio W. V. I. F. ...\nSupport for NPR comes from this station and from the doors do charitable foundation who's critical scientists development awards support promising early career physician scientists and their research efforts to improve human health [noise]\nFrom the state of Joan be crock who's ... served as an enduring investment in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\n[noise] from the Robert Wood Johnson Foundation working alongside others to build a culture of health that provides everyone in America fair and just opportunity for health and wellbeing\nMore at our W. J. F. dot O. R. G. [noise] and from the William T grant foundation at W T grant foundation dot org\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene more than five million Americans every year for critically ill and end up in an intensive care unit\nAnd doctors are now coming to realize that as many as half of the people who've been rushed to the ICU for a medical emergency will go on to suffer serious mental problems like dementia there's more from NPR's Richard Harris\nRichard Langford is sixty three year old retired minister who lives with his mother in east Nashville, Tennessee he says his medical saga began a decade ago\nIn two thousand eight hours when in because I was playing tennis with the un ab fab euro and uh he\nThe mob but and so I wanted fresh nice to help me sleep better\nBut after that routine need surgery Langford developed a lung infection which sent him to the intensive care unit he had developed sepsis a life threatening conditions sometimes called blood poisoning\nAnd all he remembers from his delirious weeks in the hospital was near death experience ... green grass or somehow\nOn the other side of a river\nIt looks like there was a lot a larger the prophet who's miracles included resurrection of the dead\nHis mother leader says at one point hospital staff were so sure he would die overnight they didn't even bother to pass on his medical chart to the ...\nThe thing that's amazing is his talking to us and he is like being aware of what we were saying and yet then not knowing and not remembering any of that for I Would say it ... we were at the rehab how bad for weeks\nNow a decade later Richard Langford says he still struggling to work its way out of a ticket that's physical emotional and cognitive though he's still reached the New Yorker and remains active in politics he says sometimes he feels like he's lost in a vast forest\nAnd it is the earth shattering and there's the the water is is a big there's waterfalls and there are all kinds of animals around and that farce is kinda surrounding me\nAnd I can't get out I Can't I don't know how to get out\nHis mother who is now eighty nine years old is helping him through by among other things managing his medications\nNow this last time\nThey when he went into the hospital they changed out a song\nFlourishing and there's the the water is is a big there's waterfalls and there are all kinds of animals around and that farce is kinda surrounding me\nAnd I can't get out I Can't I don't know how to get out\nHis mother who is now eighty nine years old is helping him through by among other things managing his medications\nNow this last time\nThey when he went into the hospital they changed out a song medication or loss in and took him off of that and put him on the L ugly so each morning I change and they see evening and what I'm doing I'm taking one medicine at and putting another one in\nThe line for are grateful to get support from a clinic\nAt nearby Vanderbilt University which has pioneered efforts to understand and treat patients like him this is a huge problem doctor was really an intensive care specialist heads that effort he says post ICU syndrome effects thirty to fifty percent of all patients who are in the ICU due to a medical emergency even younger people\nI mean you you have somebody coming into the ICU\nWith a previously ... very well working brain and they leave critical care not being able to have a good conversation they can't balance a checkbook they can't\nFind the names of people at a party and they get very embarrassed when they start socially secluded in themselves are patients tell us what a misery this form of dementia is it permanent\nIt's permanent in some we've been following people for over ten years now from the brain tissue study which we did hear at Vanderbilt and many of them a decade out still have elements of the dementia\nOverall he estimates that a third improve a third stay the same and the third end up on a slow decline for many the mental damage it's akin to a traumatic brain injury free all timers or even sometimes all climbers itself\nThese problems are linked to the degree of leery um people experience well in the ICU ... says\nEvery day you're delirious you have about thirty five percent increased risk of this dimension so if you do the math on that three days of delivery him you got a almost a sure thing that you're going to have some elements of the dementia\nHe can't say exactly why the leery of leads to dementia but elite has develop strategies to sharply reduce delivery him in his ICU we have a separate story about that later today on all things considered and available online\nBut for those patients who are already facing these issues it's more than just about memory and focus Joanna starlings a clinical pharmacist is part of the team at the clinic that sees these patients\nAnd fortunately I Want to be patient and their family not very happy depression anxiety ... and cognitive impairment\nThese are often treatable conditions especially the anxiety and depression\nMaking the affair bath time talking to a private weakening impact on my medication to help with the Athens while\nVanderbilt is now helping a few dozen hospitals around the country establish clinics like this she says the unmet need is enormous the clinic in Nashville has gradually helped Richard Langford to recover some of his routines for example the day before I visited him he said he'd been able to go out and vote in a local election\nI was a bit in the car\nGo ... precinct which is maybe a half mile and then as they come back the far is that a little bit smaller\nHis mother lead it knows there are challenges ahead but her faith keeps her ...\nYear here today I'm here today so less enjoy today and tomorrow it'll take care of itself\nThese routines for example the day before I visited him he said he'd been able to go out\nAnd vote in a local election\nI was able to get in the car\nGo that route precinct which is maybe a half now and then as they come back the far I got a little bit small\nHis mother lead it knows there are challenges ahead but her faith keeps her ...\nYear here today I'm here today do less and you don't like today and tomorrow it'll take care of itself\nOne great source of joy for them both is music Richard plays piano in Oregon as as his mother and he loves to sing she sits down at the piano and pulls out one of his favorite him so\nThat you let them back to la la la oh dead jeeze ah ah or any\nLeader says the clinic had suggested music would help him recover so over the years she has caused him to the keyboard happily music is one skill Richard held onto throughout his medical ordeal [noise]\nI Know I'm a bunch of ... Richard Harris NPR News\n... ...\nClay Masters of Iowa Public radio thanks so much we appreciate it yeah I think you\nOnly one Democrat voted to confirm Supreme Court justice Brett Kavanaugh here with Senator Joe Manchin of West Virginia mansion faces a political reality state is getting more dominated by Republicans and he's in a tight race against the state's Republican attorney general Patrick Morrisey\nBut there are doubts about whether supporting Kavanaugh is really going to help mansion on election day here's West Virginia public radio they've message\nAs mentioned stood on the Senate floor to cast his vote to confirm Kavanaugh on Saturday protesters yelled shame from the gallery\n[noise]\nThen they showed it on order and the gallery\nBy that evening assigned saying shame on mansion hung over mansions office back in West Virginia state Capitol Charleston in the run up to the vote Jamie Miller was arrested while protesting at his campaign office\nMiller who's an artist also went to Washington with a group of sexual assault survivors to meet with mansion she says he was a tenant and listen to their concerns\nBut after last weekend's vote she's not sure what you do when election day\nI didn't vote for him um during the primary but the ad that for him in the past and now I'm really on the fence about what to do turn Ireland the Charleston city councilwoman she says she's always recognized that mentioned is new liberal but his defended him in the past\nI have been a person who has been the person to say to someone\nThat we need to recognize that West Virginia Democrats are more conservative that we're a state with an aging population and that you know Joe Manchin is better than his opponent\nBut after Kavanaugh's confirmation Ireland so she won't vote for mansion in November Emily ... came to a similar decision she's a public school teacher even the west Virginia Public school teachers went on strike earlier this year and the teachers union support mansion ... she'll leave her ballot blank\nI absolutely will not be voting for senator Manchin in November I won't be voting from Patrick Marcy either I Would never vote for him but um\nThat you know Joe Manchin is better than his opponent\nBut after Kavanaugh's confirmation Arlen says she won't vote for mentioned in November Emily comer came to a similar decision she's a public schoolteacher even the west Virginia Public school teachers went on strike earlier this year and the teachers union support mansion ... she'll leave her ballot blank\nI absolutely will not be voting for senator Manchin in November I won't be voting from Patrick Marcy either I Would never vote for him but um I just we don't have a candidate that it's going to fight for us\nAll three women so they hope the next Democratic Senate candidate from West Virginia will be more progressive the mansion he frequently breaks ranks with his more liberal democratic colleagues in the Senate for my to do that voting record is a sign that mentioned is an independent thinker can put it was a democratic state lawmaker for mentions own in Marion County\nJoke kind of wait out what he thought the majority West Virginians wanted him to do and and and he did that he acted accordingly or some people won't be happy about that and some who's going to be mad about it but you know you can't throw the baby out with the bathwater as they say you know we were never going to agree\nA hundred percent of the time with anybody\nBut computers as mentioned isn't likely to win any votes for more conservative independent or not affiliated voters with his vote for cabinet ... believes mansion has certainly lost some support from progressive Democrats after this weekend\nMatches future now hinges on whether voters feel so strongly about his vote for cabinet that they abandoned him or if they want to continue the state's tradition of sending moderate Democrats to Washington for NPR News I'm Dave message in Morgantown West Virginia [noise]\n\nAnd this is NPR News\nPrograms [noise]\nIt's been said that there were a few new music images or symbols to inspire and instruct\nOur generation I'm ... and this is the pulse of the planning with the help of Warren lines at the chiefs of the Onondaga councilman six nation Europe what confederacy we'd like to offer a metaphor for our time\nImagined that you're part of a herd of buffalo [noise]\n\nHeard the human her to know like a herd of buffalo has a very rough is now the whole herd is restless and moving they're not sure the scouts on the outside see very clearly the danger\nBy the interior of the herd only feel it and that's the way the human beings are now there are at the center on certain and then do something about and it's yet to come directly to them from the scouts out there whose job it is to\nWatch for the protection up to her and to get that information back it's yet to reach her fully what that information and danger is and so I'd say that's where we are right now where we are in great danger\nTherapist's office going to continue to do what is going to do whether we're here or not\nIt's not going to be an end of the world there's going to be the end of human being probably better for the world actually I mean then that can regenerate and green can come back again and\nEverything will develop again you know peacefully and Kim\nI'm kind of a human being began to populate like they're going to one of the laws as that no single element of life can just populate endlessly and that includes the human being and that's what we're doing now we're just\nThere is always going to continue to do what is going to do whether we're here or not it's not going to be an end of the world there's going to be the end of being probably better for the world actually I mean then that can regenerate and green can come back again and everything will develop again you know peacefully and Kim\nI'm kind of a human being again through populated like they're going to one of the laws is that no single element of life [noise]\nKansas populated and this and that includes the human being and that's where we're going we're displacing all kinds of life all over this [noise]\nThis archival ... part of our thirtieth\nAnniversary regime [noise] want to hear more check out our pond guessed I'm Mr and Mrs the pulse of the planet\n\nOr you were ducks in a row\nAlmost half of Americans do not have a proper stinks plan\nThe planes are more than matters of money and inherited\nDeacon guide your future health decisions and revise special instructions for loved ones and your care\nPut your mind and by getting your ducks in a row today\nTo request a free planning God contact ... young [noise]\n\nSupport for NPR comes from this station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine team MacArthur Foundation recognizing exceptionally create of individuals' this year's MacArthur fellows and more information or at Mac found dot org and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Rachel Martin for the third year in a row the Los Angeles Dodgers are playing for a spot\nIn the world series a couple of the team's star players are Cuban now a new report in Sports Illustrated lays out the dubious ways that some of those players make it to the U. S.\nThe Dodgers have long had a very rich pipeline to the Caribbean into Cuba and one document that we cited in in the article they at some point had an internal ranking system of just how corrupt some of their own scouts for\nSri executive editor John Wertime says that at one point the Dodgers called one of their own employees unbelievably corrupt or if I'm told me that in order to get access to top baseball talent in Cuba teams often go through agents called boost counties\nThe ... is a middleman base in Latin America who essentially take equity stakes in prospects sometimes it can be forty fifty sixty percent of future earnings but for prospects desperate enough that's you know that's a risk to undertake\nAnd now it might be a legal risk according to Sports Illustrated the Justice Department is investigating whether some teams broke federal corruption lost to sign Cuban players\nExtraction of Cuban players has always been shrouded in mystery in baseball but this evidence that the FBI was presented with and we were as well indicates that ah that the complicity runs potentially ... agents as well as the middle man the ... that have always been implicated in this\nAnd it is it basically impossible for a baseball player in Cuba to find his way into the the major leagues without help from one of these middle man\nIt's very difficult part of that is the cost of the embargo with Cuba and a player must establish residency in another country usually in the Caribbean or Mexico before coming to you\nPresented with and we were as well indicates that ah that that complicity runs potentially teams in agents as well as the middle man the ... that have always been implicated in this\nAnd it is it basically impossible for a baseball player in Cuba to find his way into the the major leagues without help from one of these middle man\nIt's very difficult part of that is\nThe cost of the embargo with Cuba and a player must establish residency in another country usually in the Caribbean or Mexico before coming to the U.S [noise] so what you have is a network of the street level agents that really have been operating outside of\nAnything that the u._s. or major league baseball has dress diction over\nSo you obtained these documents that are ... you say offer a window into how baseball teams operate in Latin America especially in Cuba can you explain what you found him what a chance\nWe were given a hundreds and hundreds of pages of documents that were also turned over to the the FBI this dossier what it shows is that teams and agents have what seems pretty clear from the documents any way on a level of complicity and in some cases that's scouts on the cake and in some cases that is about\nHelping to arrange documents using outside counsel to\nEssentially falsified documents and one does think that this is something that could implicate teams in major league baseballs and institution which is something that hasn't really happened before this is the first time so far as we can tell where you have this level of documentation\nClearly I mean as you've articulated that has been somewhat of an open secret for for generations really but now that you have the documents that allegedly showed some of them are dubious recruiting behavior do you watch these players on these games differently\nAnd this is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin\n[noise]\nThis is W. vi eight eighty nine point nine of them W. V. I. H. D. ones granted Wilkes Barre hazel than WTY eighty nine point seven FM Williamsport WTO eighty eight point three if it means Berg Mansfield\nW. P. A. U. Ninety One point five FM Palmyra township ... universities W que su eighty eight point of mc ... grows\nThe pot spill translator at Ninety four point nine of them is made possible with support from the Richard ... junior charitable foundation and the next fresh air\nI later this nation should emitted Sally cheating the goal of landing a man on the low\n... who directed the new movie the first man that Neil Armstrong the first man to walk on the move to the author wrote and directed la la land joiner [noise]\nIt's evening at six after all things considered on W. V. I. A. F. at [noise]\n\nMid morning another hurricane and this time and lord and can handle having hurricane Michael could come ashore with wind over a hundred mile an hour and joining in his hands on and say I\nIt's still a mystery how prominent Saudi journalist and went missing that turned U.S officials may be getting close I made so Martin\nAnd I'm David Greene the danger marker so he just appeared Fifteen Saudi men rewarded we arrived to stumble Saudi officials\nTime in Florida Panhandle hurricane Michael could come ashore with wind over a hundred mile an hour It's MORNING EDITION from NPR\nIt's still a mystery how prominent Saudi journalist went missing but Turkish officials may be getting closer I'm Rachel Martin\nAnd I'm David Greene ... she'll be disappeared Fifteen Saudi men were to be arriving to stumble Saudi officials deny he was killed so they provided no evidence for awhile\nAnd also with sexual assault prominent in the news will hear how one group of teaching teenagers about content and remembering\nGeorge ... Barrows first black mayor drafted by the NFL\nWhen they're over tend to divert the former NFL quarterback\nToday here's the\nLine from NPR News in Washington on corporate Coleman the national Hurricane Center is warning that hurricane Michael is now an extremely dangerous category for storm top sustained winds are now one hundred forty miles per hour the hurricane is a little more than one hundred miles south of Florida's panhandle\nNPR's Windsor Johnston says Michael May get even stronger before making landfall in Florida\nThe storm is expected to bring heavy rain and produce dangerous storm surge along Florida's panhandle federal emergency management agency spokesman Jeff fired says residents need to use caution and heat all warnings\nI definitely want to rewrite the storm will cause major infrastructure damage a specifically to our waste water and transportation networks is not going to be a storm that are those are critical I Will be stylish relatively quickly afterwards\nTens of thousands of coastal homes and businesses are in the path of the storm states of emergency have been declared and more than half of Florida sixty seven counties Windsor Johnston NPR News\nPresident Trump is continuing to blast Democrats and protesters were their opposition to Supreme Court justice Brett Kavanaugh NPR's Ayesha Rascoe has the latest from Trump on the campaign trail\nTrump says Democrats will try to impeach Kevin ... they take control of Congress at a campaign stop in Iowa Trump said the fight against Kavanaugh will not in now that he's on the bench\nFrom the very first job was nominated radical\nDemocrats were on a mission to resist obstruct LA demolish destroy they want to destroy them at\nThe fight over the Kavanaugh's nomination has become a rallying cry for shop and Republican lawmakers ahead of the mid term elections in November Ayesha Rascoe NPR News Council Bluffs Iowa\nThe American Music Awards have been handed out to the winners of fan favorites that twenty eight feet artist of the year was pop singer Taylor Swift she thanked her fans and friends and then had a request\nWarn every single word given out and I were voted on by the people you know what else\n\n[laughter] [noise]\nThat audio is courtesy of the American Music Awards swift picked up three other prizes\nA new report from the general accounting office bind cyber flaws in the Pentagon's latest weapons systems the G. A. O. report says the Pentagon is just starting to grapple with numerous vulnerabilities common problems included passwords that were easy to guess or weren't even changed from the factory setting\nThe report from the G ... sites Pentagon officials are saying they believe their systems are secure\n[laughter] [noise]\nThat audio is courtesy of the American Music Awards swift picked up three other prizes\nA new report from the general accounting office find cyber flaws in the Pentagon's latest weapons systems that Ga over pored says the Pentagon is just starting to grapple with numerous vulnerabilities common problems included passwords that were easy to get or weren't even changed from the factory setting\nThe report from the G A outside Pentagon officials are saying they believe their systems are secure and that some of those checks are unrealistic\nYou're listening to NPR\nA private TV channel in Turkey is airing footage that says it showed the missing Saudi Arabian critic Jamal could show game he went into it Saturday consulate in Istanbul, Turkey last week and vanished the video also shows and black then leaving the consulate and later going to the Saudi consul home\nThe Saudi Government says it doesn't know where ... is Turkish officials suspect he was kidnapped or killed\nPresident Trump says plans are underway for his second summit with North Korean leader Kim Jong il and Trump has been briefed by his secretary of state just back from young young NPR's Michele Kelemen has more\nSecretary of state Mike Pompeo is sounding upbeat about what he called the real progress he's making in talks with North Korea he's just back from his fourth trip there in less than a year\nWe can say about the world will achieve a oval what's in the fall of vital verify it resists your breath or one of the German Kim for the time that I got to spend with him where he got to talk about all the range of issues other emerging countries that will let us get there\nSomeday and says he expects to announce in short order when and where Kim Jong un and President Trump will meet again on bail spokesperson wouldn't say what the us hopes to get out of a second summit Michele ... NPR News the state department\nAre published report says longtime retailers Sears has brought on a company with experts in corporate restructuring the wall Street Journal reports Sears parent company could be close to taking strong actions to survive or protect its remaining assets it's possible that the Sears may be preparing to enter bankruptcy\nOn corporate Coleman NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nTaking a look now at the forecast fluffy partly sunny skies today with highs and the upper seventies it'll be mostly cloudy this evening long with a chance of rain with Lowes in the mid sixties or chance of rain is fifty percent\nShowers and thunder storms will likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with highs and the upper fifties\nThis listener supported public radio W. V. I. F. ... [noise]\nLike what you see on WB I a view enjoy fine programs like pull dark nova or nature\nYour kids love watching the ethics of Elmo on Sesame Street enjoy sit at the science cuter curious George how 'bout shows like call the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. V. I. A. [noise]\nWilliamsport symphony or the elected by maestro Edelstein opens October sixteenth works by Racine each ... Enron Grammy nominated in charge\nOr nature do your kids love watching the antics of Elmo on Sesame Street enjoy sit at the science kid are curious George how 'bout shows like called the doctor Pennsylvania ... or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a never today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. V. I. A. [noise]\nThe Williamsport symphony or conducted by maestro Edelstein opens October sixteenth works by Racine each ... Enron Grammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliam sports symphony October sixteenth that the community art center five seven zero three to six twenty four twenty four or Williamsport symphony dot org\nSponsors were not capital group that might come in college\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Rachel Martin in Washington DC we are watching yet another hurricane this time it's name is Michael and it is headed directly for the Florida Panhandle threats expected to make landfall later today the hurricane intensified overnight it is now a category for storm here's Florida governor Rick Scott yesterday\nThis storm is that do not take a chance to think about the destruction we've seen before with storms like Hurricane Irma the panhandle and then we'll likely see when the next one hundred and ten miles per hour stop and think about that one hundred and ten a car with\nToday worth noting when our clocking in at around a hundred and forty miles per hour NPR's Greg Allen is following the storm from Tallahassee and doing that now ... what does it look like at the window where you are\nWell it's still a we're still waiting for a sunrise here but it's where it's remarkably calm here still the storm is is this monster right offshore but we're just starting to feel the outer bands you know little little wind little rain\nBut or even in the right at the coast in Panama City and\nAnd ah areas like that where it's which where it's close to where it's gonna make landfall they're just starting to get the outer bands but it's a fascinating storm we should be seeing it here by this afternoon here in Tallahassee the main concern is all the trees we have here which are these big live oak trees with Spanish moss festooned on them\nAfter football ... got a master's degree from Howard University and eventually he went home helping to lead Indiana University where his journey began\nAnd\nThis is NPR News support comes from the University of Scranton to understand all that Scranton ... visited the campus experience the community with open house events Sunday October twenty first or Sunday November fourth she how one of America's premier colleges will open doors for you\nI just as Ari Shapiro host of all things considered when I'm hosting the show I'm always listening for the things that sticking the thing that jumps out of the radio and grabs you the thing that'll make you go home\nTo your spouse when your kid and a friend and say hey we'll never believe what I heard\nToday on all things considered listen every afternoon\nMonday through friday get four weekends and live on WB I Am found\n\nParliamentary disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDump form of lung disease including asthma bronchitis emphysema\n... genetic and inspections are factor\nFor why someone they develop one or more disease\nPulmonary disease every\nCount on the call a doctor\nThirty on WMBA ...\nNPR News classical\n\nBombing every disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDumb form of lung disease including asthma bronchitis and they seem a\nSmoking genetics and infections are long factor\nFor why someone they develop one or more disease\nCount on the commandant dark\nNPR News classical jazz and contemporary music on WB I HD one more of the best programs public radio has to offer um W. B. I. H. D. too and continuous jazz from the ... channel on WB I HD three all online at W. B. I. dot org\nTaking a look now at the forecast will see partly sunny skies today with hides in the upper seventies there'll be mostly cloudy this evening long with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent\nShowers and thunderstorms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties\nThis listener supported public radio W. V. I. A. F. ...\nSupport for NPR comes from the station and from T. I. A. T. I. A. is committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org from\nBattle a European made language learning program that teaches practical conversation and Spanish French German and other languages available in the app store or online at the ab B. E. L. dot com\nFrom constant contact with hundreds of customize a bill email template for small businesses to reach customers where they are every day there inbox learned more constant contact dot com\nAnd from Americans for the arts\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene state and federal investigators are still trying to figure out what caused that deadly limousine crash in upstate New York that left ... people dead on Saturday\nAs North Country Public Radio's Brian Mann reports officials say the company operating the limo had a history of failed inspections and violations\nSaturday afternoon a stretch limousine plowed through AT T intersection and scary New York's slamming into a parked car Robert Sumwalt chairman of the national Transportation Safety board tells reporters the crash was devastating\nA lot of damage engine compartment\nPush back into the front of the car certainly indications of of high energy impact\nThe driver and Seventeen passengers died along with two pedestrians one family lost four sisters alone with three of their husbands they were celebrating a birthday party somewhat says his agency job now is finding out why this happened and whether it reflects limousine industry problems\nIt's just the the most deadly transportation accident are crash that we've seen on us soil since February of two thousand and nine so uh it's it's definitely a something that we're very interested in\nInvestigators have started to release some information about the crash some old says there weren't skid marks on the road at the accident scene so it's possible the driver never hit the brakes major Robert had no with New York state police says it also appears he shouldn't have been behind the wheel at all\nThe driver dilemma did not have the appropriate license to operate that vehicle\nNew York governor Andrew Cuomo told reporters this week the limo failed state inspection last month but state and federal investigators say they don't\nSo uh it's it's definitely a something that we're very interested in\nInvestigators have started to release some information about the crash some old says there weren't skid marks on the road at the accident scene so it's possible the driver never hit the brakes major Robert had no with New York state police says it also appears he shouldn't have been behind the wheel at all\nThe driver dilemma that not have the appropriate license to operate ethical\nNew York governor Andrew Cuomo told reporters this week the limo failed state inspection last month but state and federal investigators say they don't yet know whether driver error mechanical failures contributed to the crash pat note says investigators are looking at the scene and the wreckage\nWere also a veteran of the airbag controller macho what would be considered vehicles black box\nThat was being analyzed for post crash that I\nHad no describes this as a criminal investigation and says a total of four vehicles owned by the company prestige limos have been seized under a search warrant he also confirms that the owner ... Hussein is currently traveling outside the u._s. in his native Pakistan\nThe NTSB is Robert Sumwalt says federal investigators plan to look hard at how the company operated\nRecords of prior clashes their management of drivers their fatigue management program vehicle maintenance driver fitness for dirty\nIt's been reported that one victim sent a text message Saturday before the accident complaining about the condition of the vehicle major pat note with New York state police says they're hoping to find other communication from passengers that may offer clues\nWe're asking that anyone who may have been in contact with the victims before the crash give us a call\nConcerns have also been raised about the safety of the intersection where this crash occurred an intersection that investigators say was recently modified the NTSB says their team will look at the new design of the road signage invisibility Brian Mann NPR News Westport New York\nThe fight over Brett Kavanaugh's nomination to the Supreme Court prompted a lot of discussion in all corners of American Life about sexual assault and specifically how young men are taught or not taught about consent\nJewish organization near Philadelphia has a program to talk about this and other difficult topics with teenagers NPR's Jeff Brady sat in with a group of young men\nIn the basement of a suburban Philadelphia home a half dozen high school freshmen boys are munching on ... and ... thirty five year old group leader Cody greenest introduces the week's topic raise your hand if you've heard of the me too movement\nHe's a volunteer with moving traditions which organizes conversations like this with thousands of Jewish teens around the country\nGreenest leads a discussion about historical power differences between men and women and how that can play out when it\nComes to ... do we believe that verbal consent as necessary\nBut one of the boys David Levin says it isn't always so simple he describes the situation on a bus where both people already said they're interested in each other and that girl purposely sits next to the boys\nThere and then she puts a blanket around you too and lays down I ... yeah exactly like how does it do you like grabs your hands or you can hold hands and stuff like those are signs you know\nThe boys discuss several different situations and most seem to conclude that getting verbal consent is the best choice moving traditions founder and CEO Deborah Meier says the goal is to give teens this space to arrive at the right answer with their\nWe aren't telling them this is how you need to behave and this is how you don't behave and we don't shame them for who they are we help guys uncover the tenderness and the connection and the joined themselves as a human being and develop for themselves a sense of ...\nSometimes you know the boys discuss several different situations and most seem to conclude that getting verbal consent is the best choice moving traditions founder and CEO Deborah Meier says the goal is to give teens this space to arrive at the right answer with their peers\nWe aren't telling them this is how you need to behave and this is how you don't behave and we don't shame them for who they are we help guys uncover the tenderness and the connection and the joined themselves as a human being and develop for themselves a sense of ethics and values and responsibility\nTalking about sexual assault and consent this way sound different from what a lot of people heard in the past University of New Hampshire sociology professor Sharon Potter says older generations might remember talks for incoming college freshmen\nWe have a play and name and then you know the capital and they went out and and he made and then we went ... and ... how did he made\nThe problem says Potter is that only a small percentage of men are perpetrators Potter says a more productive approach is to train bystanders how to identify someone who may be at risk of sexual assault and then how to intervene Potter says this is hard work but not impossible\nWe've already done [noise] hey anyway anti drunk driving\nDecades back most people were uncomfortable taking a friend's keys when they're too drunk to drive but after years of research and education programs the rate of alcohol related traffic deaths has been cut in half since the Nineteen eighties\nPotter says for sexual assault this kind of culture change is just getting started\nBut look around and you'll find examples one of the teenage boys meeting in the basement says that as a high school freshmen he's all ready to use the skills I have seen some stuff like a football game Matthew O'Donnell says he saw another guy touching the girl and trying to get into ... and\nHe wasn't sure it was a problem but just in case he made an excuse to separate them\nWhen I saw happening I was just kind of like oh I have to go to the bathroom in the bathroom was like on the other side of the stadium so I said come with me\nThe guy went with him and the potential problem was averted\nSharon Potter the sociologist says that's a perfect example of identifying a situation and then intervening she says more of that along with praise for people like O'Donnell could lead to the culture changed that results in fewer sexual assault in the future\nSo far there isn't much sign that Washington is exerting pressure in Riyadh Cosby us investigators to joined the pro are happening uh we'll see something like that occurs NPR's Peter Kenyon thanks bitter thanks\nOh\nThe largest oil company any lessons encouraging attacks on the dairy products it makes executives that Exxon Mobil and announce that the company will contribute one million dollars of the next two years to support a campaign for a tax on carbon based fuels so I kind of different because it's make on efforts to reduce the effects of climate change centrist terminology\nExxon Mobil contribution will support a group called Americans for carbon dividends an offshoot of the climate leadership council its aim is to raise the price of fossil fuels to reduce their use and cut the amount of climate changing carbon released into the atmosphere\nExxonMobil has voiced support for such a plan for years but Greg bird will send them to climate leadership council says the firm's financial contribution is a significant step\nThe first time in history that a U.S oil and gas super major has put significant\nExxon Mobil contribution will support a group called Americans for carbon dividends an offshoot of the climate leadership council its aim is to raise the price of fossil fuels to reduce their use and cut the amount of climate changing carbon released into the atmosphere\nExxonMobil has voiced support for such a plan for years but Greg brutal scent of the climate leadership council says the firm's financial contribution is a significant step\nIt's the first time in history that a U.S oil and gas super major has put significant financial resources behind a direct price on carbon\nIn other words a direct tax on carbon so brutal since group prefers to call it a fee not attacks more on that later\nBurgers and says Exxon Mobil support will make lawmakers more receptive to a carbon tax but you may wonder why there's an oil and gas giant like Exxon Mobil support a tax on his main products\nVerbal since says one big reason is that companies want regulatory certainty they want to know what the rules of the game will be and that's an unclear and the current environment\nWe're operating in what amounts to a game of regulatory thing on which you have one administration developing rules only to have the next roll them back\nAnother important reason Exxon Mobil supports the plan is that why would tax carbon it would also remove most existing regulations on carbon emissions bottles and says the carbon taxes group is proposing would be much more effective at reducing carbon pollution than the current regulations\nThe Americans for carbon dividends plan is based on a proposal from two Republican elder statesmen\nJames Baker the third and George ... both cabinet members in Ronald Reagan's White House one carrot for Republicans is that the revenue from the tax or fee would be fully ... to consumers\nBurton says the idea has received a positive reception from both parties on Capitol Hill\nWith Republicans in particular there's an increasing number of members of Congress on on the Republican side that are looking to seriously engage on this issue\nOf course many Republicans are skeptical about both taxes and climate change I think it is a step\nThat's Vin Weber a former congressman from Minnesota he's now a lobbyist and political consultant at Mercury Public affairs but ... says where the president and the White House who campaigned on reviving the coal industry passing a carbon tax will be very difficult\nI don't think there's any way of sugar coating it are Republicans today to embrace any new tax is difficult and since President Trump was elected particularly attacks that focuses on fossil fuels is even more difficult\nGreg brutal sudden acknowledges the challenges and says the carbon tax has always been viewed as a longer term effort\nNPR's John Ydstie on NPR News\nSupport for it all the VA comes from kings college get a closer look at King's College on Sunday October twenty first at their open house here's your chance to discover kings and experienced the campus community participate in presentations on financial aid study abroad\nCampus activities and much more lunch meetings with faculty and athletic representatives tours of campus will be available during the day don't miss King's College open house on Sunday October twenty first for reservations are more information call one eight eight eight kings PA or visit kings dot edu slash admissions\nHen a doesn't think elections are good for democracy is fundamentally flawed and I'm not sure if they could be his idea replace politicians with randomly selected citizens\n... study abroad campus activities and much more watch meetings with faculty and athletic representatives tours of campus will be available during the day don't miss King's College open house on Sunday October twenty first for reservations are more information call one eight eight eight kings PA or visit kings dot edu slash admissions\nBread him a doesn't think elections are good for democracy is fundamentally flawed and I'm not sure if they could be\nHis idea replace politicians with randomly selected citizen it works when people do people make from soup kitchens hacking the law and next time on the radio hour from NPR Saturday up new no W beyond a up out [laughter]\n[noise] Ninety seconds national [noise]\n\nHi there I'm saying Maynard several species of caterpillars have developed an interesting system for waste disposal the fire their fecal pellets a distance of up to forty times their body length away from their homes which is over a meter and a half\nA lot of animals distance themselves from their wage usually for reasons of hygiene other animals are known to use gas for surprising purposes\nLarval tortoise beetles file fecal shields on their backs to protect them from predators\nSome caterpillar species climb on the silk strings decorated with equal pellets which are known to stress the ... project from for math\nSkipper butterfly caterpillars are able to fire ... pellets by pumping up blood pressure directly under in a in a launching pad which extra rooted Segal pills rest\nOne scientists discovered this ... mechanism\nThey wondered about its purpose it ends up that fleeing their who is a defensive strategy to avoid predators detection through repeated experiments they learn the predatory was would use are intended to sniff out for a we're attracted to the ... and missed the caterpillar is more than fifty percent of the time\nThe Ninety second naturalist is a production of Cincinnati Public radio and the Cincinnati Zoo with support from Cincinnati Public radio member to spread the good news of the natural world [noise]\nSupport for NPR comes from the station and from transfer wise a service that helps people send money internationally three million people and businesses you transfer wise to send or receive and convert currencies in more than Seventy countries more transfer a wide dot com or from their app\nAnd from gobble ... company that delivers semi prepped meals to be finished at home in Fifteen minutes with one hand gobbled sous chefs do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin you've seen the family at a restaurant time guessing they're all sitting there waiting for their food heads down each person staring at their respective electronic device hey maybe you've even been that family\nAuthor Tommy ... observed this exact situation not not that long ago at a local restaurant where he lived in New Hampshire\nThere were on their devices that weren't even talking to each other and I thought oh you know we we've got to stop and be quiet\nAnd in that moment Apollo was inspired to create a new picture book it's called quiet and it's full of colorful illustrations of kids playing it also takes the same children learning how to be still it's a very simple story that begins with an old man enjoying the outdoors with his grandchild\nWith the children and everything is everything is is you know the birds are flying\nI'm sure there were on their devices that weren't even talking to each other and I thought oh you know we've we've kind of stop and be quiet\nAnd in that moment Apollo was inspired to create a new picture book and it's called quiet in and it's full of colorful it'll illustrations of kids playing it also takes the same children learning how to be still it's a very simple story that begins with an old man enjoying the outdoors with his grandchild to\nEase walking with the children and everything is everything is if you're the birds are flying freezer wrestling you know the dog is running around uh originally I was having people running playing ball and\nAnd um he says my on my everything is so busy and and the children notice how busy everything is and he's he's a bench she says\nLet's just sit down here for a minute and everything becomes ill and if you live in a country like I Do there is a time of the day when everything does just become ill\nSquirrels stopped looking for not the crow stop fighting this girl's the you know the freestyle wrestling\nAnd he he invite you to children who come close to him and to just think it'd be quiet ... and um it don't have to do anything else but that\nBut there's so much in there I mean these children are sitting on the bench and there\nI'm In the quiet with the grandfather mhm and then things happen the little girl says I can think when I'm quiet rice and the little boy says I can see when I'm Still right oh man I just had to like\nThat [laughter] so\nPoignant in this moment here there's not a lot of seeing thinking a lot of times in our public discourse anymore and both leaders right awful lot of noise\nGot yup I've been I've been in the business of doing books for children for over six years or almost six years I guess I see so many changes and um\nYou know and I've never done what you might call a message book could I don't and I didn't start this I don't think this is a message book I think this is a book about but I feel\nWhere is the easiest place for you to create stillness oh well I think that the wonderful thing is that I can find places wherever I Am to get into that sitting\nEverybody can do this you know even ... yeah oh yeah I think so when you sit in and suddenly aren't doing anything your mind just takes over like a rollercoaster ride\nYou know it just builds a film our minds are filled with so much that we just have to let all those thoughts go which is easier said than done it's very hard to let a thought go and we get it in our head\nPar medical products and medical testing where this stuff really does have\nTo work the first time in New York I'm David Brancaccio with the marketplace morning reporting\nMaybe I Am American public media\nScranton area foundation president and CEO of learning to Jesse ... Scranton area community foundation our mission is to enhance the quality of life for all people in Lackawanna county to the development of organized philanthropy\nIn twenty six teams we were able to provide over one million is funding for the second year in around ... would not have been possible without you please visit ... at S H ... n dot org and together we can do even more in the years to come we are your community foundation for today for tomorrow forever [noise]\nIs W. V. I. eighty nine point nine FM W. V. I. H. D. one scratching Wilkes Barre Hazelden W. B. Y.\nThe trustee at the Scranton area community foundation our mission is to enhance the quality of life for all people in Lackawanna county to the development of organized philanthropy\nIn twenty sixteen we were able to provide over one million in funding for the second year in around Dick achievement would not have been possible without you please visit at S. A. S. P. N. dot org and together we can do even more in the years to come we are your community foundation for today for tomorrow forever\n[noise] this was W. V. I. eighty nine point nine FM W. B. I. H. D. one scratch and ... and ... points out that Williamsport WTO eighty eight points ... Mansfield WPRI you Ninety One point five FM ...\nAnd ... how to universities WG su ... grow\nWe have a translator in sun buried what five point seven this was your arts and information station listener supported public radio W. V. I.\nS. who\nGood morning now that Nikki Haley has announced her resignation as ambassador to the un President Trump is weighing her replacement will look at who might take her place coming up\nWith our MORNING EDITION from NPR\nThis hour we'll hear from a top Democrat on the Senate Foreign Relations Committee about what Haley departure means for the Trump Administration complicated relationship with your way and I'm David Greene\nAnd I'm Rachel Martin President Trump announced plans to lift certain restrictions on ethanol in gasoline that may help Iowa corn\nFarmers what are the other one\nAlso how the fight over Supreme Court justice ... playing out in the west Virginia Senate race and doctors are finding some people suffering\nIt's Wednesday October tenth Stanley Ron front\nHalen turned sixty four news this next\nLive from NPR News in Washington I'm corporate Coleman the northern Gulf Coast of Florida is brace for a direct hit from a major hurricane today NPR's Debbie Elliott reports hurricane Michael in strength into a category ... storm with winds of one hundred forty miles per hour\nMichael brings damaging when heavy rain and the storm surge that's four cats to be between six and Thirteen feet high along the Florida Panhandle and the state's Big Bend area governor Rick Scott says that much water pushing a short is life threatening\nI cannot stress enough how dangerous this storm surge will be\nMore than a hundred thousand residents and tourists were ordered to evacuate from beaches and other low lying communities\nIn the Gulf of Mexico the bureau of safety and environmental enforcement reports that energy companies have evacuated at least Seventy five offshore platforms shutting at about forty percent of the Gulf Oil production and nearly thirty percent of natural gas output Debbie Elliott NPR News quest to be a Florida\nPresident Trump held a political rally in Council Bluffs Iowa last night campaigning for Republicans he\nSpent time condemning Democrats who opposed new Supreme Court justice Brett Kavanaugh\nLast week this will impeach him [noise]\nBesides that I have to go first right don't I [noise]\nEven though we've done nothing wrong\nOther than what are the greatest economies in the history of our [noise] early voting\nIs now underway in Iowa efforts are winding down to reunite thousands of migrant children taken from their parents at the border of according to a federal judge in San Diego who ordered the family reunification Z the judge also gave preliminary approval to a settlement on family separations from member station KQED\n[noise] besides that I have to go first right don't [noise]\n[noise] oh we voting\nIs now underway in Iowa efforts are winding down to reunite thousands of migrant children taken from their parents at the border according to a federal judge in San Diego who ordered the family reunification Z the judge also gave preliminary approval to a settlement on family separations\nFrom member station kinky weedy Julie small has more\nThe agreement between the American civil liberties union and the government let migrant children and parents who are still in the United states re apply for asylum but four hundred parents who were deported mostly to Guatemala and El Salvador must choose whether to reunite with their children at home or leave them in the U.S the ACLU attorney legally aren't\nThere arguing over the decision like any parent word but they are simply to society that it's too dangerous for their child to come back\nOne hundred children will be reunited with parents in their home countries another forty kids will be reunited with appeared in the U. S. but two hundred children face an uncertain future because the government determine their mother or father was unfit to regain custody for NPR News I'm Julie small\nA new report from a watchdog in the U.S government Accountability Office finds cyber security problems with the Pentagon's latest weapons systems common problems include passwords that are easy to change the report cites Pentagon officials who say these checks are\nUnrealistic you're listening to NPR\nNew research on child birth signs current guidelines for first time others are outdated NPR's Patti Neighmond reports on the study in the journal of the American Medical Association\nIf you're a first time mom who has an epidural chances are you'll be coached to the lake pushing the baby down the birth now even after your services completely dilated the ideas to give a rat's before initiating active labor and avoid it says Erin\nIn this study researchers enrolled more than twenty four hundred women half were coached to push right away half were told to wait about an hour it turned out there was no difference and that smell delivery between those who pushed right away and those who waited and those who waited had an increased risk of infection and excessive bleeding after delivery\nBased on the finding the American College of obstetricians and gynecologists is changing its advice and now recommends first time others pushed immediately once the cervix as dilated Patti Neighmond NPR News\nOfficials in New York state say the limousine that crashed over the weekend killing twenty people had failed and inspection last month\nNew York state police say the driver also did not have the proper license to operate the limo he was killed in the crash relatives of the drivers say he was unaware he'd been assigned an unsafe vehicle\nOfficials in Kenya say at least fifty people have been killed after a bus tumbled down the slope and crashed in the western part of that country the roof of the bus was torn off children are among the dead officials said there are Fifteen survivors who were going for medical treatment\nAt a hospital [noise] I'm more of a ... NPR News in Washington\nSupport for NPR terms from NPR stations other contributors include Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nTaking a look now the forecast won't be partly science guys today with high in the upper seventies there'll be mostly cloudy this evening along with the chance of rain with Lowes in the mid sixties or chance of rain\nColeman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Roma knows a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nTaking a look now at\nThe forecast lucky partly sunny skies today with hides in the upper seventies there'll be mostly cloudy this evening along with the chance of rain with Lowes in the mid sixties or chance of rain is ... percent\nShowers and thunderstorms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunderstorms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties\nThis listener supported public radio W. V. I ...\nIt doesn't take long to become addicted to opioids in fact Thirteen Pennsylvanians die from them every day [noise] Geithner is committed\nTo ending opioid addiction with those prevention and treatment in the last three years we've reduced the amount an opioid we prescribe like fifty percent\nAngelina opened three medication treatment centers to help patients recover from attacks and\nLearn more guys died or if I had enough\nThis is Ari Shapiro host of all things considered an everyday that I'm hosting the show I sit in the studio for at least two hours while the show is alive and when I can leave the studio at the end of those two hours and say that we really talk to some place we told you what was happening that was important\nWe showed you what was happening that was delightful we surprised you we kept you engaged\nThen I feel like we had a really good day all things considered listen every afternoon [noise] Monday through friday get four weekends at five this is\nMORNING EDITION from NPR News I'm Rachel Martin in Washington DC\nAnd I'm David Greene in Culver City California President Trump says he is going to work quickly to find a replacement for Nikki Haley as US ambassador to the United nations ... departure yesterday morning President Trump was alongside her at the White House\nWell we have a number of people that would very much like to do is a great position to Nikki realize she's uh she's I think she's making a much better position\nNow Haley is not leaving immediately she's going to stay on through the end of the year but this does mean at some point they'll be another high profile confirmation hearing in the Senate a chance for Democrats to weigh in on the president's foreign policy democratic Senator Chris Coons of Delaware is one of those Democratic senators and he joins us this morning welcome senator\nThank you David good morning so you are one of only four senators to oppose Nikki Haley's um confirmation yesterday you said that she has helped move U.S interests forward at the United nations what does change your mind about er well I voted against\nA than a governor Nikki Haley because she had very little virtually no foreign policy experience a and she did not impress me and her confirmation hearing as having the relevant experience to be our lead spokes person at the United nations\nThis is NPR News support comes from a while for say October's national seafood ... meal plan that includes fishes heart healthy one\nFor salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more while for salmon dot com\nThanks to many regional business leaders\nThis is NPR News support comes from ... percent October's national seafood ... I'll be a plan that includes fishes heart healthy one while for salmon specializes in Alaska sockeye salmon\nBut carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com\nWB I thank the many regional business leaders support or non profit public service mission to learn how your business can sponsor NPR News and other favorite programming bleach called five seven zero six zero to eleven thirty seven I\n\nLove is in the air as the Arcadia corral opens with season women conflict with a romantic and all of us enjoy your program touching on many aspects of law long for law found face willing fickle there are two performances Saturday October twenty seven to seven thirty PM at St Nicholas churches Wilkes Barre\nAnd Sunday October twenty eight that for the um [noise]\nI first Presbyterian Church Clark signed for tickets\nGo to Arcadia corralled on Dr Steven Thomas conduct the Arcadia corral in love song [noise]\nW. B. I celebrate hundreds of regional art and cultural organization for details and many more events check the w._b. I ate\nArtsy talented and catch up on our blog at a W. V. I. dot org slash ... listen for art scene with Iraq a funky weekday mornings after the news at eleven on W. V. A. F. out\nTaking a look now at the forecast Locy partly sunny skies today with hides in the upper seventies there will be mostly cloudy does evening long with a chance of rain with Lowes in the mid sixties our chance of rain is fifty per cent\nShowers and thunder storms will likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunder storms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with high in the upper fifties\nThis listener supported public radio W. V. I. F. ...\nSupport for NPR comes from the station and from universal pictures presenting the new film first men from Damien ... director of la la land and whiplash and starring Ryan Gosling and Claire foie in theaters and IMAX friday\nFrom the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that helps them thrive ... verified dot Gov slash go\nFrom para data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from the listeners to support the NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene more than five million Americans every year for critically ill and end up in an intensive care unit\nAnd doctors are now coming to realize that as many as half of the people who've been rushed to be ICU for a medical emergency will go on to suffer serious mental problems like dementia there's more from NPR's Richard Harris\nRichard Langford is sixty three year old retired minister who lives with his mother in east Nashville, Tennessee he says his medical saga began a decade ago\nIn two thousand eight hour when and because I was playing tennis with the un ab fab euro and uh she\nThere are now coming to realize that as many as half of the people who've been rushed to the ICU for a medical emergency will go on to suffer serious mental problems like dementia there's more from NPR's Richard Harris\nRichard Langford is sixty three year old retired minister who lives with his mother in east Nashville, Tennessee he says his medical saga began a decade ago\nIn two thousand eight hour when end because I was playing tennis with the un ab fab euro and uh she\nThe mob but and so I wanted fresh nice to help me fly better\nBut after that routine knee surgery lying for developed a lung infection which sent him to the intensive care unit he had developed sepsis a life threatening condition sometimes called blood poisoning\nAnd all he remembers from his delirious weeks in the hospital was near death experience asked song drinker I asked us how\nAll the other side of a river\nIt looks like the original lodge a larger the profit who's miracles included resurrection of the dead\nHis mother leader says at one point to hospitals staff were so sure he would die overnight they didn't even bother to pass on his medical chart to the day shift\nAnd the thing that's amazing is his talking to us and he's like being aware of what we were saying and yet then not knowing and not remembering any of that for I Would say it ... we were at the rehab are bad for weeks\nNow a decade later Richard Langford says he's still struggling to work its way out of a ticket that's physical emotional and cognitive though he's still reads the New Yorker and remains active in politics he says sometimes he feels like he's lost in a vast forest\nAnd it is flourishing and there's the the water is is a big there's waterfalls and there are all kinds of animals around and that farce is kinda surrounding me\nAnd I can't get out I Can't I don't know how to get out\nHis mother who is now eighty nine years old is helping him through by among other things managing his medications\nNow this last time they when he went into the hospital they changed out a strong medication often and took him off of that and put him on the L ugly so each morning I change and the evening and what I'm doing I'm taken one medicine at and putting another one in\nThe lying for are grateful to get support from a clinic at nearby Vanderbilt University which has pioneered efforts to understand and treat patients like him this is a huge problem doctor was really an intensive care specialist heads that effort he\nSays post ICU syndrome effects thirty to fifty percent of all patients who are in the ICU due to a medical emergency even younger people\nI mean you you have somebody coming into the ICU\nWith a previously ... very well working brain and they leave critical care not being able to have a good conversation they can't balance a checkbook they can't\nFind the names of people at a party and they get very embarrassed when they start socially secluded in themselves are patients tell us what a misery this form of dementia is it permanent\nIt's permanent in some we've been following people for over ten years now from the brain tissue study which we did here at Vanderbilt and many of them a decade out still have elements of the dementia\nOverall he estimates that a third improve a third stay the same\nCare not being able to have a good conversation they can't balance a checkbook they can't find the names of people at a party and they get very embarrassed when they start socially secluded in themselves are patients tell us what a misery this form of dementia is it permanent\nIt's permanent in some we've been following people for over ten years now from the brain ICU study which we did hear at Vanderbilt and many of them a decade out still have elements of the dementia\nOverall he estimates that a third improve a third stay the same and the third end up on a slow decline for many the mental damages akin to a traumatic brain injury re Alzheimer or even sometimes Alzheimer itself\nThese problems are linked to the degree of leery um people experience well in the ICU ... says\nEvery day you're delirious you have about thirty five percent increased risk of this dimension so if you do the math on that three days of ... you got a almost a sure thing that you're going to have some elements of the dementia\nHe can't say exactly why delivery of leads to dementia but he has develop strategies to sharply reduce delivery him in his ICU we have a separate story about that later today on all things considered and available online\nBut for those patients who are already facing these issues it's more than just about memory and focus Joanna starlings or clinical pharmacist is part of the team at the clinic that sees these patients\nUnfortunately a lot of the patient than they're aiming at very depression anxiety ... to ... and cognitive impairment\nThese are often treatable conditions especially the anxiety and depression\nMaking getting the affair back in time to get private we can even picking my medication to help with that is well\nVanderbilt is now helping a few dozen hospitals around the country establish clinics like this she says the unmet need is enormous the clinic in Nashville has gradually helped Richard Lankford to recover some of his routines for example the day before I visited him he said he'd been able to go out\nAnd vote in a local election\nI was able to get in the car\nGo that route precinct which is maybe a half now and then as they come back the far I got a little bit smaller\nHis mother lead it knows there are challenges ahead but her faith keeps her ...\nYear here today I'm here today so less enjoy today and tomorrow it'll take care of itself\nOne great source of joy for them both is music Richard plays piano in Oregon as does his mother and he loves to sing she sits down at the piano and pulls out one of his favorite him so\nThat you love them back to la la\nLa oh no that jeeze ah nah I'm On\nThe leader says the clinic ... adjusted music would help him recover so over the years she's coached him to the keyboard\nHappily music is one skill Richard held onto throughout his medical ordeal\nAnd I'm a bunch of ... and Richard Harris NPR News\n... ... ...\nI'm Richard Harris NPR News\n... ... ...\nOnly one Democrat voted to confirm Supreme Court justice Brett Kavanaugh here with Senator Joe Manchin of West Virginia mentioned faces a political reality his state is getting more dominated by Republicans\nOnly one Democrat voted to confirm Supreme Court justice Brett Kavanaugh here with Senator Joe Manchin of West Virginia mansion faces a political reality state is getting more dominated by Republicans and he's in a tight race against the state's Republican attorney general Patrick Morrisey\nBut there are doubts about whether supporting Kavanaugh is really going to help mansion on election day here's West Virginia public radio message\nAs mentioned stood on the Senate floor to cast his vote to confirm Kavanaugh on Saturday protesters yelled shame from the gallery\n[noise]\nBeen surging it on order and\nBy that evening assigned saying shame on mansion hung over mansions office back in West Virginia state capitals Charleston and the run up to the vote Jamie Miller was arrested while protesting at his campaign office\nMiller who's an artist also went to Washington with a group of sexual assault survivors to meet with mansion she says she was a tentative and listen to their concerns\nBut after last weekend's vote she's not sure what you do when election day\nI didn't vote for him um during the primary but\nThe ad that a friend in the past and now I'm really on the fence about what to do\nTurn Ireland is a Charleston city councilwoman she says she's always recognized that mentioned is new liberal but his defended him in the past\nI have been a person who has been the person to say to someone\nThat we need to recognize that West Virginia Democrats are more conservative that we're a state with an aging population and that you know Joe Manchin is better than his opponent\nBut after Kavanaugh's confirmation Arlen says she won't vote for mentioned in November Emily comer came to a similar decision she's a public school teacher even the west Virginia Public school teachers went on strike earlier this year and the teachers union support mansion ... leave her ballot blank\nI absolutely will not be voting for senator mansion in November I won't be voting from Patrick Marcy either I Would never vote for him but um I just we don't have a candidate that it's going to fight for us\nAll three women so they hope the next Democratic Senate candidate from West Virginia will be more progressive the mansion he frequently breaks ranks with his more liberal democratic colleagues in the Senate for my computer that voting record is a sign that mentioned as an independent thinker computer was a democratic state lawmaker for mansions home in Marion County\nJoke kind of wait out what he called the majority West Virginians wanted him to do and and and he did that he acted accordingly or some people are going to be happy about that and some slowing me mad about it but you know you can't throw the baby out with the bathwater as they say you know we were never going to agree\nA hundred percent of the time with anybody\nBut computers as mentioned isn't likely to win any votes for more conservative independent or not affiliated voters with his vote for cabinet\nAnd computer believes mansion has certainly lost some support for progressive Democrats after this weekend\nMentions future now hinges on whether voters feel so strongly about his vote for cabin all that they abandoned him or if they want to continue the state's tradition of sending moderate Democrats to Washington for NPR News I'm Dave message in Morgantown West Virginia [noise]\n\nFor more conservative independent or non affiliated voters with his vote for Kavanaugh\n... believes mansion has certainly lost some support from progressive Democrats after this weekend\nMentions future now hinges on whether voters feel so strongly about his vote for cabinet that they abandoned him or if they want to continue the state's tradition of sending moderate Democrats to Washington for NPR News I'm Dave let's ditch in Morgantown West Virginia [noise]\n\nThis is NPR News\nYour membership support enables our region to enjoy your quality of life classical jazz in contemporary music and other favorite\nProgramming thank you for your public radio possible don't use the I\nUsed the program [noise]\nIt's been said that there are a few new music in the gym or symbols to inspire and instruct our generation I'm ... and this is the pulse of\nThe planet with the help of Warren lines one of the chiefs of the owner dog accounts over six nation Europe what confederacy [noise] we'd like to offer a metaphor for\nImagine that you're part of a heard I heard a buffalo [noise]\n\nThey heard the human her to know like a herd of buffalo\nHas very restless now the whole herd is wrestling and moving they're not sure the scout oath on the outside see very clearly the danger\nBut in the area of the herd on they feel it and that's the way the human being found out there that center on certain and then do something about and it's yet to come directly to them from the scouts out there whose job it is to watch for the protection up to her and to get that information back\nIt's yet to reach the her fully what that information in danger is so I'd say that's where we are right now where we are in great danger therapist's office going to continue\nTo do what is going to do whether we're here or not it's not going to be an end of the world as only be the end of being probably better for the world actually I mean then that can regenerate and the green can come back again and everything will develop again you know peacefully and Kim\nI'm kind of a human being began to populate like they're going to one of the laws as that no single element of life [noise]\nKansas populate endlessly and that includes the human being and that's what we're doing now or displacing all kinds of live all over\nThis [noise] this archival ... as part of our thirtieth\nAnniversary celebration you want to hear more check out our podcast I'm Mr and Mrs the pulse of the planet\nSupport comes from the University of Scranton to understand all that scratching has to walk her visit the campus experienced the community with open house events Sunday October twenty first for Sunday November fourth see how one of America's premier colleges will open doors for you\nSupport for NPR comes from this station and from Amazon Prime video presenting the return of the man in the high capital where American history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nFrom lifelong life luck with Norton works to help protect identities and the information on devices from cyber criminals learned more life lock dot com\nAnd from the Pew Charitable trusts celebrating Seventy years\nHer fourth see how one of America's premier colleges will open doors for you\nSupport for NPR comes from this station and from Amazon Prime video presenting the return of the man in the high capital where Americans history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nFrom life long life luck with Norton works to help protect identities and the information on devices from cyber criminals learn more life locked dot com\nAnd from the Pew Charitable trust celebrating Seventy years of serving the public learn more at ... dot org slash Seventy\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Rachel Martin for the third year\nIn a row the Los Angeles Dodgers are playing for a spot in the world series a couple of the team's star players are Cuban now a new report in Sports Illustrated lays out the dubious ways that some of those players make it to the U. S.\nThe Dodgers have long had a very rich pipeline to the Caribbean and to Cuba and one document that we cited in in the article they at some point had an internal ranking system of just how corrupt some of their own scouts were\nAs I executive editor John Wertheim says that at one point the Dodgers called one of their own employees unbelievably corrupt or if I'm told me that in order to get access to top baseball talent in Cuba teams often go through agents called boost counties\nThe ... is a middleman base in Latin America who essentially take equity stakes in prospects sometimes it can be forty fifty sixty percent of future earnings but for prospects desperate enough that's a that's a rip undertake\nAnd now it might be a legal risk according to Sports Illustrated the Justice Department is investigating whether some teams broke federal corruption laws to sign Cuban players\nExtraction of Cuban players has always been shrouded in mystery in baseball but this evidence that the FBI was presented with and we were as well indicates that ah that the complicity runs potentially teams in agents as well as the middle man the ... that have always been implicated in this\nAnd it is it basically impossible for a baseball player in Cuba to find his way into the the major leagues without help from one of these middle man\nIt's very difficult part of that is\nBecause of the embargo of Cuba and a player must establish residency in another country usually in the Caribbean or Mexico before coming to the U.S [noise] so what you have is a network of the street level agents that really have been operating outside of\nAnything that the u._s. or major league baseball history addiction over\n[laughter] so you obtained these documents that are ... you say offer a window into how baseball teams operate in Latin America especially in Cuba can you explain what you found him what a chess\nWe were given a hundreds and hundreds of pages of documents that were also turned over to the the FBI just off the what it shows is that teams and agents have what seems pretty clear from the documents any way on a level of complicity and in some cases that's scouts on the cake and in some cases that is about\nHelping to arrange documents using outside counsel to\nEssentially falsified documents and one does think that this is something that could implicate teams in major league baseballs and institution which is something that hasn't really happened before this is the first time so far as we can tell where you have this level of documentation\nClearly I mean as you've articulated this has been somewhat of an open secret for for generations really but now that you have the documents that allegedly showed some of this I'm dubious recruits\nThat is about helping to arrange documents using outside counsel to\nEssentially falsified documents and one does think that this is something that could implicate teams and and major league baseball as an institution which is something that hasn't really happened before this is the first time so far as we can tell where you have this level of documentation\nClearly I mean as you've articulated this has been somewhat of an open secret for for generations really but now that you have the documents that allegedly showed some of this a dubious recruiting behavior do you watch these players on these games differently\nMade with corn right now the EPA prohibit the sale of gasoline blended with Fifteen Percent ethanol commonly called ... Fifteen during the summer months not anymore says President Trump\nWere going with the Fifteen year round [noise]\nThe changes to give more Midwestern corn farmers who have suffered in the president's trade war more demand Trump was also in Iowa to motivate his supporters to vote for Republicans with tough races in the state governor Kim Reynolds man congressman David Young\nThe president also praised Iowa Senator Chuck Grassley who chairs the Senate Judiciary committee for his role in confirming Supreme Court justice Brett Kavanaugh for NPR News I'm Clay masters in Council Bluffs Iowa\nNow that Brett Kavanaugh has been sworn in as a Supreme Court justice abortion rights groups are gearing up for what they expect to be a more difficult fight in the years to come Planned Parenthood is unveiling a new strategy designed to prepare for the possibility that roe versus Wade could be overturned NPR's Sarah McCammon has more\nWith the candidate on the court abortion rights opponents see a new opportunity to weaken or overturn roe the Nineteen Seventy three decision that legalized abortion nationwide Planned Parenthood's Don McGahn said abortion rights advocates expected increasingly difficult environment\nAlready women across this country have to access funding they have to access transportation they have to access housing that have to access support\nNetworks Planned Parenthood officials say they will focus on shoring up abortion rights in state legislatures expanding access in states with more liberal abortion laws and reducing stigma surrounding abortion Sarah McCammon NPR News\nIn major league baseball the Boston Red Sox are going to the American league championship series they beat the New York Yankees last night in New York four to three the red Sox will now meet the Houston Astros for the first game and the ale championship on Saturday Night you're listening to NPR\nThe first African American drafted by an NFL team has died as NPR's Tom Goldman reports the former running back to the teams included the Baltimore Colts and the Philadelphia Eagles was Ninety One years old\nGeorge tele pharaoh was a star running back for Indiana University in the Nineteen forties Chicago took tele pharaoh in the Nineteen forty nine draft but he'd already agreed to play in the rival all America football conference after\nThat he played six years in the NFL and was named to the ... three times tele Ferris of the thing is like most about football was hitting people because it let them vent his frustration about discrimination he told the Indy started in Nineteen forty seven he went to a segregated movie theater in Bloomington and took down the colored sign in the balcony\nThat I took a screwdriver with me and to this side and put it in my pocket at I've hated their refer\nBeyond football tell a pharaoh taught and worked in the administration at several universities Tom Goldman NPR News\nThe American Music Awards have been handed out to the winners of fan favorites the twenty Eighteen artist of the year was pop singer Taylor Swift she thanked her fans and friends and then had a request\nWard and everything to ward given out and I were voted on by the people you know what\n\n[laughter] [noise]\nThat audio is courtesy of the American Music Awards swift picked up three other prizes among other winners the best female country artist was Carrie Underwood the best meal was Cain brown this is NPR\nSupport for NPR comes from NPR's fish and other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane\n[noise]\n[laughter] [noise]\nThat audio is courtesy of the American Music Awards slipped picked up three other prizes among other winners the best female country artist was Carrie Underwood the best male was Cain brown this is NPR\nSupport for NPR comes from NPR's fish and other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Aaron Eckhart Christina Hendricks and Isabel who pair premiering October twelve on prime video\nTaking a look now at the forecast will see partly sunny skies today with high in the upper seventies there'll be mostly cloudy this evening long with the chance of rain with Lowes in the mid sixties our chance of rain is fifty percent\nShowers and thunderstorms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunder storms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with ice in the upper fifties\nThis listener supported public radio WVU I found\nIt through the support of listeners like you that W vi is able to provide the excellent programming you enjoy daily learn more about membership at our website W. B. I. I. dot org signed up today and thanks from all of us at ... I I\nAm a Christian Bailey from life from here with Chris dealing\nWe're proud to be the highest rated to our live musical comedy variety show on public radio in this time slot [noise] do it in this weekend for our show in college leader in Saint Paul Minnesota with the school are rather miss Madison Cunningham\nAnd dirty projector fly from here we make great radio\nSaturday Night at six Sunday night at eight on W. V. I. A. F. N. [noise]\nSupport for NPR comes from Pennsylvania wads October SPA wind month celebrating Pennsylvania's locally grown crafted wind with special things to do taste and discover all across the state more information can be found P. A. Y. monster dot com\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Rachel Martin in Washington DC we are watching yet another hurricane this time it's name is Michael and it is headed directly for the Florida Panhandle that's where it's expected to make landfall later today the hurricane intensified overnight it is now a category for storm here's Florida governor Rick Scott yesterday\nThis storm is that do not take a chance to think about the destruction we've seen before with storms like Hurricane Irma the panhandle and then we'll likely see when the next one hundred and ten miles per hour stop and think about that one hundred and ten miles per hour with\nToday Windsor clocking in at around a hundred and forty five miles per hour NPR's Greg Allen is following the storm from Tallahassee and joins us now Greg ... what does it look like at the window where you are\nWell it's still ah we're still waiting for a sunrise here ah but it's where it's remarkably calm here still this storm is is this monster right offshore we're just starting to feel the outer bands you know little little wind little rain\nBut or even in the right at the coast in Panama City and\nAnd ah areas like that where it's which words close to where it's gonna make landfall they're just starting to get the outer bands but it's a fast moving storm we should be seeing it here by this afternoon here in Tallahassee the main concern is all the trees we have here which are these big live oak trees with Spanish moss festooned on them\nBut uh even in the right at the coast in Panama City and\nAnd uh areas like that which which words close to where it's gonna make landfall they're just starting to get the outer bands but it's a fascinating storm we should be seeing it here by this afternoon here in Tallahassee the main concern is all the trees we have here which are these big live oak trees with Spanish moss festooned on them\nAfter football ... got a master's degree from Howard University and eventually he went home helping to lead Indiana University where his journey began It's MORNING EDITION from NPR News supporting WBAI\nAfter football ... got a master's degree from Howard University and eventually he went home helping to lead Indiana University where his journey began It's MORNING EDITION from NPR News\nSupporting ... the pine senior living in a large sum of providing solutions for seniors wishing to remain independent meetings of assistance with daily living the pines locally owned and managed provides hands on care focused on the beach resident applied to collect some a dot com or our family cares for yours\n[noise] next time on ask me another actor Diane Guerrero talked about her writing process and immigration activism\nI thought maybe my voice could be an asset um I Know what this feels like I Know what family separation is so I decided okay I'll race and things the news the needle in any way\nThe joined me up your iceberg for NPR's our puzzle word games and trivia\nSaturday at all that but I Am on W. V. I. A. F. at\nPalm and every disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDumped form of lung disease including asthma bronchitis and his name\nMilking genetics and infections are long factor\nFor why someone they develop water more disease\nPulmonary disease every\nCount on the call a doctor\n... support for WBAI comes from loser and County Community college now and rolling for the winter and spring semesters with more than one hundred degrees the area's lowest tuition and easy transfer to four year colleges loser and we'll get you ready for success more information at ... dot edu\nTaking a look now at the forecast Locy partly sunny skies today with highs and the upper seventies there will be mostly cloudy this evening long with a chance of rain with Lowes in the mid sixties or chance of rain is fifty per cent\nShowers and thunder storms are likely on Thursday with eyes in the mid seventies or chance of rain is Ninety percent will see an eighty percent chance of showers and thunder storms on Thursday night with Lowes in the upper forties and friday looks mostly sunny with highs and the upper fifties\nThis listener supported public radio W. V. I. ...\nSupport for NPR comes from the station and from it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track building work better together more at outlast CNN dot com\nFrom zoom zoom offers cloud video conferencing online meetings and a video conference room solution in one platform featuring digital video and audio with screen sharing account registration and more at zoom dot us\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email temple it's a drag and drop email editor and twenty four seven customer service more at campaign monitor dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene state and federal investigators are still trying to figure out what caused that did lead limousine crash in upstate New York but left ... people dead on Saturday\nAs North Country Public Radio's Brian Mann reports officials say the company operating the limo had a history of failed inspections and violations\nSaturday afternoon a stretch limousine plowed through the intersection and scary\nAnd twenty four seven customer service more at campaign monitored dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene state and federal investigators are still trying to figure out what caused that deadly limousine crash in upstate New York to lift twenty people dead on Saturday\nAs North Country Public Radio's Brian Mann reports officials say the company operating the limo had a history of failed inspections and violations\nSaturday afternoon a stretch limousine plowed through AT T intersection and scary New York's slamming into a parked car Robert Sumwalt chairman of the national Transportation Safety board tells reporters the crash was devastating\nA lot of damage engine compartment\nPushed back into the front of the car certainly indications of of high energy unpacked\nThe driver and Seventeen passengers died along with two pedestrians one family lost four sisters alone with three of their husbands they were celebrating a birthday party someone says his agency job now is finding out why this happened and whether it reflects limousine industry problems\nIs is the the most deadly transportation accident are crash that we've seen on us soil since February of two thousand and nine so uh it's it's definitely a something that we're very interested in\nInvestigators have started to release some information about the crash some old says there weren't skid marks on the road at the accident seem so it's possible the driver never hit the brakes major Robert had no with New York state police says it also appears he shouldn't have been behind the wheel at all\nThe driver dilemma did not have the appropriate license to operate a vehicle\nNew York governor Andrew Cuomo told reporters this week the limo failed state inspection last month but state and federal investigators say they don't yet know whether driver error or mechanical failures contributed to the crash pat note says investigators are looking at the scene and the wreckage\nWere also in possession of the airbag control macho what would be considered of eagles black box\nAs being analyzed for post crash data\n... describes this as a criminal investigation and says a total of four vehicles owned by the company prestige limos have been seized under a search warrant\nHe also confirms that the owner ... Hussein is currently traveling outside the u._s. in his native Pakistan the NTSB is Robert Sumwalt says federal investigators plan to look hard at how the company operated\nRecords of prior clashes their management of drivers their fatigue management program vehicle maintenance driver fitness for duty\nIt's been reported that one victim sent a text message Saturday before the accident complaining about the condition of the vehicle major pat note with New York state police says they're hoping to find other communication from passengers that may offer clues\nWe're asking to anyone who may have been in contact with the victims before the crash give us a call\nConcerns have also been raised about the safety of the intersection where this crash occurred an intersection that investigators say was recently modified the NTSB says their team will look at the new design of the road signage invisibility Brian Mann NPR News Westport New York\nNo\nThe fight over Brett Kavanaugh's nomination to the Supreme Court prompted a lot of discussion in all corners of American Life about sexual assault\nAnd specifically how young men are taught or not taught about consent Jewish organization near Philadelphia has a program to talk about this and other difficult topics with teenagers NPR's Jeff Brady sat in with a group of young men\nThe basement of a suburban Philadelphia home a half dozen high school freshmen boys are munching on chips and ... is thirty five year old group leader Cody greenest introduces the week's topic raise your hand if you heard of the nation movement he's a volunteer with\nA lot of discussion in all corners of American Life about sexual assault and specifically how young men are taught or not taught about consent a Jewish organization near Philadelphia has a program to talk about this and other difficult topics with teenagers\nNPR's Jeff Brady sat in with a group of young men\nIn the basement of a suburban Philadelphia home a half\nDozen high school freshmen boys are munching on chip and pretzels thirty five year old group leader Cody green assume produces the week's topic raise your hand if you've heard of the nation moving he's a volunteer with moving traditions which organizes conversations like this with thousands of Jewish teens around the country\n... leads a discussion about historical power differences between men and women and how that can play out when it comes to setting do we believe that\nVerbal consensus necessary but one of the boys David loving says it isn't always so simple he describes the situation on a bus where both people already said they're interested in each other and the girl purposely sits next to the boys\nAre eventually like puts a blanket around your job and lays down like a ... yeah exactly and I cut off doing like grabs your hands or you can hold hands and stuff like those are signs you know\nThe boys discuss several different situations and most seemed to conclude that getting verbal consent is the best choice moving traditions founder and CEO Deborah Meier says the goal is to give teams the space to arrive at the right answer with their peers\nWe aren't telling them this is how you need to behave and this is how you don't behave and we don't shame them for who they are we help guys uncover the tenderness and the connection and the joined themselves as a human being and develop for themselves a sense of ethics and values and responsibility\nTalking about sexual assault and consent this way sounds different from what a lot of people heard in the past University of New Hampshire sociology professor chair and Potter says older generations might remember talks for incoming college freshmen\n... ... and ... and help them you know the capital and they went out and and he made and then we went in and ... and how he made\nThe problem says Potter is that only a small percentage of men are perpetrators Potter says a more productive approach is to train bystanders how to identify someone who may be at risk of sexual assault and then how to intervene Potter says this is hard work but not impossible\nWe've already done high anyway anti drunk driving\nDecades back most people were uncomfortable taking a friend's keys when they're too drunk to drive but after years of research and education programs the rate of alcohol related traffic deaths has been cut in half since the Nineteen eighties Potter says for sexual assault this kind of culture change is just getting started but\nLook around and you'll find examples one of the teenage boys meeting in the basement says that as a high school freshmen he's all ready to use the skills\nI have seen some stuff like a football game\nMatthew O'Donnell says he saw another guy touching the girl and trying to get intimate he wasn't sure it was a problem but just in case he made an excuse to separate them\nWhen I saw happening I was just kind of like oh I have to go to the bathroom in the bathroom it was like on the other side of the stadium so I said come with me\nThe guy went with him and the potential problem was averted\nSharing Potter the sociologist says that's a perfect example of identifying a situation and then intervening she says more of that along with praise for people like O'Donnell could lead to the culture change that results in fewer sexual assault in the future Jeff\nIt wasn't sure it was a problem but just in case he made an excuse to separate them\nWhen I saw happening I was just kind of like oh I have to go to the bathroom in the bathroom as like on the other side of the stadium so I said come with me\nThe guy went with him and the potential problem was averted\nSharon Potter the sociologist says that's a perfect example of identifying a situation and then intervening she says more of that along with praise for people like O'Donnell could lead to the culture change that results in fewer sexual assault in the future\nOh\nThe largest oil company in the last and encouraging attacks on the dairy products that makes executives at ExxonMobil had announced that the company will contribute one million dollars of the next two years to support a campaign for a tax on carbon based fuels so I kind of difference could that make on efforts to reduce the effects of climate change I'm trying to channel the\nExxon Mobil contribution will support a group called Americans for carbon dividends an offshoot of the climate leadership council its aim is to raise the price of fossil fuels to reduce their use and cut the amount of climate changing carbon released into the atmosphere\nExxonMobil has voiced support for such a plan for years but Greg brutal scent of the climate leadership council says the firm's financial contribution is a significant step\nThat's the first time in history that a U.S oil and gas super major has put significant financial resources behind a direct price on carbon\nIn other words a direct tax on carbon though bird will soon group prefers to call it a fee not attacks more on that later\nBurgers and says Exxon Mobil support will make lawmakers more receptive to a carbon tax but you may wonder why does an oil and gas giant like Exxon Mobil support a tax on his main products\nVerbal since says one big reason is that companies want regulatory certainty they want to know what the rules of the game will be and that's an unclear and the current environment\nWe're operating in what amounts to a game of regulatory thing pong and which you have one administration developing rules only to have the next roll them back\nAnother important reason Exxon Mobil supports the plan is that why would tax carbon it would also remove most existing regulations on carbon emissions Bert Wilson says the carbon tax his group is proposing would be much more effective at reducing carbon pollution than the current regulations\nThe Americans for carbon ... plan is based on a proposal from two Republican elder statesmen\nJames Baker the third and George ... both cabinet members in Ronald Reagan's White House one carrot for Republicans is that the revenue from the tax or fee would be fully rebate it to consumers\nHurdles and says the idea has received a positive reception from both parties on Capitol Hill\nWith Republicans in particular there's an increasing number of members of Congress on on the Republican side that are looking to seriously engage on this issue\nOf course many Republicans are skeptical about both taxes and climate change I think it is a step\nThat's Vin Weber a former congressman from Minnesota he's now a lobbyist in political consultant at Mercury Public affairs but Weber says where the president in the White House who campaigned on reviving the coal industry passing a carbon tax will be very ...\nThese on Capitol Hill with Republicans in particular there's an increasing number of members of Congress on on the Republican side that are looking to seriously engage on this issue\nOf course many Republicans are skeptical about both taxes and climate change I think it is a step that's Vin Weber a former congressman from Minnesota he's now a lobbyist and political consultant at Mercury Public affairs\nBut Weber says where the president in the White House who campaigned on reviving the coal industry passing a carbon tax will be very difficult\nI don't think there's any way of sugar coating it or Republican today to embrace any new tax is difficult and since President Trump was elected particularly attacks that focuses on fossil fuels is even more difficult\nGreg brutal and acknowledges the challenges and says the carbon tax has always been viewed as a longer term effort but he says he thinks his group's carbon dividend proposal will become viable sooner than many people expect\nJohn Ydstie NPR News Washington this is NPR News\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor and associate degrees and exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit\nP. C. T. dot edu to learn about ten college degrees that work [noise]\nNext time on asked me another actor Diane Guerrero talked about her writing process and immigration activism I thought maybe my voice could be an app that um I Know what this feels like I Know what family separation is so I decided okay All right from the new\nThe needle in any way the joy meal for your iceberg for MPR in our past those war games and trivia\nSaturday at eleven AM on W. V. I. A. F. Adam\n[noise] Ninety second snacks [noise]\n\nHi there I'm saying Maynard several species of caterpillars have developed in interesting system for waste disposal they fired their fecal pellets a distance of up to forty times their body lengths away from their homes which is over a meter and a half\nA lot of animals distance themselves from their wage usually for reasons of hygiene other animals are known to use gas for surprising purposes\nLarval tortoise beetles playoff eagles shields on their backs to protect them from predators\nSome caterpillar species climb on just silk strings decorated with equal tell us which are known to stress ... protects them for math\nSkipper butterfly caterpillars are able to fire ... pellets by pumping up blood pressure directly under in a in a launching pad on which extradited FICO pellets rest\nOne scientists discovered this ... mechanism\nThey wondered about its purpose it ends up that fleeing their who is a defensive strategy to avoid predator detection through repeated experiments they learned that predatory was would use their antennas sniff out pray we're attracted to the ... and missed the caterpillar is more than fifty percent of the time\nAnd Ninety second naturalist into production of Cincinnati Public radio and the Cincinnati view with support from Cincinnati Public radio member to print the good news of the natural world [noise]\nSupport for NPR comes from this station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation\nThe predatory was would use are intended to sniff out prices were attracted to the ... and missed the caterpillar is more than fifty percent of the time\nThe Ninety second naturalist into production of Cincinnati Public radio and the Cincinnati Zoo with support from Cincinnati Public radio member did spread the good news of the natural world [noise]\nSupport for NPR comes from the station and from the lentils and foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine T MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or at Mac found dot org and from the listeners who support this NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin you've seen the family at a restaurant time guessing they're all sitting there waiting for their food heads down each person's staring at their respective electronic device hey maybe you've even been now family\nAuthor Tommy ... Paolo observed this exact situation not that long ago at a local restaurant where he lived in New Hampshire there were on their\nDevices there weren't even talking to each other and I thought oh you know we we've got to stop and be quiet\nAnd in that moment Apollo was inspired to create a new picture book and it's called quiet in and it's full of colorful illustrations of kids playing it also ... same children learning how to be still it's a very simple story that begins with an old man enjoying the outdoors with his grandchildren\nEase walking with the children and everything is everything is is you know the birds are flying in the freezer wrestling you know the dog is running around uh originally I was having people running playing ball and\nAnd um he says my on my everything is so busy and the children notice how busy everything is and he's he's a bench she says\nLet's sit down here for a minute and everything becomes hill and if you live in a country like I Do there is a time of the day when everything does this\nBecome bill the squirrels stopped looking for not the crow stop fighting the squirrels the you know the free suffer wrestling\nAnd he you invite you to children who come close to him and to just think it'd be quiet ... and um you don't have to do anything\nElse but that but there's so much in there I mean these children are sitting on the bench and there\nI'm In the quiet with the grandfather mhm and then things happen the little girl says\nI can think when I'm quiet rice and the little boy says I can see when I'm Still right oh man I like that [laughter] so\nPoignant in this moment here there's not a lot of seeing and thinking a lot of times in our public discourse anymore and both leaders right awful lot of noise out yup\nI've been I've been in the business of doing books for children for over six years or almost six years I guess I see so many changes and um you know and I've never done what you might call a message book that I Know and I didn't start this I don't think this is a message book I think this is a book about but I feel\nWhere is the easiest place for you to create stillness oh well I think that the wonderful thing is that I can find places\nWherever I Am to get into the city everybody can do this\nI've been I've been in the business of doing books for children for over six years or almost six years I guess I see so many changes and um you know and I've never done what you might call a message book could I don't and I didn't start this I don't think this is a message book I think this is a book about but I feel\nWhere is the easiest place for you to create stillness oh well I think that the wonderful thing is that I could find places wherever I Am to get into the city\nEverybody can do this you know even ... yeah oh yeah I think so when you sit in and suddenly aren't doing anything your mind just take over like a rollercoaster ride\nYou know it just it's still the film our minds that feels it's so much that we just have to let all those thoughts go which is easier said than done it's very hard to let a thought oh and we are in our head but I guess we can't let the thoughts come once we create", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Williamsport", "day": "10"}