{"month": "10", "state": "PA", "station": "WVYA", "content": "Streaming live at W. V. I. I. dot org were Louis ... what a hundred point one an ... point seven you're arts and information station listener supported public radio W. V. I. S.\n[noise] like what you see an W. V. I. A. you enjoy fine programs like pull dark bills that were nature be your kids love watching the antics of Elmo on Sesame Street enjoy said the science kid are curious George how 'bout shows like called the doctor Pennsylvania ... or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a never today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. vi who\nGood morning authorities are still investigating a series of a parent heightened bomb central prominent\nTrump predicts the president is still blaming the news media and the latest on MORNING EDITION from NPR News\nAt one of the target of the bombs George Soros why is he made so many political enemies and Noel King in Washington D. C. and I'm Rachel Martin reporting from\nHis twenty third rational that's\nComing up we'll hear from another house race in North Carolina representing demographics are contributing like hey wait a minute traditionally Republican districts it's harvest\nSeason in the mid west will take it I ... ... more in a wet growing the than had been smaller profit margin farmers\nArtist keep me from the [noise]\nThe news is\nLive from NPR News in Washington I'm Dave ...\nThe FBI is urging the public to pass along any information that may be connected to the tenth suspicious packages addressed a prominent Democrat Santa CNN NPR's Hansi Lo Wang says the devices and the packaging materials are being analyzed us investigators look for a suspect and the motive\nInvestigators are examining the devices that the FBI's laboratory in Quantico, Virginia during a press conference at the headquarters of the New York city police department NYPD Commissioner James O'Neill would not confirm whether any of the devices were designed to be hoaxes\nWe are treating them as wipe devices as you see the way our bomb squad detectives went into CNN yesterday a this has to be taking with your most seriousness\nAuthorities are also looking into powder found in the package send to CNN's office in Manhattan FBI says a pattern is not a biological threat but investigators are still treating the substance as potentially dangerous on July ... NPR News New York\nHomeland security secretary Kirstjen Nielsen tells Fox News investigators believe some of the pipe bomb packages originated in Florida President Trump is preparing to send eight hundred active duty soldiers to the U.S Mexico\nBelieve some of the pipe bomb packages originated in Florida\nPresident Trump is preparing to send eight hundred active duty soldiers to the U.S Mexico border has thousands of migrants from Central America continue their track toward the U.S Michel Marizco with member station ... says defense secretary Jim Mattis is expected to sign the order\nIt's not clear what the military will do here on the border last spring Twenty one hundred National Guard soldiers were mobilized here but they only support the border patrol agents Santa Cruz county sheriff Tony is that I have a Democrat says he has his doubts about what Trump will accomplish by sending more troops\nHave been known to [noise]\nTo try to scare people and and every which way he can do what he can a priest as a base and then this obviously is peace in his base\nThe departments of defense and homeland security did not respond to requests for further information on the truth mobilization for NPR News ... owner\nA caravan of migrants is still more than a thousand miles from the U.S Mexico border Matthew Shepard is being honored today at the national cathedral in Washington Twenty years after he was killed in Wyoming NPR's Tom Gjelten says shepherds ashes will be placed in a crypt\nThey're prosecutors said Matthew Shepard was murdered simply because he was gay\nHis killing was seen as a classic hate crime highlighting anti gay bigotry Episcopal Bishop Gene Robinson himself an openly gay priest will lead the internment Robinson says the placement of shepherds ashes at the national cathedral the significant for the ... community\nThat's NPR's Tom Gjelten shepherd was abducted and killed by two men when he was Twenty one and a student at the University of Wyoming Japan's prime minister Shinzo Abe's in Beijing Today for talks with China's president Xi Jinping this is NPR News from Washington\n\nFamous as food water parks and other relief supplies are being flown into the northern Mary on the island to help those in need and the aftermath of super typhoon you to\nOfficials say it will likely be months before electricity is restored to the roughly fifty thousand people living in the U.S territory the typhoon destroyed homes and vehicles and knocked down trees and power lines at least one person was killed it was the strongest storm to hit the U.S this year\nLouisiana born blues and country rock musician Tony Joe white is dead at the age of Seventy five his son tells the Tennessee in his father suffered a heart attack\nHis chest sits with member station WBUR ... reports from Nashville white was an accomplished singer and guitar player who songs were covered by recording artists such as Elvis Presley and Tina Turner\nTiny Joe White big attack came in Nineteen sixty nine with a song that combined rock and roll blues in country into a town that fans labeled swamp rock\nOut or do you do me any with about a wild animal grain called ... that many ticket is a reference to marijuana\nTicket number eight on the billboard hot one hundred and we've covered by a number of art including Elvis Presley penny wise love oblique again and child on hunting farming northeastern Louisiana in Nashville and songwriting\nCredit include rainy night in Georgia which became an R. and B. yet and the wailing ... trouble man for NPR News I'm Chas Sisk in Nashville\nGame three of baseball's World Series is tonight in Los Angeles the Dodgers trail the Boston Red Sox two games to none\nI'm Dave mattingley NPR News in Washington\nFor NPR comes from the NPR stations other contributors include the Annenberg Foundation committed to supporting educating and engage in communities and the United states and globally for more than twenty five years learned more\nWe'll be Annenberg Foundation committed to supporting educating and engage in communities and the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org and the corporation for public broadcasting\nGood morning here's a look now at the forecast will she partly sunny skies this morning's on becoming mostly cloudy in the afternoon with highs around fifty rain as likely this evening was lows in the upper thirties or chance of rain is Ninety percent\nWill see a near one hundred percent chance of showers on Saturday with eyes on the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain was lows in the upper thirties this is your arch and information station W. V. I. F. him Mm\nW. V. I. F. M. and and the are are like nothing new kind of balance to base journalism your programs the nerves your mind you look forward to the next driveway moment that keeps you in your car when you just can't miss even one second\nOf that great story independent journalism and intelligent entertainment and that's why you listen there's nothing else like it listeners important makes it possible your contribution pays for programs you care about that keep you informed and feed your curiosity\nMORNING EDITION all things considered the Ted radio hour your gift supports unforgettable classical music jazz and musical discovery on mixed bag and home grow music\nCommunity events like kids in the classroom and the great American read nothing comes close to public radio so support W. V. I. A. with your important gift to our ... reserve W. V. I. I. dot\nOrg called wanting seven seven seven hundred nominated for to\nThis is MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas and I knew well king in Washington D. C. a massive search is underway for the person or people who mailed would appear to be bombs to critics of President Trump\nYeah at least ten suspicious packages were sent to a list of notable names including President Obama his former attorney general and his one time CIA director\nAnd parents justice correspondent Carrie Johnson has been following\nThis story as it has been developing good morning Carrie good morning All right so let's get up to speed on the investigation is there any more information on on who may have done this\nNot yet the investigation seems to be centered in two places one is the FBI lab in Quantico, Virginia which is analyzing these devices may look like homemade pipe bombs and the experts at the FBI will be looking for clues about how the bombs were constructed what materials were used\nThey'll also be looking for DNA or fingerprints the bomber may have left behind on the devices or those ... retired investigators are telling me that is very promising because so many of these devices are intact\nThey didn't explode but if history is a guide that whole process could take a while it will be a mediator overnight well last night authorities were searching a package sorting facility outside of Miami what do we know about about that place and what they were looking for their\nThis postal service was ... he is an over locker near Miami the operating theory for now is that some or all of the ten packages went through that facility and through the u._s. mail\nAs special again it's big whiz that's just one year away from being able to buy the dream we desperately need after Twenty years of doing this wait wait for men feel Laura mourning fans Sunday evening at seven on W. V. I. A. F. M. [noise]\nThis is George Graham Friday nights on both all that shit and mixed bag we play a request from seven to eight at all that jazz with the best in straight ahead\nAcoustic jazz than at eight it's mixed bag starting with the daily new releases segment then from eight thirty two eleven will be playing your requests for the unique stylistic blended contemporary music\nFor which mixed bag has no phone five seven zero six by five to eight oh wait to place to require\nThat friday evening starting at seven on WB I felt [noise]\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid to the news is on Peter Segal and all I can say is we'll stop when they do join us for an all star celebration was all our panelists that's right and all of them\nAnd special again it's big wigs that's just one year away from being able to buy the dream we desperately need after Twenty years of doing the weight weight from NPR's Laura mourning fans Sunday evening at seven on W. V. I. A. F. M.\nGood morning here's a look now at the forecast will she partly sunny skies this morning on becoming mostly cloudy in the afternoon with highs around fifty rain is likely this evening was lowest in the upper thirties or chance of\nDied this morning I'm becoming mostly cloudy in the afternoon with highs around fifty rain is likely this evening was lows in the upper thirties or chance of rain is Ninety percent\nWe'll see you near one hundred percent chance of showers on Saturday with eyes on the upper forties will also see when it costs up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain with Lowes in the upper thirties this is your arts and information station W. V. like I have family\nSupport for NPR comes from this station and from the William and Flora Hewlett foundation committed to supporting ideas and institutions to advance education for all preserve the environment and promote vibrant performing arts\nMore information is available at Hewlett dot org from the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at a E. C. F. dot org\n[noise] from the state of Joan be crock request served as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century and from the listeners who support this NPR station\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning the billionaire George Soros says one of several public figures who've been mailed what are believed to be tightened bombs this week\nCirrhosis a hedge fund investor and philanthropists who donated to causes many of them progressive around the world and we should note that the open society foundation which he founded in Nineteen Ninety three has been a financial supporter of NPR\nDo a lot of enemies in politics he's been a target of conspiracy theories from the right\nSebastian Mallaby is the author of more money than God a history of the hedge fund industry and I asked him recently if he was surprised to see George Soros among the U.S presidents and other prominent Washington figures who've been sent these packages\nWhile the whole phenomenon of the pipe bomb or business surprises me in a poor me but um if you were to say that somebody was to make a list of you know progressive leaders they wanted to attack that I wouldn't be surprised to see George Soros on that list I think he is\nThe single most important known politician\nI'm spearheading progressive causes worldwide\nGeorge Soros has a really interesting personal history tell us about that and tell us how did he make all of his money\nWhen he was born in Nineteen thirties or well to do Jewish family in Budapest, Hungary a childhood was dominated by the Nazi occupation of his country and he survived by separating from his family and I think that ... explains a lot about the focus of his finance or being his politics and their life\nAnd he left hungry at Seventeen to go to London and from that he went in to find on the move to New York he opened one of the very early hedge from in New York was a very successful stock market trader so that by around Nineteen eighty\nHe was worth a hundred million dollars but I Would just to start because when he went into currents speculation in the eighties and nineties\nAnd tell us briefly how did currency speculation make him rich\n[noise] well I'm In the nineties a specialty with a currency peg than knocked on sustainable and famously in Nineteen Ninety two he broke the bank of England by betting that the bank of England couldn't keep the British pound linked to the German deutsche mark\nAnd when ... says right or the pound collapse or us made enough food for sure and and the u._k. economy are descended into chaos\nGerman deutsche mark and when the person's right or the pound collapse are us made enough food for children and the u._k. economy a descended into chaos\nWhen did you start getting involved in politics in earnest\nGet the gun in his native Hungary and then in other Eastern European countries where his ... he had a clear political process which was to build for our lives and\nSo he would sort of in politics from that period and the eighties own words but the switch came in two thousand tree when he waited into us politics because of the Iraq War there once it became clear in two thousand four\nQuite how much money he was spending on demographic get out the vote causes that was the inevitable um counterattack from Republican uh and it became a useful trick\nIf you are being attacked in the media and you are a Republican member of Congress to say well the major slurring me because it's sort of sorrow and his allies have put them up to it\nWhy does George Soros and particularly becomes seen as\nA shadowy figure hiding and talked to suggest because he had so much money\nYou know I think it's ironic that he's seen as a shadowy you caught expended rushing the there was actually his finance or being called the open society Institute He's very open about it he published a cigarette is about whether donations go so I think it's hard to escape\nThe suspicion that the critics who say he shot every I'm a ... on a long tradition of anti Semitism\nWhere George finances are portrayed as\nThe ... figure to manipulate the politicians and therefore I think it's a fairly clear indication of that tradition well what do people in his native hungry think of Soros\n[noise] he was a hero early on in the transition away from communism things have tonnes more recently because of the anti migration populist nationalism that is taking over the country\nSebastian Mallaby is the author of several books and a senior fellow at the council on foreign relation thank you so much\nThank you President Trump is headed to Charlotte North Carolina today to rally supporters for Republican congressional candidate mark Harris\nHarris it's gotten a tight race in a former Republican strongholds against Democrat Dan McCready NPR's Kelsey Snell has more on how major shift in North Carolina politics mirror changes across America\nFor more than fifty years voted in the ninth congressional district in North Carolina have been sending Republicans to Congress but things are changing\nYour hair and a conservative Baptist minister is slipping in the polls behind mccready a Democrat and former marine David a Clinton a professor of political science at Meredith College says the Trump rally is something that Republicans have to fight harder than there used to\nThe fact that President Trump is coming in um ... they still see that raises winnable it would have been feasible two decades ago for a Republican president to me become into that district\nNick Clinton said that because of shifting demographics people from other states and other countries are flocking to jobs in places like Raleigh Durham and Charlotte young generations of farmers are doing it to he does like the rest of America Democrat in North Carolina dominate the cities and suburbs but things change the further out you go\nYou look at the political fines and I mean you can almost see the county line the shift between the Democratic signs were on one side of the county line and you're moving to another county more rural county and all of a sudden the strong country\nThe line it is so clear in other areas like Polk County where the view of the political trend line depends on who you ask how commissioner ray Gasper sense says the areas about sixty percent Republican but he's the only elected Democrats\nYou ask county commissioner ray gas ... says the area that sixty percent Republican but he's the only elected a Democrat and when his party dominating in eight light off in the future that doesn't mean the entire state attorney blip\nWe have a hundred and ... and she said it for sub or very rule which for him to go much more Republican\n... county Republican chairman ... says rural Republican voters like Trump\nI'm seeing a trend where there's a movement away from the Democratic party\nTo the Republican Party just because there is a lot of dissatisfaction with what has been going on at the national level\nTrump certainly could be the clothing pitch for Republicans who want to keep everything\nNinth congressional district from turning Clinton healthy now NPR News ... North Carolina\nThis is NPR News\nThis was ... nine point nine F. M. W. V. I. H. D. ones granted Wilkes Barre ... and we're in Williamsport at ... eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were in a while and pop academically P. A. U. Ninety One point five of them\n[noise] the U. S. partly maverick culture predicts a record sleeping harvest this year China once a major market for soybeans impose a twenty\nFive percent tariff slashing imports that knocked two dollars a bushel off the price awesome and then we'll get costing him tens of thousands of dollars\nIt's one more thing that we have pretty much no control over it seems like that affects us greatly so I guess we're just kind of rolling with the punches here on this\nAnd the punches keep coming this year besides the terrorists persistent rain pushed harvest back by weeks and there's the new tax law that could have a big effect on farmers who sell their crops to the local grain cooperative\nIowa State university ag economist Kerry Jacobson says the laws changes make who to sell to a dicey proposition that's what's hard to nail down and that's where farmers are in their marketing decision process at this point for example a farm with lots of employees might be better off selling to a private ethanol plant\nBut one with no employees might benefit from joining a co op\nMichaeleen who farms near Huxley Iowa serves on the border heartland co-op he says even though he's been paying close attention he still doesn't understand how that changes will affect his bottom line\nI contacted my accountant about it and he's still going to school and learning about it so he didn't feel comfortable at this point advising\nFor now Helen's more concerned with bringing in his crop\nMost of us will be glad when this year just over\nThe agriculture department promised farmers twelve billion dollars to help offset the tariffs impact but ... says that's not a real sex\nBut we are in an election year so I figured there'd probably be something like that coming out [noise]\nThat's a\nKey cos elevator enrolling to Iowa sees Web cranks open the hopper on a semi to let soybeans cascade into our pets from there there'll be conveyed by storage\nThan Iowa State at the economist Chad Hart says higher prices are on the horizon\nAnd so as we look out into the spring of twenty Nineteen we do see some reasonable prices out there but that means we're going to have to have this crop for six seven months to get there\nAnd with all the rain some elevators are storing soybeans that can't sit that long meanwhile Mexico Malaysia Indonesia and even Argentina have stepped in to buy us soybeans\nChina went and bought a lot of buddies from Argentina left them a bit too short they had to go into the world market they bought some for months and so you're seeing some really interesting trade flows\nBut still about two hundred million bushels that would have gone to China need to find another customer\nOn dry days farmers are razor focused on just getting in this late crop but with terrorists taxes and quality to worry about this nerve wracking season isn't going to end when the last beans hit the Ben friend PR News I'm Amy Mayer in Ames, Iowa\nAmy story came to us from Harvest Public media it's a station collaboration reporting on food and agriculture\nIt's NPR news usually\nProgram [noise]\nYellowstone National park is home to a wide variety of native plants and animals but there is one animal is conspicuously absent ... this is the pulse\nThe\nReason we don't have an effect on it because they were radical\nThe reason\nWe don't have rules in Yellowstone it's because they were radical and because of concerns that rules would consume too many of the bias in announcing the part\nI think this year is the Northern Rockies regional representative for the defenders of wildlife he's part of the campaign to reintroduce the Yellowstone Park [noise]\nTo put things in perspective at the turn of the century and the United states particularly in the west [noise]\nSpecies like helping buys and we're near extinction commercial exploitation of those animals by early settlers and severely depleted most big game population and consequently a place like Yellowstone with the voting most of its energy trying to restore a species like the ... and then they are [noise]\nAnd it just didn't seem like there was room in Yellowstone for predator at that time [noise]\nBut times have changed in ... D or a flourishing without any natural predators to keep them in check\nIf left unregulated these populations of deer and elk often increase the extremely large numbers to the point where they can be destructive to the range that they live on [noise]\nAnd in fact eat so much of that range that when a hard winter comes starvation can be the result and large directs in this population we saw exactly that happened in Yellowstone Park in the winter of Nineteen eighty eight [noise] where we had more than five\nThousand out dimes starvation specifically because their numbers have grown larger than what the available range good support [noise]\nThis archival program is part of our thirtieth anniversary celebration you want to hear more check out our podcast\nNothing comes close to public radio you tune in every day to W. V. I. F. M. and NPR for honest and fair journalism programs like MORNING EDITION all things considered classical music mixed bag\nWhere else do you find such programming help us keep the service is wrong you care about independent journalism an intelligent entertainment still consider being it's champion\nMake a gifted ... today ... dot org recall one age seven seven seven hundred nine eight for two thanks\nSupport for NPR comes from the station and from American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot O. R. G. [noise]\nFrom the Charles Stuart ... foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more at ... dot org\nAnd from the John s and James L nice foundation helping NPR advanced journalistic excellence in the digital age\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin listened carefully and you can almost hear Americans' all over the country binge watching the latest releases from Amazon and Netflix\nThese to check tech giants are now turning their attention to India that country's market for online video there is expected to reach over two billion dollars in the next five years\nBut so far neither company has had a whole lot of luck so Cardiff Garcia and Sally her ships from our planet money team identified some possible steps to success\nSo I was watching this movie recently on Amazon a comedy guy gets engaged his best friend doesn't like the girl tries to break up the wedding\nThere is this whole complicated plot but that is all beside the point what was really surprising was all the working which I told a shock to your own car about she's a journalist for the BBC I don't know if you have to working in the you can call it the same thing they do\nShow on the covers Indian film and culture that's where you were watching\nI don't know if you have to working in the you can call it the same thing we do\nA show on the covers Indian film and culture that's where you were watching an Indian film and there are all these stereotypes about these films like that they're really conservative so I get it Sally you fell prey to stereotype it's\nShameful but true and when I told it's on the I was surprised by all the drinking and talking about sex and the movie she totally school me\nIndian cinema as not being the way you just described it in many many many is\nWell don't feel bad Amazon and Netflix also need to get up to speed on Indian film because they're up against a serious competitor India already has a major online content provider called hot star\nAnd hot star says it has about one hundred and fifty million monthly users according to counterpoint research\nHas eleven Netflix eat poultry five which\nBrings us to our strategies for streaming success in India\nNumber one understand the market because if you think India is all Bollywood think again\nIndia and not just Bollywood\nBollywood movies are mostly in Hindi but according to India's last census a hundred and Twenty one languages are spoken in the country so plenty of Indian films are made in other languages\nYou know when you go to the gate and I can go to the cinema I remember in two thousand and five I live in a vintage at I went off and then my that was showing Harry Potter but they were showing it ... ... I don't know how to ... ... in ... step\nTo programming for culture most of the content Amazon and Netflix producing the U. S. plays well all over the country\nYou can show Portland in New York and Seinfeld and Portland but India is packed with different cultures and the words want content relevant to them which is why Amazon and Netflix are using strategies three focusing on a niche in this case India's wealthy high earners\nPeople who can afford in other words an Amazon Prime subscription which is almost the same price as hot star just over one US dollar a month or Netflix around seven dollars a month\nAnd both Amazon and Netflix said they're having some luck both are offering content in multiple languages and Netflix has a hit secret and games like cops thriller but if either wants to crack the Indian market there is one more thing they'll likely need hop star has this thing Amazon and Netflix do not\nThe advantage of that ad in cricket because Indian law that cricket\nHot star has the license to show the I. P. L. that's the Indian Premier League like the NFL cricket\nAnd one last challenge shocked he mentioned Indians love sharing their clock and we don't have that problem here know Sally herself Cardiff Garcia NPR News [noise]\nAudio eighty eight points ... Mansfield W. P. or you know the one point five and ... and ... how to universities W que su eighty eight point of mc ... grove we have a translator induce Berg it one hundred point what your arts and information station listener supported public radio W. V. I. A. F. M.\n[noise] next time I asked me another eaten Slater start ups bunch Bob square pants the Broadway musical\nTells us about the call that led to it all and they said we have this audition for you can't tell you what it is technically it's the title to no end up project but we think you might be the right shape for it [noise]\nThey're joined me off your Eisenberg NPR's our puzzles word games and trivia\nTomorrow at eleven AM um W. V. I. A. F.\n\nGood morning what's riding voters to the whole the mid term the then\nBroadcasting from a tight congressional district in Texas with some answer\nAnd MORNING EDITION from NPR News [noise]\nWhat's on voters' minds here along the border immigration and an economy that is in some places booming I'm Rachel Martin in Del Rio Texas\nAnd I'm now working in Washington DC also this hour we'll have the latest on the massive investigation into at least ten\nSuspicious packages that have been such a high profile predict president\nAnd an story for a twelve year old transgender Boyce talks about life in elementary\nIt is friday I'm over twenty say\nHappy birthday to a man of letter wheel of fortune Patsy jacket today and the news is next\nLife from NPR News in Washington I'm more of a ... law enforcement officers are searching the u._s. postal facility near Miami, Florida it's believed some of the ten pipe bomb sent to democratic leaders an activist may have been mailed from there to the intercepted pipe bombs were dropped to former vice president Joe Biden he spoke in western New York\nLeaders an activist may have been mailed from there to the intercepted pipe bombs were addressed to former vice president Joe Biden he spoke in western New York last night calling for renewed commitment to American values Mike Desmond reports from buffalo\nBiden spoke to the same forum at the state University of buffalo where President Obama spoke while he was in office the sellout crowd is sixty five hundred cheered him as he called for politicians to rethink what's going on in an division in a series of attacks on President Trump without ever naming the President Biden\nTold the audience reporters art enemies of the people and immigrants are not animals this division\nWords matter Biden spoke today after conservative firebrand Steve Bannon delivered a slashing attack on Democrats and defended the president in another buffalo suburb for NPR News I'm Mike ... been in Buffalo\nThe Taliban say Pakistan has released the cofounder of the insurgent group the move is seen as a gesture to facilitate talks among the Taliban the Afghan government and the United states and the idea hit the reports from\nIslamabad, Pakistan detain mullah ... years ago in a sprawling port city of Karachi a Taliban spokesman confirmed to NPR that he was freed and smokes and wouldn't say when he was released or if you'd returned to Afghanistan\nAmong the bar and I was released can be seen as a goodwill gesture to the Taliban but it's always thought unclear if he'll be involved in future talks over the past few months a small group of Taliban official ... American diplomats in the Gulf state of Qatar\nThat came off to the U.S restarted its efforts to bring the Taliban to peace talks to end Seventeen year conflict in Afghanistan Washington appointed the veteran diplomats all my Hallows odd to oversee those assets ... date NPR News Islam about\nJapan's prime minister Shinzo Abe's in China needs met with Chinese premier league ... it's the first formal visit by a Japanese leader to Beijing and seven years the BBC's Rupert Winfield Hayes reports they signed several agreements on trade\nI think the significance primarily is symbolic in the\nFor seven years no Japanese prime minister visited China now Japanese prime minister has had this sort of summit meeting with the\nThe Chinese premier and the Chinese or presidents so prime minister Shinzo Abe's being in Beijing being welcomed by the Chinese premiere on these one would I mean ... is that it's a historic turning point the doing of a new era the coach young fit to return to healthy normal relations between China\nAnd Japan so this shows the the both sides now wants to end this\nWhat has been seven years of very chilly relations\nThe BBC's Rupert Winfield have It's NPR\nNews reports say President Trump is considering issuing an executive order that were closed the southern us border to migrants the Washington Post and the New York times report that would also include people who are seeking asylum\nTrump has been ... reports of thousands of Central American migrants who are now in southern Mexico they're vowing to walk to the U.S border\nTrump is ordered about eight hundred US troops to the border to exist immigration and Customs Enforcement agents\nThe number of algae Beatty cute characters on TV is up significantly according to the media advocacy group glad NPR's Mandalit del Barco has more on\nThe new super girl show introduced the first transgender superhero on TV knee and now a K A dreamer\nGet better I had to back\nNew report from glad celebrates the CW network new character as well as the show post on FX according to their numbers that show has the most transgender series regulars ever\nThe CW network new character as well as the show post on FX\nAccording to their numbers that show has the most transgender series regulars ever a number of lesbian gay bisexual and queer characters on broadcast TV it's also the highest the group has recorded\nBut glad is asking the TV industry to ensure that within the next two years ten percent of the theories regulars represent the algae B. T. Q. community Monday that radical NPR News\nLawmakers in Ethiopia have elected the country's first female president ... will assumed a largely ceremonial post Ethiopia's new prime minister recently named the cabinet in which half the ministers are also women the new president has previously worked for the un\nI'm more of a ... NPR News\nSupport for NPR comes from NPR stations other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\nGood morning here's a look now at the forecast will she partly sunny skies this morning's on becoming mostly cloudy in the afternoon with highs around fifty rain as likely this evening was lows in the upper thirties\nOr chance of rain is Ninety percent will see a near one hundred percent chance of showers on Saturday with eyes on the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain was lows in the upper thirties this is your arch and information station W. V. I. F. M. [noise]\nWe'll stories will be\nWomen's rights and escape from your mother tells you you're going to go alone to the United states was really hard to do with the change the world in my career changed what\nWith impossible with now possible and people changed each other's law [noise]\nWhat do you want to say I need to shape [noise]\nTuesday at age ... W ... TV [noise]\nProgramming on WB I is made possible by our members and bicycle Hannah university where the departments of theater and music will present the Tony Award winning ... October twenty fifth through the twenty eighth jokes I'm Sorry seven thirty PM October twenty fifth twenty six twenty seven\nAnd two thirty PM October twenty eight and a sweater university ... center theater in the Charles ... campus center\nFor tickets called us quite a university box office five seven zero three seven to ...\nIt's MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas\nAnd I'm Noel King in Washington DC good morning a massive search is underway for the person or people who mailed homemade pipe bombs to critics of President Trump\nAt least ten packages had been sent a prominent figures including President Obama his former attorney general and his former CIA director NPR national justice correspondent Carrie Johnson has been following this story good morning Carrie good morning too well so what is the focus of this investigation of\nThe investigation seems to be focused on to place and one is the FBI lab\nBased in Quantico, Virginia which is analyzing these devices in a while you know they look like homemade pipe bombs and experts at the FBI are looking for clues about\nHow the bombs were constructed a where um materials may have been purchased and they're also be looking for DNA are fingerprints the bomber may have left behind\nRetired investigators tell me and this is very promising because so many of these devices are intact they didn't explode but if history is a guide and this process of analyzing the devices is going to take a while it won't be overnight All right so Quantico, Virginia is one place with the second place and the second place is on\nThe analyzing the devices is going to take a while it won't be overnight\nOr it's at Quantico, Virginia is one place with the second place\nAnd the second place is north of Miami at a package sorting facility in Florida in ... Florida the operating theory for now is that some or all of these ten packages went through that facility and through the u._s. mail investigators are looking for more devices but also any other clues there\nThere's a lot of manpower deployed not just in Florida but all over the country the postal inspectors are on the case the FBI the bureau of Alcohol Tobacco firearms and explosives homeland security investigators and so our local police\nWhat do you feel you have them at NPR are like nothing else balanced tracked base journalism and intelligent enjoyable entertainment and it's all made possible\nBy listeners like you your contribution piece for programs like MORNING EDITION all things considered and the Ted radio hour community outreach like kids in the classroom and the great American read nothing comes close to public radio\nOr WBRC a with a generous gift was a double ... organ recall one eight seven seven seven hundred nine eight four to [noise]\nDo you ... a public media presents us with a new decision twice\nOne eight seven seven seven hundred nine eight four to [noise]\nDo you ... a public media presents Pennsylvania decision twenty eight ...\nPennsylvania eighth congressional district debate\nDemocratic congressman Matt Cartwright Republican congressional candidate John shrimp discuss the issues in front of puddle is an alliance theatre all you\nKnow the candidates before you vote the Pennsylvania congressional district debate [noise]\nMonday of seven on Bellevue vi [noise]\nSupport for WBAI comes from the citizens voice providing loser in county with breaking news every day for the past forty years citizens voice affects their readers who received news at home or on the go citizens voice here to stay more information that citizens voice dot com\nGood morning here's a look now at the forecast will see partly sunny skies this morning then becoming mostly cloudy in the afternoon with highs around fifty rain as likely this evening was lows in the upper thirties or chance of rain is Ninety percent\nWill see near one hundred percent chance of showers on Saturday with ... and the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain was lows in\nThe upper thirties this is your arts and information station WVU I asked him\nSupport for NPR come from the station and from the three I O T powering enterprise digital transformation with artificial intelligence predictive analytics and I teach solutions learn more it see three\nI O T dot a guy\nFrom Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles the family's experience of survival relapse in recovery starring Steve corral and Timothy shallow me\nNow playing [noise]\nAnd from the University of Florida where solving for next is powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges\nAt next dot U. F. L. dot edu\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning earlier this week NBC's Today show anchor Megan Kelly caused outrage with some on air remarks about Halloween costumes\nIt was a controversy on the outside to New York with ... as she is Diana Ross and like who doesn't want to and she wanted to look like Diane around for one day I I don't know how like that got rages on hollow why\nNow NPR's David Folkenflik is reporting that the network has dropped Kelly from the today show lineup\nAnd that she appears likely to leave the network because of the fallout from those comments the morning David ...\nOkay so this is not the first time that Megan Kelly has made controversial comments about race here she is in twenty Thirteen when she was an anchor on Fox News for all you can watch at home than it just is white and she says it was a white man to tell us about her history of making racialized comments\n[noise] well these aren't ah the only examples um there are number I remember back in twenty at the Santa Jesus comments back from twenty Thirteen she later said she'd been joking and last year claimed that she she regretted those remarks but\nI remember back in twenty ten um she spent a fair amount of time on a tiny tiny heat group black hate group called the new Black Panthers a one I Believe them ultimately a face criminal charges related to voter intimidation she spent over three and a half hours in a three week period of focusing on it as though it was a threat to the Republican\nIndeed as one of her former colleagues were counted basically yelled at a white liberal a strategist for about ten minutes who she felt was willing to take it a sufficiently seriously uh one more example among several uh she keeps ...\nLiberal strategist for about ten minutes to she felt was willing to take it a sufficiently seriously\nOr one more example among several uh she keeps kept inviting the ... a former LA up a homicide detective markup farm in on the air to talk about a ... a\nCriminal justice issues and to talk about uh the question of a African American relations with police officer she of course had to admit on the stand he had said racist things over the years during the OJ trial um many people saw that as a as discredited thing she welcomed among show\nDo you think that history played a role in NBC's decision to let her go\nI think it's played a strong role in uh the reaction of NBC's colleagues particularly but not exclusively NBC's I'm African American journalists are outraged to her remarks about ah what she felt was the acceptability of blackface\nNBC's a nightly news with Lester Holt did a whole segment about this controversy on its OWN Network which seems to suggest something about making Kelly's collie and their attitude toward her\nWill for you and me it might be an admirable exercise and transparency and I think it was that I think it's worth pointing out also Lester Holt the only African American anchor ah of any made of the big three broadcast networks but it's also a sign that NBC was saying we're not going to protect the starting with we we might even though she's one of the most recognizable faces and TV news which\nIs really interesting the fact that she has been dropped I think it will surprise some people and I wonder does the way the network has handled this comment see something bigger about the way networks and companies are are tolerate it tolerating racialized or racist comments\nWell it's hard not to look at this in light of a you know direction at times very slow of major news organizations to the me too movement which was something that for a significant time making Kelly embraced a sheet accuse her former boss at Fox News of sexually harassing\nHer I also think you can't divorce it from the fact that making Kelly I received very tepid a welcome from her colleagues NBC News you just play some popular colleagues\nAnd that her ratings themselves were mediocre and that even before all this happened uh she's been discussing with a network another role there are because she needed to get out of that show now the show's gone and she's a negotiating her eggs that as well\nNPR's David Folkenflik thanks dated you bet\nIt's friday and time again for storing or ... today a mother talks with one of our kids about an important moment caissons for is the youngest of seven children when he was twelve years old case and sat down at the story corps\nWith his mother Jennifer ... to talk about life in elementary school in Tuscaloosa, Alabama tell us a little\nBit about yourself I named my ... I played the stand up ... [noise]\nI Am learning how to play the guitar and I am transgender\nWhat level are you in martial arts on that level to blue belt that means I Am half acre black though what is your favorite subject in school\nThe pay our lunch\nWhat grade level where you in school when you decided to tell your friends and family that you're a transgender it was around fifth grade and\nThen I told my ... family has changed in game because up until then I did not know that there were a kid\nIt was Mary every day\nI hated being called a guy and I hated being called a daughter but not everybody in my family friends they were just okay because they kind of new things coming yeah\nOver the summer I went to I Can't and they did not know I was ... and and they just called me he that was awesome I think the happiest moment in my life [noise]\nProbably be January he steamed two thousand Fifteen eight Seventy five PM you'd ...\nBeen telling me for quite a while they wanted boxers viewer wearing all boy clothes\nTwenty five PM ...\nYou'd been telling me for quite a while they wanted boxers viewer wearing all boy clothes getting boy hair cut and that was like the finals change and you are just ecstatic ... is there anything else you would like for people to know about you\nWell even though I'm ... I'm a kid too I have home I can yell a sigh of casts can deal with\nI had them extremely proud of you because you have been treated who you are and you're\nVery courageous it shouldn't be ... I mean maybe a little bit at fish but it's way happier if they asked me\nI don't think he realized what el eater you are people like that to you because you are not afraid to take a different path\nAnd we know that it's your life and you're the one that got to live at that we are there for you every single step of the way and we're going to do whatever we can to to lighten your leg who'd be proud to be your mom\n[noise] packed mission\n\nThat one case in Ford and Jennifer ... for StoryCorps\nTheir conversation was recorded in Birmingham, Alabama in twenty Fifteen they're interview will be archived along with hundreds of thousands of others at the library of Congress\nMajor support for StoryCorps comes from super featuring the all new rewrote receding for up to eight and a choice of second row captain's chair and love it's what makes us Subaru and super and learn more it Subaru dot com\nThis is NPR News why do you listen to W. B. I. F. M. NPR News classical music jazz in contemporary music fresh air wait wait don't tell me and other favorite programs they're all here thanks to sustain or support you can help too at W. V. I. A. dot org\nI asked sheriff Martinez how the immigration debate is affecting people's politics here\nAnd like other folks we spoke to in Del Rio he said it's not top of mind for residents this is a relatively quiet part of the border the people who do sneak in get out quickly and moved to a bigger cities\nAnd even the Republican congressman will Hurd has spoken out against the wall he's facing a democratic challenger named Gina Ortiz Jones who's trying to tie her to President Trump\nBut this is a swing district in heard has positioned himself as a moderate and by doing so he's won the support people like Jeff Martinez\nWill it come to an air of giving them the same tour alike well he's just felt that our office he ah he's been an advocate for us\nAnd this is interesting because sheriff Martinez like most elected officials here is a Democrat and even though he didn't vote for President Trump and had some issues with the policies and his rhetoric Martinez is pleased about one thing\nThis administration the shirts have been invited to the table previous administrations\nWe weren't or we were holding everybody else was even the bones were blown\nUp by the way to solve the immigration issue the sure to be at the table returns you can't just go to though because\nHe knows the battle over immigration is going to go on for a very long time which brings us back to the original question\nWhat about that well see my idea was to\nYou can control with technology cameras\nA set of putting the physical structure because where you're going to put it\nHe points to the houses along the river on the U.S side of the border\nAre you going to put these people in Mexico are you going to put these people in the wrong side of the wall\nMeanwhile people like a ... year a block out the noise about the wall she will vote for the incumbent Republican Senator Ted Cruz and Republican congressman will Hurd and she will keep going back and forth across the border in her backyard\nAs she did what I find I\nAnd just like that were in Mexico\nHave exchanged faces right here where the dollar exchange so this is talk on ya we walked down the main streets filled with bars\nAnd stores selling all kinds of Mexican handicraft without that one storefront where a woman is sewing handmade dolls stressed and colorful dresses\nFishing actually making them if not machine they're not coming from China these are authentic regulated they cannot\nA check and then with a smile she not just for a long black\nThey're not coming from China these are authentic like they did they cannot Atta checked out and let them rich and then with a smile she not just for a long black hair over her shoulder and waved goodbye\nAnd then it gets in her white and see the and wait for a long line to cross back over into the U.S [noise] she'll return in a few days though he has dropped that need tailoring\nFrom Del Rio Texas this is NPR News\nSupport comes from done more drugstore your environmentally friendly pharmacy they recycled Ninety percent of all their plastic containers and they're now using biodegradable prescription bottles probably serving with community since two thousand three on Blakely street and done more five seven zero three or four to eight four to seven [noise]\nNext time I asked me another Ethan Slater star ... square pants the Broadway musical tells us about the call that led to it all and they said we have this audition for you can't tell you what it is technically the entitled to no end that project but we think you might be the right shape for it [noise]\nThey're joined me off your eyes and very for NPR's our puzzle games and trivia\nTomorrow at eleven AM on W. vi AFL\nSupport for WB I come from the FM Kirby sat presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin ... at the FM Kirby center on Saturday October twenty seventh at five PM [noise]\nNinety second snacks on that\nEither I'm a Maynard chimpanzees can recognize each other from behind\nWild chimps remember faces as well new research has found that the primates recognize the bus hawks of there can just as well as humans recall familiar faces for humans the face offers important information beyond identity such as attractiveness in hell\nFor chimpanzees there but ... served the same purposes for instance chimps can determine if the rump the sea belongs to a relative or to a female this Avi lady\nColor plays an important role for Jim female primates have hairless faces and by the talks making skin features more visible female chimpanzees bottoms or read the painting in color and growing in size and the females obviously in non human primates eyes are able to easily distinguished red tents\nSo researchers showed boats humans and chimpanzees stimuli such as the faces\nBut socks and as a control feet of votes humans and chimpanzees and sure enough when the chimpanzees were presented with images of blood talks they were much faster than humans to click on the correct such talks in [noise]\nIn Ninety second naturalist into production in Cincinnati Public radio and the Cincinnati view with support from Cincinnati Public radio member it could spread the good news at the natural world [noise]\nSupport for NPR comes from the station and from Amazon Web services used by millions of customers AWACS provides a range of cloud services and functionality from tools to security to compliance more information at a W s is how dot com\nAnd from Trader Joe's offering new products in every store and new episodes of the original pod cats series inside Trader Joe's\nAt apple pie cats or where pod cast are available more at Trader Joe's dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King on a cold night\nMore at Trader Joe's dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin\nAnd I'm Noel King on a cold night in Wyoming Twenty years ago this month a young man named Matthew Shepard was beaten and left to die shepherd was gay and his killing was widely seen as a crime of hatred\nNPR's Tom Gjelten reports that the internment of shepherds ashes at the national national cathedral in Washington is meant to highlight the need to protect the LDP T. people\nHere is sheriff Gary Paul's in Laramie, Wyoming at a press conference in Nineteen Ninety eight describing how Matthew Shepard was found\nUnconscious and actually as not being conscious\nShepherd had been hit in the head with a gun he hung on that fans for Eighteen hours before anyone found him he died in the hospital five days later two men were charged with murder and sentenced to life in prison\nProsecutors said shepherd was targeted simply for being gay\nWhether that explanation was entirely accurate has been disputed but it may not matter\nHate crimes happen anti gay bigotry is real and Matthew Shepard is for many the face of that phenomenon this is very personal for me leaving shepherds in tournaments ceremony at the national cathedral will be Bishop Gene Robinson\nAs the first openly gay bishop in the Episcopal Church he knows the sting of prejudice first hand\nI had to wear a bullet proof vest to my own Consecration as bishop for the next two and a half years I had almost daily death threats so to be able to carry Matthews ashes in the procession isn't indescribable honor for me\nShepherds parents requested that their sons ashes be interred here only after deciding against other places for fear any burial site might be desecrated\nThe cathedral agreed to their request it's affiliated with the Episcopal Church among the most algae Beatty friendly denominations the Reverend Mary on buddy the Episcopal bishop here she's the cathedral becoming a place of\nPilgrimage they will be young people from all across the country having tourists here and being educated here and when they pass by they were black in his honor they will see that this is a church that\nHas learned that we need to stand and be counted among those who work for the full embrace of all I feel\nAbout the shepherd's parents were at the Smithsonian institution's museum of American history yesterday to donate some of their sons personal possessions from his Superman Cape to his report cards Judy Shepard said she wants people to see her son as just like any other child\nEvery other challenge to the man can't every child has a pre school diploma every other child had all these things that can you see that was absolutely nothing different about Matt adventure he left and I would you care\nThe shepherd's have another son that a shepherd says honoring his gay son at this point has a political goal to end discrimination\nWe had a straight Senate and the gays and they're not considered equal they don't have the same rights and why is that I Can't get an answer from anybody they want to take rights away from the algae ... when I asked them not compare with my two sons they can't tell me why\nWhen his ashes are entered today at the national cathedral Matthew Shepard will be in a place of honor alongside the remains of Helen Keller Tom Gjelten NPR News Washington\nTo ... comes from Dr Thomas helped a board certified searching providing dental implant says well cosmetic facial surgery including facelift pilots surgery Botox in wrinkle reduction procedures hold on a spot like setting located in Strasburg five seven zero four to zero eight one eight zero\nThis has doubled vi eight eighty nine point nine of them W. V. I. H. D. ones granted Wilkes Barre Hazelden WTY eighty nine point seven FM Williamsport W TI eighty eight point three F. Maine's bird Mansfield\nW. P. A. U. Ninety One point five FM Palmyra township ... wedding universities W que su eighty eight point of mc ... grove\nPops field translator at Ninety four point nine of them is made possible with support from the Richard ... junior charitable foundation\nFor\nGood morning authorities are still investigating a series of parenting heightened tension\nProminent from the president is still blaming the latest on MORNING EDITION from NPR News\nAt one of the targets of the bomb\nAt one of the targets of the bomb George Soros why is he made so many political enemies I knew well king in Washington DC and I'm Rachel Martin reporting from Texas is twenty third rational\nComing up we'll hear from another house race in North Carolina where the demographics are contributing to a tight race in a traditionally Republican districts it's harvest\nSeason in the mid west will take you to Iowa or ... or in a wet growing season has been smaller profit margin farmers\nAnd maybe I'll think of him country artist Keith Urban for years on\nThe news is an act\nLibre NPR News in Washington I'm more of a Coleman federal and local law enforcement officers are searching the u._s. postal facilities in Florida NPR's Carrie Johnson reports it's believed that some of the ten pipe bombs addressed to democratic leaders and liberal activists may have been mailed from this location this postal service\nSo that he is an over locker near Miami the operating theory for now is that some or all of the ten packages went through that facility in through the u._s. mail investigators were looking for more devices but also any other clues\nNPR's Carrie Johnson says NPR has learned the leaves are promising that's because many of the devices are intact they did not explode the FBI's analyzing them at its lab in Quantico, Virginia agents will search for fingerprints or DNA on the devices or on the manila envelopes they were sealed in\nChina has denied in New York Times report that Chinese spies are listening to President Trump's phone calls NPR's Rob Schmitz reports\nFor Chinese official took a page from President Trump's own playbook calling the times report fake news Chinese foreign ministry spokeswoman watch when you suggested President Trump exchange his iPhone for his elbow and made by Chinese manufacture while way if the U.S is worried about security issues\nThe times reported that American intelligence so Chinese and Russian Spies are listening in when Trump calls friends on one of his iPhones and is using the information to try to influence him an impact the administration policy Trump pushback tweeting Thursday that he only uses government phones\nFor its part China's long been accused of efforts to target US government military and commercial entities with cyberattacks Rob Schmitz NPR News Shanghai\nImmigrant activist groups are preparing for families who are being released from detention to the streets on the southwest us border from member station ... in San Francisco Julie small reports there is NO PLAN to ensure their safety\nFamilies apprehended at the border used to get help from immigration and Customs Enforcement upon release in the form of a right to safe housing or other assistance\nThe agency no longer handles post really planning relying on nonprofits and churches to step in learned cues the cello with crosswords Justice Center of San Diego says the change puts families at risk\nThan they are who need to go on even though there are providers in the community or resources available to make sure that they are safe and healthy\nIce will enroll families and alternatives to detention or another form of supervision and issue notices to appear in court for NPR News I'm Julie small in San Francisco\nMeanwhile published reports say President Trump may sealed the southern border against migrants the Washington Post and the New York times report that would include people seeking asylum\nIt was learn Thursday that the president has ordered about eight hundred US troops to the southern border there's supposed with ... immigration and Customs Enforcement agents\nYou're listening to NPR News from Washington\nOfficials in the northern Mariano islands are calling for help from the U.S government the U.S commonwealth in the Pacific ocean not far from ...\nOfficials in the northern Marianna islands are calling for help from the U.S government the U.S commonwealth in the Pacific ocean not far from one was smashed by super typhoon you too it was a category five hurricane and there are some reports top sustained winds were one hundred eighty miles per hour\nThere are reports at least one person was killed officials say the destruction has been catastrophic the Associated Press estimates half a million people live there\nThat they department says the son of slain journalist democracy showed gene is heading to the United states with his family after the Saudi Government lifted a travel ban on them NPR's Michel ... reports\nThe Saudi king and crown prince offered salad ... and an uncomfortable looking photo out this week and they'd questions of whether he'd be able to leave the country State Department spokesperson Robert palate dino that the secretary of state raised is directly with the Saudi leadership\nActually confirmed this uh the secretary of state [noise] ah did make it clear to Saudi leaders that he wanted ... to be able to return to the United states and we are pleased that that is the case ...\nSays the U.S is still considering next steps in response to what the Saudis are now admitting was a premeditated crime Michele ... NPR News the state department game\nThree of the world series is tonight in Los Angeles the LA Dodgers we'll hope the Boston Red Sox Boston leads the best of seven series two games to none Boston is trying to win its fourth championship since two thousand for LA is not one since Nineteen eighty eight [noise] this is NPR\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... foundation\nGood morning here's a look now at the forecast will see partly sunny skies this morning and becoming mostly cloudy in the afternoon with highs around fifty rain is likely this evening was lows in the upper thirties or chance of rain is Ninety percent\nWill see a near one hundred percent chance of showers on Saturday with highs and the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain with Lowes in the upper thirties\nThis is your arts and information station W. V. I. F. him\nOr something of bumps to splurge something special color what you will or history or values lifestyle here we haven't forgotten to care [noise] guys and girls grown to be one of the most scientifically an innovative health care organizations in America but we've never\nForgot where we come from we care such an old idea mostly [noise]\n\nWB I asked him at NPR are like nothing else balanced fact based journalism and intelligent enjoyable entertainment and it's all made possible by listeners like you your contribution pays for programs like MORNING EDITION all things considered and the Ted radio hour community outreach like kids in the classroom and the great American read\nNothing has loves to public radio or W the IRA with a generous gift visit W vi Adolf ward recall one eight seven seven seven hundred nine eight for two\nIt's MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas home of member station Katie P. D.\nAnd I'm Noel King in Washington DC good morning investigators are still searching for the person or people responsible for sending ten suspicious packages to political and public figure\nThe gators are still searching for the person or people responsible for sending ten suspicious packages to political and public figures around the country\nWe're going to keep up keep updating you this morning with the latest on that investigation but first we're going to take a step back and look at how law enforcement has dealt with dangerous mail packages in the past\nAnd how that's informing this current probe\nJoining us now is NPR's national security correspondent Greg Myre yeah Great Hey Noel All right so the government is putting a lot of resources into this investigation at this is not the first type of investigation or investigation of this sort in the countries in recent history what have investigators learned from those those earlier probes\nWell the first of all we know these are relatively rare going all the way back to Nineteen Seventy they've just been fifty seven package bombs and twenty three additional cases of dangerous materials like anthrax or rice than um these figures come from the start consortium which studies terrorism at the at the University of Maryland\nBeen fewer than twenty death but one big change some of the cases in the past were very very hard to solve a the ... the Unabomber was on the loose for Seventeen years\nThere was the anthrax case it killed five people in two thousand and one that went on for seven years and then the ... the main suspect was a committed suicide before he could\nBe charged so technology now has made it much easier to track people or is intrusive as it may be what are some of the technologies and how to law enforcement officials use them\nSupport for WB I come from the economic Kirby said presenting mystery science theater three thousand on thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin I'm very sad or on Saturday October twenty seventh at five ... [noise]\nSome new and inventive ways now to honor all regions pan the brand pelican history buffs and Sullivan county B November Nineteen Harry Owens talking of the woman branch of the Lehigh Valley railroad details as CPA history dot com\nThe Wayne County Historical Society and homes yeah Kentucky Fried tours of the old stone jail November twenty four through ten AM to one detailed Wayne history P. A. dot org and the ... Historical Society at the time saver museum and Williams for getting into the holiday spirit on December ...\nAn exhibit of Ninety the twentieth century children's gate fled Christmas stocking detailed paper museum dog or\nW vi celebrates hundreds of regional art and cultural organization for details them anymore events took the w._b. I are the calendar catch up on our ... test that WVU all your dog or slash\nArt listen for art scene with Erica funky weekday mornings after the news at eleven on W. V. I. of them\nGood morning here's a look now the forecast will she partly sunny skies this morning's on becoming mostly cloudy in the afternoon with highs around fifty rain is likely the evening was lows in the upper thirties or chance of rain is Ninety percent\nWill see a near one hundred percent chance of showers on Saturday with ... and the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain was lows in the upper thirties this is your arts and information station W. V. like I ...\n\nSupport for NPR comes from that station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks endanger rentals a new episode every Friday on prime video\nFrom the S P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement an estate planning in the client's best interest let's make a plan dot org\nAnd from at Lausanne a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work\nBetter together more at ... dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning the billionaire George Soros is one of several public figures who've been mailed what are believed to be tightened bombs this week\nCirrhosis a hedge fund investor and philanthropists who donated to causes many of them progressive around the world and we should note that the open society foundation which he founded in Nineteen Ninety three has been a financial supporter of NPR\nDoors aren't as a lot of enemies in politics he's been a target of conspiracy theories from the right\nSebastian Mallaby is the author of more money than God a history of the hedge fund industry and I asked him recently if he was surprised to see George Soros among the U.S presidents and other prominent Washington figures who've been sent these packages\nTo me only if he was surprised to see George Soros among the U.S presidents and other prominent Washington figures who've been sent these packages\nWell the whole phenomenon of the pipe bomb or just surprises me in a poor me but um if you were to say that somebody was to make a list of you know progressive leaders they wants to attack\nThen I wouldn't be surprised to see George Soros on that list I think he is the single most important normal politician\nI'm spearheading progressive causes worldwide\nGeorge Soros has a really interesting personal history how about that and tell us how did he make all of his money\nWhen he was born in Nineteen fifty to a well to do Jewish family in Budapest, Hungary and so his childhood was dominated by the Nazi occupation of his country and he survived by separating from his family and I think that trauma explains a lot about the focus of his finance or in his politics and life\nAnd he left hungry at Seventeen to go to London and from that he went into finance he moved to New York he opened\nOne of the very early hedge fund in New York was a very successful stock market trade to so that by around Nineteen eighty he was worth a hundred million dollars but that was just to start because when he went into currency speculation in the eighties nineties\nAnd tell us briefly how did currency speculation make him rich [noise] well\nI'm In the nineties a specialty whereas a currency peg than looked on sustainable and famously in Nineteen Ninety two he broke the bank of England by betting that the bank of England\nCouldn't keep the British pound losing to the German deutsche mark and when the person's right or the pound collapse are us made enough food for sure and the u._k. economy are descended into chaos\nWhen did you start getting involved in politics in earnest\nIf the gun in his native Hungary and then in other European countries where his ... he had a clear political confidence which was to build for less than\nThat he was sort of in politics from that period and the eighties on words but the switch came in two thousand tree when he waited into us politics because of the Iraq War there once it became clear in two thousand four\nQuite how much money he was spending on demographic get out the vote causes that was the inevitable um counterattack from Republican uh and it became a useful trick\nIf you are being attacked in the major and you were a Republican member of Congress to say well the major it's lowering the credit of sorrow and his allies have put them up to it\nWhy does do some particularly become seen as a shadowy figure hiding in talk is he just because he had so much money\nYou know I think it's ironic that he's seen as a shadowy you caught expanding Russian neighbors actually hit for them to be a cool the open society Institute He's very open about it he published a figure about where the donations go so I think it's hard to escape\nThe suspicion that the critics who say he's shadowy I'm\nA ... on a long tradition of anti Semitism where George finances are portrayed as the shadowy figure to manipulate the politicians and therefore I think it's a fairly clear indication of that tradition\nWell why do people in his native hungry think of Soros\n[noise] he was a hero early on in the transition away from communism things have turned more recently because of the anti migration populist nationalism that has taken over the country\nSebastian Mallaby is the author of several books and a senior fellow at\nPopulist nationalism taken over the country\nSebastian Mallaby is the author of several books and a senior fellow at the council on Foreign Relations thank you so much fun to\nPresident Trump is headed to Charlotte North Carolina today to rally supporters for Republican congressional candidate mark Harris\nHarris it's kind of tight race in a former Republican stronghold against Democrat Dan McCready NPR's Kelsey Snell has more on how major shifts in North Carolina politics mirror changes across America\nFor more than fifty years voted in the ninth congressional district in North Carolina have been sending Republicans to Congress but things are changing didn't hear Harris a conservative Baptist minister is slipping in the polls behind mccready a Democrat and former marine\nDavid in the Clinton a professor of political science at Meredith College says the Trump rally is something that Republicans have to fight harder than there used to\nThe fact that President Trump is coming from Google signed the silk fee that raises winnable it would've been feasible two decades ago for a Republican president me become into that district\nNick Clinton said because of shifting demographics people from other states and other countries are flocking to jobs in places like Raleigh Durham and Charlotte young generations of farmers are doing it too he says like the rest of America Democrat in North Carolina dominate the cities and suburbs but things change the further out you go\nYou look at the political finds that I mean you can almost see the county line the shift between the Democratic signs are on one side of the county line and you're moving to another county more rural county and all of a sudden it's Trump country\nThe line it is so clear in other areas like Polk County where the view of the political trend line depends on who you ask how many commissioner ray Gaspar ... says the areas about sixty percent Republican but he's the only elected a Democrat\nAnd when he teaches party dominating in statewide offices in the future that doesn't mean the entire state and turning blue\nWherever hundred and ... and ... to ... or ... rule which for him to go much more Republican\n... county Republican chairman ... says rural Republican voters like Trump\nI'm seeing a trend where there's a movement away from the Democratic party\nTo the Republican Party just because there is a lot of dissatisfaction with what has been going on at the national of\nTrump's early could be the clothing pitch for Republicans who wants to keep at least the ninth congressional district from turning blue health is now NPR News whole county North Carolina\nThis is NPR News\nFederal vehicle just sitting around taking up space car truck motorcycle trailer or both the passage prime\nDonated to support ... and get a tax deductible receipt details or W. B. I. dot org slash cars are called ... WBAI a car versus your arts\nFive percent Harris slashing imports that knocked two dollars a bushel off the price as mints then we'll get costing him tens of thousands of dollars\nIt's one more thing that we have pretty much no control over it seems like that affects us greatly so I guess we're just kind of rolling with the punches here on this\nAnd the punches keep coming this year besides the terrorists persistent rain pushed harvest back by weeks and there's the new tax law that could have a big effect on farmers who sell their crops to the local grain cooperative\nIowa State university ag economist Kerry Jacobs says the laws changes make who to sell to a dicey proposition\nThat's what's hard to nail down and that's where farmers are in their marketing decision process at this point\nFor example a farm with lots of employees might be better off selling to a private ethanol plant but one with no employees might benefit from joining a co op Mike Howland who farms near Huxley Iowa serves on the border heartland co-op he\nSays even though he's been paying close attention he still doesn't understand how that changes will affect his bottom line\nI've contacted my accountant about it and he's still going to school and learning about it so he didn't feel comfortable at this point advising\nFor now Helen's more concerned with bringing in his crop\nMost of us will be glad when this year just over\nThe agriculture department promised farmers twelve billion dollars to help offset the tariff impact but ... says that's not a real sex\nBut we are in an election year so I figured there'd probably be something like that coming out [noise]\nI think\nHe co-op elevator enrolling to Iowa sees Web cranks open the hopper on a semi Gillette soybeans cascade into a pet from there there'll be conveyed to a nearby storage then\nCranks open the hopper on a semi to let soybeans cascade into effect from there there'll be conveyed by storage\nBeen I Wish they had a communist Chad Hart says higher prices are on the horizon\nAnd so as we look at it into the spring of twenty Nineteen we do see some reasonable prices out there but that means we're going to have to hold this crop for six seven months to get there\nAnd with all the rain some elevators are storing soybeans that can't sit that long meanwhile Mexico Malaysia Indonesia and even Argentina have stepped in to buy us soybeans\nChina went and bought a lot of buttons from Argentina left them a bit too short they had to kill them into the world market they bought some from us and so you're seeing some really interesting trade flows\nBut still about two hundred million bushels that would have gone to China need to find another customer\nOn dry days farmers are razor focused on just getting in this late crop but with terrorists taxes and quality to worry about this nerve wracking season isn't going to end when the last beans hit the band friend PR News I'm Amy Mayer in Ames, Iowa\n\nAmy story came to us from Harvest Public media station collaboration reporting on food and agriculture\nIt's NPR news support for WB I come from the FM Kirby sat presenting mystery science theater three thousand on thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin ... at the very center on Saturday October twenty seventh at five PM usually\nPrograms from our our\nYellowstone National park is home to a wide variety of native plants and animals but there is one animal is conspicuously absent mentioned that's near misses the pulse\nThe reason\nWe don't have roads in Yellowstone is because they were eradicated because it's been ... that was would consume too many of the bias in announcing the part\nI think the issue is the Northern Rockies regional representative for the defenders of wildlife he's part of the campaign to reintroduce the Yellowstone Park\nTo put things in perspective at the turn of the century and the United states particularly in the west [noise]\nSpecies like ... and we're near extinction commercial exploitation of those animals by early settlers a severely depleted most big game population and consequently a place like Yellowstone was devoted most of its energy trying to restore a species like the ...\nAnd it just didn't seem like there was a room in Yellowstone for predator at that time [noise]\nBut times have changed in elk in Dera'a flourishing without any natural predators to keep them in check\nIf left unregulated these populations of deer and elk often increase the extremely large numbers to the point where they can be destructive to the range that they live on\nAnd in fact eat so much of that range that when a hard winter comes starvation can be resolved\nAnd large directs in this population we saw exactly that happened in Yellowstone Park in the winter of Nineteen eighty eight [noise] where we had more than five thousand out dimes starvation specifically because their numbers have grown larger than what the available range good support [noise]\nThis archival program was part of our thirtieth anniversary so British and if you want to hear more check out\nOur podcast support for NPR comes from Pennsylvania was October SPA wind month celebrating Pennsylvania's locally grown and ...\nOur podcast support for NPR come from Pennsylvania wads October's PA one month celebrating Pennsylvania just locally grown crafted want with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\nSupport for NPR comes from the station and from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more at Raymond James dot com\nAnd from Harvard Business school executive education for executive that any career stage to prepare for new challenges through one of its comprehensive leadership programs\nLearn more at H. B. S. dot any slash executive\nIt's MORNING EDITION from NPR News I'm Noel King and I'm Rachel Martin listened carefully and you can almost hear Americans all over the country binge watching the latest releases from Amazon and Netflix\nThese two tech giants are now turning their attention to India that country's market for online video there is expected to reach over two billion dollars in the next five years\nBut so far neither company has had a whole lot of luck so Cardiff Garcia and Sally her ships from our planet money team identified some possible steps to success though I was\nWatching this movie recently on Amazon is a comedy guy gets engaged his best friend doesn't like the girl tries to break up the wedding\nThere is this whole complicated plot but that is all beside the point where it was really surprising with all the working which I told a shock to your own car about she's a journalist for the BBC I don't know if you have to working in the u._k. are you all at the same thing we\nDo a show on the covers Indian film and culture that's where you were watching an Indian film and there are all of these stereotypes about these films like that they're really conservative so I get it Sally you fell prey to stereotype\nIt's shameful but true and when I told us on the I was surprised by all the drinking and talking about sex and the movie she totally school me\nIndian cinema and not being the way you just described it in many many many is\nWell don't feel bad Amazon and Netflix also need to get up to speed on Indian film because they're up against a serious competitor India already has a major online content provider called hot star\nAnd hot star says it has about one hundred and fifty million monthly users according to counterpoint research\nHas eleven Netflix eat poultry five which brings us to our strategies for streaming success in India number one understand the market because if you think India is all Bollywood think again\nIndia and not just Bollywood\nBollywood movies are mostly in Hindi but according to India's last census a hundred and Twenty one languages are spoken in the country so plenty of Indian films are made in other languages\nYou know what when you go to the gate and go to visit and I remember in two thousand and five I live in a vintage I went up and then my that was showing Harry Potter but it was showing it would have handled out but I thought they were making and Donald step\nTo programming for culture most of the content Amazon and Netflix produced in the U.S plays well all over the country\nYou can show Portland in New York and Seinfeld and Portland that India is packed with different cultures and viewers want content relevant to them which is why Amazon and Netflix are using strategies three focusing on a niche in this case India's wealthy high earners\nPeople who can afford in other words an Amazon Prime subscription which is almost the same price as hot star just over one US dollars a month or Netflix around seven dollars a month and both Amazon and ...\nDescription which is almost the same price as hot star just over one US dollars a month or Netflix around seven dollars a month and both Amazon and Netflix said they're having some luck\nBoth are offering content in multiple languages and networks have the hit secret in gate and say ... thriller but if either wants to crack the Indian market there is one more thing though like we need hot star has this thing Amazon and Netflix do not have\nThe advantage of that ad in cricket because Indian cricket\nHot star has the license to show the ... that's the Indian Premier League like the NFL cricket and one last challenge shocked he mentioned Indians love sharing their logging but we don't have that problem here know Sally herself Cardiff Garcia NPR News [noise]\nThree of ... Mansfield WPRI you Ninety One point five ... ... how to universities W que su eighty eight point of MC them grow\nAnd translators do they do want to ... ... to eight nine ... there'll be too there were seven a Williamsport and W. to seven eight eight oh wells borough listener supported public radio\nProgramming on WB I made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nFor\nGood morning was riding voters to the whole mid term he then\nFrom a tight congressional district in some answers\nMORNING EDITION from NPR News [noise]\nWhat's on voters' minds here along the border immigration and an economy that is in some places booming I'm Rachel Martin in Del Rio Texas\nAnd I'm working in Washington DC also this hour we'll have the latest on the massive investigation into at least ten\nThe mission of intense a high profile printing\nAnd an story for twelve year old transgender boy talk about life in elementary\nFriday I'm over twenty say\nHappy birthday to a man of letter wheel of fortune ... jacket today and the news has next\nLine from NPR News in Washington I'm core of the ... the FBI is urging the public to pass along any information that may be connected to ten suspicious packages addressed it's weak to prominent Democrats most of these health pipe bombs one was delivered to CNN\nNPR on the low ... says the devices and packaging materials are being analyzed as investigators look for a suspect and a motive\nAuthorities say they can't be sure whether or not there are more packages being sent through the postal system so they're telling the public that if you find a baggage that you suspect contains an exclusive device to immediately call the police or the FBI and to get it investigated\nNPR's Hansi Lo long investigators have been focusing on the u._s. mail distribution facility near Miami homeland security secretary cure to Nielsen tilts Fox News that some of the packages originated in Florida [noise]\nMatthew Shepard young gay men brutally murdered in Wyoming Twenty years ago this month is being honored today at the national cathedral in Washington DC NPR's Tom Gjelten says shepherds ashes will be placed in a crypt at the cathedral\nProsecutors said Matthew Shepard was murdered simply because he was gay his going was seen as a classic hate crime highlighting anti gay bigotry Episcopal Bishop Gene Robinson himself an openly gay priest will lead the internment\nRobinson says the placement of shepherds ashes at the national cathedral the significant for the ... community\nLet's be honest here churches synagogues mosques have been the source of our greatest pain as ... people and for Matthew to come back to church is a remarkable step forward\nShepherds parents say he attended church regularly as a young man Tom Gjelten NPR News Washington\nThe Georgia secretary of state it's asking a federal judge to block a court order to change the way some absentee ballots are counted\nAnd the Georgia secretary of state is asking a federal judge to block a court order to change the way some absentee ballots are counted Georgia Public Broadcasting's Steven feller has more\nAt issue where several hundred absentee ballots that were detected for having signatures that don't match ones on file a federal judge has ruled that those ... plus any new about with the signature problem would now be provisional and voters would have until the Monday after the election to rectify problems\nBut lawyers for secretary of state Brian Kemp who is also running for governor say that making any changes this close to the election would bring uncertainty and confusion it's one of several new lawsuits against Georgia's election system for NPR News I'm Stephen Fowler in Atlanta\nPublished reports say President Trump made signed an executive order closing the southern us border to migrants\nThe Washington Post and New York times said that could include asylum seekers the White House says the Trump Administration is considering several options to address what he claims is a crisis of mass illegal immigration created by Democrats\n[noise] this is NPR\nPolice and Jefferson town Kentucky have identified it sets back who they allege shot and killed a black man and a black woman at a supermarket about Fifteen miles from Louisville Gregory Bush is alleged to have told an armed bystander not to shoot him because whites don't kill whites\nPolice now say that just before the stores shooting Bush had tried to enter a predominantly black church that was nearby\nThe world series shifts to Los Angeles tonight for game three the Boston Red Sox hold the two to nothing series lead from member station WNPR Shira Springer reports that Boston has been playing strongly\nThe red Sox arrive in Los Angeles riding a five game road winning streak during the playoffs they have clinched series wins in New York and used in outfielder Andrew been attendee says where the red Sox play doesn't affect them much\nThey were often and team regardless of where we ...\nSorry playing some tough choices so far this postseason and\nIt'd be a little warmer out there so that would be nice the Dodgers will be looking to rebound from too tough losses in Chile Fenway now history favors the red Sox winning the world series teams that takes two to nothing lead in the series go on to win the championship nearly eighty percent of the time for NPR News I'm Shira Springer\nOfficials in Jordan say that at least twenty people have been killed and flash flooding near the dead sea many of the victims were children in a bus that was carrying about three dozen people there's a rescue operation underway the low lying Dead Sea is vulnerable to flash flooding following heavy rain\nI'm core of a ... NPR News in Washington\nSupport for NPR comics from NPR stations other contributors include a log Meehan makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learn more at go to meeting dot com\nGood morning here's a look now at the forecast will see partly sunny skies this morning's on becoming mostly cloudy in the afternoon with highs around fifty rain is likely this evening was lows in the upper thirties or chance of rain is Ninety percent will\nSee a near one hundred percent chance of showers on Saturday with eyes on the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night live cloudy along with a fifty percent chance of rain with Lowes in the upper thirties this is your arts and information station W. V. I. F. M.\nProgramming on WB I is made possible by our members and by the University of Scranton to understand all that granted has to offer visit the campus experience the community was an open house event on Sunday November\nBy the University of Scranton to understand all that scratching ... at the campus experience the community was an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\nKnow [laughter] [noise]\nOut is that [noise]\nWe just release of method a knife in Nineteen fifty five Louis Armstrong reinvigorated his popularity of social Feinstein joined a gym standards from the W. via your studio in Williamsport Saturday Night at nine hundred billion [noise]\n\n\nSupport for WBAI it comes from a ... a family owned and operated Subaru dealerships since Nineteen Seventy ... Subaru is committed to your satisfaction with your purchasing ownership experience ... super rooted live in ... for more information Lucas who Bruce ...\nIt's MORNING EDITION from NPR News I'm Rachel Martin in Del Rio Texas\nAnd I'm Noel King in Washington DC good morning a massive search is underway for the person or people who mailed homemade pipe bombs to critics of President Trump\nAt least ten packages had been sent a prominent figures including President Obama his former attorney general and his former CIA director NPR's national justice correspondent Carrie Johnson has been following this story good morning Carrie good morning too well so what is the focus of this investigation\nThe investigation seems to be focused on to place and one is the FBI lab based in Quantico, Virginia which is analyzing these devices now while you know they look like homemade pipe bombs and experts at the FBI are looking for clues about\nHow the bombs were constructed aware um materials may have been purchased and they're also be looking for DNA or fingerprints the bomber may have left behind\nRetired investigators tell me and this is very promising because so many of these devices are intact they didn't explode but if history is a guide\nAnd this process of analyzing the devices is going to take a while it won't be overnight All right so Quantico, Virginia is one place with the second place and the second place is north of Miami at a package sorting facility in Florida in ... Florida\nThe operating theory for now is that some or all of these ten packages went through that facility and through the u._s. mail investigators are looking for more devices but also any other clues there\nThere's a lot of manpower deployed not just in Florida but all over the country the postal inspectors are on the case the FBI the bureau of Alcohol Tobacco firearms and explosives homeland security investigators and so our local police\nIs a stand up comic with cerebral palsy and that part of our stick\nTheir non oppression Olympics I Would win the gold medal Palestinian Mount Vernon\nI'm female I'm disabled and I live in New Jersey [noise]\nThrough the pain\nThat next time on the Ted radio hour NPR [noise]\nTo borrow a new uh W. V. I. A. F. N.\n[noise]\nLike what you see on WB IRA you enjoy fine programs like pulled ... no vote were nature be your kids love watching the antics of Elmo watch Sesame Street enjoy the science cuter curious George how 'bout shows like called the doctor Pennsylvania ... were scholastic scrimmage whatever the reason you watch we want you to know that you make it all possible\nBecome a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. V. I. A.\nBut why center present a Grammy Award winning body Stewart and it's fabulous to produce on Thursday November first at seven thirty PM at the Y. center tickets available Bucknell dot edu slash box office or five seven zero five seven seven one thousand\nGood morning here's a look now at the forecast will she partly sunny skies this morning then becoming mostly cloudy in the afternoon with highs around fifty rain is likely the evening was Los in the upper thirties or chance of rain is Ninety percent\nWe'll see you near one hundred percent chance of showers on Saturday with highs and the upper forties will also see wind gusts up to thirty miles an hour and Saturday Night looks cloudy along with the fifty percent chance of rain was lows in the upper thirties ...\nThis is your arch and information station W. V. like a a family\nSupport for NPR comes from the station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Tara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\n[noise] from fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more it fidelity dot com\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learned more it fidelity dot com slash wealth fidelity brokerage services L. O. C.\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks and Andrew rentals a new episode every Friday on prime video\n\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King good morning earlier this week NBC's Today show anchor Megan Kelly caused outrage with some on air remarks about Halloween costumes\nThe controversy on the outside to New York with ... as she dresses Diana Ross and who doesn't want to and she went to an around for one day I I don't know how like that got rate hollow why\nNow NPR's David Folkenflik is reporting that the network has dropped Kelly from the today show lineup\nAnd that she appears likely to leave the network because of the fallout from the comments the morning David ...\nOkay so this is not the first time that making Kelly has made controversial comments about race here she is in twenty Thirteen when she was an anchor on Fox News for all your kids watch at home than it and just as white she says it was a white man to tell us about her history of making racial comments\nWhile these aren't ah the only examples of their number I remember back in twenty and the Santa Jesus comments back from twenty Thirteen she later said she'd been joking and last year claimed that she she regretted those remarks but\nI remember back in twenty ten um she spent a fair amount of time on a tiny tiny heat group black hate group called the new Black Panthers a one I Believe them ultimately a face criminal charges related to voter intimidation she spent over three and a half hours in a three week period focusing on it as though it was a threat to the Republican\nIndeed as one of her former colleagues were counted basically yelled at a white liberal a strategist for about ten minutes to she felt was failing to take it a sufficiently seriously or one more example among several uh she keeps kept inviting the ... a former LA up a homicide detective mark ... farm in on the air to about a ... a\nCriminal justice issues and to talk about uh the question of a African American relations with police officer she of course had to admit on the stand he had said racist things over the years during the OJ trial um many people saw that as a as discredited thing she welcomed among show\nDo you think that history played a role in NBC's decision to let her go\nI think it's played a strong role in uh the reaction of NBC's colleagues particularly but not exclusively NBC's I'm African American journalists are outraged to her remarks about ah what she thought was the acceptability a black face\nYeah NBC's nightly news with Lester Holt did a whole segment about that controversy on its OWN Network which seems to suggest something about making Kelly's collie and their attitude toward her\nWill for you and me it might be an admirable exercise and transparency and I think it was that I think it's worth pointing out also Lester Holt the only African American anchor ah of any of the big three broadcast networks but it's also a sign that NBC was saying we're not going to protect the starting with we we might even though she's one of the most recognizable faces and TV news which is really interesting\nThe fact that she has been dropped I think it will surprise some people and I wonder does the weight and that we can handle these comments see something bigger about the way networks and companies are are tolerate it tolerating racialized or racist comments\nWell it's hard not to look at this in light of a you know direction at times very slow of major news organizations to the me too movement which was something that for a significant time making Kelly embraced a sheet accuser former boss at Fox News of sexually harassing her I also think you can\nMe too movement which was something that for a significant time making Kelly embraced a sheet accuser foul balls at Fox News of sexually harassing\nHer I also think you can't divorce it from the fact that Megan Kelly I received very tepid a welcome from her colleagues NBC News you just play some popular colleagues and that whole ratings themselves were mediocre and that even before all this happened uh she's been discussing with a network another role there\nUh because uh she needed to get out of that show now the show's gone and she's a negotiating her eggs as well\nNPR's David Folkenflik Thanks David you bet Mm\nIt's friday and time again for storing or today a mother talks with one of her kids about an important in life moments caissons Ford is the youngest of seven children when he was twelve years old case and sat\nDown at story corps with his mother Jennifer ... to talk about life in elementary school in Tuscaloosa, Alabama tell us a little\nBit about yourself I named Marshall August I played the standup base I Am learning how to play the guitar and I am transgender\nWhat level are you in martial arts on that level to blue belt that means I'm halfway to black though what is your favorite subject in school\nThe ... our lunch what\nGrade level where you are in school when he decided to tell your friends and family that you're transgender\nIt was around fifth grade when I told my friends and family out of this change in game because up until then I did not know that there were a kid\nIt was Mary every day\nI hated being called a girl I hated being called an ... foot most everybody in my family friends they were just okay because they kind of news that's coming yeah\nOver the summer I went to I Can't and they did not know I was transgender they just called me he that was awesome [noise] I think the happiest moment in my life\nWould probably be gene very sixteen two thousand Fifteen eight forty five PM you'd ...\nYou'd been telling me for quite a while they wanted boxers viewer wearing all boy clothes getting boy hair cut and that was like the finals\nChange and you are just ecstatic that is there anything else you would like for people to know about\nYou well even though I'm ... I'm a kid too I have homework the daily life I of tests to deal with\nI have been extremely proud of you because you have been true to who you are\nAnd you're very courageous\n... it shouldn't be scary it'd be who you are I mean maybe a little bit at first but it's way happier as way as me\nI don't think he realized what a leader you are people look up to you because you are not afraid to take a different path and\nWe know that it's your life and you're the one that's got to live at that we are there for you every single step of the way and we're going to do whatever we can to to lighten your load very proud to be your mom\n[noise] I'm proud to be done\n\nThat with case and Ford and Jennifer ... for the record\nTheir conversation was recorded in Birmingham, Alabama in twenty Fifteen they're interview will be archived along with hundreds of thousands of others at the library of Congress oh\n\nMajor support for historic or comes from Subaru featuring the all new rewrote seating for up to eight and a choice of second row captain's chair love it's what makes the Subaru\nRewrote receding for up to a choice of second row captain's chair love it's what makes us Subaru and sober and learn more it Subaru dot com [noise]\nThis is NPR News somebody vi celebrates the cultural life of our community art scene features with Erica funky weekday mornings after the news at eleven on WB I a FM missed one catch up anytime art scene on line at W. V. I. dot org this is your art\nAsked sheriff Martinez how the immigration debate is affecting people's politics here\nAnd like other folks we spoke to in Del Rio he said it's not top of mind for residents this is a relatively quiet part of the border the people who do sneak in get out quickly and moved to a bigger cities\nAnd even a Republican congressman will Hurd had spoken out against the wall he's facing a democratic challenger named Gina Ortiz Jones who's trying to tie her to President Trump\nBut this is a swing district in heard has positioned himself as a moderate and by doing so he's one of the support people like Jeff Martinez\nWill it come to an air of giving them the same tour like welders do you feel that our officers are he's been an advocate for us\nThis is interesting because sheriff Martinez like most\nWell he's he's held that our office he uh he's been an advocate for us\nAnd this is interesting because sheriff Martinez like most elected officials here is a Democrat and even though we didn't vote for President Trump and had some issues with his policies and his rhetoric Martinez is pleased about one thing\nThis administration the shirts have been invited to the table previous administrations\nWe worked or we were over there everybody else was even the bones were eaten bologna\nAnd I think that to solve the immigration issue the sure to be at the table you can't you can't just go to though because\nHe knows the battle over immigration it's going to go on for a very long time which brings us back to the original question what about that wall\nSay my idea was to\nYou can control with technology cameras\nA set of putting the physical structure because where are you going to put it\nHe points to the houses along the river on the U.S side of the border\nAre you going to put these people in Mexico are you going to put these people in the wrong side of the wall\nMeanwhile people like Amanda year a block out the noise about the wall she will vote for the incumbent Republican Senator Ted Cruz and Republican congressman will Hurd and she will keep going back and forth across the border in her backyard\nAs she did what I find\nAnd just like that were in Mexico\nHave exchanged faces right here where they dollar exchange so this is how can you we walked down the main streets filled with bars\nAnd stores selling all kinds of Mexican handicraft we thought that one storefront where a woman is sewing handmade dolls stress and colorful dresses\nFishy actually making them if not my sheet and they're not coming from China these are authentic Mexican food they cannot\nGet a check in with a smile machine not just for a long black hair over her shoulder and waved goodbye and I had I guess in her white SUV and weights and the law in line to cross back over into the U.S [noise]\nShe'll return in a few days though she has dresses that need tailoring\nFrom Del Rio Texas this is NPR News\nProgramming on WB I made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. off am\nI on Chris daily host of why from here are sometimes rockets sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags chock full of music and comedy for a long time favorites to new discoveries you didn't even know what you were looking for I Hope you'll join me this weekend for killer show with comedians talk very gifted edition Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop out by\nTomorrow evening at six Sunday night at eight\n[noise]\nSupport comes from a while for say October's national people would be a plan that includes fishes heart healthy one while for salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com [noise]\nNinety second nationally\nThere I'm saying Maynard chimpanzees can recognize each other from behind\n[noise] Ninety second nationally\nHi there I'm saying Maynard chimpanzees can recognize each other from behind\nWild chimps remember faces as well new research has found that the primates recognize the bus hawks of there can just as well as humans recall familiar faces for humans the face offers important information beyond identity such as attractiveness and health\nFor chimpanzees their ... can serve the same purposes for instance chimps can determine if the rump the sea belongs to a relative or to a female that's Avi lady\nColor plays an important role for Jim female primates have hairless faces and by the talks making skin features more visible female chimpanzees bottom or read Stephen in color and growing in size and the females obviously and nonhuman primates eyes are able to easily distinguished red tents\nSo researchers showed both humans and chimpanzees stimuli such as the faces\nBus oxygen as a control feed of votes humans and chimpanzees and sure enough when the chimpanzees were presented with images of blood talks they were much faster than humans to click on the correct such talks in [noise]\nIn Ninety second naturalist into production of Cincinnati Public radio and the ... with support from Cincinnati Public radio member it could spread the good news of the natural world [noise]\nSupport for NPR comes from the station and from American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot O. R. G.\nFrom the Charles Stuart Mott foundation for more than Ninety years supporting efforts to promote adjust equitable and sustainable society more it not dot org\nAnd from the John F. and James all night foundation helping NPR advanced journalistic excellence in the digital age\n\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Noel King on a cold night in Wyoming Twenty years ago this month a young man named Matthew Shepard was beaten and left to die\nShepherd was gay and his killing was widely seen as a crime of hatred NPR's Tom Gjelten reports that the internment of shepherds ashes at the national cathedral in Washington is meant to highlight the need to protect el G. P. T. people\nHere is sheriff Gary Paul's in Laramie, Wyoming at a press conference in Nineteen Ninety eight describing how Matthew Shepard was found\nUnconscious and actually as not being cautious\nShepherd had been hit to the head with a gun he hung on that fence for Eighteen hours before anyone found him he died in the hospital five days later two men were charged with murder and sentenced to life in prison\nProsecutors said shepherd was targeted simply for being gay\nWhether that explanation was entirely accurate has been disputed but it may not matter\nHate crimes happen anti gay bigotry is real and Matthew Shepard is for many the face of that phenomenon conditions very personal for me leading shepherds in tournaments ceremony at the national cathedral will be Bishop Gene Robinson\nIs the first openly gay bishop in the Episcopal Church he knows the sting of prejudice first hand\nI had to wear a bullet proof vest to my own Consecration as bishop of for the next two and a half years I had almost daily death threats so to be able to carry Matthews ashes in the procession isn't indescribable honor for me shepherds parents requests\nTo be able to carry\nMatthews ashes in the procession isn't indescribable honor for me shepherds parents requested that their sons ashes be interred here only after deciding against other places for fear any burial site might be desecrated\nThe cafe drill agreed to their request it's affiliated with the Episcopal Church among the most algae Beatty friendly determinations the river and Marion buddy the Episcopal bishop here she's the cathedral becoming a place of\nPilgrimage they were the young people from all across the country having tourists here and being educated here and when they passed by they were the plaque in his honor they will see that this is a church that\nHas learned that we need to stand and be counted as among those who work for the full embrace of all children\nHave to shepherds parents were at the Smithsonian institution's museum of American history yesterday to donate some of their sons personal possessions from his Superman Cape to his report cards Judy Shepard said she wants people to see her son as just like any other child\nEvery other child has to make ... every child has a pre school diploma every other child had all these things that are that you see it was absolutely nothing different about that other than who he left and I would you care\nThe shepherd's have another son that a shepherd says honoring his gay son at this point has a political goal to end discrimination\nWe had a straight shouldn't gays and they're not considered equal they don't have the same rights or why is that I Can't get an answer from anybody they want to take rights away from the algae ... when I asked them not compare with my two sons they can't tell me what\nWhen his ashes are and heard today at the national cathedral Matthew Shepard will be at a place of honor alongside the remains of Helen Keller Tom Gjelten NPR News Washington", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Williamsport", "day": "26"}