{"month": "10", "state": "PA", "station": "WVYA", "content": "\n[noise]\nThis is your arts and information station W. V. I. eighty nine point nine ... W. V. I. H. D. one granted Wilkes Barre Hazelden W. B. Y. eighty nine points that would have had Williamsport WTO eighty eight only three of them means Bert Mansfield at W. P. A. U. Ninety One point five FM Palmyra township\nStreaming live at W. B. I. I. dot org\nOur Pocono translator at Ninety four point three of them is on the campus of east Strasburg university\nThis listener supported public radio W. V. I. S.\nAnd the next fresh air Michael Lewis out there the best selling book the big short and Moneyball half about his new book this risk it looked at the federal government under President Trump and focusing on Trump's department at the energy agriculture and commerce and how unprepared they are now to deal with urging risks China [noise]\nIt's evening at six after all things considered on W. V. I Am\nWho\nGood morning the White House has now clarified yesterday I can question anyone want as long as the Supreme Court nominee ... ... ... we bring in the MORNING EDITION from\nTrump's administration has started blocking the normal working around the world Trade Organization\nI'm Rachel Martin and I'm Steve Inskeep how can a reef survivors of an Indonesian tsunami\nIf women were as free as men\nIs Tuesday October second the anniversary of a landmark legislative moment in Nineteen eighty six Republican controlled Senate joined the Democratic controlled house has\nWith a two thirds vote they overrode president Ronald\nFew years later apartheid ended here's the\nLive from NPR News in Washington I'm Dave ... Senate majority leader Mitch McConnell says the Senate votes on Brett Kavanaugh's nomination to the U.S Supreme Court will take place this week\nMcConnell's pledge on the Senate floor yesterday comes amid an ongoing FBI investigation into cabin all following last week's hearing by the Senate Judiciary committee where Christine Blasey Ford testify Kavanaugh sexually assaulted her when they were in high school that is something cabinet denies\nIn West Virginia police say they made more than a half dozen arrests after demonstrators stage just sit in\nIn Washington I'm Dave ... Senate majority leader Mitch McConnell says a Senate vote on Brett Kavanaugh's nomination to the U.S Supreme Court will take place this week\nMcConnell's pledge on the Senate floor yesterday comes amid an ongoing FBI investigation into Kavanaugh following last week's hearing by the Senate Judiciary committee where Christine Blasey Ford testify Kavanaugh sexually assaulted her when they were in high school that something cabinet denies\nIn West Virginia police say they made more than a half dozen arrests after demonstrators stage just sit and have the campaign headquarters of Senator Joe Manchin in Charleston\nThey called on mentioned to vote against Kavanaugh to the Supreme Court if and when his nomination comes before the full Senate they've missed itch with West Virginia public broadcasting reports\nThe women sitting in mansions campaign office said they were sharing their own stories of being targets of sexual violence in are collecting stories from others through an email address they've created Emily ... was one of the women arrested\n... people and ... and get through it and leave and they hit and I came here today\nMentions team released two statements on the sit in taking places campaign office but failed to indicate how we plan to vote in regards the cabin on he said he would decide after the FBI finished an investigation into the nominee for NPR News I'm Dave message in Charleston West Virginia\nLast night in Tennessee President Trump told supporters had a Republican rally in Johnson City Democrats are trying to destroy Kavanaugh and he urged them to turn out for the November midterm elections\nIn line blind ever since they lost the twenty six [noise]\n\n\nChoice between the Republican Party that is building our future and the Democratic party that is trying to our future down\nTrump was at the rally to support Republican Senate candidate Marsha Blackburn who's facing Democrats filled resident in November in Indonesia the death toll from last week strong earthquake and tsunami now tops twelve hundred the number of confirmed dead rose sharply over the last twenty four hours\nSearch teams discovered more bodies the city of ... has been especially hard hit homes and other buildings were leveled damage vehicles and boats can also be seen some are partially buried Indonesia is asking for help from other countries to deal with the disaster\nFrench police say they're carrying out anti terror raids near the port city of Dunkirk today about two hundred officers are involved in the operation that covers homes and the headquarters of a specific group so far no arrests made this is NPR News from Washington\n\nA top South Korean officials telling members of parliament North Korea has up the sixty nuclear weapons the unification minister and sold sites intelligence officials who estimate young young has at least twenty nuclear bombs and as many as sixty South Korea's national intelligence services not commenting\nSecretary of state Mike Pompeo was traveling to young young later this month to set up a second summit between President Trump and Kim Jong going for further talks on denuclearization\nThe UN's highest court says it can't force chi late to entered negotiations with Bolivia over the country has access to the Pacific ocean NPR's Philip Reeves explains\nLast access to the Pacific to lay off to war in the late Nineteen century getting that back has become a national mission Bolivia argues it would make a little different to ... to hand over bitten its coastline\nSecretary of state Mike Pompeo was traveling to young young later this month to set up a second summit between President Trump and Kim Jong il and for further talks on denuclearization\nThe UN's highest court says it can't force chi late to enter negotiations with Bolivia over the country has access to the Pacific ocean NPR's Philip Reeves explains\nBolivia last access to the Pacific to lay off to war in the late Nineteen century getting not back has become a national mission Bolivia argues it would make little difference to ... to hand over a bit of its coastline which is nearly two thousand seven hundred miles long the ... the issue was settled back in Nineteen oh full by peace treaty\nBut it is president even without it went to the un international court of justice in Netherlands I think it would rule that should I must negotiate as it giving his NATION What's described as suffer and access to the seat back home in his Capitol Lewis dancing in the streets Bolivian waited for the voting to be broadcast live in a giant screen\nAnd then disappointment when the court ruled twelve to three against Philip Reeves NPR News within the hour this year's Nobel Prize\nFor physics will be announced last year three Americans were honored for their work and detecting faint ripples in the universe called gravitational waves I'm Dave ... NPR News in Washington\nSupport for NPR comments from NPR stations other contributors include home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled\nHomeowners can read reviews of local pros and book appointments online at home at ... dot com good\nMorning here's a look now forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nThat chance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty Wednesday looks mostly sunny with high and the lower seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this listener supported\nPublic radio W. V. I asked them\nJoin us for a celebration of the one hundredth anniversary of the birth of Leonard Bernstein's\nOctober fourteenth street get reimbursed for gold with what you don't\nResent a program that includes excerpts from his age working in the west Side Story as well as the early ... and ... and the ... the if you like to enjoy the concert in this I don't need to make reservations\nDot org or by phone five seven zero five five to\nThey were the sounds of recent Oregon project from the shots of north in the dumps and Reuters and parking and churches and concert halls at home and abroad with children was Jonathan Ryan Gregory\nPeterson dean bill Myron Patrick Scott find out what's new this week on pipe dream from American public media a Michael Barone I Hope you'll be listening [noise]\nSunday Morning at six on W. V. I. A. F. at [noise]\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin a president who is often made demands of the Justice Department now in this whatever works it's all good\nMy White House will do whatever the senators want I'm open to whatever they want the one thing I Want to see\nPresident Trump was referring to the additional background check of Supreme Court nominee Brett Kavanaugh senators requested a week\nFor the FBI to check out allegations that Kavanaugh committed sexual assault while in high school the White House has affirmed now that agents can question anybody they want they made that affirmation after an expression of concern from us\nOften made demands of the Justice Department now insists whatever works but it's all good\nMy White House will do whatever the senators want I'm open to whatever they want the one thing I Want to space\nPresident Trump was referring to the additional background check of Supreme Court nominee Brett Kavanaugh senators requested a week\nFor the FBI to check out allegations with Kevin are committed sexual assault while in high school the White House has affirmed now that agents can question anybody they want they made that affirmation after an expression of concern for vital Senator Jeff flake Republican of Arizona that does no good to\nHave an investigation that just gives us more cover for example we actually need to find out where we can find out\nSo what are they finding out to NPR White House correspondent Tamara Keith joins us now she's also a host of the NPR politics podcast Tampa mourning mourning so the FBI has been out that now for a few days of this additional investigation who have they talked with us far\nAnd I will say this is not necessarily a comprehensive list but we know that they have spoken with\nOr ... frankly Frankfurt [noise]\nAnd you're listening to NPR News\nDes Moines is for a mixed bag starting at eight following the gubernatorial debate will begin at eight with a collection of bluegrass music originally scheduled for yesterday then at eight thirty it's the day sampling\nOf new releases ended nine it's our homegrown music segment with a week's time singer songwriter and a dead marsh\nNow and\nThis is George Graham joined us this evening starting at age ... beyond [noise]\nJoined is for a mixed bag starting at eight following the gubernatorial debate will begin at eight with a collection of blue grass music originally scheduled for yesterday than at eight thirty it's the day sampling\nOf new releases ended nine it's our him grow music segment for the week time singer songwriter and a dad Martin\nAnd\nThis is George Graham joined us this evening starting at age ...\nOn Shakespeare and kind of I Do love singing the well the weather's you\nHadn't treated Shakespeare is most popular pain the opening just says we are and we are all in the original romantic comedy\nCan be small and intelligent and as we won't but until you open yourself to a motion to make sense [noise]\nMuch ado about nothing in\nShakespeare in\nOctober twelve at night on\nW. V. H. T. V. good morning here's a look now the forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nChance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty Wednesday looks mostly sunny with highs and the lower seventies and Wednesday night books partly cloudy with lotion amid fifty this listener supported public radio W. V. like I asked them\nSupport for NPR comes from the station and from the lentils and foundation committed to improving lived through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available\nSeventy percent chance of showers and thunderstorms increases the eighty percent this evening with Lowes around sixty once they looks mostly sunny with high and the lower subsidies and wants to be my books partly cloudy with Lowes intimate fifty this was a listener supported public radio W. V. I. F. him\nSupport for NPR comes from the station and from the levels and foundation committed to improving lived through invention in the U.S and in developing countries and working to inspire and enable the next generation of inventors more information is available at ... dot org [noise]\nFrom the ... e Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for American children more information is available S. H. E. C. F. dot org [noise]\nFrom Heather ... gun poll jihad ... supporting African wildlife foundation working to ensure wildlife and wild lands thrive in modern Africa learn more at age W. S. dot org and from Americans for the ...\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the FBI is broadening its investigation into Brett Kavanaugh this week and with the Supreme Court nominees still in the news it's hard for a lot of us\nTo get last week's hearing out of our mind author Rebecca Traister keeps thinking about how differently the tone was of the two witnesses\nDr Blass before it was so deferential so polite so constrained\nI understand and appreciate the importance of you're hearing from me directly about what happened to me and the impact that it had on my life and my family\nAnd then in came Brett Kavanaugh his instinct was very public fury on his own\nBehalf of his number one in the class\nThat I thought no no no no going after some of them I don't know I'm gonna I'm sure I'm going to\nTalk about my ... year and walked me was\nThat was an exchange between Brett Kavanaugh and democratic Vermont Senator Patrick Leahy during those hearings Rebecca Traister says men in general are allowed to use a full range of expression and still come off as credible\nHe had in his arsenal the ability to use anger fury tears\nIn a way that he felt confident would resonate with the American people I don't think that Dr Christine Blasey Ford I Can't imagine a scenario in which she would have gone into that hearing room\nArmed with that same weapon that same tool that she could yell and be furious in her retelling of what happened to her\nPraised there's been exploring the idea of women and anger in her new book out today it's called good and bad the revolutionary power of women's anchor\nMoment that it occurred to me that I wanted to write this book it probably was just in advance of the women's march and you could feel the post twenty sixteen\nElection anger building and it wasn't just the anger of the women who were planning a women's march it was also anger at some of the white women who were planning a women's march after fifty three percent of white women had voted for Donald Trump the intra ally anger was crucial and important and then there was the women's march\nAnd it was the biggest single day political demonstration in our nation's history\nAnd it obviously made a big impression and yet I saw the political press not treated as politically serious and it was really dismissed and a lot of quarters as being about the pain cats the Pussy hats you know a bunch of women getting together and there's a pundit mark how print on MSNBC who asks the Monday after the ...\nWomen's march after fifty three percent of white women had voted for Donald Trump the interim ally anger was crucial and important and then there was the women's march and it was the biggest single day political demonstration in our nation's history\nAnd it obviously made a big impression and yet I saw the political press not treated as politically serious\nAnd it was really just missed in a lot of quarters as being about the cats the Pussy hats you know a bunch of women getting together and there's a pundit mark how print on MSNBC who asks the Monday after the women's march seriously what are these women gonna do not just running for school board down the road but this week\nAnd of course then that gets us to a year that has women protesters opposing the health care repeal teachers' strikes women running for office and historic numbers and then meet you\n[noise] you lean into history in this book and it's full of examples of men's anger\nBeing laudable creating admirable political change the Boston Tea party is a great example what historically what so threatening about women's anchor well in part\nThat anger of the founding our founders who were the white men chafing against their lack of representation and who were angry and protested in ways that we understand correctly to ... this is our revolutionary moment but when they made their new nation\nThey codified some of the very inequities that they themselves were angry about with regard to the British Government so\nThey built the nation on slavery and the disenfranchisement of women\n[noise] you referenced the racial dynamic of the me too movement earlier but I Want to ask again because women who speak out our condemned it in the broader culture under many circumstances but there is an outsized penalty for women of color who do so\nDo you think those voices are being heard loudly enough in this moment\nI think it's almost impossible for us to conceive of the voices of women of color as being heard loudly enough because they have been so unheard and so marginalized for so long and in fact it's women of color who have been\nThe leaders and the leading thinkers have so many of our social movements in ways that have remained invisible to us so when we think about me to one of the things that gets lost [laughter]\nIs that the definition of sexual harassment stems from cases that were brought in the seventies by women of color\nWho were actually borrowing legal ideas from a civil rights movement around racial discrimination and applying them to their cases of having in many cases been brutally sexually harassed in their workplaces\nIn Nineteen Ninety One it was a need a hill whose testimony against Clarence Thomas claiming that he sexually harassed her sort of cemented the idea that sexual harassment was not individual behavior but damage done to a class [laughter]\nIt's Toronto Burke who in two thousand six pioneers and leads the me too movement and then when the me too movement erupts\nI think it's really important that we understand that the first people to gain attention were very wealthy white actresses which is in no way I don't say that to diminish their experience with the reality of the harm they sustained but in fact\nAll of that is for grounded by women of color who stories so often get lost or kind of a raised\nAs the author of a book called good and bad the revolutionary power of women's anger you could not have to find a more appropriate time for your book to come out [noise]\nThat's true but that could have been true of so many other weeks of the past ... years\nWe have to say there are plenty of women who support Kavanaugh women who are indeed\nWay I don't say that to diminish their experience of the reality of the harm they sustained but in fact all of that is for grounded by women of color who stories so often get lost or kind of erased\nAs the author of a book called good and bad the revolutionary power of women's anger you could not have to find a more appropriate time for your book to\nCome out [noise] that's true but that could have been true of so many other weeks over the past ... years\nAnd then we have to say there are plenty of women who support Kavanaugh women who are indeed angry because they believe that this is a character assassination by the left so is women's anger only a productive force if it's done in the service to a progressive part of the nation\nNot at all it is very often politically potent and yet we're told not to take it seriously still\nI think that the anger that women are feeling around the country that is having a catalytic connective impact and this is part of a long process social movements take a long time\nAnd that kind of anger that women are feeling in this moment around calving off is going to be part of a far longer story that's going to extend deep into our future\nRachel spoke there with Rebecca Traister the author of good in math the revolutionary power of women's anger which is available [noise]\n\n\nPresident Trump can't stand the world Trade Organization here is in two thousand and Seventeen\nI get a headache thinking about who made these do you\nWant after another WTO in the White House in July\nWTO's street in the United states very badly\nAnd into Bloomberg News interview in August I Wish you the WTO was shingle stray deliver me and if they don't have a I Would withdraw from the WTO\nFor one thing the U.S government complained the judges of the global trading organization which oversees disputes overstep their bounds here's Robert Lighthizer us trade representative speaking last year at the center for Strategic and International Studies a Washington think tank\nThere have been a lot of cases that were uh in my opinion the decisions are really indefensible\nFor instance in response to a complaint from Mexico WTO ruled the U.S had to use the same standards for dolphins they've tuna in the Atlantic and Pacific oceans even though the conditions in animals are different\nMarriages Crowley is a professor of international economics at the University of Cambridge\nCountries like the United states the oh this is a little bit of an infringement on our right to regulate our own domestic consumer markets and so there's been a a small series of chipping away at these types of domestic discretionary policy [noise]\nThe world Trade Organization sits on the banks of Lake Geneva today is a beautiful beautiful day uh hardly a cloud in the sky lights in the eighties people are out in boats paddle boarding even swimming in Lake Placid um put inside the WTO are right now the mood is really different\nIt's without any question the case that this is a crisis\nKeith Rockwell's chief spokesman for the WTO says the organization is running out of judges to your appeals on trade disputes\nIn the past two years the WTO is going from seven judges to three by the end of next year it'll be down to one and unable to hear appeals which observers say could encourage more countries to violate trade rules and that rock well says could hurt the global economy\nThe rules of the game are not being adhered to and enforced it creates uncertainty and that affects investment\nIs that this is a crisis\nKeeps Rockwell is chief spokesman for the WTO says the organization is running out of the judges deer appeals on trade dispute in the past two years the WTO is gone from seven judges to three by the end of next year it'll be down to one and unable to hear appeals\nWhich observers say could encourage more countries to violate trade rules and that rock well says could hurt the global economy\nIf the rules of the game are not being adhered to and enforced it creates uncertainty and that affects investment decisions sourcing decisions\nAnd businesses could become more cautious about investing a new projects which could hurt jobs in gross us insisted just wants to reform the WTO but many observers are skeptical of Trump's intentions\nNow in order to make them better which you cannot do you are like the system I'm completely ignore it and that's what the Trump unrestricted doing today\nMarcello ... is a professor of international economics at the University of Geneva is Trump would rather do one on one deals where she thinks the U.S can get better terms because of the vast size of the American economy or a August spoke over Skype\nIf you ask me what I think he's distracted you date of ... to get rid of the joke because then the u._s. can do whatever he wants to come out being white ... district which actually I Want to drink owes us rules on every country\nWhich would up and the global trading order although Trump has threatened to pull the U.S out of the WTO he can actually do it without congressional approval but in the meantime the president\nCan make it harder and harder for the organization to do its job Frank Langfitt NPR News Geneva, Switzerland [noise]\nThis is NPR News usually program\nA few minutes we're going to pay a visit to the bottom of the\nI'm ... and this is the power of the [noise]\nListening to the Santa Ana winds blowing over the ice McMurdo Sound in Antarctica [noise]\nThe Antarctic is the highest driest coldest continent\nAnd it is totally covered by ice some two to three miles thick and the center of it is the south pole within the height of about ten thousand feet it kinda floats and frozen water\nDr Peter ... is director of the division of polar programs at the national Science Foundation\nThe lowest temperatures on us had been recorded in a Soviet station called vox stuck on the high plateau in the Antarctic and they're a hundred and twenty two hundred and forty degrees below zero in Fahrenheit if you're in temperatures of\nAnd if you have any wind\nIn addition to the cold temperatures your skin reliving in turn right ... [noise]\nSo when it is really cold and windy nobody will go outside as we do not have the closing that will allow people to be outside for any extended period time more than a few minutes\nGiven the difficult conditions there it's not hard to see why Antarctica has only recently than a home to human\nThe Antarctic he's the only continent whether you know indigenous people and the reason for that is that is almost totally ice cover only two percent are not ice cover then that's mostly rock\nAnd barren soil so that nothing whatsoever because my\nIt's really cold and windy nobody will say his name have cloning that would allow people to be said for in a few times more than a few minutes\nGiven the difficult conditions there it's not hard to see why Antarctica has only recently than a home to human\nThe Antarctic he's the only confident leather no indigenous people and the reason for that is that is almost totally I ... the only two percent or not I covered in as most of the rock and barren soil so that and nothing whatsoever with my [noise]\nMore of that Antarctic research for this\nProgram dirtiest anniversary celebrations you want to hear more check out our podcast\nEvery day thousands of Pennsylvania and mothers fathers children neighbors struggled to overcome addiction\nThat's Pennsylvania's public media station come together for battling opioids series of educational\nPrograms they focus on increasing awareness and reducing the stigma around opioid addiction to the story to find the resources available to you is it badly opioids ... or to gather we can save lives major funding provided by Geisinger\nSupport for NPR comes from the station and from that William and Flora Hewlett foundation committed to supporting ideas and institutions that advanced the wellbeing of women and improve lives and livelihoods and developing countries more information is available at Hewlett dot org\nFrom the doors do charitable foundation whos clinical scientists developments award support promising early career physician scientists and their research effort to improve human health\nAnd from the N E E Casey foundation this\nIs MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep one woman found a way to attack high health insurance prices\nAnd that's news because it's hard for any one person to do if you go to the hospital the hospital charges your insurer which passes the cost on to you and it's hard to negotiate a better price and that system Marshall Allen of the nonprofit newsroom ProPublica has been investigating high health insurance costs\nAnd he has the story of a woman who used her power to hold them down either Marshall\nGood morning Steve who is this woman or talking about sixty eight year old grandmother named Marilyn Bartlett and Maryland Bartlett took over the Montana Employee Benefit plan and twenty fourteen\nAnd when she took over the plan which covers about thirty thousand state employees and their families and that plan was in deep trouble it's self funded so the employer paid all the health care bills and it was projected to lose about fifty million dollars in the coming years and basically go\nBroke so the classic situation here that people in all sorts of insurance arrangements face where they're basically told healthcare is really expensive gets more expensive every year and we're short of money we need more from you\nExactly and if people hadn't noticed the cost of your health care benefits is rising there's about a hundred and fifty one million of us who get our health care benefits through our employers and part of the problem is our employers have been deferring to the medical industry when it comes to the cost of health care\nAnd so the industry keeps raising the cost and basically those costs keep getting passed on to the workers what did Maryland Bartlett do differently she had spent Thirteen Years working in the insurance industry\nAnd so she knew a lot of the games she was also kind of a massive nerd who knew how to follow the money and so working with our team and she compared what her plan paid each hospital in the state the bigger hospitals to what they were paid by Medicare\nThere are employers and part of the problem is our employers have been deferring to the medical industry when it comes to the cost of health care\nAnd so the industry keeps raising the cost and basically those costs keep getting passed on to the workers what did Maryland Bartlett do differently she had spent Thirteen Years working in the insurance industry\nAnd so she knew a lot of the games she was also kind of a math nerd who knew how to follow the money and so working with our team is she compared what her plan paid each hospital in the state the bigger hospitals to what they were paid by Medicare and Medicare published as its prices and so she could see\nThat her health plan was paying hospitals in the state anywhere from two times what Medicare gets paid to five times what Medicare gets\nPaid while and so she said that was too much\nIt was too much I mean the plan was going broke her charge was to get things under control and so she had to do some really hardball negotiating and why she decided to do which is kind of a revolutionary idea and the health care world as she decided to set her own prices and set the plans prices\nNow in this case you had some leverage and actually all employers have this leverage because the health care industry really does need our money so she said look you hospitals that are at five times and Medicare rate you're going to need to bring your prices down to about twice the Medicare rape\nI Wonder if hospitals simply had to accept that I'm thinking that in Montana there can't be all that many hospitals there surely would be a hospital there would just say listen our prices are price\nIt took some hardball negotiating she threatened to go public with the price variation and expose the high priced hospitals she called in the union to campaign against the hospital was holding out and they had a whole campaigns statewide they sent hundreds of postcards and made phone calls to the hospital executives and leaders\nTo listen to that story ac your smart speaker to play NPR or ask for your local member station by name [noise] you're listening to MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep [noise]\nThis is W. V. I. eighty nine point nine ... W. V. I. H. D. one scratching Wilkes Barre Hazelden W.\nB. Y. eighty nine point seven Williamsport WTO eighty eight points ... Mansfield W. P. I. U. Ninety One point five FM Palmyra township and such what how to universities W to ask you eighty eight point nine FM ceilings grow\nWe have a translator and collect some of the Ninety point three were your arts and information station listener supported public radio W. V. I. S.\nHuman beings I made up of just four letters CGI T the same for letters that every species McClellan has billions of letters of code if you had every pitch filled with ... g's and T's you'd have eight hundred dictionaries worth of genetic code\nAnd that code decide who we are a guy ride that story next time on the Ted radio hour from NPR Saturday afternoon or W. B. I Am Sam\n\nGood morning President Trump says the FBI should interview anyone they want about Brett Kavanaugh as long as they get it done quickly and picked directions\nKind of one week investigation being wheeled question a former assistant director of the FBI and I'm Steve Inskeep and I'm Rachel Martin department of justice is suing the state of California over net\nAnyone they want about Brett Kavanaugh as long as we could have done quickly and picked directions\nComprehensive could have one week investigation be will question a former assistant director of yes we are and I'm Steve Inskeep and I'm Rachel Martin the department of justice is suing the state of California over net neutrality how far will California go to try to treat all website said and several states are reforming\nTheir prison mail since then but er the reform making it worse than parents Sherlock fortune tellers of Lebanon\nDo that every second the birthday of TV host Kelly Ripa he turns forty eight years old they\nThe newscaster coming up next\nLive from NPR News in Washington I'm more of a Coleman this year's Nobel Prize in physics has been awarded to three scientists\nArthur Ashe getting Frenchman ... and Canadian Donald Strickland the Nobel Committee sites their groundbreaking inventions in the field of laser physics\nSenate majority leader Mitch McConnell says the Senate will begin voting this week on Brett Kavanaugh's nomination to the Supreme Court that's despite an FBI investigation into sexual misconduct allegations against the judge currently underway\nThe FBI continue to question some people professor Christine Blasey Ford was the first woman to publicly accused Kavanaugh and ... says agents have spoken to a friend of\nHers we know that they have spoken with\nA woman named ... she is a friend of Christine Blasey Ford who ah was according to forward at the party where the alleged assault took place again another woman Deborah Ramirez\n... she was the subject of a New Yorker article who said that a cabinet had exposed himself to her at Yale she has spoken to the FBI and also according to our reporting\nProvided at the FBI with a list of more than a dozen names of people who she says we're either witnesses or learned about the event contemporaneously\nNPR's Tamara Keith President Trump is reiterating his support for Kavanaugh he spoke at a political rally Monday Night in Johnson City Tennessee from member station W. E. T. S. Wayne Winkler has more\nIn front of a crowd of over a thousand supporters President Trump reiterated his support for his nominee to the Supreme Court Brett Kavanaugh\nDemolish destroy\n\nAre willing to do anything to anyone to get there\nWas a judge Kavanaugh\n[noise] residents will be in the Memphis suburb of south even Mississippi tonight with stops later this week in Rochester, Minnesota and Topeka, Kansas\nWayne Winkler reporting disaster officials in Indonesia say more than twelve hundred thirty people have been killed in last week's earthquake and tsunami\nAftershocks continue and aid workers continue to discovered the body to victims it's been four days since the disaster the BBC's Rebecca ... reports food and water are running low in the provincial capital Paolo\nMilitary trucks come into town as well as a convoy\nBringing aid that the situation is hands people here are being incredibly patient sitting under these tents in very hot weather\nThat tensions have bailed out a thought on road not far from where I Am ... people have been new tank and to a team that is now tied and shots\nBen four days since the disaster the BBC's Rebecca ... reports food and water are running low in the provincial capital Paolo\n... military trucks come into town as well as a convoy\nBringing in a situation is hands people here are being incredibly patients sitting under these tent in very hot weather\nThat tensions have failed out of our on road not far from where I Am where people have been new tank and to a team that is now tied and shots will fight in the ad in order to calm the situation down\nIts NPR heavy tropical rain from what was tropical storm Rosa in the Pacific is bringing heavy rain to southern and central Arizona the national weather services parts of Arizona are at risk for excessive rain with additional chances for landslides and debris flow\nWatchers are posted in several states including California Colorado Utah Nevada and as far north as Idaho\nThousands of people marched in Barcelona, Spain on Monday marking the first anniversary of an independence referendum in Catalonia region Spain rejected the vote as illegal let's see it but if he this report separatist leaders are still pushing for dialogue with the Spanish government\nActivists blocked major roads and railways for several hours and the students tractor an estimated Thirteen thousand people to the streets of Barcelona according to local police they marched behind a banner that read we won't forget neither will we forgive\nLast year in October first got there and separatist leaders planned an independence referendum vote despite warnings by Madrid that such a move was banned Spanish police showed up to prevent people from voting injuring hundreds\nThe yes one with the forty three percent voter turnout but a declaration of independence was cut short when the Spanish government assaulted the autonomy has got the lung government\nFor NPR News I'm Lucy had been a fetus and Barcelona\nFirst lady Melania Trump begins her tour of African countries today her focus is on child welfare she is traveling without President Trump Mrs Trump will start her visit in Guyana followed by stops them allowing Kenya and Egypt I'm corporate Coleman NPR News\nSupport for NPR comments from him be used by over three million businesses for hiring more employers can post jobs and huge green or question to build their short list or preferred candidates learn more and indeed dot com slash higher and the corporation for public broadcasting\nGood morning here's a look now forecast\nWill she mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some other storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nChance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty Wednesday looks mostly sunny with highs and the lower seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this was listener supported public radio W. V.\nLike ...\nLike what you see on WB IRA you enjoy fine programs like pull dark nova or nature for your kids love watching the ethics of Elmo on Sesame Street enjoy sit at the science cuter curious George how 'bout shows like call the doctor Pennsylvania ... or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. vi\nIs older Arts Center for science classical pianist Llewellyn Sanchez Werner Sunday October seventh of two PM the Twenty one year old was named the Gilmore young artist at an age fourteen made Juilliard School\nKids love watching the antics of Elmo on Sesame Street and she always said the science kid are curious George how 'bout shows like called the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. V. I. A.\nHis owner art center for saying classical pianist Llewellyn Sanchez Werner Sunday October seventh and ... there's Twenty one year old was named the Gilmore young artist and in each fourteen made Juilliard School history for tickets six one zero seven hell you are or solar art center dot org\nSupport comes from the times tribute for over a century the times Tribune in Scranton ... northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times tribunal there for you and ... news dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Senate majority leader Mitch McConnell is promising Republicans their moment the Kentucky senator has spent years leading the way and Republican efforts to dominate the courts Senate Republicans held many judge ships open\nFor long periods during President Obama's administration even including a Supreme Court nomination that was blocked until after the two thousand sixteen election\nNow a Republican Supreme Court nominee has been delayed and McConnell is determined to proceed\n... analyst Elana structure that's gone through a close ... nominations out of committee or considering it here on the floor and missing pride and will be voting\nThis way this week that means the FBI as a few days left to vet the nominee Brett Kavanaugh faces accusations of sexual misconduct an assault from decades ago\nThe White House insists that agents now have the freedom to question anyone they want about those allegations those following the story include Chris slacker assistant director of the FBI from two thousand four to two thousand six mourning\nMourning Steve do you have confidence the bureau can go where at once and speak to whoever wants to\nYou're listening to NPR News the white Center for the performing arts presenting Cristina Pato master of the leash and bagpipes on Thursday October eleventh at seven thirty PM at the Y. center tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand [noise]\nI just as Ari Shapiro host of all things considered when I'm hosting the show I'm always listening for the thing that's the ... the thing that jumps out of the radio and grabs you the thing that will make you go home to your spouse when your kid of your friend and say hey we'll never believe what I heard today\nAll things considered listen every afternoon\nMonday through friday guide for weekends at five on WB I Am found\n\nOn shake standing by do nothing in the well the weather the cannon treated twin Shakespeare's most popular pain the opening just says we are and we our homeland as the original romantic comedy\nCan be small and intelligent and is with you won't but until you open your own self promotion and limited access\nMuch ado about nothing in\nShakespearian [noise]\nFrom years October twelve nine on W.\nV. ATV support for NPR comes from Pennsylvania ... October ...\nI Do nothing in the well the weather's you can have treated twin Shakespeare's most popular pain in the opening just says we are and we are all in as the original romantic comedy\nCan be small and intelligent and as with you won't but until you open your own self promotion and then the access\nMuch ado about nothing hadn't had\nShakespeare in ... [noise]\nFrom years October twelfth night on W.\nV. ATV support for NPR comes from Pennsylvania was October SPA wind month celebrating Pennsylvania's locally grown and crafted wind with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\nGood morning here's a look now the forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some under storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nThat chance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty Wednesday looks mostly sunny with high and low or seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this listener supported\nPublic radio W. V. I asked them\nSupport for NPR comments from this station and from cancer treatment centers of America offering immunotherapy and other personal lives of treatment options to address patients individual needs more about precision cancer treatments had Cancer Center dot com\nFrom Trader Joe's offering new products and every store and new episodes of the original potash series inside Trader Joe's at apple pie cats or where pod cats are available more at Trader Joe's dot com\nAnd from a log me in maker of go to meeting proud sponsor of how I built this entrepreneur summit taking place in San Francisco at the ... center October sixteenth more about the summit at NPR dot org slash summit\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Minnesota Congressman Keith Ellison faces an accusation of domestic abuse\nAt least one investigation says the claim cannot be substantiated although that investigation was paid for by the Minnesota Democratic Party Republicans have called it a sham and called for a pro by the Minnesota attorney general Brian backs to Minnesota Public radio has more\nGiven the intense focus on assault allegations made against Supreme Court nominee Brett Kavanaugh the Ellison situation is far from ideal for Democrats who want accusers taken at face value\nCongressman Ellison is deputy chairman of the Democratic National Committee and want a crowded primary from Minnesota attorney general just days after the abuse allegations surfaced\nHis ex girlfriend care Monaghan says he tried to pull her from a bed by her feet two years ago well swearing at her\nShe says she captured in on a cell phone video that she hasn't released\nIts not try to keep the people that they\nThat was Monaghan in August speaking to Minnesota Public radio about why putting up the footage would cause more harm\nIt nearly it's traumatizing for every family involved for\nShe wouldn't turn the video over to the party contracted investigator either it was the main reason the lawyer examining the case called the abuse claim unsubstantiated\nAllison says there's no video because it didn't happen in a written statement he praised the investigator for a fair review and said he's ready to focus on more pressing issues last week he accused opponents of fixated on the claim for political gain even though I uh\nHumiliating it's traumatizing for every one family involved and for me\nShe wouldn't turn the video over to the party contracted investigator either it was the main reason the lawyer examining the case called the abuse claim unsubstantiated Allison says there's no video because it didn't happen\nIn a written statement he praised the investigator for fair review and said he's ready to focus on more pressing issues last week he accused opponents of succeeding on the claim for political gain even though I uh\nNever engaged in a\nDomestic abuse I'm addicted is a very serious serious issue into simply politicized that I think is incredibly ...\nBad Republican opponent Doug war most of the investigation is tainted because the law firm behind it worked extensively for the state Democratic Party known in Minnesota as the DFL\nPolitically motivated should and shouldn't there was always going to take root in favor of liberties endorsed candidate attorney general\nPolls show ward though has a real shot to become the first Republican to win the office and a half century and for weeks from election day Republicans are working overtime to make all democratic candidates and competitive races account for Allison\nFor NPR News I'm Brian backed in St Paul\n[noise] oh the people of Lebanon have lived through generations of war and the perpetual sense of insecurity\nThat comes with it so the urge to know what's coming next maybe especially strong that's where fortune tellers come in NPR's Ruth Sherlock in Beirut went to see what the future will hold\nNew Year's eve image file wax and celebration Lebanese switch on that TVs in touch of clues for the coming yeah\nMay not to let these ... women would be fun to\nPredict the future of politicians celebrities and nations\nHad plenty of what other than the other them\nShe says it this year and that's an on always on the brink of conflict will be bad from\nWar and he has set a new at all no method at the that\nThat will be an economic collapse and riots in Europe that out of out of ... and I saw from the only see Sarah nothing on [noise]\nAway from the spotlight you can find fortune tellers and even the most remote little towns and villages the practice seems to cross Lebanon strict religious divide too you can find respected prevalent in Christian and Muslim communities\nAnd junior a Christian town ... we step inside caffeine that's half the cup in French\nTo plant has lineup goals end up writes lime green ceiling\n... for the fortune teller he's working in a small room at the back behind plastic to\nWoman asked us not to name her because her husband doesn't approve of this\nAnd the men that they don't touch my husband's never believed in the piece is that something stupid\nBut she says fortune telling is incredibly popular among have female friends all over the country\nThey like to see that she was just leaving many people that I don't know like it's a fashion\nBecause it wouldn't have too much but I live on them\nShe says it's a remedy for living in such a politically unpredictable place these clues to the future they can be comforting\nThat's is that a lot\nThe fortune ... and then move back in the ... we sit crammed on a small couch with a client to introduce his head\nTo see that she was just leaving many people that I don't know like it's a fashion\nBecause we wouldn't have too much but I live on them\nShe says it's a remedy for living in such a politically unpredictable place these clues to the future they can be comforting\nYes that is that a lot\nThe fortune teller and then my little back in the ... we climbed\nOn a small couch with a client who introduces herself only as an it now and then I asked because on one of his name meant that has been coming here for ... years she's had ... and he warned her that her husband had hot and properly heated saving his life and ... what a Christian crosses hang\nOn the rules of Mali cafe\nThere some religious leaders condemn fourteen telling as a ... minute believe that it's actually a way it's coming closer to God I Know on the left and to be on a plane heck level and started with the operation of St chat about it\nAnd Lebanese Christian figured known for his capacity to heal and they let my colleague lemme ... she says\nI pay more than most people every time before I'm about to tell somebody's fortune I Do the crime I encourage people to pray as well and she said there's some peace and among those who do criticize my work but from I tell them to pray\nIn the end she says ... ability to see the features shows connection to God ... assistant brings a tray of Portland cups filled with thick Arabic coffee at the sweet smell of cod demand rises in yeah [noise]\nAfter we drink ... ten my empty cup upside down and kids inside rather coffee grounds have formed a Pashtun she looks at me\nWe've full name bowling poll well\nShe guesses the name of my boyfriend ... bought\nNew but sometimes you guys drive each other crazy that's very true [laughter] and oh she predicts happy things lemme we'll soon find a new love\nAnd now what will lead to many big scoop is she right [noise] I Need the future will tell reached shut up and the unease junior\nThat is President Trump's few experts say the new NAFTA resembles the old one although with some improvements NPR's Yuki Noguchi reports\nAmong other things the new U.S Mexico Canada agreement would encourage regional auto parts production open up Canadian dairy market and set new rules for digital an intellectual property\nCeleste Drake analyzes trade and globalization the AFL CIO the largest union in the U.S in her view it could also address one big problem with NAFTA it would require Mexico to allow its workers to unionize\nThat would make a meaningful difference for workers in Mexico and their ability to organize and get their wages up which by the way has a positive benefit on American workers and Canadian workers because now there is such a huge wage differential\nThis is a big departure for unions which have historically oppose trade deals in the past they argued globalized trade hurt their members interest by off shoring jobs so it's unusual to hear unions praising some facets of this new deal but to be clear the AFL CIA [laughter]\nFor workers in Mexico and their ability to organize and get their wages up which by the way have a positive benefit on American workers that Canadian workers because now they're in such a huge wage differential\nThis is a big departure for unions which have historically opposed trade deals in the past they argued globalized trade hurt their members interest by off shoring jobs so it's unusual to hear unions praising some facets of this new deal\nBut to be clear the AFL CIA oh Teamsters and others say they remain undecided about whether to support the deal mainly Drake says because it's not clear how the U.S would be able to enforce the new labor provisions with Mexico\nBecause if you don't have real effective enforcement then you don't have anything changing\nLori Wallach agrees she's director of global trade watch a consumer advocacy group she says ultimately support for the deal will depend a lot on details that have yet to be decided\nAnd unless strong labor and environmental standards are subject to swift and certain enforcement the outsourcing and race to the bottom and wages isn't going to stop\nShe likes the fact that this deal would eliminate rules permitting companies operating in foreign countries to sue the host government which Wallack says allows them to circumvent local labor and environmental laws\nThere are elements of the proposal Wallach cries for example the new deal allows a longer term on pharmaceutical patents delaying the introduction of cheaper generic drugs\nThat could undermine the changes needed in our country to make medicine more affordable here\nBut it's the auto industry that would be the most affected by the deal it would require automakers to boost the percentage of parts made in North America to Seventy five percent in order to avoid terrorists Chad ... is a senior fellow at the Peterson Institute for international economics\nHe says such new requirements would have ripple effects\nOr some parts to that now has to be made with workers that are earning higher wages\nAnd that just means that the cost for automobiles in North America are likely going to go up\nThe big three us automakers would benefit because many of their cars would be compliant with the new rules that balance as it makes the U.S a less appealing place to make cars for foreign automakers\nThese rules don't apply if you're building a car in Asia you're building a car in Europe and those are going to be relatively cheaper places to build up mobiles to export anywhere around the world\nAnd that he says could offset some of the labor gains from the deal ... NPR News Washington\n[noise]\n\n\n\nThis MPR news is recorded university where the polling Friedman art galleries hosting the exhibit contemplating character featuring one hundred fifty two rare portrait drawings and ... through December second information and gallery hours it was recorded dot edu slash part\nIt's October and live from here with my family is kicking off it's even hardly strictly bluegrass in San Francisco this weekend [noise] you know the one with the Golden Gate bridge\nTune in for a special guest Lindsay Buckingham answer rate for the riff raff\nRadio players will be there with our new music director Mike Elizondo and our news team with our allies in America correspondent Tom Papa don't midnight Saturday and Sunday night today on all the V. A. S.\nIt's through the support of listeners\n... and the line from here with my family is they cannot even hardly ... men for the weekend [noise] you know the one with the Golden Gate bridge\nTune in for investment and Lindsay Buckingham an arrangement wrap\nHome radio players will be there with our new music director Mike ... and our new team with are now in America and bonding time pop on Saturday and Sunday night today on W. V. I. A. F. at\nIt's through the support of listeners lucky you that W vi is able to provide the excellent programming you enjoy daily learn more about membership at our website W. B. I. A. dot org signed up today and thanks from all of us at W. B. I. A. [noise]\nNinety second maximum\nBy their I'm paying Maynard Marlon sets are small monkeys that live high up in the canopies of South American rain forests there are more than twenty species and most could fit comfortably in adult humans hand\nMost pharmacists are smaller than a squirrel but the pygmy ... is the smallest of all and the smallest monkey in the world\nThey're only about twelve to sixteen centimeters long and weigh less than a hundred and forty grams ... is one of the larger cities with a link to twenty three centimeters in a way to around five hundred eight hundred grams\nFarmers that are active during the day and spend their time foraging there are social animals that live in small groups called troops made up of four to Fifteen relatives and are often territorial\nA territory for a common market truth can range from one to aid actors like people ... which means they eat a variety of food but their diet includes insects fruit trees apps and other small animals\nPygmy Maurice that love the south of trees they saw holes into the bark of the tree with their teeth to get at the south and can make thousands of holes in a small selection of trees over a fairly short period of time\nIn Ninety second naturalist into production of Cincinnati Public radio ambitions in ... new with support from Cincinnati Public radio members to spread the good news at the natural world [noise]\n\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with the church for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa NA\nFrom Rhodes Scholar and not for profit offering learning adventure it's for adults in natural settings across the country learn more at R. O. A. D. scholar dot org slash retreat and from Americans for the fact\nThat this is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep three people share this year's Nobel Prize in physics they are being honored for quote groundbreaking inventions in the field of laser physics\nTwo of the three work together one worked independently\nAnd one is a woman the first to receive a Nobel in physics in decades NPR's Geoff Brumfiel is years after morning good morning okay the pairing first ... French scientist and Donna Strickland a Canadian both of whom did much of their work at the University of Rochester what does that work\nThey did something called a tripped pulse amplification this is a technique that allows you to take a pulse of laser light and make it more powerful and that was a real problem early on in the development of the laser or you know lasers were developed decades ago but then\nThey sort of got brighter and brighter and then they stole it out and this technique really allowed them to grow brighter still and that helped them\nThere are more ... French scientist and Donna Strickland a Canadian both of whom did much of their work at the University of Rochester what does that work\nThey did something called a tripped pulse amplification this is a technique that allows you to take a pulse of laser light and make it more powerful and that was a real problem early on in the development of the laser or you know lasers were developed decades ago but then\nThey sort of got brighter and brighter and then they stalled out and this technique really allowed them to grow brighter still and that helped them find many applications\nOkay we're going to talk about the applications in a moment but I Do want to ask how big a deal is it to see strictly to see her name attached to the Nobel Prize in physics\nWell this is only the third Nobel Prize in physics to go to a woman in the past hundred and Fifteen Years while at the last one was Nineteen sixty three and so Donald strict than was asked about this in the press conference in even she seem a bit surprised by that\nFact you are that sad woman ever getting that no prize in physics let's get comments on that\nOkay I can\nBut it's true yeah there's only been an issue others um breed ... mayor in Nineteen sixty three and Marie Curie in Nineteen oh three and there have been many good female physicists who has been widely held were overlooked does surprise does\nThis suggest a an advancement for women physicists\nI'd say it's more like the Nobel Prize is trying to stay relevant in the heart scientists especially\nAh Internet entrepreneur and started this new age we're in have started giving their own prices\nThis year one of those prices went to a woman named Jocelyn bell burnout who had herself and overlooked for a Nobel Prize that prize was first three million dollars the Nobel search just for around a million new so you know I think the Nobel Prizes are falling behind the times and they recognize that and\nThat's really interesting okay there's a third Nobel Prize winner Arthur Ashe can is his name Bell Labs and New Jersey the place where he did much of his work um optical tweezers is the phrase in front of my eyes here what an optical tweezers\nThey are actually exactly what they sound like with using lasers which is light tumbled physical things objects wow and that actually works believe it or not light can exert a little bit of pressure and so\nIf you tuned to lasers just right you can manipulate very very small things are really tiny particles when you're ... individual atoms even wow and so what are the practical applications of the work of these three people\nWell the optical tweezers are used in a variety of applications um for moving around small biological molecules proteins DNA things like that and also in physics it's used pretty widely\nOil by rail and so we're Nebraska I'm Jeff from marketplace [noise]\nOur producers are Michael looking pretty long and Daniel ... I'm ... short with the marketplace morning reports\nFrom eight PM American public media\nSupport comes from the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community with open house event Sunday October twenty first or Sunday November fourth see how one of America's premier colleges will open doors for you\nSupport for WBAI comes from the citizens voice providing loser in county with breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go citizens voice here to stay more information as citizens voice dot com\nIs your arts and information station W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre hazel to W. B. Y. I. eighty nine points I have an F in Williamsport W T I O s\nSo then Sunday October twenty first or Sunday November fourth she had one of America's premier colleges will open doors for you\nSupport for WBAI comes from the citizens voice providing loser and county with breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go citizens voice here to stay more information as citizens voice dot com\nThis is your arts and information station W. V. I. eighty nine point nine of them W. V. I. H. D. one scratching Wilkes Barre who's Wilton\nW. B. Y. I. eighty nine points I have enough in Williamsport W T I O eighty eight points ... Mansfield W ... or you know the one point five and ...\nAnd ... how to universities W to ask you a be a point on FM ceilings grove were in Bethlehem at one of five point seven this was listener supported public radio W. V. I Am\nWho\nGood morning be updated version of the north American free trade agreement next faces a vote in Congress will question the presidential advisor\nMORNING EDITION from NPR News [noise]\nRather than tempted minister Haitian has started blocking the normal workings of the world Trade Organization\nI'm Rachel Martin and I'm Steve Inskeep how can we have reached survivors of an Indonesian tsunami\nAnd one would have happened if women were as free as men to show\nUsed to be October second the anniversary of a landmark legislative moment in Nineteen eighty six Republican controlled\nSenate joined the Democratic controlled house passing sanctions against South Africa\nTwo thirds vote they overrode president\nLater apartheid ended ... years in the\nLine from NPR News in Washington I'm Korobov Coleman a number of people have now been interviewed as part of the FBI's reopened background investigation of Supreme Court nominee Brett Kavanaugh NPR's Tamara Keith reports Senate majority leader Mitch McConnell plans to move forward with a confirmation vote this week\nFBI investigators have spoken with mark judge Kavanaugh friend from high school who Christine Blasey Ford said was in the room when she alleges Kavanaugh sexually assaulted her judges lawyer tells NPR the FBI started but has not yet completed interviewing him\nLeyland Kaiser who was friends with Ford in high school has been interviewed as well and Deborah Ramirez who says cabinet exposed himself to her at a drunken party at Yale has also spoken to the FBI\nAnd source familiar with the matter told NPR's Ryan Lucas that she gave investigators more than a dozen named that people she says where either I witnesses or who heard about it at the time\n... strenuously denies all these allegations camera Keith NPR News\nThe Nobel Committee has awarded this year's prize in physics to treat scientist one half of the Nobel Prize has been awarded to American Arthur Ashe getting that second half will be shared jointly by Frenchman Guerra mood room and Canadian Donald Strickland they're being cited for groundbreaking inventions in the field of laser physics\nDisaster officials in Indonesia say twelve hundred thirty four people have been killed by the earthquake and tsunami that struck the island to Lou in the last week Matthew Cochran is with the international Red Cross and says some stricken areas have received little help\nStill large areas really close to you that are quite the access to even access to the\nReports we're getting from that are pushing into those areas that are working on a rich but pretty grim and\nNext disaster officials in Indonesia say twelve hundred thirty four people have been killed by the earthquake and tsunami that struck the island of ... last week Matthew ... is with the international Red Cross and says some stricken areas have received little help\nStill large areas really close to the center of the access to even access to the\nGames that are pushing into those areas that are working so rich that pretty\nResidents in areas away from the provincial capital Paolo say they're not getting the same level of held as urban areas\nThe U.S Navy is describing a close call over the weekend with the Chinese warship in the disputed South China sea NPR's child Snyder report the incident is the latest that's led to angry reaction from Beijing\nA spokesman for the U.S Pacific Fleet has been quoted as saying a Chinese naval ship got too close to a U.S navy destroyer conducting a freedom of navigation exercise in the region describing increasingly aggressive maneuvers there were unsafe and unprofessional\nThe Chinese vessels said to have come within forty five yards of the USS dictators bell\nForcing them to cater to take steps to prevent a collusion\nThe incident happened near the spradley islands China's claim of sovereign to use disputed by the U.S and other countries in the region the close call came after China protested the flight of us be fifty two bombers over the south China Sea amid trade tensions with the U.S [noise] trials Snyder and NPR News\nThis is NPR online retailer Amazon says it will boost it minimum wage to Fifteen dollars per hour for all us workers the wage increase will take effect November first\nThe company says more than three hundred fifty thousand employees will be affected and includes fulltime part-time and seasonal workers\nPresident Trump says he's close to finalizing regulations that would ban bump stocks these are devices that allow semi automatic guns to operate more like automatic weapons NPR's Windsor jumped in reports\nTrump says it's been a long process but the White House is in the final stages of knocking out bump stocks\nI told the ... gun but to do it you have to go to public hearings which we've had you have to go through all sorts of regulatory control systems and\nWe are in the final couple of weeks\nEarlier this year Trump directed the Justice Department to make the regulatory change\nBump stocks were used by the gunman who killed fifty eight people and wounded hundreds of others that an outdoor concert a year ago in Las Vegas at least ten states including California, Maryland and Florida had passed their own band winter job than NPR News Washington\nMourners in Las Vegas honor the victims of last year's mass shooting on Monday Night the mark ... on the Las Vegas strip dimmed their lights for several minutes at ... pm the approximate time when the gunman opened fire a year ago the names of the fifty eight people killed were read aloud\nI'm core of the Coleman NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include Baird providing global financial resources and market expertise to clients the world over our W ... dot com has more information and the Robert Wood Johnson Foundation at our W. J. F. dot org\nGood morning here's a look now the forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some under storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nSupport for NPR comes from NPR stations other contributors include Baird providing global financial resources and marketing expertise to clients to the world over our W bears dot com had more information and the Robert Wood Johnson Foundation at our W. J. R. dot org\nGood morning here's a look now the forecast will see mostly cloudy skies this morning along with showers and storms likely in the afternoon some storms may produce gusty winds and heavy rainfall was high in the mid seventies or chance of rain is Seventy percent\nChance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty one state looks mostly sunny with high and the lower seventies and Wednesday night looks partly cloudy with Lowes in the mid fifties this listener supported public radio W. V. A. F. M.\nProgramming on W. V. I. is made possible by our members we thank you for your support numbers and by the Home Depot the next generation of home improvement with everything you need to do projects smarter the Home Depot more saving more doing\nThis is Ari Shapiro host of all things considered and every day that I'm hosting the show I sit in the studio for at least two hours while the show is alive and when I can leave the studio at the end of those two hours and say that we really do some place\nWe told you what was happening that was important we showed you what was happening with delightful we surprised you we kept you engaged\nThen I feel like we had a really good guy all things considered listen every afternoon Monday through friday get four weekends with five\nSupport for W. V. I. A. comes from wise markets presenting the wise healthy bites tip of the week every Friday afternoon at four on WB I asked them it's pumpkins season this week's tip shares waste I had seasonal canned pumpkin and meals and snacks It's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin good morning President Trump says he wants to sign the new trade deal with Canada and Mexico by November but he admits it won't be an easy sell in Congress which needs to ratify the agreement before it can become law\nThe new NAFTA has a new name it's called the U.S Mexico Canada agreement or us MCA and our next guest is one of the architects Peter Navarro at the top trade advisor to the president and joins us now on the line Mr Navarro thanks so much for being back on the program\nDuring morning is Martin how are you\nI'm doing welfare so the president um haven't been able to check check this box and he talked about this for many many years how he believes that NAFTA was not a good deal for American workers he didn't exactly Rick ripped up the NAFTA deal um a lot of the foundation still there but what do you believe are the most substantive changes\nBut you can just check a box you check the Walmart big box of all boxers I mean this is a major\nAchievement going back in Nineteen Ninety four this is a twenty four year old agreement\nOr there's two things that are different now wanted modernize is the agreement back in the day we didn't have things like digital trade we didn't have things like biologics which are complex of pharmaceuticals or we have strong a new disciplines and protections for that so that that's a really good thing\nIs NPR News support for it or leave it comes from lower than McCain incorporated providing traditional printing to the business community for over fifty years on and McCain is now offering state of New York digital printing for print on demand books catalogs brochures and more so well and in the ... five seven zero eight two to eight one eight one\nThanks to your support members WB I champions arts organizations cultural events talented regional musicians\nThis is NPR News support for WB I come from lower than McCain incorporated providing traditional printing to the business community for over fifty years on and McCain is now offering state of the art digital printing for print on demand books catalogs brochures and more so well and in the ... five seven zero eight two to eight one eight one\nThanks to your support members WB I champions arts organizations cultural events talented regional musicians educational program showcasing except from students you make all this possible thanks for your support for W. V. I. A.\nIndependent films are given the red carpet treatment of the Nineteen Daniel block their film festival in Milford October Nineteen through twenty first\nGene Alexander award winning actress and former director of the national endowment of the art is this ... I ... and join engaging dialogue ... sessions with cinematographer is about the fine art of independent filmmaking\nAnd sample a weekend of unique feature and short films admission for details in tickets info at blockbuster film dot com WB I celebrate hundreds of regional art and cultural organizations\nFor details on many more urban check the w._b. I ate art scene calendar and catch up on our ... cat the W. B. I. A. dot org slash arts listen for art scene with Erica monkey weekday mornings after the news at eleven on W. V. I. N. than ...\nGood morning here's a look now the forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some other storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nThat chance of showers and thunderstorms increases to eighty percent this evening with Lowes around sixty once they looks mostly sunny with high and low or seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this listener supported\nPublic radio W. V. ...\n\nSupport for NPR comments from this station and from Ed laughing a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at at ... dot com\nFrom T. I. A. T. I. A. it's committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at T. I. A. dot org\nAnd from west in hotels and resorts west and committed to the wellbeing of travelers with offerings like heavenly beds super foods are ex menu and the gear limping for when workout gear is left behind it home\nWest and let's rise learn more at West in dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin the FBI is broadening its investigation into Brett Kavanaugh this week and what the Supreme Court nominee still in the news it's hard for a lot of us to get last week's hearing out of our minds author Rebecca Traister keeps thinking about how different the tone was of the two witnesses\nDr Blass before it was so deferential so polite so constrained\nI understand and appreciate the importance of you're hearing from me directly about what happened to me and the impact that it had on my life and my family\nAnd then in came Brett Kavanaugh his instinct was very public fury on his\nTo half a was number one in the class I thought oh no no no no no this up\nBack at Traister keeps thinking about how different the tone was of the two witnesses Dr Blass before it was so deferential so polite so constrained\nI understand and appreciate the importance of you're hearing from me directly about what happened to me and the impasse citizens had on my life and my family\nAnd then in came Brett Kavanaugh his instinct was very public fury on his own\nBehalf of his number one in my class I thought no no no no no no\nI'm In a car or more I don't know I mean I'm sure I'm going to talk about my ... year in ...\nThat was an exchange between Brett Kavanaugh and democratic Vermont Senator Patrick Leahy during those hearings Rebecca Traister says men in general are allowed to use a full range of expression and still come off as credible\nHe had in his arsenal the ability to use anger fury tears\nIn a way that he felt confident would resonate with the American people I don't think that Dr Christine Blasey Ford I Can't imagine a scenario in which she would have gone into that hearing room\nArmed with that same weapon that same tool that she could yell and be furious in her retelling of what happened\nTo her trace there's been exploring the idea of women and anger in her new book out today it's called good and bad the revolutionary power of women thinker\nThe moment that it occurred to me that I wanted to write this book it probably was just in advance of the women's march and you could feel the post twenty sixteen election anger building and it wasn't just the anger of the women who were planning a women's march it was also anger\nAt some of the white women who were planning a women's march after fifty three percent of white women had voted for Donald Trump the intra ally anger was crucial and important and then there was the women's march\nAnd it was the biggest single day political demonstration in our nation's history and\nIt obviously made a big impression and yet I saw the political press not treated as politically serious\nAnd it was really just missing a lot of quarters as being about the cats the Pussy hats you know a bunch of women getting together and there is a pundit mark how print on MSNBC who asks the Monday after the women's march seriously what are these women gonna do not just running for school board down the road but this week\nAnd of course then that gets us to a year that has women protesters opposing the health care repeal teachers' strikes women running for office and historic numbers and then\nMeet you [noise] you lean into history in this book and it's full of examples of men's anger\nBeing laudable creating admirable political change the Boston Tea party is a great example what historically was so threatening about women banker well in part\nThat anger of the founding our founders who were the white men chafing against their lack of representation and who were angry and protested in ways that we understand correctly to ... this is our revolutionary moment but when they made their new nation\nThey codified some of the very inequities that they themselves were angry about with regard to the British Government so they built the nation on slavery and the disenfranchisement of women\nYou referenced the racial dynamic of the me too movement earlier but I Want to ask again because women who speak out our condemned it in the broader culture under many circumstances but there is an outsized\nAnd protested in ways that we understand correctly to ... this is our revolutionary moment but when they made their new nation\nThey codified some of the very inequities that they themselves were angry about with regard to the British Government so they built the nation on slavery and the disenfranchisement of women\n[noise] you referenced the racial dynamic of the me too movement earlier but I Want to ask again because women who speak out are condemned to in the broader culture under many circumstances but there is an outsized penalty for women of color who do so\nDo you think those voices are being heard loudly enough in this moment\nI think it's almost impossible for us to conceive of the voices of women of color as being heard loudly enough because they have been so unheard and\nSo marginalized for so long when in fact it's women of color who has been the leaders and the leading thinkers have so many of our social movements in ways that have remain invisible to us so when we think about meat you one of the things that gets lost [laughter]\nIs that the definition of sexual harassment stems from cases that were brought in the seventies by women of color\nWho were actually borrowing legal ideas from a civil rights movement around racial discrimination and applying them to their cases of having in many cases been brutally sexually harassed in their workplaces\nIn Nineteen Ninety One it was a need a hill testimony against Clarence Thomas claiming the sexually harassed her sort of cemented the idea that sexual harassment was not individual behavior but damage done to a class [laughter]\nIt's Toronto Burke who in two thousand six pioneers and leads the me too movement and then when the me too movement Iraq\nI think it's really important that we understand that the first people to gain attention were very wealthy white actresses which is in no way I don't say that to diminish their experience with the reality of the harm they sustained but in fact\nAll of that is for ground it by women of color who stories so often get lost or kind of erased\nAs the author of a book called good and mad the revolutionary power of women to anger you could not have to find a more appropriate time for your book to come out [noise]\nThat's true but that could have been true of so many other weeks of the past ... years although\nWe have to say there are plenty of women who support Kavanaugh women who are indeed angry because they believe that this was a character assassination by the left so as women thing are only a productive force if it's done in the service to a progressive partisan agenda\nNot at all it is very often politically potent and yet we're told not to take it seriously still I think that the anger that women are feeling around the country that is having a catalytic connective impact and this is part of a long process social movements take a long time\nAnd the kind of anger that women are feeling in this moment around Kavanaugh\nIs going to be part of a far longer story that's going to extend deep into our future\nRebecca Traister is the author of the book good and bad the revolutionary power of women's anger is out today\n[noise]\n\n[noise]\nNow under the new law takes effect next year instead of setting bail a judge will use a computer program as part of his or her determination with respect to the low medium or high risk for flight or to public safety\nWho didn't believe this will dramatically expand the number of people who [noise]\nNow under the new law takes effect next year instead of setting bail a judge will use a computer program as part of his or her determination whether a suspect is a low medium or high risk for flight or to public safety\nWho didn't believe this will dramatically expand the number of people who will be detained pre trial\nHe points to one section in particular deep in the bill section Thirteen twenty that Eighteen a sub section five that section so broadly worded routine argues including compass anyone for any offense that he says will kill the power ever more into the hands of prosecutors police and judges\nUnder sb ten now prosecutors can seek detention for virtually any crime regardless of whether it's violent or involves weapons or whether the person accused has a prior history under this law\nProsecutors has the discretion to seek preemptive detention of a person with no criminal record charged with a low level misdemeanor\nAnd then there's its impact on the deals currently across the U.S more than Ninety percent of criminal cases are settled in a plea deal that could include dismissal or a diversion program not a trial\nJohn ... with human rights watch says he's deeply concerned this bill simply replaces one course of tactic for another bail for pre trial detention that if he says to use the tension to pressure people of color and the poor to plead guilty to lesser crimes often regardless of their actual guilt\nIs pervasive in the criminal justice system this happens every single day the new Dell reform law in California does not address that problem now you're just giving them a whole other mechanism to keep people in\nThe ACLU and more than a dozen other legal groups have raised similar concerns the bill also mandates the use of pre trial assessment tools essentially it's a computer program that aims to measure risk after putting in a raft and conviction history and other data\nThat algorithm gives the bill of near of objective science attorney rifling says but in fact becomes a kind of feedback loop merely reflecting social biases\nIs a pretty well documented fact to police stop search decaying arrest black people more than white people poor people more than wealthy people and the courts treat people of color trip poor people worse\nOh that's very factors that these risk assessment tools are looking at to judge who's higher risk\nAnd it's not yet clear just what data would actually go into the algorithm the bill doesn't say\nSharif's fan over dean CEO of a nonprofit pre trial justice Institute admits the new law is far from perfect\nBut she says some of these concerns are a bit alarmist fan of the notes that discretion to detain or release pre trial has always reside with judges this new law she thinks will simply help judges get it right more consistently\nOh that makes it should also right I don't think they should read or people like Arthur Andersen ending\nMeantime the bail industry which would be put out of business under the new law hopes to overturn it at the ballot box an industry coalition is currently collecting signatures to try for a statewide ballot initiative that and they put bail bondsmen in an awkward de facto alliance with scores of progressive legal groups who say they will be ready to challenge the laws costs\nMake\nIt should also keep I don't think they shouldn't even where people are ending\nMeantime the bail industry which would be put out of business under the new law hopes to overturn it at the ballot box industry coalition is currently collecting signatures to try for a statewide ballot initiative\nThat may put bail bondsmen in an awkward de facto alliance with scores of progressive legal groups who said there'll be ready to challenge the law's constitutionality in court as soon as it takes effect next year Eric Westervelt NPR News San Francisco this is NPR News\nSupport comes from the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community with open house events Sunday October twenty first for Sunday November fourth see how one of America's premier colleges will open doors for you [noise] usually programs\nIn the next few minutes we're going to pay a visit to the bottom of the\nAnd you mentioned this in the fall\nWe're listening to the sound when looming over the ice in McMurdo Sound in Antarctica [noise]\nThe entire thing is the highest driest coldest continent\nAnd it is totally covered by ice some two\nTo three miles thick and the center of it is the south pole which is the height of about ten thousand feet kinda floats and frozen what\nDr Peter ... is director of the division of polar programs at the national Science Foundation\nThe lowest temperatures on this had been recorded in a Soviet station called vox stuck on the high plateau of the Antarctic and they're a hundred and twenty two hundred and forty degrees below zero Fahrenheit if even temperatures of\nAnd if you have any wind\nIn addition to the cold temperatures your skin literally to wait and see less than a minute or so when it is really cold and windy nobody will go outside because we do not have the clothing that wouldn't allow people to be outside for any extended period time more than a few minutes\nGiven the difficult conditions there it's not hard to see why Antarctica has only recently than a home to human\nThe Antarctic he's the only continent whether you know indigenous people and the reason for that is that is almost totally ice cousin only two percent are not ice cover then that's mostly rock\nAnd barren soil so that ... nothing whatsoever to support them and [noise]\nYou more about Antarctic research for this program thirtieth anniversary celebrations you want to hear more check out\nOur podcast support comes from customs container solutions a manufacturer of customer standard roll off front and we're dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com\nSupport for NPR comes from this station and from staples with printers printer ink and toner cartridges for home in business and in store print shops for customize presentation booklets end manuals more at staples stores or staples dot com staples\nAnd from battle a European made language learning program battle teachers practical conversation and Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nThis is MORNING EDITION\nFrom staples with printers printer ink and toner cartridges for home in business and in store print shops for customize presentation booklets andme manuals more at staples stores or staples dot com staples\nAnd from battle a European made language learning program battle teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com this is\nMORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep one woman found a way to attack high health insurance prices and that's news because it's hard for any one person to do\nIf you go to the hospital the hospital charges your insurer which passes the cost on to you and it's hard to negotiate a better price and that system Marshall Allen of the nonprofit newsroom ProPublica has been investigating high health insurance costs\nAnd he has the story of a woman who used her power to hold them down either Marshall\nGood morning Steve who is this woman we're talking about at sixty eight year old grandmother named Marilyn Bartlett and Maryland Bartlett took over the Montana Employee Benefit plan and twenty fourteen\nAnd when she took over the plan which covers about thirty thousand state employees and their families and that plan was in deep trouble knit self funded so the employer paid all the health care bills and it was projected to lose about fifty million dollars in the coming years and basically go broke\nSo the classic situation here that people in all sorts of insurance arrangements face where they're basically told healthcare is really expensive gets more expensive every year and we're short of money we need more from you\nExactly and if people hadn't noticed the cost of your health care benefits is rising there's about a hundred and fifty one million of us who get our health care benefits through our employers and part of the problem is our employers have been deferring to the medical industry when it comes to the cost of health care\nAnd so the industry keeps raising the cost and basically those costs keep getting passed on to the workers what\nDid Maryland Bartlett do differently\nShe had spent Thirteen Years working in the insurance industry\nAnd so she knew a lot of the games she was also kind of a massive nerd who knew how to follow the money\nAnd so working with our team is she compared what her plan paid each hospital in the state the bigger hospitals to what they were paid by Medicare and Medicare publishes its prices and so she could see\nThat her health plan was paying hospitals in the state anywhere from two times what Medicare gets paid to five times what Medicare gets\nPaid while and so she said that was too much\nIt was too much I mean the plan was going broke her charge list to get things under control and so she had to do some really hard ball negotiating and why she decided to do which is kind of a revolutionary idea in the health care world and she decided to set her own prices and set the plans prices\nNow in that case you have some leverage and actually all employers have this leverage because the health care industry really does need our money so she said look you hospitals that are five times the Medicare rate you're going to need to bring your prices down to about twice the Medicare rape\nI Wonder if hospitals simply had to accept that I'm thinking that in Montana there can't be all that many hospitals there surely would be a hospital that would just say listen our prices are price\nThey took some hardball negotiating she threatened to go public with the price variation and expose the high price hospitals she called in the union to campaign against the hospital was holding out and they had a whole campaign state wide they sent hundreds of postcards and made phone calls to the hospital executives and leaders\nAnd I'm thinking that in Montana there can't be all that many hospitals there surely would be a hospital that would just say listen our prices are price\nThey took some hardball negotiating she threatened to go public with the price variation and expose the high priced hospitals she called in the union to campaign against the hospital was holding out and they had a whole campaign statewide they sent hundreds of postcards and made phone calls to the hospital executives and leaders\nDo you ... you know the one point five FM Palmyra township ... how to universities WFSU eighty eight point not have them see them grow and translators do they do want to age ... there'll be to eight nine ... son very there'll be too there were seven a Williamsport and they'll be to have an eight eight oh wells borough was supportive public radio\nProgramming on WSBIU a is made possible by our members and by the Peter hurting cos are restored Victorian Mansion on William sports millionaires row offering a dining experience that combines a gilded age setting with farm to table cuisine\nSecond generation chef and owner ... mealy sources ingredients for over thirty local producers to create and serve dinner Wednesday through Saturday menu and information at her house dot com\n\nMorning President Trump says the FBI shooter view anyone they want about Brett Kavanaugh more if we could have done quickly and take directions from\nComprehensive kind of one week investigation be will question a former assistant director of the FBI I'm Steve Inskeep\nAnd I'm Rachel Martin department of justice is suing the state of California over net neutrality how far will go to try to bring home with\nAmazon announces a wage hike for thousands of workers more on how that could have had those employees and the company but NPR's Ruth Sherlock visit fortune tellers a limit on\nTuesday I've covered second birthday MTV has Kelly\nForty eight years [noise]\nNews is next\nLive from NPR News in Washington on core of a Coleman officials in Indonesia say one thousand two hundred and thirty four people have died because of the earthquake and tsunami that hit last week\nThe island it to the west the has been devastated relief groups are trying to rush aid to hundreds of thousands of survivors but Irish vendetta of the international Red Cross told NPR's MORNING EDITION conditions are catastrophic\nThe earthquake and tsunami at a huge effect on the island road blocks are covered in mud and rebel [noise] so it's very difficult to reach the affected areas or a area where workers haven't seen yet\nDisaster officials fear the death toll will sky rocket that's because most of the dead have been counted in the provincial capital and\nRural areas remain cut off people are sleeping outdoors because aftershocks continue to shake the Indonesian island\nSenate majority leader Mitch McConnell says he will move the Supreme Court nomination of Brett Kavanaugh to the Senate floor this week the FBI is still conducting it's reopened background investigation of Kavanaugh following accusations of sexual assault against him\nArizona Republican Senator Jeff flake said he wants to make sure the FBI conduct surreal investigation from member station WBUR you are Anthony Brooks reports flake spoke at a conference in Boston on Monday and drew hundreds of\nProtestors protestors gathered outside calling on Senator Flake to vote against elevating Kavanaugh to the high court on friday flake started the day saying he would vote for Kavanaugh hours later he was at the center of a final successful push to get that vote too late\nNow flake says he's been in touch with the White House to ensure the FBI probe is up to standard\nThat does no good to have an investigation that just gives us more cover for example we actually need to find out where we can find out\nThe Arizona Republican and outspoken Trump critic who's not running for reelection was on his way to New Hampshire\nWe actually need to find out what we can find out\nThe Arizona Republican and outspoken Trump critic who's not running for reelection was on his way to New Hampshire flake has not ruled out running for president himself for NPR News I'm Anthony Brooks in Boston\nThe Nobel Prize in physics has been awarded to three people for their work and advancing laser technology NPR's Geoff Brumfiel reports the prize winners include the first woman recipient in fifty five years\nEven Donna Strickland the winter herself seemed surprised to learn how few women who formed the prize she was asked about it in today's press conference\nYou are the second woman ever getting that Nobel Prize in physics\nAll let's comments on that okay I\nStrickland and Gerard more route one for their work creating high intensity ultra fast laser pulses the prize also went to Arthur asking for his work using lasers this tweezers to pick up and move tiny objects Geoff Brumfiel NPR News this is NPR\nOnline retailer Amazon says it will increase workers minimum wages to Fifteen dollars an hour starting November first the wage increase effects owned company workers were there fulltime part-time where seasonal\nSan Francisco was taking steps to open a supervised drug injection site that's at clinic where people can inject illegal drugs like heroin with medical staff standing by in case of overdose\nBut Laura ... of member station ... that's on hold since California Governor Jerry Brown vetoed legislation despite the nationwide opioid epidemic that supervised injection site model hasn't been tried in the U.S\nSome research shows the sites can save lives but opponents say the ... Governor Brown vetoed a bill that would've exempted the employees from criminal prosecution he's had clients should be required to enroll in drug treatment\nSan Francisco mayor London Breed says that won't work\nI don't want it to provide a place for people to shoot up this is really about trying to get people off of drugs trying to get people to help and support that they need\nThe Justice Department has threatened to go after cities that open these sites another reason brown vetoed the bill for NPR News I'm Laura ... the defense department says the Chinese warship got close to a U.S navy ship in the south China Sea on Sunday\nThe U.S Pacific Fleet says the Chinese destroy your approach to the U.S has Decatur in an unsafe and unprofessional manner China's says the U.S naval ship had no business in that region over which Beijing now claims sovereignty the Chinese destroyer was sent to tell the U.S ship\nTo leave on corporate Coleman NPR News\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and American for the arts\nGood morning here's a look now forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some other storms may produce gusty winds and heavy rainfall with high in the mid seventies or chance of rain is Seventy percent\nChance of showers and thunder storms increases the eighty percent this evening with Lowes around sixty Wednesday looks mostly sunny with highs and the lower seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this listener supported\nPublic radio W. V. I. F. M. Scranton area foundation president and CEO Laura doo Jesse our newest initiatives women in philanthropy is bringing together leaders in our community to tackle the cause of the issues facing women and girls in our region injustice\nInitiatives winning philanthropy is\nBringing together leaders in our community to tackle the cause of the issues facing winning in girls in our region in just two years are supporters\nAnd helped to launch new business ventures provided steam education to school get snakes given winning financial training and are leading the charge to improve dental care and transportation joined us today I support for winning dot org to learn how you can engage today and transform generations tomorrow\nTell parents live from here with his family is taken off that's even had finally they live in Memphis began you know the one with the Golden Gate bridge infant Lindy knocking hand hand arraigned that\nMania will be there with our new music director Mike Allen down down and I mean we are now in America for finding pound pop on Saturday and Sunday night today on all the ...\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Senate majority leader Mitch McConnell is promising Republicans their moment the Kentucky senator has spent years leading the way and Republican efforts to dominate the courts Senate Republicans held many judge ships open\nFor long periods during President Obama's administration even including a Supreme Court nomination that was blocked until after the two thousands sixteen election\nNow a Republican Supreme Court nominee has been delayed and McConnell is determined to proceed\nTo tamper adolescent Elana structure has come to a close judge Kavanaugh's nomination it out of committee or considering it here on the floor and missile program will be voting\nThis way this week that means the FBI as a few days left to vet the nominee Brett Kavanaugh faces accusations of sexual misconduct an assault\nFrom decades ago the White House insists that agents now have the freedom to question anyone they want about those allegations those following the story include Chris swagger assistant director of the FBI from two thousand four to two thousand six ...\nMorning Steve do you know I have confidence the bureau can go word wants and speak to whoever wants to\nDo it it's important to understand what what this is this is a special inquiry that's a term of art within the FBI and within their manuals procedures and within\nThe Justice Department it says it's a background check essentially for a presidential appointee mhm has done thousands of these background checks for circuit court judges district court judges and cabinet level appointees\nDoing it for a mixed bag starting at eight following the gubernatorial debate will begin at eight with a collection of blue grass music originally scheduled for yesterday than at eight thirty it's the day sampling of new releases and a nine to tower him grow music segment for the week time singer songwriter and a dead marsh when\n\nThis is George Graham joined us this evening starting at age you're going to be on [noise]\nOn Shakespeare uncovered by do nothing in the well the weather the tenant ... Shakespeare's most popular pain the opening just says we are and we are all in as the original romantic comedy\nCan be a small and intelligent and as with you won't but until you open your own self promotion of\nMuch ado about nothing with Helen\nI'm Shakespeare in ... [noise]\nFrom years October ... wealth at nine o\nW ... TV supporting ... the pine senior living in a large sum of providing solutions for seniors wishing to remain independent meetings of assistance with daily living the pines locally owned managed ... care focused on the beach resident applied to collect some a dot com or our family cares\nFor yours good morning here's a look now forecast will see mostly cloudy skies this morning along with showers and thunderstorms likely in the afternoon some storms may produce gusty winds and heavy rainfall with high school in the mid seventies or chance of rain is Seventy percent\nChance of showers and thunderstorms increases the eighty percent this evening with Lowes around sixty once they looks mostly sunny with high and low or seventies and Wednesday night looks partly cloudy with Lowes intimate fifty this was a listener supported\nPublic radio W. V. like a a family support\nNPR comes from the station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more learn more H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom tire wreck with more than five hundred tire bottles from twenty to manufacturers and an online tool for finding tires based on vehicle needs budget and brand\nHunter retire models from twenty to manufacturers and an online tool for finding tires based on vehicle needs budget and brand tire racket dot com helping drivers find deliver install\nAn from the financial services firm of Raymond James offering personalized wealth management advice and the banking and capital markets expertise along with the legacy of putting clients financial well being first learn more and Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep Minnesota Congressman Keith Ellison faces an accusation of domestic abuse\nAt least one investigation says the claim cannot be substantiated although that investigation was paid for by the Minnesota Democratic Party Republicans have called it a sham and called for a pro by the Minnesota attorney general Brian backs to Minnesota Public radio has more\nGiven the intense focus on assault allegations made against Supreme Court nominee Brett Kavanaugh the Ellison situation is far from ideal for Democrats\nWho want accusers taken at face value Congressman Ellison is deputy chairman of the Democratic National Committee and want a crowded primary for Minnesota attorney general just days after the abuse allegations surfaced\nHis ex girlfriend care Monaghan does he tried to pull her from a bed by her feet two years ago well swearing at her she says she captured it on a cell phone video that she hasn't released\nIts not try to keep the people that they\nThat was Monaghan in August speaking to Minnesota Public radio about why putting up the footage cause more harm\nIt nearly eighty it's traumatizing for everyone's family and thoughts and for me\nShe wouldn't turn the video over to the party contracted investigator either it was the main reason the lawyer examining the case called the abuse claim unsubstantiated Allison says there's no video because it didn't happen\nIn a written statement he praised the investigator for fair review and said he's ready to focus on more pressing issues last week he accused opponents of fixated on the claim for political gain even though I uh\nNever engaged in a\nDomestic abuse um\nI think it is a very serious serious issue into simply politicized that I think is incredibly a bad bad\nRepublican opponent Doug ... says the investigation is tainted because the law firm behind it worked extensively for the state Democratic Party known in Minnesota as the DFL\nPolitically motivated ... ... it was always going to conclude in favor of liberties endorsed candidate for attorney general\nPolls show ward though has a real shot to become the first Republican to win the office and a half century and for weeks from election day Republicans are working overtime to make all democratic candidates and competitive races account for Allison\nFor NPR News I'm Brian backed in St Paul\n[noise] um the people of Lebanon have lived through generations of war and the perpetual sense of insecurity that comes with it so the urge to know what's coming next may be especially strong that's where fortune tellers come in NPR's Ruth Sherlock in Beirut went to see what the future will hold\nMe as the image file wax and celebration Lebanese switch on that TVs in such a cliche for the coming yeah\nMay not have to let the as a ... she was women would be fun half\nThe future if politicians celebrities and nations had a ... one of the city out on that other than that she said that they see and that and um\nShe was a woman with ... predicts the future of politicians celebrities and nations ... this year and that's been on always on the brink of conflict will be bad from war and he had that are you at all ... at the debt will be an economic collapse\nAnd riots in Europe ... fall from the only see Sarah and Lebanon\nAway from the spotlight you can find fortune tellers and even the most remote little towns and villages the practiced seemed to cross Lebanon strict religious divides today you can find a respected plus wins in Christian and Muslim communities\nAnd junior ate a Christian town north of Beirut we step inside cafe left half the cup in French\nTo place have lied goals end up writes lime green ceiling\nClients white nervously for the fortune teller he's working in a small room at the back behind plastic to\nWoman asks us not to name her because her husband doesn't approve of this\nAnd the minute they don't trust my husband's never believed in the decisions that something stupid\nBut she says fortune telling it's incredibly popular among have female friends all over the country\nThey like to see this to leave this many people ... I don't know like it's a fashion\nBecause we wouldn't have too much but I live on them\nShe says it's a remedy for living in such a politically unpredictable place these clues to the future they can be comforting\nThat are\nThe fortune teller landmark move back into the save a lot that we sit crammed on a small couch with a client who introduces herself only as an it now because I'm Muslim ...\nMyth that has been coming here for ... years and she says ... ... ... that's a husband had hot and public he's saving his life and ... Christian crosses hang on the rules of Mali's cafe\nThere's some religious leaders condemn fourteen telling as a ... minute believes it's actually a way it's coming closer to God I Know I ... I Know she claims ... started with the operation of St ...\nA Lebanese Christian figured known to pay his capacity to heal them they let my colleague lemme ... she says uh I pay\nMore than most people but every time before I'm about to tell somebody's fortune I Do the cross I encourage people to pray as well and she said there's some priest and moms who do criticize my work but the little from I tell them to pray\nIn the end she says ... ability to see the ... connection to gold medal subsistence brings a tray of Portland cups filled with thick Arabic coffee at the sweet smell of called them and rises in the ... [noise]\nAfter we drink none of ten my empty cup upside down and kids inside rather coffee grounds have formed a passion she looks at me\nRipple bowed pool balls\nShe guesses the name of my boyfriend above its weight ...\nShe's saying you know sometimes you guys drive each other crazy that's very true and oh\nShe predicts happy things lemme we'll soon find a new love and what will lead to many big scoop she writes I Need the future will tell Ruth Sherlock NPR News junior\n\nThis is NPR News got an older car that is not running so welding it's gonna be expensive to repair donated to support WB I Would even tell it away and you get a tax deductible receipt details that W. E. B. I. dot org slash cars or call aid for for WD I a car versus the arts\nThat would make a meaningful difference for workers in Mexico and their ability to organize and get their wages which by the way have positive benefit on American workers that Canadian workers because now they're in such a huge wage differential\nThis is a departure for unions which have historically oppose trade deals in the past they argued globalized trade hurt their members interest by off shoring jobs so it's unusual to hear unions praising some facets of this new deal\nPrayed hurt their members interest by off shoring jobs so it's unusual to hear unions praising some facets of this new deal\nBut to be clear the AFL CIA oh Teamsters and others say they remain undecided about whether to support the deal mainly Drake says because it's not clear how the U.S would be able to enforce the new labor provisions with Mexico\nBecause if you don't have real effective enforcement then you don't have anything changing\nLori Wallach agrees she's director of global trade watch a consumer advocacy group she says ultimately support for the deal will depend a lot on details that have yet to be decided\nAnd unless strong labor and environmental standards are subject to swift and certain enforcement the outsourcing and race to the bottom and wages isn't going to stop\nShe likes the fact that this deal would eliminate rules permitting companies operating in foreign countries to sue the host government which Wallack says allows them to circumvent local labor and environmental laws\nThere are elements of the proposal Wallach cries for example the new deal allows a longer term on pharmaceutical patents delaying the introduction of cheaper generic drugs\nThat could undermine the changes needed in our country to make medicine more affordable here\nBut it's the auto industry that would be the most affected by the deal it would require automakers to boost the percentage of parts made in North America to Seventy five percent in order to avoid terrorists Chad ... is a senior fellow at the Peterson Institute for international economics\nHe says such new requirements would have ripple effects\nOr some parts to that now has to be made with workers that are earning higher wages and that just means that the cost for automobiles in North America are likely going to go up\nThe big three us automakers would benefit because many of their cars would be compliant with the new rules that balance as it makes us a less appealing place to make cars for foreign automakers\nThese rules don't apply if you're building a car in Asia you're building a car in Europe and those are going to be relatively cheaper places to build up mobiles to export anywhere around the world\nAnd that he says could offset some of the labor gains from the deal ... NPR News Washington\n[noise] [noise]\n\n\nIt's NPR news support for WBAI comes from a new cars super family owned and operated Subaru dealership since Nineteen Seventy cars who bruise committed to your satisfaction which you're purchasing ownership experience my new cars super ... for more information Lucas who Bruce ... called\nFor a mixed bag starting at eight following the gubernatorial debate will begin it with a collection of bluegrass music originally scheduled for yesterday than at eight thirty it's the sampling of new releases ended nine it's our hand grow music second time singer songwriter and a day when\n\nThis is George Graham joined us this evening starting at age you're going to be [noise]\nProgramming on WB I is made possible by our members and by Lindy corporation of pitched Lindy is committed to the local development of clean safe an abundant Marsalis natural gas harvested from under our feet in northeastern Pennsylvania [noise]\nNinety seconds national\nI'm Maynard Marlene ... so small monkeys is live\n[noise] Ninety second snacks\nEither I'm paying Maynard Marlon sets are small monkeys this live high up in the canopies of South American rain forests there are more than twenty species and most could fit comfortably in adult humans hand most farmers that are smaller than a squirrel but the pygmy my arm and said is the smallest of all and the small his monkey in the world\nThey're only about twelve sixteen centimeters long and weigh less than a hundred and forty grams ... is one of the larger species with the length of twenty three centimeters and the weight of around five hundred eight hundred grams\nPharmacists are active during the day and spend their time foraging there are social animals that live in small groups called troops made up of four to Fifteen relatives and are often territorial\nA territory for a common ... group can range from one to aid actors like people ... which means they eat a variety of foods but their diet includes insects fruit treats apps and other small animals\nPygmy Maurice that love the staff of trees they saw holes into the bark of the tree with their teeth to get at the sap and can make thousands of holes in a small selection of trees over a fairly short period of time\nIn Ninety second naturalist into production in Cincinnati Public radio ... view for support from Cincinnati Public radio ... spent the good news it the natural world [noise]\nSupport for NPR comes from this station and from that William and Flora Hewlett foundation committed to supporting ideas and institutions that advanced the wellbeing of women and improve lives and livelihoods and developing countries more information is available at Hewlett dot org\nFrom the doors do charitable foundation whos clinical scientists developments award support promising early career physician scientists and their research efforts to improve human health\nAnd from the ... foundation\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep three people share this year's Nobel Prize in physics they are being honored for quote groundbreaking inventions in the field of laser physics\nTwo of the three work together one worked independently\nAnd one is a woman the first to receive a Nobel and physics in decades NPR's Geoff Brumfiel is years after morning good morning okay the pairing first is your are more ... French scientist and Donna Strickland a Canadian both of whom did much of their work at the University of Rochester what does that work\nThey did something called a short pulse amplification this is a technique that allows you to take a pulse of laser light and make it more powerful and that was a real problem early on in the development at the laser or you know lasers were developed decades ago but then\nThey sort of got brighter and brighter and then they started out and this technique really allowed them to grow brighter still and that helped them find many applications\nOkay we're going to talk about the applications in a moment but I Do want to ask how big a deal is it to see strictly to see her name attached to the Nobel Prize in physics well\nThis is only the third Nobel Prize in physics to go to a woman in the past hundred and Fifteen Years while uh the the last one was in Nineteen sixty three and so Donald Strickland was asked about this in the press conference and even she seem a bit surprised by that\nFact you are the second woman ever getting that no prize in physics often comments on that\nI thought okay I can\nBut it is true yeah there's only been to others in Nineteen sixty three in Nineteen\nOkay I can\nBut it's true yeah there's only been to others in Nineteen sixty three in Nineteen oh three and there have been many good female physicists who has been widely held were overlooked\nDoes surprise does this suggest a an advancement for women physicists\nI'd say it's more like the Nobel Prize is trying to stay relevant the in the heart scientists especially\nA Internet entrepreneur and started this new age ... have started giving their own prices\nThis year one of those prices went to a woman named Jocelyn bell burnout who had herself and overlooked for a Nobel Prize that prize was first three million dollars the Nobel search just for around a million new so you know I think the Nobel Prizes are falling behind the times and they recognize that\nThat's really interesting okay there's a third Nobel Prize winner Arthur ash is his name Bell Labs and New Jersey the place where he did a much of his work um optical tweezers is the phrase in front of my eyes here what an optical tweezers\nThey are actually exactly what they sound like we're using lasers which is light tumbled physical things objects wow and that actually works believe it or not light can exert a little bit of pressure and so\nIf you tuned to lasers just right you can manipulate very very small things are really tiny particles when you're ... individual atoms even wow and so what are the practical applications of the work of these three people\nWhile the optical tweezers are used in a variety of applications um for moving around small biological molecules proteins DNA things like that and also in physics it's used pretty widely [noise]\nUm and then the lasers are the main sort of public use most common uses laser eye surgery are simplification gets used diet and laser eye surgery on this day changed the lives of many people over the last many years and fortunately not mine so the glass okay", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Williamsport", "day": "02"}