{"month": "10", "state": "PA", "station": "WVYA", "content": "WTO eighty eight point three if that means Burke Mansfield and W. P. A. U. Ninety One point five of them ... township streaming live at W. V. I. A. dot org we're in Wales barrel at what a three point five listener supported public radio W. V. I. A. F. M. [noise]\nLike what you see on WB I ate you enjoy fine programs like pull dark knows that we're nature the your kids love watching the antics of Elmo on Sesame Street enjoy said that science kid are curious George how 'bout shows like called the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. V. I. A. who\nKavanaugh says he joined the Supreme Court with no later but when president\nTrump to in the campaign trail you belong to a Democrat and they're going after now many It's MORNING EDITION from NPR News [noise]\nHotel report to the major data breaches Google why didn't the company carrying jerseys privacy was hit ... king\nAnd I'm David Greene will spend time in Europe this hour looking at why China invested heavily in a port in Greece and whether workers that are being unemployed and his journalism becoming more dangerous in Europe the latest data about Gary and journalists found raped and murdered\nAlso a child homelessness rises will meet an eighth grader in Idaho with living in reality It's Tuesday October night Britain's former prime minister David Cameron turn fifty three years old\n\nLive from NPR News in Washington I'm Dave ...\nFlorida's governor is calling hurricane Michael monstrous what forecasters warning it could become a major storm before making landfall along the Gulf Coast sometime tomorrow more than thirty Florida counties are under a state of emergency from Tampa Bay to the panhandle coastal evacuations are underway\nIn the Carolinas NPR's Tom Gjelten says residents are still working to recover from Hurricane Florence\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n\nFederal investigators say they're still not sure why the driver of a limousine in upstate New York failed to stop at a stop sign the stretch limo crashed into a parked SUV and skill Harry at a high rate of speed killing all Eighteen people in the vehicle and to pedestrians\nNew York's governor says the limo driver did not have the required commercial license and the vehicle had failed a recent inspection last night friends and family attended a vigil at a park in Amsterdam\nMy heart rate and they think of all the lives that were never will be [noise]\nIt gives me hope he is so here we trend and so\nThat's local school superintendent Vicki Ramos one of the speakers at the vigil vice president Pence was in Texas yesterday campaigning for a couple of incumbent Republicans trying to keep their seats on Capitol Hill Stella Chavez with member station KNPR a reports from Dallas\nThe vice president's first stop what's for us representative Pete Sessions he's facing a tough challenge from Democrat calling all red and civil rights attorney and former NFL linebacker\nTense praise sessions for his support of Trump administrative policy from Obamacare roll back to tax cuts the vice president also had a good trade agreement with Mexico and Canada and unemployment at a fifty year low and on\nWe couldn't harm [noise] justice Brett Kavanaugh [noise]\nHand fed re electing Pete Sessions and Senator Ted Cruz it's crucial to hanging onto a Republican majority in Congress for NPR News I'm Stella Chavez in Dallas\nThis is NPR News from Washington\n\nLater this morning Brett Kavanaugh Harris's first arguments as a justice on the U.S Supreme Court the high court is scheduled to hear two hours of arguments at the White House last night there was a ceremonial swearing in\nTurkey is calling on Saudi Arabia to approve of missing Saudi journalist left its consulate in Istanbul as the government claims as NPR's Peter Kenyon reports from all ... has been missing since he entered the Saudi consulate a week ago\nSpeaking during a visit to hungry president ... once said prosecutors are looking into the show these disappearance including the arrival of more than a dozen Saudis to assemble on the day the journalists disappeared\nEveryone said Saudi consulate officials can't get away with saying he left the building addressing the Saudis air to one added if he left the building then you need to prove that\nInvestigators suspect is Yogi was either spirited out of the country by the Saudis or killed inside the consulate Saudi Arabia denies the allegations President Trump says he's concerned ... disappearance\nPeter Kenyon NPR News Istanbul\nThe international Monetary Fund is downgrading its outlook for the global economy for twenty eight team it expects growth for the year to reach three point seven percent\nThat's down from three point nine percent it's earlier forecast the IMF expects the U.S economy to grow to point nine percent for the year that would be the strongest since two thousand five\nThe Federal Reserve has raised us interest rates three times this year as the economy continues expanding unemployment in the U.S is that a forty nine year low\nI'm Dave ... NPR News in Washington\nSupport for NPR comments from NPR's patients other contributors include visit St Petersburg Clearwater alone\nSupport for NPR comics for NPR's Beijing other contributors include visit St Petersburg Clearwater along Florida's Gulf Coast\nOffering artistic drugs including St Pete's Dali museum pitcher who collection and the museum of fine arts more er visits saint Pete Clearwater dot com\nTaking a look now the forecast it'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with high in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies\nIt'll be mostly cloudy on Wednesday night along with a chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with ice in the mid seventies our chance of rain is eighty percent this is W. V. I. F. M.\nMy this is Ari Shapiro host of all things considered when I'm hosting the show I'm always listening for the thing that's making the thing that jumps out of the radio and grabs you the thing that will make you go home to your spouse when your kid or good friend and say hey we'll never believe what I heard\nToday on all things considered listen every afternoon\nMonday through friday get four weekends with five on WB I found\n[laughter] [noise]\nNext time Chicago Symphony orchestra and after a divine hand Beethoven second most tucked my turning and invented\nThe horns and try to number three and the proximity Mozart Beethoven mark time Chicago Symphony orchestra I'm he sits in\nOne day a ten pm on W. V. all of a [noise]\n[noise]\nThis is MORNING EDITION from NPR News I'm David Greene\nAnd I'm Noel King good morning at a ceremonial swearing in justice Brett Kavanaugh said that he will put the polarizing fight over his nomination behind them\nYou have a new justice was speaking publicly for the first time since the bruising nomination process and the Kavanaugh said he would not allow what took place to influence his decisions on the bench\nThe Senate confirmation process was contentious an emotional that processes over my focus now is to be the best justice I can be\nA take this office with gratitude no bitterness\nPresident Trump on the other hand took a somewhat different tone he slammed the Democrats for trying to destroy his nominee NPR's White House correspondent Tamara Keith is with us now the morning Tam good morning so what is Trump telling Republican voters\nHe is telling them that Democrats are the enemy [laughter] uh and and that you know he is really playing up rather than celebrating the victory with the Kavanaugh nomination he's playing up the fight\nUh and and trying to continue to to do that the anger that rose up I'm as a result of of how that process went\nWell we are one month out from the mid term elections as you well know are all about enthusiasm so what is the outlook for each party in the terms now that the Kavanaugh fight is over\nThis is just a moment in time and uh there are still those those weeks left and we don't know how this is going to\nAuthors of the new book like war the weaponization of social media China [noise]\nThis evening at six after all things considered on W. V. I Am\n\nI on Christmas really from lived from here with Chris do and\nWe're proud to be the highest rated to our live musical comedy variety show on public radio in this time slot\nDo it in this weekend for our show at the policy leader in Saint Paul Minnesota with the ... brothers miss Madison Cunningham\nAnd dirty projectors fly from here we make great radio for\nSaturday Night at six Sunday night at eight W. V. I. A. F. N. [noise]\nParliamentary disease is one of the most common medical conditions in the world millions of people in the United states suffer\nDump form of lung disease including asthma bronchitis as the\nMilking genetic and infections are factor\nFor why someone named Isabella one or more disease\nPounds on the call a doctor\nWednesday night at seven thirty on WB I a TV\n[noise] taking a look now the forecast it'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with highs\nTaking a look now the forecast it'll be mostly cloudy morning then becoming partly sunny and nice in the afternoon with high in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with high in the mid seventies it'll be mostly cloudy on Wednesday night along with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with eyes in the mid seventies our chance of rain is eighty percent\nThis is W. V. I. F. him\nSupport for NPR comes from this station and from Heather started hey gun poll jihad ... supporting African wildlife foundation working to ensure wildlife and wild lands thrive in modern Africa learn more at age W. F. dot org [noise]\nFrom the ... foundation dedicated to the idea that people can live in harmony with one another and the natural world learn more about artists and its partners at artists foundation dot org\n[noise] from the John D and Catherine the MacArthur Foundation recognizing exceptionally creative individuals this year's MacArthur fellows and more information or at max found dot org\nAnd from the Robert Wood Johnson Foundation at our W. J. F. dot org\nIt's MORNING EDITION from NPR News\nI'm Noel King and I'm David Greene China has poured billions into making basically of Silk Road of the sea running dozens of pork than container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus the Chinese shipping giant Cosco has spent millions transforming into the fastest growing port\nIn the world but as Joanna Kakissis reports from previous this has come at a price\nIs as iconic struggling because the proper way\nIt's were lawyers set out for each of the battle and more Hollywood doc present Nineteen sixty film never on Sunday\nAfter\nSmelling I met with saying that there's no port she loved as much as ... ...\nYou mind me\nToday now may he got on\nMe or social ...\nFree tired Steve adore you ought to listen to ... and his wife Maria the song by heart he worked at the port of Piraeus for thirty five years\nWho were young if you were to but that was going to be there with you visualize what is this is my father when I stopped the port who didn't have many machine cargo into the ship from which just with our own hands for we oughta bags of groceries ... where all made in Greece old violent for North American straight\nHe says praised took care of its stock workers he made good money and now has a good pension he flips a string of worry ... says he reminisced says in his living room underwater color painting of a ship\n... human up you have to ... many heroes using them when I was looking out at the airport Ross from the sewage if you've got to get on my garbage deep enough of big ships have everything\nTo be successful but for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment\nThen came the debt crisis which began in twenty pen ravaged the Greek economy the he pushed Greece to privatize the port of Piraeus only the Chinese showed serious interest\nThe e pushed Greece to privatize the port of Piraeus only the Chinese showed serious interest [noise]\nThe Chinese shipping giant Cosco took over the port in twenty sixteen it now owns\nA majority stake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping they're\nMeant to expand the car terminals they want to expand or they want to create the logistics center they want to build a new ah cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware of the Chinese lease on the court will run out and about thirty five years\nIf at some point in the future they want to abandon period as we will have all these investments they will not take them with with them okay and they will lead them here\nYou see it as entirely a win win win win those are the words of captain food chunk chill costs goes CEO and pray as heard here in twenty Fifteen he's a ...\nTool Greece and\nTook us ... one of the port union leaders I noticed that the F ... as another interpretation\nWhen the Chinese said when when they they mean big win by she says the benefits mainly go to China\nFounder if they if they're if they had found them know how their way to\nOrganize it doing business they spawn do these things in Europe\nYou can actually hear the Chinese expansion half the cargo terminal\nWhich are busy twenty four hours a day straddle carriers lived giant metal containers of goods onto shift workers in bright yellow safety vests everywhere and these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers at the port or temps without labor like [noise]\n\nTwo years ago hundreds protested and federal police over hostile takeover and their working conditions\nThirty year old Steve adore medical ... recalled how he and his colleague\nLong hours and unsafe condition for less\nPay to go through many\nAnd other government workers were too scared to be governor but they kept their heads down working ... chips with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles\nNow he says at least they can take twenty minute break starting chefs\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ...\nHe cannot stomach the new reality for most workers at the port and blames Costco\nThey won't silent obedient cheap workers with no unions in this new snow right what do we do when these future\nWe should've taken from her father's bust who should have been should do conditions who want to pursue blow to get into a future workers\nCost goes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesperson said in an email that after quote along and productive negotiations a labor agreement was signed the benefits both sides\nThe European Union's been largely silent on the labor concerns but ... says secretary of ports\nSays he has heard from you officials were suddenly worried that China's running a European port\nMe do you ... to ...\nHeard from ... were suddenly worried that China's running a European port he says me do you like ... when you get the you know we're all aware that the Chinese state is behind a company like Costco you sort of you that pushed us to sell airport to Costco in the first place\nAnd we were in debt we had little bargaining power he says the e you underestimated China [noise]\n[noise]\nAnd now the Chinese flag is race for re it's too late for regret for NPR News I'm Joanna Kakissis in her way and we [noise]\n\nAs I said it was just the beginning China has snapped up about a tenth of Europe ... capacity in just the last decade I'm going to hear about that later this week [noise]\n\n[noise]\n\nThis is NPR News\nThis is W. V. I. eighty nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre ... and we're in Williamsport at W. B. Y. eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were in a while and pop ACA W. P. A. U. Ninety One point five of them\nThen I hurry and rushed downstairs so I Can't get out and touch my bus sometimes ... staying\nAt the shelter was eleven year old brother and his grandma Pam can't travel she says they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we could afford\nMore depressed I God I just I didn't know what to do\n... August ... small disabilities by putting the government but it's nowhere near enough to cover rent in Boise controls grateful for the shelter but says it's hard on her grandson\nMy youngest one have to be a little terror because he's upset but you know he gets angry men [noise]\nHe'll sit in a corner [noise]\nYou know to say I hate this place hate this place\nTypical for cable too but you wouldn't know it\nCame as a social fourteen year old with a big smile one of his favorite things about school is seeing his friend\nMy friend you know about it and me being homeless and they don't teach me on it I'm trying to work hard and it's just a effort to try not to break down\nIt's harder for students who are anxious and worried to concentrate homeless kids tend to score and lower on standardized tests and have lower graduation rate [noise]\nAnd sometimes king does break down with this friend [noise]\n[noise]\nTo make that\nAnd this might not ... is doing okay\nCame carries a tray of food to a table with his friends\nHis dad is out of the picture of his mom had the drug problem before his grandma stepped in and he had to help take care of his little brother\nHelped him ready for school [laughter] the one ... ... so for days on time when we only had cereal for what Julie\nKing has been trying to convince his grandmother that she should let him get a job so he can help with Brent\nLike so what do you want to help out but can't travel won't have it you need to be a child as long as possible and you don't want to be in a big hurry to grow up honey\nA few weeks later there's good news and cadence world they've got a house it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can say something he hasn't been able to for quite some time this is home\nFor NPR News I'm Amanda teacher in Boise [noise]\nThat story came to us from the the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but one educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name [laughter]\nThis is NPR News\nPrograms [noise]\n\nIn many traditions the relationship between some and beans any deep and I'm sure that you mentioned that this was composed of a planet\nNature is beeping I'm sure that you mentioned and and this is the pulse of the planet\n[laughter] or\nIn this was one of the troops at the ... council six mission confederacy [noise] Indian nations\nHave always had ceremony and the someone has always been to celebrate\nAnd to give thanks to recognize these life giving essence is around us whether it's\nCorn whether it's beans that grow whether the rain or whether it's the sun great ceremony a great Thanksgiving this becomes a central part of your daily life and so the idea of reverence for\nA respect for an appreciation for Thanksgiving for these essence is ensure a long life ensure a better life insurer better community there's very little ceremony ... states ceremony that just see what they called pomp and circumstance\nWhich is I think in contradiction to ceremony for corn [noise] someone is of humility rather than pomp and circumstance\nI find that in the community is where the ceremonies around where our meetings where in the long houses were the chief so you know when I sit with a consular chase\nI'm just always impressed that these men take the time with no pay no compensation around me half of the people and I'm always on behalf picture I just have a great deal of respect as human beings are still capable of that and I know there are people all over this or\nProgram is part of our thirtieth anniversary celebration you want to hear more check out our podcast\n[noise]\nMillions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Roger's neighborhood WB I and the greater ... the United way and the daily item invite you to the movie won't you be my neighbor Tuesday October night sixty I'm On the campus eater Lewis bird it's free first come first served three small popcorn and drinks\nEntered when prices from WBAI anti can honor Mr Rogers by bringing a sweater to be donated to community aid October nights with W. V. I. A.\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health powered jobs and resilient cities at rock sound dot org\nFrom the door it's do charitable foundation who clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThirty years ago researchers from the New England aquarium started studying North Atlantic white whales off the coast of eastern Maine large parts of the whale showed up like clockwork in late summer now those endangered whales come to that area only sporadically and more and more they're being seen far to the north\nMurray Carpenter went out on a research vessel to learn more\n[noise] it's just after dawn and Amy Goldman surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life she points out harbor porpoises chasing fish near the boat\nAnd then something much larger appears in the windswept water\nBehind us see probably a ...\nSomething much larger appears in the windswept\nWater behind us probably a humpback whale\nGetting federal it turns out to be to humpback one spouse near the boat [noise]\nIt's a cool citing but these are not the whale she's after\nMilton is hoping to find the north Atlantic right whales that she and her colleagues have been studying here since Nineteen eighty they're largely lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer but they became scarce starting in two thousand ten and their range shifted\nDramatically many more of the whales are now is a marine hundreds of miles north in the Gulf of St Lawrence Mariano had bloom one of ...\nResearch assistants survey that area in August and said it was nothing like the bay of Fundy\nHad days where we were mean about individual working I'm from the ... and\n...\nWanting to see but in total fewer than four hundred and fifty North Atlantic right wells remain and their numbers have been falling for a decade as more urban entangled in fishing gear or killed by ships reproduction is also declined\nResearchers found no new cabs last winter with the population on edge scientists want to understand the reasons for the new migration pattern Nick record is with the big load laboratory for ocean sciences in east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... countless is like the battery of the Gulf of Maine\nColumnist is a type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the regents waters it's also shifting the currents that one swept this important plankton into the deep basins were right will speed making it less available to them\nMore of a brown another scientist with the New England aquarium team so she actually find hope in the habitat shipped all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to swim all the way around Nova Scotia so what a tremendous response you know this is a highly endangered whales there's not many of them left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the cheese are count for this year is less than doesn't lands\nBack at the dock the crew answer thirty mile survey the last of the season with no right well sightings but any note and says it's worth sticking with the research\nWe're not a whole new era right now with climate change with habitat shifts it's important with us long term study to sort of maintain some of the basic efforts that we've had so that we can better understand what's happening for the well\nAnd such ... how to universities W que su eighty eight point nine FM ceilings grow\nWe have a translator and collect some of the Ninety point three were your arts and information station listener supported public radio W. V. I. S. [noise]\nTonight at seven and all that jazz will be spotlight he knew jazz recordings including one from bassist Christian McBride than mixed bag starts a date with this set of recent rock singer songwriters at eight thirty it's mixed bag new releases then at night it's homegrown music with an encore featuring singer songwriter yawn clubs in in\nThe hands on as I Know your attention\nThat this is George Graham joined us tonight starting at seven ...\nGood morning less than a month from the mid term election Democrats and Republicans have at least one thing in common they want to get their voters energize an album to the polls in November\nComing up on MORNING EDITION from NPR News [noise]\nWhat a democratic strategist whether his party can gain it's enthusiasm advantage back after the appointment of justice Brett Kavanaugh David\nGrann and I'm Noel King also this hour the curious case of among among the way he was the president of Interpol the international law enforcement agency now he's detained in China and being investigated\nFor a variety of crime and in Alaska ballot initiative that wants\nFishermen against the mining industry it is you can't tell brand name\nFilmmaker Guillermo del Toro fifty for today and the news is next\nFrom NPR News in Washington I'm core of a coalmine the newest justice of the U.S Supreme Court will be on the bench this morning when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh\nIt's MORNING when the court hears oral arguments NPR's Scott Horsley reports President Trump hosted a Monday Night ceremonial swearing in for Brett Kavanaugh at the White House\nKevin ... had already been quietly sworn in on Saturday hours after he was confirmed on or near party line vote he said he wants to put the contentious and emotional confirmation battle behind him and he promised to serve in a non partisan fashion\nI was not appointed to serve one party or one interest but\nTo serve one nation\nWhile Kevin O's remarks were conciliatory President Trump's were not Trump blasted Democrats for a campaign against capital he called dishonest and deceptive the president thinks ceding the new justice will give a political boost to Republicans in the mid term elections Scott Horsley NPR News Washington\nThe national Hurricane Center says that hurricane Michael is moving north in the Gulf of Mexico and aiming for the Florida coast forecaster John ... says Michael's top sustained wins or Ninety miles per hour\nIt's gonna be likely to make landfall in the Florida Panhandle of Florida Big Bend area there were today Wednesday that is our current thinking um and it's likely to make landfall as a major hurricane so that's category three or stronger or on the scale\nHurricane Michael is projected to then blow north across Florida and into Georgia and the Carolinas tropical storm watches are posted from the Florida Gulf Coast north to South Carolina at\nThe international Monetary Fund is cutting its forecast for global growth NPR's child Snyder reports the IMF blames rising interest rates and trade tensions\nThe IMF has revised its forecasts from July when it said the global economy would grow three point nine percent this year it smelled cut that down a couple of nachos downgrading expectations for this year in for twenty ninth team the IMF announces the global economy will grow at a three point seven percent clip\nThe IMF loved us economic growth on change for the rest of this year but cut the U. S. is twenty Nineteen forecast a two and a half percent because of the trade tensions with China the revision to the global forecasts was issued on the resort island of Bali as annual meetings of the IMF and World Bank get underway this week\nTrials later NPR News Washington\nThe south Korean government says North Korean leader Kim Jong un wants Pope Francis to visit North Korea\nAnd South Korean presidential office released a statement saying Kim told diplomats at the pope would be enthusiastically welcomed in North Korea the president of South Korea is expected to deliver that formal invitation to the contests during his scheduled visited Rome next week\nNorth Korea strictly controls religious expression in that country Kim it seemed to welcome diplomatic engagement that we're meeting with South Korean officials and President Trump\nThis is NPR\nOnline company Google is shutting down its social network Google Plus the company said it discovered a flaw last march that could have exposed personal data of up to half a million users\nThe company did not disclose this law until Monday the wall Street Journal also published a story on the floor saying Google didn't want regulatory scrutiny or damage to its reputation\nInterior secretary Ryan Zinke is taking action against new mining in Montana part of Yellowstone National park Yellowstone Public Radio's Kayla to Roche has more\nI think he returned to his home state of Montana it signed papers that put a hold on mining of thirty thousand acres of federal land there\nThere's places the mind there's places\nAnd you have to look at the American conservation ethic of best scientists best practices greatest good loved her\nLand off limits to development is known for its natural resources and ...\n... best practices greatest good lowest her\nThe land off limits to development is known for its natural resources and tourism that document extend protections put in place during the Obama administration and twenty six team that otherwise would have expired next month the withdrawal of the lambs last Twenty years which is the maximum length of time and interior secretary Ken Grant\nFor NPR News I'm Kayla debt Roche in billings\nDisaster officials in Indonesia now say more than two thousand people have died from last month's earthquake and tsunami on the island is still the ... the most of the deaths are in the provincial capital Paolo a coastal city that felt the full effect of the disasters\nSome Seventy thousand people have since been displaced food and clean water remain limited\nThis is NPR\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\nTaking a look now at the forecast it'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with highs in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies it'll be mostly cloudy on Wednesday night along with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with eyes in the mid seventies our chance of rain is eighty percent\nThis is W. V. on a ...\nLike\nWhat you see on WB I a view enjoy fine programs like pull dark knows that we're nature the your kids love watching the antics of Elmo on Sesame Street enjoy sit the science kid are curious George how 'bout shows like called the doctor Pennsylvania ... or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a never today and ensure the future of your favorite programs\nThat W. V. I. A. dot org and thank you for your support for W. V. I. A.\nProgramming a double you'll vi is made possible by our members and by Lindy corporation if it's done for decades windy specialized in underground municipal utility and pipeline construction now focusing on harvesting the natural gas from under our feet in northeast Pennsylvania\nSupport comes from the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community with open house event Sunday October twenty first or Sunday November fourth see how one of America's premier colleges will open doors for you\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping that the bitter battle over Supreme Court justice Brett Kavanaugh will motivate their base and Dr voters to the polls for the midterm elections\nRepublican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the GOP got from the confirmation battle is polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this is McConnell over the weekend on CBS face the nation\nI Want to buy the other side for the tactics that have allowed us to got to energize and get involved in our own uh voters\nOh let's talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing monkey with the campaign manager for Hillary Clinton's campaign in twenty sixteen welcome back to the program\nThanks so much\nSo McConnell seems appreciative for how Democrats handled the confirmation battle over over Kevin all I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away\nSo for over Kevin all I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away it at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap but there's still a significant advantage for Democrats\nAlthough one of our our polls that NPR showed the Republicans went a long way in closing that energy gap I mean it it sounds like Democrats might have some work to do to to sort of why men death again what what what is the plan\nWell first of all this is a bum so I think some of that is temporary secondly the Republicans did a lot of damage to themselves there are a lot of women in important districts around the country who used\nThis is Ari Shapiro host of all things considered an everyday that I'm hosting the show I sit in the studio for at least two hours while the show is alive and when I can leave the studio at the end of those two hours and say that we really need some place\nWe told you what was happening that was important we showed you what was happening was delightful surprise gee we kept you engaged then I feel like we had a really good guy all things considered listen every afternoon Monday through friday get four weekends at\nParliamentary didn't\nHad a really good guy all things considered listen every afternoon [noise] Monday through friday get four weekends with five\nParliamentary disease is one of those common medical conditions in the world millions of people in the United states suffer\nForm of lung disease including asthma bronchitis emphysema\nMilking genetics and infections are factor\nFor why someone they develop water more disease\nPulmonary hippie every\nTown on the call a doctor\nWednesday night at seven thirty on WB I a TV [noise]\nSomebody vi thank the many regional business leaders who support or non profit public service mission to learn how your business can sponsor NPR News and other favorite programming bleach called five seven zero six zero to eleven thirty seven like\nTaking a look now the forecast it'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with highs in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies it'll be mostly cloudy on Wednesday night along with a chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with eyes in the mid seventies our chance of rain is eighty percent\nThis is W. V. I. F. M.\n\nSupport for NPR comes from the station and from Hitchcock's insurance providing customized insurance for small and medium businesses so they can do more and be more learn more at age ... CEO X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom Harvard Business school executive education for executives said any career stage to prepare for new challenges through one of its comprehensive leadership program learn more at H. B. S. dot any flash executive\nAnd from ... in a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and\nWork better together more at at ... dot com\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in France was\nA man named among Hong way he's from China but in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my whole among\nHighway sixty four years old he served as the vice minister of public security bureau which is China's national police ah in twenty sixteen\nHe became the first Chinese head of Interpol and there's no election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate an extra day Chinese officials at it deemed corrupt would escape China\nBut as it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] what China's government has been released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how is the tension unfolded has come from his wife ... on September twenty fifth\nThe day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by a ... knife fish suggest that she was in danger\nA week later she reported missing to French police on Sunday she spoke to reporters and we own France were in trouble is headquartered and here's what she said\nWe had to go in and you know what I Am the half of my other than that\nFrance wearing triple its headquartered and here's what she said\nWait a way to go to the heat on half of my children on the people in my life is all the\nWide and children's husband and father so they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back turned to the camera because she's received threats and is under protection by French police well when she\nTalks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by Xi Jinping immediately after he took office in twenty Thirteen and snare hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julian Kong the highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rules China he was China security czar before he was sent to prison for life and twenty Fifteen\nRob by removing month from the presidency of Interpol China loses a lot of sway within that organization that much is clear what does this mean for Interpol\nWell even before this happened China's use of it are all under amongst presidency was starting to raise some red flags earlier this year China tempted to issue a red notice that the international alert for wanted person\nFor an exile weaker active is we use are mostly Muslim ethnic minority who live in northwestern China China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with lung is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob thanks so\n\nAcross the United states more criminal courts are turning to video proceedings this isn't an effort to save time and money at that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\nFrom Illinois newsroom in Urbana league games reports\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead face a video camera from inside a jail\nSheriff just standard likes that system he's in Lewis ten in rural west central Illinois he demonstrates what his deputies used to have to deal\nThey would have shack hold onto their steps are going to be half of World War taking and their belts are going to be chained together so you're walking on the line it's kind of like a three legged race\nStandard says the video system they now you freeze up more of his officers for patrol and he argued that the convenience of the system is better for everyone\nNow we can take 'em right in the back and put 'em in from a video camera the judge has access to their video camera\nHaving a conversation just like we are now but it's just over a video screen\nBut Charles David ... says it's just not the same David than sixty eight years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds the video processed both off putting and demeaning\nWhen I first went to the video cord it just blew 'em up because the uh watching everybody get up and go in front of the screen and it's either yes or a notes or you know you couldn't say anything\nBecause uh watching everybody get up and go in front of this great it's an it's either yes or a notes or you know you couldn't say anything\nDavidson says when you're in the same room at the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got a fair shake\nOut trying to explain to the judge what happened and they told me to be quiet\nSoon after Davidson was sentenced to Eighteen months in prison [noise]\nLayer Rosalie joy says she hears stories like David sent all the time she's with the national legal aid and defender association and says the increasing use of video court has some defense attorneys concerned that alienates the accused from those deciding their fate\nEven before the proceedings began you already feel like you're treated as though you're guilty you are feeling excluded from the process you are treated as\nThe least important part of the process because there is nothing that can replace human interaction and after a defense attorney I Am never going to be as effective in the courtroom for my client\nUnless my client stand shoulder to shoulder to me\nWell there's little research on video court what's out there shows in may increase Dale amounts and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of those advocating for the accused say it's a trade off that's unfair to defendants\nFor NPR News I'm Lee gains in Urbana, Illinois [noise]\n\nThis is NPR News\nYour membership support enables our region to better understand the world through weren't winning NPR New [noise]\nSome challenges in there to\nA small scale commercials salmon fishermen and the consummate Alaska today he's supporting a candle jacket and a gun on his back in case we run into a moose ... vote to have a look [noise]\nWould also helping\nLeaves the stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek with says he thinks it's a long overdue change\nFish scale is friendship too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large new mines in oil developments in the works\nIf it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it was set strict standards for restoring salmon streams if they're disturbed and the companies don't follow the rules they could face criminal penalties what knowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this\nIs really kind of\nSome in your nose at the big guys you know\nFor decades Alaska's economy has\nDepended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of that like this wire\nIt claims to protect their habitat when it actually improved as burdensome new regulations that flu or stop Alaska projects\nCompanies have poured millions into the campaign against the ballot measure\nWith help from donors like BP and Exxon Mobil they've not raised more money than all free of Alaska's gubernatorial candidates combined turn Matthias is with the council of Alaska producers the group that represents mining companies and she argues that states salmon fisheries have so far coal existed with minds oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just seems crazy\nMatthias thinks the initiative prioritizes standing at the expense of the state's biggest economic engine and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans similar more than just a living or the occasional meal here they represent something deeper their vital food source and a traditional way of life in one of the last states were wild river's still team with them every summer\nSo when voters head to the polls this November there'll be weighing that against the fears that have met her to protect same and could read all the states' economic foundation\nThis November there'll be weighing that against appears that I met her to protect him and could read all the state's economics foundation\nFor NPR News I'm Elizabeth herbal in Anchorage [noise]\nThat report came to us from Alaska's energy desk at the public media collaboration focused on energy and the environment\n\nThis is NPR News support for WBAI comes from loser and County Community college now enrolling for the winter and spring semesters with more than one hundred degrees barriers lowest tuition and easy transfer to four year colleges loser and we'll get you ready for success more information at loser dot edu [noise]\nOn this week's broadcast the San Francisco and simply music director Michael somehow brings out all the colors of the orchestra stolen and whole section to get a chance to shine originally and collectively by ... most are\nSamuel Adams that next time San Francisco says [noise]\nMonday afternoon it to a W. B. I. A. F. out\nYour membership support enables our region to enjoy the quality of life classical jazz and contemporary music and other favorite programming\nThank you for your public radio possible W. V. I.\n[noise] Ninety second national right [noise]\n[noise]\nHi there I'm paying Maynard frog slime just could be the source of the next flu drug\nScientists have spent decades searching for new drugs to combat viruses by mining proteins that animals make to fight off germs and lately proteins found in amphibian mucus have shown promises against HIV and herpes and now it's influenza\nResearcher sampled saw him from the skin of a frog southern India gets mucus contained host approaching the researchers test is thirty two of them against the flu virus for showed promise they're calling it your room and for the type of sword used in the region of India where the frogs found\nYour room and didn't harm mammals it did however seem to give several flu viruses a hard time\nYou're rooming slowed the ability of age three into viruses to reproduce she'd was particularly good however it killing each one in one viruses\nIsn't that's fortunate because these are a more common family or viral strains that sick and people mice treated with the frogs line protein also had a better chance of survival when exposed to a killer strain of flu\nIn Ninety second naturalist is a production of Cincinnati Public radio ... deal with support from Cincinnati Public radio member to spread the good news at the natural world [noise]\nSupport for NPR comes from the station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Kara data leverage is all relevant data to deliver answers to complex business issues Tara data dot com\nAnd from PBS with the circus American Experience explored the rise and fall of the big top end its influence on entertainment in the U.S the circus that tonight event continue tonight at nine eastern on PBS\nIt's MORNING EDITION from NPR\nThe circus tonight event continue tonight at nine eastern on PBS\nIt's MORNING EDITION from NPR News I'm Noel King I'm David Greene today we're closing the circle on the story of a loved Stradivarius\nAlong to the virtuoso violinist Roman Totenberg just a few years after ... death at age one hundred one and thirty five years after it was stolen violin was recovered by the FBI\nTimbre of daughter Nina Totenberg\nBroke that story and today she brings us what musicians call the coda the concluding part of the\nPiece as I recall three years ago my father played that violin to awaken the hearts somebody [noise]\nMan\nAnd to dazzle [laughter]\n\nAnd when the violin was recovered we three Totenberg sisters were intent on just one thing that the instrument now known as the Totenberg aimed strategy would be played in concert halls everywhere not closeted away in some collectors fault ensuring\nWas not as easy as you might imagine the violin was an excellent shape but because it had not been professionally maintain for thirty five years it had to be restored a task performed over to painstaking years by craftsmen at rare violins of New York\nStill finding a buyer who met our specifications with not so simple we could sell it for a loop holes in Asia but likely never hear it again\nAnd then the co owners of rare violins these ... and Bruno price were approached by an angel a person whose identity we still don't know and likely never will\nSee even Bruno refer to him only at our friend he was willing to buy the violin but not for himself\nHe challenged us to help young musicians have access to great instruments these arise he called la ... gone up so high over the last Thirty years [noise] musicians have no longer\nHave the ability to ... let alone all day\nAnd so it was even Bruno have found is something called rare violence in consortium away for a wealthy patrons of the arts do acquire string instruments and then lend them after promising young musicians for years at a time\nMy father's violin we'll go first to Eighteen year old Nathan melts or who already have enough of a career to pay the considerable insurance and maintenance costs\nMelts or a strapping six foot or who can manage this relatively large strategy has been practicing on the violin for about six weeks now\n\n\nI don't know how to explain how credit so it's it has an amazing amount of power to it in all registers at the same time there's the sweetness and it never gets brittle and never gets shrill\nToday is the last day that the ... will be in any sense the property of the Totenberg family we hope we've been good custodians in my father's name and Antonio Stradivarius as well\nBut most of all custodians for audiences who will hear Nathan melts er and others make that violence sing long after we're gone my\nThanks so much for your membership of WB I found that financial support makes all of our programming possible to find out how you can become a member go to W. V. I. A. dot org very you'll also find out more about the benefits of membership\nThanks again\nThis is your arts that information station W. V. I. eighty nine point nine of them do the V. I. H. D. one scratching Wilkes Barre hazel WTY eighty nine points I haven't ever Williamsport W T I O eighty eight points ... Mansfield W ... or you know the one point five FM Palmyra township\n... how to universities W que su eighty eight point on FM ceilings grove were in Bethlehem at one of five point seven this was listener supported public radio W. V. I Am\n\nKavanaugh says he's joining the Supreme Court with no ... but when President Trump took to the campaign trail he blasted Democrats for going after his nominee It's MORNING EDITION from NPR News\nA U.S Naval War college professor and longtime Republican who's leaving a GOP after watching Kavanaugh's confirmation I'm Noel King and I'm David\nGreene will spend time in Europe is our looking at why China invested heavily in a port in Greece and whether workers they're being exploited and his journalism becoming more dangerous in Europe the latest death of vulgarity and journalists found rape and murder\nWas titled homelessness rises an eighth grader in Idaho who lived in reality It's Tuesday after overnight Britain's prime minister David Cameron turn fifty three years old [noise] here's the news [noise]\nLive from NPR News in Washington I'm core of a cold when President Trump has apologized to the Supreme Court justice Brett Kavanaugh for the quote suffering he experienced during his confirmation process NPR's Emily Sullivan says the apology came at a swear rather ceremonial swearing in on Monday at the White House\nCabinet was confirmed by the Senate on Saturday receiving fifty votes after an emotional confirmation process centered on allegations of sexual assault he has denied all accusations President Trump started Monday ceremony with an apology\nOn behalf of our nation I Want to apologize to Brett and the entire covered all family for the terrible pain and suffering you have been forced to endure\nBefore making his comments the president acknowledged they were out of the norm in his speech at the ceremony Kevin I said the confirmation process tested him but it did not change his approach to judging emulate Sullivan NPR News Washington\nThe national Hurricane Center says hurricane Michael is a little more than four hundred miles south of the Florida Panhandle top sustained Windsor Ninety miles per hour but forecasters warned that storm will get much stronger before it crashes into the Gulf Coast\nBecca Amy manages the sense that I only got an RV club in Florida as Big Bend region\nIf you can go you probably should go and if you can't you just like the best preparations you can set to hunker down and hang in there knowing that that uh emergency management won't be able to help you at some point\nAlthough hurricane Michael we'll lose strength when it hit Florida it's predicted to barrel across Georgia the Carolinas as a tropical storm before crossing into the Atlantic ocean\nThe state of Delaware plans to take public comments this week on the Trump administration's replacement for the Obama era clean Power Plan NPR's Jeff Brady reports Delaware officials are frustrated the EPA is not holding public hearings on the east coast\nThe clean Power Plan named to reduce carbon dioxide from power plants to address climate change it was a blow to the ailing coal industry President Trump's BPA is replacing it with a new rule that give states more authority to regulate emissions\nThe EPA he'll just one public hearing earlier this month and Chicago Delaware natural resources and environmental control secretary Shaun ... says residents of his coastal state deserved to make their voices heard too\nWe are the ones that are feeling the impact now will continue to feel founded act in the future if we do not take steps to mitigate climate change\nDelaware plans to transcribe comments from its public beating and forward them to the EPA for the official record Jeff Brady NPR News\nOnline company Google is shutting down at social network for consumers Google Plus this comes after the company discovered a flaw that could have exposed some personal information of half a million people the wall Street Journal published a report that said Google discovered this law in March this is NPR\nTendencies Supreme Court has upheld the state's three drug method for ...\nDiscovered this law in March this is NPR\nTendencies Supreme Court has upheld the state's three drug method for putting prisoners to death Blake Farmer of member station WNPR land reports from Nashville that in order issued late Monday clears the path for many upcoming executions\nNearly thirty death row inmates were arguing that the one drug political using only ... would be easier to carry out in less painful for prisoners\nSeveral states currently uses one drug method but a majority of tendency Supreme Court said the inmates did not prove ... could be obtained it's been in short supply\nA dissenting justices executions and tendency of cloaked in secrecy making it nearly impossible for inmates to know the availability of lethal injection drugs and she argued that the pending executions should have been put on hold so the high court wasn't forced to rush a ruling for NPR News I'm Blake Farmer in Nashville\nThe investigative ... cat has published what it says is the identity of the second suspect involved in the poisoning of a Russian ex spy and his daughter this year the report legends Alexander Michigan traveled to Britain earlier this year and that he is a Russian military doctor\nHe and another Russian man alleged to be a senior military officers are accused of using a rare nerve agent to poison former Russian double agent Sergei Skripal and his daughter Yulia\nDisaster officials in Indonesia have increased the death toll from the earthquake and tsunami nearly two weeks ago to more than two thousand people some Seventy thousand people remain displaced\nThe disasters struck the island is still the ... and relief efforts remain on even I'm core of a Coleman NPR News\nSupport for NPR comes from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go and the ... foundation at ... dot org\nTaking a look now the forecast it'll be mostly cloudy this morning on becoming partly sunny and nice in the afternoon with highs and the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies\nIt'll be mostly cloudy on Wednesday night along with a chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with eyes in the mid seventies our chance of rain is eighty percent does is W. V. I. F.\nM. programming on W. vi is made possible by our members and by Lindy corporation of ... Lindy is committed to the local development of clean safe an abundant Marcellus natural gas harvested from under our feet in northeastern Pennsylvania\nAside from the latest news thoughtful coverage and balanced perspectives we also bring you a five\nWeek chess championship tournament in a prison\nThis tale starts with a fish called the ... news of the highest went viral and the school was inundated with donated something [noise] that group\nThat came from two black holes colliding [noise]\nIt's called all things considered for reasons [noise] listen every afternoon [noise]\nWeekdays at four weekends at five\nSupport for NPR come from Pennsylvania wads October's PA wind month celebrating Pennsylvania's locally grown and crafted wines with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC good morning President Trump celebrated the newest Supreme Court justice last night with every sitting member of the Supreme Court President Trump presided over swearing in ceremony\nTrump celebrated the newest Supreme Court justice last night with every sitting member of the Supreme Court President Trump presided over a swearing in ceremony for Brett Kavanaugh at the White House\nAfter a bitter and divisive nomination Kavanaugh promised that the process had tested but not changed him and that he would always conduct himself fairly from the bench\nI take this office with gratitude and no bitterness every American can be assured that I Will be an independent and impartial justice devoted to equal justice under law\nBut not every Republican is celebrating the appointment of justice cabin on in fact our next guest says he is leading the G O P because of that Tom Nichols is a professor of national security the U.S Naval War college and he wrote about his decision in the Atlantic thanks for joining us professor Nichols\nThanks for having me you have belonged to the Republican Party for most of your life why did this confirmation process prompt you to leave\nIt wasn't the confirmation process itself a that was more of the final straw\nUh this had been coming for a while I had felt strange for the party even after the twenty twelve elections I was hoping for recovery uh in the wake of what I think will eventually be the ... the implosion of the Trump Administration but\nAh with the cabinet confirmation it just seems to me that there was no moderate center left and the Republican Party that it has become a party capture um by the president\nIt's through the support of listeners like you that W vi is able to provide the excellent programming you enjoy daily learned more about membership at our website W. V. I. I. dot org\nSigned up today and thanks for all of us at W. B. I. A.\nY. center on the capital of ... university Sunday October fourteenth the UPS\nEnjoying a concert by the chamber orchestra that\nDeal onto a Canadian ensembles is known for its interpretations music of the seventeenth Eighteenth century\nBut also regularly delves into the repertoire of the nineteenth and twentieth century\nThe whites that her program includes works by towards\nAs well as middle class [noise]\nJoining the orchestra will be redound counter ...\nAthletic while on\nLive alone to do that by Jon Cohen Sunday afternoon October fourteenth the to the more information\nBucknell dot edu slash whites than [noise]\nW. B. celebrates hundreds of regional art and cultural organizations for details and many more events check the w._b. I ate marching calendar and catch up on our podcast W. V. I. I. dot org slash arts listening for art scene when Ericka funky weekday mornings after the news at eleven on WB I Am\nTaking a look now the forecast it'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with high in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies it'll be mostly cloudy on Wednesday night along with the chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with ice in the mid seventies\nOur chance of rain is eighty percent this is W. V. ...\nSupport for NPR comes from the station and from Mabel a language apps that teaches real life conversations in a new language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online it that'll be a B. B. E. L. dot com\nFrom Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance more information it builds on dot a W s\nAnd from universal pictures presenting the new film first man from Damien shutdown director of la la land and whiplash and starring Ryan Gosling and Claire fully in theaters and IMAX friday\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene China has poured billions into making basically a Silk Road of the sea running dozens of pork than container terminals around the world\nIt's a way to move Chinese exports to important markets including the European Union and in Europe it all began in the Greek port of Piraeus the Chinese shipping giant Cosco has spent millions transforming it into the fastest growing port in the world but as Joanna Kakissis reports from previous this has come at a price\nIs a ... to ... because of the proper way\nWhere lawyers set out for each of the battle and more\nIs as iconic struggling because the proper way\nIt's were lawyers set out for each of the battle and more Hollywood dark for the Nineteen sixty film never on Sunday\nI\nPersonally know medically saying that there's no port she loved as much as ... ... do\nYou mind me\nThat a little known me he goes on\nMe or I should be\nFree tired David or your ... and his wife Maria the song by heart he worked at the port of prey is worth thirty five years\nTo but that was an ability ... what is this is my father when I started to\nReporter who didn't have many machine to load cargo into the shouldn't we just did it with our own hands or do we do to bags of groceries leather goods and they were all made in Greece old bound for North American straight\nHe says prayers took care of its stock workers he made good money and now has a\nGood pension\nYou flip the string of worry beat says he reminisced says in his living room underwater color painting of a ship\n... and then you have to ... million euros using them look I'm sure they'll be able to cross from the sewage if you get some regard as deep enough of big should go to everything\nTo be successful but for years when the Greek state owned the port bureaucratic red tape made it hard to attract investment\nThen came the debt crisis which began in twenty pen ravaged the Greek economy the he pushed Greece to privatize the port of Piraeus only the Chinese showed serious interest [noise]\nChinese shipping giant Costco took over the port in twenty sixteen it now\nOwns the majority stake and the Port Authority Cosco runs cargo terminals cruise ship peers and the largest passenger ferry Wharf in Europe and the Chinese are not stopping they're\nMeant to expand the car terminals they want to expand or they want to create the logistics center they want to build a new ah cruise terminal\nCan be done by let us advisors to the Greek shipping ministry he's aware of the Chinese lease on the court will run out and about thirty five years\nIf at some point in the future they want to abandon period as we will have all these investments they will not take them with with them okay and they will leave him here\nYou see it as entirely a win win win win those are the words of captain food chunk chill costs goes CEO and parade as heard here in twenty Fifteen ...\nWho ... he's an\n... one of the port union leaders ... as another interpretation\nWhen the time he said when when they they mean ... why she says the benefits mainly to go\nTo China the founder if they if they're if they found them know how their way to organize\nAnd doing business they find all these things in Europe\nYou can actually hear the Chinese expansion asked a cargo terminal which are busy twenty four hours a day straddle carriers with giant metal containers of goods onto shift workers in bright yellow safety best are everywhere these are coveted jobs in a country where the unemployment rate is twenty percent\nBut most of the Seventeen hundred workers at the port are tempted without\nTwenty percent but most of the Seventeen hundred workers at the port are tempted without labor like [noise]\n\nTwo years ago hundred protesters and police over hostile takeover and their working conditions\nThirty year old Steven ... recalled how he and his colleague work long hours and unsafe condition for less\nPay scale of one of them good men\nAnd other level man for\nWorkers were too scared to speak on it and they kept their heads down working straight shifts with outbreaks even to go to the bathroom\nSome of my co workers had to relieve themselves in plastic bottles\nNow he says at least they can take twenty minute break starting chefs\nOnly about two hundred and fifty workers are in the Greek dock workers' union run by your was ...\nHe cannot stomach the new reality for most workers at the port and blames Costco\nThey will silent obedient to workers with no unions in this new snow right what's the future we didn't win the future\nWe should've taken from her father's bust was sort of been the rights of due conditions who went bust you go to that in the future ...\nCost goes pray a CEO food chunk chill and his deputy declined NPR's interview request a Costco spokesman said at an email that after quote long and productive negotiations a labor agreement was signed that benefits both sides\nThe European Union's been largely silent on the labor concerns but ... says secretary of ports\nSays he has heard from you officials were suddenly worried that China's running a European port\n... me do you ... when you get to you know\nWe're all aware that the Chinese state is behind a company like Costco you sort of you that when push stuff to sell a report to Costco and the first place we were in debt we had little bargaining power he says the e you underestimated China [noise]\n\nAnd now that the Chinese flag is race for re it's too late for regrets for NPR News I'm Joanna Kakissis in ... ...\n\n... was just the beginning China has snapped up about a tenth of Europe work capacity in just the last decade I'm going to hear about that later this week [noise]\nNine\n\n\nThis is NPR News\nIf you recently got a new car and you don't need the old one donated to support WB I Believe in to what a way and you get a tax deductible receipt details or W. B. I. dot org slash cars or call you for for W. B. I. a car and this was your arts\nThen I hurry and rushed downstairs to get out and catch my bus sometimes\nKing staying at the shelter was eleven year old brother and his grandma Pam can't travel she says they moved here after getting an eviction notice\nThe landlord decided to sell the property and we just could not\nFind a place that we could afford\nMore depressed I got I just I didn't know what to do\nDifferent small disability typing in the government but it's nowhere near enough to cover rent in Boise can chose grateful for the shelter but since it's hard on her grandsons\nMy youngest when he can be a little terror because she's upset but you know he gets angry and then\nHe'll\nHe'll just say I hate this place hate this place\nIt's difficult for came to that you wouldn't know it\nCame as a social fourteen year old and a big smile\nOne of his favorite things about school is seeing its friends\nMy friends know about it and meeting homeless and they don't teach me on it I'm trying to work hard and it's just a effort to try not\nTo break down it's harder for students who are anxious and worried to concentrate homeless kids tend to score lower on standardized tests and have more graduation rate\nSometimes king does break down with his friends [noise]\n\nThis might not sound Keaton is doing okay\nCan carry trays due to a table with his\nDad is out of the picture of his mom has a drug problem before his grandma stepped in and he had to help take care of his little brother so you can read\nHe says that is out of the picture and his mom had the drug problem before his grandma stepped in and he had to help take care of his little brother\nHelped him get ready for school she was not watch so short days one time when we only had cereal for like Julie\n... been trying to convince his grandma that she should let him get a job so he can help it spent\nSo that [noise] you know oh I Can't travel won't have that you see a child as long as possible pay you don't want to be an encouraging grow up\nA few weeks later there's good news and cadence world they've got a house it's about seven hundred square feet that they share with a roommate for ... it's a huge improvement\nI feel much more comfortable and safe\nAnd probably most importantly he can take something he hasn't been able to for quite some time this is all very NPR News I'm Amanda feature in Boise\nThat story came to us from the mountain west news bureau and later today on all things considered in rural Guatemala many poor children are having trouble learning in school but when educator is trying to make a difference you can listen by asking your smart speaker to play NPR or your local member station by name\nThis is NPR News\nEvery hour of every day the programming you've come to expect on WB I he's paid for through the financial supportive listeners like you think so much for your membership learn more about membership and sign up today\nAt W. V. I. A. dot org\nYou'll probably [noise]\n\nIn many traditions the relationship between human beings and nature deep and we've shown mentioned mentioned and this is the pulse of the time\n[laughter] or\nIn this was one of the chiefs are the only doctor council six nations confederacy Indian nations\nHave always had ceremony and the someone is always been to celebrate\nAnd to give thanks to recognize these life giving essence as around us whether it's corn whether it's the beans grow whether the rain or whether the sun\nGrade ceremony a great Thanksgiving this becomes the central part of your daily life and so the idea of reverence for\nA respect for an appreciation\nFor Thanksgiving for\nThese essence is ensure a long life ensure a better life ensure a better community there's very little ... non industrial state her ceremony that just see what they call pomp and circumstance\nWhich is I think in contradiction to ceremony for corn [noise] someone is of humility rather than pomp and circumstance\nI find that in the community is where the ceremonies where our meetings are and where to learn how to those were the chief so you know when I sit with a consular chase\nI'm just always impressed that these men take the time with no pay no compensation around me half of the people and I'm always on behalf of the future I just have a great deal of respect as human beings are still capable of that and I know there are people all over this or\nProgram as part of our thirtieth anniversary celebration\nYou want to hear more check out\nIs part of our thirtieth anniversary celebration for more than you're more check out\nOur podcast owner art center presenting the coal Henry Saturday October thirtieth at eight pm one of the jazz world's most acclaimed vocalists possessing a potent combination of dynamic vocal abilities impeccable phrasing and powerful emotional residents six one zero seven hours you arts or its owner art center dot org\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn more it go to meeting dot com\nFrom Charles Schwab when it comes to wealth management Schwab believes in asking questions and being engaged so investors can better on their tomorrow learn more Schwab\nDot com and from the William T grant foundation at W T grants foundation dot org\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThirty years ago researchers from the New England aquarium started studying North Atlantic right whales off the coast of eastern Maine large parts of the whale showed up like clockwork in late summer now those endangered whales come to that area only sporadically and more and more they're being seen far to the north\nMurray Carpenter went out on a research vessel to learn more\n[noise]\nIt's just after dawn and Amy Goldman surveying the waters of the bay of Fundy just off of eastern most main she's a scientist with the New England aquariums Anderson Cabot Center for ocean life viewpoint that harbor porpoises chasing fish near the boat and then something much larger appears in the windswept water\nBehind us probably a humpback arson well we'll\nGet a better look it turned out to be too hot backs one spouse near the boat [noise]\nIt's a cool citing but these are not the whale she's after Milton is hoping to find the north Atlantic right whales that she and her colleagues have been studying here since Nineteen eighty they're largely lean whales with big heads and no dorsal fin researchers used to count as many as two hundred forging here in the summer\nBut they became scarce starting in two thousand ten and their range shifted dramatically many more of the whales are now summary and hundreds of miles north\nIn the Gulf of St Lawrence Mariano had bloom\nOne of ... research assistants survey that area in August and said it was nothing like the bay of Fundy\nThey had days where we were saying about the individual working and I'm from the ... and [noise]\nRight well and I lived in rice\nWanting to see\nBut in total fewer than four hundred and fifty North Atlantic right wells remain and their numbers have been falling for a decade as more urban entangled in fishing gear or killed by ships reproduction\nIs also declined researchers found no new cabs last winter with the population on edge scientist wants to understand the reasons for the new migration pattern Nick record is with the Bigelow laboratory for ocean sciences in east ... Maine\nMy hypothesis is that this change in the migration patterns of Wales is connected to their food resource mainly ... columnist is like the battery of the Gulf of Maine\nColumnist is a type of fat rich plankton that's favored by many species record says a changing climate is not only rapidly warming the region's waters it's also shifting the currents that one swept this important plankton into the deep basins were right whales feed making it less available to them\nMore of a brown another scientist with the New England aquarium team so she actually find hope in the habitat shift all the way from the waters near Maine\n... brown another scientist with the New England aquarium team so she actually find hope in the habitat shipped all the way from the waters near Maine to the Gulf of St Lawrence\nIt's not like it's right next door will have to swim all the way around Nova Scotia so what a tremendous response you know this is a highly endangered well there's not many of them left and yet they're demonstrating that they can respond to major changes in their habitat and that's actually quite encouraging\nBut she says it's definitely slim pickings in the waters near Maine\nIt's not that this area's abandoned the cheese are count for this year is less than doesn't lands\nBack at the dock the crew in their thirty mile survey the last of the season with no right well sightings but ... says its worst sticking with the research\nWe're not a whole new era right now with climate change with habitat shift it's important with it long term study to sort of maintain some of the basic efforts that we've had so that we can better understand what's happening for the well\nAnd translators dealt each ... ... to eight nine ... son very W too there were seven eight Williamsport and ... to have an eight eight oh wells borough was their support it public\nMan mama and\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King\n\nThis has doubled vi eighty nine point nine ... W. V. I. H. D. once threatened Wilkes Barre Hazelden W. B. Y. U. eighty nine point seven Williamsport WTO eighty eight point three if that means ... Mansfield WPRI you Ninety One point five FM Palmyra township such what how to universities W que su eighty eight point not have them see them grow\nAnd translators do they do want to ... ... to eight nine ... W too there were seven eight Williamsport and ... to seven eight eight oh wells borough listener supported public radio [noise]\nThe Williamsport symphony or conducted by ... Edelstein opens October sixteenth with works by Racine each ... and Brahms Grammy nominated and chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth that the community art center five seven zero three to six twenty four twenty four or ... or sponsors who'd our capital group that might come in college\nWho\nGood morning less than a month for the midterm election Democrats and Republicans have at least one thing in common they want to get their voters energized in our poll\nComing up on MORNING EDITION from NPR News [noise]\nWell that's a democratic strategist whether his party can gain it's an ... an advantage back after the appointment of justice Brett Kavanaugh of David\nGrann and I'm Noel King also this hour the curious case of among among the way he was the president of Interpol the international law enforcement agency now he's detained in China and being investigated for a variety of crime and in Alaska ballot initiative that wants\nHits fishermen against the oil and mining industry\nIt is you can't tell brand name filmmaker Guillermo del Toro fifty for today and the news is next\nLife from NPR News in Washington ... Coleman the national Hurricane Center says hurricane Michael is less than four hundred miles south of the Florida Panhandle in the Gulf\nTop sustained winds are one hundred miles per hour and four cats you become much stronger shelters are beginning to open up today from member station WFSU Ryan daily reports Tallahassee is mayor is urging residents to take precautions\nTallahassee mayor Andrew Gillum says north Florida has been battle tested through two major hurricanes in recent years including Irma in two thousand Seventeen but he says the state's panhandle region should brace itself for an even stronger storm with Michael and Florida's capital city the mayor expects widespread power outages\nFor those who was in rely on our electric utility system for their livelihood or we would recommend that day or a find a safer place to ride out this stuff\nMandatory evacuations have been called in some coastal counties Michael is expected to make landfall Wednesday for NPR News I'm Ryan daily in Tallahassee\nOnline site Google says it will shut down its Google Plus side after saying it found a flaw that could have exposed personal information of half a million users\nGoogle says it has no information the personal data was misused but it's only disclosing the vulnerability now Wall Street journal reporter Douglas McMillan wrote about the breach he told NPR's MORNING EDITION there's no clear law that Google broke by withholding the news\nThere is a a patchwork of laws there's there Patrick state laws and\nFor NPR News I'm Ryan daily in Tallahassee\nOnline site Google says it will shut down its Google Plus side after saying it found a flaw that could have exposed personal information of half a million users\nGoogle says it has no information the personal data was misused but it's only disclosing the vulnerability now Wall Street journal reporter Douglas McMillan wrote about the breach he told NPR's MORNING EDITION there's no clear law that Google broke by withholding the news\nThere is a a patchwork of laws there's there Patrick with state laws and there's a there's a new European law that address is is\nThe problem is the law hinge on whether or not the company knew that data was improperly access and its case Google was pleading ignorance they're saying we don't know we have no evidence the data was access so we'd therefore have no obligation he\nAlso says Google was worried about damage to its reputation and about government scrutiny Brett Kavanaugh takes the bench today for his first arguments since that Senate voted narrowly to confirm him to the Supreme Court Saturday NPR's Carrie Johnson reports the new justice spent the weekend working\nBrett Kavanaugh and his family appeared at the White House Monday evening for a ceremonial swearing in ceremony but he's mostly been studying up for his new job\nKevin hired for women clerks a first for the Supreme Court and a source close to the justice says he's been reading briefs to get ready for oral arguments\nHis first cases involve what kinds of crimes for mandatory prison sentences under the arm career criminal act Kavanaugh's confirmation opens up another seat for the White House to fail on the prestigious federal appeals court in Washington Carrie Johnson NPR News Washington\nMourners held a candlelight vigil in Amsterdam New York last night for the twenty people killed in the limousine crash on Saturday the vehicle around a stop sign to pedestrians are among the dead you're listening to NPR a\nQuirky group of new wave pioneers a soulful folk ... end an R. and B. hit maker are among the Fifteen nominees vying for a spot in the rock and Roll Hall of fame from member station WBUR C. P. and Idea Stream David C Burnette has details on the rock hall twenty Nineteen hopefuls\n[noise] the collapse of industry in the mid western rust belt gave birth to a band made up of ten states art students whose pioneering music videos parodies the evolution of society and this has DeVos first time on the valley\n[noise] [noise]\nAlso making their ballot debuts are Roxy Music Todd run run and singer and songwriter John Prime\nMan\nA number of previously nominated performers are in contention including Radiohead graph work and\nJanet Jackson [noise]\nNow voting committee will narrow the list to a half dozen hall of fame ended up these will be announced in December for NPR News I'm David C Barnett in Cleveland to Brazilian\nPresidential candidates are campaigning for that country's presidential runoff election at the end of the month far right candidate and former army captain gyre both so narrow came close to outright victory Sunday he'll face former Sao paulo mayor Fernando high not of the leftist workers' party\nOfficial in Ukraine said there have been several explosions and an ammunitions depot thousands of people have evacuated fireball shot into the sky east of the capital\nKiev on corporate Coleman NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include the University of Florida we're solving for next is power to buy or to land grants heritage from renewable energy to global health us students\nSome day he'll face former Sao paulo mayor Fernando high not of the leftist workers' party officials in Ukraine saying there have been several explosions and an ammunitions depot thousands of people at the bank you waited a fireball shot and did this guy needs to the capital Kiev\nI'm core of the Coleman NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include the University of Florida we're solving for next is power to buy it landed grants heritage from renewable energy to global health us students and researchers are working to solve challenges at next to die UFO dot edu\nTaking a look now at the forecast there'll be mostly cloudy this morning then becoming partly sunny and nice in the afternoon with high in the mid seventies\nIt'll be mostly cloudy this evening with Lowes in the mid sixties Wednesday looks partly sunny and warm with ... in the mid seventies it'll be mostly cloudy on Wednesday night along with the chance of rain with lowest in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with ice in the mid seventies our chance of rain is eighty percent this is W. V.\nI. F. am\nSupporting W vi a wise markets presenting the lies healthy bites typical week every Friday afternoon it for an W ... world food day is coming up on October sixteenth this week's tip will teach you how to reduce food waste in your home\n\nHaving listened to some quick different maybe slightly obscure musical selections on our media that's neat [noise] you're kidding enjoying the sunshine\nOh\nJoined view on uh Richie Saturday evening at age on WB I Am\n[noise]\nSupport for WBAI comes from boom city Brewing Company in restaurant in the heart of Williamsport a proud like coming county corporate club sponsor helping to make W. V. I. F. M. programming possible thank you boom city Brewing Company in restaurant\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Republican and democratic leaders have one thing in common right now both are hoping that the bitter battle over Supreme Court justice Brett Kavanaugh will motivate their base and Dr voters to the polls for the midterm elections\nRepublican Senate majority leader Mitch McConnell described it as a quote shot of adrenalin that the geo Pete got from the confirmation battle is polls do show that the Republican Party is closing in on Democrats enthusiasm advantage this if McConnell over the weekend on CBS face the nation\nI Want to thank the other side for the tactics that have allowed us to cut to energize and get involved I own a voters\nLet's talk about what the Democratic Party might be able to do to try and regain steam I'm joined by rubbing monkey with the campaign manager for Hillary Clinton's campaign in twenty sixteen welcome back to the program\nThanks so much\nSo McConnell seems appreciative for how Democrats handled the confirmation battle over over Kevin all I mean do you worry that the Democrats have given away the edge that they had heading into November\n[noise] I don't think that the edges been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a farm to try to close that gap but there's still a significant advantage for Democrats\nI don't think that the edges been given away at all I thought you characterized it quite well which is that Democrats had a big advantage and Republicans got a little bit of a bomb to try to close that gap but there's still a significant advantage for Democrats\n\n\nAnd this is NPR News support comes from the University of Scranton to understand\n\n\nThis is NPR News\nSupport comes from the University of Scranton to understand all that Scranton has whopper visit the campus experienced the community with open house events Sunday October twenty first or Sunday November fourth she held one of America's premier colleges will open doors for you\nOn the next fresh air had terrorists governments political campaigns and even street gangs are using social media to push propaganda this information and fear with real world consequences\nWe talk with the W. singer and Emerson broken authors of the new book like war the weaponization of social media China [noise]\nThis evening at six after all things considered on W. V. I Am [noise]\nBombing every disease is one of the most common medical conditions in the world millions of people in the United states suffer\nForm of lung disease including asthma\nFor why someone they develop water more disease\nPulmonary disease every\nCount on the next call the doctor\nWednesday night at seven thirty on WB I a TV [noise]\nSupport them from customs container solutions a manufacturer customers standard Ross front in dumpsters specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com taking\nA look now the forecast it'll be mostly cloudy morning I'm becoming partly sunny and nice in the afternoon with highs and the mid seventies\nIt'll be mostly cloudy this evening was lows in the mid sixties Wednesday looks partly sunny and warm with ties in the mid seventies it'll be mostly cloudy on Wednesday night along with a chance of rain with Lowes in the mid sixties or chance of rain is fifty percent and rain as likely on Thursday with eyes in the mid seventies our chance of rain is eighty percent\nThis is W. V. ...\nSupport for NPR comes from the station and from capital one offering a variety of credit card options with features for a range of customers from foodies to travelers capital one what's in your wallet credit approval required capital one bank usa an a\nFrom Amazon Prime video presenting the return of the man in the high castle where American history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nAnd from Harvard Business school executive education for executive that any career stage to prepare for new challenges through one of its comprehensive leadership programs learned more H. B. S. dot any flash executive\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in France was a man named among Hong way he's from China\nBut in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and asked him what do we know about my whole ...\nEach B. S. dot any flash executive\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King until recently the head of Interpol the international police organization based in France\nWas a man named among Hong way he's from China but in a stunning move China's government detained mom put him under investigation and now he has resigned from Interpol I talk to NPR's Shanghai correspondent Rob Schmitz and ask them what do we know about my whole among\nHighway sixty four years old he served as the vice minister of public security bureau which is China's national police are in twenty sixteen he\nBecame the first Chinese headed Interpol and there's an election was a big victory for China's government which under leader Xi Jinping was eager to use Interpol to locate an extra day Chinese officials at it deemed corrupt to it escaped China\nAs it turns out among himself is now under investigation by Chinese authorities for corruption\nWhat exactly are they investigating him for\n[noise] which I think government hasn't released any details besides that he's under investigation for bribery and other unspecified crimes and the little we know about how the attention unfolded has come from his wife ... on September twenty fifth\nThe day her husband arrive to China for a visit she allegedly received a text from him that said wait for my call which was followed by in a mood you even nice to just being that she was in danger\nA week later she reported missing to French police on Sunday she spoke to reporters and they own France were in trouble is headquartered in here's what she said\nWe had to go into the half of my hand and when my children on the people in my mother and all the\nWind and children's husband and father so that they may no longer disappear\nAnd as you can hear in that tape now while she's crying during this part of the video with their back turned to the camera because she's received threats and is under protection by French police well\nWhen she talks about the husbands and fathers who disappeared in China what does she mean\nWell she's talking about the government anti corruption campaign was launched by Xi Jinping immediately after he took office in twenty Thirteen and its neared hundreds of thousands of officials both on the local level as well as among the highest echelons of the party\nIn fact the man who appointed Malone way to vice minister of public security was Julian Kong highest ranking Chinese official who was brought down by this campaign Joe was a former member of the pull up your standing committee the group of seven men who rules China he was China's security czar before he was sent to prison for life and twenty Fifteen\nRob by removing them from the presidency of Interpol China loses a lot of sway within that organization that much is clear what does this mean for ...\nWell even before this happened China's use of in our poll and amongst presidency was starting to raise some red flags earlier this year China tempted issue in red notice that it's an international alert for wanted person\nFor an exile weaker activists were years are mostly Muslim ethnic minority who live in northwestern China who China's government blames for unrest and who are increasingly being sent to re education camps\nOther members of Interpol vetoed that particular red notice after China could not provide any evidence of criminal wrongdoing but it was an example of how China was using the organization for its own political means in this case with lung is a good example of how China's messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob thanks do\n\nAcross the United states more criminal courts are turning to video proceeding this isn't an effort to save time and money that that happens some public defenders and others in the criminal justice system are questioning whether the rights\nIt was an example of how China was using the organization for its own political names in this case with lung is a good example of how China as messy politics is spilling over into international organizations\nReally interesting stuff NPR's Rob Schmitz joined us from Shanghai thanks Rob ...\n\nAcross the United states more criminal courts are turning to video proceeding in an effort to save time and money that that happens some public defenders and others in the criminal justice system are questioning whether the rights of those accused are being affected by this technology\nFrom Illinois newsroom in Urbana league games reports\nToday like most days thousands of defendants will show up in criminal court for their first appearance in front of a judge it's likely that more than half of those appearances will not be in a courtroom in person the defendant will instead face a video camera from inside a jail\nSheriff just standard likes that system he's in Lewiston in rural west central Illinois he demonstrates what his deputies used to have to do\nThey would have shot hold onto their stuff we're going to be half of war we're taking care of their belts are going to be trained together so you're walking on the line it's kind of like a three legged Roche\nStandard says the video system they now you freeze up more of his officers for patrol and he argues that the convenience of the system is better for everyone\nSo we can take a friend of mine put it in front of a video camera the judge has access to the video camera\nConversation just like we are now but it's just over a video screen\nBut Charles Davis and says it's just not the same Davidson is sixty eight years old and a recovering heroin user who was in and out of jails and prisons in Illinois for over two decades he finds the video processed both off putting and demeaning\nWhen I first went to the video court it just blew 'em up because it wasn't everybody get up and go in front of the screen and it's either yes or a nose or you know you couldn't Sunni to\nDavidson says when you're in the same room at the judge it's easier to have a conversation with them and he's noticed there's a greater chance to listen to what you have to say he says the first time he appeared in video court he didn't think he got a fair shake\nShot explain to the judge what happened and they told me to record\nSoon after Davidson was sentenced to Eighteen months in prison [noise]\nLawyer Rosalie joy says she hears stories like David sent all the time she's with the national legal aid and defender association and says the increasing use of video court has some defense attorneys concerned that alienates the accused from those deciding their fate\nEven before the proceedings began you already feel like you're treated as though you're guilty you are feeling excluded from the process you are treated as\nThe least important part of the process because there is nothing that can replace human interaction and as a defense attorney I Am never going to be as effective in the courtroom for my client\nUnless my client stand shoulder to shoulder to me\nWhile there's little research on video court what's out there shows it may increase bail amounts and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of those advocating for the accused say at the trade off that's unfair to defendants\nFor NPR News I'm league games in Urbana, Illinois [noise]\nThere is little research on video court went out there shows it may increase bail him out and in many cases makes private communication between attorneys and clients more public\nOn the prosecution side many defend video court for its cost savings and efficiency while acknowledging that some of them and advocating for the accused the at the trade off that's unfair to defendants\nFor NPR News I'm regained in Urbana, Illinois [noise]\nUsing his vote to cross with ... creek Mike would without a massive shadow undulating just beneath the current the last of this year salmon for writing here\nTo spot there's some fish Silver's\nChums in there to\nWin a small scale commercials salmon fishermen and the consummate Alaska today he's supporting a candle jacket and a gun on his back in case we run into a moose ... vote to have a look [noise]\nWould\nAlso helping leaves the stand for salmon campaign for a ballot measure aimed at protecting the state's most iconic fish walking along the creek would says he thinks it's a long overdue change\nFish scale is friendship too far in favor of of development and industry and and we're just trying to pull it back towards the center\nAlaska as some of the most valuable salmon fisheries left in the world but wouldn't other ballot supporters say the state's laws protecting salmon are weak putting them at risk especially with a number of large new mines in oil developments in the works\nIf it passes Alaska would enact a much tougher permitting process for big projects in salmon habitat among other things it was set strict standards for restoring examines dreams if they're disturbed and the companies don't follow the rules they could face criminal penalties what knowledge is that in a state like Alaska it's a big ask\nWhen you start doing something like this\nIs really kind of\nSome in your nose at the big guys you know\nFor decades Alaska's economy\nHas depended on industry dollars and oil and mining companies hate this initiative banded together under the name stand for Alaska they're backing a campaign to stop it running a blitz of ads like this lawyer\nIt clean to protect their habitat when it actually improved as burdensome new regulations that flu or stop Alaska projects companies\nHave poured millions into the campaign against the ballot measure with help from donors like BP and Exxon Mobil they've raised more money than all free of Alaska's gubernatorial candidates combined\nTurn Matthias is with the council of Alaska producers the group that represents mining companies and she argues the state's salmon fisheries have so far ... existed with minds oil developments just fine\nCompletely changing the way we regulate fish habitat at a time when we don't have a clear problem just seems\nCrazy Matthias thinks the initiative prioritizes standing at the expense of the state's biggest economic engine and taxpayers\nWe couldn't have the Alaska government that we have if it was only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans similar more than just a living or the occasional meal here they represent something deeper their vital food source and a traditional way of life in one of the last states were wild river's still team with them every summer\nSo when voters head to the polls this November there'll be weighing that against the fears that have met her to protect same and couldn't read all the states' economic foundation\nFor NPR News I'm Elizabeth herbal in Anchorage [noise]\nIf it but only dependent on fisheries it just wouldn't be possible\nBut for many Alaskans senator more than just living or the occasional meal here they represent something deeper their vital food source and a traditional way of life in one of the last states where wealth river's still playing with them every summer\nSo when voters head to the polls this November there'll be weighing that against appears that have met her to protect same and couldn't read all the states' economic foundation\nFor NPR News I'm Elizabeth ... in Anchorage [noise]\nThat report came to us from Alaska's energy desk it's a public media collaboration focused on energy and the environment\n\nThis is NPR News somebody vi celebrates the cultural life of our community art scene features with Erica funky weekday mornings after the news at eleven on WB I FM missed one catch up anytime arching online at W. V. I. dot org\nI'm Christian Bailey from live from here with Chris do and\nWe're proud to be the highest rated to our live musical comedy variety show on public radio in this time slot\nTune in this weekend for are showing policy leader in Saint Paul Minnesota with all our brothers missed Madison Cunningham\nDirty projector [noise] fly from here we make great radio [noise]\nSaturday Night at six Sunday night at eight on W. B. I. I got banned [noise]\nSupport comes from the times tribute for over a century the Tribune in Scranton assert northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the Taj Tribune was there for you and ... news dot com\n[noise] Ninety second national [noise]\n\nHi there I'm paying Maynard frog slime just could be the source of the next flu drug\nScientists have spent decades searching for new drugs to combat viruses by mining proteins that animals make to fight off germs and lately proteins found in amphibian mucus have shown promises against HIV and herpes and now it's influenza\nResearcher sampled songs from the skin of a frog southern India gets mucus can change the host approaching the researchers test is thirty two of them against the flu virus for showed promise they're calling it your room and for a type of sword used in the region of India where the frogs found\nYour room and didn't harm mammals she did however seem to give several flu viruses a hard time\nYou're rooming slowed the ability of age three into viruses to reproduce\nShe'd look particularly good however it killing each one in one viruses isn't that's fortunate because these are more common family or viral strange that sickened people mice treated with the frogs Lyme protein also had a better chance of survival winning exposed to a killer strain of flu\nAnd Ninety second naturalist into production of Cincinnati Public radio ...\nThe support from Cincinnati Public radio member to spread the good news at the natural world [noise]\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work in food health power jobs and resilient cities at rock found data\nProtein also had a better chance of survival when exposed to a killer strain of flu\nAnd Ninety second naturalist into production of Cincinnati Public radio and the Cincinnati Zoo the support from Cincinnati Public radio member it's to spread the good news of the natural world [noise]\n\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work in food health power jobs and resilient cities at rock found dot org\n[noise] from the door it's do charitable foundation whos clinical scientists development awards support promising early career physician scientists and their research efforts to improve human health and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene today we're closing the circle on the story of a loved Stradivarius\nAlong to the virtuoso violinist Roman Totenberg just a few years after Totenberg death at age one hundred one and thirty five years after it was stolen violin was covered by the FBI\nTotenberg daughter Nina Totenberg\nBroke that story and today she brings us what musicians call the coda the concluding part of the piece\nAs I recall three years ago my father played that violin to awaken the hearts somebody [noise]\nMan\nAnd to dazzle [laughter]\n\nAnd when the violin was recovered we three Totenberg sisters were intent on just one thing that the instrument now known as the Totenberg aimed strategy would be played in concert halls everywhere not closeted away in some collectors fault\nEnsuring that was not as easy as you might imagine the violin was an excellent shape but because it had not been professionally maintain for thirty five years it had to be restored a task performed over to painstaking years by craftsmen at rare violins of New York\nStill finding a buyer who met our specifications with not so simple we could sell it for a loop holes in Asia but likely never hear it again\nAnd then the co owners of rare violins these ... and Bruno price were approached by an angel a person who's a ... we still don't know and likely never will see even Bruno refer to him only at our friend he was willing to buy the violin but not for himself\nHe challenged us to help young musicians have access to great instruments these arise de ... gone\nUp so high over the last Thirty years [noise] musicians have no longer have the ability to access great instruments let alone all day\nAnd so it was even Bruno have founded something called rare violence in consortium away for a wealthy patrons of the arts do acquire string instruments and then lend them after promising young musicians for years at a time\nMy father's violin we'll go first to Eighteen year old Nathan melts or who already have enough of a career to pay the considerable insurance and maintenance costs\nMelts or a strapping six foot or who can manage this relatively large strategy has been practicing on the violin for about six weeks now\n\n\nI don't know how to explain\nSeeing young musicians for years at a time my father's violin we'll go first to Eighteen year old Nathan melts or who already have enough of a career to pay the considerable insurance and maintenance costs\nMelts or a strapping six foot or who can manage this relatively large strategy has been practicing on the violin for about six weeks now\n\nI don't know how to explain how\nCredit so it's it has an amazing amount of power to it in all registers at the same time does the sweetness and it never gets brittle and never gets shrill", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Williamsport", "day": "09"}