{"month": "10", "state": "PA", "station": "WVYA", "content": "The pot still translator at Ninety four point nine of them is made possible with support from the Richard ... junior charitable foundation\n\nW. V. I. A. F. M. at NPR are like nothing else than in fact based journalism and intelligent enjoyable entertaining and it's all made possible by listeners like you your contribution pays for programs like boarding edition all things considered and the ... radio community outreach like kids in the classroom and the great American read nothing\nComes close to public radio support WBAI with generous gift visit W. B. I. dot org or called when he'd seven seven seven hundred Ninety four to thank you\nGood morning who sent pipe bomb to prominent political figures authorities are trying to figure that out and we'll have the latest details on their investigation coming up and it's our MORNING EDITION\nIn these times we have to unify those with the words of President Trump as a bomb scare unfolded later at a rally in Wisconsin He again took aim at\nI'm David Greene and I'm Noel King also that's our New York the trendy generally stealing Exxon Mobil oil giant misled investors about the costs of climate change and it's super typhoon had slipped across the northern Marianna islands chat again is dating back\nTo manila latest news there can't be\nHappy birthday to sing or Katy Perry three four years old today and the news is next\nLive from NPR News in Washington I'm Dave ... no arrests have been made in the FBI investigation into seven pipe bomb sent the top Democrats and CNN they include once addressed to the Obamas bill and Hillary Clinton and California congresswoman Maxine Waters\nAt a Republican rally in Wisconsin last night President Trump said there's no place for political violence in the U.S NPR's Scott Horsley reports\nAs investigators track a series of suspected pipe bomb set to prominent Democrats President Trump made an appeal for political harmony\nHe urged partisan to stop comparing their opponents to historical village and he's self consciously tried to moderate his own rhetoric joking at one point do you see how nice I'm being there is one\nTo send a lot of disagreements it's called peacefully\nAt the ballot box that's when we\nThe president promised an aggressive investigation into the suspicious packages that the Hillary Clinton bronco bottom up CNN and others he said he hopes to bring those\nIt's an aggressive investigation into the suspicious packages to Hillary Clinton bronco bumps CNN and others he said he hopes to bring those responsible to justice very soon Scott Horsley NPR News Washington\nHealth officials in New Jersey say a seventh person has died from a viral outbreak at a pediatric rehabilitation center six of the seven our children the other is identified as a young adult all with vulnerable immune systems\nAt least Eighteen cases of the ad no virus had been confirmed at the ... Center for nursing and rehabilitation and Haskell that's about thirty miles outside of New York\nNew Jersey governor Phil Murphy says there are steps people can take to reduce the risk of contracting the virus\nI care to wash our hands with soap and water [noise]\nAvoid touching our eyes are knows her mouth I'm washing hands and to avoid close contact\nWith others may be sick\nIn addition to a pediatric center of the facility also cares for the elderly officials say the viral outbreak won't be declared over until there are no new cases for at least four weeks\nDamage in power outages are reported in the northern Mariano islands today but no deaths after a super typhoons swept across the area Michael Sullivan reports\nThe northern Mariano ths are home to roughly fifty five thousand people who are used to tie phones but this one side pen resident Glenn hunter told the Associated Press was the worst he's ever experienced we knew it was going to be big he said but wow\nMaximum winds up one hundred and eighty miles per hour were recorded around the eye of the storm passed over ... Penn early on Thursday\nThe island opinion about thirty eight hundred miles west of Hawaii was the hardest hit the islands medical center badly damaged as were many homes the national weather service says power and water could be out for weeks for NPR News I'm Michael Sullivan in Chiang Rai Thailand\nThis is NPR News from Washington\n\nThat arrest warrants been issued in El Salvador for an ex military officials suspected of killing a Catholic archbishop Oscar Romero back in Nineteen eighty as Maria Martin reports Romero was recently declared a Catholic saying\nThe arrest order is for Seventy eight year old former military official I thought it was set out of the non bunny ... ordered the murder of the ... the archbishop Romero who stood up to a Salvador's military dictatorship endless an advocate for the poor and voiceless during that country's twelve year long civil war\nSaid Audi I had been protected from prosecution by controversial amnesty law adopted into Nineteen nineties but overturned last year\nSo almost forty years after his brutal murderer was say mass archbishop was got her middle now saint of the Catholic Church and a symbol for human rights and they finally get some just it from El Salvador shoot ... system for NPR News I'm Annie and Martin\nThe Boston Red Sox are up two games to none over the Los Angeles Dodgers and baseball's World Series last night the red Sox beat the Dodgers forward it to end game too at Fenway Park\nDavid Price gave up three hits over six innings gave three is tomorrow night in Los Angeles the red Sox are seeking their fourth world series title in Fifteen seasons\nIt's been a down day for stocks in Asia following yesterday's steep losses on Wall street the Dow dropped six hundred eight points or more than two percent the Dow has now given up all of its games for twenty eight team the S. and P. five hundred fell eighty four points or more than three percent\nThe NASDAQ lost almost four and a half percent I'm Dave ... in Washington\nSupport for NPR comments from the Charles Stuart my foundation supporting efforts to promote adjust equitable\nSupport\nFor NPR comments from the Charles Stuart my foundation supporting efforts to promote adjust equitable and sustainable society and at home town of Flint, Michigan and communities around the world more at ... dot org and that listeners who support this NPR station\nTaking a look now at the forecast will see mostly sunny skies today with ties in the upper forties\nIt'd be mostly clear this evening and becoming partly cloudy overnight with Lowes around thirty friday looks partly sunny in the morning then becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in the mid thirties\nOr chance of rain and Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties this is W. V. a a ...\nMillion units any comedy\nThe major league puts while he tries to boost your money\nIn the lead them I Can't remember the on the railroad tiny stover Lawrence friendly cause me to\nJoin us they don't that's going on station [noise]\nSaturday afternoon at one [noise]\n[noise] nothing comes close to a public radio you tune in every day to W. V. I. A. N. NPR for honest and fair journalism programs like MORNING EDITION all things considered classical music and mixed back\nWhere else can you find such programming help us keep deserve a strong you care about independent journalism and intelligence entertainment so consider being a champion make a gift to W. B. I go to W. V. I. A. dot org or call one eight seven seven seven zero zero Ninety four to ...\nIt's MORNING EDITION from NPR News I'm well king in Washington D. C.\nAnd I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mocked people he disagrees with Mel though he is calling for civility after at least seven apparent pipe bombs were male to his political opponents\nSets right at a rally in Wisconsin last night the president can damage to the incident and then he turned his attention to the press\nThe media also has a responsibility to set a civil town as you stop the endless hostility and constant negative\nAnd oftentimes false attacks and stores have to do [noise]\nSo far authorities haven't released any information about a possible suspect\nAnd we have a lot to talk about here so let's bring in NPR White House correspondent Tamara Keith and also NPR's national security correspondent Ryan Lucas hello to you both mourning mourning Ryan let's start with you um seems like we're talking about seven devices now at least that were mailed out um who were they intended for uh the first\nWas found Monday outside the home of billionaire investor George Soros is a big contributor to democratic causes\nAnd then others were discovered address to Hillary Clinton former president Brock Obama Obama's former attorney general Eric Holder and then his a former CIA director John Brennan now the package intended for Britain was sent to the CNN office in New York it was discovered in the mail room there\nAre and then late last night we got word from the FBI that it had confirmed to more suspicious packages that were similar and the parents to the others those were address to Maxine Waters she's a California Democrat in the house who has been a very sharp critic of the president [noise]\nI'm female I'm the same old and I live in New Jersey [noise]\nLaughing through the pain\nThat next time on the Ted radio hour NPR [noise]\nSaturday in New no W behind a up in\nNext time I asked me that they're eating Slater star ... the ...\nTell us about the call that led you at all and they said we had this audition for you can't tell you what it is technically the entitled to land that project but we think you might be the right shape for it [laughter]\nThey're doing meal your eyes and very for NPR's our puzzles where again Andrea\nSaturday at eleven AM on W. V. I Am\n[noise]\nW. vi public media presents Pennsylvania decision twenty eight teams\nThe Pennsylvania ninth congressional district ...\nRepublican congressional candidate down music and democratic congressional candidate Danny will discuss the issues in front of tunneling analyzed either on or you\nKnow the candidates before you vote\nThe Pennsylvania ninth congressional district debate\nTuesday is seven on WB I hey [noise]\nTaking a look now at the forecast will see mostly sunny skies today with ties in the upper\nTaking a look now the forecast will see mostly sunny skies today with highs and the upper forties it'd be mostly clear this evening becoming partly cloudy overnight with Lowes around thirty friday looks partly sunny in the morning then becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in my mid\nThirties or chance of rain uh Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties [noise] this is W. V. ...\nSupport for NPR comes from the station and from the Walton family foundation where opportunity takes root more information is available at Walton family foundation dot org\nFrom the joy foundation committed to advancing racial equity and economic mobility for the next generation and the great lakes region learn more Joyce F. D. N. dot org\n[noise] from the state of Joan ... who's ... serves as an enduring investment in the future of public radio and seeks to help NPR producer programming that meets the highest standards of public service in journalism and cultural expression\nAnd from the ... and James Alan nice foundation helping NPR advance journalistic excellence in the digital age\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning some of the most troubled parts of this country our rural areas and in those places disdain for government typically runs pretty high\nBut this summer NPR along with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health surveyed abroad group of rural Americans and that pulled turned up some surprises about how many rural people want government help Frank Morris of member station Casey you are has the story\nRural America can sometimes feel like a country apart thirty two years ago Ronald Reagan summed it up with this clip\nI've always felt the [noise] nine most terrifying words in the English language are I'm from the government and I'm here to help\nRural Americans since come across some even scarier words like opioid epidemic\nSo ... would you have a very serious problems which took me around the economy and opioid drug abuse that really work\nAnd Robert Blendon at Harvard's th Chan School of public health says that of Thirteen hundred rule adults surveyed by NPR fifty eight percent so there tends need outside help\nI think that's a surprise for a lot of people that there is a willingness by most NATO to reach out her outside I'll\nTake the little town of bill in central Missouri there's a big struggle going on in a small town right now Gabby Stanfield feisty compact woman pushing Seventy looked up from the front porch of the town of Fifteen hundred corralled by green rolling hills and foreign fields\nAnd split by opposing views of outside involvement\nPeople wanting it to grow and wanting to be the best they can be and people that would prefer that everyone back off and let them do what they want\nIt's pressing here because this town is struggling with the same issues plugging much of rural America money you you don't have a tax base anymore that you used to have the shoe factory in bill a big employer and many local shops closed decades ago\nCareer options are scares some petty crimes go unpunished and like in much of rural America drug abuse is widespread\nEven though we're we're all the idea that we're saying\nIs that really there anymore\nSeat Murphy coverage though for the Mary Kennedy advocate newspaper\nIdea that we're saying\nIs that really there anymore\nRock seat Murphy coverage though for the Mary Kennedy advocate newspaper\nThere's no way that the community will be able to fix that drug problem by themselves in order to do that they would need more money and more resources that they don't have\nThat it's not like bills getting up and that's another thing that popped out and NPR's rural poll Robert Blendon says ... half of those surveyed say their community problems can be sold within five years\nIt is not all the world the hope was that many others are described here is a great deal of them that we can deal with issues if we can get outside help\nAnd ... says that those looking for outside help three out of five expected to come from government especially state governor [noise]\nProblem is state money is getting harder to come they\nUsed to be the ... relatives\nKathy Stanfield again standing on a grassy right of way cutting straight through ten where she says the state's once promised to build a major state\nLike the people that\nWanted this trail to go\nSee so many possibilities for this\nTown growing by having people from out of the city coming in here and spending their money here and ... and now\nWith basic I can tell us no it's it's a big disappointment it really is the state does spent quite a bit into paying public school\nSalaries providing grant that mostly cover things like new sidewalks drainage project hopefully any water tower the buck Showalter city hall says the city is often turned down\nBecause it's so competitive a lot of communities a lot of places need help sometimes it's pretty slim\nJonathan ... a lot of the center for rural affairs says state budget cuts are taking a heavy toll on small towns that depend on government funding more than their residents tend to realize and he says that with state funding drying up appreciation for it may be grilling\nThis is symptomatic of a country that is reevaluating itself and reevaluate in his decisions and realizing the importance of civic infrastructure and the importance of being part of a community and part of a state where we're all ... to the same direction I think this could be a positive sign\n... says that it's real hostility toward government is in fact easing the optimism that many rural residents feel about solving persistent drug in economic problems may be justified for NPR News I'm Frank Morris in belle Missouri\nA super typhoon named YouTube blasted across the U.S commonwealth of northern Mary on the island today devastating when tore off roofs and level small building now there have been no reports\nOf deaths on the Pacific island chain but the national weather service called you to the strongest storm to hit any part of the United states this year and we have more now from NPR's Julie McCarthy in manila\nResidents described the winds that how old are the northern Mariano as horrifying\n[noise] breed became shrapnel which is when the sustaining hundred eighty miles per hour according to satellite readings\nThat's well in excess of any hurricane that has struck the United states this year\nI don't want to point out shopping or wherever they want\nThat meteorologist Michael ... with the national weather service Utah is being compared to typhoon among crude which raged through the Philippines last month\nHe overrode says the intensity of Utah was so great that the wind instruments gave out along with Guam the Mary on its other western most territories of the United states\nOf you tell was so great that the wind instruments gave out\nGuam Mariano has other western those territories or the United states with a population of fifty four thousand the Mary on this law about sixteen hundred miles east of the Philippines\nThat stores I crossed directly over any in Ireland and scrape side panic the largest in the chain of fourteen volcanic island\nThe mayor of tea any and Joey Patrick Nicholas the damage\nBut we're still without power um years without water like if you're a value or\nSome residents expect I'll get you to last for weeks the mayor said the power plant has been compromised and the distribution system completely destroyed under grey skies residents the typhoon toward island can be seen on social media combing through what is left of their homes\nSearching for their belongings McCarthy NPR News the new law [noise]\nAnd this is NPR News\n\n\nHow long he keeps it that way is not clear how often he will become teleprompter Trump for a while and then he will switch back to rally Trump\nAnd and you just don't know when it's going to happen and it didn't say anything directly about the people who were targeted have any of them said anything yeah that's right he didn't take any of the names of the people who've been targeted often they're features of his rally at a Hillary Clinton was speaking yesterday at\nAn event and she said that she is fine thank the secret service she tells me that troubling time that's\nDeep divisions in the country and ... thanks you guys You're welcome thank you\n[noise] or the energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for ... shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold Exxon Mobil liable for helping to create climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\nTom ... who is the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to write down the value of its fossil fuel assets that are still in the ground\nTwo sets of books one internally that they were um keeping so that they understood what reality was and another more nuanced reality if you will for the investment public\nThe allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations or a product of closed door lobbying by special interest political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved toward the investigation by attorneys general and three states alleging it's a conspiracy involving the Rockefeller Foundation tort lawyers environmentalist said democratic gay jeeze\nMichael Berger is a professor at Columbia Law school who specializes in climate change law\nBurger doubts axons conspiracy theories are going to hold up in\nCourt this is\nAbout climate change it's about the risks that regulation hoses to the fossil fuel industry over the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\n\n\nThis is NPR News usually\nWe're listening to the highly amplified sounds of relief harbor one of the family and then second past ... rice locks on them\nWe're listening to the highly amplified sounds to belief Arbor sort of a family of insect pest which of rapid rice crops all over the world I'm Jim ... and this is the pulse of the planet [noise] China farmers have found\nA way to control the brown plan topper without the use of pesticides the Chinese\nAre really master maybe leaders of beneficial organisms including insects they'd been at this practice for about two thousand years because they've never had the economic base to introduce modern pesticides in a massive amount so they've had to rely on their ability to manipulate the biological world Sheila\n... is executive director of the bio integral resource center\nWell in second China the brown plant hopper exists but it's not considered a major past\nAnd the reason for that is that the Chinese farmers have figured out how to utilize spiders to control the ground than topics they use many techniques at one of the most common is before the rice patties are flooded or planted\nThey replace bundles of rice either in t._v. like shapes or as rafts and just lay bundles right down on the ground\nAnd then if they let the water in spiders all run into these bundles and then the farmers weighed in and pick up the bundled them over to the sides of the patties with her out of the return the water and the spiders remain and he's been they reproduce and then just hide in those bundles when the water is let out of the Patty or when cultivation beneath [noise]\nAnd they will bring the rice on the back in and spiders race out of the bundled and move around looking for past insects to consume and so any brown plant hoppers that are there and that new crop of riser consumed by the spiders and therefore they never become\nThis archival program as part of our thirtieth anniversary celebrations you want to hear more check out our podcast\nNothing comes close to a public radio\nYou're doing it every day to W. V. by NPR for honest and fair journalism programs like MORNING EDITION all things considered classical music and mixed back\nWhere else can you find this program to help us keep deserve a strong you care about independent journalism and intelligence entertainment so consider being its job you make a gift you WB I go to W. V. I. nine or ... or call what seven seven seven zero zero\nNinety four to five [noise]\nSupport for NPR comes from the station\nAnd from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at ... dot org\n[noise] from the Pew Charitable trusts marking Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\n[noise] and from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King in Nineteen forty five an American leader met a king from Saudi Arabia here's a newsreel report from that time [noise]\nAmerican destroyer comes along side of the cruise around rates that are like the Suez Canal and each\nAfraid even out\nOf the five million people of Saudi Arabia to a conference with President\nThat was the first time the Saudi monarch had left his home country now Seventy three years later the relationship between the U.S and Saudi Arabia is challenged by the killing of journalists Jim all cause show gee at the Saudi consulate in Istanbul a lot of our listeners had questions about our relationship with Saudi Arabia here Steve Inskeep\nPut your questions to commentator Cokie Roberts who answers your income\nYou had questions about our relationship with Saudi Arabia here Steve Inskeep\nWe put your questions to commentator Cokie Roberts who answers your inquiries each week about how politics and the government work either Cokie hike see certainly a big question now this relationship works and here's our first question\nThis is Nicola back from Nashville, Tennessee in the U.S Saudi Arabia special relationship really based primarily on an oil arms arrangement or something more to it\nWas not oil for arms is oil and arms\nOf recent years the United states has become much more self sufficient in terms of energy but Saudi Arabia remains a huge producer of oil and more important incredibly influential in the international setting of oil prices\nBut it's also a purchaser as President Trump has repeatedly said\nOf arms made by U.S companies but there's something more and that is mainly Iran the United states is saying Saudi Arabia is a check on Iran both in the region internationally and to the extent that it's alive issues the U.S also thinks that Saudi Arabia could be helpful and then the elusive Israeli Palestinian peace agreement\nThat oil is also on the minds of our next listener\nHello my name is Sean Philip Morris I'm from New Orleans Louisiana how did the U.S view Saudi Arabia before oil was a thing thank you\nBasically there was no view before oil was a thing a lot of the Arabian as we know it was became a country in Nineteen thirty to the very next year and signed an agreement with standard oil California to form aramco the Arabian American oil company which is now owned by the Saudi state\nAnd that happened even before it's clear how oil rich country would be\nThe leader who unified the country and started a relationship with the U.S\nWith Abdul Aziz evens out he had forty five sons Steve and all the king's senses death in Nineteen fifty three of them one of those sons the crown prince Mohammed bin Salman we've been hearing so much about lately would be the first of the next generation if he becomes king\nThe next question is whether us being so close to the Saudis can get them to do anything\nEither does Alex south from Upton, Massachusetts how much influence does the United states have over Saudi Arabia's foreign policy\nWell I'd say the question is more how much the U.S has chosen to exert\nA the biggest case in point at the moment is the civil war in Yemen\nWhere the Saudis have been accused of bombing civilians and closing off access to a humanitarian aid so that now there's an enormous food crisis taking place but because Iran is involved with the facts and the Saudis are fighting the United states has sided with the Saudis\nBut they're staring and Congress which showed up in the last defense bill of trying to protect civilians\nAnd there's talk of sanctioning Saudi Arabia in some way because of the journalist killing us well Cokie thanks as always good to talk to you stay in commentator Cokie Roberts you can ask Cokie your questions about our politics and government work by emailing us at ask Cokie at NPR dot org or tweeting us with the hashtag askcokie [noise]\nI'm such a university W to ask you any point on FM ceilings grow we have a translator in Allentown Ninety nine point three you're actually formation stations listener supported public radio W. B. I\n\n\n\nSuffer damage to so called me a call\nStill got some Democrats for civility came after the Democratic leader I knew I'm\nDavid Greene Alaska former FBI for so I'll be investigation\nLater when we last or evangelical voters running away from\nThe Saudi crown prince amid allegations are over the killing of a journalist for morning\nIt's there for over twenty first birthday party I remember one year old from your office you're crazy\nYou're\nLine from NPR News in Washington on corporate cooling President Trump says the federal government is investigating the seven fishes packages sent this week to democratic leaders billionaire philanthropist George Soros and the New York offices of CNN\nSo the federal government is investigating the seventh suspicious packages sent this week to democratic leaders billionaire philanthropist George Soros and the New York offices of CNN Trump without a campaign rally in Wisconsin last night he says politicians need to start comparing opponents to historical villains\nThere's much we can do to bring our nation's again\nFor example those engaged in the political arena\nMust stop treating political opponents as be morally defect\nLast week Trump praised the Montana Congress men who attacked journalists last year as his guy\nIn last night's remark Trump insisted the media must set a civil tone stop endless hostility and quote fault attacks and stories\nOne of the pipe bomb packages was addressed a former CIA director John Brennan although it was delivered to CNN Brennan did not work for the news outlet he has frequently criticized the president for offensive language and decisions he thinks hurt the United states if\nI and others are being targeted because we're speaking out and we're living up to a a responsibilities as citizens I think that again as a very unfortunate turn of events\nLaw enforcement officials say the pipe bomb packages have all been sent to an FBI Laboratory for analysis Canadian Prime minister Justin Trudeau is looking at ways to cancel a multibillion dollar arms deal with Saudi Arabia is following the death of Saudi journalist Jamal could show James Dan carbon check has more\nCanada has a Fifteen billion dollar deal to sell light armored vehicles to Saudi Arabia Trudeau says his government is looking for ways to get out of the contract without paying penalties one possibility is for auto to suspend export permits something it is done in the past ...\nCome in Toronto\nThe joint typhoon warnings ... says one of the year's most powerful psych alone has passed over the Marianna island a U.S territory and the Pacific ocean super typhoon YouTube top sustained wind are one hundred sixty six miles per hour the equivalent of a category five hurricane\nAway Public Radio's Bill Dorman reports that super typhoon has caused significant damage\nSuper typhoon YouTube tore through the islands of ... ... pound with maximum sustained winds of one hundred eighty miles an hour they're part of the commonwealth of the northern Mary on the islands\nLets us territory about thirty eight hundred miles west of Hawaii wins ripped roofs off houses and blown out windows trees and power lines are reported down around the archipelago\nAs the storm moves west flooding is expected to continue it may also affect Guam NASA's calling super typhoon due to the most intense storm to ever struck the islands for NPR News I'm Bill dormant in one ... you're listening to NPR\nMost stock markets in Asia where sharply lower today Japan's main index fell more than three and a half percent Hong Kong's market was down more than one percent these followed steep losses Wednesday on Wall street the Dow Jones industrial average lost more than two percent\nThe Dow has now lost all the gains that has made in twenty Eighteen\nTexas state ExxonMobil has been sued by New York's attorney general alleging the energy giant defrauded shareholders by mid stating the risk of greenhouse gas emissions to the company from Dallas NPR's Wade Goodwyn reports\nLegal action is the result of a four year investigation by attorneys general first or New York and then other stage there whether Exxon Mobil engaged in a long running fraudulent ski what was the village scream essentially the companies claim that the cost of combating carbon emissions would be\nFraudulent scheme what was the village game\nEssentially the company claim that the cost of combating carbon emissions would be so high that no meaningful government restrictions coon or would ever be implemented therefore investors didn't have anything to worry about and the company could pull as much oil out of the ground as it could procure\nExxon called the legal action against the ... list a tainted blaming Al Gore Democrats and environmental is Wade Goodwyn NPR News Dallas\nThe national weather service says the first nor'easter and the seeds and we'll develop this weekend frontal systems are absorbing the remnants of hurricane Willa and will spread thunder storms across much of the southern east coast by tomorrow at the store moved into New England forecasters are predicting wintry precipitation along the coast\nI'm more of a cooling envy or news\nSupport for NPR comes from NPR stations other contributors include Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answers Charles Schwab own your tomorrow learn more ... dot com and the ... foundation\n[noise] taking a look now at the forecast will see mostly sunny skies today with ties in the upper forties it'd be mostly clear this evening and becoming partly cloudy overnight with Lowes around thirty\nFriday looks partly sunny in the morning then becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in the mid thirties or chance of rain and Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties\nThis is W. V. a a ...\nLike\nWhat you see on WB IRA you enjoy find programs like pull dark nova or nature the your kids love watching the antics of Elmo on Sesame Street enjoy sit in the science acute are curious George how 'bout shows like call the doctor Pennsylvania Florida or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs at W. V. I. A. dot org and thank you for your support for W.\nVi\nProgramming on W. V. I. is made possible by our members and by Pennsylvania College of technology thinking about college hoping to land a great job after earning your degree think Pennsylvania College of technology\nWith one hundred plus bachelor an associate's degrees and exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work\nIt's MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm working in Washington DC good morning President Trump called for political unity at his rally in Wisconsin last night\nWe have to come together and send one very clear strong unmistakable message that acts or threats of political violence of any kind of no place in the United states of America\nHe was speaking after packages containing what are described as pipe bombs were sent to senior democratic leaders including former president Brock Obama and former secretary of State Hillary Clinton\nCNN's office in New York also got one of these packages and two days earlier an explosive device was found at the home of billionaire philanthropist George Soros now it's worth noting these individuals and CNN have all been critical of the Trump Administration\nThis incident is now in the hands of federal investigators including the FBI and to understand what they're going to be looking for we're doing is winning by former FBI deputy director John Pistole going sir\nGood morning Noel All right so we have a situation involving live explosive devices\nFormer CIA deputy director John Pistole going sir\nGood morning Noel All right so we have a situation involving lied explosive devices apparently intended to do harm what are the FBI and other federal investigators trying to determine the states\nWill surely the key is trying to ... obviously ... by the perpetrator or the the individuals who are responsible for male and the devices\nAnd they're really looking at it from a two perspectives one is the forensics that is involved in each of the devices and the fact that there are multiple devices is actually very helpful to the investigators because they can compare and contrast and and just get a a richer picture if you will\nFor adults on election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR it's political team will be live all night watching the close races around the country listen on election night the wake up and hear what the outcome means for America on MORNING edition\nCritical election the central coverage NPR News [noise]\nWhat the outcome means for America on MORNING edition\nCritical elections that central coverage NPR News [noise]\n\n[noise] nothing comes close to public radio you tune in every day to W. V. I. S. M. and NPR for honest and their journalism programs like MORNING EDITION all things considered classical music\nMixed bag where else do you find such programming help us keep the service strong you care about independent journalism an intelligent entertainment still consider being it's ...\nMake a gifted ... today and good at ... dot org recall one eight seven seven seven hundred and nine eight for two thanks\nProgramming on WB I is made possible by our members and by the University of Scranton to understand all that ... visit the campus experience the community was an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\n[noise] taking a look now at the forecast will see mostly sunny skies today with highs and the upper forties\nIt'd be mostly clearer this evening I'm becoming partly cloudy overnight with Lowes around thirty\nFriday looks partly sunny in the morning then becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in the mid\nThirties or chance of rain uh Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties [noise] this is W. V. A. F. Pham\nSupport for NPR comes from the station and from logged me in makers of go to meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on any device learned more it go to meeting dot com\n[noise] from the S P certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement and state planning in the client's best interest let's make a plan dot org\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane now will widely Christina Hendricks and Andrew rentals and new episode every Friday on prime video\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King markets in Asia where mostly down overnight after a bad day on Wall street yesterday the Dow fell more than six hundred points\nToday Japan's Nikkei index fell more than four percent the hang saying index in Hong Kong flipped by a full percentage point but the Shanghai stock exchange was stable and this is unusual because China's stock market has fallen by thirty percent since January\nAnd its currency has fallen to its lowest level against the dollar in nearly two years NPR's Rob Schmitz is with us from Shanghai good morning Rob good morning while I was thirty percent drop for ... stock market sounds pretty darn bad what's going on\n[noise] well just kind of me has been lagging for the last few years the government's dealing with a lot of problems you've got public debt Sparling out of control you've got a fairly significant property bubble\nAnd through all of this Beijing's making painful changes in how China's economy runs moving from an economy based on building things to one based on buying things and the downturn in China stock market this year reflects that\nBut it important to remember here that when China stock market drops by thirty percent like this year it isn't going to have\nAs big an impact on the economy like if the dog the Dow fell by the same percentage and that's because in the U.S much of the country's retirement plans are invested into the stock market but not in China it's still relatively young market and it isn't a great indicator of the overall economy as say the value of China's currency\nAnd let me ask you about China's currency the UN is edited weakest level against the dollar and nearly two years and President Trump says Beijing\nThe overall economy as say the value of China's currency\nAnd let me ask you about China's currency the UN is editor weakest level against the dollar and nearly two years and President Trump says Beijing is keeping its currency low to make exports cheaper which could give China an edge in a trade war is China manipulating its currency\n[noise] well it's interesting hearing well is that China is likely manipulating its currency but it's doing so in the opposite direction of what President Trump is accused China of doing\nYears ago China used to weaken its currency to make experts cheaper but that's not what's happening now what's happening now is that\nThe u._s. dollar is stronger and this is putting pressure on the un to weaken and Beijing has stepped in to try and prevent it from weakening too fast\nChina is doing a China doesn't want its currency to depreciating too quickly because it can lead to inflation and that's the last thing China needs right now so if China should get out of the way and start managing its currency like the UN would likely we can much faster which is what Trump does not want because that could lead to an even bigger trade deficit between the U.S and China\nAre these terrorists that President Trump is imposed on Chinese goods having a a big impact on the economy there\nWell from a communist I'm speaking to it's a little early to tell us tariffs are certainly having a deep psychological impact on the movers and shakers here in China's economy\nIn my conversations with business owners here I keep hearing stories of how companies are making plans to move parts are sometimes all of their supply chains to countries in Southeast Asia to avoid this trade war and that of course does not bode well for China's economic future\nBut it's important to note here that even without the trade war with the U. S. China's economy was already vulnerable from a host of economic problems that are finally coming home to roost\nNPR's Rob Schmitz in Shanghai thanks out ...\nAccording to a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change Silicon Valley has been at work on a solution for years off and promising quick fixes\nBlocks chain the technology behind crypto currency like bitcoin is the latest solution coming for big tech\nMember station KCUR December net has more\nUntil about a year ago hardly anyone in climate science is talking about watching but at the recent global climate action summit and San Francisco it was all over the place there were panels papers people were talking about how he could help mitigate climate change in all sorts\nOf land use agriculture\nHarvests oils frustration\nWith our ... and co chairs the climate change coalition he came to the conferences spread awareness about blocking so what is it\nA chain or distributed electric technology really references a larger system of technology [noise]\nOkay [noise] think of it like the ... is like an accounting book everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank\nBut it said on the computers of everyone on the block chain transparency is its main advantage tons of new companies are springing up saying that they will use the transparency block Jane to solve all sorts of problems everything from curing cancer to ending human trafficking and now even climate change\nIts it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world patriots he's the CEO of a new Silicon Valley company called ...\nNoriega block chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credits distance the total number of carbon possible to admit is kept and then companies can buy carbon credits that let the amendment more economists\nCarbon credits at the\nTotal number of carbon possible to admit is kept and then companies can buy carbon credits that let the amendment more economists\nLove this market based solution but there's a problem when it comes to counting the carbon carbon markets in the past when like issues of fraud and counting nobody wants to use block chain to verify the accounting end to go one step further to create a market for people taking carbon out of the environment\nThat company has been launched yet but that isn't limiting the ambition of the sales pitch you want to make this whole climate change problem just go away so do you cite just like Douglass McCauley yeah I Wish it was ...\n... a researcher at UC Santa Barbara you said the danger of Silicon Valley is big promise disrupt everything eat those is that it suggests there's a quick and easy solution the thing is that climate change are going to be really hard like getting countries to cut emissions or people to stop driving cars the pollute\nThe call I said before it was blocked Jane artificial intelligence in big data were the hot new thing\nI think is a proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the ... thing I start talking about exactly how to apply a usefully\nSays locking could help with things like counting carbon credits or keeping track of say how many trees the company has planting to suck carbon out of the air Katherine mock a climate scientist at Stanford agreed but she says it's dangerous to believe block Jane will be some kind of a miracle cure\nIt's essentially can kicking ethics where we won't be putting into place the solutions that are actually more important to make the party that problem something that's ...\nWith a clock ticking on climate change and ... there's no time to waste sorting facts from hike\nFor NPR News I'm Sam or [noise]\nThis is NPR News\nGot an older car that's not running so well then it's gonna be expensive to repair donated to support W DIA leave until it away and you get a tax deductible receipt details the w._b. I ate out or slash cars or call it for for WBAI car\nI'd like to take on gerrymandering in Michigan if you're interested in doing\nThat says well please let me know smiley face\nThat's Katie Faye he the organizer of voters not politicians she have put up a similar post ... years ago and nobody even liked it but this time people were clicking the like button and they actually wanted to health\nAnd then out here is where we have our printer on a fancy printers that our campaign has\nBegun showing off voters not politicians new field office the redistricting initiative she launched had amassed hundreds of volunteers and raised more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names tape to the bottom so that they can get their chairs and tables back\nI'm hoping to find a coffee maker that can be donated [laughter] um but some food and stuff like that and\nRight now lawmakers in power get together and draw district lines of forgetting them approved by the governor Michael ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten far more votes overall\nThe redistricting proposal would create a commission made up of four Republicans four Democrats and five independence\nA majority that includes a mix of all three would have to agree on the map but the opposition calls the proposal an expensive way to change your system that already works when delete harbor is a Republican and has worked for for secretary of state she says this whole thing it's skewed to help\nDemocrats a gimmick and bypasses are elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government Bernie porn is president of ethics MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head and twenty sixteen\nPeople were dissatisfied flu thinks that the government the federal level is really looking for members of Congress should their donors and corporations and they're left over the coals\nPulls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal\nWhy should the parts in an office get to this\nPlans to vote in November and she's leaning in favor of the proposal one\nWhy should that person off it get to decide like we'll get to vote in that area when I have a right to choose in and it just makes me wonder well how much right to do we really have\nEven if the redistricting measure passes that's not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Sheena wrong in Lansing, Michigan [noise]\n\nThis is NPR News support for WB I come from the economic ... presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin I'm Kirby center on Saturday October twenty seventh at five PM\nIn his Dante Symphony front list takes sits on a trip from the inferno debt to the heavenly gates this week with the Chicago Symphony orchestra because dilute he conducts rarely heard score in all its fire and fury\nPlus music by Beethoven and ... this week with the CFL [noise]\nSunday at ten pm on W. V. all of a\nSupport really comes from the Lackawanna county library system presenting colds and watch it 'til surprised when the author of the underground railroad Thursday November fifty seven PM at this current and cultural center open to the public tickets available at any Lackawanna county library or online at L. C. L. S. home dot org\n[noise] Ninety second national [noise]\n\nHi there I'm saying Maynard a parasitic fungus known to manipulate the brains of ants doesn't make slave like zombies out of any old host instead the microorganism it somehow able to recognize the brains of different ant species and releases his mind controlling chemical cocktail only when in its preferred hopes\nBehavioral manipulation is such a complex characteristic that only occurs when there is a very close co evolution between pathogen and host\nFungi the genus ... so called zombie ants fungi need answers to complete their life cycle when an ant comes across fungal spores while forging the fungus infect the insect in quickly spread throughout his body\nFungal salesmen and hid released chemicals that hijacked the insects central nervous system\nThe fungus forces the aunt to climb up vegetation clamp down onto a leaf are twigs for killing his hapless drone interestingly scientists have discovered that the fungi produces specific chemical cocktail for a specific Arabs Fiji to justify it knows the brains of its target host and react accordingly\nNinety second naturalist is a production of Cincinnati Public radio and the Cincinnati view\nWith support from Cincinnati Public radio member to print the good news at the natural world [noise]\nSupport for NPR comes from this station and from the University of Florida we're solving for next it's powered by its land grant heritage from renewable energy to global health us students and researchers are working to solve challenges at next dot U. F. L. dot edu\nAnd from campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template a drag and drop email editor and twenty four seven customer service\nBy more than two hundred thousand customers worldwide with email template dragging drop email editor and twenty four seven customer service more ad campaign monitored dot com It's MORNING EDITION from NPR News I'm new at king\nAnd I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday paying tens of thousands of dollars to the families of top flight basketball recruits one of the convicted James gods who worked for Adidas\nAnd steered certain students to Adidas sponsored colleges schools with storied basketball programs such as University of Kansas and move or among them\n... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nAnd joining us to talk about this case and what the NC double a or you can do to clean up corruption college athletics is Washington Post sports columnist Kevin Blackistone also familiar voice on our program either Kevin hey how're you doing I'm good thank you so what does this mean for college basketball the whole what happened yesterday\nYou know I'm not sure it means anything for college basketball I'm a ... in in total because what happened here it was a pretty isolated incident\nUm but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball for as long as I can remember\nAnd that is basically they're channeling of money from a one source um to the families of talent\nUm to ensure that that talent goes to a particular school and what has happened over the years is that the uh manufacturers of of basketball shoes\nA date is a Nike or those those are operations\nHave gotten people in the middle of them um to help transfer that money so the the surprise here is that it has been criminal lives or by the federal government\nAs opposed to be policed by uh the NC double A. as it's been done for years and it used to be that the worst thing that would happen in this situation is that a someone would be banned from the NC double a a coach who was who was caught um funneling money or or some middle man\nNow actually go out there which is which is a step\nAbsolutely now you could possibly go behind bars which is\nUh what these are these three men are facing\nWell you have these three men say thing that you say um but\nI Want to your colleague at the Washington Post Sally Jenkins ruined recently that the real defended here should be a university but the universities are actually considered victims and all of this do you see the same way that she does\nI I don't see it that way but that was the way that the federal government decided to get involved in this basically they said that the euro universes were being defrauded 'em by this system\nA because by funneling this money um two players are are players families um these people knew that they were making these players in eligible under NC double a rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the universities that he'd given them scholarships and therefore they had to fraud at the universities\nOf um of of value which\nIs a ... a very strange thing to me because I still don't know uh how that's fraud I mean universities or a University of basketball programs\nIn football programs are still going to get a these talented players under they're very um a low level of remuneration\nThese two players\nUnder very athletic it brings them ... million dollars in revenue every year\nSupport for WB I come from the FM Kirby said presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robbins at the FM Kirby center on Saturday October twenty seventh at five ...\nThis was W. V. I. eighty nine point nine of him W. V. I. H. D. one scratching Wilkes Barre Hazelden\nB. Y. eighty nine point seven five and Williamsport WTO eighty eight points ... Mansfield WPRI you would not be one point five FM Palmyra township ... how to universities W to ask you a point not enough MC humans grow\nWe have a translator in Clark someone at Ninety point three were your arts and information station listener supported public radio W. V. I. S.\n\nGood morning who said pipe bombs to prominent figures three we're central locations in New York I'm more suspicious package was discovered this morning we'll begin your governor Andrew Cuomo MORNING EDITION from [noise]\nTimes we have to unify those are the words of President Trump has the bomb scare unfolded later at a rally in Wisconsin He again took aim at the new ...\nAnd I'm Noel King also this hour New York's attorney general is suing Exxon Mobil claiming the oil giant misled investors about the costs by Mitt change and it's super typhoon swept across the northern Marianna islands to devastating effect\nWill take you to manila for the latest news Thursday October twenty fifth\nHappy birthday to sing or Katy Perry thirty four years old today and the news is next\nLive from NPR News in Washington on corporate Coleman since Monday at least seven suspicious packages containing pipe bombs had been sent to several democratic figures and to CNN bureau in New York and beers Emily Sullivan reports packages were\nAddressed to big time democratic donor George Soros us representative Maxine Waters former attorney general Eric Holder and former CIA director John Brennan care of CNN [noise] they were also sent to former secretary of State Hillary Clinton and former president Brock Obama\nThe packages were similar in appearance and all had a return address of the office of us are preventative Debbie Wasserman Schultz the former Democratic National Committee chairwoman the FBI said it's possible more packages were mailed to other locations\nThe agency is testing the packages in Quantico, Virginia laboratory and called it an investigation of the highest priority\nEmily Sullivan NPR News Washington\nMeanwhile the New York city police department confirms to NPR that a new suspicious package has been discovered in lower Manhattan it's now under investigation\nStock markets in Asia clothes mostly lower today NPR's Rob Schmitz reports from Shanghai they followed a bad day on Wall street Wednesday when the Dow Jones industrial tumbled more than six hundred points\nJapan's Nikkei index fell nearly four percent and Hong Kong's hung song index drop two percentage points led by declines in semi conductor makers and other tech chairs\nThe composite ended the day up slightly despite being down thirty percent from beginning of the year ... market has weighed in Asia for some time as trade tensions between the U.S and China\nRise NPR's Rob Schmitz in Shanghai health officials in New Jersey are working to contain of viral outbreak that's claimed the lives of seven children from member station WNYC Rachel holiday Smith reports Eighteen cases of the virus have been confirmed\nMedical officials say the ... virus is not much of a risk for healthy people as it might only bring on a cough or paint guy\nBut for pediatric patients at the ... Center for nursing and rehabilitation the virus has proven deadly the facility provides long term care to chronically ill and disabled children New Jersey's health commissioner Dr Sharif el in the hall says his agency is working closely with the facility that specializes in treating fragile patients\nSad reality is there aren't that many ... that are able to care for\n... says the health department will be onsite until the outbreak ends for NPR News I'm Rachel holiday Smith\nThe joint typhoon warning center said super typhoon you too has crossed over the Mariano islands a U.S territory in the Pacific ocean it's current top sustained Windsor one hundred sixty six miles per hour although there were reports the winds were much stronger when they passed over the islands\nReports say there is catastrophic damage although there are no reports of deaths or injuries storm is now moving toward Japan\n[noise] this is NPR thousands of\n... damage although there are no reports of deaths or injuries storm is now moving toward Japan\n[noise] this is NPR\nThousands of Central American migrants arresting in southern Mexico and many of them plan to resume walking today toward the southern border of the U.S\nPresident Trump has vowed to close the border against them some migrants have applied for asylum in Mexico it's believed a few hundred others have accepted Mexican Government offers to return them home by month's\nBoston is taken game to the world series at home in Fenway Park the red Sox defeated the Los Angeles Dodgers forwarded to from member station W. B. U. R. Shira Springer says Boston hold at two games to none lead\nThe gains big hit was a single to right field by the red Sox JD Martinez they hit with the home team ahead for good and because it came with two outs in the fifth inning and kept a three run rally Martinez said at showcase the red Sox relentless softens\nWe preach about should previews ambitious signing your banjo finding these guys on and just keeping the London\nMeanwhile on the mound Red Sox started David Price got the when he granted his way out of the bases loaded jammed and the fourth and pitch six solid innings allowing only to run on three hits game three takes place friday at Dodger Stadium in Los Angeles for NPR News I'm Sheera Springer in Boston\nThe Cleveland Orchestra fire to musicians after an investigation said the men committed sexual misconduct against female colleagues and some students one of those dismissed is the concert master William provable he held a position for more than Twenty years in a statement the executive director of the Cleveland Orchestra apologized\nTo victims I'm corporate Coleman NPR News\nSupport for NPR comes from the NPR stations other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future are available where books are sold\n[noise] taking a look now at the forecast will see mostly sunny skies today with highs and the upper forties it'd be mostly clear this evening I'm becoming partly cloudy overnight with Lowes around thirty\nFriday looks partly sunny in the morning that'd be coming mostly cloudy in the afternoon with high and low or fifties rain is likely on friday night with Lowes in the mid thirties or chance of rain uh Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties this is W. V.\nA. F. M. support for NPR come from Pennsylvania wads October's PA wind month celebrating Pennsylvania's locally grown and crafted watch with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\nBubble easy I asked him and NPR are like nothing else balanced fact based journalism and intelligent enjoyable entertainment and it's all made possible\nBy listeners like you your contribution pays for programs like MORNING EDITION all things considered and the Ted radio hour community outreach like kids in the classroom and the great American read nothing has loves to public radio or W the IRA with a generous gift visit W.\nV. I. A. dot org hold one eight seven seven seven hundred nine eight for two\nWBAI thanks to many regional business leaders support or non profit public service mission\nTo learn how your business can sponsor NPR News and other favorite programming please call five seven zero six zero to eleven thirty seven [noise] like\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mocks\nI'm Noel King in Washington DC and I'm David Greene in Culver City California President Trump's political career is in part defined by his willingness to openly mocked people he disagrees with\nHey very dishonest version crooked Hillary Clinton said I don't get paid by sorrows or somebody\nI have no confidence in a guy like bread and I think is a total loss of life remember\nWhat President Obama said you can't have manufacturing jobs they don't know what's going on\nWhen you listen to Eric Holder talking about kicking Mack say low IQ individual\nNow though he is calling for civility after at least seven apparent pipe bombs were mailed to his political opponents at a rally in Wisconsin last night President Trump condemned these incidents\nThe full weight of our government is being deployed to conduct this investigation and bring those responsible for these despicable acts to justice we will spare no resources are expense in this effort\nAnd speaking yesterday at a campaign event in Florida former secretary of State Hillary Clinton said much the same thing is it time a\nDeep divisions\nAnd we have to do everything we can to bring our country to gather\nOkay so what we know at this point suspicious packages were sent to at least three destinations in New York including the offices of Hillary Clinton also the home of billionaire philanthropist George Soros one addressed the John Brennan the former CIA director under President Obama ended up at CNN New York offices\nSupport for WB I come from the FM Kirby said presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin I'm Kirby center on Saturday October twenty seventh at five ... [noise]\nHere at W. ... hey we often feature recordings by the ... the U.S chamber orchestra one of the world's foremost chamber orchestra your them\nLive in concert Saturday November third at seven thirty PM at the Y. center at ... University in St Louis for their program is titled stars aligned joining the orchestra for this conflict will be two innovative artists not he has to send you to the rule the accordion\nAnd Israel's Avi Avi tall mandolin who are reinventing these time honored instruments\nThe program features a double concerto by ball and concert music by film composers including me no real law for more information go to Bucknell dot edu slash wives center\nW. V. I. A. celebrate hundreds of regional art and cultural organizations for details on many more events check the W. V. I. A. art scene calendar and catch up on art scene podcast W. V. I. A. dot org slash our [noise]\nTaking a look now at the forecast will see mostly sunny skies today with eyes in the upper forties it'd be mostly clear this evening becoming partly cloudy overnight with Lowes around thirty friday looks partly sunny in the morning but becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in the mid\nThirties or chance of rain is Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties business W. V. a a family\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff is a new series from the creator of Mad Men starring Diane Lane no ally ally Christina Hendrickson to Andrew Reynolds and new episode every Friday on prime video\nFrom his Cox insurance providing customized insurance for small and medium businesses so they can do more and being more learn more at H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encouraged courage\nAnd from sobering featuring the all new three row it sent with feeding for up to eight at a choice of second wrote captain's chairs love it's what makes us Subaru was Subaru learn more at Subaru dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning some of the most troubled parts of this country our rural areas and in those places disdain for government typically runs pretty high\nBut this summer NPR along with the Robert Wood Johnson Foundation and the Harvard th Chan School of public health surveyed abroad group of rural Americans and that poll turned up some surprises about how many rural people want government help Frank Morris of member station K. C. U. R. has the story\nAmerica can sometimes feel like a country apart thirty two years ago Ronald Reagan summed it up with this clip I've always felt the\nRural America can sometimes feel like a country apart thirty two years ago Ronald Reagan summed it up with this clip\nI've always felt the nine most terrifying words in the English language are I'm from the government and I'm here to help\nRural Americans since come across some even scarier words like opioid epidemic\nSo ... what you have a very serious problems particularly around the economy and opioid drug abuse that really work people\nAnd Robert Blendon at Harvard's th Chan School of public health center of Thirteen hundred route adults surveyed by NPR fifty eight percent said their towns need outside help\nI think that's a surprise for a lot of people that there is a willingness by most NATO to reach out for outside help\nTake the little town of bill in central Missouri there's a big struggle going on in a small town right now\nGabby Stanfield feisty compact woman pushing Seventy looks up from the front porch of the town of Fifteen hundred corralled by green rolling hills and farm fields and split by opposing views of outside involvement\nPeople wanting it to grow and wanting it to be the best they can be [noise] and people that would prefer that everyone back off and let them do what they want\nIt's pressing here because this town is struggling with the same issues plugging much of rural America\nMoney you don't have a tax base anymore that you used to have the shoe factory\nIn bill a big employer and many local shops closed decades ago\nCareer options are scares some petty crimes go unpunished and like much of rural America drug abuse is widespread\nEven though we're we're all on the idea that we're safe isn't really there anymore\nRock seat Murphy covers bill for the Mary Kennedy advocate newspaper\nThere's no way that that community will be able to fix that drug problem by themselves in order to do that they would need more money and more resources that they don't have\nThat it's not like bills getting up and that's another thing that popped out and NPR's rural poll Robert Blendon says fully half of those surveyed say their community problems can be solved within five years\nIt is not all a world of hope was that many of those are the scribe here's a great deal of the optimism that we can deal with issues if we can get outside help\n... says that those looking for outside help three out of five expected to come from government\nEspecially state government [noise]\nProblem is state money is getting harder to come inside\nThe raw dialing male relatives\nKathy ... standing on a grassy right of way cutting straight through ten where she says the state's once promised to build a major prostate\nLike the people that wanted to travel to go through\nBecause see so many possibilities for this town growing by having people from out of the city coming in here and spending their money here and foul and now\nWith basic I can tell us no it's it's a big disappointment it really is\nDoes spent quite a bit into paying public school salaries providing grants that\nMostly cover things like new sidewalks drainage project hopefully any water tower the buck Showalter city hall says the city is often turned down\nBecause it's so competitive a lot of communities a lot of places need help [noise]\nSometimes it's pretty slim\nJonathan ... a lot of the center for rural affairs says state budget cuts are taking a heavy toll on small towns that depend on government funding more than the residents ten\nAt the center for rural affairs says steep budget cuts are taking a heavy toll on small towns that depend on government funding more than their residents tend to realize and he says that with state funding drying up appreciation for it maybe grow\nThis is symptomatic of a country that is reevaluated itself and reevaluate its decisions and realizing the importance of says it gets a structured and the importance of being part of a community and part of the state or federal police at the same direction I think this could be a positive sign\nA lot of sense that it's real hostility towards government isn't that you think the optimism that many rural residents feel about solving persistent drug in economic problems maybe justify for NPR News I'm Frank Morris in jail Missouri\nA super typhoon name you to blasted across the U.S commonwealth of northern Mary on the island today devastating winds tore off roofs level small building now there has been no reports\nOf deaths on the Pacific island chain for the national weather service called due to the strongest storm to hit any part of the United states this year we have more now from NPR's Julie McCarthy in the villa\nResidents described the wins how all over the northern Mariano as far as\nLike [noise]\nThree became you know would you choose when sustaining\nA hundred miles from our according to sound like reading [noise] that's well in excess of any hurricane that just struck the United states this year\n[noise] or wherever they why\nThat is a meteorologist Michael's yo bro with the national weather service you chew is being compared to typhoon man coup that range to the Philippines last month\nThe elbow says the intensity of you chew it was so great\nThat the when the instruments gave out along with Guam that Mary on his other western those the territory of the United states with a population of fifty four thousand that Mary on his lie about sixteen hundred miles east of the Philippines\nUnder grey skies residents of the typhoon torn island can be seen on social media today sitting through what is left of their homes searching for their belongings the storms I crossed directly over a teeny an island\nAnd scrape sigh panned the largest in the chain of fourteen volcanic island the mayor of Kenny and Joey Patrick's on Nicholas assess the damage\nBut we're still without power um ... without water you know like you have your is actually a [noise] 'cause it would be a whole\nGeneration some residents expected outages to last week the mayor said the power plant has been compromised and the distribution system\nCompletely destroyed you in the course of your news manila [noise]\nThis is NPR News\nMembership support the neighbors are we better understand the world through weren't winning NPR New [noise]\nIf the person isn't saying anything directly about the people who were targeted have any of them said anything\nYeah that's right he didn't say any of the names of the people who've been targeted often they're features of his rally at a Hillary Clinton was speaking yesterday at an event and she said that she is fine thanks to the secret service she called it a troubling time\nOf deep divisions in the country\nAnd parents Temer Keith and Ryan Lucas thanks you guys\nYou're welcome at you and rule of course we following this story throughout the morning among\nOr the energy giant Exxon Mobil is accused of misleading investors and shareholders an analyst about the cost of climate change to the company's bottom line New York's attorney general Barbara Underwood is suing the company for ... shareholders and NPR's Wade Goodwyn has the story\nThe lawsuit doesn't hold ExxonMobil liable for helping to create a climate change it accuses the energy giant of misleading the investing public about how global warming was affecting the value of the company's fossil fuel assets around the world\nWhat the attorney general is essentially saying as you kept two sets of books\nTom ... who is the director of finance for the Institute for energy economics and financial analysis and former New York state comptroller ... says the allegations are about Exxon refusing to ride down the value of its fossil fuel assets that are still in the ground\nSets of books one internally that they were um keeping so that they understood what reality was another more nuanced reality if you will for the investment of what the allegation really is that the company is not as big as it says it is and this law\nWatched reality if you will for the investment public the allegation really is that the company is not as big as it says it is and it's not worth as much as it says it is\nExxon declined to comment to NPR but released a statement that said in part\nThese baseless allegations or a product of closed door lobbying by special interest political opportunism and the attorney general's inability to admit that a three year investigation has uncovered no wrongdoing\nExxon Mobil is moved toward the investigation by attorneys general in three states alleging it's a conspiracy involving the Rockefeller Foundation tort lawyers environmentalist said democratic gay jeeze\nMichael Berger is a professor at Columbia Law school who specializes a climate change law\nBurger doubts axons conspiracy theories are going to hold up in\nCourt this is about climate change it's about the risks that regulation hoses to the fossil fuel industry\nOver the next half century or more but this particular complaint is about corporate fraud\nAt the end of Wednesday's trading on Wall street shares of Exxon Mobil were down about three percent Wade Goodwyn NPR News Dallas [noise]\n[noise]\n\n\nThis is NPR News support comes from done more drug store your environmentally friendly pharmacy they recycled Ninety percent of all their plastic containers and they're now using biodegradable prescription bottles proudly serving the community since two thousand three on Blakely street and done more five shouldn't zero three four to eight four to seven years of programs from our our\nWe're listening to the highly amplified sound civil leaf hopper one of the family and then second past which have rabbits rice crops all over the\nI'm Jim ... and this is the pulse of the rent [noise] farmers have found a way to control the ground playing ... without the use of pesticides\nOr Chinese or really massive Canadians as beneficial organisms including insects\nThey'd been at this practice for about two thousand years because they've never had the economic base to introduce my in pesticides in a massive amount so they've had to rely\nOn their ability to make the biological world Sheila ... is executive director of the bio integral resource center wearing tech and China and the ... exists but it's not considered major past\nAnd the reason for that is that the Chinese farmers they figured out how to utilize spiders to control the band plan topic they use many techniques at one of the most common is before the rice patties are flooded are planted\nThey replaced bundles of rice either in t._v. like shapes or as harass and just lay rentals right down on the ground\nAnd then if they let the water and spiders all ran into the vandals and in the primaries weighed in and pick up the windows and moving them over to the sides of the parents were there and to the water and the spiders remain an event they reproduce and then just hide in his ... when the water is laid out of the Patty or when cultivation is finished\nAnd they were bringing the rice kind of back in and spiders race out of it I Know and move around looking for past insects to consume and say any brand plant hoppers that are there and that new crop of rice spiders and therefore they near the end of\nThis archival program as part of our thirtieth\nThey're in that new crop of rice consumed by the spiders and therefore they never become a pass\nThis archival program as part of our thirtieth anniversary celebrations you want to hear more check out\nOur podcast support for WB I come from the FM ... presenting mystery science theater three thousand points thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin ... FM Kirby center on Saturday October twenty seventh at five\n... support for NPR comes from this station and from the alliance for lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement\nMore at alliance for lifetime income dot org\nAnd from Harvard Business school executive education for executives at any career stage to prepare for new challenges through one of its comprehensive leadership programs learn more at H. B. S. dot Emmy slash executive\nIt's MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King in Nineteen forty five and American leader met a king from Saudi Arabia here's a newsreel report from that time [noise]\nAmerican destroyer comes along side a cruiser and break that are like on the Suez Canal and\nBrave people out\nOf the five million people of Saudi Arabia to a conference was under the rose\nThat was the first time the Saudi monarch had left his home country now Seventy three years later the relationship between the U.S and Saudi Arabia is challenged by the killing of journalists ... at the Saudi consulate in Istanbul a lot of our listeners had questions about our relationship with Saudi Arabia here Steve Inskeep\nWe put your questions to commentator Cokie Roberts who answers your inquiries each week about how politics and the government work either Cokie Hi Steve I'm certainly a big question now this relationship works and here's our first question\nThis is Nicole ... from Nashville, Tennessee in the U.S Saudi Arabia special relationship really based primarily on an oil arms arrangement or something more to it\nWas not oil for arms is oil an arm and\nA recent years the United states has become much more self sufficient in terms of energy but Saudi Arabia remains a huge producer of oil and more important incredibly influential in the international setting of oil prices\nBut it's also purchasers President Trump has repeatedly said\nOf arms made by U.S companies that there's something more and that is mainly Iran the United states is saying Saudi Arabians a check on Iran both in the region internationally and to the extent that it's alive issues us also thinks that Saudi Arabia could be helpful and then the elusive Israeli Palestinian peace agreement\nThat oil is also on the minds of our next listener hello my name is Sean Philip Morris I'm from New Orleans Louisiana how did the U.S view Saudi Arabia before oil was affecting thank you\nBasically there was no view before oil was a thing a lot of the Arabian as we know it was became a country in Nineteen thirty to the very next year and signed an agreement with standard or the California to form aramco the Arabian American oil company which is now owned by the Saudi state\nAnd that happened even before it was clear how oil rich the country would be the leader from a unified the country and started a relationship with the U.S\nWith a dual ... even though he had forty five sons Steve and all the king's since his death in Nineteen fifty three of them one of those sons the crown prince Mohammed bin Salman we've been hearing so much about lately would be the first of the next generation if he becomes king\nThe next question is whether us being so\nMohammed bin Salman we've been hearing so much about lately would be the first of the next generation if he becomes king\nThe next question is whether us being so close to the Saudis can get them to do anything\nEither does Allen sale from Upton, Massachusetts how much influence as the United states have over Saudi Arabia's foreign policy\nWell I'd say the question is more how much the U.S has chosen to exert that the biggest case in point at the moment in the civil war in Yemen\nWhere the Saudis have been accused the bombing civilians and closing off access to a humanitarian aid so that now there's an enormous food crisis taking place but because Iran is involved with the facts and the Saudis are fighting the United states has sided with the Saudis\nThat they're staring in Congress which showed up in the last defense bill of trying to protect spinning and spinning\nAnd there's talk of sanctioning Saudi Arabia in some way because of the journalist killing as well Cokie thanks as always good to talk to you stay in commentator Cokie Roberts you can ask Cokie your questions about our politics from the government work by emailing us at ask Cokie at NPR dot org or tweeting us with the hashtag askcokie [noise]\nOn translators do they do want to age ... nobody to eight nine ... there'll be too there were seven ... Williamsport and do they do have an eight year old wells borough\nBill W PLU Ninety One point five FM Palmyra township such will how to universities W que su eighty eight point of them see them grow and translators nobody to want to ... ... to eight nine ... there'll be too there were seven a Williamsport and W. to seven eight eight oh wells borough listener supported public radio\nProgramming on WB I is made possible by our members and by the box choir of Bethlehem welcoming distinguished American pianist Peter circuit to their annual concert gala his program includes box Goldberg Variations and Mozart sonata in B flat major K. five Seventy ... be minor case five forty\nSaturday November third at four pm central moravian church Bethlehem\nInformation at six one zero eight six six four three eight to or online at ... dot org\n\nGood morning President Trump replace some of his usual attacks on Democrats in so called the big news CNN with a call for civility last night on MORNING EDITION from NPR News\nPresidents still got in some things that Democrats his call for civility came after packages containing pipe bombs were sent to democratic leaders I knew ...\nAnd I'm David Greene Alaska former FBI official how the investigation into packages going to play out\nLater we'll meet a pastor who wants to give evangelical voters turning away from President from home\nAnd the Saudi crown prince amid allegations over the killing of a journalist actively sport in the morning\nIt Thursday October twenty fifth birthday party when Gerald from your office actor Craig Robinson\nThere's been a\nLine from NPR News in Washington encore of a cool I'm In college in New York City are investigating another suspicious package that's been found in lower Manhattan New York state governor Andrew Cuomo told NPR's MORNING EDITION the latest package was discovered at the business address of actor and liberal activist Robert De Niro\nIt is a similar looking package or we don't know yet or if it is the same as the fact that we've seen thus far\nThat appears to be the eighth suspicious package sent this week to several democratic leaders are liberal activist law enforcement ... authorities say those were pipe bombs one was addressed to former CIA director John Brennan but was delivered to the New York offices of CNN\nPresident Trump is tweeting this morning that the anger today in our society is caused by the media he demanded that the media quote clean up its act fast exclamation point he was more subdued on Wednesday at a campaign rally as NPR's Tamara Keith reports\nAt a campaign rally in Wisconsin President Trump's skipped over his usual attacks on Hillary Clinton and congresswoman Maxine Waters instead saying those engaged in politics should stop treating their opponents as being morally defective\nTrump also pointed out that he was maintaining a comment even tone in contrast with is typical rally performance as\nYou know what I'm trying to say that very nicely [noise] she normally I screamed they wanna socialists take over that was once a socialist took over [noise] I'm trying to be nice\nWe're all behaving very well he said it's not clear how long it will last Trump's next rally it's friday with several more in the works before the midterm elections camera Keith NPR News\nProsecutors in Saudi Arabia now say the killing of dissident journalist ... was premeditated it's just the latest story changed by the Saudi Government about ... ...\nAnd now it said the killing of dissident journalist ... gene was premeditated it just the latest story changed by the Saudi Government about ... death an ... NPR's Peter Kenyon reports Turkey's president has spoken with Saudi crown prince Mohammed bin Salman\nTurkey's state news agency quoted president all officials are saying the phone conversation between president ... and the crown prince included a discussion of what step should be taken in the show ... case\nSeparately to Washington Post reports CIA director Gina Haspel heard audio evidence related to show this killing which president air to one this week called the Savage in premeditated murder\nThe journalist was last seen entering the Saturday constantly on October second it took more than two weeks to Riyadh do acknowledge he died in the consulate calling it an accident an explanation aired on dismissed\nAfter a lengthy delay the Saudis granted permission Wednesday for investigators to search will on the consulate grounds Peter Kenyon NPR News ...\nThe national weather service says the east coast may see a nor'easter this weekend a storm system will combined with remnants of hurricane Wilma\nIt's NPR\nThe world famous Cleveland Orchestra his fired two musicians an investigation found that men engaged in multiple instances of sexual harassment against female colleagues and some students from member station WBUR sci fi and Idea Stream in Cleveland Adrian mom reports\nThe firings were announced three months after a Washington Post story brought to light sexual assault allegations involving William crucial for over two decades producer was the orchestras concert master the ensemble leader after the conductor but after the post story came out the orchestra suspended him and hired an outside law firm to investigate\nThat inquiry resulted in another suspension of its lead trombone player must be molded Rosa based on dozens of interviews and documentary evidence investigators concluded the two men engaged in numerous instances of sexual misconduct\nIn a statement the executive director of the orchestra apologize to the victims and announced it would be implementing a new sexual harassment policy and a confidential hotline\nFor NPR News I'm Adrian ... in Cleveland\nThe joint type in warning center said super typhoon YouTube has crashed over the Marianna islands in the Pacific Michael Sullivan reports from Thailand storms top sustained winds were one hundred eighty miles per hour\nThe Murray on his are used to typhoons but this storm site pen resident Glenn hunter told the Associated Press was different\nWe knew it was going to be big he said but while the island opinion was the hardest hit its medical center badly damaged and many of the commonwealth population abruptly fifty five thousand people are hunkered down in shelters waiting for the storm to pass\nMichael Sullivan reporting on core of a ... NPR News from Washington\nSupport for NPR comments from NPR stations other contributors include a log me in makers have go to a meeting a collaborative meeting platform with over Eighteen million monthly users designed to connect people from anywhere in the world on a device learn more at go to meeting dot com\n[noise] taking a look now at the forecast will see mostly sunny skies today with highs and the upper forties it'd be mostly clear this evening and becoming partly cloudy overnight with Lowes around thirty\nFriday looks partly sunny in the morning then becoming mostly cloudy in the afternoon with high and low or fifties rain is likely on friday night with Lowes in the mid thirties or chance of rain uh Seventy percent and that chance of showers increases to eighty percent on Saturday with highs and the upper forties [noise]\nThis is W. V. A. F. M.\nY. center present a Grammy Award winning Marty Stewart and his fabulous superlatives on Thursday November first at seven thirty PM otherwise center tickets available Bucknell dot edu slash box office or five seven zero five\nOn Thursday November first at seven thirty PM otherwise center tickets available Bucknell dot edu slash box office or five seven zero five seven seven one thousand\n[noise]\nDoes he do as your ticket and music your passport but our journey of the imagination to myth legend the mystery and ballads in June ... I Hope you'll come along with me for the ... [noise]\nSaturday evening at age ... found [noise]\nSupporting W VISA PNC wealth management their team of financial professionals is committed to helping you achieve your financial goals for information contact Kathy dumped near five seven oh eight to ... for six three zero\nThis is MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm now working in Washington DC police in New York City are investigating another suspicious package it was found early this morning in Manhattan's try Becca neighborhood New York governor Andrew Cuomo told NPR this morning it was sent to the home of actor Robert De Niro who is a prominent critic of President Trump\nNow that package It's MORNING follows at least seven packages containing would are described as pipe bombs sent to senior democratic leaders yesterday including former president Brock Obama and former secretary of State Hillary Clinton\nCNN's office in New York also got one of these packages and two days earlier and explosive device was founded the home of billionaire philanthropist George Soros\nNow these individual and CNN of all been critical of the Trump administration's\nThis is now in the hands of federal investigators including the FBI so we reached out to form FBI deputy director John Pistole to find out what they'll be looking for going sir\nGood morning Noel\nAll right so we have a situation involving live explosive devices apparently intended to do harm what are the FBI and other federal investigators trying to determine at this stage\nWill surely the key is trying to obviously ... the perpetrator or the the individuals who are responsible for my own devices\nAnd they're really looking at it from a two perspectives one is the forensics that is involved in each of the devices and the fact that there are multiple devices is actually very helpful to the investigators because they can compare and contrast and and just get a a richer picture if you will\nThis week wait wait don't tell me celebrates Twenty years of pointing out how incredibly stupid to the news is on Peter Segal and all I can say is we'll stop when they do join us for an all star celebration was all our panelists at writing all of them\nAnd special again it's big we're that's just one year away from being able to buy the drinks we desperately need after Twenty years of doing that wait wait for men feel [noise] Saturday morning on Sunday evening at seven odd W. V. I. F. Adam [noise]\nWe'll meet again stories from Vietnam\nWomen's rights and escape from Cuba\nYour mother tells you you're going to go on loan\nTo the United states are was really hard to fit that changed the world in my career changed a lot with impossible was now impossible\nAnd people changed each other's law [noise]\nWhat do you want to say I hate him to shape\nTuesday at age ... W veal you a TV\nProgramming on WB I made possible by our members we thank you for your support members\nAnd by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. Pham taking a look now at the forecast will see mostly sunny skies today with ties in the upper forties\nIt'd be mostly clear this evening becoming partly cloudy overnight with Lowes around thirty\nFriday looks partly sunny in the morning that becoming mostly cloudy in the afternoon with high and low or fifties rain as likely on friday night with Lowes in the mid thirties\nOr chance of rain is Seventy percent chance of showers increases to eighty percent on Saturday with highs and the upper forties [noise] this is W. V. a a family\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane Noah Wiley Christina Hendricks into Andrew rentals and new episode every Friday on prime video\nFrom it less than a collaboration software company empowering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at ...\nCommitted to providing the tools and practices to help teams plan track build and work better together more at ... dot com\n[noise] from the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified dot Gov slash go and from the listeners who support That's NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning the u._s. stock market looks ready to recover some of yesterday's\nDramatic losses when Wall Street opens this morning most Asian markets were down overnight the Nikkei hang saying but the Shanghai stock exchange was stable which was unexpected because China stock market has fallen thirty percent since January and\nIts currency is falling to its lowest level against the dollar in nearly two years NPR's Rob Schmitz is with us from Shanghai good morning Rob good morning Noel I saw a thirty percent drop for tainted stock market sounds pretty darn bad what's going on\n[noise] well China's economy has been lagging for the last few years the government's dealing with a lot of problems you've got public debt spiraling out of control you've got a fairly significant property bubble\nAnd through all of this Beijing's making painful changes in how China's economy runs moving from an economy based on building things to one based on buying things and the downturn in China stock market this year reflects that\nBut it's important to remember here that when China stock market dropped by thirty percent like this year it isn't going to have as big an impact on the economy like if the ... the Dow fell by the same percentage and that's because in the U.S much of the country's retirement plans\nAre invested into the stock market but not in China it's still relatively young market and it isn't a great indicator of the overall economy as say the value of China's currency\nAnd let me ask you about China's currency the UN is editor weakest level against the dollar and nearly two years and President Trump says Beijing is keeping its currency low to make exports cheaper which could give China an edge in a trade war is China manipulating its currency\nWell it's interesting hearing well is that China is likely many blending of currency but it's doing so in the opposite direction of what President Trump is accused China of doing\nYears ago China used to weaken its currency to make exports cheaper but that's not what's happening or what's happening now is that the u._s. dollar is stronger and this is putting pressure on the un to weaken and Beijing has stepped in to try and prevent it from weakening too fast\nChina is doing a China doesn't want its currency to depreciating too quickly because it can lead to inflation and that's the last thing China needs right now so if China should get out of the way and stopped managing its currency like the UN would likely we can much faster which is what Trump does not want because that could lead to an even bigger trade deficit between the U.S and China\nAre these terrorists that President Trump is imposed on Chinese goods having a a big impact on the economy there\nWell from a kind of I'm speaking to it's a little early to tell us tariffs are certainly having a deep psychological impact on the movers and shakers here in China's economy\nIn my conversations with business owners here I keep hearing stories of how companies are making plans to move parts are sometimes all of their supply chain to countries in Southeast Asia to avoid this trade war and that of course does not bode well for China's economic future\nBut it's important to note here that even without the trade war with the U. S. China's economy was already vulnerable from a host of economic problems that are finally coming home to roost\nNPR's Rob Schmitz in Shanghai thanks up ...\nTo a un climate report that was released earlier this month the world has only about twelve years to roll back carbon emissions and avoid the worst impacts of climate change Silicon Valley has been at work on a solution for years often promising quick fixes\nSins and avoid the worst impacts of climate change Silicon Valley has been at work on a solution for years often promising quick fixes blocks chain the technology behind crypto currency like bitcoin is the latest solution coming for big tech member station KCRW in December net has more\nUntil about a year ago hardly anyone in climate\nScience was talking about watching but at the recent global climate action some in San Francisco it was all over the place there were panels papers people were talking about how he could help mitigate climate change in all sorts of\nAgriculture\nOr if it's oil to frustration\nOur sometime in coaches the climate change coalition he came to the conference to spread awareness about blocking [noise] so what does\nA lot chain or distributed electric technology really references or larger ecosystem of technology [noise]\nOkay [noise] they give it like the ... is like an accounting book everyone can see a distributed ledger it's a record of transactions that isn't held by a central authority like a bank\nBut it said on the computers of everyone on the block chain transparency is its main advantage ... tons of new companies are springing up saying that they will use the transparency block Jane to solve all sorts of problems everything from curing cancer to ending human trafficking and now even climate change\nIts it's our intention to build the infrastructure to make it possible to reverse climate change\nBall gamble used to be a software product manager he's working on climate change now but he's still makes the grand tech world pitches he's a CEO of a new Silicon Valley company called ...\n... the black chain based marketplace that makes it easier for people to pay for removing carbon dioxide from the atmosphere\nRight now California parts of the U.S and Canada the European Union and the number of other countries are participating in cap and trade carbon credit systems the total number of carbon possible to admit it kept and then companies can buy carbon credits that let the minute more\nEconomists love this market based solution but there's a problem when it comes to counting the carbon\nCarbon markets in the past have been plagued with issues of fraud and double counting\nNobody wants to use block chain to verify the accounting and go one step further to create a market for people taking carbon out of the environment\nNot a company has been launched yet but that isn't limiting the ambition of the sales pitch you want to make the whole climate change problem just go away so do scientists like Douglass McCauley yeah I Wish it was that easy\nBecause a researcher at UC Santa Barbara you said the danger of Silicon Valley is big promise disrupt everything eat those is that it suggests there's a quick and easy solution that things that the climate change are going to be really hard like getting countries to cut emissions or people to stop driving cars the pollute\nThe call I said before it was blocked Jane artificial intelligence in big data were the hot new things\nAnd these are proven to be valuable tools for climate research but in each case it took scientists a few years to cut through all the hype\nWe need to look past the shiny thing and start talking about exactly how to apply it usefully\nIs watching could help with things like counting carbon credits or keeping track of say how many trees a company is planting to suck carbon out of the air Katherine mock a climate scientist at Stanford agreed but she says it's dangerous to believe block Jane will be some kind of a miracle cure\nIt's essentially Ken kicking ethics where we won't be putting into place the solutions that are actually more important to make the entirety of the problem something that's how people\nWith a clock ticking on climate change and ... there's no time to waste sorting facts from ...\nFrom PR News I'm Sam honey [noise]\nThis is NPR News\nYour membership support enables aren't region to enjoy the yard [noise] quality of life [noise] classical jazz and contemporary music and other favorite\nThat says well please let me now ...\nThat's ... the organizer of voters not politicians she had put up a similar ... years ago and now that he didn't like that but this time people clicking the like button and I actually wanted to help\nAnd then he originally had higher frame than friends that are campaign has\nThey showing off voters not politicians new field office the redistricting initiative she launched had amassed hundreds of volunteers and raise more than a million dollars in donations and everything is donated from old computers to the furniture which has people's names taped to the bottom so that they can get their chairs and tables back I'm\nHoping to find a coffee maker that can be done in the food and stuff like that and\nNow lawmakers in power a get together and draw district lines before getting them approved by the governor Mike\nUm but some food and stuff like that and right now lawmakers in power get together and draw district lines of forgetting them approved by the governor Mike ... is senior redistricting counsel at the Brennan Center for justice at NYU school of law he says Michigan maps are among the most skewed in the country\nIt's very clear that their number one goal above protecting communities ethnic geographic otherwise er Michigan it's very clear that their number one goal was to maximize Republican political power\nRepublicans have taken the majority of the state's congressional seats nine out of fourteen even in years when Democrats have gotten this far more votes overall\nThe redistricting proposal would create a commission made up of four Republicans four Democrats and five independence a majority that includes a mix of all three would have to agree on the maps but the opposition calls the proposal an expensive way to change your system that already works\nWindow leach harbor is a Republican and has worked for for secretary of state she says this whole thing it's skewed to help Democrats\nThe gimmick and bypasses are elected official in our democracy and if they want to have the pen they need to win elections\nThe initiative comes at a time when voters are frustrated with politics and government Bernie porn is president of epic MRI appalling and research firm\nThat has been something that has been building for years\nHe says that frustration came to a head in twenty sixteen\nPeople were just show destroyed [noise] really think that the government the federal level is really looking out for members of Congress or their donors and corporations and they're left over the coals\nPulls looking at the redistricting proposal show it's been gaining popularity over the last few weeks but it's still a difficult subject to get people excited about Chiquita Hannah of Detroit plans to vote in November and she's leaning in favor of the proposal one\nWhy should the parts in an office get to decide I Will get the vote in that area when I actually I have a right to choose in and it just makes me wonder well how much rights do we really have\nEven if the redistricting measure passes back not the end of the road legal challenges to the commission's decisions seem all but certain for NPR News I'm Shana raw in Lansing, Michigan\n[noise] [noise]\nThis is NPR News program and has made possible by the ... gallery mindful gift shop yoga studio for all levels art gallery and casting offering coffee and loose leaf tease more information about the wonder stone delving in their vents at the wonder stone ... dot com\nOh back to our biggest such [noise]\nLoses release of met the nice in Nineteen fifty five Louis Armstrong reinvigorated his popularity I'm social Feinstein joined switches standards from the studios in Williamsport Saturday Night at nine billion [noise]\n\n\nIf you recently got a new car and you don't need the old one donated to support WPRI will even taught away and you get a tax deductible receipt details or W. B. I. dot org slash cars or call you for for W. B. I. a car\n[noise] Ninety seconds nationally [noise]\nHi there I'm saying Maynard appears\n[noise] Ninety second maximum [noise]\n\nHi there I'm saying Maynard a parasitic fungus known to manipulate the brains of ants doesn't make slave like zombies out of any old host instead the microorganism is somehow able to recognize the brains of different ant species and releases his mind controlling chemicals cocktail only when in its preferred hubs\nBehavioral manipulation is such a complex characteristic that it only occurs when there's a very close co evolution between pathogen and host\nFungi of the genus ... so called zombie an fungi need answers to complete their life cycle when an ant comes across fungal spores while forging the fungus infects the insect in quickly spread throughout his body\nFungal cells in ant head released chemicals that hijacked the insect central nervous system\nThe fungus forces the aunt to climate vegetation clamp down onto a leaf are twigs for killing his hapless drone interestingly scientists have discovered that the fungi produced a specific chemical cocktail for a specific answer the the CGI thing it knows the brains\nOf its target host and react accordingly Ninety second naturalistic the production of Cincinnati Public radio ... view for support from Cincinnati Public radio member to spend the good news at the natural world [noise]\nSupport for NPR comes from the station and from the Kauffman Foundation working together with communities and education and entrepreneurship to create uncommon solutions and empower people to shape their lives and be more successful more online at Kaufman dot org [noise]\nFrom the Pew Charitable trust celebrating Seventy years of serving the public learn more at ... dot org slash Seventy\nAnd from the John F. and James Alan nice foundation helping NPR advanced journalistic excellence in the digital age\n\nIt's MORNING EDITION from NPR News I'm Noel\nKing and I'm David Greene a federal jury in New York has found three people guilty of fraud\nThey were convicted yesterday of paying tens of thousands of dollars to the families of top flight basketball recruits one of those convicted James gotcha worked for Adidas\nAnd steered certain students to Adidas sponsored colleges schools with storied basketball programs such as University of Kansas and ... are among them\n... longtime coach Rick Pitino was forced out of a job over all this but he was not even brought on trial\nNow joining us to talk about this case and what the NC double a can do to clean up corruption and college athletics is Washington Post sports columnist Kevin Blackistone also familiar voice on our program had their Kevin hey how're you doing I'm good thank you so what does all this mean for college basketball as a whole what happened yesterday you know I'm not sure it means\nAnything for college basketball um in in total because what happened here was a pretty isolated incident um but what it does is it exposes the recruiting practices have been going on in a big time college athletics and football and particularly in basketball\nFor as long as I can remember and that is basically channeling of money from a one source um to the families of talent\nUm to ensure that that talent goes to a particular school and what has happened over the years is that the uh manufacturers of of basketball shoes Adidas\nTo Nike or those those uh operations\nHas gotten people in the middle of them um to help transfer the money so the the surprise here is that it has been criminalize a Bible\nAnd um to help transfer the money\nSo that the surprise here is that it has been criminalize or by the federal government as opposed to be policed by uh the NC double A. as it's been done for years and it used to be that the worst thing that would happen in the situation is that a someone would be banned from\nThe NC double a coach who was who was caught um funneling money or or some middle man\nNow there's like ... which is which is a step back\nA little league now you could possibly go behind bars which is uh what these uh these three men or are facing\nWhat you have these three men facing that you'd say um but I Wonder your colleague at the Washington Post Sally Jenkins room recently that the real defended here should be a university but the universities are actually considered victims and all of this do you see at the same way that she does I\nI don't see it that way but that was the way that the federal government decided to get involved in this basically they said that the ... universes were being defrauded 'em by the system ah because by funneling this money um\nTwo players are are players families um these people knew that they were making these players in eligible\nUnder NCWA rules and therefore that at some point\nIt would all be found out and they wouldn't be allowed to play to the universities that have given them scholarships\nAnd therefore they had to fraud at the University of of value which is a very strange thing to me because I still don't know\nHow that's fraud I mean universities or a University of basketball programs and football programs are still going to get needs talented players under they're very um a low level of remuneration a for athletic talent that brings them um tens of million dollars in revenue every year", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Williamsport", "day": "25"}