{"month": "10", "state": "PA", "station": "WVYA", "content": "\n\nThis is W. B. I. eighty nine point nine of them do the DVR HD ones granted Wilkes Barre hazel ... W E y eighty nine point seven at Williamsport WTO equally three if that means ... Mansfield and W. P. I. U. Ninety One point five at them on my ... township streaming live at W. V. I. A. dot org\nThe puck spilled translator at Ninety four point nine of them is made possible with support from the Richard ... giggling\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'll be partly cloudy this evening with Lowes and the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny was highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance of precipitation is forty percent\nThis is your arts and information station WVU only a a Sam\nThis is Ari Shapiro host of all things considered and every day that I Am hosting the show I sit in the studio for at least two hours while the show is alive and when I can leave the studio at the end of those two hours and say that we really took you someplace we told you what was happening that was important\nWe showed you what was happening with delightful we surprised you we kept you engaged\nThen I feel like we had a really good day all things considered listen every afternoon [noise] to [noise] Monday through friday get four weekends at five\n... is a standup comic with cerebral palsy and that's part of a stack\nOf non oppression Olympics I Would win the gold medal fines Palestinian ... [noise]\nI'm female I'm the same on end and live in New Jersey [noise] laughing you through the pain\nThat next time and the Ted radio hour NPR [noise]\nSaturday afternoon on WB I Am bent\n\n[noise] next time on Anthony another Ethan Slater star ... square pants the Broadway musical tells us about the call that led to it all and they said we had this audition for you can't tell you what it is technically the title tonight land that project but we think you might be the right shape for it [laughter]\nThey're doing meals here I've been back for NPR's our pencils where again Andrea [noise]\nSaturday at all that but I Am on W. V. I Am\nThis evening at seven I double duty on a bill that you will be featuring contemporary jazz big bans then mixed bag start today with a day\n\nThis evening at seven on WB I ate all that you will be featuring contemporary jazz big bands than mixed bag starts a date with a day sampling of new releases\nAt eight thirty it's set of recent recordings by artists who have covered their own song and it nine it's our weekly Alvin review acoustic music from Courtney Hartmann and Taylor Ashton their album been on your own\nMan this is George Graham joined us tonight starting at seven on WB I [noise]\n[noise]\nW. vi public media presents Pennsylvania decision twenty eight teams\nThe Pennsylvania ninth congressional district debate\nRepublican congressional candidates down music and democratic congressional candidate Denny Wolff discuss the issues in front of panelists analyze the other ... [noise]\nNo the candidates before you vote\nThe Pennsylvania ninth congressional district debate [noise]\nTuesday of seven on WB I hey [noise]\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'd be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance or precipitation is forty percent\nThis is your arts an information station WVU like a a ...\n\nThis was W. V. I. A. eighty nine point nine FM W. V. I. H. D. once credited Wilkes Barre Hazelden in Williamsport W BYA eighty nine point seven have him in Mansfield WTO eighty eight point three ... and at lake while in pop back\nW. P. A. U. Ninety One point five FM streaming live a W. V. I. I. dot org we're in Allentown and not eat on point three and in Bethlehem at one of five point seven member supportive public radio W. V. I. S.\n[noise]\nDo they do is you take it kind of music you ... the imagination to myth legend the nicotine and salads and she didn't ... I Hope you'll come along with me on camera and\nSaturday evening at age ... only ... [noise]\n\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'd be partly cloudy this evening with Lowes in the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday nights with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with Lowes in the lower thirties or chance or precipitation is forty percent\nThis is your arts and information station WVU only a ... fan\nTransitional rehab and allied services is a level of care that ensures the safest returned home from a hospital\nWhether you recovering from surgery or your doctor recommends nursing home care following a hospital stay and allied services we can meet your short term rehab needs under one roof either in our high rehab hospital\nOr within the allied rehab hospital in Scranton when you need rehab you need allied surfaces actually er physician to make allied services transitional rehab your partner and a successful recovery miracles in rehab performed daily at allied services\nThat allied services don't work for more details\n\nHere's your program from our our\nTime immemorial learner mommy people I've lived in the northwestern Amazon\nHere's your program from our our\nTime immemorial learn a mommy people have lived in the northwestern Amazon in isolation from the rest of the world for the discovery of gold\nHas brought thousands of outsiders onto their land I'm ... and this was the pulse on the planet [noise]\nWe're listening to hunting song of the on a mommy\nThis gold rush out on the territory was the largest and Brazil's history and the workers in the pit where the poor and dispossessed Brazil and they were looking for some way within a troubled economy they eat out existed and the gold rush provided that\nJeffrey O'Connor is an independent filmmaker recently directed the documentary on the on a mom\nIn Brazilian miners feel they're benefiting Brazil by tapping into this unexplored resource by ringing gold into the Brazilian economy and by generating income for their livelihood and for the livelihood of their family\nFor the mummy gold rush made me me and they are traditional way of life\nWhen I saw there was a culture and on the verge of devastation their traditional hub where in disarray there were people dying with malaria and ... the mommy all to live on fish\nAnd when you have mining and the use of mercury in order to extract the gold\nFrom the mineral you have pollution that's poisoning fish poisoning the rivers and people are dying from road report we have to ask ourselves when\nAre we finally going to work out some type of way in which we don't have the consequences of the decimation of a culture and I think that that's what we're seeing Brazil\nAnd digital leaders and the Brazilian government and the international community are all trying to work a way in which these areas can be protected and preserved\nAnd that there can be some forms of developments in the Amazon rain forest\nThis archival program as part of our thirtieth anniversary celebration you want to hear more check out our podcast\nW. V. I. A. F. M. at NPR are like nothing else that in fact based journalism and intelligent enjoyable entertaining\nAnd it's all made possible by listeners like you your contribution pays or programs like MORNING EDITION all things considered and the ... radio community outreach like kids in the classroom and the great American read nothing comes close to public radio support WB I with the general if you read the W. B. I. R. dot org\nOr call one eight seven seven seven hundred nine eight Ford you thank you\n\nWD I thank the many regional business leaders who support or non profit public service mission to learn how your business can sponsor NPR News and other favorite programming please call five seven zero six zero to eleven thirty seven\n[noise]\nThis is music fit for king king George the second of England the size and on some written by handle each one of the work of next concert\nCause of Saudi of northeast Pennsylvania Sunday November fourth it for via at St Stevenson will [noise]\nDr Allen Baker will conduct a program of English Baroque I've worked for coursing orchestra reason for teens do do including this coronation found some for George the second [noise]\n\nIt's not clear how the bats chose their mates but it may be the case that female seek out the most out of jail mail during this warming event\nReadings hairs will go off just a clue to spot in the cage to made inside our boerio bats have their own way of doing things male hammer headed bats which have in in large layer next nasal cavity lineup injuries along the river bank and try to move passing females why honking at\nThem in Ninety second naturalist is a production of Cincinnati Public radio ... have you with support from Cincinnati Public radio member to spend the good news at the natural world [noise]\n\nW. vi listeners just like you provide the financial support that enables us to provide such fine programming thanks for your membership\nYou're not yet I'm ever go to W. V. I. dot org to learn more and become a member today\nMy\n\nLove is in the air as the Arcadia corral opens the season when the concert for the romantic at all and I enjoy your program touching on many aspects of law long for law found faithful and fickle there are two performances Saturday October twenty seven to seven thirty PM at St Nicholas churches Wilkes Barre\nAnd Sunday October twenty eight that for the first Presbyterian Church hard science for tickets go to Arcadia corral done Dr Steven Thomas conduct the Arcadia corral in lump sum [noise]\nFor tickets go to Arcadia corralled on Dr Steven Thomas conduct the Arcadia around in lump sum [noise]\nW. V. I celebrate hundreds of regional art and cultural organization for details and many more of an [noise] check the w._b. I ate or talent show an odd at\nW. V. I. A. dot org slash I'm listening for art scene with Erica funky weekday mornings after the news at eleven on W. V. A. F. out\nTaking a look now at the forecast will see partly sunny skies today was highs and the upper forties it'd be partly cloudy this evening with lower and lower thirties\nThursday looks mostly sunny with high is in the mid forties it'll be partly cloudy and very cold on Thursday nights with Lowes in the upper twenties and friday we'll see partly sunny skies with ties in the upper forties this listener supported\nPublic radio W. V. I. F. ...\nSupport for NPR comes from Pennsylvania ... October SPA wind month celebrating Pennsylvania's locally grown and crafted wines with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com\n\nProgramming on WB I is made possible by our members and by the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community was an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\nIf you recently got a new car and you don't need the old one donated to support WB I Will leave until it away and you get a tax deductible receipt details or W. B. I. dot org slash cars or call eat for for W. V. I. a car\n[noise] this is W. V. I. eighty nine point nine FM W. V. I. H. D. one scratching Wilkes Barre hates Wilton WTY eighty nine points out enough and William sport W. TI eighty eight point three FM Maine's Berg Mansfield W. P. A. U. Ninety One point five FM Palmyra township\nAnd so that's what how to universities W. S. U. eighty eight point on FM ceilings grow\nWe have a translator in sun buried won all five point seven this was your arts and information station listener supported public radio W. V. I. A.\n\nHere's a look now at the forecast will see partly sunny skies today with highs and the upper forties it'd be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper ...\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance or precipitation is forty percent\nThis is your arts an information station\nW. V. I. A. Pham programming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. ...\nThis is Ari Shapiro host of all things considered by the time you turn on our show in the afternoon you've probably seen headlines maybe you've written sweet and you might have hurting newscast so we want to tell you more than just what is happening we want to give you reasons why things are happening in the context around what's happening\nWe want to tell you something that will stick with you while you're driving home or making dinner all things considered listen every afternoon [noise]\nWeek days at four weekends at five on W. V. I. A. F. M.\nSupport for vi it comes from the FM Kirby sat presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robin ... at the ... center on Saturday October twenty seventh at five PM\n\nHost Greta Joel ... back as Joel Robin ... at the very center on Saturday October twenty seventh at five PM\n\nSupport for WBAI comes from the citizens voice providing loser and county with breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go\nThe citizens voice here to stay more information its citizens voice dot com\nIt's listeners who become supporting members that make everything possible thanks for your financial investment in your arts and information station W. V. I. A. if you'd like to join our membership family go to W. B. I. I. dot org thanks again\n\n[noise] some new and inventive ways now to honor a regents panicked the brand pelican history bumps in suburban county November Nineteen Harry Owens talking with a woman branch of the Lehigh Valley railroad details as CPA history dot com\nThe Wayne County Historical Society and homes yeah conducting three tours of the old don't jail in November twenty four through ten AM to one detailed Wayne history P. A. dot org\nAnd the light coming out Historical Society at the ... museum and Williams or getting into the holiday spirit on December for\nAn exhibit of Ninety the twentieth century children's gave fled than Christmas stocking\nDetailed paper museum dot org\nWB I celebrate hundreds of regional art and cultural organizations who did have that many more events check the w._b. I ate art scene calendar catch up on our ... cat that W vi dot org slash art listen for art scene with Erica funky weekday mornings after the news at eleven\nOn W. V. I. F. ...\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'd be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with eyes in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance or precipitation is forty percent\nThis is your arts an information station WVU I asked them\n\nWhy do you listen to WB I up in NPR News classical music jazz and contemporary music fresh air wait wait don't tell me and other favorite programs they're all here thanks to sustain her support you can help too at W. V. I. A. dot org\nAnd this was your arts and information station W. V. I. eighty nine point nine of them in Williamsport it eighty nine point seven in Mansfield at eighty eight point three at like will and pop back in Ninety One point five and a Bethlehem at what a five point seven listener supported public radio\nSupport for WBAI comes from low and then McCain incorporated providing traditional printing to the business community for over fifty years on and McCain is now offering state of the art digital printing for print on demand books catalogs brochures and more blowout and McCain five seven zero eight two to eight one eight one\nSupport for WBAI it comes from the economic Kirby set presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel Hodgson back as Joel Robin ... at the FM Kirby setter um Saturday October twenty seventh at five PM\n\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'll be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper ...\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with a chance of rain and snow with lower and lower thirties or chance or precipitation is forty percent\nThis is your arts and information station WVU\nOnly a Sam [noise]\nChance or precipitation is forty percent this is your arts an information station WVU only a a Sam [noise]\nW. V. I. a public media presents Pennsylvania decision twenty eight ...\nPennsylvania eighth congressional district debate [noise]\nDemocratic congressman ... Republican congressional candidate John shrimp and discuss the issues in front of pedal is an alliance theatre audience [noise]\nNo the candidates before you vote the Pennsylvania eighth\nCongressional district debate [noise]\nMonday of seven on W. V. I. A. [noise]\n\nOr something of bumped to play something special color what you will or history our values or lifestyle\nHere we haven't forgotten to care ... grown to be one of the most scientifically advanced than innovative health care organizations in America but we never forgotten where we come from we care it's such an old idea is almost means new\n\nThis is your arts and information station WVU than [noise]\nThan when you were then don't in any way to accommodate\nThe minor league that's while they try to marry for money is that the the lead them I Can't remember the on the railroad Heidi stover Lawrence friendly\nCause me to\nJoin us for gun that's going on this station and\nSaturday afternoon at one [noise]\n\nSupport comes from customs container solutions a manufacturer of customers standard roll off front and we're dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com and\nNext time I asked me another Ethan Slater star ... square pants the Broadway musical tells us about the call that led to at all and they said we have this audition for you can't tell you what it is technically the entitled to no end up project but we think you might be the right shape for it [noise]\nThey're doing me off your eyes and very very NPR our puzzles where gained an trivia [noise]\nSaturday at all that but I Am on W. V. I. A. F. N.\nProgramming on WB I is made possible by our members and by the University of Scranton to understand all that Scranton ... visit the campus experienced the community with an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\n[noise] Ninety second snacks [noise]\nHi there I'm saying Maine are more than twelve hundred species of bats exist today representing about twenty percent of all mammal species in the world and given they are the only mammals able to fly bats have some unique mating behaviors not seen in other mammals to start the location and timing of mating varies greatly between 'bout Fiji\nThat's living in temperate regions usually migrate from their summer habits out to their winter hibernation sites called hibernate Oculus where's the breeding occurs about living in warm tropical regions don't migrate\nTheir mating patterns follow the seasonal variation in food supplies for those hibernating species males and females meet for the first time that year in the hybrid accurate\nThat swarm around in huge numbers chasing each other and performing spectacular Arab that\nIt's not clear how the bats chose their mates but it may be the case that female seek out the most out of jail mail during this warming event\nBreeding pairs will go off just a clue to spot in the cage to made inside our boerio bad to have their own way of doing things male hammer headed bats which have in in large layer next nasal cavity lineup injuries along the river bank and try to move passing females by honking event\nIn Ninety second naturalist has the production of Cincinnati Public radio ... view that support from Cincinnati Public radio member it could spread the good news of the natural world [noise]\n\nSupport comes from like coming college your child should only be another face in the crowd he or she shouldn't have to struggle to find their niche your child deserves attention and support and to be known by their first name like common college students\nHelp your child thrive not only in the classroom but also in their community got a firsthand look at like coming colleges nurturing environment at our open house on November ten more information is that W\nNot only in the classroom but also in their community got a firsthand look at like helping colleges nurturing environment at our open house on November ... more information is that WWW dot like combing dot edu like all my college the proud sponsor W. V. I. A. F. that\nAll familiar with Oscar and feeling the original on [noise]\nBut a musical couple is Andrew Lloyd Webber and Stephen Sondheim [noise]\nMostly opera celebrates the challenge of these giant the musical see her performance on Saturday October twenty seven children in downtown sprint\nThis dinner in show production includes favorites from shows such as Lloyd Weber is Benjamin the opera and Jesus Christ superstar\nAmazon Himes into the woods and a little night music [noise]\nMore information go to mostly on red dot net\nW vi celebrates hundreds of regional arts and cultural organization for details of anymore event and check the W. vi art scene calendar\nAnd catch up on our podcasts at W. B. A. dot org slash our [noise]\nListen for art scene with Erica funky weekday mornings after the use of the lead on W. V. I Am\nTaking a look now at the forecast will see partly sunny skies today was highs and the upper forties it'd be partly cloudy this evening was lows in the lower thirties Thursday looks mostly sunny with high is in the mid forties it'll be partly cloudy and very cold on Thursday night with Lowes in the upper ... he's an friday we'll see partly sunny skies with high in the upper forties\nThis listener supported public radio W. V. on ...\n\nSupport comes from ... percent October as national seafood ... a meal plan that includes fish has a heart healthy one while\nFor salmon specializes in Alaska sockeye salmon but carries a wide variety of other fish and shellfish find salmon and more wild for salmon dot com\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts and information station W. V. I. A. F. M.\n\nSo this is W. V. I. eighty nine point nine of them WBAI HD one scratching Wilkes Barre have golden ... nine points out whatever Williamsport Wu TI eighty eight points ... Mansfield\nWPRI you Ninety One point five FM Palmyra township and such but how to universities W que su eighty eight point on FM seasons grove we have a translator in ... three point five\nWere your arts and information station listener supported public radio W. V. I. S.\n[noise] I just as Ari Shapiro host of all things considered when I'm hosting the show I'm always listening for the thing that the ... the thing that jumps out of the radio and grabs you thing that'll make you go home to your spouse when your kid to a friend and say hey we'll never believe what I heard\nToday all things considered listen every afternoon\nMonday through friday get four weekends at five on WB I Am I found\n\n\nIn his Dante Symphony Franz Liszt takes us on a trip from the inferno debt to the heavenly gates this week with the Chicago Symphony orchestra and he ... he conducts it's rarely heard score you know the fire and fury\nPlay music by Beethoven and Missouri this week with the CFL I mean to me [noise]\nSunday attends the em on W. V. I. A. about\nOn day at ten pm on W. V. I. M. S. [noise]\n\nSupport for WBAI comes from a ... a family owned and operated Subaru dealership since Nineteen Seventy ... super who's committed to your satisfaction but you're purchasing ownership experience my new cars super route eleven ... for more information Lucas who Bruce ... called and\nNext time I asked me another eaten Slater star ... square pants the Broadway musical tell us about the call that led to it all and they said we have this audition for you can't tell you what it is technically it's the entitled to land that project but we think you might be the right shape for it [laughter]\nThey're joined me off your eyes and very for NPR's our pet those word games and trivia [noise]\nSaturday at eleven AM um W. V. I Am ...\n\n... when the milestones ... one hundred two hundred even\nFour hundred and fifty years as we celebrate important Bruce ... such as Oscar America come to Sharon ... who knows her own rights and Christian airborne do light a candle with those we're honoring anniversaries this week on pipe dreams from American public media and Michael Barone I Hope you'll be listening\nSunday Morning at six on WB I Am\n\nThe ... Center for the performing arts presenting tax we're right in a piece called the nature of forgetting on Thursday October twenty fifth at seven thirty PM at the Y. center tickets available at Bucknell dot edu slash box office or five seven zero five seven seven one thousand\n\nThis was W. V. I. eighty nine point nine F. M. W. V. I. H. D. ones granted Wilkes Barre ... and we're in Williamsport it WTY eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm palm packet W. P. A. U. Ninety One point five of them\nStreaming live at W. V. I. A. dot org we have a translator in Clark summit at Ninety point three FM your arts and information station listener supported public radio W. V. I. S.\nI. M. critic daily host of live from here are some times rockets sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags and tracking full of music and comedy for a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedian type ... position Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on\nAnd I'm Sarah McCammon NPR's political team on the line whacking the close races around the country working on election didn't wake up and hear what the outcome means for America on MORNING edition\nCritical election central covering NPR News [noise]\n\nSupport comes from Strasburg university where do I go to college east Strasburg university for new undergraduate transfers can lock in the same tuition for all four years as you were warriors belong learn more at where warriors belong dot com\nSupport comes from the times tribute for for a century the top strip units granted assert northeast Pennsylvania with news and information that's five to a community at church or history has it unfolds deliver to your home or your mobile device Akash Tribune is there for you any news dot com\n\n\n\nProgramming on WB I guess made possible by our members we thank you for your support members and buy a Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. like a a family [noise]\nYou know double UCLA Haley also feature recordings friday or his chamber orchestra one of the world's foremost change for us to hear them live in a concert Saturday November's third at seven thirty pm\nWhy center at my nails University in St Louis or their program is kind of stars on line joining the orchestra for this conflict will be innovative artists used because when you see the role of the accordion\nIsrael on the obvious ... mandolin reinventing these time honored instruments the program teachers have doubled can share supply\nOr accordion Israel's oddly oddly a mandolin who are reinventing these time honored instruments\nThe program teachers that double can share it with my jaw and concert music or film composers including you know ... uh for more information 'cause it's not you know dot edu slash center\nThat means you know like a celebration hundreds of regional art and cultural organizations for details on many more of an tested you are seeing calendar and catch up on our seed pod cast WB I ain't dot org slash our [noise]\n\nThis is W. B. I. eighty nine point nine of them that will be the age do you want scratching Wilkes Barre Hazelden WTY eighty nine point seven at that Williamsport WTO eighty eight point three if that means for Mansfield at like one of the combat W. P. A. you not the one point five FM Palmyra township\nTranslators Wu onto a T Clark stomach W to eight nine ... son very nobody to zero seven a Williamsport and they'll be two Seventy eight or ... or a listener supported public radio\nUsually I Am at NPR are like nothing else\nAt least journalism and intelligent enjoyable entertaining and it's all made possible remind listeners like your contribution pays for programs like MORNING EDITION of all things considered on the radio um community outreach to the classroom and the great American read nothing comes close to public\nRadio supporter of the ... when the gentleman in reserve W. dot org or coal won eight seven seven seven hundred and Ninety four to thank you [noise]\nNext ask me that their evenings later star of Bob square pants the Broadway musical\nTalent that's about the call that led to 'em\nAnd they said we have this audition for you can't tell you what it is technically it's the title Tina land that project but we think you might be the right shape for it [noise]\nReally meals here either very happy hour hour and on for a game and drink again\nSaturday at eleven I Am on WB I Am\n\n\n\n\n\nProgramming on WB I made possible by our members and by Pennsylvania College of technology inviting you to the limits of modern warfare stalemate technology and the sounds of fraud in the first World War presented by Dr John day\nDuring the next edition of the technology and society colloquial series open to the public at seven P. yeah Thursday November rate in the club academic center auditorium attend college more information is available a PC T. dot edu slash colloquial\n[noise] next ... minutes later a star of Bob square pants the Broadway musical\nTalent is about the call that led to 'em\nAnd they said we have this audition for you can't tell you what it is technically it's the title Tina land that project but we think you might be the right shape for it [noise]\nGoing me off your eyes and very anti our our ... where he gained Andrea\nSaturday and all that but I ... I Am now\n\nThis is W. I. eighty nine point nine out\n\nThis is W. I. any dog went on our found W. V. I. H. D. once quieted we'll spring April than in Williamsport WTY eighty nine points out that in Mansfield TI eighty eight point three I found out that while I'm pop back\nWPN you Ninety One point five FM streamline the W. B. A. dot org wearing Allentown or not you're not point three any like at five points that members supportive public radio W. V. I. S.\n\nWe'll meet again stories from a you know\nWomen's rights and escape from Cuba\nYour mother telling you usually go along to the United states I was really hard to deal with the change the world like Korea changed a lot like impossible now harmful and people's chasing each other's lives\nWhat do you have I have in a way to save lives\nTo state aid on W. V. I. A. T.\n\nThe milestones Joe though one hundred two hundred and even for a hundred and fifty years as we celebrate import birthdays or composers such as Oscar burn a calm to Sharon ... who knows her own riots and Christian airborne you light a candle with those we're honoring anniversaries this week on ice creams from American public media\nMichael Barone are you listening\nOn the morning as sex on W. V. I. A. F. M.\n[laughter]\n\n\n\nHi I'm Chris daily hosted by from here are some times rockets sometimes poignant ways excellent variety show\nEach week we fill your public radio tote bags tropical musical comedy from long time favorites to new discoveries you give me your when I'm looking for I Hope you'll join me this we get for a killer show with comedians Todd Barry gas station Diana Gordon and the ... the only Jeff Tweedy turn on Cunanan drop on\nSaturday and Sunday night at eight on WB I I got bad\n\nProgramming on W. V. I. is made possible by our members and Pennsylvania College of technology thinking about college hoping Atlanta great job after earning your degree think Pennsylvania college or technology\nWith one hundred plus bachelor and associates degree it's an exciting career field industry standard labs in Ninety six percent graduation rate in college it's perfect for hands on learners visit T. C. T. dot edu to learn about him college degrees that work\nThe composers they go for walks over twenty four year on\nOn a number of occasions when the American soldiers who writes for the first of all random mutations Lewis on cells of Lincoln's\nOn today's leading since I'm On\nFor for the price is different frames was familiar and by the Philadelphia Orchestra\nLewis\nIt was the original form different things\nThese things on the basis of recorded speech pattern\nThe basic idea is that speech recordings generate the musical materials for musical instrument says right [noise]\nThe concept of his peace comes from my childhood he says\nWhen I was one year old my parents separated\nMy mother moved to Los Angeles my Father's Day the New York\nThey arrange divided custody I traveled back and forth by train frequently company by by governor [noise]\n[noise]\nW. V. I. a public media presents Pennsylvania decision twenty eight ...\nPennsylvania eighth congressional district debate\nDemocratic congressman Matt Cartwright Republican congressional candidate John shrimp and discuss the issues in front of panelists and a live theater audience [noise]\nNo the Saturday before you vote the Pennsylvania eighth congressional district debate [noise]\nMonday of seven on W. V. I. A. [noise]\nSupport for WB I come from the FM Kirby sat\nDo you have seven on W. V. I. A. [noise]\nSupport for WB I come from the FM Kirby sat presenting mystery science theater three thousand on thirtieth anniversary tour featuring original host Greta Joel Hodgson back as Joel Robbins at the very center on Saturday October twenty seventh at five PM\nHere's a look now at the forecast while she partly sunny skies today with highs and the upper forties it'll be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with ... in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance of reciprocation is forty percent\nThis is your arts and information station WVU only a Sam\n\nProgramming on W. vi is made possible by our members and by Lindy corporation if it's the Marcellus natural gas is clean abundant and domestic Lindy is proud to be part of the solution to our growing energy needs\nThis was WBRC eight eighty nine point nine of them that will be vi HD once rented Wilkes Barre Hazelden WTY eighty nine point seven Williamsport WTO eighty eight point three of ... Mansfield WTO you Ninety One point five FM Palmyra township\nSo that's why the university's W. S. U. eighty eight point not have them see them grow\nAnd translators do they do want to ... ... to eight nine ... son very there'll be too there were seven eight Williamsport and do they do have an eight eight oh wells borough listener supported public radio\nSupport from customs container solutions a manufacturer of customers standard Ross front unreal dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com\n\nSupport for NPR come from Pennsylvania wads October's PA wind month celebrating Pennsylvania's locally grown and crafted wind with special things to do taste and discover all across the state more information can be found P. A. Y. months dot com Scranton area foundation president and CEO Laura ...\nThe professional advisor counsel at the Scranton area community foundations and price if our regions most respected attorney CPAs any ... professional life partnering with the Scranton area community foundation members at the council can offer their clients our decade did they experience in planned giving to ensure that there are good had the\nBiggest impact for decades to come visit us today at FAFB N. dot org to learn how you can become a member of the professional advisor council\n\nSupport for WBAI that comes from Dr Thomas helped a board certified searching providing dental implant as well as cosmetic facial surgery including faceless islet surgery Botox and wrinkle reduction procedures old on on the spot like setting located in Strasburg five seven zero for two zero eight one eight zero [noise]\nAre you are ducks in a row\nAlmost half of Americans do not have a proper stage plan\nThe plans are more than matters of money and inherited deacon guide your future health decision and move on special instructions for loved ones in your care\nPut your mind and by getting your Dustin road today [noise]\nTo request a brief planning guide content ... W. V. I. N. [noise]\nMay soon as I eat as a stand up comic with cerebral palsy and that's part of our stick\nTheir non oppression Olympics I Would win the gold medal Palestinian none of them\nI'm female I'm the same old and I live in New Jersey [noise]\nAnd in Mount Vernon I'm female I'm the same old and I live in New Jersey [noise]\nThrough the pain that next time on the Ted radio hour NPR [noise]\nSaturday at noon on W. V. ...\nHere's a look now at the forecast will see partly sunny skies today with highs and the upper forties it'd be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with ... in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance or precipitation is forty percent\nThis is your arts and information station WVU I asked them\nSupport for WB I come from the economic Kirby sat presenting mystery science theater three thousand on its thirtieth anniversary tour featuring original host Greta Joel ... back as Joel Robyn at the FM Kirby center on Saturday October twenty seventh at five ...\n\nThis was W. V. I. eighty nine point nine up M. W. V. I. H. D. one Scranton Wilkes Barre his will and we're in Williamsport at W. B. Y. U. eighty nine point seven FM in Mansfield a W T I O eighty eight point three of them were like well I'm humpback a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator and Clark summit at Ninety point three of them you're arts and information station listener supported public radio W. V. I.\nS. [noise]\n\nDoes he do you is your ticket tend music you ... the imagination to myth legend and ... and ... and she didn't from counting ...\nI Hope you'll come along with me on camera and\nSaturday evening at age ... found [noise]\n\nSupporting W. V. I. A. F. N. C. bank offering solutions to grow your business F. M. C. be simply a better business back member FDIC equal housing lender\n\nSupporting WB I ate the pine senior living in large summit providing solutions for seniors wishing to remain independent been eating some assistance with daily living the pines locally owned managed ... care focused on the beach resident applied to collect some a dot com or our family cared for yours\nLove is in the air as the Arcadia corral opens a seasoned women conflict for the romantic and all and I enjoy your program touching on many aspects of law long for law found\nFaithful and fickle there are two performances Saturday October twenty seven seven thirty PM at St Nicholas Churchill Wilkes Barre\nSunday October twenty eight that for the um\nAt first Presbyterian Church Clark signed for tickets go to Arcadia corral done Dr Steven Thomas conduct the Arcadia corral in love song [noise]\n\nNobody vi I celebrate hundreds of regional art and cultural organization for details and many more events [noise] check the w._b. I ate\nOr calendar and catch up on our podcast a W. V. I. N. dot org slash ... listen for art scene with Erica funky weekday mornings after the news at eleven O W the AFL\nMs recorded a university or the policy Friedman art galleries hosting the exhibit contemplating character featuring one hundred fifty two rare portrait drawings in oil sketch it through December second information in gallery hours at ms record e a dot EDU\nContemplating character featuring one hundred fifty two rare portrait drawings in oil sketch it through December second information in gallery hours that ms recorded dot edu slash art\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'll be partly cloudy this evening with Lowes in the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with ties in the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance of precipitation is forty percent\nThis is your arts and information station W. V. I. a Sam\n\nProgramming on WB I is made possible by our members and by the University of Scranton do understand all that Scranton has to offer visit the campus experience the community with an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\n[noise] last time\nGoing to say we can win [noise]\nOn November six the campaigning and who will win and what will it mean for the country and find out with live election night results and analysis from around the U.S critical elections central coverage NPR News [noise]\n\nProgramming on WB I is made possible by our members we thank you for your support members and by the Home Depot there's more home improvement information at the Home Depot dot com this is your arts that information station W. V. I. A. F. M.\n\nSupporting W. V. I. A. F. N. C. D. bank member of FDIC with sixteen branches throughout Lucerne Lackawanna in Wayne County is\nSupport for WBAI comes from ... Jackson offering innovative energy efficient and humane architectural design with fifty three years of experience information at B. C. J. dot com and on bones whiskey Jackson's Facebook and Instagram\nTo ending opioid addiction with those prevention and treatment in the last three years we've reduced the amount an opioid can be prescribed by fifty percent\n... opened three medication assisted treatment centers to help patients recover from attacks and learn more guys died or if I had enough\n\nSupport for WBAI comes from the white Center for the performing arts hosting a free health and wellness fair on Thursday October twenty fifth from five to seven thirty PM in the atrium lobby in conjunction with the performance the nature of forgetting that evening at the Y. center\nThe health and wellness fair will feature a dozen vendors sharing information about staying active and healthy as we age including resources for those affected by memory loss and their caregivers for more information about this health and wellness fair five seven zero five seven seven three seven to seven\nI Am Chris daily host of live from here are sometimes rockets sometimes poignant always excellent variety show\nEach week we fill your public radio tote bags tropical and music and comedy for lunch time favorites to new discoveries you didn't even know what you were looking for ... I Hope you'll join me this weekend for a killer show was comedian Todd Barry guess dish and Diana Gordon and the one the only Jeff Tweedy turn on tune in and drop on\nSaturday Night and six Sunday night at eight on W. V. I. A. F. M. [noise]\n\nThis was W. V. I. eighty nine point nine F. M. W. V. I. H. D. once granted Wilkes Barre ... and we're in Williamsport it WTY eight eighty nine point seven have him in Mansfield a W T I O eighty eight point three of them were like well I'm humpback a W. P. A. U. Ninety One point five of them\nStreaming live a W. V. I. A. dot org we have a translator in Clark summit at ... three of them you're arts and information station listener supported public radio W. V. I.\nS. may soon as I eat as a stand up comic with cerebral palsy and that part of a stick\nIn their non oppression Olympics I Would win the gold medal Palestinian Mount Vernon\nI'm female I'm the same old and I live in New Jersey [noise]\nLaughing through the pain that next time on the Ted radio hour or NPR [noise]\nSaturday at noon on W. V. on a up them\n\nSupport for WBAI comes from the citizens voice providing loser and county was breaking news every day for the past forty years the citizens voice thanks their readers who received news at home or on the go the citizens voice here to stay more information as citizens voice dot com\n[noise]\nFor ... citizens voice dot com\nImmediately you're kind of music or to Germany and they range in age from completely open you're kind of wake me up for insurance\nSaturday evening telling me I Am I'm\n\nThis is W. B. I. eighty nine points on FM W. B. I. E. cheap ones rented we'll ... we'll do W. B. Y. U. not going to have another Williamsport nobody TI eighty eight point three if that means for Mansfield and W. P. A. you knock at one point five FM Palmyra township streaming live a W. V. I. A. dot org\nWe'll translators in Allentown Ninety nine point three and in Bethlehem at one point seven\nListener supported public radio W. V. I. K.\n\nLater star square pants the Bradley musical about the call that led to 'em\nAnd they said we had the audition for you can't tell you what it is technically it's entitled to that land that project but we think you might be the right shape for it [noise]\nYou're either very NPR average working and\nAll that but I Am on WB I Am\n\n\n\n\n\nOn the way they saw rebels twentieth century on Mars to the seventeenth piano trio from Mendelson in or are we used to get stuff from his we took the planet this is the bringing a piece on repressed at least the royal philharmonic in music on WB I\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm\nMm\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\nThis is MORNING EDITION from NPR News I'm\nCalifornia and I'm Steve Inskeep in Washington DC this is a toss mid term elections\nThere was no evidence yet that there will do with the party in power usually lose his ground Republicans are favored at this moment to hold the Senate there long\nThere is no evidence yet that they're due to the other party in power usually loses round Republicans are favored at this moment to hold the Senate they're long shots at best to keep the house [noise]\nDecisive elections there are close so we're to Republicans place their final bats Steven Law is with us again he leaves the Senate leadership\nFun for the Republican side morning\nWhat the role is of groups like yours at this moment when individual democratic start candidate like metal rock or Texas have raised tons of money what is the group like you're\nSure well we look at all these different races\nWe tried to figure out which ones are the most competitive and most importantly where our own involvement would\nMake a critical difference and uh so we're placing our last\nWeeks in the same way that outside groups and the other side are as well would you give me an idea of where some of those vets are going sure as a majority leader McConnell described it they're pretty colorfully he said a lot of these races if not all of them\nAre knife fights and dark alleys they are very very close and uh so we're investing in states like Indiana in Arizona in Tennessee and Nevada, Missouri West Virginia all states where those races are essentially within the margin of error and these are states where our money matters\nHon imaginable even a year ago that you would have to invest money in Tennessee to keep Republican Senate seat on the Republican side [noise]\nWell yeah I mean a tendency is definitely become much more Republican state Democrats recruited a very strong candidate in Phil Bredesen and and he's somebody who's known to the electorate so this is a much more hard fought race than many thought we our view was that it was going to be competitive from the get\n\n\n\n\n\n\n\n\nAnd the next fresh air poll dino he played a teen preacher in there will be blood moody teenager who took about silent and Little Miss sunshine and portrayed Brian Wilson in love and mercy dino directed and co wrote the new film adaptation of Richard forwards novel wildlife\nWhich stars Jake Gyllenhaal and Carey Mulligan during that [noise]\n\n\n[noise] support for NPR comes from the station and from Tara data working to transform how businesses work through the power of data using pervasive data intelligence Garrett data leverage is all relevant data to deliver answers to complex business issues Tara data dot com [noise]\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template uh dragging drop email editor and twenty four seven customer service Morris campaign monitors dot com\nAnd from Amazon Studios presenting beautiful boy based on father and son memoirs beautiful boy chronicles her family's experience of survival\nRelapse in recovery starring Steve corral and Timothy shallow me now playing\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm David Greene on Sunday Brazilians elect a new president John ... is expected to win easily he's a retired army captain and congressmen from the far right\nEnvironmentalists see his policies as a threat to the Amazon both are all grew up in a rain forest in a community that has no deeply divided about his rise to power\nAddress Philip Reeves has more\nTo smoke country town in southeast Brazil ... spent his childhood mid day drinkers in a bar near the town square remembered and well ... ... ... ...\nAnd a bond is a town square remember him well including Francisco Gianni a civil servant fifty eight you to stay for a lot of ... said one day I'll be president has yet to Chinese drinking beer with his brother Luis Antonio who says he used to go fishing with boats and out of\nFear that he's the son of this town was his Luis Antonio ... an ultra conservative who stands up for family and religion and fight corruption [noise]\nLocal officials say about sixty percent of this community support spoke to NATO Luis Antonio's proud the poster NATO grew up here\nThis place is called Eldorado it's not as glamorous as the name suggests this is a shabby town or Fifteen thousand people it makes a living growing bananas and from tourists who come to see nearby caves multiples full that our riches here just a few minutes\nDrive away they say in the town that they live in the middle of the Atlantic rainforest\nAnd they're telling the truth because here we are\nSurrounded by far the Atlantic rainforest one stretch them much Brazil's huge coastline before the country was colonized and began building cities\nMost of the forest destroyed but chunks remain the chunk in this area covers nearly twenty times more land the Manhattan\nThe forest is one of the richest in the world and by the state it has tens of thousands of species many threatened led us for that ... is an environmental activist an eco tourists guide\nAcute they'll pull the plug that reminds me felt the negro phone we have everything air plants animals insects micro Fonda\nEverything the forest around here is on the Gulf and the protection get both NATO talks loosening Brazil's environmental licensing laws because he thinks they suffocate the economy Brazil's powerful agri business lobby hungry for new land farming and mining is behind in his rebuttal\nIn the forest around Eldorado thereabouts it doesn't kill them bowed has these are small impoverished Afro Brazilian communities often establish centuries ago by African to escape slavery these days ... says he sees all Brazilian says equal\nHit in the killing voters people haven't forgotten his past racist remarks about them just taught him on ice who lives in one\nFalcon image fixate those people say he's very prejudiced or not he doesn't like black so we feel really offended\nLocal officials say both ... lived in Eldorado from the age of five to a team his father was the town dentist who goes to ... ... in an op ed wood also vice principal of a local school\nSays he invokes NATO hung out his kids swimming and the rivers playing soccer and hunting puts his mom was a washer woman in the boat so not a household he says\nBut then I was just politically on the left and Trent spoke to NATO becoming president\nShortcuts ... a ...\nA president should you not to people not divide them like both of them out of your\nNike is creeping across the rainforest in a house on Eldon autos big town square at\nThe ... and his deputy aghast at an award ceremony for locals who've completed fashion and bakery causes these two officials belong to a centrist political party and yet they say they don't see votes for NATO from the far right it's a threat to include\nThings it is a ... a city it sit there and I presume a bull Rica\nA little scenario becomes president I'm sure he'll look kindly on the town just vice mad you know show\nThem what about the Atlantic rainforest hold around with him on and also what are the only change the forest is elders on his greatest treasure just math devout shut my eyes and the lungs of the region\nYet the town's broke it needs income and jobs he says\nThe greatest pressure to map the voucher mode eyes and the lungs of the region\nYet the town's broke it needs income and jobs he says\nSo it should profit from the forest allowing in where he goes non polluting industries and\nProtect it you can do but says ... but I feel cause you to say oh yeah and I believe shy about NATO knows that he says [noise] land it's the data the Eldorado eco tourists guide disagrees\nNumber both Disney will miss the most amount of doesn't have any consolation policies his or that or do a book or the bought something else I use them\nSo any form of a threat to the Atlantic rainforest is terrible he says\nBecause once you lose it you'll never get it back for the Braves NPR News El Dorado\nYears after he vanished in Syria a freelance journalist is confirmed safe drew pay Souter was taken by an extremist group but unlike other reporters who have been killed in recent years he has surfaced in Turkey NPR's Anthony Kuhn reports\nJapan's chief government spokesman ... told a hastily convened press conference on Tuesday\nThe Tokyo had received information from ... about the journalist forty four year old to ... to ... you and you can you do you go to conjure informed us that ... has been released the Hindus at an immigration center turkey suit got told reporters\nYesterday I went to Syria three years ago to report on the fate of his colleague tangy go\nGo was taken hostage in Syria in twenty Fifteen and headed by the Islamic State's group\nAnd al Qaida affiliated group known as the new front reportedly took yeah pseudo hostage it's not clear how he was freed in twenty sixteen video came out purporting to show yesterday he told his family he loved them any hinted at the nature of his ordeal in wherever\nYou are a solid and we and\nWhen you're sitting in a dorm room suffering pain he said oh there's no one to answer a no win responding or you are invisible you do not exist no one cares about cheap\nYesterday I began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and later fried at the time some Japanese waste anger at freelance journalists got themselves in trouble and then had to be bailed out by their government [noise]\nYes it as family meanwhile has been eagerly awaiting news his mother told state broadcaster and ha that has she prayed for her son's release she folded little paper origami cranes at least one a day more than ten thousand you know\nAnthony Kuhn NPR News Beijing\n... ...\nThis is NPR News\nI'm being at all have a unified the\nHealth care John firsthand how important health care and her family unlike him\nThat it shows Hillary Clinton Democrats flipped the state legislature and delivered the first Latina senator to Congress Catherine Cortez ...\nIt's the model says Tom per as the chairman of the Democratic National Committee he's into that for the day campaigning\nThe Democratic party nationally\nLeads to emulate what Nevada has been doing\nSince the beginning of twenty fifth season which is organizing early organizing everywhere making sure that we have\nTwelve months party\nWhere we are talking to people he points to the voting flyers at every checkout counter the Asian grocery store in early voting site he says attention to details like that is what's important\nYou know the old in the head of faith based approach to the German elections you always afraid of the candidates would win but we didn't do much else\nGrad says he think Democrats will for anywhere from eight to a dozen governors pizza selection the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nSo it's like has a chance against his Republican opponent Adam lack solve the current attorney general Irish ... campaign for this story too but no one responded\nNow something is shifting here with voter turnout was higher than usual during the primaries and in the first days of early voting and the rate is really a toss up according to polls Johnson\nIs the editor than data independent an expert on Nevada politics we needed a coffee shop\nAnd the electorate reflects the nation's electric very polarized\nThe lower turnout election so it's tribalism Republicans are going to vote for the Republican the Democrats are going to vote for the Democrats\nLike the country that are those mostly Democrat in urban areas ended votes Republican in rural areas so Elson says whoever can turn out their voters were winning the governorship that's how animal actual one four years ago\nDemocrat in urban areas ended the Republican in rural areas so up to catch whoever can turn out their voters were winning the governorship\nThat's how animal actual one four years ago for for attorney general he's the only candidate in modern Nevada history too of lost both the urban areas and still won a statewide race\nBack at the grocery store democratic candidates keeps his rack wrapped up in that that the people he meets a reflective of what they said transient character more recent arrivals or visitors who can't do\nOthers are conservatives who shakes his like sand and readers telling me they're not voting for him and then there's ...\nShe registered on without the sixteen to to legalize marijuana she got the money that came from it would go to her kids' school so far she says that\nWhere's the money going how the ... to ... you\nCan only speak first started my my dad is going to work during a that was a kid and\nShe'll do for the person who will improve her three children is education then a photon NPR News Las Vegas [noise]\nThis is NPR News\n[noise]\n\n\n[laughter]\n\n\n[noise] I'm Jeremy hops in the race for governor of Florida is heating up between Republican Ron dispatches in Democrat Andrew Gillum who tells us he shut afraid to challenge President Trump's behavior emitted Sanchez who was one of his campaign in complete trust being fashion also has to be called out for that kind of directed\nAnd ditch apologies we'll broadcast from Tallahassee next time on here now\n[noise] [noise] [noise]\nGood morning I'm David Greene with a story about the importance of remembering customers the BBC is reporting on a group of men who were about to Robert shopping Belgium until the quick thinking owners that have come back in the ...\nThe BBC is reporting on a group of men who were about to Robert shopping Belgium until the quick thinking owners that have\nAt the end of the day I'm going to have more money than\nThe guys left the owner told police to show up later they were skeptical but they\nCame and when the thieves returned in the evening they arrested them maybe the owners should have asked the guys to fill out a customer survey or something you're listening to MORNING EDITION\nSupport for NPR comes from the station and from zoom zoom offers cloud video conferencing online meetings and a video conference room solution and one platform featuring digital video and audio would screen sharing account registration and more at zoom dot us\nFrom fidelity investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at fidelity dot com slash wealth fidelity brokerage services L. O. C.\nAnd from the listeners who support this NPR station\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep good morning we're deep into an election season when a vital question is who shows up Karen Grigsby Bates of NPR's Code switch team met people who want to grab young voters' attention by making them laugh\nA new campaign called the call the cops started a few days ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop is sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman pulls up a chair\nThe coffee here sucks you know what else ...\nVoter suppression how did you know mining people voting\nThe parties don't represent me system's broken my right so the woman without her phone and makes a call nine\nReporter writing I have several things he's going to be the next parents you know [laughter]\nPlanning on voting oh I can describe him\nIt's a flip on all the white people will be barbecue Becky the pool patrol Paul's and he Starbucks suzy's who is called the police on black people just doing stuff\nReally in the park using the condo pool waiting in a coffee shop for business partner\nOnly in this video black people are calling the police on white once they think are being irresponsible citizens\nTearing the gallon heads acronym the nonprofit agency that commission for videos that are popping up on your mobile devices she gets it they're taking a risk riffing off whites policing black bodies for this campaign to cheat reverse parity\nThere's nothing funny about that but I think that tying that to the civic engagement and using your vote to really make a stand about what kind of country you want to live in in the direction you want this country to go in I think that can be really powerful\nAcronym works to elect progressive candidates via targeted digital media campaigns and the gallon said call the cops it's part of the knocked the vote project which has a specific goal\nMade as a program designed specifically for voters who may not vote in all election or especially in mid term election\nThe company approach director Malcolm de lead to help write and direct the spots leaves work includes night school and lest you take comedy girls trip the idea of a direct pleaded voters appealed to him\nYou know I think it's just important for people to um just be aware and like we're not telling you know what was in my particular but like hey what'd you got to vote to got to get involved in the process\nSo we sat down with acronyms creative director Vince Murphy who by the way is black and devised the call the cops series there's a hipster suburban mom and a worried black man played by the daily show's Roy would junior who's calling the cops on a group of ...\nDeals me and the only place to vote November\nYou and your who's calling the cop on the\n... ... ... introduced me to make plans to vote November\nNumber one I like to report and emergency in a park three white women just taking selfies triple self and progress using filters ... St pitch over and over again blanket job and they literally have no plans of voting in November and excuse me that's not a legal [noise]\nBut it's not an advocate for\nChairing the gallon says most of the responses they received in positive and even if a minority of people are authentic she says getting their attention is half the battle\nWe elect ... and the most are reading or getting a pretty good job\nNow could leave much humor to drawing people who see these spots\nOnce you get people laughing their mouths are open you the truth and\nAndy says the truth is mid term elections camp\n\n\n\n\n[noise] who\nGood morning so how does immigration really affect the job market will look at the real effects of an issue President Trump speaks to move to the center of this fall's election coming up on MORNING edition [noise]\nWhat this Turkey's president wondering I'm David Greene and I'm Steve Inskeep ... placed himself at the center of the investigation of a murdered journalist\nHow could that benefit of president over jailing journalists\nAlso this hour Republicans wants to control two thirds of state legislature in this small they're playing defense against Democrats were hoping to catch a wave\nGet guns out of Washington DC going wrong and It's Wednesday or cover twenty four\nAnd the news is next\nLive from NPR News in Washington I'm more of a cool I'm In the state department is taking steps to punish Saudi Arabian citizen who are suspected of involvement in the killing of Saudi dissident journalist Jamal consume Jane the agency has revoked were denied us visas for Twenty one Saudi officials\nSecretary of state Mike Pompeo said the United states is continuing to learn the facts after weeks of changing explanations that Saudi Government now admits ... was killed in a fistfight in Saturday consulate in Istanbul, Turkey many Sadie critics don't buy this\nThe candidates for Georgia hotly contested governor's race have their first broadcast debate on Tuesday Georgia Public Broadcasting's Steven Fowler reports the candidates do old over voting rights\nMidway through the debate Republican Brian Kemp was asked if he used his position as secretary of state to suppress minority voters in elections his response if you look at the numbers of minority participation\nIn Georgia's up twenty three percent we have a million more people on our voter rolls today than we had when I took office but Democrats Stacey Abrams said voter suppression was about more than being on the role\nCreating an atmosphere of fear making people worried that their votes don't count\nThe pair of glasses in recent weeks over everything from rejected absentee ballots the door just strict voter registration law they both face libertarian had met in November for NPR News I'm Stephen Fowler in Atlanta\nA Japanese journalist it's free after vanishing in Syria three years ago NPR's Anthony Kuhn reports from Beijing that the freelance reporter is believed to have been held hostage\nForeign minister tomorrow kono told reporters that Japan is confirmed the identity of forty four year old Jim pay ya suda Qatari officials notified Japan of Yahoo does release on Tuesday Japanese diplomats went to visit him at an immigration center in southern turkey and found him in good health\nYahoo down went missing in twenty Fifteen and it was reportedly taken hostage by now\nIt's went to visit him at an immigration center in southern turkey and found him in good health\nYahoo down went missing in twenty Fifteen and it was reportedly taken hostage by an al Qaida affiliate known as the time as the all new front\nTokyo insisted that it had paid no ransom ... soda and think turkey unconscious for their help with the case this was Yahoo does second freedom from captivity he was taken hostage and later fried in Iraq in two thousand and four\nAnthony Kuhn NPR News Beijing\nThere is at least one winning tickets for last night's near record breaking one and a half billion dollar mega millions lottery NPR's Emily Sullivan reports the ticket for the jackpot with so somewhere in South Carolina\nThere could be other winning tickets at half eaten along lottery odds but the south Carolina education lottery is the only one so far to report one sold in the state that match it all sex and making millions numbers and Tuesday nights drawing\nTheir numbers I was at one point six billion dollars of our twenty nine years or a lump sum payment of some nine hundred and four million dollars NPR's Emily Sullivan\nThis is NPR\nA federally appointed oversight board has approved to fiscal reform plan for Puerto Rico was opposed by the island's elected government the plan cuts the islands spending and takes into account about twenty billion dollars in federal disaster relief funds this is intended to help the U.S territory through a major economic crisis\nThe city of Austin, Texas risks running out of drinking water from member station KCPW UT most ... reports flooding in the city over the last week has severely limited officials ability to treat water\nThe silt the floodwater rolling into Austin reservoirs looks like chocolate milk and makes it a lot harder to treat than usual often water utility director ...\nWe've been reducing combat and yet those plants to try to treat this high ... or very cloudy water it's at a level that we've never experienced in the history of our utility uh and it's been a real struggle\nAustin is under a boil water order and mandated conservation the city of San Antonio has lent Austin or water tank or to help fill up city storage tanks meanwhile many restaurants closed in stores are having trouble keeping bottled water on the shelves for NPR News I'm most the show in Austin\nThe UN is sharply warning of the imminent danger of famine in Yemen the country's torn by civil war with the rebels backed by Iran are fighting the Yemeni government backed by Saudi Arabia the U.S has supported the Saudi military air effort in Yemen un estimates\nAs many as fourteen million ... may soon face pre famine conditions on corporate Coleman NPR News\nSupport for NPR comes from NPR's versions other contributors include Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring Diane Lane no awhile Christina Hendricks and Andrew rentals a new episode every Friday on prime video\n[noise]\nIt'd be partly cloudy this evening with a lower and lower thirties Thursday looks mostly sunny with high in the mid forties it'd be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance of precipitation is forty percent\nThis is your arts and information station WVU\nAsked them support comes from a European import in business for over twenty five years specializing in the sale in service of pre own Volkswagen Audi BMWs and other European cars located between ... more information at your imports\nIt's a ... Volkswagen Audi BMWs and other European cars located between ... and ... more information at your imports stop is [noise]\nNext time I asked me another even later star ... square pants the Broadway musical telling us about the call that led to it all and he said we haven't audition for you can't tell you what it is technically the untied on the land that project but we think you might be the right shape for it [noise]\nThey're doing Neil you're Eisenberg NPR's our pencils were gained Andrea [noise]\nSaturday at eleven AM on WB I Am um\nWBAI passport is an added benefit for our donors allow you to watch many PBS WB I programs whenever you want on your computer smartphone or tablet learned more W. V. I. A. dot org It's MORNING EDITION from NPR\nNews I'm Steve Inskeep in Washington DC and I'm David Greene in Culver City California ever since the killing of Saudi journalist ... G the Saudi leadership has been struggling to explain what exactly happened President Trump has been criticized for not responding more forcefully against the kingdom though his tone has shifted in recent days\nSomebody really messed up and they had the worst cobra ever and we're ... is at the deal standpoint whether they thought about it as well as on to that idea I think is in big trouble and they shouldn't be in big trouble\nYou know in addition to the president's remarks secretary of state Mike Pompeo announced that the U.S would be revoking the visas of Saudi operatives who were accused of killing could show gee\nDo many of those suspects were already under arrest\nSome payments as did that this would not be the last steps the United states would be taking on this matter but for turkey where the killings took place the uproar has offered president ... air to one a chance to boost his regional influence yesterday\nIn a speech to Turkish lawmakers he demanded ... killers be brought to account and suggested holding their trial in your stumble\nFor was yours is a professor of international relations at the London School of economics also the author of numerous books on Mideast politics and he joins us on the program this morning professor welcome thank you so what what are the ones motivations here for coming out so forcefully and so publicly in this case\n[noise] well I think a president ... has managed the crisis in a very strategic vaguely either way on the way that it has managed the crisis to the most recent escalation by this how this is\nYou're going to win this and we're just the right\nFor all the results on election night stay with NPR News I'm Ari Shapiro\nAnd I'm Sarah McCammon NPR's political team will be live all night watching the close races around the country listen on election night than wake up and hear what the outcome means for America on MORNING edition\nCritical election that central coverage NPR News [noise]\n[noise]\nW. vi public media presents Pennsylvania decision twenty eight teams\nThe Pennsylvania ninth congressional district debate\nRepublican congressional candidate down new user and democratic congressional candidate Jenny we'll discuss the issues in front of panelists analyze the audience [noise]\nNo the Kennedys before you vote\nThe Pennsylvania ninth congressional district debate [noise]\nTuesday is seven on WB I hey [noise]\nSupport for WBAI comes from United Methodist homes offering short term rehab following an injury or surgery delivering expert care every step of the way at our Westlake village campus more information at United Methodist homes dot org\nHere's a look now at the forecast will see partly sunny skies today was highs and the upper forties it'll be partly cloudy this evening with ... and the lower thirties Thursday looks mostly sunny with high in the mid forties it'll be partly cloudy and called on Thursday night with Lowes in the upper twenties\nFriday looks partly sunny with highs and the upper forties and friday night looks mostly cloudy along with the chance of rain and snow with lower and lower thirties or chance of precipitation is forty percent\nThis is your arts and information station W. V. on like a a family\nSupport for NPR comes from this station and from CSP certified financial planner professionals committed to providing holistic financial planning from taxes and investments to retirement and estate planning in the client's best interest let's make a plan dot org [noise]\nFrom the department of homeland security with e verify dedicated to providing employment eligibility verification for all businesses and the employees that help them thrive ... verified\nVerification for all businesses and the employees that help them thrive ... verify dot Gov slash go and from Lyndon moved down to learning process is committed to helping all students learn to their potential they're learning centers and on line private school offer instruction\nIn reading and comprehension Lyndon ... dot com slash NPR\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep Republicans want to preserve their power and this fall state elections Democrats want to take some of that power away\nYou know the old in the head a faith based approach to mid term elections do we pray that the candidate would win but we didn't do myself democratic\nGerman Tom for as is working on the Nevada governor's race as we hear elsewhere this morning\nFor years Republicans have dominated governors offices in legislatures state lawmakers make big choices about Medicaid expansion taxes roads schools and they also draw district lines for future elections some our future national leaders according to the Republican overseas his party's efforts\nThere part farm team and their part a current leadership people underestimate the impact that state and local governments asked\nMatt Walter of the Republican state leadership committee was with the group is the party captured two thirds of all state legislatures they've recently lost some ground and hope to avoid losing more\nWhen you're at all time highs you are naturally playing defense so when you have an environment that the historical trend lines are going to tell you that you're going to wind up losing seats um you have to fight against that regression to the mean\nAren't there several states where the flipping of a couple of seats could make a significant difference or even changed the chamber\nYes you have a one seat majorities in Colorado and New York Maine two seats are in Wisconsin and and the number of other states are quite close further compounding\nOr what you're saying is the narrow margins by which those seats change hands ten votes ... votes a thousand votes so it is critically important for people to get out and vote\nI guess we should remember that the Virginia house of delegates after the election in two thousand Seventeen ended up on the verge of being tied between Republicans and Democrats and they had to have a drawing to decide the last seat and you guys want the drawing you got the drawing even though you've lost a lot of ground in the election\nHow much of an advantage is it for your side that Republicans were in charge of many state legislatures at the beginning of the decade and so they did the redistricting in many many states\nIt's important to make sure that you've got fair and competitive lines and our contention is that better candidates with better ideas when based on ah the quality of their campaign\nThere are some pretty dramatic examples where states as a whole voted for Democrats and Republicans ended up in control of the chamber one of them being Wisconsin in two thousand twelve\nWhere Democrats appear to have a big majority and votes and you had Republicans ended up with an overwhelming majority in the state legislature that's drawing of district lines that's where they came from right well\nI Would raise a couple of points out that um first and foremost the system we've designed as the have local representative that people can count on carrying the interest of that community we don't have a parliamentary system\nA it's a winner take all system women districts uh and so applying a notion that a state wide total somehow should be apportioned out two representatives a is a fundamentally against uh the basic structure of my system\nBut if you drew the lines differently in Wisconsin the election result could have been completely different with the identical set of votes from the public\nHave that and you could have had different candidates and you could have had different issues that isn't there a lot of hypothetical but what you've seen within Wisconsin a is overwhelming Republican success at the state wide level um UC ... Republican governors lieutenant governor statewide elected officials\nLevel um you've seen Republican governors lieutenant governor statewide elected officials be reelected which has nothing to do with lines and you see that all across the country\nHow if at all do you advise state legislative candidates to deal with questions which must come up about President Trump\nThe state legislative level has very little to do with the federal government as it as it relates to um personality issues and dominant figures now there's obviously an environmental impact it's going to drive energy and resources in certain categories\nBut the best thing any elected official can do to be successful his understand their district can advocate for the things that are important to their constituents\nView at a wave election in two thousand Ted on that went all the way down to the state level um how do you deal with the danger of a wave election and two thousand I team well\nCertainly always need to be prepared for the challenges that come but when you look at the special elections that have taken place this year if they're a winding up for a wave I think they're going to be extraordinarily disappointed\nWould you argue there is something technically or politically that you are managing to do and district after district the Democrats are failing to do in order to be in position to win a\nPrize in local government I think part of that is an ideological difference between the two parties the Democratic and progressive movement seems historically to be more focused on sort of installing a a a master architect at sixteen hundred Pennsylvania Avenue a and a more conservative philosophy wants to defuse that power out to the localities\nThat's Matt Walter of the Republican state leadership committee after historic\nFlooding in Austin, Texas that cities one million residents have been told to boil their drinking water most ... of member station K. U. T. has more [noise]\nRushing into Austin reservoirs has the\nIt's been so turned off by flooding brown SEAL Team and when it goes Austin's treatment plant it takes a lot longer to filter so on Monday the city told people to conserve\nWater and as a precaution to boil what they're going to use for drinking in food ... you can probably guess\nNext and I'm ...\n... yesterday Maggie Chapman was one of a bunch of shoppers at a supermarket wheeling out bottles of water supply had improved in the day before when shells were bear after stores started to limit how many bottles people could buy\nIt inconvenient at this point but I technically about you know just ... that we use water I hadn't even thought about\nWhat kinds of things some restaurants are close to cafes aren't serving so you meet a lot of people desperate for coffee and on a more serious note the city of San Antonio central water tank or to help keep the local jail supplied with drinking water and the city of Austin worried about maintaining water pressure in a system\nWe've been providing water for a hundred years this has never happened to us this is blowing our mind to\nGreg ... is the director of the city's water utility he says after all that silk slowed water treatment the city's system of pipes and reservoirs started to lose pressure\nIf he loses too much pressure to city won't be able to spray water from hoses to fight fires and water and pipes risks getting contaminated as micro organism sneak into holes and openings they wouldn't normally access\nThe good news is there are says is that water conservation is working people in Austin or using less more water is going into the system and water pressure has improved\nThe one thing we can control is how much water we use we can't control the weather but we can control that aspect of it\nHe says if conservation continues and the weather cooperates things could start returning to normal by this weekend if heavy rains kick up more silt and the river is could\nLast days beyond that NPR News I'm mostly shell in Austin\nAnd this is NPR News thanks to your support them\nFor NPR News I'm Mose Michelle in Austin [noise]\nAnd this is NPR News thanks to your support members WB I ate champions arts organizations cultural events talented regional musicians educational program showcasing except from students you make all this possible thanks for your support for ... the I ... a\nCummings has plans for potential investigations among them the political ties to protected former ... chief Scott Pruitt for so long to security vetting done on Trump adviser and son in law Jared Kushner the Justice Department and its record on voting rights\nComing still political recently he wants to work with committee Republicans\nThose are the kinds of things were going to have to do and if it's not going to be very pleasant for them so it will be very pleasant for me but I signed up but his job is what I'm supposed to do\nThat is how congressional oversight is supposed to work but hasn't now with one party controlling Washington the past two years Justin rude is a former congressional investigator now with the nonprofit project on government oversight\nWhat we've seen is not only a a a stretch of time when you have an executive branch that has been breaking norms but you have a Congress is set by without consequence allowed that to happen without significant accountability\nDemocrats would face pressure from their base to impeach President Trump House Democratic leader Nancy Pelosi says she's against it here she is last week at Harvard's Institute\n... says she's against it here she is last week at Harvard's Institute of politics\nFights and there and just live\nBelow sea says Democrats should go after Trump's tax returns he's refused to disclose the Democrats would have the authority to get something\nAt the house intelligence committee perspective chair Adam Schiff of California says he would probe allegations that Russia has financial leverage over Trump the Trump Administration has ignored virtually all information requests from congressional Democrats but there is a workaround for that\nGet the documents from friendly nonprofit groups that get them through the freedom of Information Act Austin Evers is director of American oversight a progressive group that snow filing for your request\nIs actually very difficult to enforce the congressional subpoena in court in contrast a freedom of Information Act request which we could file we can go to court very easily and force agencies to be transparent\nIt's worth noting this for your strategy was owned by conservative groups than the Obama era\nHouse Democrats plan to have all the committee's doing oversight investigating cabinet secretaries who broke the rules protecting Obamacare finding out what went wrong with hurricane relief and tackling other issues that Republicans have brushed off\nOne master of oversight is former congressman Henry Waxman during forty years in the house he investigated everything from the tobacco industry to the Iraq War\nWaxman enlisted three goals have good oversight stopped the waste of money hold people accountable and make government work the way it should his word of caution to House Democrats don't do oversight the way the Republicans have recently\nThe committees in Congress used their power which is in credible amount of power and abused it for simply political points simply to advance their election interests Waxman said that's not what oversight should be about Peter Overby NPR News Washington\n\n\n[noise]\nThis is NPR News support comes from custom container solutions a manufacturer of customers standard roll off front in dumpsters and specialty containers serving the environmental construction energy waste and recycling industry's information at customs container solutions dot com [noise]\nThis evening at seven I Will give you all have all that you will be featuring contemporary jazz big bands\nThan mixed bag start today with a date sampling of new releases thirtieth set of recent recordings by artists who have covered their own song and a nine to our weekly Alvin review acoustic music from Courtney Hartmann and Taylor Ashton their album been on your\nThis is George Graham joined us tonight starting at seven on WB I [noise]\nProgramming on WB I is made possible by our members and by the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community with an open house event on Sunday November fourth see how one of America's premier colleges will open doors for you\n[noise] Ninety second nationally\nBy their I'm saying Maynard more than twelve hundred species of bats exist today representing about twenty percent of all mammal species in the world and given they are the only mammals able to fly bathtub some unique mating behaviors not seen in other mammals to start the location and timing of mating varies greatly between about the the\nBats living in temperate regions usually migrate from their summer habitat to their winter hibernation sites called ...\nVaries greatly between about species\nThat's living in temperate regions usually migrate from their summer habitat to their winter hibernation sites called hyper masculine where's the breeding occurs about living in warm tropical regions do Margaret\nTheir mating pattern follow the usual variation in suits applause for those hibernating CDs males and females meet for the first time that you're in the hybrid accurate\nThat swarm around in huge numbers chasing each other and performing spectacular that\nIt's not clear how the bats chose their mates but it may be the case that female seek out the most out of jail mail during this warming event\nBreeding ... will go off to school to spot in the case may be fraud\nOr boerio bats have their own way of doing things male hammer headed bats which have in in large learned the nasal cavity lineup injuries along the river bank and try to move passing females why honking at them in Ninety second naturalist is a production of Cincinnati Public radio and the Cincinnati\nZoo the support from Cincinnati Public radio members to print the good news of the natural world [noise]\nSupport for NPR comes from that station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine T MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information or a Mac found dot org and from the listeners support this NPR station\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Steve Inskeep\nParis was one of the first large cities to experiment with a bike sharing system what it introduced the leap more than a decade ago they leave had been a huge success at a point of pride for the city until this year when it changed operators and almost collapsed\nThe parents mayors given the new valium operators until this fall to get their act together\nWell it's fall NPR's Eleanor Beardsley reports\n... trying to unlock one of the colorful new ... dong than businessman says he's been riding the bike to work every day for the last several years and I can't imagine going back to driving a car or taking the metro Modi said despite leaves recent troubles the system has improved a lot in the last two months\nOf only about culture ... before August Vacation there were no bikes here and you had to walk to a lot of stations to find one at least now their\nBikes for tens of thousands of precision they leave is a vital mode of transportation and air traffic choked city so when a new transport consortium one available contract with a plan for electric bicycles people were enthusiastic\nWe're very excited with the new ... there were a lot of promises a new bike was high technology on new features\nThat the moon lab who may have parents in the saddle a cyclist advocacy group lab ... says the new company ... what's the big disappointment\nIt was developed for biking um deserve to for ...\nBikes were broken or unavailable the ducks that held them we're out of water daily Bailey bused plummeted from one hundred thousand trip today to a couple thousand parrots mayor and eat out though said she was giving ... just a couple of months to get things on track\nThe company hired crisis manager out no matter who became ... new CEO now young says the first mistake with changing they leave operators with no lead in\nTime which was I think crazy to do that because you have to be the musicians\nRaiders with no lead in time\nWhich was I think crazy to do that because you have to be the musicians or an ... or ... to fight ducks but for the new tree by a to be a challenge for about three\nThings continue downhill over the summer now they all sat on top of it technical problems the company's struggled with bike damaging theft and it tore it in the city of light\nUnfortunately because I'm French and I'm about reviewing the sees a a tone of uh in CBD cheap and it's a beauty of schools and so we had the at the beginning of this you spend ... all these ...\nSays the new they leave now fit snugly unlock properly and they're charging docks trip have now written back up to nearly forty thousand a day and he said the new they leave them like the old ones are available in the Paris suburb\nYou have to think about these people who have to move from the set up to par reason they want to use a clean bike or electric by Joe and and we have ducks and stations roughly ... outside I read\nBack at ... feet bully is still trying to unlock a by both\nThe ... or early ...\nFinally one becomes available in the first one told me no a minute ago he says it shows you should never give up and ...\nHe rides away Eleanor Beardsley NPR News I'm Aaron", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Williamsport", "day": "24"}