{"month": "10", "state": "PA", "station": "WVYA", "content": "\n[noise] so this is W. V. I. eighty nine point nine a pound W. V. I. H. D. one scratching Wilkes Barre he's Wilson W. B. Y. U. I. eighty nine point seven FM W. B. Y. get each one Williamsport WTO eighty eight points ... Mansfield at W. P. A. U. Ninety One point five ... township\nScreaming live at W. V. I. I. dot org\nWere Louis ... one hundred point one and his son very it was five point seven you're arts and information station listener supported public radio W. V. I. S. [noise]\nJoined us for a celebration of one hundredth anniversary of the birth of Leonard Bernstein's\nOn Sunday afternoon at three Gary and Bernadette Byrd with Richard McDonald\nThe west Side Story that's one of the early ... WB I ate and the Dietrich Caesar invite you to enjoy this concert and the sort of an atheist make reservations have doubled in the town board or thought five seven zero six five five to eight\nGood morning Brett Kavanaugh is now a Supreme Court justice there'll be a ceremonial swearing in tonight we will look forward to help the newest justice could change the fake\nKevin other appointment his short to galvanize energy among both Republicans and Democrats as we move toward the mid term election I'm David\nGreene and I'm Noel King high stakes presidential election in retail will go to a runoff I'm far right candidate to not just short in the village he needed to win out right and some people have suffered from insomnia are training the phone and we have for health [noise] any scientific study looks at what we're saying that it is Monday October\n... singer songwriter and film and grew into march Thirty years\nIn the news isn't it\nLive from NPR News in Washington I'm Dave ... like there's a ceremony tonight at the White House where President Trump will swear in Brett Kavanaugh as the newest justice on the U.S Supreme Court NPR Shannon band sense says this follows cabinet Senate confirmation over the weekend\nConservatives now have a working majority a fine justices and well defined dozens of federal cases on issues from audio emission standards to immigration Kevin ... sworn in in the shadow of a confirmation fight exploding and ...\nLive from NPR News in Washington I'm Dave ... there's a ceremony tonight at the White House where President Trump will swear in Brett Kavanaugh as the newest justice on the U.S Supreme Court NPR Shannon van ... says this follows Kavanaugh Senate confirmation over the weekend\nConservatives now have a working majority a five justice has and will decide dozens of federal cases on issues from auto emission standards to immigration have an outlet sworn in in the shadow of a bitter confirmation fight exposing and possibly deepening divides and an already polarized political system and\nProtest chart that demonstrations over the weekend said they were gearing up for a larger long term movement to inspire voters to head to the ballot boxes in November and beyond\nRepublican leaders say Kavanaugh's confirmation well also rallied voters among the GOP based\nSentiment and sent NPR News Washington\nSecretary of state Mike Pompeo was in China Today pump pay was briefing China's foreign minister and other officials in Beijing about his latest trip to North Korea where palm pale met with Kim Jong on\nUm pale in China's state councilor voice criticism of each other's government today but agreed on the need to improve cooperation between the two countries\nThe president of Interpol monk hung way as being detained in China where he's being investigated on charges of bribery and violating Communist Party rules NPR's Rob Schmitz reports China's public security\nMinistry ... enough the investigation and among on Monday [noise] you know it's been comes more than a week after mine was reported missing by his wife in the on France where Interpol is headquartered for its part Interpol he's fully announced among has resigned as president of the international police agency\nAnd they own grace among said she'd received threats and at the final tax from her husband said wait for my call followed by a ... knife\nObservers in China to the fact that Beijing is willing to jeopardize its diplomatic relations by detaining a high profile officials suggest the stakes are high\nMom was appointed vice minister of China's national police by ... China's former security czar who was in prison after she didn't paying became leader of China Rob Schmitz NPR News Shanghai\nFederal investigators say a weekend crash in upstate New York involving a limousine and pedestrians is the deadliest in the U.S in years twenty people were killed Eighteen of them were inside the limo\nWitnesses say the limo random stuff Simon Stow Harry New York about forty miles from Albany and slammed into a parked SUV outside of the store\nRobert Sumwalt as chairman of the national Transportation Safety board\nTwenty fatalities is just horrific I've been on the board for for twelve years and uh this is one of the biggest losses wife loss of lives and we've seen a in a long long time\nAmong those killed in a limo were four sisters the group was headed to a friend's thirtieth birthday party this is NPR News from Washington\n\nIn major league baseball the Milwaukee Brewers are heading for the national league championship series after completing a sweep of the Colorado Rockies already Michaelson with member station Wu WN reports\nThe brewers shutout Colorado six to nothing in Denver to complete a three games sleep with Iraqis Milwaukee's pitching staff held the Rockies to only to run and fourteen hits in the division playoffs\nIt's the first time since two thousand eleven that the brewers have a dance to the championship series the brewers had to fight to even get to the division playoffs last week they beat Chicago in a one game extension of the regular season to capture the division crown at Wrigley Field\nFor NPR News I'm Marti micro thin in Milwaukee\nAnd the other end they'll divisional match up the Los Angeles Dodgers\nSix to nothing in Denver to complete a three games sleep with Iraqis Milwaukee's pitching staff held the Rockies to only to run and fourteen hits in the division playoffs\nIt's the first time since two thousand eleven that the brewers have a dance to the championship series the brewers had to fight to even get to the division layoffs last week they beat Chicago in a one game extension of the regular season to capture the division crown at Wrigley Field\nFor NPR News I'm Marti micro thin in Milwaukee\nAnd the other end they'll divisional match up the Los Angeles Dodgers and the Atlanta Braves will play a game for their series this afternoon in Atlanta LA leaves the best of five two games to one yesterday Atlanta avoided a sweet by beating the Dodgers six to five\nIn the American league the Houston Astros are in Cleveland this afternoon for game three of their AL divisional series the Astros lead Cleveland two games to none tonight in New York the Yankees host the Boston Red Sox that's game three of their AL divisional series it's tied at a game of peace\nForecaster say a tropical storm that rapidly formed off Mexico's Yucatan Peninsula has gained new strength they say it could become a category\n... hurricane with unexpected mid week strike on the Gulf Coast in the Florida Panhandle I'm Dave ... NPR News in Washington\nSupport for NPR comes from the Jack Kemp the Koch Foundation providing scholarships throughout the nation to exceptionally high achieving students with financial made from middle school to college more information about coke scholarships is available at J. Casey half dot org and Americans for the arts\n\nPartly sunny today with a thirty percent chance of showers and thunderstorms highs in the upper seventies\nMostly cloudy this evening with a thirty percent chance of showers lows in the lower sixties partly sunny on Tuesday with highs and the upper seventies partly cloudy and Tuesday night with ... and the lower sixties and mostly sunny on Wednesday with high in the upper seventies you are listening to W.\nVi eighty nine point nine FM your arts and information station\n[noise] when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book\nOn the next fresh air we talk with his son Adam Cohen who wrote the introduction Adam also produced you want it darker the album his father recorded shortly before his death join us [noise]\nThis evening at six after all things considered on W. V. I Am a\nSan Francisco offered presents Andreas ... they're going to do it on its tail of a poet and a young woman causing the turmoil of the French Revolution music director ... lead an international teaching young ...\nOn up there on St George got an e bay engine eight bridges join us for Andrea ... on that station [noise] Saturday afternoon it was a\n[noise] It's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California the three month confirmation fight is over and Brett Kavanaugh is the newest associate justice of the U.S Supreme Court yesterday he was in his chambers preparing for oral arguments before this new reconstituted court\nBut there is still a lot of bitterness over this process Republican Senator Susan Collins was on CNN yesterday defending her vote to put ... on the court Collins who is a moderate say she was convinced Kavanaugh will not overturn a woman's right to get an abortion\nSeems in DC and I'm David Greene in Culver City California the three month confirmation fight is over and Brett Kavanaugh is the newest associate justice of the U.S Supreme Court yesterday he was in his chambers preparing for oral arguments before this newly constituted court\nBut there is still a lot of bitterness over this process Republican Senator Susan Collins was on CNN yesterday defending her vote to put cabin out on the court Collins who is a moderate say she was convinced Kavanaugh will not overturn a woman's right to get an abortion\nHe says for president outlined fabulous path bike route to be very tired and when it happened in Beijing gravy flame Ron and the ... had said and he noted that Raul had been reaffirmed Nineteen years later by Planned Parenthood versus Casey\nSaid at the extremely rare at the overturned\nOkay a lot of questions about whether this appointment will change the court will shift the court to the right let's bring in NPR White House correspondent Scott Horsley one of many journalists following the story over the last three months either Scott good morning to\nAll right so we have a confirmation now Kevin us on the court hum what our experts analyst saying about how the court might change with him seated\nCertain sense of of\nEnergy and he he got to be a journalist I gather anything that's why it would hurt the most about aren't\nCarrying ... thanks so much we appreciate it I think this is NPR News\nNext time with the Chicago Symphony orchestra conductor a divine nature of the second most like turning and invented the horns and try to number three and\nMost ... of the time to Chicago to New York and nice if any\nOne day a ten pm on W. V. all of a\nMonday evening at seven on WB ... mostly recent recording the mixed bags starts today today sampling of new releases including one from singer songwriter John when\nThe country we we can\nMaybe ... world pizza and at nine a segment recalling no singing about collecting instrumental music this is George ... joined us Monday evening starting at seven when WPRI\nLike what you see on WB IRA you enjoy fine programs like pull dark nova or nature do your kids love watching the antics of Elmo on Sesame Street enjoy sit at the science acute are curious George how 'bout shows like called the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs uh W. V. I. A. dot org and thank you for your support for W. vi\n\nProbably Seventy today with a thirty percent chance of showers and thunderstorms highs in the upper seventies multiplier you this evening with a thirty percent chance of showers lows in the lower sixties\nPartly sunny on Tuesday with ties in the upper seventies partly Claudia Tuesday night with loads in the lower sixties and mostly sunny on Wednesday with hides in the upper seventies you're listening to WBAI eighty nine point nine FM your hearts and information station\nSupport for NPR comes from the station and from the state of June ... who's ... served as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\nThese Pearl exciting on Tuesday with ties in the upper seventies\nPartly Claudio Tuesday night with loads in the lower sixties and mostly sunny on Wednesday with highs and the upper seventies you're listening to W. vi eighty nine point nine FM your arts and information station\nSupport for NPR comes from the station and from the state of Joan ... crock who's ... serves as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\nFrom the Kennan Lucy leaning family who appreciate that for three decades NPR it's helped them to better understand a complex nation and world through its in depth coverage of events ideas and cultures\nFrom the ... Cooper foundation commemorating Fred Cooper by supporting public radio programming that highlights issues including diversity racism equality anti Semitism and sexism\nAnd from the William T grant foundation that W T grant foundation dot org\nIt's MORNING EDITION from NPR News I'm Noel King I'm David Draine if you have trouble sleeping will join the club and we all might be interested in a new study that suggests people with insomnia might find relief in a mobile phone app\nThere are many sleep apps out there but as NPR's Rhitu Chatterjee reports scientists say some apps are better than others\nTry searching for sleep apnea phone and you likely come up with a long list to get a sense of which apps people like to use we all start audience on social media and got nearly a hundred responses welcome to science giant around [noise] that's a popular part cost Christina ... Michigan depends on it\nUsing this pod cast um I I think each one is like maybe twenty minutes and I very rarely make it all the way through\nMendez peach piecing from Santa Barbara California who's had insomnia since high school she's been using an app called in Cape for about four months\nStarts with a woman kind of telling you to relax and instructing your breathing\nAnd find\nThe things that it used to take her for hours to fall asleep now it only takes her about twenty minutes [laughter] but most of these apps and ... doing to treat the underlying insomnia streets and on a clinical psychologist and sleep researcher at Northwestern university\nThese type of apps that are really more trying to give people relax [noise] it's usually not a very stable unsustainable delusion\nThat because they don't address the reasons why people struggle with sleep like stress anxiety or bad sleep habits\nThe most effective treatment he says is a form of talk therapy called cognitive behavioral therapy for insomnia or C. B. T. I. [noise] it helps people understand the biology of sleep and why their own habits and behaviors might be messing with it\nIs you modify Samir behaviors you can actually work better with the way your brain regulates we'd been way\nCBP I'd give people tools and tips to change those behaviors for example if someone has kept up in bed by anxiety it suggests catching a warning time during the day this therapy also helps people sleep more efficiently say by spending less time in bed and getting out of bed if they can't fall asleep\nAn important part of the media is to teach people about what's going to give you confidence in him being able to sleep again is to follow these rules so that from a night tonight basis they're much more likely to be sleep you\nKnow people can get CBC I'd directly on their mobile phones through a handful of apps and studies have shown that these apps\nExample if someone has kept up in bed by anxiety suggest scheduling a warning time during the day this therapy also helps people sleep more efficiently say by spending less time in bed and getting out of bed if they can't fall asleep\nAn important part of the media is to teach people that what's going to give you confidence in him being able to sleep again is to follow these rules so that from a night tonight basis they're much more likely to be sleep you\nKnow people can get to the beach I directly on their mobile phones through a handful of apps and studies have shown that these apps are effective one is called sleep you\nIn sleepy oh it's like an avatar of a of a real therapist was walking a patient through that process\nOwn was a consultant for the team that develops sleep you although he has no ongoing financial interest in the product he was also the co author on a recent study which participants reported that the insomnia symptoms an overall quality of life improved after using the app\nNo CBP I asked aren't widely available and wildly cost less than ... posts in therapy that can be pricey at twenty six week subscription of one called shuts high\nCosts hundred and forty nine dollars but there is one free app developed by the Veterans Administration and its cold\nCBP I coach John ... is a psychiatry at Harvard Medical school he recommends it to his patients anyone can access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people don't stick with them\nThat's why he says if you find something you like you that if you find something that works I think that's always a good first up the next step he says is to talk to you Dr insomnia is a complex disorder and it's sometimes called by underlying medical conditions that are easily treatable\nBut sites he says keeping your ducked informed might get some extra motivation to stick to an up and make sure you always get a good night's sleep read the tragedy NPR News\n[noise] All right we know that giving your mental mussels a workout can help keep your brain sharp as you get older the question is what does that work out look like is it crossword puzzles is computer games to find out NPR's Jon Hamilton talked to a brain scientist about her own approach to mental fitness\nJessica Lange bounds interest in brain health is professional and personal\nMy grandfather was diagnosed with my ... when I was in graduate school and getting my PHD\nYou went on to develop Alzheimer's and link them began to ask herself a question\nHow can I in my career help ensure that we are suffering from that disease when we reached an age\nToday ... is associate director of the Alzheimer's prevention initiative at the ... year old timers Institute in Phoenix and she firmly believes that staying mentally active is good for your brain but ... says she's not focusing on any single activity\nJust sitting down and getting to know go isn't probably going to be the one key thing that's going to prevent you from developing Alzheimer's disease\n... says playing a puzzle game where one of those commercial brain games is like exercising just one muscle in your body that muscle will get stronger but your overall fitness isn't going to change\nMy gums says the brain training programs used in research studies are more promising and more strenuous they're hard a few years ago lend bomb was part of a groundbreaking study on brain training about twenty eight hundred people age sixty five an older spent more than five weeks doing exercises that tested memory reasoning and speed\nBumps says they helped a bit\nThey delay the onset of cognitive impairment they keep your brain working at the same level longer\nCan haircut people who did not receive the same kind of training intervention\nLying down says it's unclear what\n... says the brain training programs used in research studies are more promising and more strenuous they're hard a few years ago lend bomb was part of a groundbreaking study on brain training about twenty eight hundred people age sixty five an older spent more than five weeks doing exercises that tested memory reasoning and speed\nBumps says they helped a bit\nFake delay the onset of caught in the event paramedic keep your brain working at the same level longer can haircut people who did not received that same kind of training intervention\nLying down says it's unclear whether brain training can also prevent Alzheimer's so I asked her whether she uses a cognitive training program\nI don't actually I think my dad is mighty and they kind of training\nShe's not being flip it like a lot of people laying bomb has a job that requires intense thinking problem solving and constant learning\nShe also has kids a family and friends which means the social areas of her brain get a daily workout ... says mental exercises maybe most useful for people who are out of the workforce and more isolated and she has some advice for anyone looking for a way to keep their brain healthy\nIf you like hot Europe had little get them to try something new and trying something new and that brings you enjoyment key don't do it if you don't like Jon Hamilton NPR News [noise]\nSupport for your health comes from exact science of suffering color guard for average risk adults over fifty non invasive colon cancer screening tests that can be used at home by prescription omit information at home with our pets dot com [noise]\nFacebook it still assessing the fallout from the latest ethic hack\nIn which at least fifty million user accounts were compromised we heard about it because in order to comply with Europe new data privacy law the company has to make hacks public\nWithin Seventy two hours of discovering them a California privacy law if it's an acted it's written would go even further and allow consumers to sue and potentially collect enormous damage it\nFor exactly the kind of data breach or natural fell ... it's with the digital advocacy group the Electronic Frontier foundation\nThey don't want to entertain the possibility that they would be liable to individuals for doing some sort of harm from all the data they collect\nEarly this summer a who's who in tech attended a high level private meeting in San Francisco organized by the information technology industry council\nAccording to two people with knowledge of the meeting it was there that Facebook's top lobbyist Joe caplin warned the executive about the threat to California privacy law posed to all of them\nIt's a California law spread to other states it said it would present an even bigger problem than Europe's privacy law to companies have decided to weigh in before new laws start coming in from all fronts again privacy advocate fell ...\nYou have just as your data broker law from Vermont inundating back even further the state of Illinois has a biometric law that ah the book has opposed and has been trying to amend\nThe warning at the San Francisco meaning sparked an industry wide effort to not just getting behind federal privacy legislation but to actually write it\nAnd while there's no one document that lays out to proposal yet according to two people familiar with the process the working draft so far include two things\nAnd the first uh preemption clause that would essentially override any privacy laws ... states bike paths\nAnd the second in agreement that enforcement at the law be left to the Federal Trade commission aerial Sachs Johnson the advocacy group commonsense media since that while the FTC is a watchdog it's not a very aggressive one so I don't know what the FTC can do besides\nBut to actually write it and while there's no one document that lays out to proposal yet according to two people familiar with the process the working draft so far in cruel to think\nThe first uh preemption clause that would essentially override any privacy laws ... states bypass\nAnd the second in agreement that enforcement at the law be left to the Federal Trade commission aerial Sachs Johnson the advocacy group commonsense media since that well the FTC is a watchdog it's not a very aggressive one\nSo I don't know what the FTC can do besides like put out guides or try to go after people for violating statements that they made and that privacy policy is\nMore than a decade from now we may look back and do this past year the watershed with respect to the issue of consumer data privacy late last month officials from apple Amazon\nEighteen ... testified before the Senate Commerce Committee about privacy and the need for a new federal law\nA yes or no question for each of you would your company support federal legislation to preempt inconsistency privacy laws\nAnd all the executives said they would\nBe a senator and yes yes senator senator we were ... companies\nAre working the other end of Pennsylvania Avenue is Well Google CEO soon DARPA chai was at the White House just recently and Trump economic adviser Larry Kudlow announced last week that tech executives would be back for a big meeting later in\nThe month we're going to have a little conference president will preside over it we will have the big Internet companies big social media companies\nA reporter at the White House at Kudlow if the invitation list would include ... players like Facebook\nGoogle and Twitter cuts on nodded and said that's our hope Dina Temple Raston NPR News [noise]\n\nLater this afternoon on all things considered Philadelphia has opened a nonprofit that's planning what may be the first supervised injection site in the country you can listen by asking your smart speaker to play NPR or your local member station by name usually program from our our [noise]\nEvery form of life on our planet procedure connected with the human beings in the scheme\nOf action is here and this is the pulse of the planet\n\nIn Lyons is one of the chiefs of the Onondaga County ... veterans and visiting this causes of the people who have been one place for a long time\nTo calm the very essence of of where they live and they become very much a part of it because they depend upon the diversity of life around the plant centuries our community they need one another\nYou cannot take one without damaging the community changing insects and frogs for\nFish there are the pendant upon one another there was a chain that occurs and so if you're going to interfere with that then you're going to change something you've made changes very dramatic\nProblem with human beings as they don't really understand how their activities like a ring in the water from a pebble thrown into a still pond as you're watching the rings circle out those ring\nMove out into the future so when we have a sure noble of Boulder and upon hardly have the burning of oil and to wait for older and upon and all of our activities like raindrops\nOn the pond themselves they're affected the future so people have to think in those\n[noise]\nThe rings in the water from a pebble thrown into still pond as you're watching the rings circle out those ring\nMove out into the future so when we have a ... that's a Boulder and upon where we have this burning of the oil and to wait that's a folder and upon and all of our activities like raindrops\nOn the pond themselves they're affecting the future so people have to think in those terms [noise]\n\nJust kind of a serious illnesses celebration you want to hear more check out\nOur pond yes I mean that you and this is the pulse of the plan [noise]\nMillions of us grew up with Mr Rogers on PBS and now to celebrate the fiftieth anniversary of Mr Rogers neighborhoods WB I and the greater ... valley United Way and the daily item\nInvite you to the movie won't you be my neighbor Tuesday act overnight sixty I'm In the capital cedar Lewis bird it's free first come first served free small popcorn and drinks entered win\nPrizes from WBFO asked again on or Mr Rogers by bringing a sweater to be donated to community aid October nine with W. V. I. A.\nSupport for NPR comes from the station and from the any each case the foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nThis is MORNING EDITION from NPR News good morning I'm David Greene and I'm Noel King\nThe UN's international the UN's inter governmental panel on climate change or IPC see is that with a landmark and worrying new report\nIt called for urgent action to get climate change under control and warned of dire consequences if we fail Jim ski is the co chair of the PCC working group and he's a professor at imperial college London He's\nWith us now from South Korea where this report was released a ...\nA good morning\nThe timeline in this report is really sobering can you talk about what you found\nYeah I mean the what we were off ... off to do by governments was to produce a report on so to homework questions one was what would be the impacts of global warming of one and a half degrees compared with global warming if two degrees and then the second part of it was what\nYou would need to do to get down emissions and what kind of changes to society technology would be needed to achieve the kind of go\nOn you know there's a very ... to ... messages out of it one is there are big difference in terms of the impacts of climate change at one point five and two degrees on the other one is that we really need quite radical changes to the amount of emissions we have globally a on what basically we\nCan't wait to a to F we wait too long the goal of one point five degrees would cost beyond reach may I ask how long is too long\nWell uh the the the um the pledges that country's made off to the POTUS agreement three years ago stretched to twenty fifty conned we really need a ... in the time and there's a very clear message to the pledges that countries may ... made or not enough if we just full of these pledges we don't try to\nJust to the amount of emissions we have globally a\nAnd basically we can't wait to a to F we ate wait too long the goal of one point five degrees would cost beyond reach may I ask how long is too long\nWell the the the um\nThe pledges that country's made off to the powder scream and three years ago stretched to twenty fifty since ... we really need action in the time and there's a very clear message pledges that countries may have made or not enough\nIf we just follow these pledges we don't try to something like three degrees warming no the one point five degrees that government sauce the Silicon Valley\nSo we we need more than than what has been agreed upon more than than the nations that have set goals aimed at limiting warming of the planet and had had said I I mean are you hopeful that that's going to happen\nWell it it's really up to the government to me this report started with the government's they invited the scientists to tell them about this because the policy agreement said we're going to\nPursue efforts towards one point five degrees and all that we can do scientists just present them with the evidence and the ... if that's what you want to do this is Walter employs on the report does indeed have very strong message I mean we you know given the evidence available we couldn't\nPull our punches and the messages it needs really really radical changes in terms of emissions reduction if you're going to avoid all the climate change impacts that go with war may be on one point five degrees\nAt very briefly in the minute or so we have left what the difference one point five degrees in two degrees don't sound like a like a very ... it doesn't sound like there's a big difference between the two um why should for one point five degrees\nThe the the the the reason that the ... the ... we started in the pre industrial period in the middle of the nineteenth century and doctors where we started from we've got to one one degree today we're looking at one and a half degrees where the\nThis is MORNING EDITION from NPR News I'm David Greene\nAnd I'm Noel King\nThis has W. V. I. eighty nine point nine of em W. B. I. H. D. one scratch and Wilkes Barre have golden ... point seven Evan Williams sport W. TI eighty eight point three ... Mansfield\nW. P. I. U. Ninety One point five and ... and ... how to universities W to ask you a point on FM Stevens grove we have a translator in ... three point five\nWhere your arts and information station listener supported public radio W. V. I.\nS.\n[noise] shoo [noise] to the game when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book\nOn the next fresh air we talked with his son Adam Cohen who wrote the introduction and I'm also produced you want it darker the album his father recorded shortly before his death join us [noise]\nIt's evening at six after all things considered on W. V. I Am a\nGood morning after meeting Kim Jong ... secretary of state Mike Pompeo said significant progress has been made toward an agreement for North Korea to give up its nuclear weapons on MORNING EDITION from NPR News [noise]\nIt sounds like the two countries are also working on a second meeting between Kim and President Trump and Noel King\nAnd I'm David Greene America's top diplomat and moved on to China things were a little frosty there\nMorning after meeting Kim Jong ... secretary of state Mike Pompeo said significant progress has been made toward an agreement for North Korea to give up nuclear weapons on MORNING EDITION from NPR News [noise]\nIt sounds like the two countries are also working on a second meeting between the Kim and President Trump Noel King\nAnd I'm David Greene America's top diplomat and moved on to China things were a little frosty there are things were afraid more this hour has two journalists been punished for their work prominent columnist was criticized Pakistan's government is charged with reason Saudi columnist who's been tough on that government has gone missing\nIn Turkey Turkish officials say he may have been murdered in Saudi Arabia\nIs Monday or over a directly to Jesse Jackson fern Seventy seven years of\nThe news is next\nLive from NPR News in Washington ... secretary of state Mike Pompeo is claiming progress after holding talks with North Korean leader Kim Jong on NPR on young but as NPR's Anthony Kuhn reports from Beijing and pale is now in China where frictions between the U.S and China are on display\nForeign secretary ... accused the U.S an escalating trade disputes with China\nHarming its interests in relation to Taiwan and making baseless accusations against China's domestic and foreign policy Pompeo expressed his disagreement ... points\nPompeo was upbeat though about his meeting on Sunday with Kim Jong when he said he had made progress on setting up a second summit between him and President Trump although no danger location is yet been announced\nNorth Korean state media meanwhile reported that Kim was optimistic because he and President Trump have what Kim called deep confidence in each other Anthony Kuhn NPR News Beijing\nRomania is effort to ban same sex marriage in its constitution has failed after not enough voters turned out for a two day referendum Joanna Kakissis reports from book arrest\nConservative groups backed by the Romanian Orthodox church wanted to change the constitution to define marriage as between a man in a woman\nBut their effort failed when only twenty percent of voters cast ballots and they choose a referendum\nBoycotted that they cheered when the low turnout was announced an Janelle a Villanova sees hope for her country those same sex marriage he's still banned in Romania civil code she said transgender woman\nWas my dream to be in my column for who I Am\nBut she admits that will take time and the country that only decriminalized homosexuality Seventeen years ago for NPR News I'm Joanna Kakissis in ... Romania\nThis year's winners of the Nobel Prize in economics are William nor house and Paul Romer for their work on climate change and innovation this is the last Nobel Prize announced this year President Trump has a full schedule of campaign rallies this week NPR's Tamara Keith reports\nPresident Trump is well aware of the history the president's party typically takes a beating and the first midterm after he takes office Trump brings it up but just about every campaign rally saying he hopes to prove that every one wrong one more time\nRepublican House and a Republican Senate where all\nThis week Trump has for rallies planned with stops in Iowa Ohio Pennsylvania and Kentucky each rally winds up being a combination of touting his own accomplishments bashing potential twenty twenty opponents and boosting his favorite candidates for\nAnd the first midterm after he takes office Trump brings it up but just about every campaign rally saying he hopes to prove every one wrong one more time\nWhile acting Republican House and a Republican Senate where all\nThis week Trump has for rallies planned with stops in Iowa Ohio Pennsylvania and Kentucky each rally winds up being a combination of touting his own accomplishments bashing potential twenty twenty opponents\nAnd boosting his favorite candidates for Congress and governor camera Keith NPR News\nYou're listening to NPR News from Washington\nFederal and state authorities are investigating one of the worst traffic crashes in the U.S in years it happens Saturday in upstate New York a limousine on the way to a birthday party failed to stop at an intersection and crashed killing all Eighteen people in the vehicle into pedestrians\nThe crash occurred in ... New York about forty miles west of Albany [noise]\nThe unemployment rate is at its lowest level in nearly fifty years which means American retailers are might have to try a little harder to fill their seasonal hiring slots this year NPR ... reports\nThe beginning of autumn brings changing colors the start of the school year and a wave of temporary hires as retailers get ready for the holiday crush fifty five thousand workers for FedEx eighty thousand at Macy's target is looking for a hundred and twenty thousand\nBut unemployment is low and American workers have more options than they used to\nConsulting firm challenger gray and Christmas says companies need to offer either competitive compensation or perks\nAmazon recently announced all its employees including temps and seasonal workers will make at least Fifteen dollars an hour and target is giving new hires the chance to win a five hundred dollar gift card ... NPR News\nMeteorologists are keeping track of tropical storm Michael off Mexico's Yucatan Peninsula it's Tom sustained Windsor now it's sixty miles per hour as it moved towards the U.S Gulf of Mexico\nIs expected to strengthen into a category one hurricane as soon as the night and reach the Florida Panhandle later in the week\nI'm neuron NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs coverage options and more information can be found at farmers dot com and the ... e Casey foundation\n\nPartly sunny today with the thirty percent chance of showers and thunderstorms highs in the upper seventies mostly clouded this evening with a thirty percent chance of showers lows in the lower sixties\nPartly sunny on Tuesday with highs and the upper seventies partly cloudy on Tuesday night with Lowes in the lower sixties and mostly sunny on Wednesday with highs and the upper seventies you're listening to W.\nVi eighty nine point nine FM your arts and information station\nPulmonary disease is one of the most common medical conditions in the world millions of people in the United states suffer\nFrom dump form of lung disease including asthma bronchitis emphysema\nSmoking genetics and infections are long factor\nFor why someone they develop water more disease\nOn the call a doctor\nWednesday night at seven thirty on W. V. I. A. T. V.\nProgramming on WB I is made possible by our members and by Bucknell lifelong learning Institute W. V. I. T. V. in ...\nForm of lung disease including asthma bronchitis as his name\nSmoking genetic affection factor\nFor why someone they develop water more disease\nOn the call a doctor\nWednesday night at seven thirty on WB I a TV\nProgramming on WB I is made possible by our members and by Bucknell lifelong learning Institute\nW. V. I. T. V. invites you to vote for your favorite novels in the great American read\nOn nationwide celebration of America's Best loved books Tuesday nights at eight pm on W. V. I. T. V. throughout October more information is available at W. V. I. A. dot org slash great American read\nThis is MORNING EDITION from NPR News good morning I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC on Sunday secretary of state Mike Pompeo met with North Korea's leader Kim Jong on in the north Korean capital both sides say there has been some success in working toward nuclear disarmament and in setting up a second summit between Kim and President Trump\nBut then pump pales trip ended on what seems like a down notes because he stopped to talk to officials in Beijing\nAnd tensions between the U.S and China came up NPR's Anthony Kuhn is with me now from Beijing Anthony good morning Noel let's start at the beginning pump ailing Kim say they made some progress in this meeting what do they what do they mean by progress\nWell they mean may seem to have narrowed down options as far as the time and date a time and place for the talks are concerned we don't know if they're going to be before or after November midterm elections in the U.S\nA Pompeo said that you know if they can get this meeting together they expect real progress at a second summit and Kim Jong one speaking to North Korean state media was even more upbeat he called his talks with Pompeo productive and wonderful\nThis is NPR News support comes from the times tribute for over a century the times Tribune in Scranton assert northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times Tribune was there for you and ... news dot com\nAside from the latest news thoughtful coverage and balanced perspectives we also bring you\nA five week chess championship tournament in a prison\nThis tale starts with a fish called the ... news of the highest went viral and the school was inundated with donated pumpkins that\nCame from two black holes colliding\nIt's called all things considered\nFor reasons listen every afternoon\nWeekdays at four weekends at five [noise]\nLike what you see on WB I Do enjoy fine programs like pull dark knows that we're nature of your kids love watching the antics of Elmo on Sesame Street enjoy the science kid are curious George how 'bout shows like called the doctor Pennsylvania pogo or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org and thank you for your support for W. vi\nW. V. I. H. P. and ...\nWeekends at five [noise]\nLike what you see on WB I Do enjoy fine programs like pull dark nova or nature be your kids love watching the ethics of Elmo on Sesame Street enjoy the science cuter curious George how 'bout shows like call the doctor Pennsylvania vulgar or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs have W. V. I. A. dot org and thank you for your support for W. vi\nSupporting W ... PNC wealth management their team of financial professionals who is committed to helping you achieve your financial goals for information contact Kathy done some your five seven oh eight to six for six three zero\n\n... today with a thirty percent chance of showers and thunderstorms highs and the upper seventies mostly cloudy this evening with a thirty percent chance of showers lows in the lower sixties\nBerlusconi on Tuesday with ties in the upper seventies partly Claudio Tuesday night with losing the lower sixties and mostly Saudi on Wednesday with hides in the upper seventies you're\nListening to W. vi eighty nine point nine FM your arts and information station\nSupport for NPR comes from the station and from CBS with the circus American Experience explores the rise and fall of the big top and its influence on entertainment in the U. S. that circus uh tonight event premieres tonight at nine eight central on PBS\nFrom cancer treatment centers of America working to outsmart can search for the use of genomic testing to profile each individual cancer and revealed possible treatment options learn more about precision cancer treatment that Cancer Center dot com\nAnd from gobble ... company that delivered semi corrupt meals to be finished at home in Fifteen minutes with one pan gobble sous chefs do the prep work like chopping and marinating this week's menu is at ... dot com slash NPR\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King one of Pakistan's most prominent reporters was in court today in a case that involves allegations of treason and sedition\nThe reporters name is Cyril al meta and the cases raising concerns about freedom of speech in Pakistan and ... is with me now from Islamabad idea\nHigh that so tell us about cereal or a meta who is he so he's a\nColumnist for new type of call dawn it's an English language newspaper and it's widely read by Pakistan's liberal elites and omega made a name for himself two years ago when he will set a story\nThat suggested that Pakistan's powerful military had been preventing the government from cracking down on militant groups based in the country Pakistan's broadly accused of harboring these Islamic militant groups that have conducted cross border attacks into neighboring India and Afghanistan\nAnd there was a lot of fallout from the article ... which briefly banned from traveling outside the country the information minister to resign\nAnd even though the newspaper said it stood by the story it had to publish a lengthy a denial by the prime minister's office\nSays that bombshell report is is how he came to public attention but that's not the story that he's in court over right\nNow so he published another story in may this yeah and it was an interview with the former prime minister and in that article the prime minister himself bought up the Mumbai attacks of two thousand the night and you might remember these well particularly gruesome attack say targeted hotels and a Jewish center in India a parent's killed dozens of people\nAnd the prime minister suggested that\nPublish a lengthy a denial by the prime minister's office are so that bombshell report is is how it came to public attention but that's not the story that he's in court over right\nNow so he published another story in may this year and it was an interview with the former prime minister and in that article the prime minister himself bought up the Mumbai attacks of two thousand a night and you might remember these are particularly gruesome attacks I taught at hotels and a Jewish center in India ah terrorists killed dozens of people\nAnd the prime minister suggested that the attackers had been based in Pakistan now this is a controversial abroad in Pakistan eat\nCreated all sorts of outrage and a lawyer filed a petition to one of the high court hit and what essentially he's asking the high court to do is what are the government to investigate the former prime minister for treason\nAnd he's talking the high court to investigate I'll meet up for something called a ... which is basically that I'll meet I somehow involved in these alleged treason\nAnd I spoke to the lawyer his name is ... uh yesterday and he said if he can find a if only found guilty of ... he'll pursue more serious charges of edition against him and that carries a hefty ...\nI mean look I think it's easy to forget that Pakistan has been known for a pretty robust press a how journalists they're feeling about all this\nThere's a lot of concern right now because it comes in the context of a growing cracked down on freedom of speech and Pakistan\nI spoke to I'm On my ... she's the deputy director of full Amnesty International in South Asia and he would go through a reporter here for many years before that and he says now is probably the worst it's been for years they've been attacks on journalists that has been precious it's I'm drawn to leave the country\nAnd um broadcasters have had the outlet scrambled drawing itself the newspaper had its distribution prevented in parts of the country and so you have this case is being viewed with a lot of concern and Mari\nVery briefly I mean it was in court today what happened\nSo um it was quite cold case they are now being another hearing set for later this month on me that had briefly um being banned again from leaving the country and arrest warrant had been issued against him those are both being dropped but the case against him continue NPR's da ...\nThank you so much right in Romania an effort to ban same sex marriage has failed this was a two day referendum that would of changed the constitution and it's socially conservative country in the European Union\nBut not enough voters showed up over the weekend that invalidated any result this is a slap in the face for the Romanian Orthodox church which has warned that western liberals and you are forcing their values on the east here's director kisses for ...\nMany churchgoers in this post communist said he retired engineer Maurice to fish opposes same sex marriage I don't like mentally as men and women was warmer\nIt's not enough for him that same sex marriages already banned in Romania civil code\nA problem I is that going on that code can be change he says so we need something more leaders of the ... or ... to ... was the defining marriage as between a man and a woman saving the traditional Romanian family\nArch deacon unit ... says it's about children and as he every child has to be raised and\nWarn me so I'm really like from Margaret in the fall like all the children that have been born\nThe church strongly backed an amendment to Romania constitution it was pushed by conservative activists were advised by liberty council a U.S organization\nSimilarly an Orthodox Church ... voters that defining marriage as between a man and a woman saving the traditional Romanian family arch deacon unit ... says it's about children and as he every child has the right to be raised in\nMore than a new family like from mother and the phone's like all the children that have ever being born\nThe church strongly backed an amendment to Romanians constitution it was pushed by conservative activists were advised by liberty council a U.S organization which opposes same sex marriage\nThey're behind all these movements in Eastern Europe a\nLot this key runs mosaic and oh gee Beatty rights group and Duke arrest\nWhat we're witnessing is this sort of alliance between these extremist American groups and local indigenous conservative groups trying to push forward their agenda [noise]\nTwenty four year old medical dance with friends at a boycott party in the ... club before the vote\nI came here because I'm a lesbian [noise]\nAnd I don't think that we shouldn't be for Steve that the people that are plaguing our guys they they think that we are some sort of a general raised that we are sick they are trying to legalize homophobia Romanian\nCommunications consultant ... ... is bisexual he's noticed the rise and homophobia and the weeks before\nThe vote ever to start to ever express any views that were pro as you'd be the what's fair game for hate that [noise]\nThey're going to become the\nSunday walking the dog Oscar at the park near Butte arrests opera house\nIf this referendum doesn't pets I Would remember this day is the second most important thing in my life after twenty to December Nineteen eighty nine when the communist regime from\nRomania did not decriminalize homosexuality until two thousand\nOne and only then because it was a precondition for entering the European Union Mario's to fish the retired engineer blamed the EU for pushing liberal values on his country and they can offer that quote the name of my daughter lives in the Netherlands now he says and we fight every day over same sex marriage [noise]\nAcross town a gay club broke out in the years when the TV news declared the marriage with a friend that his dad\nHe would often just saying you know Saudi Arabia was never this repressive it was it was a tough but it was um bearable and\nHe was still often I'm Still go pick a almost an advisory role he really wanted to guide print the really really loved Saudi Arabia I think and he just he just wanted to write he didn't want to be a dissident who didn't want to be an opposition figure he just wanted to be free to express what he thought was his\nVersion of the truth about Saudi Arabia's past present and future and I think that's what just really hard to deal with uh\n[noise] and um [noise] can hope for the best um turn into mobile opinions under for the Washington Post and it's been working with ... who's editor um thank you so much for your time\n[noise] thank you David [noise] we're going to go now to a tragic story from upstate New York twenty people are dead after a limousine crash this weekend Lucas Willard of member station WAMC has the story\nOn Saturday afternoon and SUVs stretch limousine was carrying Eighteen people through the rural town of ... theory about forty miles west of Albany the two thousand one Ford Excursion limo went through\nUm chemical hope for the best um ... mobile opinions editor for the Washington Post and has been working with ... his editor I'm thank you so much for your time\n[noise] thank you at [noise] we're going to go now to a tragic story from upstate New York twenty people are dead after a limousine crash this weekend Lucas Willard of member station WAMC has a story\nOn Saturday afternoon an SUV stretch limousine was carrying Eighteen people through the rural town of skill Harry about forty miles west of Albany the two thousand one Ford Excursion limo went through the intersection of New York state roots thirty and thirty a\nNational Transportation Safety Board chair Robert Sumwalt said the crash is one of the worst he's seen in his twelve years\nOn the NTSB for this is the most deadly transportation accident in this country since February of two thousand and not\nA two thousand nine plane crash near buffalo killed fifty people state police first deputy superintendent Christopher Fiore told reporters Sunday afternoon all of those killed in ... Harry we're adults\nLimousine traveled across the intersection into a parking lot instructed to thousands Fifteen Toyota Islander that was an occupied and parts juvenile standing nearby\nWere also struck and killed\nEveryone inside the limo was killed\nAs a Sunday afternoon state police had not released the identities of the victims pending notification of the families the names had started to emerge Amy Dunlop Johnson who identified herself as a cousin of two people inside the limo said the group was celebrating\nMy cousin's wife um that's going to be cutting turkey on October [noise] um how old where um they are going online or you have winery to health\nOfficials are still trying to figure out what caused the accident\n... town supervisor Alan ... drove by the scene on his way to church Sunday Morning he called the intersection at the bottom of a steep hill dangerous ... says the town has complained to the state Transportation Department about safety issues\nAbout four years ago they finally band tractor trailer from the uh the site and wrote ... thirty coming down because at least two instances where the tractor trailers lost their breaks and went through the intersection\nThe accident is sure to have a lasting impact on the farming community of about three thousand\nIt it's a it's just a tragedy it really is it's incredible number of people for the small\nCommunity vigil is planned for Tuesday evening NTSB staff will remain in go Harry throughout the week for NPR News I'm Lucas Willard in Albany New York [noise]\n\n\nThis is NPR News\nProgramming on W. vi is made possible by our members and by Pennsylvania College of technology thinking about college hoping\nTo land a great job after earning your degree think Pennsylvania College of technology with one hundred plus bachelor\nAn associate's degrees an exciting career fields industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work [noise]\nThis we broadcasted the San Francisco says he's the director Michael Thomas brings out all the colors of the orchestra\nThink Pennsylvania College of technology with one hundred plus bachelor an associate's degrees and exciting career field industry standard labs in uh Ninety six percent graduation placement rate pen college is perfect for hands on learners visit P. C. T. dot edu to learn about Penn college degrees that work [noise]\nOn this week's broadcast the San Francisco says he's the director Michael ... almost brings out all the colors of the orchestra\nAnd whole section to get a chance to shine visually and collectively by march on Mozart's and Samuel Adams next time with the San Francisco says [noise]\nSunday afternoon at two on W. B. I. A. F. out\n[noise] Ninety second snacks [noise]\n\nHi there I'm saying Maynard wild African elephants may breaks sleep records for mammals new data shows that they seem to get by just fine on about two hours of shut eye and night much of that snoozing takes place while they're standing up\nThe animals live down to sleep only once every three or four nights trying to figure out how much wild elephants sleep just by watching them twenty four hours a day is tricky especially in the dark\nSo using electronic monitors on African elephants in the wild scientists have turned up some extreme behavior that to our average news is the least sleep recorded for any mammal species\nGame rangers familiar with wild African elephants had claimed that elephants almost never slept\nIn the new data seemed to now confirmed that they were right researchers implanted activity monitors similar to fitness trackers in the trunk of too wild elephants\nBoth were matriarch of their herds and she'll be national park in Botswana the electronic devices track the animals over about a month during that time the elephants average just two hours of sleep all day and what's more the elephants were able to skip a night's sleep without needing any extra naps the next day\nThe Ninety second naturalist into production of Cincinnati Public radio ... with support from Cincinnati Public radio member it could spread the good news at the natural world [noise]\nSupport for NPR comes from the station and from log me in makers of go to meeting a collaboration meeting platform that comes equipped with features to help people stay focused to get work done learn\nMore to go to meeting dot com from the main office of tourism offering travelers an opportunity to explore and discover their very own main thing to be inspired the original and be yourself at visit main dot com\nAnd from the ISI and the foundation at ISI MC foundation\nDot org this is MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning It's MORNING the winners of the Nobel Prize in economics were announced the prize will be split by two economists William North house and Paul Romer\nNick fountain from our planet money podcast is with me now to morning Nick happy ... before we get to the winters we should clarify something or I Know we will get emails from economists it's not actually the Nobel Prize in economics right\nYes uh I'm going to try to pronounce this right now it's the ... ... prize in economics scientists in memory of Alfred Nobel and that's for a bunch of political reasons but also because economics really wants to be known as a science and with this year's pick they went straight towards ...\nIt's interesting one of the economist William ignored house is known for talking about the economy and climate together\nRight he's an economist at Yale and he's been thinking about how ...\nEmail from a condom is it's not actually the Nobel Prize in economics right\nYes uh I'm going to try to pronounce this right now it's the spirit ... reeks bank prize in economics scientists in memory of Alfred Nobel and that's for a bunch of political reasons but also because economics really wants to be known as a science and with this year's pick they went straight towards ...\nIt's interesting when at the economist William Nord house is known for talking about the economy and climate together\nRight he's an economist at Yale and he's been thinking about how the economy interacts with the environment and climate for decades now this morning I called up Justin Wolfers he's an economics professor at the University of Michigan and he explained his work to me\nThe key in size is if you leave it alone he won't get good outcomes on the environmental side and the reason is simple every time you fire up your factory your thinking about your profits but at the same time you stink up my greenhouse gases\nAnd so north houses work uh is about how we need incentives to push us in the right direction like things like cap and trade for instance\nReally interesting choice and how that is Colin Powell room or what is he known for\nRight quick aside here Paul Romer works at NYU he got a couple of calls this morning but he did not answer them\nTwo phone calls this morning and I didn't answer either one because I thought it was some damn call so I I wasn't I wasn't expecting it deprives\n[laughter] anyways his work is about growth and why economies grow and and his question is will they grow forever and Justin Wolfers explained to me that his research says it's ideas that make economies grow\nOld in size is that the infrastructure to create a new ideas is the engine of economic growth\nDo need to pay attention to patents the number of scientists that are out there they're incentives to do science and as as long as we can keep generating new ideas we can get you ready because\nSo in both of these choices endured house in Rome or the Nobel Committee this year is saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\nAnd nicotine is worth noting the economics Nobel is celebrating it fifty year this year and yet only one woman has ever won the prize\nRight a lot of people thought that uh we might have another woman this year the only woman is Eleanor or oh strum ... she won the Nobel and two thousand nine and you know fifty years is a long time for a only one woman\nPetrou of federal Financial Analytics managing partner thank you very much thank you David [noise]\nThe structure of Eli vons inspired by some financial innovation developed to attract money to environmental sustainability project the marketplace morning report from eight PM American public media\nSupport comes from the artist so open house weekend I'm ... twenty four artist exhibiting a variety of unique our treasures at twenty locations studios are open ten AM to six PM October ... through the eight five seven to seven eight two or three three to four artist tour dot com\nSupport comes from European import in business for over twenty five years specializing in the sale in service of pre own Volkswagen Audi BMWs and other European cars located between ... and ... more information at your imports stop is this was\nV. I. eighty nine point nine ... and W. B. Y. U. eighty nine points that whatever\nArtist exhibiting a variety of unique our treasures of twenty locations studios are open ten AM to six PM October ... through the eight five seven oh two seven eight two or three three to four artist tour dot com\nSupport comes from European import in business for over twenty five years specializing in the sale and service a ... Volkswagen Audi BMWs and other European cars located between ... and we'll rich more information at your import stop it\nBut this was W. V. I. eighty nine point nine a pound W. B. I. H. D. one scratch and ... and W. B. Y. U. eighty nine point seven after Williamsport WTO eighty eight point three if that means ... Mansfield WPRI you Ninety One point five FM home Ira township ... how to universities W to ask you a be a point on FM Stevens grow\nWe have a translator in east Strasburg ... only three you're arts and information station listener supported public radio W. V. I. A.\n\nWho good morning Brett Kavanaugh is now it's a ... court justice there'll be a thermonuclear swearing in the night we will look forward to how the newest justice could change the course coming up on MORNING edition\nSeven other women is Georgia galvanize energy among both Republicans and Democrats as we move towards the mid term elections I'm David Greene\nAnd I'm Noel King the UN's Intergovernmental Panel on climate change says we are running out of time it's calling for urgent action to get climate change under control and some people who suffered from insomnia are turning to their phones and sleep asking for help any scientific study looks at what works and what it is Monday October\n... singer songwriter and showman Bruno Mars thirty three years old today\nAnd the news is next\nLive from NPR News in Washington ... the Nobel Committee today awarded it's twenty Eighteen prize for economics it's being shared by William Nord house of Yale and Paul Romer of New York university there work focuses on climate change innovation\nThe UN led Intergovernmental Panel on climate change is warning disastrous effects of climate change are happening now co chair Jim ... says the world must take immediate action\nGiven the evidence available we couldn't cooler punches and the messages it needs really really radical changes in terms of emissions reduction if you're going to avoid all the climate change impacts that go with warming beyond one point five degrees\nThat's one point five Celsius scientists say limiting increases to that number would reduce flooding and gives people time to adapt to climate change\nIndonesian authorities now say more than Nineteen hundred people died in an earthquake and tsunami ten days ago they say thousands are still missing and feared dead the quake measured seven point five and hit the small city of Palo unsettled lays the island\nA politician from the far right when it commanding lead in Brazil's presidential election yesterday but as NPR's Philip Reeves reports he failed to secure an outright victory and the first round setting up the runoff election\nVeteran congressman and retired army captain shy about NATO needed both in fifty percent of the valley votes to win the presidency of Latin America's largest democracy outright he came close was just under forty seven percent after almost ... votes were counted\nIn Rio is supposed to celebrate it as if you want but this contest will not go to a runoff which also NATO will face financial ... from a leftist workers' party\nThe standards for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption that elections opened deep divisions\nAnd veteran congressman and retired army captain shy of also NATO needed more than fifty percent of the votes to win the presidency of Latin America's largest democracy outright he came close was just on the forty seven percent after almost ... votes will count\n[noise] in Rio is supposed to celebrate it as if you put this contest go to a runoff which also NATO will face financial ... from a leftist workers' party\nThe stand in for Brazil's former president Luiz ... Lula da Silva who's in prison for corruption\nThat elections opened deep divisions of Brazil between those who think also NATO will combat rampant crime and corruption and others alienated by his and ... and racist comments of his admiration for Brazil's polish military dictatorship Philip Reeves NPR News reddish in into\nThe Trump Administration is preparing to publish propose rules that could denying green cards to immigrants they use a wide range of public benefits NPR's Joel Rose reports the rules are set to be published this week\nThe Trump Administration says it's trying to ensure that immigrants are self sufficient by enforcing a longstanding law that immigrants cannot be a quote public charge\nUnder the proposed rules legal immigrants could still use public benefits like food assistance and medicate but for the first time that would count against them if they try to get a green card or bring relatives to join them in the u._s.\nPublic health officials worry that many immigrants will be afraid to use any kind of public assistance at all which could hurt both immigrants and public health\nWants to the proposal is formally published in the federal register the public will have sixty days to comment Joel Rose NPR News\nThis is NPR News\nSecretary of state Mike Pompeo says he and North Korean leader Kim Jong on made significant progress towards an agreement for North Korea to give up its nuclear weapons\nHe said he expects more results after another summit between Kim and President Trump which is not yet been scheduled Pompeo spoke today in Seoul after meeting with Kim in Pyongyang yesterday on pay and then left for Beijing for talks with Chinese officials\nTurkey's president says he's personally following the investigation into the disappearance of a journalist from the Saudi conflict is tumble last week\nNPR's Peter Kenyon reports Ankara is demanding answers from Riyadh about let's say ... the Lucy\n... speaking to reporters in our current president ... said he still hopeful for what he called a positive outcome for ... who entered the Saudi consulate last Tuesday and hasn't been seen since Saudi officials deny any wrongdoing and say they're just as eager to learn what happened to your show as anyone else\nTurkish police are pursuing two possibilities that showed me who left the king dome last year for the U.S was kidnapped and spirited out of the country or that he was killed in his body disposed of\nPeter Kenyon NPR News Istanbul\nA referendum against same sex marriage failed in Romania this weekend it wouldn't change the constitution to define marriage as being only between a man and a woman and needed at least thirty percent of eligible voters to cast ballots that only twenty four percent did\nSame sex marriage is still prohibited by statute some conservative groups had urged the constitution be amended to prevent same sex unions should the lobby change in the future I'm neurons NPR News\nSupport for NPR comes from Viking dedicated to bringing the travel are closer to the destination Vikings new custom built ocean fleet offers a small ship experience with overran do state rooms and short excursion in their report Viking Cruises dot com and the Emmy each case the foundation\n\nStarted today with a thirty percent chance of showers and thunderstorms highs in the upper seventies most cloudy to the evening with a thirty percent chance\nSame sex unions should the lobby change in the future I'm neuron NPR News\nSupport for NPR comes from Viking dedicated to bringing the travel are closer to the destination Vikings new custom built ocean fleet offers a small ship experience with overran do state rooms and short excursions and report Viking Cruises dot com and the ... foundation\n\nProbably site today with a thirty percent chance of showers and thunderstorms highs in the upper seventies mostly cloudy this evening with a thirty percent chance of showers lows in the lower sixties\nPartly sunny on Tuesday with ties in the upper seventies partly Claudia Tuesday night with losing the lower sixties and mostly sunny on Wednesday with hides in the upper seventies you're listening to W. vi eighty nine point nine FM your hearts and information station\nSupport comes from the times tribute for over a century the times Tribune in Scranton ... northeast Pennsylvania with news and information that defines our community and charts our history as it unfolds delivered to your home or your mobile device the times Tribune is there for you and the EPA news dot com\n[noise] this is Ari Shapiro host of all things considered by the time you turn on our show in the afternoon you've probably seen headlines maybe you've read it as we'd you might have heard the news cast so we want to tell you more than just what's happening we want to give you reasons why things are happening the context around what's happening\nWe want to tell you something that will stick with you while you're driving home or making dinner all things considered listen every afternoon [noise]\nWeekdays that four weekends at five on W. V. I asked him\nSupport for vi comes from United Methodist homes offering short term rehab following an injury or surgery delivering expert care every step of the way at our Wesley village campus more information at United Methodist homes dot org\nIt's MORNING EDITION from NPR News I'm Noel King in Washington DC\nAnd I'm David Greene in Culver City California Brett Kavanaugh was sworn in to the U.S Supreme Court over the weekend ending a toxic confirmation process\nThe fifty to forty eight Senate vote to confirm with one of the closest in history and it felt largely along party lines with only one Republican voting against Kevin on one Democrat voting in his favor\nNow there's debate over how cabinet appointment might impact the mid term elections in November and joining us now is mark ... water he's a former special assistant\nTo President Trump and also an advisor to the president's twenty twenty campaign he joins us from our New York studios I missed a lot of good morning good morning thanks for having me well thanks for coming on so I Know President Trump is going to be holding rallies in support of Republican candidates throughout this this month as we get closer to the election how will justice cabinet appointment play into his message I think it\nIs I think it'd be a major motivator for Republicans as another promise made promise kept the president ran in twenty sixteen or on delivering and nominating conservative people who who believe in the constitution and the rule of law the way it's written so it will be seen as a major victory amongst Republicans\nYesterday I'm Senator Susan Collins Republican of Maine defended her vote in favor of Kavanaugh's nomination and said this on CNN about the Nineteen Seventy three Supreme Court case that legalized abortion\n\nD\nD ... this is NPR News support comes from books university you may have a bachelor's degree in one field but are thinking about pursuing a nursing degree what the Wilkes University accelerated BSN a bachelor's degree can be heard was one year a fulltime study more Wilkes dot edu slash accelerated DSM\nEvery hour of every day the programming you've come to ...\nRow [noise]\n\n[noise]\nThis is NPR News support comes from books university you may have a bachelor's degree in one field that are thinking about pursuing a nursing degree what the Wilkes University accelerated BSN a bachelor's degree can be yours was one year a fulltime study more Wilkes dot edu slash accelerated BSN\nEvery hour of every day the programming you've come to expect on WB I it's paid for through the financial supportive listeners like you thanks so much for your membership learn more about membership and sign up today\nAt W. V. I. A. dot org [noise]\nOtherwise that around the Capitol Hill university Sunday October fourteenth the UPS\nEnjoying a concert by the chamber orchestra\nThat deal onto the Canadian ensemble has known for its interpretation music in the seventeenth Eighteenth century\nBut also regularly delved into the repertoire the nineteenth and twentieth century\nThe ones that are program includes works by George\nAs well as Philip Glass [noise]\nJoining the orchestra will be redound counter tenor happening while on\nLive you don't want to do that by Jon Cohen Sunday afternoon October fourteenth the two for more information Bucknell dot edu slash white [noise]\nNobody celebrates hundreds of regional art and cultural organizations for details of many more events check the w._b. I ate marching calendar and catch up on arching podcast W. V. I. dot org slash arts listening for art scene when Ericka funky weekday mornings after the news at eleven on WB I Am\n\nPartly sunny today with a thirty percent chance of showers and thunderstorms highs in the upper seventies\nMostly cloudy this evening with a thirty percent chance of showers lows in the lower sixties partly sunny on Tuesday with hides in the upper seventies partly cloudy on Tuesday night with Lowes new lower sixties and mostly sunny on Wednesday with highs and the upper seventies you're listening to W.\nVi eighty nine point nine FM your arts and information station\nSupport for NPR comes from that station and from universal pictures presenting the new film first demand from Damien ... director of la la land and whiplash and starring Ryan Gosling and Claire fully in theaters and IMAX friday\nFrom logged me in makers of go to meeting proud sponsor of how I built this entrepreneur summit taking place in San Francisco at the ... center October sixteenth [noise] more about the Senate at NPR dot org slash summit\nFrom Jones Day an integrated partnerships collaboratively providing legal services for more than a century forty three offices five continents serving clients as one from worldwide learn more at Jones Day dot com\nAnd from the any Casey foundation [noise] It's MORNING EDITION from NPR\nNews I'm well king and I'm David Greene if you have trouble sleeping will join the club and we all might be interested in a new study that suggests people with insomnia might find relief in a mobile phone app\nThere are many sleep apps out there but as NPR's Rhitu Chatterjee reports scientists say some apps are better than others\nTry searching for sleep apnea phone and you like he come up with a long list to get a sense of which apps people like to use\nWe Oct ... audience on social media and got nearly a hundred responses welcome to science joins for ground that's a popular part cost Christina ... Michigan depends on it using this pod cast um I think he\nSo I'm near might find relief in a mobile phone app\nThere are many sleep apps out there but as NPR's Rhitu Chatterjee reports scientists say some apps are better than others\nTry searching for sleep out from your phone and you're likely come up with a long list to get a sense of which apps people like to use we October audience on social media and got nearly a hundred responses welcome strange around [noise] that's a popular part cost Christina ... Michigan depends on it\nUsing this pod cast um I I think each one is like maybe twenty minutes and I very rarely make it all the way through\n... from Santa Barbara California who's had insomnia since high school she's been using an app called ... for about four months\nStarts with a woman kind of telling you to relax and instructing your breathing\nAnd [noise]\nThe things that it used to take four hours to fall asleep now it only takes her about twenty minutes [laughter] but most of these apps and pot cops don't treat the underlying insomnia says gee it's an on a clinical psychologist and sleep researcher at Northwestern university\nYou sort of Arabs that are really more trying to get people relax [noise] it's usually not a very stable and sustainable solution\nThat's because they don't address the reasons why people struggle with sleep like stress anxiety or bad sleep habits\nThe most effective treatment he says it's a form of talk therapy called cognitive behavioral therapy for insomnia or C. B. T. I. [noise] it helps people understand the biology of sleep and why their own habits and behaviors might be messing with it\nIs you modify from your behaviors you can actually work better with the way your brain regulates we'd been way\nCBP I'd give people tools and tips to change those behaviors for example if someone has kept up in bed by anxiety it suggest scheduling a warning time during the day this therapy also helps people sleep more efficiently say by spending less time in bed and getting out of bed if they can't fall asleep\nAn important part of the media is a teach people that were going to give you confidence in to be able to sleep again is to follow these rules so that from a night tonight bases they're much more likely to be sweep you\nKnow people can get to the beach I directly on their mobile phones to a handful of apps and studies have shown that these apps are effective one is called sleep you\nIn sleepy oh it was like an avatar of a of a real therapist who's walking a patient through that process\nWas a consultant for the team that develops sleep you although he has no ongoing financial interest in the product he was also the co author on a recent study in which participants reported that their insomnia symptoms an overall quality of life improved off to using the app\nNo CBP I asked aren't widely available and while they cost less than ... therapy that can be pricey at twenty six weeks subscription of one called shut die\nCosts hundred and forty nine dollars but there is one free app developed by the veteran got ... and it's called\nCBP I coach John ... is a psychiatrist at Harvard Medical school he recommends it to his patients anyone to access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people don't stick with them\nThat's why he says if you find something you like use it if you find something that works I think that's always a good first stop the next step he says is to talk to you Dr insomnia is a complex disorder and it's sometimes called by underlying medical conditions that are easily treatable but sites he says keeping your ...\nCoach John ... is a psychiatrist at Harvard Medical school he recommends it to his patients anyone can access that you don't have to be a veteran however he cautions that these apps may not work for everybody one of the problems is that people don't stick with them\nThat's why he says if you find something you like use it if you find something that works I think that's always a good first up the next step he says is to talk to you Dr insomnia is a complex and saw that and it's sometimes caused by underlying medical conditions that are easily treatable\nBut sites he says keeping your ducked informed might get some extra motivation to stick to an up and make sure you always get a good night's sleep retracted ... NPR News [noise]\nAll right we know that giving your mental mussels a workout can help keep your brain sharp as you get older the question is what does that work out look like is it crossword puzzles is computer games\nTo find out NPR's Jon Hamilton talked to a brain scientist about her own approach to mental fitness Jessica Lange bounds interest in brain health is professional and personal\nMy grandfather was diagnosed with my ... when I was in graduate school getting my PHD\nYou went on to develop Alzheimer's and laying down began to ask yourself a question\nHow can I end my career help ensure that we aren't suffering from the disease only reach the age\nToday ... is associate director of the Alzheimer's prevention initiative at the banner Alzheimer's Institute in Phoenix and she firmly believes that staying mentally active is good for your brain but ... says she's not focusing on any single activity\nJust sitting down and getting to know go isn't probably going to be the one key thing that's going to prevent you from developing Alzheimer's disease\n... says playing a puzzle game where one of those commercial brain games is like exercising just one muscle in your body that muscle will get stronger but your overall fitness isn't going to change\nMy gums says the brain training programs used in research studies are more promising and more strenuous they're hard a few years ago lend bomb was part of a groundbreaking study on brain training about twenty eight hundred people age sixty five an older spent more than five weeks doing exercises that tested memory reasoning and speed\nBumps says they helped a bit\nThey delay the onset of cognitive impairment they keep your brain working at the same level longer can haircut people who did not read the the same kind of training intervention\nLying down says it's unclear whether brain training can also prevent Alzheimer's so I asked her whether she uses a cognitive training program\nI don't actually I think my job is mighty like kind of training\nShe's not being flip it like a lot of people laying bomb has a job that requires intense thinking problem solving and constant learning\n[noise] she also has kids of family and friends which means the social areas of her brain get a daily workout ... says mental exercises maybe most useful for people who are out of the workforce and more isolated and she has some advice for anyone looking for a way to keep their brain healthy\nIf you like crossword puzzles didn't try something new and trying something new and that brings you enjoyment is key don't do it if you don't like Jon Hamilton NPR News [noise]\nSupport for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests used at home by prescription over information it hold our pest dot com [noise]\nThe port for your health comes from exact science is offering color guard for average risk adults over fifty a non invasive colon cancer screening tests that can be used at home by prescription omit information at home with our pets dot com [noise]\nIn which at least fifty million user accounts were compromised we heard about it because in order to comply with Europe's new data privacy law the company has to make hacks public within Seventy two hours of discovering them a California privacy law\nIf it's not that it's written would go even further and allow consumers to sue and potentially collect enormous damages\nFor exactly the kinds of data breach Ernesto fell ... with the digital advocacy group the Electronic Frontier foundation\nThey don't want to entertain the possibility that they would be liable to individuals for doing some sort of harm from all the data they collect\nEarly this summer a who's who in tech attended a high level private meeting in San Francisco organized by the information technology industry council according to two people with knowledge of the meeting\nIt was there that Facebook's top lobbyist Joe Papp and warned the executives about the threat to California privacy law posed to all of them\nIs a California law spread to other states said it would present an even bigger problem than Europe's privacy law so companies have to sided to weigh in before new laws start coming in from all fronts again privacy advocate fell ...\nYou have just this year a day to broker law from Vermont and dating back even further the state of Illinois has a biometric law that a Facebook has opposed and has been trying to amend\nThe warning at the San Francisco meeting sparked an industry wide effort to not just getting behind federal privacy legislation but to actually write it and while there's no one document that lays out to proposal yet according to two people familiar with the process the working draft so far include two things\nAnd the first uh preemption clause that would essentially override any privacy laws ... states bike paths\nAnd the second in agreement that enforcement at the law be left to the Federal Trade commission aerial Sachs Johnson of the advocacy group commonsense media since that while the FTC is a watchdog it's not a very aggressive one\nSo I don't know what the FTC can do besides I put out guides or try to go after people for violating statements that they made and that privacy policies\nMore than a decade from now we may look back and view this past year as a watershed with respect to the issue of consumer data privacy\nLate last month officials from apple Amazon Eighteen ... testified before the Senate Commerce Committee about privacy and the need for a new federal law\nA yes or no question for each of you would your company support federal legislation to preempt inconsistency privacy laws\nAnd all the executives said they would be a senator and yes yes senator senator we tend to companies are working the other end of Pennsylvania Avenue is well\nGoogle CEOs soon DARPA chai which at the White House just recently and Trump economic adviser Larry Kudlow announced last week that ... would be back for a big meeting later in the month\nRent out a little conference president will preside over we will have the big Internet companies big social media companies\nA reporter at the White House ... if the invitation list would include ... players like Facebook Google and Twitter Cutler nodded\nAnd said that's our hope Dina Temple Raston NPR News [noise]\n[noise] [noise]\nThat ... would be back for a big meeting later in the month\nWe're going to have a little conference the president will preside over it we will have the big Internet companies big social media companies\nA reporter at the White House asked ... if the invitation which would include big tech players like Facebook Google and Twitter cut the nodded and said that's our hope Dina Temple Raston NPR News [noise]\nWe [noise] we have [noise]\n[noise] [noise]\nThis is NPR News support for WBAI it comes from ... County Community college now and rolling for the winter and spring semesters with more than one hundred degrees the area's lowest tuition and easy transfer to four year colleges loser and we'll get you ready for success more information at loser dot edu usually program from our our [noise]\nEvery form of life on our planet is connected with the human beings in the ...\nElection this year and this is the pulse of the planet [noise]\nForeign\nLine which is one of the chiefs of the owner ... council six nations you like the federal see him in his cautious of people who have been in one place for a long time\nTo calm the very essence of of where they live and they become very much a part of it because they depend upon the diversity of life around the plants and trees are community they need one another\nYou cannot take one without damaging the community changing community insects any frogs for him and\nFish they are the pendant upon one another there was a chain that occurs and so if you're going to interfere with that then you're going to change something and you made changes very dramatically\nAs problem with human beings as they don't really understand how their activities like a ring in the water from a federal thrown into a still pond as you watch the rings circle out those ring\nTo move out into the future so when we have a ... that's a Boulder and upon when we have this burning of the oil and to wait for the older and upon and all of our activities like raindrops [noise]\nOn the pond himself human activity they're affecting the future so people have to think in those terms [noise]\n\nJust kind of a serious illness or celebration you want to hear more\nCheck out our pond yes and this is the pulse of the plan\n[noise] support comes from done more drug store your environmentally friendly pharmacy they recycle Ninety percent of all their plastic containers and they're now using biodegradable prescription box probably serving the community since two thousand three on Blakely street and done more five seven zero three four to eight four to seven\nSupport for NPR comes from this station and from PBS with the circuits American Experience explored the rise and fall of the big top and its influence on entertainment and the U. S. circuits that tonight event premieres tonight at nine eight central on PBS\nAnd from it less than a collaboration software company powering teams around the world committed to providing the tools and practices to help teams plan track build and work better together more at\nFour to seven\nSupport for NPR comes from the station and from PBS with the circuits American Experience explores the rise and fall of the big top and its influence on entertainment and the U. S. but circuits so tonight event premieres tonight at nine eight central on PBS\nAnd from a ... a collaboration software company powering teams around the world committed to providing the tools and practices to help teams\nPlan track build and work better together more at ... dot com\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Noel King one of Pakistan's most prominent reporters was in court today in a case that involves allegations of treason and sedition\nThe reporters name is ... el meta and the cases raising concerns about freedom of speech in Pakistan and here's the deed is with me now from Islamabad idea\nHigh that so tell us about cereal or a meter who is he\nSo he's a columnist for new type of cold dawn it's an English language newspaper and it's widely read by Pakistan's liberal elites and omega made a name for himself two years ago when he will set a story\nThat suggested that Pakistan's powerful military had been preventing the government from cracking down on militant groups based in the country Pakistan's broadly accused of harboring these Islamic militant groups that have conducted cross border attacks into neighboring India and Afghanistan\nAnd there was a lot of fallout from that article\nOn NATO was briefly banned from traveling outside the country the information minister to resign and even though the newspapers that it stood by the story it had to publish a lengthy a denial by the prime minister's office\nAre so that bombshell report is is how he came to public attention but that's not the story that he's in court over right\nNow so he published another story in may this year and it was an interview with the former prime minister and in that article the prime minister himself bought up the Mumbai attacks of two thousand and night and you might remember these well particularly gruesome attacks I targeted hotels and a Jewish center in India ah terrorists killed dozens of people\nAnd the prime minister suggested that the attackers had been based in Pakistan now this is a controversial abroad in Pakistan eat created all sorts of outrage and a lawyer filed a petition to one of the high court hit\nAnd what essentially he's off in the high court to do is what are the government to investigate the former prime minister for treason\nAnd he's also asking the high court to investigate I'll meet up with something called a ... which is basically that I'll meet I somehow involved in these alleged treason\nAnd I spoke to the lawyer his name is ... uh yesterday and he said if he can find if only to is found guilty of ... he'll puts you more serious charges of edition against him and that carries a hefty ...\nI mean look I think it's easy to forget that Pakistan has been known for a pretty robust press a how journalists they're feeling about all\nThere's a lot of concern right now because it's the context of a growing crack down on freedom of speech impacts Don\nI spoke to um ... she's the deputy director I'm full Amnesty International and South Asia and he was also a reporter here for many years before that and he says now is probably the worst it's been for years they've been attacks on journalists they've been pressure for some journalists to leave the country\nAnd um broadcast that have had the outlet scrambled during itself the newspaper had its distribution prevented in parts of the country\nContext of a growing cracked down on freedom of speech impacts Don\nI spoke to I'm On my ... she's the deputy director for Amnesty International in South Asia and even though the reporter has so many years before that and he says now is probably the worst it's been for years\nThey've been attacks on journalists they stay in precious assumption to leave the country and um broadcasters have had the outlet scrambled doing itself the newspaper had its distribution prevented in ... for the country\nEighty proud supporter of independence thought whether that's on line over the air or in a bottle more it Sierra Nevada dot com [noise]\nAnd this is MORNING EDITION from NPR News I'm David Greene and I'm Noel King\nThis has W. B. I. eighty nine point nine of them that will be vi HD one scratch and Wilkes Barre hazel didn't W. B. Y. U. eighty nine points that I thought Williamsport WTO idiot going three of ... Mansfield WTO you nutty one point five FM Palmyra township ... universities WFSU eighty eight point not have them see them grow\nAnd translators do they do want to age ... there'll be to eight nine ... son very there'll be too there were seven eight Williamsport and they'll be to have an eight eight oh wells borough listener supported public radio [noise]\nThe Williamsport simply conducted by ... it'll Stein opens October sixteenth with works by Racine each ... and Brahms\nGrammy nominated in chart topping violinist Caroline Golding plays Chuck ... violin concerto [noise]\nWilliamsport symphony October sixteenth a community are cheddar five seven zero\nThree to six twenty four twenty four or Williamsport symphony dot org sponsors who'd our capital group at my come in college who\nGood morning after meeting Kim Jong secretary of state Mike Pompeo says significant progress has been made toward an agreement for North Korea to give up its nuclear weapons on MORNING EDITION from NPR News [noise]\nIt sounds like the two countries are also working on a second meeting between Kim and President Trump I Know well king\nAnd I'm David Greene America's top diplomat and moved on to China things were a little frosty there are things to trade more this hour having to journalists been punished for their work prominent columnist has criticized Pakistan's government is charged with a reason to Saudi columnist who's been tough on that government has gone missing\nIn Turkey Turkish officials say he may have been murdered in Saudi on\nMonday October a civil rights leader Jesse Jackson turned Seventy seven years old\nThe news is next\nLive from NPR News in Washington I'm neuron an international panel of climate change scientist says preventing as experts single degree of heat and the next few decades could mean the difference between life and death\nMost nations have set a goal of reducing global warming to nine tenths of a degree Fahrenheit the Intergovernmental Panel on climate change says that world leaders could make that one point eight degrees half as many people would suffer from lack of water and it would be substantially fewer heat waves downpours and drought\nThis year's Nobel Prize for economics is going to two economists to been working on climate change and innovation their Young University has William Nord house and Paul Romer of New York university NPR's Nick fountain and had more\nIn both of these choices endured house in Rome or the Nobel Committee this year it saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\nNPR's Nick fountain reporting Central America has been battered by heavy rains and flooding from tropical storm Michael at least a dozen people have died in thousands are homeless Maria Martin reports\nCasualties from torrential rains have affected a large portion of Central America including a Salvador Nicaragua in Costa Rica\nHonduras has been hardest hit over five thousand reported homeless in that country and at least six people have died including a young mother and her two children in what the mother flooding and landslides are awesome\nIs really important NPR's Nick fountain reporting Central America has been battered by heavy rains and flooding from tropical storm Michael at least a dozen people have died in thousands are homeless Maria Martin reports\nCasualties from torrential rains has affected a large portion of Central America including a Salvador Nicaragua in Costa Rica\nBut Honduras has been hardest hit over five thousand reported homeless in that country and at least six people have died including a young mother and her two children in what the mother flooding and landslides are also reported as the storm hits north hitting Mexico and Cuba before making its way to the U.S Gulf Coast\nHeavy rains in the region are expected to continue through the week in what a mother there's another potential natural disaster brewing as at least a dozen moderate eruptions have been reported of the volcano costs cycle which laughter uptick in June\nFor NPR News I'm ... and\nIt could strengthen into a hurricane as early as tonight as it moves into the Gulf of Mexico it could hit the Florida Panhandle later this week\nMission manager and continue to search for signs of life from NASA's six wheeled Martian rover called opportunity as NPR's Joe Palca reports the rover has been heard from since\nJune the rover shut itself down in June after a dust storm on Mars prevented it solar panels from generating power\nThe skies over the rover remained turban for weeks but now they're clear enough that the rover should be able to generate enough electricity to wake up and phone home so far it hasn't in addition to waiting for the rover to contact earth mission managers are suffering the rover with commands in case it's awake and waiting to hear from them\nAgain so far nothing although mission scientists will be sad if this was the end for the rover they say it had an amazing run lasting fourteen years longer than its original mission had called for Joe Palca NPR News\nThis is NPR News\nThe visuals are being held across Bulgaria today to honor journalists Victoria Marron over her body was found over the weekend near the Dan River she had been raped beaten and strangled marrying over was the third journalists killed in the European Union in the past twelve months\nTurkey is asking Saudi Arabia for permission to search the Saudi consulate in Istanbul Saudi journalist Jim ... has been missing since last Tuesday when he went to the consulate for paperwork to marry his Turkish fiance Turkish officials suspect the writer was killed there Saudi officials deny that\nThe major league baseball playoffs continue with three games today NPR's Tom Goldman reports Houston and the LA Dodgers have a chance to clinch their opening playoff series\nThe Houston Astros are looking very much like baseball's defending champions they leave the Cleveland Indians two games to none and their best three at a five game series and pitching is a big reason why I asked for his pictures of held Cleveland batters to six hits in sixty at bats\nThe Indians are hoping the series shifting back to Cleveland helps them get their all fence going\nThe Dodgers also can advance to the next round with a win over Atlanta\nBut the Braves grab the momentum Sunday beating LA with tubing home runs a grand slam by twenty year old Ronald attuned your junior and a solo home run by Freddie Freeman that turned out to be the winning run finally arch rivals Boston and New York resume their series today tied at one game each Tom Goldman NPR News\nAnd flip on Cleveland beat Baltimore and overtime yesterday this is the brown second when the year after ending last season with no wins at all I'm neuron NPR News in Washington\nFor NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag him drop\nAttuned your junior and a solo home run by Freddie Freeman that turned out to be the winning run finally arch rivals Boston and New York resume their series today tied at one game each Tom Goldman NPR News\nAnd flip on Cleveland beat Baltimore and overtime yesterday this is the brown second when this year after ending last season with no one's at all I'm neuron NPR News in Washington\nSupport for NPR comes from a campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email tablets a drag him drop email editor and twenty four seven customer service more at a campaign monitor dot com and Americans for the arts\n\nPartly sunny today with a thirty percent chance of showers and thunderstorms highs in the upper seventies mostly cloudy this evening with a thirty percent chance of showers lows in the lower sixties\nPartly sunny on Tuesday with highs and the upper seventies partly cloudy on Tuesday night with Lowes and the lower sixties and mostly sunny on Wednesday with hides in the upper seventies you're listening to W. vi eighty nine point nine FM your arts and information station\nW vi listeners just like you provide the financial support that enables us to provide such fine programming thanks for your membership if you're not yet I'm ever go to W. V. I. dot org to learn more and become a member today\nMonday evening at seven on WB I ate all that jazz it's appropriate mostly\nReturn recording than mixed bags starts a day to day sampling of new releases including one from singer songwriter John Will\nBe a dream was good\nPetty thirtieth world pizza and nine a segment recalling no singing allowed with a collective instrumental music [noise] this is George ... joined us Monday evening starting at seven on WPN [noise]\nSupporting ... the pine senior living in a large sum of providing solutions for seniors wishing to remain independent when eating some assistance with daily living the pines locally owned managed by its hands on care focused on the beach resident applied to collect some a dot com or our family cares for you or is\nThis is MORNING EDITION from NPR News good morning I'm David Greene in Culver City California\nAnd I'm Noel King in Washington DC on Sunday secretary of state Mike Pompeo met with North Korea's leader Kim Jong on in the north Korean capital both sides say there has been some success in working toward nuclear disarmament and setting up a second ... between Kim and President Trump\nBut then pump pales trip ended on what seems like a down note because he stopped to talk to officials in Beijing\nAnd tensions between the U.S and China came up NPR's Anthony Kuhn is with me now from Beijing Anthony good morning Noel All right let's start at the beginning pump ailing Kim said they made some progress in this meeting what do they what they mean by progress\nWell they mean they seem to have narrowed down options as far as the time and date a time and place for the talks are concerned we don't know if they're going to be before after November midterm elections in the U.S\nA campaign said that you know if they can get this meeting together they expect real progress at a second summit and Kim Jong one speaking to North Korean state media was even more upbeat he called his talks with Pompeo productive in wonderful\nSome it and Kim Jong one speaking to North Korean state media was even more upbeat he called his talks with Pompeo productive in wonderful\nThis is NPR News\nThis October to Williamsport community has invited to a reading by pure surprise winner and author Michael ... at like coming college amongst the most famous works all the hours a home at the end of the world flesh and blood and the snow queen\nCunningham so politic body of work has received the highest critical praise making him one of the most in demand authors of the nation the reading will take place October seventeenth at seven thirty PM like coming colleges Mary Lindsey welts on his whole more information can be found at W. W. W. dot like combing dot edu slashed calendar\n[noise] when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book\nOn the next fresh air we talk with his son Adam Cohen who wrote the introduction Adam also produced you want it darker the album his father recorded shortly before his death join us [noise]\nThis evening at six after all things considered on WB I Am\n[noise] like\nWhat you see on WB IRA you enjoy fine programs like pull dark nova or nature be your kids love watching the antics of Elmo on Sesame Street enjoy sent the science kid are curious George how 'bout shows like call the doctor Pennsylvania vulgar or scholastic scrimmage\nWhatever the reason you watch we want you to know that you make it all possible become a member today and ensure the future of your favorite programs that W. V. I. A. dot org\nAnd thank you for your support for W. vi\n\n... today with a thirty percent chance of showers and thunderstorms highs in the upper seventies most cloudy this evening with the thirty percent chance of showers lows in the lower sixties\nPartly sunny on Tuesday with hides in the upper seventies partly Claudia Tuesday night with losing the lower sixties and mostly sunny on Wednesday with highs and the upper seventies you're listening to W.\nVi eighty nine point nine FM your arts and information station\nSupport for NPR comes from the station and from Amazon Prime video presenting the return of the man in the high capital where America's history is under siege but the resistance rises to fight for the world they want the new season is now streaming on prime video\nFrom zoom zoom offers cloud video conferencing online meetings and video conference room solution and one platform featuring digital video and audio with screen sharing account registration and more at zoom dot U. S.\nAnd from babble like European made language learning program Bible teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nIs MORNING EDITION from NPR News I'm David Greene and I'm Noel King good morning It's MORNING the winners of the Nobel Prize in economics were announced the prize will be split by two economists William annoyed house and Paul Romer\nNick fountain from our planet money podcast is with me now to morning Nick happy ... Nobel day before we get to the winters we should clarify something or I Know we will get emails from a condom is it's not actually the Nobel Prize in economics\nOn line at B. A. B. B. E. L. dot com\nThis is MORNING EDITION from NPR News I'm David\nGreene and I'm Noel King good morning It's MORNING the winners of the Nobel Prize in economics were announced the prize will be split by two economists William Nord house and Paul Romer\nNick fountain from our planet money podcast is with me now to morning Nick happy ... Nobel day before we get to the winters we should clarify something or I Know we will get emails from a condom is it's not actually the Nobel Prize in economics right\nYes uh I'm gonna try to pronounce this right now it's the spare ... reeks bank prize an economic sciences in memory of Alfred Nobel\nIt's interesting one of the economist William ignored house is known for talking about the economy and climate together\nRight he's an economist at Yale and he's been thinking about how the economy interacts with the environment and climate for decades now this morning I called up Justin Wolfers he's an economics professor at the University of Michigan and he explained his work to me\nThe key inside is if you leave it alone he won't get good outcomes on the environment and the reason is simple every time you fire up your factory your thinking about your profits but at the same time you stink it on my greenhouse gases\nAnd so north houses work or is about how we need incentives to push us in the right direction like things like cap and trade for instance\nReally interesting choice and how that is Colin Powell Rome or what is he known for\nRight quick aside here Paul Romer works at NYU he got a couple of calls this morning but he did not answer them\nYour two phone calls this morning and I didn't answer either warm because I thought it was some damn call so I I wasn't I wasn't expecting it deprives\n[laughter] anyways his work is about growth and why economies grow and and his question is will they grow forever and Justin Wolfers explained to me that his research says it's ideas that make economies grow\nOld in size is that the infrastructure of creating new ideas is the engine of economic growth\nDonate attention to patents the number of scientists that are out there incentives to do science and as long as we can kick generating new ideas of generosity because\nSo in both of these choices endured house in Rome or the Nobel Committee this year and saying this work about making government stink about how to make have the right incentives for people to do things that we want them to do to prevent climate change to continue to grow that stuff is really important\nAt nicotine is worth noting the economics Nobel is celebrating its fiftieth year this year and yet only one woman has ever won the prize\nRight a lot of people thought that we might have another woman this year the only woman is Eleanor ... she won the Nobel and two thousand nine you know fifty years is a long time for only one woman\nNPR's Nick fountain from our planet money team Nick thanks so much thanks though\nSupport for Planet Money comes from Hitchcock's insurance offering the Hitchcock cyber readiness report to provide businesses with perspective on cyber security threats and how to protect against them learn more at age ... dot com slash cybersecurity\nIn Romania an effort to ban same sex marriage has failed this was a two day referendum that would have changed the constitution and the socially conservative country in the European Union\nBut not enough voters showed up over the weekend and that invalidated any result this is a slap in the face for the Romanian Orthodox church which has warned that western liberals in the ... you are forcing their value\nTalk cyber readiness report to provide businesses with perspectives on cyber security threats and how to protect against them learn more at H. I. C. O. X. dot com slash cyber security\nRight in Romania an effort to ban same sex marriage has failed this was a two day referendum that would have changed the constitution and it's socially conservative country in the European Union\nBut not enough voters showed up over the weekend that invalidated any result this is a slap in the face for the Romanian Orthodox church which has warned that western liberals and you are forcing their values on the east coast you want to get kisses for ...\nMany churchgoers in this post communist city retired engineer Maurice to fish opposes same sex marriage I don't like men who is man and woman was warmer\nIt's not enough for him that same sex marriage is already banned in Romania civil code\nA problem I is that going on that code can be changed he sat so we need something more leaders\nHave been lean Orthodox Church told voters that defining marriage as between a man and a woman he saving the traditional\nRomanian family arch deacon unit ... says it's about children and as he is every child has the right to be raised and born a new family like from mother in the ... like all the children that have ever been born\nThe church strongly backed an amendment to Romania its constitution it was pushed by conservative activists were advised by liberty council a U.S organization which opposes same sex marriage\nThey're behind oldies movement in Eastern Europe\nLaw Devinsky runs mosaic and oh gee Beatty rights group and ...\nWhat we're witnessing is this sort of alliance between these extremist American groups and local indigenous conservative groups trying to push forward their agenda [noise]\nTwenty four year old Eli medical dance with friends at a boycott party and the ... club before the vote\nI came here because I'm a lesbian\nAnd I don't think that we shouldn't be perceive that people that are plaguing our society they think that we are some sort of the general raised that we are sick they are trying to legalize homophobia\nCommunications consultant ... is a bisexual he's noticed a rising homophobia and the weeks before\nThe vote ever started ever express any views that were pro as you'd be the what's fair game for hate that [noise]\nThey're about to become the third one\nSunday walking the dog Oscar at the park near Boop arrests opera house\nGave this referendum doesn't pets I Would remember this day is the second most important thing in my life after twenty to December Nineteen eighty nine when the communist regime from\nRomania did not decriminalize homosexuality until two thousand\nOne and only then because it was a precondition for entering the European Union Mario's to fish the retired engineer blame the you for pushing liberal values on his country and they can offer that quote the name of my daughter lives in the Netherlands now he says and we fight every day over same sex marriage [noise]\nAcross town a gay club broke out in the years when the TV news declared the marriage referendum that\nSame sex marriage in Romania is still illegal\nBut tonight there was no change to the constitution for NPR News I'm Joanna Kakissis and book arrest Romania [noise]\nAcross town a gay club profound years when the TV news flared the marriage with a friend and then\nSame sex marriage in Romania is still illegal\nTonight there was no change to the constitution for NPR News I'm Joanna Kakissis in ... Romania [noise]\nYou're still often I'm Still go pick a fight or wrong you really want it to guide ... print the really really love that area I think and he just he just wanted to write he didn't want to be at this at anything like that the opposition figure he just wanted to be afraid to express what he thought with his\nVersion of the truth about that area is past present and future and I think that's what makes it hard um to deal with ah [noise]\n[noise] and um chemical hope for the best um turned into mobile opinions editor for the Washington Post and has been working with ... who's editor um thank you so much for your time\n[noise] thank you David [noise] we're going to go now to a tragic story from upstate New York twenty people are dead after a limousine crash this weekend Lucas Willard of member station WAMC has the story\nOn Saturday afternoon and SUVs stretch limousine was carrying Eighteen people through the rural town of skill Harry about forty miles west of Albany the two thousand one Ford Excursion limo went through the intersection of New York state roots thirty and thirty a\nNational Transportation Safety Board chair Robert Sumwalt said the crash is one of the worst he's seen in his twelve years on the NTSB for\nThis was the most deadly transportation accidents in this country since February of two thousand and not\nA two thousand nine plane crash near buffalo killed fifty people state police first deputy superintendent Christopher Fiore told reporters Sunday afternoon all of those killed in Harry we're adults\nLimousine traveled across the intersection into a parking lot instructed to thousands Fifteen Toyota Islander that was an occupied and parts juvenile standing nearby\nWere also struck and killed\nEveryone inside the limo was killed as a Sunday afternoon state police had not released the identities of the victims pending notification of the families the names had started to emerge Amy Dunlop Johnson who identified herself as a cousin of two people inside the limo said the group was celebrating\nMy cousin's wife I'm was going to be turning thirty huh and my family [noise] um how a where um they ... they were going online or you can winery to alec\nOfficials are still trying to figure out what caused the accident\nSky Harry town supervisor Ellen ... drove by the scene on his way to church Sunday Morning he called the intersection at the bottom of a steep hill dangerous Kevin ... says the town has complained to the state Transportation Department about safety issues\nAbout four years ago they finally band tractor trailer from the uh the sight rows route thirty coming down because at least two instances where tractor trailers lost their breaks and went through the intersection\nThe accident is sure to have a lasting impact on the farming community of about three thousand\nIt it's a it's just a tragedy it really is it's incredible\nThe scene on his way to church Sunday Morning he called the intersection at the bottom of a steep hill dangerous ... says the town has complained to the state Transportation Department about safety issues\nAbout four years ago they finally band tractor trailer from the uh the site wrote ... thirty coming down because at least two instances where it tractor trailers lost their breaks and went through the intersection\nThe accident is sure to have a lasting impact on the farming community of about three thousand\nIt it's a it's just a tragedy it really is it's incredible number of people hurts me this small\nCommunity vigil is planned for Tuesday evening NTSB staff will remain in school Harry throughout the week for NPR News I'm Lucas Willard in Albany New York\n[noise]\n[noise] [noise]\n[noise] this is NPR News support comes from the University of Scranton to understand all that Scranton has to offer visit the campus experienced the community with open house events Sunday October twenty first for Sunday November fourth see how one of America's premier colleges will open doors for you [noise]\nWe're having a listen to some quick ... different maybe slightly obscure musical selections on everybody knew this neat [noise] you're kidding you enjoying the sunshine era\nJoined view on uh Richie Saturday evening at eight on WB I Am\n[noise]\nNPR News classical jazz in contemporary music on WB I HD one more of the best programs public radio has to walk from WBAI H. D. too and continuous jazz from the ... channel on WB I HD three all online at W. B. I. dot org\n[noise] Ninety second snacks [noise]\n\nHi there I'm thing Maynard wild African elephants may breaks sleep records for mammals new data shows that they seem to get by just fine on about two hours of shut eye and night much of that snoozing takes place while they're standing up\nThe animals lie down to sleep only once every three or four nights trying to figure out how much wild elephants sleep just by watching them twenty four hours a day is tricky especially in the dark\nSo using electronic monitors on African elephants in the wild scientists have turned up some extreme behavior that to our average news is the least sleep recorded for any mammal species\nGame rangers the millionaire with wild African elephants had claimed that elephants almost never slept\nIn the new data seemed to now confirmed that they were right researchers implanted activity monitors similar to fitness trackers in the trunk of too wild elephants\nBoth for the matriarch of their herds and Toby national park in Botswana the electronic devices track the animals over about a month during that time the elephant average just two hours of sleep a day and what's more the elephants were able to skip at night sleep without needing any extra naps the next day\nIn Ninety second naturalistic the production of Cincinnati Public radio ... Cincinnati Public radio man very to extend the good news is the natural world [noise]\n\nSupport for NPR comes from the station and from the N E E Casey foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at eight\nTwo hours of sleep a day and what's more the elephants were able to skip a night's sleep without needing any extra naps the next day\nIn Ninety second naturalist production of Cincinnati Public radio ambition can view the support from Cincinnati Public radio member to spread the good news at the natural world [noise]\n\nSupport for NPR comes from the station and from the ... foundation developing solutions to support strong families and communities to help ensure a brighter future for America's children more information is available at H. E. C. S. dot org\nAnd from Carnegie Corporation of New York supporting innovations in education democratic engagement and the advancement of international peace and security more information is available online at Carnegie dot org\nIt's MORNING EDITION from NPR News I'm Noel King and I'm David Greene a politician from the far\nRight in Brazil nearly pulled off on historic victory yesterday a victory that would have changed the political landscape in Latin America\n... a retired army captain one by far the most votes in the country's presidential election and was just a few percentage points away from a first round victory last night his supporters though we're celebrating outside his house in Rio de Janeiro as if he had one [noise]\n\nIn fact there will now be a run off so he has not won at this point at least we're joined now from Rio de Janeiro by NPR's Philip Reeves morning Phil\nGood morning though how close was this it was quite close to when he needed to get both of them they just get more than fifty percent of the valid votes in fact he go forty six point two percent\nThat's much better than the polls had been saying on the remarkable performance given that he has no big party behind him he had very little access to TV advertising and\nHe spent three weeks of the campaign in hospital after being stabbed and severely injured at a political rally buddy full how specially on social media and now he's not a strong position to go on possibly when while he's in a strong position to win actually\nJust an amazing story I mean is it not only was campaigning from a hospital um doesn't have a party behind him as you say are really controversial figure writes a what's the appeal here\nWell there's a tremendous amount David of public anger in Brazil people have lost for the loss of faith in establishment politicians and this because the massive corruption investigation which has exposed gr often offer ethics scale and the highest places yeah\nThe countryside is was that the recession and it's come out of that but its economy still stagnant this epidemic of violent crime\nAnd both of NATO who's actually being in Congress for more than a quarter century has done a good job of positioning himself as an outsider and he's tapped in to this hunger for something radically different and that was obvious when you talk to people outside his house celebrating last night\nI mean listen to sue ... sixty two at a speech therapist\nBut I think that what I deal with this sound the sound\nBrazil needs to change she says it's it's in the hands of corrupt politicians and people are unhappy\nAnd and what both in our did very well was channel that frustration and anger towards his chief opponents which is the workers policy which was in government for most of the ... what what the time when all this bad stuff is what's happening so people are being willing to overlook Balkan hours record for the soldiers and they\nAnd racism and making homophobic remarks\nAnd also his oft expressed admiration for Brazil's past dictatorship [noise] so what happens\nNow that there's a runoff in and is he likely to win\nIt's in the hands of corrupt politicians and people are unhappy\nAnd and what both in our did very well was channel that frustration and anger towards his chief opponents which is the ... which was in government for most of the ... what what the time and all this bad stuff is what's happening so people are being willing to overlook Balkan hours record for the ...\nAnd racism and making homophobic remarks\nA dose of his often expressed admiration for Brazil's past dictatorship [noise]\nSo what happens now that there's a runoff in and is he likely to win it\nYeah it goes to a runoff on the twenty eighth of October this'll be between ... and ... who's the workers' party candidate he came in second\nHe's a former education minister and the former mayor of Sao paolo", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Williamsport", "day": "08"}