{"month": "10", "state": "CA", "station": "KEIB", "content": "Dreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio patriot data LA's preempted due to sports programming\n... I'd be will resume streaming audio at the conclusion of the game the fast is Katie I'd be in Los Angeles streaming audio patriot John LA's preempted due to sports programming K. E. R. I. V. evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming ... will resume streaming audio at the conclusion of the game\nAnd the best is ... I'd be Los Angeles streaming audio and patriot John LA's preempted due to sports programming\n... I'd be evil resume streaming audio at the conclusion of the game and\nThen this lady I be Los Angeles streaming audio patriot dot L. A. preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n\nIn this case I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nSki id will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... K. E. R. I. B. Los Angeles\nAre streaming audio patriot data LA's preempted due to sports programming\nGeeky id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriot dot allies preempted do the sports programming\nKatie id will resume streaming audio at the conclusion of the game [noise] best is K. E. I. B. Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIs Kay eat I'd be Los Angeles streaming audio patriot dot allies preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles streaming audio at patriot dot LA's preemptive pseudo sports programming Katie id will resume streaming audio at the conclusion of the game basses ... I'd be Los Angeles\nStreaming audio at patriot dot L. A. preempted due to sports programming Kiki id will resume streaming audio with the conclusion of the game\n... fans is K. E. I. B. Los Angeles and streaming audio patriot dot L. A. is freedom to do the sports programming\nKatie id will resume streaming audio a different conclusion of the game\nAnd the\nBest is Kay Ivey Los Angeles streaming audio and patriot dot L. A. is preempted due to force programming ... I'd be evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game is ... I'd be Los Angeles dreaming audio ex patriot dot L. A. is preempted due to sports programming the id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming can eat I'd be evil resumes streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\nThis case the I'd be\nLos Angeles streaming audio patriot dot LA's reinstitute a sports programming king he I be evil resumes streaming audio at the conclusion of the game and\nThere is ... I'd be Los Angeles is streaming audio and patriots dot L. A. is preempted due to sports programming geeky I be will resume streaming audio at the conclusion of the game and fast is K. E. I. B.\nLos Angeles streaming audio at patriot not LA's preempted due to sports programming\nKiki I be evil resume streaming audio at the conclusion of the game [noise] best is K. E. I'd be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] the\nBest is Kay eat id Los Angeles and streaming audio and patriot dot L. A. preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\nPasses ... I'd be Los Angeles streaming audio and patriot dot alleging preempted due to sports programming from the id will resume streaming audio at the conclusion of the game the best is K. E. I. V. Los Angeles times streaming audio and patriot dot L. A. preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game and the best is Katie I'd be Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming ... be evil resumes streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming\nEat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. icy Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nThis case I'd be Los Angeles\nStreaming audio at patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game [noise] best is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game on the basis K. E. I'd be Los Angeles streaming audio and patriot dot L. A. is preempted to to sports programming\n... id will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I be Los Angeles streaming audio at patriot data LA's preemptive due to sports programming ... id evil resumes streaming audio at the conclusion of the game\nIn this case I be Los Angeles streaming audio patriot dot allies preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in this case the I'd be Los Angeles\nStreaming audio and patriots LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game\nIs is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming for ... id will resume streaming audio at the conclusion of the game\nAnd best is Kate I'd be in Los Angeles streaming audio patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game ... I'd be Los Angeles dreaming audio and patriots LA's preempted sports programming Kiki id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriot John LA's preempted due to sports programming\nK. E. R. V. evil resumes streaming audio at the conclusion of the game\nThe\nBest is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game in\nThis case eat I be Los Angeles\nStreaming audio patriot dot L. A. is preempted due to sports programming geeky I'd be evil resume streaming audio at the conclusion of the games all the best is K. E. R. I. B. Los Angeles streaming audio patriot dot LA's preempted do the sports programming\nKatie id will resume streaming audio at the conclusion of the game\n[noise] the ban is K. E. I. B. Los Angeles dreaming audio patriot dot L. A. is preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will best is Kay eat I'd be Los Angeles\nK E R B will resume streaming audio at the conclusion of the game [noise] [noise] [noise]\n[noise] ... I'd be Los Angeles dreaming audio at patriot dot L. A. preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game all basses K eat I'd be Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nKatie id will resume streaming audio is the conclusion of the game\nBasses may eat I be in Los Angeles\nStreaming audio patriot jot LA's preemptive due to sports programming\nK. E. I. V. evil resumes streaming audio at the conclusion of the game bans is K. E. R. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nOr ... id will resume streaming audio at the conclusion of the game too fast is Katie I'd be Los Angeles and streaming audio and patriots LA's preempted due to sports programming ... ...\nIt will resume streaming audio at the conclusion of the game\nAnd then there's ... I'd be Los Angeles streaming audio patriot John LA's preempted do the sports programming ... will resume streaming audio at the conclusion of the game [noise] best is K. E. I. B. Los Angeles\nStreaming audio and patriot John Elway he's preempted due to sports programming\n... evil resumes streaming audio at the conclusion of the game and\nThen this ... be Los Angeles streaming audio patriot dot L. A. preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n[noise]\nBans is Katie I'd be Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming\nSki I be able resumes streaming audio at the conclusion of the game best is K. E. I'd be in Los Angeles streaming audio patriots dot LA's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nAnd best is K. E. I. B. Los Angeles\nI'm streaming audio patriot Donna LA's preempted due to sports programming K E R B will resume streaming audio and the conclusion of the game for fast is K. E. I. B. in Los Angeles streaming audio patriot dot allies preempted due to sports programming\n... id will resume streaming audio at the conclusion of the game [noise] bad is Kay eat I be Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nK eat id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot donnelley's preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles dreaming audio at patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game basses ... I'd be Los Angeles\nAnd streaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio with the conclusion of the game\n... fans is Kay eat I'd be Los Angeles and streaming audio patriot ... freedom to do the sports programming Katie id will resume streaming audio at the conclusion of the game\nAnd the best is Kay Ivey Los Angeles streaming audio and patriot dot L. A. is preempted due to force programming ... I'd be evil resumes streaming audio at the conclusion of the game\nFor best is Kay eat I'd be in Los Angeles streaming audio patriot dotted LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game has this ... I'd be Los Angeles dreaming audio patriots donnelley's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio patriot dot L. A. preempted different sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot LA's reinstitute a sports programming ... be evil resumes streaming audio at the conclusion of the game and\nThen there's ... I'd be Los Angeles is streaming audio and patriots dot L. A. is preempted do sports programming geeky I beat will resume streaming audio at the conclusion of the game and passes K. E. I. B. from\nLos Angeles streaming audio at patriot not LA's preempted due to sports programming Kiki I be evil resume streaming audio at the conclusion of the game\n[noise] basses K. E. R. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game [noise]\n[noise] [noise] do\nBest is Kay eat I be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming for GE I'd be evil resumes streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game and best is Katie I'd be Los Angeles streaming audio at patriot Donna LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nIn this case I be Los Angeles streaming audio at patriot dot L. A. preempt into the sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. IP Los Angeles streaming audio and patriot dot LA's preempt into the sports programming Kay Ivey evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio is the conclusion of the game [noise] bad is Kay eat I'd be Los Angeles dreaming audio at patriot dot LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game and in this case I'd be Los Angeles streaming audio and patriot dot alleging preempted to to sports programming Kiki id will resume and streaming audio at the conclusion of the game\nWill [noise]\nThis is Kay eat I be Los Angeles streaming audio ex patriot data LA's preemptive due to sports programming shaky id will resume streaming audio at the conclusion of the game\nIn this case I be Los Angeles streaming audio patriot dot L. A. is preempted do the sports programming GE id will resume streaming audio at the conclusion of the game\nThe best\nIs Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio patriots LA's preempted due to sports programming\nFor GE id will resume streaming audio it's a conclusion of the game\n... K. E. I. B. Los Angeles streaming audio at patriot dot L. A. is preemptive due to sports programming for GE id will resume streaming audio at the conclusion of the game\nBand is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nK. E. R. I. D. will resume streaming audio at the conclusion of the game passes K. E. I. B. Los Angeles dreaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles and streaming audio patriot John LA's preempted due to sports programming\nK. E. I. V. will resume streaming audio at the conclusion of the game\n\nThe passes K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nThe dancers ... I'd be Los Angeles dreaming audio patriot John LA's preempted do the sports programming\nK. E. R. I. V. evil resumes streaming audio at the conclusion of the game\nThe\nBass is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming kinky id evil resumes streaming audio at the conclusion of the game\nIs K. E. R. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nKiki I'd be evil resume streaming audio at the conclusion of the game [noise] best is K. E. R. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nOn the\nBasis K. E. I. B. Los Angeles dreaming audio patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game basses case I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio is the conclusion of the game\nBasses may eat I be in Los Angeles\nStreaming audio patriot John LA's preemptive due to sports programming K. E. I. V. evil resumes streaming audio at the conclusion of the game\nBest is Katie I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio ex patriot data LA's preempted due to sports programming\nOr Katie id will resume streaming audio at the conclusion of the game fast is Kate I be Los Angeles and streaming audio patriot John LA's preempted due to sports programming ... streaming audio at the conclusion of the game\nAnd\nPasses K. E. I'd be Los Angeles dreaming audio at patriot jot LA's preempted due to sports programming ... resumes streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles\nStreaming audio and patriot John Elway is preempted due to sports programming\n... be evil resume streaming audio at the conclusion of the game and\nThen this lady I be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\n[noise]\nBan this K. E. I. B. Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots dot LA's reinstitute a sports programming K E R B evil resumes streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles I'm streaming audio patriot dot L. A. is preempted due to for its programming\nKatie id will resume streaming audio and the conclusion of the game fast is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is freedom to do the sports programming\nKatie id evil resumes streaming audio at the conclusion of the game [noise] best is Kay eat I'd be in Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIs Kay eat I'd be Los Angeles streaming audio patriot donnelley's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I'd be Los Angeles streaming audio at patriot dot LA's preemptive pseudo sports programming and Katie id will resume streaming audio at the conclusion of the game basses ... Los Angeles\nAnd streaming audio patriot dot L. A. preempted due to sports programming\nK. E. R. I. D. will resume streaming audio us a conclusion of the game ... fans is Kay eat I'd be Los Angeles and streaming audio at patriot dot LA's freedom to do the sports programming Katie id will resume streaming audio at the conclusion of the game\n[noise] best\nIs Kay Ivey in Los Angeles streaming audio and patriot data LA's preempted due to sports programming ... I'd be evil resume streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles dreaming audio patriot dot alleging preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio at patriot dot L. A. is preemptive due to sports programming kinky id will resume streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempt into the sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot L. A. is reinstitute a sports programming Kiki id will resume streaming audio at the conclusion of the game\nAnd\nThere's ... I'd be Los Angeles streaming audio and patriot dot LA's preempted do the sports programming geeky I'd be evil resumes streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio patriot not LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game [noise] basses K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nBest is Kay eat I'd be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming from the id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles times streaming audio and patriot dot L. A. preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio patriot Donna LA's preempted dude a sports program a K E R B will resume streaming audio at the conclusion of the game\nIn this case I beat Los Angeles streaming audio and patriot dot LA's preempt into the sports programming\nEat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. I. V. Los Angeles streaming audio and patriot ... preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game in\nThis case it I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio is the conclusion of the game [noise] bad is Kay eat I'd be Los Angeles and dreaming audio at patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles\nStreaming audio and patriot dot LA's preempted do the sports programming K E R B will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming shaky id evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n... best\nIs Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is reinstitute a sports programming Katie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles\nStreaming audio patriots dot LA's preempted due to sports programming for GE id will resume streaming audio is the conclusion of the game\nStreaming audio at patriots dot LA's preempted due to sports programming for GE id will resume streaming audio is the conclusion of the game\nIs is Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming ... id will resume streaming audio at the conclusion of the game\nAnd best is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game\nFast is K. E. R. I. B. Los Angeles and streaming audio and patriot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot John LA's preempted due to sports programming\nKiki I've evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio and patriot John Elway is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\n... I'd be evil resumes streaming audio at the conclusion of the games all the best is K. E. R. I. B. Los Angeles streaming audio patriot dot LA's preempted due to sports programming\n... I'd be will resume streaming audio at the conclusion of the game\n[noise] [noise] [noise] ... I'd be Los Angeles dreaming audio at patriot dot L. A. preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game will basses case I'd be Los Angeles\nStreaming audio and patriot donnelley's preempted do the sports programming\nKatie id will resume streaming audio is the conclusion of the game\nBasses may eat I be from Los Angeles streaming audio patriot jot LA's reinstitute a sports programming\nK. E. I. V. evil resumes streaming audio at the conclusion of the game best is K. E. R. I. B. Los Angeles dreaming audio at patriot dot L. A. is preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game's best is K. E. I. B. Los Angeles streaming audio patriot dot allies preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game's best is Katie I'd be Los Angeles and streaming audio and patriots LA's preempted due to sports programming will ... will resume streaming audio at the conclusion of the game\nAnd in this case I'd be Los Angeles streaming audio patriot data LA's preempted do the sports programming ... will resume streaming audio at the conclusion of the game\n[noise] best is K. E. I. B. Los Angeles streaming audio and patriot John LA's preempted due to sports programming\nGE I'd be evil resume streaming audio at the conclusion of the game and\nThen this lady I be Los Angeles streaming audio patriot dot L. A. preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\n[noise]\nBans is K. E. I'd be Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio patriots dot\nHe's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nBans is K. E. R. I. B. Los Angeles I'm streaming audio patriot dot L. A. preempted due to sports programming K. E. R. I. B. will resume streaming audio and the conclusion of the game\nFast is K. E. I'd be in Los Angeles streaming audio patriot dot allies preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game in this case the eyepiece Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nIn this case it I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles dreaming audio at patriot dot LA's preemptive pseudo sports programming Katie id will resume streaming audio at the conclusion of the game basses ... I'd be Los Angeles\nStreaming audio at patriot dot LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game the fans is Kay eat I'd be Los Angeles and streaming audio patriot ... freedom to do the sports programming Katie id will resume streaming audio at the conclusion of the game\nAnd the\nBest is Kay Ivey Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nShaky id evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot dot LA's preemptive due to sports programming Mm 'kay eat id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles dreaming audio patriot donnelley's preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio and patriot dot LA's preemptive due to sports programming kinky id will resume streaming audio at the conclusion of the game\nBest is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming occasionally I be evil resumes streaming audio at the conclusion of the game\nAnd\nThen there's ... I'd be Los Angeles streaming audio patriot dot LA's preempted do the sports programming geeky I'd be will resume streaming audio at the conclusion of the game and passes K. E. I. B.\nLos Angeles streaming audio at patriot dot L. A. preempted due to sports programming Kiki I be evil resume streaming audio at the conclusion of the game [noise]\nBasses K. E. I. B. Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nThe\nBest is Kay eat I'd be in Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming and Katie id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot Donna LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio patriot Donna LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nBans is K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nTo eat I be evil resumes streaming audio at the conclusion of the game and the best is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming king he I mean will resume streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and streaming audio patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio is the conclusion of the game band is Kay eat I'd be Los Angeles dreaming audio at patriot dot L. A. is preempted do the sports programming Katie id will resume streaming audio at the conclusion of the game and\nThe\nBest is K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio expatriate ... preemptive due to sports programming shaky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n[noise]\nFast is Kay eat I'd be in Los Angeles streaming audio expatriate ... preemptive due to sports programming shaky id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted do the sports programming Kiki id will resume streaming audio at the conclusion of the game\nThe best\nIs Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio patriots LA's preempted due to sports programming\nEat id will resume streaming audio at the conclusion of the game is is K. E. I. B.\nLos Angeles streaming audio expatriate dot L. A. is preemptive due to sports programming for GE id will resume streaming audio at the conclusion of the game band is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. preempted do that for the program a\nK E R B will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles dreaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriot John LA's preempted due to sports programming\nK. E. R. V. evil resumes streaming audio at the conclusion of the game\nAnd the\nBest this case the icy Los Angeles streaming audio and patriot John Elway is preempted due to sports programming Kay Ivey will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nKatie I've evil resume streaming audio at the conclusion of the game all the best is Kay eat I be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\n... I'd be evil resumes streaming audio at the conclusion of the game\nThe\nMan is Kay eat I'd be Los Angeles times are dreaming audio at patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game ... I'd be Los Angeles\nStreaming audio and patriot dot L. A. preempted due to sports programming K. E. R. I. D. will resume streaming audio is the conclusion of the game\nAnd passes maybe I'd be in Los Angeles\nStreaming audio patriot John LA's reinstitute a sports programming K. E. I. V. evil resumes streaming audio at the conclusion of the game best is Katie I'd be Los Angeles\nDreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game the best is K. E. I. B. Los Angeles streaming audio patriot data LA's preempted due to sports programming\nOr ... id will resume streaming audio at the conclusion of the games in this case the I'd be Los Angeles streaming audio patriots LA's preempted due to sports programming K. E. R. I. V. evil resume streaming audio at the conclusion of the game\nAnd then\n... says hey eat IP Los Angeles streaming audio at patriot John Elway is preempted due to sports programming ... leave over still streaming audio at the conclusion of the game and the\nBest is K. E. I. B. Los Angeles streaming audio and patriot John LA's preempted due to sports programming ... I'd be evil resume streaming audio at the conclusion of the game and\nThen this case the I'd be Los Angeles streaming audio patriot donnelley's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n[noise] [noise] [noise] oh\nMan this ... I'd be Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots donnelley's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles are streaming audio patriot dot L. A. is preempted due to sports programming\nK E R B will resume streaming audio and the conclusion of the game\nHas this ... I'd be in Los Angeles streaming audio expatriate data LA's preempted to the sports programming\n... id evil resumes streaming audio at different closing of the game [noise] best is Kay eat I be Los Angeles streaming audio at patriot dot L. A. preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles dreaming audio at patriot dot LA's preemptive pseudo sports program a K E R B will resume streaming audio at the conclusion of the game basses K. E. I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming K E R B will resume streaming audio is the conclusion of the game in the past is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is freedom to do the sports programming\n... id will resume streaming audio a different conclusion of the game\nAnd the\nBest is K. E. I. B. in Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming shaky id evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be Los Angeles streaming audio patriot LA's preemptive Judah sports programming\nGeeky id will resume streaming audio at the conclusion of the game\nFast is Katie I'd be Los Angeles dreaming audio expatriate dot L. A. is preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming can't eat I mean will resume streaming audio at the conclusion of the game\nBest is K. E. I'd be Los Angeles streaming audio at patriot data LA's preempted do the sports programming he id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot LA's preempted due to sports programming ski I'd be evil resumes streaming audio at the conclusion of the game\nAnd\nThen there's ... I'd be Los Angeles streaming audio and patriots LA's preempted do the sports programming geeky I be will resume streaming audio at the conclusion of the game and passes K. E. I. B. from\nLos Angeles streaming audio it patriot dot L. A. preempted do the sports programming\nKiki id evil resumes streaming audio at the conclusion of the game [noise] basses K. E. I'd be Los Angeles streaming audio ex patriot dot LA's preempt into the sports programming Katie id will resume streaming audio at the conclusion of the game\nAnd the\nIs Kate I be Los Angeles and streaming audio and patriot dot L. A. is preempted due to sports programming ... I'd be evil resumes streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio and patriot dot L. A. reinstitute a sports programming Katie id will resume streaming audio at the conclusion of the game the best is K. E. I. V. Los Angeles and streaming audio and patriot dot L. A. preempted due to sports programming\nCan eat id will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio patriot Donna LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nIn this case I beat Los Angeles streaming audio and patriot John Elway he's preempted due to sports programming eat id will resume streaming audio at the conclusion of the game and the best\nThis case the icy Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio is the conclusion of the game [noise] bans is Kay eat I'd be Los Angeles and streaming audio at patriot dot L. A. is preempted due to sports programming\nThis case I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio with the conclusion of the game [noise] bad is Kay eat I'd be Los Angeles and dreaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game and\nThe\nBest is K. E. I. B. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming GE id evil resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I'd be Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles\nStreaming audio and patriots LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game ... I'd be Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nFor GE id will resume streaming audio at the conclusion of the game the best is Katie I'd be in Los Angeles streaming audio and patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio and the conclusion of the game ... I'd be Los Angeles dreaming audio and patriots LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the games\nThe best is K. E. I. B. Los Angeles streaming audio patriot John LA's preempted do the sports programming\nKiki ivy evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio and patriot donnelley's preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming\nKiki I'd be evil resume streaming audio at the conclusion of the game [noise] best is Kate I'd be Los Angeles and streaming audio at patriot donnelley's preempted due to sports programming\n... I'd be will resume streaming audio at the conclusion of the game [noise]\n[noise]\n[noise] man is K. E. I'd be Los Angeles dreaming audio patriot dot L. A. is preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will basses K eat I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\n... id will resume streaming audio is the conclusion of the game\nBasses may eat I be in Los Angeles streaming audio patriot LA's reinstitute a sports programming\nK. E. R. I. V. will resume streaming audio at the conclusion of the game bans is K. E. I. B. Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming\nOr Katie id will resume streaming audio at the conclusion of the game passes ... be Los Angeles and streaming audio patriot John LA's preempted due to sports programming ... will resume streaming audio at the conclusion of the game\nAnd then\nThere's ... I'd be Los Angeles and dreaming audio at patriot dot LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\n[noise] basses K. E. I'd be Los Angeles streaming audio and patriot John Elway is preempted due to sports programming\n... I'd be evil resume streaming audio at the conclusion of the game from\nFans is Kate I be Los Angeles streaming audio patriot dot LA's preempted due to sports programming Katie id will resume streaming audio as a conclusion of the game\n[noise] [noise] [noise] oh\nMan this K. E. I. B. Los Angeles dreaming audio patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game best is Kate I be in Los Angeles streaming audio and patriots dot LA's reinstitute a sports programming K E R B evil resumes streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles I'm streaming audio patriot dot alleging preempted do that for its programming\nGeeky id will resume streaming audio and the conclusion of the game has this ... I'd be in Los Angeles streaming audio patriot dot L. A. preempted to the sports programming\n... id evil resume streaming audio at the conclusion of the game [noise] best is Kay eat I'd be in Los Angeles streaming audio at patriot dot LA's preemptive due to sports programming\n... id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot allies preempted due to forge programming Katie id will resume streaming audio at the conclusion\nThe game\nBest is K. E. I'd be Los Angeles streaming audio at patriot dot LA's preemptive shoot a sports program a K E R B will resume streaming audio at the conclusion of the game basses K. E. I'd be Los Angeles\nStreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio the conclusion of the game ... fans is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is freedom to do the sports programming Katie id will resume streaming audio at the conclusion of the game\nFor the best\nIs K. E. I. B. Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming\nPay enough I'd be evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot dot LA's preemptive due to sports programming geeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles dreaming audio patriot dot alleging preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nBest is K. E. icy Los Angeles streaming audio at patriot dot LA's preempted due to sports programming can eat I mean will resume streaming audio at the conclusion of the game\nThe best is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming he id will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles streaming audio patriot LA's preempted due to sports programming ski I'd be evil resumes streaming audio at the conclusion of the game and\nThe\nVast is ... I'd be Los Angeles streaming audio and patriots LA's preempted do the sports programming geeky I'd be will resume streaming audio at the conclusion of the game and\nPasses K. E. I. B. from Los Angeles streaming audio patriot dot L. A. preempted due to sports programming\nKiki id evil resume streaming audio at the conclusion of the game [noise] basses K. E. I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\nAnd boom boom\nBest is Kate I be Los Angeles and streaming audio and patriot dot LA's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. and bring him to do the sports programming gee I'd be will resume streaming audio at the conclusion of the game the best is K. E. I. V. Los Angeles times streaming audio and patriot dot L. A. preempted due to sports programming\n... eat id will resume streaming audio at the conclusion of the game\nFast is K. E. I'd be Los Angeles streaming audio and patriot dot L. A. reinstitute a sports programming and Katie id will resume streaming audio at the conclusion of the game the best is Katie id Los Angeles times streaming audio and patriot dot L. A. preempted Judah sports programming\nCan eat id will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. Los Angeles streaming audio patriot dot LA's preempted do the sports programming ... id will resume streaming audio at the conclusion of the game\nIn this case I beat Los Angeles streaming audio and patriot John Elway he's preempt into the sports programming\nEat id will resume streaming audio at the conclusion of the game the best is K. E. I. V. Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and\nStreaming audio at patriot dot LA's preempted due to sports programming K. E. R. I. Beagle resumes streaming audio is the conclusion of the game [noise] band is Kay eat I'd be Los Angeles and dreaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game and the\nBest is K. E. I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game will [noise]\nFast is Tate I'd be in Los Angeles dreaming audio patriot ... preemptive due to sports programming ... id evil resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio and patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I be Los Angeles\nStreaming audio at patriot dot LA's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles\nStreaming audio at patriots LA's preempted due to sports programming for GE id will resume streaming audio at the conclusion of the game\nThe bans is K. E. I. B. Los Angeles streaming audio patriot dot LA's preemptive due to sports programming for ... id will resume streaming audio at the conclusion of the game\nAnd best is Katie I'd be in Los Angeles and streaming audio and patriot dot LA's preempted do this for the program a\nK E R B will resume streaming audio at the conclusion of the game\nFast is K. E. R. I. B. Los Angeles dreaming audio and patriots LA's preempted due to sports programming kinky id will resume streaming audio at the conclusion of the games\nThe dancers ... I'd be Los Angeles streaming audio patriot John LA's preempted do the sports programming\nKiki I've evil resumes streaming audio at the conclusion of the game\nAnd the\nIs K. E. I. B. Los Angeles streaming audio and patriot dot L. A. is preempted\nThe sports programming Kay Ivey evil resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming Katie id evil resume streaming audio at the conclusion of the game\n[noise] best is\nK. E. R. I. B. Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\n... I'd be evil resumes streaming audio at the conclusion of the game\n[noise] the best is Kay eat I'd be Los Angeles times are streaming audio at patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game a little bit this case I'd be Los Angeles\nStreaming audio and patriot dot L. A. preempted due to sports programming\n... id will resume streaming audio with the conclusion of the game\nBasses may eat I be from Los Angeles dreaming audio patriot jot LA's freedom to do the sports programming K. E. R. V. evil resumes streaming audio at the conclusion of the game best is K. E. I'd be Los Angeles\nDreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio and the conclusion of the game\nFast is K. E. I. B. Los Angeles streaming audio patriot data LA's preempted due to sports programming\nOr ... id will resume streaming audio at the conclusion of the games in this case the I'd be Los Angeles and streaming audio patriot John LA's preempted due to sports programming\nK. E. R. I. V. evil resume streaming audio at the conclusion of the game in this case the icy Los Angeles streaming audio at patriot data LA's preempted due to sports programming\n... will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio and patriot John LA's preempted due to sports programming\n... evil resume streaming audio at the conclusion of the game from\n... Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\n\nBand is K. E. I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots dot L. A. is preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\nBans is K. E. R. I. B. Los Angeles and streaming audio patriot dot LA's preempted due to sports programming\nGeeky id will resume streaming audio and the conclusion of the game fast is ... I'd be in Los Angeles streaming audio at patriot data LA's preempted do the sports programming\nKatie id evil resumes streaming audio at the conclusion of the game in this case the eyepiece Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming\nK eat id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game best is K. E. I'd be Los Angeles\nDreaming audio at patriot dot L. A. preemptive pseudo sports programming Katie id will resume streaming audio at the conclusion of the game basses ... Los Angeles\nStreaming audio patriot dot L. A. preempted do the sports programming\nKiki id will resume streaming audio is the conclusion of the game ... fans is Kay eat I'd be Los Angeles and streaming audio at patriot dot L. A. is freedom to do the sports programming Kiki id will resume streaming audio at the conclusion of the game\nAnd the best is K. E. I. B. in Los Angeles [noise] streaming audio at patriot donnelley's preempted due to force programming\nShaky id evil resumes streaming audio at the conclusion of the game for best is Kay eat I'd be in Los Angeles streaming audio patriot dot LA's preemptive due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game\nFast is K. E. I. B. Los Angeles dreaming audio patriots ... preempted due to sports programming AIBT will resume streaming audio at the conclusion of the game\nPasses K. E. icy Los Angeles streaming audio at patriot dot LA's preempted due to sports programming can eat id will resume streaming audio at the conclusion of the game\nBest is K. E. I. B. Los Angeles streaming audio at patriot dot L. A. is preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\nBest is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming ski I be evil resumes streaming audio at the conclusion of the game the\nDisasters ... I'd be Los Angeles streaming audio and patriots dot LA's preempted sports programming geeky I beat will resume streaming audio at the conclusion of the game in the past is K. E. I. B.\nLos Angeles streaming audio patriot dot L. A. preempted due to sports programming Kiki I be evil resumes streaming audio at the conclusion of the game\n[noise] basses K. E. I'd be Los Angeles streaming audio ex patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game [noise]\nLos Angeles streaming audio patriot not LA's preempted do the sports programming\nKiki I Believe over silver streaming audio at the conclusion of the games [noise] basses K. E. I. B. Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game\nThe boom boom\nIs Kate I be Los Angeles and streaming audio and patriot dot L. A. is preempted\nThe sports programming K E R B will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming ... I'd be evil resume streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot L. A. preempted Judah sports programming\nK E R B will resume streaming audio at the conclusion of the game and best is K. E. I. B. Los Angeles streaming audio patriot Donna LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nIn this case I beat Los Angeles streaming audio and patriot John Elway he's preempt into the sports programming\nEat id evil resumes streaming audio at the conclusion of the game and the best is K. E. I. V. Los Angeles has streaming audio and patriot dot L. A. is preempt into the sports programming kinky id evil resumes streaming audio at the conclusion of the game in\nThis case I'd be Los Angeles and streaming audio at patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio at the conclusion of the game [noise] bans is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in\n\nThis case I'd be Los Angeles streaming audio and patriot dot LA's preempted due to sports programming Kiki id will resume streaming audio at the conclusion of the game will [noise]\nFast is Kay eat I'd be in Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming ... id evil resumes streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio and patriot donnelley's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\n...\nBest is Kay eat I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game in this case I'd be Los Angeles streaming audio at patriots dot LA's preempted due to sports programming\nGE id will resume streaming audio it's a conclusion of the game\nIs is K. E. I'd be Los Angeles streaming audio at patriot Donna LA's preemptive due to sports programming ... id will resume streaming audio at the conclusion of the game\nBand is Katie I'd be in Los Angeles streaming audio and patriot dot L. A. preempted due to sports programming\nK E R B will resume streaming audio and the conclusion of the game ... I'd be Los Angeles clippers rename audio and patriots LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles dreaming audio patriot John LA's preempted due to sports programming\nK. E. I. V. evil resumes streaming audio at the conclusion of the game\nAnd the\nBest is K. E. IP Los Angeles streaming audio at patriot John Elway is preempt into the sports programming kinky id evil resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio and patriot donnelley's preempted due to sports programming\nKiki I'd be evil resume streaming audio at the conclusion of the game will [noise] basis K. E. R. I. B. Los Angeles streaming audio patriot dot LA's preempted due to sports programming\n... I'd be will resume streaming audio at the conclusion of the game [noise]\n[noise]\n[noise] man says K eat I'd be Los Angeles are dreaming audio at patriot donnelley's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game will basses case I'd be Los Angeles\nStreaming audio and patriot Donna LA's preempted due to sports programming Katie id will resume streaming audio is the conclusion of the game\nBasses may eat I beat in Los Angeles streaming audio patriot data LA's preempted due to sports programming\nK. E. R. V. will resume streaming audio at the conclusion of the game ... I'd be Los Angeles\nDreaming audio patriot dot L. A. is preempted due to sports programming Kiki id will resume streaming audio and the conclusion of the game's best is K. E. I. B. Los Angeles streaming audio patriot dot L. A. preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game fast is Katie I'd be Los Angeles and streaming audio and patriots LA's preempted due to sports programming ... K. E. R. I. V. will resume streaming audio at the conclusion of the game\nAnd bring\nPasses K. E. IP Los Angeles streaming audio patriot John Elway he's preempted due to sports programming ... will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles\nStreaming audio and patriot John LA's preempted due to sports programming\nGE I've evil resume streaming audio at the conclusion of the game and\nThen there's ... I'd be Los Angeles streaming audio patriot dot allies preempted Judah sports programming Katie id will resume streaming audio at the conclusion of the game\nBoy\nBand is K. E. I'd be Los Angeles dreaming audio patriot dot L. A. is preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots dot L. A. is preempted due to sports programming ... be evil resumes streaming audio at the conclusion of the game\nBest is K. E. I. B. Los Angeles I'm streaming audio patriot dot LA's preempted due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nFast is ... I'd be in Los Angeles streaming audio at patriot dot allies preempted due to sports programming\nHe id evil resumes streaming audio at the conclusion of the game [noise] bad this case the eyepiece Los Angeles streaming audio at patriot dot L. a.'s preemptive due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot LA's preempted due to forge programming Katie id will resume streaming audio at the conclusion of the game\n\nBest is K. E. I'd be Los Angeles and dreaming audio at patriot dot LA's preemptive pseudo sports programming and Katie id will resume streaming audio at the conclusion of the game or best is Kate I be Los Angeles\nStreaming audio at patriot dot LA's reinstitute a sports programming Kiki id will resume streaming audio is the conclusion of the game the fans is Kay eat I'd be Los Angeles streaming audio patriot ... freedom to do the sports programming\nKatie id will resume streaming audio at different closing of the game\nAnd the\nIs Kay Ivey in Los Angeles streaming audio and patriot dot L. A. is preempted Duda sports programming ... be evil resumes streaming audio at the conclusion of the game\nBest case I'd be in Los Angeles streaming audio patriot dotted LA's preemptive do the sports programming Katie id will resume streaming audio at the conclusion of the game\nThis ... I'd be Los Angeles dreaming audio patriot donnelley's preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio and patriot dot LA's preempted due to sports programming can't eat I be will resume streaming audio at the conclusion of the game\nMasters K. E. I. B. Los Angeles streaming audio patriot data LA's preempted sports programming ... I'd be will resume streaming audio at the conclusion of the game\nPasses K. E. I. V. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming can eat id will resume streaming audio at the conclusion of the game\nMasses K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempt into the sports programming ... I'd be will resume streaming audio at the conclusion of the game\n... I'd be Los Angeles dreaming audio patriot dot LA's reinstitute a sports programming ski I be evil resumes streaming audio at the conclusion of the game\nAnd [noise] the\nBest ... I'd be Los Angeles streaming audio and patriots dot LA's preempted do the sports programming geeky I'd be will resume streaming audio at the conclusion of the game and best is K. E. I. B. from\nLos Angeles streaming audio ex patriot not LA's preempted do the sports programming\nKiki I Believe over still streaming audio at the conclusion of the game [noise] basses K. E. I'd be Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nTo be the\nBest is K. E. R. I. B. Los Angeles and streaming audio and patriot dot L. A. preempted due to sports programming ... I'd be will resume streaming audio at the conclusion of the game\nPasses ... I'd be Los Angeles streaming audio and patriot dot L. A. preempted do the sports programming for GE I'd be evil resumes streaming audio at the conclusion of the game the best is Katie id Los Angeles streaming audio and patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game and in this case I'd be Los Angeles streaming audio at patriot Donna LA's preempted due to sports programming ... id will resume streaming audio at the conclusion of the game\nPasses K. E. I. B. Los Angeles streaming audio patriot John Elway is preempt into the sports programming\nEat I be evil resumes streaming audio at the conclusion of the game will be asked is K. E. IP Los Angeles streaming audio and patriot dot L. A. is preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nK. E. R. I. Beagle resumes streaming audio as a conclusion of the game [noise] best is Kay eat I'd be Los Angeles and dreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game and\nThe\nMasses K. E. I. B. Los Angeles streaming audio and patriot dot alleging preempted to to sports programming Kiki id will resume streaming audio at the conclusion of the game will [noise]\nBasses K eat I'd be Los Angeles streaming audio at patriot data LA's preemptive due to sports programming GE id will resume streaming audio at the conclusion of the game\nIs K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preempted due to sports programming GE id will resume streaming audio at the conclusion of the game\nThe best\nIs Kay eat I'd be Los Angeles streaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio ex patriot jot LA's preempted do the sports programming\n... id will resume streaming audio at the conclusion of the game\nIs is K. E. I. B. Los Angeles streaming audio patriot dot L. A. is preemptive due to sports programming for ... id will resume streaming audio at the conclusion of the game\nThe bans is Katie I'd be in Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nK. E. R. I. B. will resume streaming audio and the conclusion of the game ... I'd be Los Angeles dreamy Mario and patriots LA's preempted due to sports programming geeky id will resume streaming audio at the conclusion of the game\nIs ... I'd be Los Angeles streaming audio patriot John LA's preempted do the sports programming\nK. E. R. I. V. evil resumes streaming audio at the conclusion of the game\nThe\nBest is K. E. IP Los Angeles streaming audio and patriot data LA's preempt into the sports programming kinky id will resume streaming audio at the conclusion of the game\nIs Kay eat I be Los Angeles streaming audio patriot dot LA's preempted do the sports programming\nKatie id evil resume streaming audio at the conclusion of the game [noise] best is Kate I be Los Angeles and streaming audio patriot dot L. A. is preempted due to sports programming\nKatie id will resume streaming audio at the conclusion of the game\nThe\nIs K. E. I'd be Los Angeles dreaming audio at patriot dot LA's preemptive due to sports programming Katie id will resume streaming audio at the conclusion of the game will basses K eat I'd be Los Angeles\nStreaming audio and patriot dot LA's preempted due to sports programming Katie id will resume\nThe streaming audio at the conclusion of the game\nBasses may eat I be in Los Angeles dreamy Mario patriot John LA's freedom to do the sports programming\nAnd K. E. I. V. evil resumes streaming audio at the conclusion of the game bans is K. E. I. B. Los Angeles\nDreaming audio at patriot dot LA's preempted due to sports programming Katie id will resume streaming audio at the conclusion of the game fast is K. E. I. B. Los Angeles streaming audio patriot data LA's preempted due to sports programming\nOr Kiki id will resume streaming audio at the conclusion of the game passes ... Los Angeles and streaming audio patriot John LA's preempted due to sports programming K. E. R. I. V. will resume streaming audio at the conclusion of the game\nAnd passes K. E. IP Los Angeles dreaming audio patriot John Elway is preempted due to sports programming\n... will resume streaming audio at the conclusion of the game and the best is K. E. I. B. Los Angeles streaming audio and patriot John LA's preempted due to sports programming\n... I'd be evil resume streaming audio at the conclusion of the game\nBans is Kate I be Los Angeles streaming audio patriot dot L. A. preempted Judah sports programming Katie id will resume streaming audio at the conclusion of the game\n\nIn this case I'd be Los Angeles dreaming audio patriot dot LA's preempted due to sports programming\nK E R B will resume streaming audio at the conclusion of the game ... I'd be in Los Angeles streaming audio and patriots donnelley's preempted due to sports programming K E R B will resume streaming audio at the conclusion of the game\n... best is K. E. R. I. B. Los Angeles are streaming audio patriot dot L. A. preempted due to sports programming\nGeeky id will resume streaming audio at the conclusion of the game fast is ... I'd be in Los Angeles streaming audio patriot dot LA's preempted due to sports programming\nKatie id evil resumes streaming audio at the conclusion of the game basses K eat I be Los Angeles streaming audio at patriot LA's preemptive due to sports programming\nKiki id will resume streaming audio at the conclusion of the game\nIn this case I'd be Los Angeles streaming audio patriot dot allies preempted due to forge programming K. E. R. I. B. will resume streaming audio at the conclusion of the game\n\nBest is K. E. I. B. Los Angeles dreaming audio at patriot dot LA's preemptive pseudo sports programming\nKatie id will resume streaming audio at the conclusion of the game basses Kate I be Los Angeles streaming audio patriot Donna LA's preempted do the sports programming\nK E R B will resume streaming audio is the conclusion of the game in the past is Kay eat I'd be Los Angeles and streaming audio patriot dot L. A. is freedom to do the sports programming geeky id will resume streaming audio a different conclusion of the game\nAnd the best is K. E. I. B. in Los Angeles streaming audio at patriot dot L. A. is preempted due to sports programming\nDollars a month I'm select quote agent dance to be you know and believe me if select quotas and shopping for your life insurance you're probably paying too much\nFor your free quote comb eight hundred Seventy one forty eight eighty eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty or go to select quote dot com since Nineteen eighty five we shop you say\nGet full details on the example policy it slowed down ... commercials or ... depending on your health insurance company that factors in Austin\nNow traffic [noise]\nI'm Claire Lewis and you're listening to the best to ground zero please hold all the calls is pre recorded\nShow marketing three high marks of ground zero [noise] hey how are ya good faith I guess\nMy first question would be in regard to that first but then he played mhm like\nIs that lead verified\nDoes it have to be scientifically ... verified as just a production of the future's all it is no Nineteen forty five I mean it's just it was from a pax TV they said it was made in England in Nineteen forty five post World war two and it just somebody predict future team forty a Nineteen forty five a hundred years in the future twenty forty five\nAnd it's something that you've found on the Internet\nIf somebody was produced it was something that was a released by a pax TV or the England that was a prediction given ... an ounce or on the radio in Nineteen forty five\n... okay\nAnd I mean I mean it was ... it was kind of address but not really all that accurate right\nWell right\nBut I mean what what do you what's the problem you have with it\nJust because I mean anybody could make\nThat's right anybody can make the production of if this was made in Nineteen lives if this was made in Nineteen ...\nSixty five and it it was filled by a month ago well it did it they say was Nineteen forty five so I mean if it's Nineteen forty five and they say it's Nineteen forty five and the group it's called the effects TV and they said they had that from Nineteen forty five\nI mean I I Can't tell you something Arthur ... made in Nineteen sixty four they basically said the same thing with this set\nI I read Nineteen eighty four I regret that\nRight well okay so Nineteen eighty four was made what in the Nineteen twenties and Orwell much predicted the future did he not\nWrite write questioning the soundbite that you played if it was made last month right\nWell okay let me just tell you this he was released by a company called apex TV saying that it was an unknown radio broadcasts from Nineteen forty five a man was on the radio basically predicting\nThe future and that's all it is I mean you can quiet and I do that of course you can anybody can I don't understand what your problem is\nMy problem is I don't think that's that clip that you played was originally from Nineteen forty five\nOkay and when do you think it was from\nI Wonder why I think it's probably\nYeah when you when you think that was made I mean I I don't understand what you're [laughter] I don't know what the problem is with this I ... I'm really wondering what the problem\nLike somebody made it look like this person from Nineteen forty five was saying that but it was really made last week\nOkay so how much how much of that thing that he how much of that recording was that guy accurate about\nWell I Know that's\nNo no I'm asking not very much of it was not a ... I mean what you said that ah there'd be a lot of entertainment that wouldn't be owned by a lot of companies that's not true we have\nWe have companies that own a lot of our entertainment there are independent or things that he's half right about he didn't get it all have a lot a lot of that production stuff wasn't All right he didn't get a get it All right yeah it's late again and again I Want you to review it again and realized that [noise]\nWhile the golf when he got some of it right he didn't get all of it right you didn't\nKnow it it's not what he said it I Wish things the validity\nOf [noise]\nOkay All right well your question you have a little bit of it but I don't understand why it's so important [noise] I mean if it said it was Nineteen forty five and find them you question the validity of it but it's like this guy really I mean when you think about it\nHe said it but not all of it was true then he said I mean we really listen to what he had to say that the\nPoint is they [noise] uh hope is something that looks kind of real\nBut right and who benefits from it so [noise] I think it's a [noise] like people who benefits from the hopes mark here longer ... there was nothing fearful in that in that broadcast [noise] nothing [noise]\nFamous ... war the world it's\nNo really not [laughter] [noise] I'm going to play it again the next hour I don't know if you heard the ride broadcast or not I don't know if\nYou were really listening really scary about it at all or nothing and do you like I've never told a radio\nShow okay but I'm just trying to figure out who benefits from hope sing a radio broadcast like that\nWho hosts the war of the world who [noise]\nWho ... okay we know why Orson Welles did that we don't know why anyone would want to think something like that I'm going to play it again next hour we'll see we'll be back [noise]\nThis online banks for closing on how they even have documents that I signed for home equity loan only I didn't what a nightmare\nShe's the victim of a devastating crime called mortgage fraud your ... title and mortgage are kept on line where these foreign and domestic hack them it's simple they forge your title and borrow every penny of equity you happen to your home like this police officer\nI Know about title fraud sorry register with home title walk and discovered some these had already taken over title thank God I found out in time\nNo bank identity theft program or insurance protects you hope title lock will for pennies per day hold tight lock puts a barrier around your homes title and mortgage the instant it detects tampering there on it helping to shut down\nFind out if you're already a victim of title fraud get your hundred dollar shirt free with sign up this at home title lock dot com\nHome title lock dot com\nHey Dan can you believe that that ten year anniversary of getting a great night sleep I Know Trina for ten years the quiet has been helping couples like us kicked snoring out\nIn a sour Pete envoys list\nPrice dealer price to be happier if your car shop and you've probably heard these terms\nWhat do they mean it's so confusing well it was confusing not anymore I'm telling you about true price from two car it's a price it actually means something because it's the exact price you pay for the car you want including season accessories and basketball you'll know if you're a true prices competitive because true car shows you what other people are paying\nFor the bad think of the millions of lives we've changed and that all happened ... years before others nine companies shut up on this team the quiet really started a revolution high were ... as the founders of CSI quiet people often ask what sets us apart from the competition it's easy with our problem and we know what my\nCourse back to full strength on jak Callahan Fox News Hi\nSo\nThere was an audio file but I played last hour and it was an audio file becomes from apex TB okay a apex TB claims that this radio file their play you comes from Nineteen forty five\nAnd I played it in some guy called left already says oh it's a hoax and I'm thinking well okay if it's a hoax and who benefits from it\nThat's what I Want to know who benefits from a hoax that this is a hope\nIt just sounds like a typical guy on a radio making some prediction is all it is and so I don't know why this guy was just so hung up on the idea they thought it was a hoax but what I Want to do is want to play you this broadcast the man who's been recorded off the radio could have made a lucky guess\nBut I'm a sucker for time travel and prophecy especially when it has the paranormal by to it so I'm going to play this for you again and ah there's no fear mongering here at all even though the guys do this this is big business the intent is to scare people\nKnow this is not to scare people but it's here to make you think listen to what this guy so it's like I said Nineteen forty five it's a radio broadcasts where a guy attempted to\nActually predict the future what would happen in the year twenty forty five here we go\nAnd get one welcome back in the program today we'll talk about a serious topic to talk to your show today will make some protections maybe someday my back on the production I yeah I Do know is\nNineteen forty five hundred years from now and I'll be twenty forty five it is coming out in the state of the world and what not and again is that it's we have seen the world has changed drastically and the boss\nAnd yes John ... yes\nOh and the antenna phone and fine don't have to sell our fire machine seemed as I can I can I add that to many that's great and industrial revolution the wellness seen all changed in the fall in mind\nAs we have our our protections for the next one hundred years and one hundred years I put it that man will have stepped foot on a celestial bodies such as I'm On the planet Mars and one hundred yes I've heard is that the average man or get has news and\nEntertainment from a variety of sources big companies are\nNow don't have a monopoly on the news and entertainment people enjoy I didn't want to\nOn a car loan constrained\nAround and they will have the ability to fight and the average wealth and the energy that powers the cost will come from the sun and on on television and says he'll get increasingly smaller connect the television sets\nTo the point that they can have on our ... I think that yes that will be soon cameras at every street corner there will be put in place and then I'm a fan of increasingly vanish\nI Want to trade out kind of a safety we want to allow our rights to bail rounded off our hands and we'll keep our children are safe now remember protections no say maybe some in the aftermath of back on the day\nWell future man looking\nBack on them and they are pretty interesting predictions if there are predictions that come from Nineteen forty five\nAnd a some of them are accurate some are a little off by ... by just a a tad I think but when you're dealing with something called revelation to the method we have science fiction people all the time making predictions and having them come true I mean we're warned through this type of predicted programming\nAbout how we should be prepared to accept certain ideas certain ... certain ideologies\nWe see in film and TV shows many things that eventually come to pass and when they do we wonder about the theory of retro causality and real time travel is these physicists have been talking about retro causality and whether or not there are things that\nShape the past future shaping the path time travel is a fantastical concept in most would consider the stuff of science fiction and yet we hear more and more that\nThe idea of dream through time he's he's he's quite possible actually a but to change the course of history\nYeah I don't know I mean we're we're told that they were different timelines that if you go back in time uh and you kill baby Hitler that won't matter 'cause there'll be another time my little form after that that kind of thing I don't know\nBut um it is possible we're hearing more and more about time travel is becoming more and more possible plausible but um\nThere are those who before us have had insight to see the future or they say they've come from the future to let us do\nYou know through science fiction but time travel is possible and his happen from time to time or time after time or or time into an item and and that's\n... ... as you may know like I said I Am in the last hour I I just stumbled upon a film that I saw before called tomorrow and there was a Disney film with George Clooney in it\nAnd what I found most interesting is in the film\nOr they discuss a secret society called plus ultra\nNow according to the fictional history of the film I did some studying on this uh this story goes that good stuff Eiffel\nMet Jules Verne and Thomas Edison at his power apartment to start a secret society of optimists plus ultra was founded it'd be Eighteen eighty nine world's fair in Paris, France\nThe organizations purpose is to create moderate and expand upon new scientific advancements for humanity now key members of this group included\nPeople like H. G. wells Ray Bradbury Amelia Earhart Mark Twain Nikola Tesla and other scientific figures well Disney eventually became a member as well so it started\nIn Eighteen eighty nine and there were people who became members of this plus ultra group and what plus ultra was was a group that\nCreated a breakaway civilization in another\nDimension okay so I Know science fiction right but is there any truth to it that's the question well as we do as we dig deeper into the story OK he says\nNow this is according to the movie fiction this is this is the story tomorrow land in Nineteen fifty nine had an expansion of Disneyland it was actually about and this is what they said in the film that tomorrow land was actually a training facility\nFor future societies future members of societies they were training them for a journey to an alternate universe\nAnd at this alternate universe was found and later developed\nBy plus ultra now the blueprints for the expansion he'll keep technologies that enabled the journey including something called a super transport key VIPs who were encouraged to join plus ultra were given special VIP audio chores tours of the world's fair\nUh the attraction is there there was Ford's magic skyway there was the it's a small world world ride and for those who couldn't attend the fair there was a there was a record player or record that they could play to get information about the details now Walt Disney\nHad the it's a small world attraction at the Pepsi Cola pavilion in the Nineteen sixty four New York world's fair that\nBelieved to contain of portals tomorrow it\nIn reality does he does have a secret place\nAnd it's near the pirates of the Caribbean it's below the pirates of the Caribbean ride\nIt's called club thirty three it's a private club a club thirty three has not accessible to the public and it's for exclusive use of its members and is the only location at Disneyland that serves alcohol now the editor club thirty three I guess has to press above the buzz run an intercom it's concealed by hidden panel and a doorway\nAnd Walt Disney was a young boy he was a member of the demo they society and they sign a quarter\nAnd so a lot of people believe that the thirty three is related to the thirty third degree a Scottish right free masonry soap\nA fictional secret society that is a dimensional secret breakaway civilization called plus ultra I started wondering is there something like plus all drug that I can present for you tonight\nThat would be sort of a revealing that there may be some dimensional breakaway civilization or there may be some ties to time travel\nYes I can do this and it it is ... and as I was digging through this this ... plus ultra it's Latin for further beyond now I Need for you to remember those words plus ultra because those are the two words that are going to be the ones that are going to unlock the doorway\nUnlocked the key is the key that opens the door way the doors of perception of your mind to maybe have you thinking about where we are right now and whether or not\nThere are people in high places that can manipulate the future changing the passes or well said he controls the future controls the past well there maybe\nA few people that are these types of plus ultra people\nThey're actually [noise] using the future to correct things in the past or [noise] or using retro causality in order to do it in the county [noise]\nAnd it'll blow your mind as to what I found and I'm sharing it with you tonight I'm really excited so stay to Tripoli six seven three thirty seven hundred as Tripoli six Seventy three thirty seven hundred I'm quite Lewis you listen to ground zero and we'll be\nBack [noise]\n\n\nFox News I'm ... not replay for ... the associate justice of the Supreme Court sworn in for a second time possibly to make a point\nIn his remarks Kavanaugh thank all of those at the White House in the Senate among his family and friends who shepherded through the confirmation process he vowed to work as one of the team of nine justices all of whom we said revere the constitution and while he acknowledged the process had tested him he said it did not change him\n... Kevin Allen officially sworn in Saturday a vigil Monday for the twenty people killed in a limo\nCrash in upstate New York this weekend for ... for more tragic or [noise]\nGo early so to sue [noise] probably over or Harry\nInvestigators say the ... failed and inspection last month the driver was not properly life has his Fox News\nRestitution has the right wing shut down this traffic report\nSponsored by Southern California Toyota dealers Toyota spread the word sales event is going on now check out great deals that everyone's talking about on a sleek new twenty Nineteen Toyota ca jar with its precision cut designed seal offers and buy a Toyota dot com\nWe make it easy this is the patriots am eleven fifty\nSean Hannity shares what it's like to live next door to rush like the time Sean needed to borrow a lawnmower am eleven fifty\nI Love the fact that we have we can now say American Made American Jobs American manufacturing American products made in America well Hannity that is very myopic view because I Want my fellow but I I'm not going to ever apologize\nFor wanting to the people in this country to have the most opportunity\nSharks Sean Hannity he stays on the patriots am eleven [noise]\nI'm quite Lewis and you're listening to the best of ground zero please hold all the calls is recorded show [noise]\n\nThat is that they can't they can't do that and no children\nChildren they can't they can't they can't they\nGot him in the end of the world is you know and and as we know it [noise]\nThree I Would do when we are\nWe know the new ... time we just don't know how long\nIt'll last night I don't have the right now\nAnd the balance [noise]\n\n\nCut out where\nThey can one time events they can't they they can't what time is that\nThat\nWas one of the town is we need to talk\nTo my house [noise]\nRun okay I don't have okay let me let me explain\n[laughter]\nHelp times like these it's hard to know who we\n\nFeel that they\nHad got the [noise]\n\n[laughter] [noise]\n[noise]\n\n\n\n[noise]\nI'm quite Louis [noise] you're listening to ground zero whatever it's called and I believe two seven three thirty seven hundred that's AAA six seven three thirty seven hundred [noise]\nBear a plus all trip secret society that knows of time travel [noise] well I guess a little weird as we dig deeper into whether or not plus ultra exist [noise] now we talked\nAbout H. G. wells we talked about how he in Jules Verne according to the movie ... and that several other people have been a wartime Walt Disney was a member\nRay Bradbury was a member Nikola Tesla was a member a Thomas Edison was a member and all these guys had connections the H. G. wells because ... Thomas Edison they all had connections in some way throughout history but Nikola Tesla he was considered one of the most innovative and mysterious band whoever lived\nIn Texas in vengeance went far beyond electricity he may groundbreaking discoveries such as wireless radio communications turbine engines and helicopters although da Vinci came up with the idea at first I'm just so it was also the inventor of fluorescent and beyond lights torpedoes and the X ray among other innovations\nBut by the time of his dad's\nTesla nearly well he had nearly seven hundred worldwide pat how few days after Tesla died on January eight Nineteen forty three\nHis possessions were seized by officials from the amazingly named government office of an alien\nProperty about three weeks after that all of\nTesla's things an documents were given a thorough examination by a group of FBI agents that included none other than\nJohn Gee Trump John Gee Trump would be uncle of president Donald J Trump Trump sunk goal\nWas by all accounts are very accomplished and intelligent man at MIT professor of engineering he helped design X ray machines for cancer patients and did radar research work for the army during World War two\nJohn Gee Trump's analysis of chapters papers concluded that quote\nTesla's thoughts in efforts during at least the past Fifteen Years were primarily of a speculative philosophical and somewhat promotional character but quote did not include new sound working with principals or methods for realizing such result\nA lot of people that are fans of Nikola Tesla would disagree with what John Gee Trump said about Tesla\nDonald Trump on the other hand what's referred to as uncle John\nAh as his intelligence she said uh\nBut he didn't tell just sort of a voucher for his own genetic in historical pedigree saying well you know I'm a brilliant mind just like my uncle John was a brilliant mind in fact Trump said in one interview according to New York or New Yorker magazine he said my uncle used to tell me about nuclear before nuclear was even nuclear\nThat's what Donald Trump says now this would likely be referring to hydrogen bombs rather than the first nuclear bombs because Trump was born in Nineteen forty six after the atomic age was already upon is right that would be a timeline friendly right there\nWell Donald Trump also recalled uh the times how his uncle would tell him many years ago about the power of weapons someday so that the destructive force of these weapons would be so massive\nFor a new or some thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line to find out more text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today learn more about the W. P. carry business graduate programs on line text prepare to seven nine six four or five\nThat's P. R. E. P. A. R. E. to seven nine six four or five\n... so I have one job I\nCan't staff sounds high for being Johnson ... who can give you twenty four seven for thousands of life has always been around for over Seventy five here in Ninety five percent customer satisfaction hiding five just mediocre and he's a scale guy called off one\n\nGuy do expect great savings in a whole lot more lines dot com is the number one online retailer custom window coverings they've been in business over Twenty years whatever twenty million blind salt\nGo to blind dot com and see tons of customer photos to get inspired because now through October nights because the blinds dot com Columbus Day sale save up to fifty percent said why would promote code\nLight but only until October night\nSave up to fifty percent the blind side come from a code light\nThat blinds dot com promo code light rules and restrictions apply I'm\nLewis and you're listening to the best to ground zero please hold all the calls is recorded show\nDo get their money from my nose within the fictional\nGroup in a movie called tomorrow land but you look at John Jay Trump the uncle of Donald Trump and how much he praises him for his intellect and how he had all the papers the nickel like Tesla and the possibility of a\nTime machine not only that but you see that plus ultra are on the tiles all over mar a Lago where President Trump is called the king\nThink about that for a moment\nSo what Donald Trump be fully aware of the fact that there were books written about a young\nMan named a barren Trump\nWho was advised by a man named John these are some very interesting synchronous these in coincidences did make me wonder about plus ultra and whatnot plus ultra is a real group it's going to Robert in Ohio Hi Robert you're on ground zero\nBelow ground how you doing you love your show what you're talking about it's another as usual mind thinking situation that you always open the canals can and let the\nMind begin to think last year I think you know I Love that you do that thank you so much and\nLet me get started by saying that a person who makes predictions and things like that you know generally person should have a totally open mind on that because one never knows what's going to possibly happen in the future anyway right and this person has come up with the idea that they're awfully something good\nBecause you'll notice with production a lot of times it says eight or something good comes up or something bad happened she enjoys one or the other\nAnd ah so you know people predicting things and people who are protected thing\nYes that's Nineteen forty five show for instance that you're listening to\nUh put on there earlier was probably something that was played after World War two and England because the gentleman talking\nAs it sounds like he's anguish and he's just trying to bring hope people make them realize someday there'll be no more face to worry about right yeah so that that's that's what that in my opinion is what that's all about as far as people make a production of these guys are good sometimes they're bad\nMouth all the the secret society thing now I totally believe that also too as you're saying they alter plus\nA possibility I don't know myself personally at Fort Worth area but with the way the world is today and the way society is today and the way the politicians are in the way everything is in this country is right up there is probably cigarettes are\nAll blew my mind is the you know here we have John Tromp who is a Donald Trump cynical who had all of Nikola Tesla's work you had all these papers and of course a Trump was\nA pretty much a a a big helping grieving X ray machines much of what tests as work was about and Lawrence Tesla created a depth re a bit to most\nCertainly you know speculative there but it's like well John Trump said well nothing was found that was a very important but yet John ...\nWent along the became this that and this and then Donald Trump of course at mar a Lago he stays at mar a Lago and this is where he kinda hangs out his resort for all the dignitaries and all over the walls is is the term plus ultra plus ultra plus ultra\nFrom beyond and it it you know just amazing the way that all comes together like that it makes you wonder about\nUh also the ah the story about Baron Trump and the story about the last president it's just an amazing a kind of coincidence that all this went down in the Eighteen hundreds\nWell one thing you'll you'll you'll ... easily find out what she criticized stuff by two is the fact that usually if the people that have the money yeah\nThat's right and if and if it's some sort of time travel secret society man that that explains a lot of pressure Robert thank you so much for your call AAA six seven three thirty seven hundred think about it for a moment is there a secret society that knows about time travel will be back with more don't go away [noise]\nThinking about life insurance what if you could make one free phone call and learn your best price for nearly a dozen highly rated price competitive companies well that's exactly what happens\nWhen you called select quote life\nFor example Georgia's forty he was getting sky high quotes from other companies because he takes meds to control his blood pressure but when I shopped around I found\nHim a ten year five hundred thousand dollar policy for under twenty five dollars a month I'm select quote agent dance to be you know and believe me if select quotas and shopping for your life insurance you're probably paying too much ...\nMore you're free quote calm me down bridge seven to one forty eight eighty eight hundred seven to one forty eight eighty eight hundred seven to one forty eight eighty or go to select quote dot com since Nineteen eighty five we shop you say\nGet full details on the example policy it slowed down complex commercial surprise could vary depending on your health and human company of the factors that are available and all the\nPeople to the full extent of what has happened in this country with illegal immigration they would reach out and rightly so Democrats\n\nAre preparing for Michael ... Callahan Fox News it was a fast developing storm now it's strengthening headed for the Gulf Coast hurricane Michael\nThat's great and dust colonel revolution\nThe well the scene I changed in the fall came to mind\nAs we go over our protections for the next one hundred years then one hundred years I predict that man will have stepped foot on the celestial bodies such as the moon and the planet Mars and one hundred years I put it that the average man will get his news and entertainment from a variety\nOf sources big companies will\nNo longer have a monopoly on the news and entertainment people enjoy I couldn't put it in one hundred years\nCost one no longer be constrained by the crown they will have the ability to fight and the average will and the energy that powers the cost will come from the sun in one hundred years I put the television sets we'll get increasingly smaller I predict the television sets for ...\nTo the point of taking it on our ... I think that in ... yes that will be filmed cameras at every street corner there will be put in place in the name of a safety but our freedoms really increasingly vanish\nWe will trade our freedom a safety we allow our rights to record it because they are here and we'll keep our children are safe now remember these are protections not say maybe some of the future man we're back on them ... day\nSo we have a little bit of predicted programming from Nineteen forty five allegedly okay and predicted programming the revelation of method is everything that goes in the fridge analytics and why things happen the way they do with the rich reverse causality or something else\nAnd the other night I was watching a movie called tomorrow when it was in my free movies band and I remember it being a good movie I wanted to see it again and what was interesting about it was it reminded me\nOf well\nA secret society in the film a fictional secret society called plus ultra and a lot of people who are involved with plus all ... Thomas Edison and H. G. wells and uh several other people\nThe Senate and Mark Twain all having connections in fact they said that even does the was a member of this\nPlus ultra group and I thought well that sounds really believable is plus ultra real well yes and no okay cause I'm finding out that maybe it's not called plus ultra\nBut it's something else even does be was a part of something called club thirty three that he created it was just a special club for some of the people he knew and some very special people and of course a lot of people who believe that the cubs thirty three comes from the thirty three degrees and masonry\nBecause this was part of the Malay when he was a kid so plus ultra\nIs there any truth to the idea that maybe plus altered may be some time travel group for some group that created a a breakaway civilization on some other plane a utopian plane\nWell H. G. wells are as you know\nThere was a movie made about H. G. wells called time after time it was another fictional movie where wells goes into the future to find Jack the ripper and he does so by using his quote fabled time machine and the movie and it's kind of ... cryptic late says H. G. wells married\nAmy Catherine Robbins\nWho died in Nineteen twenty seven and then it's just as a writer he anticipated socialism global war space travel\nAnd women's liberation he died in Nineteen forty six well wells also claimed that he was a Fabian socialist he was part of the open conspiracy to establish a future new world order now he knew that he wouldn't live to see the day that this new world order would happen but he knew that a new world order was in the works that he wrote a book in Nineteen forty called the new world order\nAnd the book addressed the ideal of a world without a war or a utopia that basically emanates from a global government there was a ... let them and the whole nine yards well prior to that book wells wrote the shape of things to come which is another book that was kind of eerily prophetic because he talked about a World War just started in Nineteen forty\nOr the world will be brought into a new world order by criminal dictator who fortified as the war machine and so that actually approximate what really happened in World War two\nWell then he runs several of his books that\nThat there was a shadow government there was looming that this shadow government was there to create a new world order that would replace world religion and it would be an ugly thing it kind of like well Benjamin Israeli said about the British Government and\nWell well you know he was a visionary we notice and whether or not he was a time travel is anyone's guess I don't know if you ... ... but ... but he according to this movie it was part of the plus ultra program now Nikola Tesla is\nAlso one of the guys that was in this program this plus ultra program allegedly in the in the Disney movie and of course his inventions went beyond electricity in fact there were some people who believe that he created a time machine but he was be I guess the American equivalent of H. G. wells at the time well by the time of his death\nHe had patented ... about seven hundred things but\nAfter he died in Nineteen forty three\nAll of his possessions were seized by a government office called the government offices of alien property and about three weeks after they were seized all Tesla's things in documents were given a thorough examination by a group of FBI agents that included none other than John Gee Trump who's the uncle of Donald Trump our president\nBut what's interesting is that you know Jon Jeter Trump said that Nikola Tesla's papers were really amounted to nothing but\nA Trump went on to ah actually\nCreate X ray machines tests who was working at an extra machines inside but he created them and of course Trump Donald Trump always says well I come from along the light of intellectuals and very a genius says like my uncle John J. Trump John Gee Trump he was a genius as well\nWell um what's interesting about all this is is that\nThe question is what did Donald Trump cynical finding those papers in Nineteen forty three well there's a question as to whether or not test I had a time machine and that there was something about\nThe the era of wells the era of Tesla and this this writer\nWho was a science fiction writer his name was Ingersoll lock would unlock wood was the author of a a few books one that raise many eyebrows a couple Baron Trump's marvelous underground journey and another was called Nineteen hundred and then there was the last president for both of the books are in the library of\nCongress you can read them but Newsweek did this strange article and twenty Seventeen basically saying that\nThis barren Trump character in this book goes to Russia he it's advised by a character named on\nAnd then he goes to the Fifth Avenue hotel in New York and then a Fifth Avenue a hotel or whatever it was it was I think probably the Waldorf Astoria if I'm right basically had some significance as well\nBecause there there were there was that book by luck would called\nUh the last president in in the last president\nThere's a quote from the book is really interesting it's about a state of uproar in New York after the election of an outsider candidate said that the entire east side this is from the book this is in the Eighteen hundreds by the way uh it says the entire east side is it a state of uproar police officer shot it through the streets warning city folk to stay indoors for the night\nMoms have vast size or organizing under the lead of anarchists and socialists and threatened to ponder into spoil the houses of the rich who have wrong at a press them for so many years the Fifth Avenue hotel will be the first to feel the fury of the mob the novel continues\nSigning it addressed the New York city where Trump Tower now stands by the way Trump Tower is on seven twenty five\nFifth Avenue in New York\nThis all sounds uncannily weird and of course it sounds like fiction\nBut I Want you to think about plus alter I'm gonna take a break and when you think about ... plus ultra 'cause I'm going to tell you what I told everybody the second hour about how plus ultra\nHas a connection to our president Donald Trump and it's really peculiar and then I'm going to give you one final\nProof that something bizarre is going on\nIn his face time continuum with regard to our president\nPretty bizarre AAA thinks seven three thirty seven hundred as Tripoli six Seventy three thirty seven hundred I'll be back with more right here on ground zero\n\n[laughter] I'm Ron bunkers for closing on how they even some documents front I signed for home equity loan only ...\nShe's the victim of a devastating crime called mortgage fraud your ... title and mortgage are kept on line where thieves foreign and domestic hack them it's simple they forge your title and borrow every penny of equity you happen to your home like this police officer\nI Know about tidal froth sorry register with home title walk and discovered some states had already taken over title thank God I found out of time\nNo bank I don't eat that program or insurance protects you host title lock will for pennies today hold tight to lock puts a barrier around your homes title and mortgage the instant it detects tampering there on it helping to shut it down\nFind out if you're already a victim of title fraud get your hundred dollar shirt free with sign up this at home kind of luck dot com\nHome title lock dot com\nAre you considering a safe to secure your valuables or firearms let's face it shapes are not very attractive they usually end up getting stuck in the garage or in a closet\nWouldn't it be great if there was a safe that had to look up beautiful antique so you could display it in your living space as an air a little while also having easy access to it while there is check out the rhino iron works safe at rhino safe dot com\nAmerican Made an antique styled our Shapes Our part art part furniture and all security\nWhere plus ultra is all over the title [noise]\nAnd plus ultra is a fictional [noise] time traveling secret society\nWhere H. G. wells Nikola Tesla and Thomas Edison and Ray Bradbury and all of these visionaries were a part of it [noise] it makes you wonder does believe tomorrow land is truly a bit of predicted programming [noise]\nWe don't know for sure but you get your calls coming up she believes except at three thirty seven hundred that's AAA six seven three thirty seven hundred will be back\n[noise] when mine\nAnd my [noise]\nMe\n\n\nFifty Supreme courts newest associate justice promises to be a non partisan player on a team of nine\nI was not appointed to serve one party or one interest but to serve one nation America's constitution and laws protect every person of every belief in every background\nJustice Brett Kavanaugh speaking at a swearing in ceremony Monday Night in the White House President Trump apologizing to Kevin on his family during the ceremony for the heated confirmation process\nHurricane Michael's getting closer to Florida now about four hundred and fifty five miles south of Panama said he expected to make landfall Wednesday with torrential rains and the deadly storm surge\nThat storm surge could be a foot high end even be felt in Tampa Bay state of emergency are in effect for twenty six Florida county\nStocks as Evan brown this his thoughts me\n[noise]\n... solved women's quitting time 'cause he Italy say in Lancaster is always going to the forty before avenue a trek within overturned car that's on the right shoulder cruising the ... and get it\nWalk a little ... block here and then ran Lindsey ever were to deal with the spending side of the ten\nYear we go over to forward to right leans off limits until five just traffic report sponsored by ... dot org right now there are young people across the world facing a tough choice continue their dream of education or drop out to help their family put food on the table\nYou can help change their future in a single moment see how far your support can go at ... dot org you're listening to the Patriot this is a um eleven fifty\nReally good I didn't make a mortgage enlist when they for to such credit for some ...\nGet a lower payment on a larger alone now have you been told no on a jumble purchased a refinance Michelle towns says yes hate your friend Sean Hannity here that maybe it got one of those quote interest only loans that's about the double or maybe as simply need some cash out well after almost three decades processing loans Michelle knows how to go outside\nThis is my body right before we had some firehouse substantial do some new firehouse pub steaks up savory steak crispy fried onions you know rich Belgian beers cheese sauce on top court limited time more to yours firehouse subs dot com dang remember a portion of every subject by help somebody lifesaving equipment first response\nSub joined more sub save more lives somebody time only put friends\nWe saved him over a thousand dollars per month\nAll Michelle with a town group before interest rates go up just say Sean Hannity told you to speak directly to the girl to get that done all eight three three my jumbo loan ask about her fourteen day closing guarantee call eight three three my jumbo loan eight three three my jumbo loan\nHillary Clinton is gone out of our life she keeps trying to rear her head up into our lives but she's done you know it in I Know she has no effect on my life anymore but what [noise]\nI'm quite Lewis and you're listening to the best to ground zero please hold all the calls is pre recorded\nIt's not enough money should be who they are\nI'm not around the last since everything gotta [noise] not a\nWhole thing [noise]\n\n[noise]\n\nMostly we use weights\n[noise]\n[noise]\nThat's right timing for baseball I like rubber\nBullet [laughter]\n\n[noise] I'm\nQuite Louis [noise]\nYou're listening to ground zero [noise] them back in time if someone could time travel what would you want it to be [noise]\nGood to be that our president is it time travel it could be that maybe his association with his family were the reasons behind old science fiction books to talk about buried and Trump [noise] good to be but maybe there's a relationship with Tesla\nOr maybe a secret society called plus ultra that isn't called plus soldier but it certainly has a lot of connections\nIn weird weird I don't know things ... there are a lot of connections it seemed to be so bizarre it makes you wonder if they're truly is some\nTruth to it\nTripoli six seven three thirty seven hundred let's go to Justin in Tennessee I just and you were in ground zero\nMatures thank you for taking my call that before I get to the dressing topics on the show just about a personal story about myself\n\nWhen I was a kid I Would sometimes think to myself what am I thinking of the future right now or what am I in the past right now that can chalk that up to the magical thinking it's probably not sure for onto college trans temple or a temple I react to it which is how you get a cat\nMhm but coming to the topics on Tonight Show I'm\nOne of the main things that courage to me is what is the first fires and less subtle way up this information is\nWhat do you mean tell the truth tell tell the truth I'm such a way that I Want to believe yeah sure\nWhat misinformation or actually this information is is basically it's a bunch of lies wrapped around a kernel of truth\nIn a way they're well maybe that's the case here at the center make all that far away are lot full of tolerance for bad to watch what you say that just hand you're making a lot farther away or not sort of Colorado's by bad lots lost all the other side not to watch there\nWell I mean you you look around you and you see some of the strangest things that came about during world's fairs do look at some of the futuristic ideas that came about during world spare as you look at Epcot Center you look at all those other things that uh you know the Space Needle all the future ideas of going into space in those future idea's\nBeen around since the time of Jules Verne it's like I said the other night it was Jules Verne\nStarted most of this uh these ideas of going to the moon man in the mood even ah itchy wells rope men in the middle east I mean there were there were several uh books that wells wrote that were just far beyond any imagination\nAmen to that\nAnd and then from there we have Tesla and from there we have all of the rumors about what tested was involved with and then we have John Trump who got all of those artifacts from Tesla and was involved with the X ray machines and a\nA nuclear stuff before World War two\nAnd then of course Donald Trump says well a lot of his intellect and a lot of stories came from his uncle and and then we have this plus old for a story out of the movie tomorrow land and it makes you wonder if there is a plus ultra group because it's really bizarre how you look at ... uh mar a Lago\nAnd all over there are tiles that said plus ultra in that hotel [noise]\nIf I can actually do you want to better in terms of the idea of a parallel universe weather's wanted that things may holding try\nUh I don't know go ahead tell me ... yeah marvel exactly uh-huh [noise]\nAll right what's one of the weirder concepts it was Saudi around marveled at forty years ago the whole the whole mid seventies\nAbout doctors strange [noise] nope statements thing being what man thing yeah what the mutants\nNo a patch of swat outside a little town called sister so Florida that was called the Lexus of all realities\nUh-huh this is a multi personal play\nWell and yeah it but it's really weird and it's like we were saying earlier when everything went down with Trump people were protesting Trump's policies and he wasn't even president yet", "show_name": "The Buck Sexton Show", "year": "2018", "city": "Los Angeles", "day": "09"}