{"month": "10", "state": "MA", "station": "WFCR", "content": "Oh oh oh oh to do all the um [noise]\nUh oh\nMean I was\nA strong man\nOr a job\nIn dogs in [noise]\nUh I oh God\nNo no\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nChristopher cash and singing the facts from Shakespeare's The Tempest\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that and E. P. R. dot net this Sunday baroque I'm Suzanne bona\nPeople mistakenly think the baroque music is all cheery dances and light hearted stories that the music but that is not always true to choose the stories are high drama tales of ribs vengeance murder blood and violence and you'll hear a few of those scary stories set to music today just in time for Halloween [noise]\n\nOr if he is wasn't mythological musician and poet with an extraordinary ability to charm living creatures\nWhen his wife than if you're in DC died he was devastated so where the U.S ventured into the underworld to retrieve her the descent of or fee us into the end for now is the title of Marc Antoine ... opera about or the U.S\nPolo debt and Stevens dubs lead the Boston early music festival performing an excerpt from the opera\n[noise]\n\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling fall gene CVS dot org\nWow\nMan on\nA on\nA\n\n\nNa\n\nNa na na na na na\nNa na na na na na na na da\nDa\nDa\nDa da da da\nDa da da da da da na na na na\nNa\nNa na na na na na na na na na na\nNa na na\nNa na na na\n\nNa\n\nNa na na\nNa na na\nNa I'm yeah I'm a I'm\nA um [noise]\nStreaming of New England public radio was funded by un June ... architects or forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\nOh [laughter] [noise]\n[noise]\nOh [noise]\n\nBoston early music festival performed an excerpt from mark ... of the descent of for the U.S into the end for now\n\nIs it Sunday baroque and like everything you hear on this station it's made possible thanks to generate support some listeners like you\nHave you heard the phrase helicopter parents well these are parents who hover around their children interfering in their lives and narrows mother ... was the original helicopter mother when she heard her husband ... immediately launched a campaign for her son to replace it and then\nWhen he has returned alive after all she plotted to poison him to prevent him from ruining her plans\nChurch Frederick candle used the dramatic story of defeat the plot of an opera ... music baroque orchestra plays excerpts from handle ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\n\nGene them on ... music baroque orchestra with soprano Carina goes on in some highlights from George Frederick handles opera ... you are listening to Sunday baroque\n\nGood morning and this is New England public radio where Sunday baroque continues funded by you and WFCR partners Amherst Hampshire Mount Holyoke in Smith colleges in the University of Massachusetts Amherst\nAnd by ... Center for the performing arts in stores presenting the comedy of can see six Americas drag a pillow beauty shop quartet on Tuesday October thirtieth at seven thirty\nNew England public radio was planning another jazz baby party the hotel north Hampton\nIs a perfect venue for the party don't miss it it's coming up and you can get your tickets now and the E. P. R. dot net and more details about jazz baby this is New England public radio in Amherst in Springfield an eighty eight five where Williams town at Ninety six three and it N. E. P.\nR. dot net good morning\nThis program is funded thanks too generous ongoing support provided by the friends that Sunday baroque who's contributors include Dr Louis piper uh Stratford, Connecticut\nAnd the DEA used her magic powers to help Jason and the ... quest for the golden fleece and when Jason betrayed her she used witchcraft to take revenge\nSeventeenth century French church musician Marc Antoine shop on Jay wrote in opera on this story lays off Laurie ... arts ensemble plays some of ... uh [noise]\nStreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\nStreaming of New England public radio was funded by the un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n\n\nWe have so much what last year we're doing it again the window and public radio stuck in the end you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north up and get your blood red zone get your tickets today you're done\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... [noise]\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that were rolling for full gee CVS dot org\n\n\n\n\n\nStreaming of New England public radio was founded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the [noise]\n\n[noise]\n\n\nThis New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ended N. E. P. R. dot net\nSunday borough continues next to seven funded by you and the Hartford symphony orchestra representing brass and Brahms featuring the each us so horn section with Thomas Wilkins conducting November second through fourth Hartford symphony dot org [noise]\nLater this morning a celebration of Howard Hansen's birthday with his ... symphony and more along with music by some of the composers he championed classical music begins at ten o'clock this morning with John stolen\nStreaming of New England public radio was funded by you and they failed university graduate schools MS and applied laboratory soil Chet operations and rolling no for August twenty seven applications that they passed dot edu [noise]\n\nThis is Sunday for real concerns and Boehner [noise]\nComing up this week and an ancient times the occasion was observed as the eve of the new year time when the world of the living in the dead overlapped\nTricks in our goody bag but we are ending up into the musical treats such as the dance of the fury or protect looks out for about ... ventured into the depths of the inferno to rescue his the love it [noise]\n\nThan tide them is a musical group at the contours of ... the name has nothing to do with horror movies they chose it because they wanted a memorable name ... plays a pair of fantasies by sixteenth century English musician John Ward\n\n\n\n\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional and education business health sciences psychology A. I. C. dot edu\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nDreaming of New England public radio was funded by ... architect or forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nNa\n\n\n\n\n\n\nLearns Dreyfuss lead ... to fantasies are fun does he is composed by John Ward he was a English gentleman musician born in the late sixteenth century\nIt's a Sunday baroque blame Shakespeare's which is very thin ghosts are some of the most vivid and memorable supernatural\nCharacters and their mischief and mayhem often figured prominently in his plots Thomas Lindley junior composed and food on the which isn't very Shakespeare with selections performed by the musicians of the globe\n[noise]\nWe had so much fun last year we're doing it again in the window in public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags zone and get your tickets today any tiara done\n\nAcademy of ancient music played Christopher Hill about looks dance of the few worry\nNew England public radio was funded by un picture by presenting James back well conducting twelve capella voices and baroque songs of praise in great Barrington on November third at seven thirty Berkshire box dot org\nBy ... sausage and south Deerfield specializing in farm made sausages and select moved me more information at ... dot com [noise] end by a gift from the Richard ... Germany funded the Hartford foundation for public giving\nMorning and carry Haley composer conductor an educator Howard Hansen led the east ... school of music for for decades and was one of America's most highly regarded musicians yet he never forgot his upbringing in rural Wahoo, Nebraska or\nHis family's Swedish heritage coming up later this morning a celebration with his Nordic symphony of Howard Hansen leader with classical music beginning at ten here\n\nThis program is funded thanks to generous ongoing support provided by their friends have Sunday baroque who's contributors include the ... foundation and the shelling Family Foundation incorporated\nAntonio with all these ... concerto nicknamed the night she'd probably be called the nightmare it's movements have titles such as in has upset the dream mentally goo breathe slow movements make this one of these more unusual ... does ... performs with e ... [noise]\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio was funded by ... June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n[noise]\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by ... they have to go to ... graduate schools and acid applied laboratory science that operation rolling no for August twenty seven applications that they passed dot edu [noise]\n\n\n\n\n\n[laughter]\nStreaming of New England public radio is fun to go out you had the hotel or a town offering six meeting at the vets basis for a board room to room with a the equipment and the good house catering hotel north Hampton dot com\n\n\nStreaming of New England public radio was funded by un June riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\nStreaming of New England public radio was funded by un June riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call from\n\n[noise] [laughter]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students know enrolling for fall gee CVS daughter word\nFind our breath ensemble played the devils dance the comedians mass because Mary clerk and to be\nThe legendary character Foust treated his soul to the devil in exchange for knowledge and while accounting composer to separate church teeny didn't make a ... bargain he did say that the devil came to him in a nightmare playing a melody that tore teeny scribbled down as soon as he woke up\nThis is just that they are teenagers devils trail so not a play violinist Joshua Bell with her court is John Constable\n\nWe have so much one last year we're doing it again in the window and public radio second then you'll just be be Nineteen twenties holiday party Saturday December prove to the hotel north hoping to get your blood red zone to get your tickets today you're done\n\n\n\n\nStreaming of New England public radio was funded by un cute little architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]", "year": "2018", "show_name": "Sunday Baroque", "city": "Amherst", "day": "28"}