{"month": "10", "state": "FL", "station": "WJCT", "content": "Tempt it was no surprise then that when ... was admitted to the University of Kansas on a federally funded program for minority first generation and low income students the small handful of white kids all ready in the program\nHad given themselves the nickname white trash scholars\nHeartland deepens our understanding of the crushing ways in which class shapes possibility in this country\nIt's an an sentimental tribute to the working class people smart she knows the farmers office clerks trash collectors waitresses whose labor is often invisible or does stained\nIt's also a tribute to the Kansas that's more still feels connected to a place of beer parties out amidst fragrant rolls of wet hay and tractors pulling sleds full of kids through the flat snowy fields\nTrying to capture the good the bad and the ugly of her white working class childhood in this memoir ... reflects that\nWe can't really know what made us who we are\nWe can come to understand though what the world says we are\nIn heartland smarts powerfully talks back to a world that mostly told her and her family they were disposable\nMarine Corps again teaches literature at Georgetown University she reviewed heartland by Sarah Smart\nTomorrow and fresh air we'll talk about the crisis had Facebook serious data breaches and the Russian disinformation campaign and twenty sixteen up with the company and its founder Mark Zuckerberg under scrutiny as the mid term elections approach\nWe'll talk with a New Yorker staff writer Evan ... about the data breach and about how Facebook became vulnerable to spreading disinformation I Hope you'll join us were closed today show with music by trumpeter and percussionist Jerry Gonzalez who was a pioneer and blending jazz and Latin music\nHe played in bands led by dizzy Gillespie McQuade diner Eddie ... airy and in one of the leading New York's awesome band ...\nHe brought both music worlds together as the leader of the Fort Apache band Jerry Gonzalez died on Monday in Madrid from smoke inhalation caused by a fire in his house he was sixty nine\nFresh air is executive producer is Dennis\nOr engineer today is Adam Sandler chef or associate producer for digital media is Molly\nCorporate terms from the fish\nAnd from western hotels and resorts western this committed to the wellbeing of travelers offerings like having a super foods are registering and given for would work out here is left behind it home west west rise learn more western dot\nWith more than five hundred tire models from twenty to manufacturers and an online tool for finding tires based on vehicle meets budget and brand tire red dot com helping drivers find deliver install\nMay management services specializing in ... association management for condo and single family home communities since Nineteen eighty eight serving the first coast more at the may M. G. T. dot com\nJacksonville central for clinical research at W. J. C. T. present insomnia argue nocturnal and informative luncheon learns seminar friday October eleventh at W. J. C. T. studios registration at W. J. C. T. dot org\nW. J. C. G. jaguars season parking is still available\nThe part of the coolest tailgating downtown includes pays space\nAnd indoor bathroom access contact holy men\nThree five eight six three one\nOr log on to W. J. C. T. dot org slash bar\nReserved yours face today [noise]\nHi I'm Andrew ... the best in classic modern loses I won't watch Blue's arise on Monday and Wednesday nights littler right here on eighty nine nine W juicy your community\nHere listening to eighty nine nine Jaycee teach Jacksonville your community your world partly cloudy overnight a low Seventy two Thursday it's going to be mostly sunny and hot with a slight chance of rain in the morning I in the upper eighties\n[noise]\n\nFrom politics and public affairs to arts and entertainment first 'cause connect connects you to everything that's happening across the northeast Florida I'm Melissa Ross get plugged in as we interview the most compelling newsmakers of the first coast\nComing up this morning Jacksonville see the girls some it will tell you about it then later marking forty years of reverse city pride that in more ahead this hour on first coke can act [noise]\nWell I Will be a ... inspired by the by the theme that that the policy center's already chosen hope is something we do and I think it's important for us to talk about that now because it's very easy for us to think up hope at some sort of um [noise]\nA fence ... wish and I think as a culture when we start to look at ourselves when we look at the whole stories of people around us we start to find ways that we can contribute to healing when we talk about hope we'll be talking\nAbout particular you know particular skills what can we do other than wish things were better how do we get involved in creating healing and reconciliation\nI'm In the places where we are hurting the most and I think given all that we're seeing right now we could see that there's\nArt everywhere right now so many of the systems that we've relied on to work aren't working very well at all so it is for us I Believe to try to create spaces are sanity and gentleness and bravery and healing\nSo that we can create the kind of world that we want to be a part of and that we want to leave us a legacy to the our young people\nDr ... she's right in that this nation is hurting right now the country is just the raw wound at the moment particularly around the topic of\nSexual abuse sexual assault\nThe Supreme Court confirmation hearings have expose these deep fault lines in our society\nAnd with the me too and the time's up movement really cresting right now\nWomen and girls are insisting that their experiences be validated that they be heard that uh people take them seriously when they talk about ah being assaulted\nAt the same time we have the president of the United states saying no it's the mothers of sons that should be worried if they're if they're boys are falsely accused and so you know\nI was thinking about this as you were preparing to come in here and talk about this today because you advocate for girls and so we need to be very clear about that you are here to advocate for girls who have been traumatized\nHow do you how do you get this message out in this kind of political climate um it it's really really\nDismaying to see where we are as a country right now when it comes to us\nIt is very disheartening and I think more than ever it's why the summit is so important\nThat hope is what we do and bringing Dr Walker to help us to find the skills that we need\nTo be able to have dialogue in conversation in our community to also hear each other to hear both sides of this issue while at the same time knowing that we have a ethical responsibility\nTo model for our children what it is that we want the world to be and more than ever that's why this summit is so important\nWhat will people learn when they come to this and and who's ... who were you hoping comes by the way Vicki\nSo we are really hoping it's open to everybody it's open to both men and women service providers community members um we really are hoping that anybody that is um that have girls in their lives will attend the summit and we have that\nMany tracks available so it's open to anybody that's interested in learning about the research around this we have a track at focused\nOn media and I know that you will be on a panel is so we're excited to have you attend and participate in this year\nWe also will have one that specifically focused on those that provide services and so both the London I Will also be I'm presenting and I'm also it's really about providing tools so that individuals can walk away and having\nTools on how to start shifting conversations having tools on how to start doing the work with girls differently so that we can respond differently in our community to the needs of girls\nA whole trauma informed uh\nCare movement that that's a big part of what you do is in it and as I was listening to NPR on the way into work this morning and lay listening about the FBI investigation into\nJudge Brett Kavanaugh um that is not what is going to take place with this FBI investigation that is not how they operate but increasingly in the criminal justice system organizations like yours or nudge ing the system to to operate more that way right we\nAre and we're also advocating for even a deeper perspective that moved beyond trauma informed care\nTo healing centered communities that really recognizes what needs to shift in our community to create safe spaces and healing places for young people and particularly girls and young women\nTo find a sanctuary or healing can take place and we can shift from blaming and shaming\nTo actually providing those resources and support that are needed to heal from the trauma\nAnd you're talking primarily about sexual violence ... we're talking about sexual violence enraged and sexually abused\nWe are we work with young women who have experiences of sexual abuse sexual exploitation sex trafficking and we know that the pathway to the justice system is really paved by that exploitation and once they are in the system they are reach traumatized and re victimized\nLet's go to your calls about the the the girl summit five for nine to nine three seven Fred is in Jacksonville Hi Fred good morning\nI have a couple of questions that first one so I get on the women and how we want to help them a lot but what about the guys like myself in their eyes on a lot of issues of a\nSexual abuse of children mhm and what do they do much for us\nYeah yeah thanks for that Fred and I appreciate the call 'em you know I think the correct me if I'm wrong ladies one and for young women will be sexually assaulted one in six young men so this is a problem for boys to not as big a problem but it's out\nThere Vicky I'm\nAbsolutely we recognize that this is just as big of an issue and just as impact oh I'm On men as it is on women and while the Policy Center is focused on women there are other organizations that\nFocused on boys and men and so um our mission is specifically girls and young women and um but recognizing that as we shift\nThe world for girls and women we also see the ripple effect and how the world changes for men and young boys as well and we see that in our research\nOn in schools and communities that as we list the voices of girls we also see that we start to see better treatment of boys\nAnd but we also recognize so\nI'm so when we start seeing conversations and interactions and treatment programs and\nTherapeutic mode allergies all shifting for girls recognizing that we need to move like I'm Dr Weaver aside from trauma informed to healing center of communities\nThat also means that the work needs to look different for boys and it means that we need to look beyond the trauma we need to look at the fact that the individual was strong enough\nThat had they had in they had strength they had resiliency that their story was beyond just that moment of that experience um\nAnd so this whole ... story this whole experience is what they are today\nAnd when you start looking at the person as a whole human being you recognize that their healing is about the whole human being and about the whole story and so if we start she not for girls we also shifts ... stuffed her Walker\nLet's not leave you out of the conversation what are your thoughts about that [noise]\nUh I think I Would certainly echo adoptive us was said and I would want to say also that when we talk about feeling subject communities it brings our focus to the fact that a lot of exploitation\nW. J. C. G. readers are here for you with the Florida Times union complete with news op eds and open our readers will bring the paper to live to serve those with blindness and other physical challenges need our service go online to W. J. C. T. dot org slash radio reading listen there\nAnd register as a listener or will send you a special Radio Free\nCall us at NATO for three five eight six three oh wait because radio reading we give voice to the printed word\nMany places in downtown Jacksonville being considered for demolition or we develop and have had their history last\nHow can we bring the story back alive while determining a future forty ... W. J. C. T. aboard the ship promoters of each present the Jackson forgotten space Tuesday October twenty third WG restrict the evening begins with a reception of strict followed by a panel discussion at six thirty [noise]\nAre speaking with is free of a pet W. J. C. T. dot org slash about sponsored in Port downtown person [noise] [noise]\n[noise] Hi I'm Andrew Brooklyn host of ... [noise] the best in classical modern loses now twice a week blues arrived on Monday and Wednesday nights at eleven right here on nine Jaycee to your community\n[noise] well before the coastal school of law is reporting some positive news this month they're graduates have achieved their highest first time at Florida bar pass rate since July of twenty Fifteen\nIt's a welcome turn of events for the school here in Jacksonville earlier this year in ... Florida coastal holding company had filed three lawsuits in federal court against the American bar association\nAfter the a BA found that in flaws three law schools one in Charlotte one in Arizona and one here in Jacksonville we're out of compliance with their admission and accreditation standards\nFlorida coastal remains accredited and is not on probation however\nCharlotte school of law closed in August and Arizona summits accreditation was rescinded\nIn June by the a BA so what's Florida coastal doing rights well here with more we welcome dean Scott DeVito and Jennifer ... dean of academics both with Florida coastal school of law good morning good morning\nAnd let's begin with the good news congratulations on the news\nScores that's got to be a nice change a\nYou know to be able to report something positive because there have been some issues lately at ... at ... so what do you attribute the new scores too\nBut I think there's a couple of different things and ah I'd actually like to turn it over to dean Robert because she's really the engine I think for a lot of these these changes\nSo for the ... we are very proud of our results we were sixty two percent an estate both in February in July we were ranked fourth and then seven\nAnd we are with in this state average by if you point which is highly significant\nThe biggest thing that we did is is when we have to think our faculty our faculty implemented a lot of changes with us and was very supportive of our students and we also started some new bar prep classes and in doing those and in changing the way we helped our student approached material and approached the bar exam\nWe've really seen some very very positive result\nIn fact one of the things we are most proud of is even though we is continue to raise our missions credentials sense that twenty sixteen\nThe students who took so far this year had the same entering credentials of those in twenty sixteen and twenty Seventeen when our results were not what we wanted them to be so we're very proud of the fact that through our curriculum at our ... faculty and\nOur prep class that we have really been able to pull up our results and I will tell you we are the only law school and the state of Florida who from Seventeen to Eighteen at each our our results raised each time\nCongratulations that's great and in Florida coastal has always had the mission of uh\nOpening up law school to students that might not be able to afford another uh\nInstitution or making it more accessible getting students practice ready when they graduate I'm so dean DeVito that has been at the school's reputation for a long time\nCan you bring us up to date though on where you stand with the American bar association because there's been some back and forth about that\nYes so the American bar association found us out of compliance with three standards rely on a three oh nine be and five oh one day\nAnd we've been working with them to convince them that we actually are in compliance on those standards we believe are in compliance but they found that we're not\nSo this is what happens next is they're going to want to see some solid results from us and just some history from us I think that's the next six months or will be providing them this information about bar results about the improved entering credentials and continuing to build that\nConnection with the VA so that they feel comfortable that where where we need to be\nYou're in a better place than uh your sister schools that are under the umbrella of the holding company in ... the school in Charlotte closed actually closed the school in Arizona run by until I had an its accreditation recent it what what mistakes did they make a ... I guess Florida coastal has not made\nI think the primary thing that we've done that was different was that we started making changes a little bit earlier than the other two schools for Charlotte I think they were in the wrong place at the wrong time and the actions that the department of education to were\nVery dramatic and drastic and to be if they're completely out of the ordinary up a ten minute how do you\nMean out of the ordinary was very rare for the department of education to move in\nAnd remove someone's titled for funding when at the first point at which they're creditors said we're worried about you and that's what happened to Charlotte school of law and there were just never able to recover from that as a consequence we're not in any position where we would be put in that that scenario\nBut our movement to raise entering credentials are real drive to ensure that our students do graduate practice ready and able to pass the bar I think we just started that a little bit earlier and as a result we're getting the benefit of that outcome\nOkay um so dean ... um for students that have been watching all of this and maybe might have hesitated to consider Florida coastal school of law what's your message for those perspective law students\nMessages come join us he will pass the bar on the first time you will be ready to practice law in this community or whatever community you want to go home to our make your home in and enrich\nWe had students doing extra and shipped all over the country we do amazing amounts of pro bono work here in our local community we are very committed to pro bono really phenomenal um clinical I'm a professor who has been on your show many times and does great work in the immigration and the family law arena professor ...\nUm we have a lot of opportunities that coastal and so we are happy to talk to you and walk you through what we think we can offer you\nBut we really are on on a trajectory up for it and we're very excited next week our student\nHaving the court competition and judge may car from the first district court of appeals judge ... from the federal bench and judge Hudson from the local state bashed will all be there\nThere's a lot happening at four to ... and we are incredibly coastal proud [laughter]\nWell thank you both so much for being with us uh it's ... got to veto and Jennifer ... dean of academics both with for the coastal school of law here in Jacksonville thanks so much that much we'll be right back [noise]\n\nHi I'm ...\nAnd I'm Talking about and joined us friday for the former on them where we talk about the biggest stories of missing from politics to education the environment and warm if it's news in Florida we want to hear from you\nLet your voices be heard join the conversation on the order on Fridays at noon on W. J. C team\nI'm Jessica ... though every Thursday I had the Jackson on W. J. C. T. we actually have a pretty great public spaces here in Jacksonville Jacksonville is still trying to wrap it around cluster in\nThe urban core was Jacksonville the original ... before the holiday shank tomorrow during MORNING EDITION care on eighty nine [noise]\nSupport for the Jackson on W. J. C. T. come from the Jacksonville downtown investment authority [noise]\n\nWelcome back well this weekend marks the forty of the year of pride celebration in Jacksonville\nThe very first river city pride parade took place in this city way back in Nineteen Seventy eight of course it was a very different time than uh than it is today it's really remarkable to think about the evolution in our culture over forty years for algae beaches to people\nLocal celebrity courage to Wade is grand marshal at this year's bank of America pride parade joining us now in\nOnline and finally I'm this summer apple took down infowars as\nA podcast and then very soon thereafter a Facebook and other companies followed suit and I talk to them or talk about it I said why did you wait this\nWhy did you wait so long why did you wait so long to take down this thing that people had so clearly complained about it and he said well which we don't want to punish people who are just wrong we don't want to ban them from Facebook what we're trying to do is figure out how to shape this thing and\nHe acknowledged in effect that because apple had moved on this that he said you know at that point we realized we had to make a decision we had to get we had to get rid of this and and so we did it\nBut from my perspective what was interesting about this was that this is the very beginning of an issue for face but this is not the end I mean this is\nJust the front edge of an unbelievably complex problem which is what are the bounds of of free speech what do we actually want to be able to have\nAnd what do we consider to be out of balance what is in effect shouting fire in a crowded theater and what is legitimate provocative unsavory speech and and these are some of the hardest problems that we face and they're now in the hands of let's face it there in the hands of the engineers the people who created this incredibly powerful a application\nYou know there's lots of First Amendment law that says the government can't distinguish types of speech and prohibited um is it clear that a private company like Facebook can but it's this big\nWell actually if Facebook as a private company can do whatever it wants on speech if if they decided tomorrow that you couldn't talk about golden retrievers on Facebook they could put that ruined place and I think for some reason that\nWe find ourselves really torn you even if you're not a fan of info wars and God Knows I'm not\nIt has to make a person on easy to know that there is now a company which is capable of deciding not only what kind of information it's going to suppress but also which kind of information it's going to promote\nAnd on any given day there are people who are going to be offended by those choices um\nBut the tools by which Facebook has held accountable or not the tools that we use in politics it's not like you vote the bums out\nIt's not like people are appointed to Facebook's board as if they were Supreme Court justices this is a case in which a private company is making profound choices about the contours and the boundaries of political expression and we don't have obvious tools with which to regulate them\nYou know when you look at the arc of the story I mean this company founded by mark ... has this astonishing growth is deeply committed to growth and in doing so you know compromises privacy and and ends up\nYou know sharing data it shouldn't about its users and gets into some trouble and a question arises about whether the company has the ability um has the capacity for self reflection whether it can take\nYou know adverse information and reexamine the assumptions and practices and in many respects this really comes down to ... ... what did you find about that [noise]\nI found that he is insulated too I think an unhealthy degree from this kind of criticism and\nIf he was sitting with me right now I Would say this directly the reality is he built the company in his own image she's had the luxury of sculpting an organization too is like I mean quite literally the the blue color that Facebook has as its signature blue\nIs chosen because he is red green colorblind than he prefers to look at the color blue you can see a very distinctly so in every way both physical and spiritual this company\nReflects his sensibilities but in order to be able to continue to grow and evolve and respond to the problems that it encountered\nHe needs people sitting in the room with him who will tell him mark I think you're not seeing this the right way you're not seeing this clearly you're wrong and I I was struck that in our interviews I got the sense from him that he knows that on some level he's tried over the years to make these\nChoices to get outside what he described as as as as the bubble or he's got five people who report directly to them and they are all people who he has an effect chosen a and installed in those positions and there's very few there are very few people at Facebook who are willing to stick their neck out and say I fundamentally disagree we need to do things differently\n[noise] you know at the end of this piece you write that some people think of Mark Zuckerberg as an atomic tongue with little regard for the human dimensions of his ...", "show_name": "First Coast Connect With Melissa Ross", "year": "2018", "city": "Jacksonville", "day": "04"}