{"month": "10", "state": "TN", "station": "WPLN-FM", "content": "Is Ninety point three WPN land National Public radio Ninety One point five WTO mountains of Houma and Ninety One point seven W. H. R. S. Cookeville get the latest stories from WPN lend news throughout the day and connect with National Public radio via Twitter and Facebook at W. P. L. N. dot org\nYou can also find schedules for all of our program channels and listen to a live stream of any of our programming on line learned more about connecting with Nashville public radio at W. P. L. N. dot org\n\nAmerican by birth or not today on the world\nMarket or woman President Trump says he wants to end birthright citizenship but he may not have the authority to do that\nThe Supreme Court and Congress have an important role to play and Kansas has will stand as ... we expect in on the president's executive order as he seemed to have proposed and\nJose Antonio Vargas isn't surprised by the Trump focus on immigration ahead of the mid term the writer has been called the best known undocumented immigrants in America but he's still hopeful but at a time like this I have to believe in love I have to believe the generosity of people\nI have to believe that we don't struggle level that's all head today on the world\n\nAnd I ... with the b._b._c. news Denmark has demanded new a new sanctions against Iran objects edited fall as an Iranian plot to carry out an assassination on its soil in the region citizen of the Iranian background has been arrested who's ... has ...\nOff to the Danish intelligence service announced that it had uncovered an attempt to murder and Iranian or a ... the reaction from Copenhagen has being swift\nThe uranium ambassador was summoned to the foreign ministry to be told in no uncertain terms that didn't ... actions is totally unacceptable\nIn this age that's what's so they're influenced by the prime minister also cash missing who described Iran's behavior as medieval Denmark has also taken the risk of immediate and a recording it some sort of from Iran and its consulting allies about new sanctions Iran says the accusations are conspiracy bites opponents\nFunerals are underway for the victims of Saturday's shooting at a synagogue and the U.S city of Pittsburgh in in ... were killed in what's thought to be in the west anti Timothy attack in recent us history security has been increased had to visit and the next job by President Trump jumps article it didn't it back\nIn the wake of sensitive to the Gulf of Mexico the president condemned anti Semitism unequivocally appealed for unity but his visit to Pittsburgh later today is not having much effect the mayor of Pittsburgh and several other elected officials are refusing to meet Donald Trump\nUnder section of the Jewish community is also boy causing his trip to the city the leader of a group that speaks for a number of left wing Jews so she wanted to meet him until he probably didn't know\nDonald Trump's fiery rhetoric and the increasing incidents of hate crimes United Nations human rights chief ... is pressing Saudi Arabia to lead independent foreign ... joined the investigation into the mud or the dissident generalists Jamal ... G\n... to reveal the whereabouts of his body to enable crucial forensic examination\nThan it tore is full my boss of the Boston based crime gang has been found dead in jail the FBI has begun an inquiry of the body of James Whitey Bolger was discovered a maximum security prison in West Virginia us media reports say he was killed his Nick Bryant\n... was one of America's most notorious criminals me being on the wrong for sixteen is who was eventually transferred into size and an eleven in Santa Monica California following it said both from a neighbor\nOr ever since his conviction he was convicted of a ... eleven motives and\nUh most uh activities and included gambling and gaming even our rights gun running at one point he was held in very high security facility is and what is interesting about the timing of it does is it it happens just a day off so he was moved to this very high security facility in West Virginia\nYou're listening to the nation's well news from the BBC\nThis is Ninety point three WPN Lynn Good afternoon I'm Natasha ... which\nI twenty four and Murfreesboro has been reopened after state troopers deployed a robotic device to remove an explosive the Murfreesboro post reports the incident began as a domestic disturbance call police say a woman who accused ... of assaulting her told him he fled in a pickup truck that might contain weapons at an explosive device\nWhen officers later located in St outlay on on an eye twenty four off ramps they found the device which state troopers now say has been rendered safe and was arrested and it's being held by the weather for county sheriff's department on charges that include aggravated domestic assault and possession of explosive components\nAnd it was national synagogue last night national or by rabbis urge more than a thousand people to speak out against hateful words and actions falling the shooting in Pittsburgh one of those in the audience who share lane who says her initial reaction to news of the attack was fear\nThe people who were there were the regulars the people who come first thing [noise] it's just so horrific because they're us\nLanes has her own synagogue decided to cancel social event on Saturday Night because they didn't have a guard on duty one of the rabbis Laurie rice a congregation Mike I told the audience she believes hateful speech is at the root of the violent she thanked fellow clergy for reaching out in support of the Jewish community over the weekend\nProperty on church street that once showcase some of Gibson's most exclusive custom guitars will soon become a mixed use development\nNatural post report the New York based real estate firm has purchased the north coast property for eleven million dollars pardon the instrument makers federal bankruptcy case the deal's been held up in court for nearly a year from some air road also bought another Gulf property from Gibson that it says will be converted into a bowling alley and arcade\nGibson brands recently ousted its longtime CEO and is expected to emerge from bankruptcy in the coming days\nSeventy four degrees that to a six\n\nWord for the world comes from babble a European made language learning program babble teaches practical conversation and Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com\nAnd from Clark university's international development community and environment department which recognizes that administrations change but global problems persist\nInformation about opportunities to develop solutions to global challenges enter and research into action\nWeb streaming of Ninety point three W. P. L. N. F. M. is made possible by listeners support learn how you can support this service at Nashville public radio dot org\nTo change that from lowering the number of refugees admitted to the U. S. a record low cap on the President Trump to making the laws of migrants coming to this country miserable\nNo Trump says he plans to eliminate birthright citizenship that's the idea that if you were born in the U. S. you're automatically a citizen it's not clear if he can do that the concept is enshrined in an amendment to the U.S constitution for the president told actually as he could do away with it unilaterally\nYou can definitely do it with an act of Congress now they're saying I can do just was an executive order\nMartha Jones is a professor at Johns Hopkins university and the author of birthright citizens a history of race and rights so this is all tied into the fourteenth amendment and there was an interesting history behind that could could you talk about what went into forming a\nSure the fourteenth amendment comes into being in the aftermath of the U.S civil war for a million plus former slaves are now free people and the question is who will they be in a formal constitutional sense with respect to the nation\nThe fourteenth amendment declares them to be birthright citizens but it goes further of course because it extends beyond former slaves to all persons born in the United states making them citizens at the United states\nSo let's talk about that a more in a moment I'm up because it's all part of of your research let's just get into the president's for what we're looking at today or a prior case that's came close to defining or interpreting this from the Supreme Court the most important\nCase for thinking about this question is that of a gentleman named belong Kim arc\nUm which has decided by the Supreme Court an Eighteen Ninety eight one Kim ark is born in the United states\nUm his parents are Chinese immigrants who cannot become citizens of the United states because of the existing Chinese exclusion acts of the period but long himself assumes himself to be a citizen because he was born in the United states he\nLeaves states to do business in China\nAnd when he returned chief detained at the port\nAnd refused entry entry his case goes to the U.S Supreme Court where the court affirms that\nEven as long as our parents cannot become citizens of the United states he because he was born in the U.S pursuant to the fourteenth amendment is a citizen\nSo it seems like the cave kind of centered on the parents did did the outcome at the Supreme Court essentially defined birthright citizenship as we know today\nWell it did and they important sense that um it rejected the view that one citizenship turned on the citizenship status of one's parents\nTragedy I bet you that more people are gonna be more willing to help\nWith Antonio Banderas his new book is called dear America notes of an undocumented citizen let's say thank you thank you so much about it [noise]\nWe have Ruben shouldn't always full interview with Vargas by the way that the world dot O. R. G. us a world\nSupport for Nashville public radio comes from the frisk art museum now presenting Paris Nineteen hundred city of entertainment and exhibition with more than three hundred pages sculptures costumes photographs and posters including work by the federal law and to lose the truck more as Frist museums art or from farms your own health plans of Tennessee\nWhen it comes to financial protection for health care costs no one can predict the future but everyone can prepare for it for plans for individuals families or to supplement Medicare Farm Bureau health plans has got you covered\nAnd Comcast Business providing a gig speed network to help\nGet business done for at Comcast Business dot com Comcast Business beyond fast you put the fun in fundraising things for hanging with this during the fall membership campaign the listener is the most important part of what we do your generosity inspires is bringing even better stories throughout the year ... thank you for [noise]\n\nI'm ... and this is the world\nFor a platform that was supposed to build communities become pretty clear over the past few years at Facebook's communities have some problems hate speech disinformation fake news\nThese problems don't just live on line this spill into the real world and they have serious consequences or colleagues that front line here at W. GBH has spent a year looking deeply it out all this has impacted people all around the world they're documentary the Facebook dilemma is airing on PBS this week\nWe want to focus on one country discussed in the documentary the Philippines where president Rodrigo Duterte day is accused of using a coordinated army of trolls to silence critics\nGave it a name patriotic falling on line state sponsored hate that is meant to Ireland meant to intimidate so they're saying that information because that just in terms of democracy and we're allies are probably [noise] when lives are truth\nLines James Jacoby worked on this investigation and joins us in the world studios thanks for coming by James thank you\nMost Filipinos like how much of the population has access to it and how much do they interact with each other by the up\nWhile it's remarkable the story Facebook and Southeast Asia is amazing and they pushed aggressively into south east Asia and to Philippines and demand more other countries\nAnd they are essentially the de facto Internet and a lot of those countries because they offer Facebook as part of a data plan where people don't actually have to\nUse data in order to use it and in the Philippines it's between Ninety and a hundred percent of the Internet users in the Philippines use Facebook as the Internet basically and Maria wrestler who who's a the the woman were interviewing in the film from the Philippines who runs a big news organization there she\nTalks about the fact that it's their public space it truly is their public space in the Philippines um in terms of the ... their digital lives\nSo Maria ... so we just heard from her more from her in a moment um we've reported on the store that uh occurred in Myanmar where fake news actually led to the violence hounded Rodrigo Duterte day the Filipino president weaponize Facebook during the election campaign and twenty sixteen\nSo what happened is Facebook actually offered a lot of help to ... uh during his campaign for president and helped him to really harness the power of the platforms helped his campaign really understand how to use it effectively and as Maria wrestle reports\nAfter he was elected he essentially weaponized it by turning all this campaign machinery all these accounts that he was controlling he had\nA network of fake accounts and paid followers that we're descending all sorts of lies about his policies and also going after critics in a rather vicious hateful way um and in some cases are trying to incite violence against people\n[noise] so uh on Maria rats or a ... this activist I mean she worked for a prominent news website in the Philippines Rappler media and when she started noticing this problem she actually brought it to Facebook's attention in twenty sixteen as we learn in the dock here's an exchange between you James Anne Marie arrest so\nWere you given an explanation as to why they weren't acting [noise]\nNo\nI think baseball one game conditions and they were focused on what they didn't realize is that countries like China [noise] countries way institutions are clear corruption is France don't die [noise]\nWhat happens when you bring everyone onto a platform and June ... any kind of rules\nIf you don't implement those walls before in wine country chaos\nSo James what did Facebook tell you about the way they responded to the Philippines and to Maria Russia's complaints\nWell Facebook has set a number of things in response to it on one they said they were too slow in addressing the problems that Maria brought to them and it wasn't until Maria\nProduced and published a three part investigative series that exposed the fact that there were these accounts that were spreading hate speech and misinformation that Facebook actually took action on those accounts\nBut as she tells us the problem is ongoing interestingly recently and as a as I think it was an April Facebook is pain Murray arrest US Organization to be a third party fact checker of things that are going viral on Facebook in the Philippines\nBut as she put it to us recently they're completely inundated and Facebook still doesn't really have handled the problem there\nDoes that suggest you know hiring her as a fact checker ... does that suggest Facebook is going to pursue and due diligence or they were just trying to plug the hole I think that that their facts\nAround the world um is what they're seen as the first step toward a solution or at least containing the problem of hate speech and misinformation to have\nPeople on the ground that are fact checking material in the home country on in the language and um it's really an outsourcing of it and what's also fascinated about it is that\nRare rent restaurant runs a news organization and she's utilizing resources that would otherwise be put toward reporting and doing fact checking riots going viral on Facebook\nYeah [noise] um if you zoom out of the Philippines a for a moment I mean many of us are closely watching Facebook's operations here in the U.S and abroad and the the big question which you raise several times are they doing enough at Facebook to stop these campaigns whether it's disinformation\nFake news hate speech uh what do you think after spending a year investigating all this and actually being at age ... for Facebook\nWell they um it's an interesting question because what does it mean enough and I asked people at Facebook you know what the standard for success here because there is no ability for us to audit them were really left in the position of having to take their word for it\nAnd whatever it is that the standard that they set for themselves but there's so much that we just don't know\nBut as a ... this this is a writer Alexis Madrigal from the Atlantic ah says in your dog and it's really a was a really powerful quote the very things that divide us the most are the things that get the most engagement um talk about that a bit and ... where that's most evident right now\nWell we've got our mid term elections and um and we've had you know that the horrific events here of the past week\nAnd scenes that whether it's the shooter in Pittsburgh or the attempted bomber um these are people that are very radicalized on social media\nPolarization and filter bubbles are are a real thing on social media and this kind of reinforcement of world years that's the main discussion happening right now I think\nJames after a year of working on this er and investigating Facebook or are you on the platform or what if you were or you know off it\nI I'm On it I've always taken a I have a very small footprint on their um which by the way it doesn't mean much in terms of what date of their collective around new um but uh it's just um [noise]\nYeah I'm I'm torn and sign up to ... who is in the film was a scholar at UNC\nUm says I think one of the most important lines which is what are you going to do about the fact that all your friends and family are there it's this tremendous thing to be able to communicate with people it really is an amazing invention budget is so problematic so ... what are you going to do\nJames Jacoby with frontline part two of the Facebook dilemma airs tonight on PBS and you can find part one on line at P. B. S. dot org James thanks very much for coming in like you\nSaid in Eugene Levy him through the old fashioned searching\nFor\nWe're about one minute away from news headlines you're tuned to the world [noise]\nOf the big forces in college campuses today is anti Semitism in those ants of anti Semite so usually not me or not seeing it on college campuses they're promising the radical left so we have to stand against anti Semitism whether it comes from the life or whether it's on similar yeah\nUm I think here again Israeli Jews are not following the intricacies of right versus Latin America\nI think a lot of Israeli Jews as we know from hold support Donald Trump they don't really care so much better domestic policies they don't really know very much better domestic these important Toyotas really due to the Trump support Israel to Trump's support the strong Israel so I'm ... comments I think perplexed American Jews than they do Israeli Jews\nDue to tell me a bit of a reaction among some of Israel's left wing politicians to what happened in Pittsburgh\nSay overall although there has been expressions of condolence expressions of shocking to hire\nThe new kind of quickly moved on here I think a lot of Israeli Jews don't fully understand the impact\nThat this had on the American Jewish community they don't fully understand the plays the synagogue life for American Jews they don't understand that for American Jews a synagogue is a second home it's a place where kids grow up and Hebrew school where they hide as I did like you know hiding out from from Hebrew school in the bathroom with my friend\nAnd a place where you would play and kind of come of age and that you you know this is a place where people feel at home I ... a share a story I did a lot of reporting about the residents of Pittsburgh and the people from where all hell and I'm\nOne of the stories that move me most was the story of Jerry\nRuben ... sixty six years old he was one of the eleven people who were murdered he rushed to the sound of the noise we don't know if you knew it was gunfire at that point to go help and that when he was shot\nAnd and as an immoral and Pittsburgh people spoke about how he had this interesting custom dream order Scottish which is a Jewish prayer memorializing the dead and it's set in every single service\nHe stood up he always stood up for the cash and that is traditionally a time but only those who are mourning actually stand up and when asked why does he stand up every single time he said well I have no children\nSo I stand for all of those who have no one to stand for them and on Saturday everybody stood up and stood for Jerry in in his memory and I think um that standing up and that standing up together is such a metaphor and I think overall Israeli Jews and Israelis in general they don't need a synagogue given Jewish community because they had their just unity\nWithin their own lives and in a way that American Jews if they want to find community if they want to hide a sense of solidarity among other child that they find it in the walls of the synagogue and that is another sort of way that Israeli Jews and American Jews you know don't connect\nDo you know the tragedy does reveal a quite a few differences between American and Israeli Jews what would you how would you sum up those differences like what's the bumper sticker\nHere [noise] and they think I'm\nAn American Jews and Israelis are two very different paths right now to say American Jews for the most part are liberal like consider themselves very much attached to their immigrant roots and because of that they tend\nTo support rights for immigrants they tend to very much believe in the Senate that's repeated in the Bible more than any other tenant which is be kind to the stranger because you two are much once the stranger in Egypt and so\nThere's this very strong desire to knowledge that you know American Jews have done fairly well to themselves and in America and feel fairly successful and feel very comfortable um and I think that comfort to the lens them to sort of be more liberal and more open where Israeli Jews still\nFeel under attack they feel very much sort of the product of sort of post traumatic post Holocaust world where they look at\nThings very much in this sort of the earth some game it times you know a person is them whether it comes to Arab neighbors or you know I'm\nStress from within somehow an Israeli the trend toward sort of like circling the wagons in fear and American jury you have a trend sort of towards plurality Jewish pluralism openness and I think you see those divisions coming more clearly now and the Pittsburgh\nAttach tragically in some ways highlights those splintered\nReporter Dana crop was Haaretz in Tel Aviv she's also the host of the podcast the branch Dina thanks very much for your time thank you\n... ... ... ...\n...\n... ... ... ...\nAnd her life roof gates earned a reputation as a passionate defender of coral reefs [noise]\nWhen you look at organisms and um you look at a coral reef clearly we're losing more corals that we would hope and that means the race of changing the environment of essentially out pace the capacity of the calls themselves to adopt\nRoof gates died last week at the age of fifty six months after being diagnosed with brain cancer longtime friend and collaborator Virginia was so gates was one of the very first scientists to make the connection between coral bleaching and global warming\nShe started in the Nineteen eighties in the very early days when none of us understood what was going on she was able to show that corals did this strange pay lanes and she was able to tie it to warming and at that time we were just starting to understand what global warming was\nOver the years gates became a bowl of teacher and an eternal optimist in a field whose future looks grim until her death gates led a research lab at the University of Hawaii but trying to figure out ways to help coral adapt to warming oceans friend Virginia was says she was also a regular and vibrant public speaker\nI Will remember her ability to light up a room and make everyone in the room I feel like she's talking jets to them she had this wonderful silky highbrow English accent that she joked with for a secret weapon and\nShe was brilliant at it she really excelled at it\nI Know you've described her as an iconoclastic or feel why\nSo she was and I kind of class and a couple of different ways the best one to think about right now is this idea of assisted evolution of corals to very controversial it's the idea that humans need the help corals evolve faster\nTo be able to tolerate the heating that's happening and some scientists really think that that's not our place to do that and but others led by roots really feel that we need to try a variety of options\nShe's the first to admit it may not work but if you don't try it then we can't know but personally I feel very strongly shoes and iconoclast in terms of the way she approached science she disliked pushing your colleagues decide to get ahead and she was much more about\nCooperation and encouraging all diversity brown people and women and because of that sometimes she ruffled feathers but\nShe ruffled feathers to make the world at coral science a more inclusive cooperative place\nSuch determination to help these coral reefs are in the face of the past few years several major Corey bleaching events\nAnd the rest of the news isn't good I mean Karl research expected to be almost completely destroyed in coming decades and yet Rick Gates remained so optimistic how did she retained that optimism all studying something so depressing\nWow it's such a great question mark how I think all of us are trying to bottle that um especially in light of her loss she just\nLooked forward and she felt like you know we can try our hands up and give up or we can look for solutions then I think her enthusiasm really instilled that\nSame passion and a lot of other people\n[noise] what is the one memory of Virginia that you'll always hang onto about Rick Gates\n[noise] her laugh you know she was not a big person but she had this huge laugh that failed around people in restaurants would turn around and stare I mean general and she laughed she left early and often and it was infectious\nVirginia was a biology professor at Oregon State university and a longtime friend and colleague of coral researcher roof gates who died last week Virginia thanks for telling us about Ruth and our condolences to you thank you so much Marco\nMm Mm Mm\nMm\nThis is the world's going to\nSupport for the world comes from YouTube originals and roadside attraction presenting Pfeifer club story Susan surrender as a mother struggling to free her captured journalists\nAlso starring ... and ... in theaters friday and from babble like European made language learning program babble teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L.\nDot com support for National Public radio comes from advance financial committed to volunteer support and community service by working with over one hundred organizations across the state of Tennessee this year\nInformation is available online at eight as two four seven dot com [noise] from Daryl tripped GMC kinda rough Tobar World Series event for one of America's most powerful loan ups of cars truck vendetta beans\nMore at their old Walter Buick GMC dot com [noise] and the wheels company a partner to national or providing handyman surfaces to help ensure the safety and maintenance", "show_name": "PRI's The World", "year": "2018", "city": "Nashville", "day": "30"}