{"month": "10", "state": "MA", "station": "WBUA", "content": "That'd be ... eighty nine point one WB which booster and streaming at W. B. U. R. dot or W. B. U. R. Boston's NPR News station\nWas Seventy seven hours GMT welcome to weekend when Judy more again questions continues surrounding the death of the Saudi journalist you about the show genius senior U.S senator tell the BBC that the Saudi crown prince Mohammed bin ... had a significant role in plants\nWe need to think this through and make sure that whatever it is we're doing more dynamic coordinated by by luck I Would think that the himself personally would be dealt with in a very severe way\nPresident Trump says the United states will withdraw from a key nuclear weapons treaty with Russia is it a good\nIdea it may be morally satisfying for President Trump to pull out of this treaty but it doesn't help address the underlying problem\nAnd my two guests this morning or something or one of the Sunday Times and Danny ... come to Roger secretary general of civic essential here on weekend after the world news\nHello this is David Stern with the b._b._c. news President Trump has confirmed that the United states plans to withdraw from a key nuclear weapons treaty with Russia\nThe intermediate range nuclear forces treaties struck during the Cold War three decades ago that to the destruction of hundreds of tactical nuclear weapons speaking at a campaign rally in Nevada Mr Trump accused Russia of not honoring the code\nRussia has violated the agreement and they've been violating it for many years and I don't know why President Obama didn't go for\nA loud we're not going to let them violate a nuclear agreement and go out of their weapons that were not allowed to wear the ones that have stayed in there for him in Russia has not founded the agreement so we're going to terminate ... we're going to pull out\nRussia has previously denied us claims that it's broken the agreements by developing and deploying pound missile silos\nClosing is receiving at Afghanistan's parliamentary election or hundreds of polling stations where people were not able to cause that pilots on Saturday\nAt least twenty eight people died and violence across Afghanistan on Saturday as insurgents to disrupt the election despite divided in high numbers have turned out so far our correspondents these do sets is in Kabul\nThere is an extraordinary spirit in Afghanistan but she never fails to impress this is a country which has been to\nFourteen years of brutal war with many Afghans saying the situation here is the worst it has ever\nBeen and there's great cynicism and politicians in the political protests and ... yeah [noise] wow isn't that people have put themselves up to be candidates indecent parliamentary elections and more young educated Afghans than ever before\nI putting themselves forward\nHundreds of Central American migrants have taken too rough some votes to cross the river on the border between Guatemala and Mexico in an attempt to continue that journey to the United states as he ... reports from the border\nHaving left Honduras well we could go for it took ... overwhelms local security forces that up to four thousand people\nWere stuck on a bridge with the Mexican border gate firmly shut\nSome remain on the bridge having made makeshift places to sleep and being supported by eight agencies\nBut hundreds decided they could no longer wait taking ... votes to cross the river into Mexico illegally President Trump promised America's southern border will be close to the migrants but the problem is the best of economic future for themselves and their families is proving a strong driving force\nFor days off to closing the crossing for goods and people between Israel and the Gaza Strip Israel's defense minister Avigdor Lieberman has reopened it statements from his office said the decision was taken off for a decrease in violence in Gaza the crossing was closed following admitted to enter rocket attack\nWill news from the BBC\nThe government is encoded says around three hundred and eighty thousand illegal migrants mostly from the Democratic Republic of Congo have left the country in less than a month as a result of the campaign against unauthorized diamond mining the minister leading the operation tonight reports that the longer these migrants were driven off by violence\nCanada has joined other western countries in questioning Saudi Arabia's account of the deficits agendas ... G in the Saudi come see that in his temper who\nThe Canadian foreign minister Christie of Friedland says the explanations offered so far locked consistency and credibility\nYes in activity was a friend who mistook his Sochi another person's a journalist Austin is waging fiance to telephone if he didn't get much from the Saudi ... when she found him as to say is that the Turkish security services\nHe told the BBC ... soldiers happened to ...\nTo ... almost complete the\nAs soon as he enters the coast so they had a short time he has ... I think the the explanation that made by the government that he has it been a fight or something like is it possible of course it did on ... wings in clay because it seemed like it was like\nThe the Mexico she fights it has been lynched\nI think they came intending ... to ... he\n... he's bloody hurricane ...\nLast week has completely expose several nineteenth century shipwrecks off the coast of Florida\nAre well documented ... launched the region sense since hurricane drove the ships are shore on ... island in Eighteen Ninety nine reports say there are no plans for stage archaeologists to examine the wrecks because resources are needed in the aftermath of hurricane Michael's destructive passage\nThose stories from BBC News\n[noise]\nSix minutes seven GMT welcome to we can from the b._b._c. World Service with major they're more ...\nIn this last half hour of the program we'll hear from a senior U.S Senate says talking about the death toll for Saudi journalist ...\nPlus the American jazz singer Madeline pay rue about how much politics should ones music reflect\nA resident evidence hit news report from the Sunday Times Johnny ... kinda Rogers is secretary general civic has joined us but based on ... organization for various civil society groups which you are leaving at the end of the year that's trying to reflect on your time\nWell I've seen that for six years and they've been pretty depressing um I mean I think if you look at the evidence of what's happening on civic freedoms around the world for example the profit because monitor we you know we've documented serious threats to one or more civic freedoms you know the rights that we have to speak out take action come together [noise]\nUm there have been serious threats in more than a hundred countries and just in the last year including some mature democracy so\nFrom over non fiction that's about protecting than promoting citizen action the we live in some worrying times\n[noise] a resident of brief or to you about a I have some because newspaper with me a big splash I'm Paige H written by you this is reflecting on the couch in London yesterday by people calling for a second referendum on the deal for Brexit\nWhen you write something like that give them that you know that would have been covered on the television on the radio extensively by the time I pick it up and read it what are you trying to trying to say and do\nCrowd that more of a sketch size than any ... a red light\nAnd say it's a little bit of a flat vigils stories are coming out of people you ask which I think it's a nice a nice touch you Kevin you find that people haven't found\nAnd I mean you had to make it likely that people have made it 'cause you're quite right by the by that's nice to have as much as they you know when you've got an influence on something like that it's not as they were saying this revelation unless something you know like ...\nAnd and and you're covering it from that and I say it again and it might have a sketch and I'm not quite fun to write but it doesn't mean of the uh trying to file on you'll find Asimov sending in your company and which is never again when you've got that many people but then I think the gentleman that challenge because\nAnd everybody you couldn't get any now like I said many people that that was a little bit shaky let ...\nSo hey it's then it's on page eight [laughter] uh it's eight minutes past seven GMT President Trump\nHas confirmed that the U.S plans to withdraw from a key nuclear weapons treaty with Russia he said most go had repeatedly violated the intermediate range nuclear forces treaty\nWhile America had owner did Russia has denied those US claims so who's right President Trump pulled the Russians Daryl Kimball is the executive director of the arms control association that is a U.S based known parties on organization which promotes public understanding of arms control policies\nWhile the United states beginning in two dozen fourteen alleged in I Believe it's correct that Russia tested a ground launch cruise missile beyond the\nFive hundred kilometer range limit allowed by the treaty and began to deploy a small number of these missile probably somewhere in central Russia off and on effort through diplomacy to confront Russia about their demand that they return to clients were unsuccessful\nBut I think the diplomatic options to deal with is clearly not then exhausted there was only one needy in the past year between us and Russian officials to discuss\nThe matter and so yes Russia has violated the treaty but the question in the U.S withdraw makes sense from a security standpoint to bring Russia back into compliance might think it thought\nSo that translates into about a hundred thousand jobs in the u._k. as a result of trade with Saudi are we prepared to give this up when roasted price Rosen's\nWell one of the age of the things they love Britain leaving me is that we and our I'm willing to skate neither other like set we have I Would argue I mean at somebody like that to some of the midlife crisis naming leaving that reliable and partner and getting in finding says oh lays out there\nAnd more dangerous friends and I think a willingness to ... found that with safety ... obviously leaving the biggest market in the wild\nAbsolutely I mean it to the ultimate question is how much does Britain or any other country wants to be the policemen of the world is this a role in or is that is that to global responsibility and when we say global that includes Russia and China who work on the church is different set of values than we in the west\nOperate them walk though if more images I mean clearly there is talk of more evidence emerging from turkey um if some reports a right to some of that evidence could be extremely gruesome would that change things will emerge\nFace um and I think the Turks have been politicizing the way they've been dropping dripping information and then saying don't don't take this seemed to conduct an authorized leaks so supportive to look\nAt the whole thing in context social was murdered and he was a as a Saudi Arabia has said was murdered by at least senior officials and on and I think we just have to wait for the results of the investigation bugs toddlers and how's the world would react with\nNicholas ... that when we knew what was happening in Yemen they will still having a very happily what what what do you think about that\nOne I mean the Yemen crisis is is is another one you've got it it it's not the subject is operating the ritzy around with who says if the streets of a of a moderate in the south is Red Sea all closed up Fifteen Percent of global trade goes through the straits that means massive inflation that's going to affect us\nAll goes through the it's it's ... you know you could argue that Saudis actually fighting the war of the west of war because the south is news on the Iranians close the straits us in the west who would be having to pay the price for it\nOne of the things we're told about why the west supports the Saudi regime is the sort of you know for a job and complexity of political settlement in the middle east what would happen if the west actually took the bold step of not propping up the Saudi regime\nWhat I mean that's what's happened in two thousand and three with Iraq and that led to the creation of faucets and we're still dealing with that\nI think it'd be much worse if the same thing is repeated with Saudi because it's not early Sunni extremists who wouldn't exploit this but the extremist and and and you you have\nAnd then you've got the oil um we have severe political and economic repercussions that will take many many years even longer than the Iraq War repercussions from steel which will still dealing with no\nThank you very much can we can mothers' introduce a base we look ahead to that event in Saudi Arabia this week it's a twenty two minutes past the hour we'll get away with some music because meddling pay ... is an American singer born in the state of Georgia she grow up in New York and California but for many years she has been living in Paris\n... de la Salle animals [noise] gee I don't know\nThis is ... the final track of her new album and submit so originally from up having bipolar ... from the time of the world war two the album was mostly written in the U.S during the last presidential campaign that when Madeleine came in she told me how the political debates at the time left them mark on that album yeah I\nDoing some line [noise] try to try\nHave gotten\nEarly two thousand sixteen we started doing smaller venues and little clubs around the United states\nThroughout the primaries and caucuses 'em and various debates and the ins and outs of the day to day news that I felt was worth addressing a little bit in our shows just so that I could introduce a song and say this is dedicated\nTo anyone who's not represent doesn't feel represented by the government and then do the song and we'd get laughs in some places in in other places we'd get like\nAn angry years but the state of our shows just sell the atmosphere of politics was unavoidable and different from any that you've experienced before a little bit I mean the fact that the news\nInvades our lives in a way that it didn't few years ago and certainly not Twenty years ago when I started doing these little clubs and things like that and\nYeah so I just started to feel like it would be great if some of this stuff we could talk about it instead of just trying to find a clever introduction to a song and simultaneously Larry Klein who I've worked with many times over the years had just started by saying you know let's come over here and let's try this thing where we all sit in a room together five of us and\nI said this was a group of of musicians of rights as all collaborating effectively yeah almost even to go out and saying you\nKnow hang hang hang my\nMom my hero is um\nI mean one thing that struck me because I Know there was one particular review that Iraq which talked about I think I don't know whether it was your comment or somebody a alongside you talking about the danger of being I think the word was pre ... and it's a difficult balance isn't it because you want people to enjoy the music and the lyrics with it\nBut if they don't necessarily agree with the sentiments it gets more difficult [noise] yeah but I think even beyond that it's just not artistic to stand up\nGrieve with me and if I keep yelling at you because I've got the stage you know I've got the podium because he ... paid to come and see the show or whatever it is that they gave you this audience it's so presumptuous to think that people want to be told what's right\nBut it's far more artistic to ask a question and it's more fair and it's just more right\nNo birds they name and number ... de do\n... you know again I heard them say\nYou know do what he's doing\nThey're meant to tells personal stories and uh that each one of these stories is you know these are\nMeant to be such a sort of like life life experience type stories like down on me where you just can't get out of a circle of debt or find some kind of financial ruin that might have just happened by accident and you don't really know\nSo yeah these are all stories that I think are relevant to my experience of America is and their stories that I I think I intended to at least for the most part\nSay hey let's let's talk about this and um\nYou know the song and some wasn't the starting point but it ended up being the summary and ended up there for being the title and so this recording of this poem by ...\nCarries the almost like the book and sort of like the counterweight to answer them in this quest for what is democracy and freedom and what does it mean\nYou didn't grow up in front of you spend a significant portion of your life in person I think when you were there that had a huge influence on the style of music that you have gone on to to plan before must moved\n[laughter] it's ironic because it gave me more of a understanding of how important my American music that you know is to me and\n... some of the things that I loved about that I Love about it you know of course also there is just a genuine appreciation for American jazz in Europe that does not get the same time a day at home and\n\nMuslim ... she'll be performing in the u._k. in November you'll have more of a music for the end of the program but just hundreds I texted ... went for being here here's a little bit more of a libertarian\nNa [noise]\n\nThe distribution of the b._b._c. World Service in the United states is made possible by American public media producer and distributor of award winning public radio contest ATM American public media\nWith support from ... a meal press service delivering fresh dinner kids that are table ready in Fifteen minutes gobbled up the prep work so you spend less time chopping and more time with family\nAnd learn more at ... dot com slash BBC\n[noise] this is Ninety point nine to ... do you are and W. B. U. R. dot org if you've donated to W. B. U. R. recently make your support for independent journalism go further by asking your employer to natural gas to learn more at W. B. U. R. dot org\nAll the way to spray eighty nine point one of the new age Bruce staircase screaming at W. B. U. R.\nDot org W. B.\nNews station [noise]\nComing up on outlook weekend the Ecuadorian DJ on a quest to unravel a decades old family history his biggest ... on his ... grandfather and grimy old suitcase filled with take\nThe suitcase was this completely charged object\nFilled with stuff to tapes powerful opposed to say that\nI didn't know what I was going to find this very intense urge to know what was in the\nInside I songs on the cutting off access [noise] I'm his grandfather physical needs to\nCome like I said my grandfather wasn't the happiest person on earth and I realize that this to ... one of the most beautiful things that she did in his life and that should be celebrated for the\nMystery attack critics those last night to take weeks after that to me\nHello this is David all student with the b._b._c. news the senior Russian senator has condemned President Trump stated intention to withdraw from a key nuclear weapons treaty with Russia coating it blackmail\nMr Trump on Saturday repeated us accusations that Moscow heard repeatedly violated the deal on intermediate range nuclear missile silos agreed during the Cold War most go denies fixing cars boxer reports from Washington\nSigned by president Ronald Reagan and the Soviet leader Mikhail Gorbachev towards the end of the Cold War the intermediate range nuclear forces treaty was seen as a landmark accord it led to the destruction of hundreds of missiles by both countries\nBut the White House insists that the Kremlin has ignored the INS treaty for years like testing and deploying bound cruise missiles like President Trump and his patients has ruined all its\nVoting is underway and Afghan holding centers where people were unable to cost about its on Saturday because of violence or technical problems and officials said around four hundred polling stations would be kept open on Sunday this report from the conduct come on me\nAbout four hundred polling stations opened today\nWith voting taking place that because that will organizational delayed but overall I think that these elections will be seen as something of a success by Afghan officials because even up until a few weeks ago some in Afghanistan were\nCosting doubts about whether these elections what got ahead a tool and ... they have gone ahead they've gone ahead relatively peacefully and\nOfficial table think this is a positive sign had to next year more politically significant presidential election\nHundreds of Central American migrants have taken to Ross some votes to cross the river mocking the border between ... and Mexico in an attempt to continue that journey to the United states at least ... reports from the border\nHaving left Honduras more than a week ago ... to ... an overwhelmed local security forces that up to four thousand people\nWere stuck on a bridge with the Mexican border gate firmly shut\nSolve remain on the bridge having made makeshift places to sleep and being supported by eight agencies\nBut hundreds decided they could no longer wait they can ... votes to cross the river into Mexico illegally President Trump promised America's southern border will be close to the migrants but the problem is the best of economic future for themselves and their families is proving a strong driving force\n... boot reporting China's top representatives governing the Chinese territory of Macau has died off to ... from a tall building\nBeijing released a brief statement saying the junk shot song had been suffering from depression implying that Mr John had killed himself there's no evidence that Mr John had to come under the watch of China's the base of anti corruption campaign [noise]\nThis is the worst news from the BBC\nCanada has joined other western countries in questioning Saudi Arabia's account to the death of the ... a show Jay in the somebody can see that in Istanbul\nThe foreign minister ... said the explanations offered so far ... consistency and credibility and cold for a full investigation in collaboration with the Turkish authorities\nIsrael has ordered the reopening of the key border crossing between Israel and the Gaza Strip Israel closed it on Wednesday off the Palestinian militants fired two rockets over the border Israel said the decision was taken because of a decrease in violence along the separation barrier\nFollowing efforts by the militant group Hamas to restrain Palestinian demonstrators\nFederal police in Brazil is I've been to the investigation into information spread on social media during the presidential election campaign it's one of those like\nThe left wing candidate for not do adopt 'cause you want some reports from Sao paolo Alto\nSocial media has been hugely important and controversial in these elections the far right candidate ... has run a very different campaign using what's happened to Facebook as his primary platforms to spread his message and win support\nBut with that he and his father was his face growing criticism and accusations that fake news is being spread to millions of people that had that the federal police says it'll look into whether or not companies have been sending mixed messages both in connection to ... and Fernando ...\nHurricane my coat which patch at the southeastern United States though we can teach exposed several nineteenth century shipwrecks on the coast of Florida directed they launch the buried inside since hurricane ... in Eighteen Ninety nine\nReport to them and no plans to examine directs because Brazil's is needed in the aftermath of hurricane Michael's destructive passage\nThat still exist BBC [noise]\nNo one\nOf my favorite things about today's program is is that if you\nRead the jingle was created in Ecuador in the Nineteen fifties and it\nBelongs to a brand new record label called ... ... C I F e\nStands for like ... with that because of what the ... which is basically just an acronym for among them was company of Ecuadorian photographic industries\nYou know to be\n\nThere with a\nGuy you may need better [noise]\nAnd the aim of ... stay with to record what was essentially Ecuadorian folk music or what was known locally as she can get out\nSongs that honey aid to national identity and the culture that had never before been put to the vinyl and ... say assembled some of the country's most talented musicians to do it\nThey need to go to do all these musicians who are just in the prime in the sixties or all the labels catalog like old guy who terrorists he won't sign for Queen Elizabeth\nII in the\nWhole family who was among orange [noise]\n\nAnd she was so violent route Indiana [noise]\nWith someone that they don't Hitler and eventually to flee for life after being persecuted for being a road map [noise]\n\nThere's a very specific but it to label you have this combination of cultures have very good musicians playing traditional music\nIn European these worlds style [noise] ... [noise]\n\nThings musical rain however was short and sweet\nBy the Nineteen seventies it dissolved and dissipated buried in the memories of aging musicians until a chance discovery in a bathroom [noise]\nI'm\nMary and Mary's on today's outlook weekend is about the resurrection of the Gulf and ... and the trouble is the legacy as the man who created it\nMy grandfather wasn't happy person on earth and mark is tough for the side and sometimes it was really dark\nDistrict ... was one of the most beautiful things but\nIncluding this episode the mystery of Ecuador last ...\nNa\nNa na\nWhen Daniel afraid to Russia was growing up there were two big family mysteries and it's like\nThe fun it was something called the matrix type or the ... my mom would often talk about\n\nI've always loved music I've been a musician since I was a child and I came into contact with the when I was in my early twenties because I wasn't to music production and never got my hands on anything that really meant anything to me at a personal\nGenetic level and then all of a sudden I had this gigantic logo take directly connected to my blood line than my ancestry\nDown you'll start to find out what he cared about kind of say\n[noise]\nKind of like a detective work\nBecause it's extremely hard to find information about the music around I looked for encyclopedias that looked online I looked everywhere I couldn't I couldn't find a single word molested me literally do not [noise]\nI was like okay I Know this label exist have these records of how these tapes and are defined little clues but more importantly the strongest clues came to me and strange situations\nLike one time I was listening to track [noise]\n\nI was completely in love with that song the cave and [noise] the lyrics the sun is about tired feet and the singer asks his title where they're taking title body you know I\nWas on the way\nI don't know how long\nHe wonders if the speed or taking any to prison\nFor to the land of oblivion and those are the only two options for years [laughter] so it's a belief that the sweetness of the melody that melancholy end this bitter sweet feeling that equipment in music just has in it you know and I I just love the song [noise]\nI'm In the middle of just getting into these tapes with the tape player I'm listening to them every day trying to go as deep as I can and I go for a walk to go get a juice you know some people\nWalking around having my shoes and business blind accordion player called loud I'm we're not allowed\nTo playing that song\n[noise]\nSon was so they've been in my mind already it was like oh my God [laughter] she's singing that exact so\nI'm In shock hairs on and it's just like oh my God [laughter] who are you [noise]\nI sat and I listen to the whole song\nAnd then I spoke to load up and we became friends that mean she'd be lovely old lady\nHas been playing on the streets and she was a little girl you know and she tells me the name of the song tells me the authors of the most famous interpretations and we just have this conversation about music it was really magical in a way because\nYou know in the world that is so visual used every visual tool I could find to try to find information and then the only place I could actually find information was the memory of a wonderful blind woman\nOn the street and she basically added so much magic to a story for me personally [noise]\nFor music Tanya would find other stuff on the ...\nWhen you digitizing you just listened to the whole take you need to know what's on the whole tape so you can put the tip aside label that\nSometimes they'd be listening and it'd be twenty minutes\nTo take [noise]\nBut sometimes you get a jewel in there one of those [noise]\nAnd the woman was bringing to the microphone\nTo just\nBe that this woman had gone into the studio and record of their self declaring love to some unknown recipient\nThe key to\nI don't know if it was sound engineer or someone but that was just incredible I mean the vividness of this woman speaking into the microphone she's so open hearted and she just and I'm wearing headphones and so she's whispering into my ear yes\nYes he does it cost and\nSexy and it's a bit I blush dude I was like whoa\n[laughter] Daniels project town trying to identify some musicians instruments genre [noise]\nIt's not ten for black to take a toll on dining out\nI was doing this full time I put everything else decide to go through a suitable tapes ...\nWhat made me sort of slow down was the fact that there was a really intense personal stories surrounding my grandfather because my grandfather was a controversial character and part of the controversies\n\nDaniel Didn't want to go into the details of his grandfather prophecy that well I can tell you is that called us suffered from mental health issues throughout\nHis life and that affected his personal interactions with people\nSometimes you would run into these mines fields where like you were dealing with the past [noise] in ways you didn't understand [noise]\nThat would definitely moments where it was not the right time to be my best to [noise] after I finished the suitcase to\nSlow down you know until I Do play to a tree approached [noise]\nWithout hurting anybody especially with those we living [noise]\nBad things from the past and to actually bring lighting too because you know my grandfather wasn't\nNecessarily like the happiest person on earth and his mark as tough and it's sometimes it's sad and sometimes it's really dark [noise]\nI realized that this was one of the most beautiful thing to do this and that it should be celebrated for that that through the stage that could sort of\nShame led into a dark\nArea of my family history ... ... but in the sense\nMm\nI'm kind of say his old influence how Daniel makes his own music\nIt gave my words a sense of purpose to re mixes with a tape when I perform a luxury may compositions based on compositions that are on the tapes of actually copied some of the compositions transpose them on to synthesize arrangements and things like that I mean to me this is the cost of social inspiration [noise]\n\n\nPerhaps most importantly for Daniel dot genius flash evil not non of a grandfather he felt he never got close to well the discovery of guys they definitely gave him a new connection\nI've been really privileged to get to know the most positive side of my grandfather and to get to know that [noise]\nI'm not the kind of person who sees goes but I definitely do not just going through the existence that I think his ghost is happy that this is happening and you know honestly like my grandfather would be so happy that his name is being mentioned on the BBC right\nNow [laughter] she would he would be bragging to everybody\nMay still be something of a mystery Saddam yelled but at least he sold the puzzle of the metrics says\nUp to up to pay for it all ended in this has been made this fantastic opportunity to do something worthwhile with what I Love and that's a good\nThing\nDaniel ... talking to me from a studio in key says you can ask me that on the high ... hawk eyes on his SoundCloud page keyhole says I'm marrying my race and this has been outlook weekend the ministry of Ecuador last month to take\n[noise]\nDistribution of the b._b._c. World Service in the United states is made possible by American public media\nProducer and distributor of award winning public radio content eight PM American public media with support from Boston beer company really Samuel Adams Boston loggers since Nineteen eighty four\nWith hops from the ... farm in the very a region of Germany Boston beer company Boston mass promoting responsible drinking\n[noise]\nThis is Ninety point nine covered in the you are and W. B. U. R. dot org make the most out of your car or your boat\nEven when it's time to replace it by donating to W. B. you are going to be supporting the news and you may be eligible for a tax deduction find out how it capital you know you are dot org slash card tank [laughter]\nThe last month which is so crucial to the actual quality of your experience as a win win deal getting online yet more and more of a song\nAbsolutely and especially about a year and I were in Kenya or just being Africa or just being connected with these new seats at high speeds under the broadband legs and it does seem crazy but the conduct of the past ... within the come from bill thank you for that let's move on\nNow here's a statement data scientists wheeled such power over our lives these days they should sign the equivalence of the Hippocratic Oath that binds thoughts as\nAn hour all stars these should treat risks like data breaches in cyber attacks as the big health risks\nCitizens have lost trust in technology that's set up with the big companies avoiding tax and the ongoing rise of most of the nation is feuding uncertainty as people worry about that jobs say concerns and aspirations like they say with the outcomes and some of the discussion point at a recent summit in London\nDigital agenda as a buddy devices to tax the good partners with BCS and the agency Edelman on the power and responsibility summit\nAnd that we're joined will say ... ... well that that discussion paper had of that summit we'll hear about that it's gotten pregnant\nBut right to an editor at digital agenda I Wonder if you can just tell us about that kind of the main purpose of this summit that you held in London it was just a bit of this month wasn't it\nYeah sure it's a digital agenda was set up a couple of years ago to provide added in protest to the growing movement for tech for goods\nAnd by that we mean technology innovation that is about more than Baltimore line profits was as good a social purpose and environmental purpose is helping improve people's lives\nAnd we were recognize that through our impacts awards program where we recognize the luck solve problem health and bottom boat that energy will bring in renewable energy into people's homes [noise] um\nI'm not really good initiative but alone there's about ... alongside that because ah as we all know that as well as tight for good we're unfortunately will say experience and quite low tech for that and\nSaid as as the ... were informed by in a a were briefed I suppose in the document that you prepare to in Cairo if it's just to say what were the main concerns that you outlined in this discussion pay from which the summit was back\nWhen it seems to me that was actually a lot of the technology that we eat today was never intended to meet that it was that one of the points of a it was just that there are a huge amount of unintended consequences that we now in the beginning to eight I\nSay for example you know how and especially medium is ... ... people are more interested in talking to people like that and and lasting caged in the world around and and and less connected to people you would not like them\nAnd actually there are fewer space tasteful treat public debate that makes us different full and ... and and the the unintended things that happen as a result of that all all we we're beginning to a nice for example in the way that people choose to fight and and how that can be affected\nSaddam and huge unintended consequences or an antibody response is opposed to some of the spies assaults turn and threats to democracy from some of the innovations that were saying like that are now taking them all posted All right Jim you've outlined some of the problems I mean some of the most puzzling but what about some of the solutions great circulation\nYeah I mean it's worth saying she the page that we covered it takes to get the kind of gets even starting point because there are many many issues around technology that we want to say he's been on as a huge area and and so we won ... T create some sort of his ground rules for the and then if you like most of my understanding what's happening\nTo what we as she said in hate the ways we believe that as a society we're leaving from states have ... ... was going to solve everything into the ... the unintended consequences we need to me to any any phase which which according human tank\nSo I think he got ... and ... ethics can be ... T the technology and the future\nRight say partly removing fear and I guess you didn't like other outcomes as well then we're storing trust\n[noise] yeah I mean when we did our son it's a one of the key drivers for putting all the event was this kind of look at this issue about attack trust deficit a Edelman her one of our partners on the events through an annual thing could attack to trust the ...\nUh and they found quite serious drops in the level of trust among the public around the world in things like social media platforms and transparency accountability for tech companies to look up to\nDate to so there is a little bit of a trust deficit and it's not just tech companies its governments NGOs or experience all kinds of jokes in trust but that\nReally is is a key in motion which is driving this kind of concerned that we have about whether it's on dates privacy mental health of our kids are\nThe screen time that the people have and the effect of democracy is this is a little slightly wrapped up in issues around she'll stuffing style I mean\nThis is over and over the years ... build homes and you know this ... all these networks independent so many of our lives if we can't trust them and the corporations and in some cases governments running them that that's a huge\nProblem if it is but we've never truly trusted them um yeah the networks the corporations governments they've always been checks and balances in society means laundry the exercise of politics is about how you\nCreate structures which they require you to trust people as much as though that if they do do something but don't you and your interests they can be detected and punished\nPast the probably the Internet just as as just eluded jade is a network wasn't designed to be able to be regulated ... able to be managed in that way and it's evolved to become so critical allies without those protections in place\nNow seems to be the time where people are looking at how the network operates\nWhat we want from the network and then what would be an appropriate set of regulations to ensure that he's still flourishes but he also served society\nYeah I'm going to ... to both of you you didn't unjust you can choose he wants to pass the ... the question why do we go from here you've had the summit we'll make the world a better life how is that going to happen\nWhen we know that regulation is starting to happen is is just mentioned site GDP off\nWe have to if you're in books is in Europe you have to actually what's interesting about that because of the the ... global how do you regulate something so global one of the impact of GDP oh it was interesting because we see in other in other regions where it's not required companies are still coming civic\nEmptied an important one way to do to ... you know global significance adjusted quick five or ten seconds from Eugene and if you can win a\nShow it was it was ... and also split among uncle ... said regret ... responsibility I were to mystic about what we can do but it has to be used responsibly as a great power but it has to be used responsibly\nAnd they will leave it to them but like you say much for coming in and say you just terrible and ah we're going to talk about fixing stuff now the parents are ... international repaired die later this month which is an annual celebration of just throwing away you graduate from rushing off to bother\nLike just a show you saw any toys and as offensive to pay some nuts I are we are we from illness pragmatic I as a former apple design engineer or about ... ... ... that if the if the ... that he used to work home I mean why can't you change the ... on an iPhone or rented\nLatest bring it back up to the white is writes like this very pace this report that I Would also have a Fisher has made all by herself\nMy phone is two years old the ... be dying the screen is correct and altogether it's looking at the state if I'm being honest I really love an upgrade but this might not be the cheapest are the best option the festival of maintenance is celebrating makers maintain is under Paris worldwide\nAnd I met one of the organizers of the event Laura Jane\nThe festival of maintenance is a celebration of the people who look after all kinds of policies for our world\nFrom physical places and spaces to digital goods on communities particularly looking at traditional maintenance and more modern digital an online make them see through a combination of months in ways we can strengthen and improve what we do\nMaintenance is happening today and a lot of different places a lot of different ways some of it might sometimes be visible and a lot of it left so um I think I guess next time your and particularly in a shed place of community space for public space thinking about the people who look after it may be saying thank you\nThere were many speakers here today and I've managed to grab one of them ... for a cup of tea and a quick checked in between talks\nI worked for what you need to educate and which is sad territory that supports Wikipedia and other open notes project it's all by cops cheering as\nThe knowledge of the world for everybody and it's also about keeping it up to date as complete as possible and there was a lot of editors em and humans editing editing Wikipedia but actually\nThere was a lot of automation going on behind the scenes as well and some editors had created row boats which performed at Fox that they would have done themselves into ... so for example if anybody has tried to fund delays that we can be a page\nAnd maybe some swear words and they're kind of books that go for pages and pick them up and daily dose a bundle is quite quickly\nMaintaining the virtual world is fight 'til the accuracy of information a huge issue in times of fake nice but maintaining hardware means less waste which is another concern\nUs a legal terms is basically anything with a battery or a plug at least in Europe in some countries is defined differently", "year": "2018", "show_name": "BBC World Service", "city": "Tisbury", "day": "21"}