{"month": "10", "state": "CA", "station": "KALW", "content": "Was measured W you could find all of our election coverage at K. A. L. W. dot org\n\n\n\nLadies and gentlemen mob beating them up on us among in and I've I've got a guy\nI might be a bi Moe does welcome ... ... a little windy to Africa mix that we are on K. A. L. W. Ninety One point seven FM your local public radio\nYou can hear on the radio in San Francisco but also on the Web at K. A. L. W. dot O. R. G.\nWe've got another great show lined up for you my name is ed ... along with my co host on other who will be here um and you will hear from him in a little bit and um we went to welcome you to the show the only show in this unforgiving\nStates of America that place you African music and the music of the African diaspora ... when a thank you very much I haven't been back since that we had the membership driver in case of this the first time you're listening to members we are KLW is a listener\nUs ... support the radio it's a membership driven radio and and once or twice a year we come together and we we ... our troops and we ask everybody to stick up for KLW and I support this independent radio\nAnd all the great programming that we give you hear from news at the music and everything in between [noise]\nAnd you stepped up a big time and we want to appreciate you very very much for 'em what you did and um if you didn't get a chance to remember you can always go to KLW dot O. R. G. and click on the donate bart ton\nAnd that's also where you cannot listen to the show again and again and all the ... show was from a a select the music player there on M.\nK. A. L. W. dot O. R. G. we are going to stop this show in South Africa\n... by which the ...\nOut of the great books see my cello they called him the voice of South Africa we saw in my mind well and I saw him in ... and I'm with a ...\nA couple of years ago and they just like turned that plays out said that one I've never seen someone just going to these places where it's mostly people go in and they listen to music and they sit down and then that song ends and they collapse the head and then\nBut to see them just getting up and this and people getting up and dancing around and it was such a um a sight to behold so he is a ... Marcella\nOut and the song is called ... in South Africa and music man in South Africa as I grew up in the eighties and in the\nApartheid era when I was coming of age and in South African music makes me want to go ...\n... and just like I don't know just break something ... don't don't do that you'll retail but you know what I mean it's like the practice music and this is a a a a traditional a South African music in these days are\nWritten ... ... ... yeah\n\nWho when I'm being a\nThe ban on\n\nThe bus\nDon't just willing to bend reliable\nNa\nNa na na na na\nBy anyway I think\nBit\nKnow and I'm from ...\nA member and I\nKnow my game ...\nMany out your niche all\nWant to learn not to be the ones that are larger one on the news I mean one got another one called ... not the joining me now to you know not to say anything you want to make all those are not on the news to me I Need to do what do they get him off by telling my body\nWay [noise]\nGot got dry you are going to the girl\nMe dry out there in my school being knocked on down the road\nShe didn't\nWant to go back to ... ... you know not just man it being as you well let me go back to their now she no notes use many others may go back to ...\nNa\n\nNa na na\nNa na\nNa ve been called the mom that she wouldn't even they already do not need to be done on the list the drop off I\nDo know that sounds like you've got to get get gotta get get get\nGet gotta get get get gotta get get the\nBroad less stress and he had\nGoing to do the math and yet\nWhen you got to be wrong we both both gumbo men both thought those were to go out\nAnd out long bomb and some guy and then read just don't go into all ball west on friends but they all know about your cause the nice thing to do that they don't they don't\nLot of guys on\nBad at my job my\nMonth in the first show me about the the ... not British guy got ... guns wild about the jokes\nOn people get wrong about the law though [laughter] you know they seem to go out and bought one that does not ... well we bought\nThat but not in the last ... bought by law though I mean there were no laws that does\nBelong to a great job will rise by going to do and\nAgain [laughter]\nAbout [laughter]\nOh God [laughter]\n\n[laughter]\n\n\n\n[laughter]\nThey gave me the beep\n[laughter]\nShe lives here those\nPeople will\nWill\nWill lose me\nShe is she\nOn the show\nSharon\n... na\n\n\nNa na na\n\n\nNa\n\nNa na na\n\nShe she yeah\nShe\nShe loves\n\n...\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] the show is Africa mix up from KLW Ninety One point seven FM and San Francisco and also on the whereabouts K. A. L. W. dot O. R. G. uh my name is that in Oklahoma and um [noise] let me just go here and tell you we just played\nUm we began the show with a song by Lucy Marcella from South Africa the song is called ... well yeah and South African classic that with this on rendition\nAnd now we went to a bill refugees are all star the Sierra Leone's refugees all stars the give us a song called ... baby a wonderful song that the guitar is amazing amazing and then\nFrom there we went to a Joe mc ... the African nation of the Caribbean nation of a a jump the gun we heard a moot about who got a man with a\nA a name that it's more African than mine ... about a guy and uh the song is called any which way\n... actually referred to\nAs soon as ... as a credit for actually putting uh the ... the sounds awesome beat up on to the electric guitar\nOn sea ice anybody wants to learn music I Would say that's like the easily differ um so actually it's almost not from one than other groups um than a lot of people in the U.S don't I'm not familiar with\nBut they're more popular in Europe is the ... boys do you go to jail for more than a than the lines on to ...\nAnd Mary asked why you find it taste would call it the ... but because we had a Kevin ... here for almost ... but if we had these own though you know it was a ... wanted to go to court because remember huh member ruined the quality\nOf since ... cents so yeah for the call to different them different\nNames I agree a southern Cali by a different form of them beat her son's involved with very specific it's I think it's the one country that really is has made and being on\nThe music very ... and the reason why I find that the ... because I we were having this conversation earlier ... before the program was\nIn the Sean a language a with MBA's most prolific the showing up people unknown most to really use the ancient instrument\nThey don't have to let her L and offer it\nOr how does not because I was thinking it was going to be like a member of the law of rice suffered okay so let me let me do you call it the ... or ... years ago for 'cause I don't want you to get a lot of\n... ... people get a friend that was what was what you meant was that\nTo call them ... comes the one that region it's in Zimbabwe to call it the ... is a blessing [laughter] I\nLike it was unreal I talk to\n'em it is for me to people like cold I'm a ... because the the the ... you know who is a very big instrument actually you know some people actually making them much larger form the ... solved the reason so if I was thinking in terms of the shuttle language\nColleen by would be\nMaking it small it's like things going ... you\nKnow because even they knew I knew that I play is also a small version often because the you know who to as much light has thirty two kids that's really it's like you have the original piano on that that's the origin of black he's on the piano so it's\nYou know to say ... do you sort of like\nHi Kay ain't fun of it now it didn't know\n... if it makes it more phone comes out of it for me salads yeah so what do you what what do you have you know ... unless you have some time out for\nYou and be sure to do the thing you got a new ... I had done yoga new get today I liked that and yeah I like because\nIt's for me because I play a lot lives um and it it it doesn't get in the way off a big Mike when you think you know a lot of engineers and very familiar with liking the meta so\nThis is a lot easier I still see a lot easier to learn and you can teach a kid within like thirty minutes I like to play them beta\nWithin thirty minutes like literally distill instruments wanted to make us so\nI bet you will take me Thirty years and years before it all [laughter] so I'm\nGoing to be playing along with so it would be tough yeah so it's going to a company\nWe going to play I'm\nOne of my favorite songs I tend to like I was just telling it and let I kind of\nHope the audience is not going to get sick of me playing the phone because I played all the time here but it's really one of my favorite songs and it's the one song really actually got to play 'em and it's called ...\nIt means a one cuts the tree and the ... the tree that's coming into southern belle sort of sauce and regional yeah southern Africa I'm so it's a song about insurance\nTalks about how you see the resilient and just be prepared for the future\nVery good for me\nYou don't want to put a shoe on otherwise you're not confusing [noise]\nWhenever you're ready right\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise] um\n\nDoing a new\nNone of them up and move them they will not be limited to me\n\n\nBang bang all be done [noise]\n\n\n\n\n[noise]\n[noise] then na\nNa na na na\nNa na na na na\nBang bang bang\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\nOh beautiful it is you're listening to Africa mix from K O W Ninety One point seven samurai uh with me come along with my co host of mice throwing on the door when well that sounds that song particularly it's a classic\nClassic it's actually for the oldest songs I Know you know I'm I'm\nI might be wrong but I don't think we actually really know where the stone actually came from my the story that I got told was that it came from a cave\nBut it's the most prolific um song um that's on a soft and beat\n'em you have artists like I'm a Gen he isn't in England who actually uses the specific I read them um they have the likes of ... not so much you actually are ... fanatic you will hear the specific rhythms in pretty much most of his music because he knew how to play around with all the phrases and and the song\nYeah I've I've lived I've been to listen to multiple beans and I said hey I just you and my uncle get along too yeah I I Love um music from Zimbabwe I'm biased like I'm always jumping to to the gym so\nAgain you are listening to K. A. L. W.\nNinety One point seven if your local public radio and I don't\nYeah I guess the tonight so why from Zimbabwe and a degree in West\nFrom Canada but living in the United states I think it will be performing somebody ... asking ... in Berkeley\nAnd though can you\nPlay another tune you up to\n... ... did did they give us tickets to give away for pleasure yeah actually um she took it to me oh okay yeah so whenever you\nYeah so um we have an email address that you can uh the scan a sense I'm a they're in their their names to me to get into the show and I just could not so\nYeah we're we're going after the radio and asking those like radio and asking are dot com I think so yeah\n... yeah we were going to give that because of what happens is we set people send it badly say they on the list for what\nIt is what we do is look we tell them to call here and then uh oh yeah yeah I'm going to give the number ... ... the number here that you're going to call asked um um PY performs and it's a full one five eight four one for one brief for\nThat is for one five eight four one for one\nTwo three four and please don't call yet so and I just for a get yourself a pill to get to see PY at ash cannot as a man uh Berkeley on October twelve\nWhich is called those who matter\nMm Mm\nChosen [noise]\n\nMoon and big room\nMiddle of\n...\n...\nPermanently broke\nHe not is\nA\nTo do\n\nWhile I ... I call that an African rock tissue [laughter] you'll all may be very ... I'm not jealous envious of you and I\nWish I could play like I Can't even play drums and I'm African it's just that but I'm an African woman like drum\nExcuse me [laughter] you are breaking every rule that it is yeah okay ah yeah speaking of but it can do that\nCertainly shouldn't be there so you know might double dilemma my parents\nHave you're just tuning in annual wondering who that was that was the music of edge in West along with a P. Y. here and um they're being with us for the last half hour away and if you like the music you go to ... on the twelfth and feed them perform a for a lot longer than this and I'm\nSteve I'm you know I hear the economy's doing really well but if if you are one of those are the three percent who can't find jobs call here\nFor one five eight for one for one pretty fun we got to prepare a pair of tickets for you to go to asking as\nI'd like to thank you for coming\nIn New Hampshire thank you for having the work that you're doing too much in African culture on Africa music\nYou have done is on the corner British to err on the bay area and you\nKnow I have men want them is Adrian a second time a coming together with I think the last time on here we were with more\nThan I somehow in Atlanta and then ah you know um\nYeah and I've also collaborated with a few games like the ...\nUm and also well I don't miss you I'm I'm also collaborated on a fantastic Nick ...\nAlbum which won a Grammy and I think to some extent what kind of teen we won the Grammy last year\nAnd that was [laughter] yeah outside planes crashing on a lot of Oakland now yeah\nWell it's always a pleasure to have you anytime I can listen this is open to you to Africa mix on it'd be ... very much for coming by our swim thanks for having me\nAnd the ladies and gentlemen go see them or or again we always say here many many times that you you don't have to go to Africa to find the Africans we're here in the bay area go find the musical PY ... at a ... on the twelfth\nThank you very much\nAnd we'll see you again thank you bye\n\n\nDid you become very African film festival coming up with this weekend if it is on a weekend of cleaning African student stuff from the continent and it's the water\nIt in Ninety seven thirty two countries one weekend you didn't African through the African chicken of year is the founder of these political buddy succumbs construction work with complex or coming\nYeah thanks for having me you've been very religious since the end of last year especially for like ...\nThe window when he signed him say at least he told me if I see a test\nAnd that theme park I didn't just across from the Olympics we shouldn't be given the final say very close to date has placed right now and it's called the states for those that are going to use for the fact\nThat it's very easy to find the same size park I think ... ... ... each other folks directions on all sides people signed up on our website\nGo with I don't try to sites like you were threats and they're going to get these photos we go into the costs you out for a girl from cocktail all five and then with looking pretty senior staff courting votes in\nOur office on Capitol so frightening for five sites throughout all of that we come back five today from a smart move your Sunday is the same\nShow and all the tail and instead he rose I didn't get it off with our community I deployed to say about those Sunday from about Seventy as we can to wind defects and what's going on with the Clintons get everybody on your or with inflation could still make\n'em down and we were coming out some kind of on camera\nStudies our framed chicken half African company African film festival the well which is happening this weekend and now [noise]\nSaturday and Sunday yeah they've got tons of films from Africa and the main the main to show up to these countries and we've got some access to give away to the film festival\nA view would like to go give us a call here we got a\nCouple of pounds of maybe three I'm feeling good\nAt that point one five eight from one phone one three four but he's won five feet for one phone line three four\nPoint seven fmri and also on the Web at K. A. L. W. dot O. R. G. and\nComing up tomorrow if everything goes well we're supposed to have all the visit me tonight what do I did visit for those on yeah urban pop singer had more than I\nArise yes they are not going to look at the airport and maybe what did they show up yeah\nYeah so we'll see maybe they can make if they do or how we would love to have him here and um the men well we're going to replace the music and not all good to see you get well my friend yeah so I Would end up we will hear from you about someone I guess yeah\nAnd we're going to go to Tanzania and here's this is the ... the man who used to call themselves a sewer 'em by you know ugly but such a beautiful music such a beautiful music as long as it's called ... [noise]\n\n\n\n\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\nI might be\nMore number one very well [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter] [laughter]\nNa na\nNa na na\n[noise]\n\nWell\nNa na na\nMoney\n\n[noise]\n[noise]\n\nNa\nNa na na na\nNa na na na\n[noise]\n[noise] na\nNa\nNa na\nNa na\nNa na na\nNa na na na na\nNa na na na\nNa na\nDay\nThey show is Africa mix on KLW Ninety One point seven FM and also in a way back K. A. L. W. dot O. R. G. uh my name is that ... along with them in one letter we'd like to thank you very much for listening every week\nAnd I'm when I'm ... those who won the tickets to go see a P. Y. S. I'm asking is on it but I'm told by twelve an ask another and uh also those who won tickets to go to the Silicon Valley\nUm uh\nAfrican film festival happening this weekend Friday Saturday Sunday and uh so congratulations very much thanks for listening and we'd also like to let you know that I'm\nA a gift that we were expecting harmonize is playing a in Oakland tomorrow night and we hope you'll be able to make him a in the next few minutes otherwise we'll have to talk to him off the uh the the air\nAnd then uh maybe have him or talk to you next time when I'm so\nWe'll we'll tell you about that later but uh but to my idea of what our ... going to be at um the freight and salvage in Berkeley on Sunday so don't miss that show it's gonna be a wonderful again\nA lot places um amazing it's great uh you go there they've got a dance floor and they gotta they smelled bad seat at the freight and solve age\nAnd um that is um and then um what is it\nOh it's it's sold out oh whoa yeah so in not always telling me that she always told 'em I bet you know what you really want to go you can go in the door and sometimes people don't show up\nAt a a bad um [noise] wow that changes everything but if I told my idea where it's going to be at um the freight and Savage on us on Sunday night [noise] and um\nLet me just tell you what you heard here and we began a\nSong called ... song I'm Carla with us on call ... don't go buy\nA ... gala from Tanzania out and and we had a\nSong called star I have both songs about you know warning people about the epidemic early age that and\nI'm a lot of the songs were done when people want really talking about it was taboo to talk about\nAnd and now telling hang listen guys it's\nHere you better be have a right [laughter]\nYeah so I Am [noise] and and um so\nAnd then we ended a song by a song called I'm a minority now which is supposed to be a well very famous um [laughter]\nUh arches from East Africa that I've never heard of on us I mean I Know that song and was brought to me here by uh my my buddy Julius wrote teach who was here in Studio how come I don't know about\nThat my friend and delicate ship ... is one of the best musicians in East Africa I Love him very much he sounds pretty songs are like um ... you know you know to some of it I'm sure yeah\nYeah I Know this on but I just never heard of the guy's name but but you know maybe because I'm listening to too much Zimbabwe you advocate and in Mali in music oh yeah it's time to come out to East Africa listen I Am in generally going to\nYeah I'm definitely going that is my friend Julia several teach who is uh just good come in me to the studio today and just recommend and that's what we do here in the ... anybody is suggesting music and we come here and we play the music on the air or so thank you very much my friend so we got an eight or they show going I'm\nOn I'm\nSong is called quote a ball it's done in the Congolese dialect of Swahili by a guy from Zambia who leaves in Belgium and this is Dominic ...\nAnd in a college slightly means wow as a whole boy people at home\nOr burned\nAnd now", "show_name": "Africa Mix", "year": "2018", "city": "San Francisco", "day": "05"}