{"month": "10", "state": "CA", "station": "KALW", "content": "If you think they should still be exam but now\nThat the quick summary of open measure why for more election coverage go to a K O W dot org\nAfrican mixes next two hours of music from Africa and the African diaspora the time is nine o'clock or Ninety One point seven KLW San Francisco\n[noise]\n[noise]\n\nYour show up all of them ... ... ...\n... ... ... ... but we can learn and you're giving them like can you give them ... ... [noise]\nLadies and gentlemen my ... my ... is among a number got cut might be a bomb but welcome ... needles to Africa mix\nOn KLW nine to one point seven FM in San Francisco and also on the Web at K. A. L. W. dot O. R. G. my name is I Do not come on and on every Thursday night we bring you music of the African continent and the African diaspora\nLie on the radio\nWhile she heard about this one is for federal law this show tonight is going to be for federal law that was the voice of a a below the recently departed to join for law I can only imagine how\nThey are jamming they're our ancestors and the living dead and\nI'm ... ... ... ... where these version of lady so today led to the gym and we're going to celebrate\nUm [noise] the the birthday of\nThe one the only afro beat like gender the inventor of afro beat\n'em ... unequal awful cruelty now Saddam\nAnd so this week and the week before on ... and maybe next week of the celebrations all around the world they call them celebrations where they celebrate the live over this legend a man who\nUm was feeling and inspired a lot of a lot of artist so today you're going to hear music or some of it I'm going to try to to get that many of these songs alike and as you know you know by ... initially I wanted to come in place for songs that are about twenty eight minutes each\nI can think of a couple that are beasts of no nation or\nUm which one is that a army arrangement and I could have come in and and played um [noise] what out of there there are several songs that are\nAbout the ... and ... J. J. D. Joni just drop it [laughter] and this late folk songs and ... and go home better I just wanted to show you\nThe uh how ... reached the world I just from a Nigeria\nAnd just it's music is all of us are we going to hear music from Brazil studying is inspired we're going to\nHear music by people are doing so as a last covers know fell off some of the most famous fellow songs which I'm really excited I've fallen some some really amazing ... covers and ... and very interesting covers of uh\nOf ... songs I now ...\nAnd then now are we going to hit songs by have equal as people like you must have ... minority bongo and are able to tailor of ... and so afro beat and from from those guys and\nAnd that it's kind of one for sure I'm trying to get as much as I can in of course I'm going to get my ... and then I'm sure that\nA lot of people as a fan of rights and they they use them a song about federal law that you would like featured here today give me a call for one five eight four one for one three four\nAnd let me know but this one is false ... la miss is that you must have got a\nLot\nOf this ...\n... ... ... what was your ... your ... your\nTypical mission bullshit you do when you might imagine making like a digital image and you don't mean like I didn't like the chicken in the week you did you use the language of giving them like I'll give you a\nThem give me when I got on board [noise]\n\n[noise] forgotten woman who\nShe goes\n[noise]\n\nColumn about when you go and play the\nYou know long ago\nYou know the lead and you know again evolve\nThem and making them\nThey don't\nNot forgotten them I Know who he goes\nShould go down the road\nYou're going to be like they\nThey they they should be legal you know the the way\nI mean do they\nThese days you know we will\nRead she\nShe\nSeems\nModels\n\n\nYears in this novel\nPay the ... and the ...\nThe\nBecause in may and if you look\nAt the inland\nOf the\n\nRubble\nOr\nOr her\nThere and\n...\n[noise]\n[noise]\n[noise]\nAnd then\nCome to terms\nIf they wanted to run run run them a test to discover something they love from\nSome one nearly died\nSome of the John\nAt least they come on me because I\nThink it was the way\nDestiny meaning they've made it always\nLeaves don't\nShow me doing the stuff down at least ...\nTimes a dental leaving\nThe regular guy by democratic ... did my camera naturally I have not bought these\nIn the when the when they die in Boston they must be some\nSome one job\nThey come on me because\nGoing to use them and we we occupy the\nFunding being made them closed\nBut willing to do when we don't indeed be a little salt\nWhen I pay them leaving begins arm\nDay time Democrats rely jade de la\nOn the\nDo yes you will just look like them\nThere she doing damn\nSouth of prescribing them ...\nTo\n[noise]\n\n[noise]\nDo do do you ever need\nTo be any any any\nNews they can be done and be able\nTo be [noise] I didn't look to see what the next and [noise] they\nAdopt glad that you know well I got a big job well no doubt about that I didn't know they didn't come back\nAnd you know the last album adult job I'll go against the gum and I'll go dished out dumb and make them around and go they'd be I'm a big dog um and I'm ... I'm ...\nI'm a reunion with the gang banging them remember the game will be in the bank to get into the country can be funny but the main the main one to one of the Olympics\nNow do\nYou every day that the stuff we\nCan do a lot about where the guy\nThree jobs and you know what can you\nFree to\nDo with it and they got to go to Joe Biden da da da da\nDa da da da da da\nDa da da da da\nDa di di di di di di di di di\nDi may be\n\n\nA\n\nLot of friends who live\nThere for\nTo be coming in and you're going to get on the minimum wage in New\nYork in the middle of all\nYou are pre ... Jimmy up not right now I'm you know the average ... listening to me it was on the line [laughter]\n\nDo multiple multiple blah blah blah blah blah blah blah blah well now you're on the ball to be done you know your phone to beat you down\nTo the uh\n\n\nBeing in the game on during the day by day and by\n[noise] Ninety One point seven KLW San Francisco but she always Africa ... my name is Andrew no call\nOr we'd bring you African music on this radio alive every Thursday night from nine eleven so we're halfway through the show my friends [noise]\nNow are we are celebrating the life and the work of a ... ... T we're celebrating his ... they are which is the greatest thing that ever happened to Africa he's the birth of\nA ... could she and the many who um didn't get to express their you know there what politicians like little ... about whom you had the best sang about a by femi Kuti\nAnd as so many more ... to ... is a message of African Independence and African determination and I remember one of the songs we asked\nWhat is it that we Africans have that we can sell to the world up until today we have not found that out and um so the struggle continues allude to continue on\nNow and we begin I sat with a mix we remember which is a\nA song by femi Kuti so remember what my son cover I said I'm ...\nAnd um even on you know when I'm not sure I'm sure there are a few well myself included are beginning to question whether a Monday a lot really let the people in South Africa they're ... to ... get off easily because you know it's it's really easy\n... and then it went into their crimes but everybody else you know you have a you know and by as uh like the Ottoman Empire in and and and and others of him by as a people of color and\nThat that ... that that did um you know a hundred years ago and and did a really really ugly thing and we're still\nA call them that they uh Bruce and but then you know Europeans people European descent do the same then it's oh let's talk a ... you know ... conciliation and to to recall ... so they can keep all the wealth that they stole from Africa and say hey you know why\nThat was then this is now or we need to uh get a long time and so we began this over a cynic would make we remember and and now we have an African problems by showing ... showing who is a\nUm [noise] the one who to call it the ... died in Nineteen Ninety nine and a Nineteen Ninety seven as as though it was shown was fourteen years old and he to calm this momentum has\nThis humongous has a responsibility of carrying out on um ... legacy through the band\nAnd he has done very very well I'm I'm proud to say when one day I went to see ... I'm In I'm In Berkley and ah ah I had\nTo go talk to him in the back a little bit and and I needed to record a\nI'm a promo for hours and they needed him to record and I had something printed in the ... or ... I got to find that out I think I have it somewhere haven't played in a while and I say you would you we we love your music when you say this about KLW any side\nAnd he's in in the green room smoking a joint and\nFix the paper and passes the joint to me now I quit smoking weed when I was six years old [laughter]\nUh not really but you know when he became legal and everybody could smoke it it just the the novelty of it um you know we'd was so much better to smoke when there was like for being in in sewers daring act now it's like on the but then\nI but I was I was also at work ... I Can't really but when I my ever going to shed joint which show in ... when\nWhen again he just asked I didn't ask for it he asked it\nTo me and I might just going to hold it and ... and look at it until\nHe reads this thing that I'm recording ... do you make the decision [noise] and then we\nThe SAT with a song called suffering and smiling suffering and smiling how we um Africans are all over the world to get to be used and used and and we'd just like saffron you're smiling where just happy and\nMy best so many so many many of fell off songs that I Want to play here tonight but I have a very limited time\nAs so we're going to keep the show going my name is ed in Oklahoma again on KLW Ninety One point seven fmri and if you want to listen to the show again as a K. A. L. W. dot org ...\nI'd like a also to remind you that I K. L. W. is a listener ... said radio and we're able to do is to calm I mean where else can you go out and say\nI'm going to do a ... song attribute tonight\nLast week you know when I when I say we need to do something this year for fella and and we didn't we didn't have to consult anybody seriously\nIt just the two of us is like you know let's just do it\nWhy because we know that you will love me most W will love it yeah if you've never heard of that a lot of music you will find out about it you will learn about Caroline to love to allow you're going to be in heaven\nAnd we do it because you are I'm a member of you support and to find out how you can be a member and to listen to the show again go to Kate Kate L. W. dot org that is K. A. L. W. dot O. R. G.\nNow one of 'em my step right artists from a lot of the era is a guy named Abe or Taylor\nWho is that I'm from ... and his ah afro beat music is one of my separate and more and here is that song\nWhat is the African woman\nIn Long Island [noise] [noise]\n[noise]\n[noise] [noise] [noise] who [noise]\n\n\n\n\n\n\n\n\nLittle\n\n\n\nAnd\n[noise]\n[noise]\n\n\nGod\n\n\n[noise]\n[laughter]\n\n\n\n[laughter]\n\n\nGuy\n\n\n[noise] [noise]\nAnd you'd be able to do\nThe monthly main\nTo go\nWe\nI Am really pressure them to my\nI've been watching the\n\nWell\nAbout but when the boom and don't want\nThe watch of what they're going to be that\nDo Bob press a button and we'll negotiate with them in the middle of the new home and you know the\nWas dirty bomb full of middle of a woman in the middle\nNeeds to be\nDo more bond died about all NATO models who\nYou can be the one that\nGirl she'll\nCan be the\nCall Margaret Mitchell woman you know\nBig one that I'm a little bit of the\nWorking on it\n\nDi\nDi\nDi di di\nDi di\n\n[noise] [noise]\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\nAnd I'm Linda\nLike just the\n\n[laughter]\n\n\n\n\n\n\n[laughter]\n[laughter]\n\n\n\n\n\n\n\n\n\n", "show_name": "Africa Mix", "year": "2018", "city": "San Francisco", "day": "19"}