{"month": "10", "state": "NH", "station": "WEVN", "content": "WCBS Nashua eighty eight point three W.\nE. V. H. Hanover Ninety One point three WPN keen Ninety point seven W. E. D. C. Corum when I was seven point one W E v J Jackson Ninety nine point five WCBS Holbrooke Ninety point three and W. E. V. cute\nLittle ten Ninety One point nine an on line at an H. P. R. dot org\nWho\nGood morning for all the pressures Saudi Arabia faces for the disappearance of a writer the kingdom has one\nProminent defenders\nHow President Trump back to print\nYou listen to the Supreme Court justice Brett Kavanaugh the president says if the Saudis here we go again with you know you're guilty until proven innocent I'm Stevens\nAnd I'm Noel King also this hour we ... mirage this year's winner of the Nobel Peace prize she's only twenty five years old but she's on a mission to dry and into atrocities committed against her you know the people the federal deficit jumped in any time any means lots of finger pointing\nIn Washington will get some answers when nobody's having these\nThirty nine years old today and the news isn't it\nLive from NPR News in Washington I'm Dave ... secretary of state Mike Pompeo is an ... today for a meeting with Turkey's president on the disappearance of Saudi journalist ... NPR's Peter Kenyon says the talks come a day after Pompeo was in Saudi Arabia to try to get answers\nFrom pale arise from Riyadh where he met with king some on and crown prince Mohammed bin some on on the show you disappearance\nTurkish authorities have said they have audio and video evidence to show was killed inside the consulate the Saudis deny wrongdoing and I've yet to respond to media reports they're planning to acknowledge show these accidental deaths during questioning\nFollowing President Trump's suggestion that road killers may have been responsible the New York times linked for Fifteen Saudis who arrived in Istanbul today official ... disappearance to the crown prince Peter Kenyon NPR News Istanbul the death toll from\nAuthorities in Bay county along the coast in the Florida Panhandle say at least twelve people were killed by the category forms for storm there it includes Mexico beach in Panama City where there's heavy damage and flattened homes and others were killed by the storm and Georgia North Carolina and Virginia\nThe Justice Department says Fifteen indictments have been issued against members of one of Mexico's largest drug cartels they were accused of trafficking into the U.S tons of cocaine meth and heroin laced with fit and all the indictments were announced by attorney general Jeff Sessions\nThese car town there every day or taking advantage of our poor southern border to move and push their illegal drugs for large profits billions of dollars tens of billions of dollars expanding suffering and death in our country\nThe Trump Administration is offering a ten million dollar reward for information leading to the arrest of the cartels leader who is known as el men show he runs ... Russia on sales of recreational marijuana are now legal in Canada as Dan carping Chuck reports the change took effect this morning\nAs the clock struck midnight in different time zones hundreds of Canadians who had lined up to be the first to buy marijuana legally celebrated people and new Finland where the first to by legal marijuana\nAnd count down to the magic hour were held in major cities in Toronto there was a New Year's eve style party puffing poor painting class in Vancouver and protest from those who aren't happy with the age restriction of Nineteen or older\nBut some provinces such as Ontario are critical that police still aren't equipped to reliably screen for drug impaired driving and the recent surveys adjusted that nearly eight out of ten Canadians have no interest in smoking legal pot for NPR News I'm Dan ... in Toronto\nWall Street is coming off a day of sharp gains the Dow added five hundred forty seven points or more than two percent the S. and P. five hundred also rose more than two percent its largest one day advance since late march this is NPR News\nHarvard University's dean of admissions is defending the school's admissions policies and a federal lawsuit alleging bias against Asian American applicants Kirk Carapezza with member station WBUR GBH and Boston reports on testimony in that case\nThe group students for fair admissions is led by a conservative legal strategist who works to oppose race conscious policies in any form the group's lawyers point to it too doesn't Thirteen internal investigation into Harvard admissions records\nIt sounded a few Asian American applicants were described with terms such as quiet shy and good at math and lumped together with other applicants of the same ethnicity\nOn the stand for a second day Harvard longtime dean of admissions William fitzsimmons said the university doesn't endorse those comments but of course then fits him and said raise is never a determining factor but it can make a difference in some cases\nHis testimony will continue on Wednesday\nFor NPR News I'm Kirk Carapezza in Boston\nThat trial is expected to last three weeks in major league baseball the national league championship series is tied at two games apiece last night the Los Angeles Dodgers beat the Milwaukee Brewers two to one and Thirteen innings\nLA's Cody Ballenger singled home many Machado from second base with two outs in the bottom of the thirteenth for the win the game lasted more than five hours game five is this afternoon\nIn the American league championship series the Boston Red Sox lead the Houston Astros two games to one last night Boston beat Houston eight to two in game three of the A. L. C. S. game for is tonight in Houston\nI'm Dave ... NPR News in Washington\nFor NPR comes from dream wave maker of luxury massage chairs from Japan with Shiites viewpoint detection and sixteen\nNovember six is fast approaching and candidates are crossing the state\nSpeaking with voters this is my first time being able to vote just turned Eighteen and mad like his message I like his background I think the important thing is to be familiar with all the candidates and what they stand for\nHowever you vote to make sure you're following the news you need to make an informed decision we stay tuned to NPR for all our election coverage\nIn each PR election coverage funded in part by golf Wilson immigration law and the New Hampshire school administrators association\nAnd almost a winter like forecast for some parts of the state partly sunny today over southern New Hampshire the clouds of some rain and snow showers in the north country and there's a possibility of an inch or two of snow in the mountains\nThere'll be a cloudy throughout the evening is while they're with us some snow showers eyes north in the lower forties fifties for southern a hamster today\nThey're not those clubs do linger with some snow showers to the north clearing out south will turn windy state wide and cold overnight lows anywhere in the twenties to lower thirties for all of us Thursday but forecast begin clouds to the north is no shower sunny skies south ties staying in the thirties to mid forties [noise]\nFive Twenty one this is an HBO\n\nSupport for NPR comes from the station\nAnd from the doors do charitable foundation clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nFrom the state of June ... is the question is served as an enduring investments in the future of public radio and seeks to\nQuality journalism and the twenty first century [noise]\nFrom the public welfare foundation committed to advancing justice and opportunity for people in need some more information at public welfare dot or\nConfirm the Conrad Hilton foundation working to improve the lives of disadvantaged in vulnerable people throughout the world and learn more at Hilton foundation dot org [noise]\nIt's MORNING EDITION from NPR News I'm Noel King\nAnd I'm Steve Inskeep good morning when the Nobel Committee said that ... there was one of the recipients of this year's peace prize both cited her courage\nShe refused to accept the social code that requires women to remain silent on the shades of the abuses to which they had been subject to the\nFour years ago as ... street fighters enslaved thousands of women and girls in Iraq maybe were repeatedly raped and sexually abused in other words\nNot humor odd was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority group the ...\n... people in their their money and\nThey just on a simple life they they can they can leave we any group in Iraq in even hand but and they are they're very ... these people in the ... yeah they just want\nTo live in peace and fixing\nTo feel safe I talked to him rot and NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm um diminution um we have set\nIt over and over that it's important for us the justice is done out of the six thousand years ET women who were abducted by ISIS we hope to see at least one ISIS number who did this\nTo one me as a woman to be punished for the crimes they committed against gives me the women and we hope to see them in court in public\nI think it is easy to see winning the Nobel Peace prize as a kind of\nCombination or end of a person's career you've you've done what you set out to do in your case at twenty four years old that is clearly not true you clearly feel like you have a lot left to do what is next for you after winning the prize\nAnd I'm twenty five to twenty five ... and ...\nAfter I delivered our message and we have as a community delivered our message that we would like to see the reconstruction of our homeland infringe are take place and to provide security for ... so that they can go back\nAnd we would like to see this never happen again not to any others community or any other religion or any other group are you angry\nUs in the ... I Can't just simply say I am angry cheap because of that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel every day\nOr what chemicals to showed him that you know like I said what makes us feel good at least is that we are delivering a peaceful massive die we are not delivering a message to hurt anyone when I meet with students and presidents and anyone I speak about what happened to us and I deliver my message with a clear conscience\nThat I advocate for people\nDuring our half hour interview not humor odd seemed at\nShe says that strength comes from her UCD identity she calls the rape of using the women and the murder of UCD men including many people in her own family a genocide\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes finds herself frustrated\n... new ... sometimes I feel that my message has not been clearly heard but that is not my fault because I feel like too much is going on in terms of woman being victims and it's not the first time and certainly that's not the last time\nAnd perhaps every year a woman someplace in the world or groups of woman or thousands will be victims of sexual violence or terrorist groups and so I feel like this is not new to people and it's not going to be the last time and people have become numb to this kind of news\nI'm your mother\nYour mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel\nIn some of the ...\nWhen I received this news it was around probably\nFive AM in the morning in the U.S and the first thing I did was look at her picture and cry but because they felt that he needed her her ... and not just her but the eighty women the ... are women that were with her\nAnd they were all executed for no reason just for being ... and for being older women I feel like they will be proud\nProud\nYou are twenty five years old you've just gotten engaged congratulations in your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now\nWork ahead a modern huh yes we have gotten engaged but it's still difficult for me to deal with all of that so much as much as I Try to come close to finding a simple life things come up and we have to deal with them and still continue this work\nBut I Hope that I can I Want to learn English I work on my English in school\nAnd I want to create a family with my fiance and being able to live a simple life and just be safe\nI Hope you get exactly what you want\nIt was really a pleasure speaking to your not humor I thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media I'm Noel King you can reach me on Twitter at Noel King Rachel Martin is at Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep to find out more about the people who put this show together\nEveryday go to our website NPR dot org slash MORNING EDITION and click on the staff taps to read about are amazing crew of editors and producers [noise]\n\n\n\nThis is NPR News a gift and H. P. R. theory they plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of major and plan gifts for an HBO as any\nAre staged and your world so to wear your legacy gift inspired future generations email me at as the algae at an age the R. dot org ... to learn more about including an H. P. R. and your estate plans or go to an H. B. R. dot gift plans dot org\nSupport for New Hampshire public radio comes from you our listeners and pine point financial offering financial and retirement planning advice for individuals and families of all incomes getting\nEarly but he was very popular and gets to county and and I would have loved to have more early voting locations it came down to having more locations you know helping more voters versus are this year he responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights in a state where a voter id redistricting an early voting rules have all been struck down by the courts at various points in the last few years\nDuring in June debate about early voting democratic state representative Amos click said the requirement that if one side is okay on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting has been rougher and has been referred by a certain population and certain populations who's right to vote has not only in it but it's been rejected in recent court decision\nHe's referring to black voters and appeals court ruled a twenty Thirteen lot that among other things caught early voting by a week targeted African Americans with quote surgical precision that Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the debate ... we\nGood to make it or reliable and dependable voters would know that the early voting sites or their county was open or the ... I'm In the morning to step on the evening\nThe law has some bipartisan opposition run riot is the Republican Party chair of the ... county about fifty miles north of Charlotte the county has had to cut its early voting sites in half frustrated just a word that I Would use and he says even though this may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budgets like ... are disproportionately affected by this change well individual locations maybe open longer they released Seventeen percent fewer sites that selection MIT political scientist Charles Stuart that third says that for voters convenience Trump's hours\nAnd there's a lot of research that's been done to suggest that whenever you move a polling place further away from a voter they're less likely to vote there\nStewart says the real change could simply shift turn out to election day which could mean longer lines at the polls in a state or a voting rights have become such a political hot potato elections officials say they just go with the flow Becky Gallup Harris the elections director in ... county\nDue to court cases legislation all of that kind of thing factors in and it just seems like we always had some ... ... and that takes us in a different direction\nThe question remains will voters adapted easily for NPR News I'm Alex ... [noise]\nIt's NPR News Seoul\nThan age PR Joshua Johnson host of NPR show one day is coming to New Hampshire we broadcast on your show nationally from an H. P. R. tomorrow and friday coming up we'll talk with him about what he has planned as he heads for the Granite State and have getting out of Washington DC effects and show\nA conversation at ten minutes here on an HBO\nLibertarian candidate for governor Gillette uh Jarvis says to promote wage growth in New Hampshire the state needs to provide tax incentives for high tech jobs because those are the ones that pay more and a tax break for film industry\nJob drivers also says legalizing hemp would strengthen the state's economy conversation with dilemma Jarvis about the economy is headed November's midterm that's today on all things considered from four to six months in age PR [noise]\nSupport for an age PR comes from you our listeners and granted state college offering diverse degree programs designed to help working adults advance registration and information that granted dot edu [noise]\nAt Massachusetts General hospital using research to develop treatments for complex conditions all to help their patients get back to their lives [noise] Mass General revolutionizing can\nListen to the radio and your schedule with an HP ours podcasts you can check out civics one one refresher course and how our democracy works for outside in an exploration of the natural world and how to use it but a complete list of our news and information podcast cut and H. P. R. dot org\nChanging partly sunny over southern New Hampshire today but clouds and some rain or snow showers in central in northern New Hampshire as north in the lower forties fifties cell\nPhones linger tonight I'm In North Country against some snow showers maybe an inch or two in the mountains glaring out in southern parts of the state turning windy and cold temperatures in the twenties or thirties\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges find out how or in Reno can help you on line at or dash Reno dot com\nAnd developing country working to inspire and enabled the next generation of inventor\nMore information is available\nAt ... or\nFrom the John Jay and Catherine MacArthur Foundation recognizing exceptionally creative individual\nThis year's MacArthur fellows more information max phone\nFrom a listener supported this NPR station [noise]\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Noel King there are reports of a surge of new Ebola infections and the Democratic Republic of Congo today and emergency committee of the world Health Organization is meeting to advise on whether the outbreak should be declared a public health emergency of international concern and ... and then has the story\nThe w._b. Cho has only sounded the alarm this way for times most recently in twenty sixteen when Zeke erupted in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak and the deer see has been much smaller about a hundred and eighty confirmed cases so far but it centered in a particularly challenging area\nThe programs that have been more than ... people conflict\nPeter ... is a top official with the W. H. O.\nOne minute to minute residents internally early on food and if you voted democratic ...\nAn armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians now so I'm a says despite that when Ebola first surfaced in early August\nWe're quite confident we would go up over there for\nThe government W. H. O. and partner organizations launched a major effort to treat infected people and administer and experimental vaccine to anyone who had had contact with them the strategy started to show success\nAnd then what happened September is we had seven or eight major\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nThe population of interested enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even go to a physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNow salon stresses that the vast majority of people are still cooperating but rumors have started that the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after a rebel attack whole neighborhoods shut down in protest\nWindow to live in the streets of barricaded by young people sometimes burning tires are objects\nAnd sometimes the ... other weapons\nIn the last week and a half the effects of this have started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert an advisor to the W. H. show\nSome fielded by calling the public health emergency warned\nWill possibly increase the mobilization of funds\nThe deli they chose asked for thirty three million dollars to neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency could also have a wider affect\nIt may also helped in increasing the security in the area\nBy convincing the UN or other groups to bolster peacekeeping efforts that human says there's also a danger here\nThere are others who feel that may be such a declaration would embolden the rebel forces\nThey'll figure ending this Ebola crisis is clearly important to the D. R. C.\nAnd the rebels don't want the government to succeed you eat five men NPR News [noise]\nThis is NPR News and this is an age PR\nW. E. V. S. Nashua eighty eight point three W. E. V. H. Hanover Ninety One point three\nW. E. V. in Keene Ninety point seven WABC ... one of seven point one Kelly\n... Jackson Ninety nine point five W E v asshole Burke Ninety point three and W. E. Z. cute little ten Ninety One point nine and on line and H. P. R. dot O. R. G.\nGood morning what makes President Trump's so eager to defend Saudi Arabia\nResident backs up a vital ally suspected of ordering the murder of a U.S president\nIt's MORNING EDITION from an HBO [noise]\nI'm Rick gambling with Noel King and Steve Inskeep president compared to Saudi crown prince to Supreme Court justice\nMen were found quote guilty until proven innocent\nRepublicans tough election year may not be quite tough which you know voters are largely presumed hostile to President Trump but some are backing Florida's Republican Rick Scott also this hour with less than three weeks to election day for speaking with each gubernatorial candidate about health care issue New Hampshire today we'll speak with a bitter enjoy the drivers\nAnd health officials track of mystery and all those children in some parts of the country\nAnd later we'll raise giant pumpkins on the ... river\nIt's Wednesday October seven to [noise]\nThe news is next\nLine from NPR News in Washington encore of a Coleman cleanup continues along the Florida Panhandle and in parts of Alabama and Georgia from hurricane Michael at least twenty six people are known dead from the storm sixteen people in Florida and the others in Georgia North Carolina and Virginia what's unknown is how many people are missing\nSecretary of state Mike Pompeo says the Saudis have committed to investigate the disappearance of a Saudi journalist but so far he won't say whether he believes the Saudis killed the man in their consulate in Istanbul as NPR's Michele Kelemen reports\nAs he boarded the plane from Riyadh to hunker secretary San Pedro was describing his visit to Saudi Arabia as a success the Saudi king crown prince and foreign minister he says all understand the need to quickly investigate the disappearance of Jim out 'cause showed gee\nThey want to have the opportunity to complete this investigation going to ... and I got I think that's I think that's I think that's a reasonable thing to do to give them that opportunity and then we'll all get the judge will all get to evaluate the work that they do\nShow he was last seen entering the Saudi conflict and it's simple October second where Turkish authorities say he was killed the Saudis initially said he left the conflict but now appear to be changing that story Michele ... NPR News traveling with the secretary in ...\nTexas Republican Senator Ted Cruz and his Democratic challenger representative Beto O'Rourke held a second debate on Tuesday from member station ... K. E. R. A. Rachel ... Lindley reports they sparred over health care abortion and border security\nWith less than a week before early voting starts in Texas crews work never missed a chance to pounce sometimes simultaneously\n... thank you very nicely how old I get an\nExchange kept our question on border security\nCongressman O'Rourke not only opposes all but he has said we had too many fences and walls already on the border he wants to tear down the ones we have\nThe El Paso Democrat said the U.S should focus on beating at ports of entry\nI'm a better idea of who and what comes into our country demonstrably makes us safer\nSen Cruz came into the debate just hours after a new CNN poll showed him leading his challenger by seven points for NPR News I'm Rachel Lindley in San Antonio it is\nNow legal to buy recreational marijuana in Canada the new Canadian law took effect today than carpet jak reports that Canada is the first ... seven nation to legalize recreational pot\nCelebrations in part parties when well into the night as many Canadians marked a day they believe would never come\nPrime minister Justin Trudeau is campaign promise to legalize recreational cannabis is now reality anyone Nineteen or older will be able to buy marijuana but just days before legalization a new survey suggested nearly eighty percent of Canadians have no interest in smoking legal part\nThan carbon jak reporting from Toronto [noise] this is NPR\nSix so for this was an age PR News I'm Rick gambling Lebanon residents will rally ahead of their city council meeting tonight as a niche bears fried green reports they're finding a planned by liberty utilities to build new natural gas infrastructure in the area the state public utilities commission\nUh with restrictions that includes that the company not ratepayers to be on the hook at the project doesn't meet its budget that let some speculate that the utility would walk away but liberty says they're still moving forward a group of local residents including ... percent at the kitchen with over a thousand signatures to city counselors urging them to help stop the project\n[noise]\nHe says what the reality of climate change we need to move away from fossil fuels French news ... green\nOr New Hampshire school district has decided to delay any action on thirty two thousand dollars in unpaid student lunch bills at least until a meets with SOU board officials Claremont school district officials had previously considered hiring a collection agency to manage to wants to the lunch dads\nClaremont school board recently decided forgive debts of twenty dollars or less which would write off about five thousand dollars total school officials say the there are not any families on free or reduced lunch money so you board is scheduled to meet tomorrow\nIn Hampshire preservation alliance has announced it's seven to save properties that annual list highlights historic places in the states that are in danger of disappearing and experience Robert ... has more\nAndrew Cushing is a field service representative with the alliance\nThis year uh we're counting it as kind of our most diverse list and certainly that falls HBO building Seventy nine is all the way up to Nineteen forties\nAnd ... says this year's focused isn't only on buildings there also including landscapes like the old Ruggles Mike in mind in graft in which the state is Wayne turning into a state park\nThe ... state school campus also made the list the former home for people with developmental disabilities is set for possible multi use redevelopment so far the alliance says it's had about fifty percent success rate when it comes to preserving historic properties included on seven to save list for H. P. R. News I'm Robert grow the\nNews sports the red Sox have a two games to one lead and the American league championship series with the Astros after an eight to two when Jack you barely junior hit a grand slam in that game came forward is tonight in Houston Jason Tatum uh twenty three points and nine rebounds says the Celtics cell blasted the Seventy Sixers one of five to eighty seven and their season opener last night\nOur forecast for today partly sunny for southern counties but the clouds will begin to in the north country with some rain and snow showers and there's a possibility of an inch or two in the mountains [noise]\nWe'll see temperatures in the forties and fifties today tonight against some snow showers to the north clearing out south it'll be cold temperatures in the twenties and thirties tomorrow some sun south some clouds north and temperatures staying in the thirties low forties\nSupport for an H. P. R. comes from you our listeners sent from vineyard brand supporters of the I'm\nFrom ... from winds from the parent family the southern ruined valley available at New Hampshire state liquor stores on the Web and round on a ... or for providing renewable reliable automated ... feet in New Hampshire homes and businesses\nDiscovering green innovations staying warm with boilers dot com [noise]\nSupport for NPR comes from the financial services firm of Raymond James\nOffering personal lives wealth management advice and banking and capital markets expertise along with the legacy of putting clients financial wellbeing first\nLearn more at Raymond James dot com [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nSecretary of state Mike Pompeo traveled to turkey today right after a visit to Saudi Arabia on paleo sent by the Trump Administration to try and find out what happened to Saudi journalist Jamal ... the writer disappeared after entering Saudi Arabia us consulate in Istanbul\nBecause she has been critical of the Saudi Government and many people believe he was killed by Saudi agents but the Saudis so far are denying any knowledge and President Trump so far seems to be taking them at their word\nNPR's Peter Kenyon is with us now from assemble Hi Peter I know since\nFact finding mission here out what did he learn were not learn in these meetings in Riyadh end in Turkey\nWell if you learn anything new from the Saudis there's been no public discussion of that so far he did say Riyadh is committed to a full transparent investigation\nOf the Saudis as you note deny any involvement in cars Yogi disappearance or their stated position is still that he left the consulate freely within an hour of arriving and they don't know where he is a there are however these multiple media accounts reporting the Saudis were preparing to acknowledge ... died in the consulate during questioning\nNow in Turkey ... certainly got a very different story a Turkish investigators have said they have audio video evidence of the show ... killing\nAnd dismembered meant at some more gruesome details are coming out today um after the meeting today Turkey's foreign minister uh wouldn't comment on those media reports uh but he said a full investigation will be conducted\nWell we know that Turkish authorities are looking hard I mean they've searched the consulate where 'cause she'll disappear two weeks ago and now we're hearing that those same authorities are waiting for approval to search the Saudi console residents are what are they hoping to find\nWell police barricades did go up around the consul general's residence last night journalists were waiting outside but the investigators didn't show up at Turkey's foreign minister says today they were waiting for final mission\nThey're expecting to search to happen today or this or to the consulate building Monday did healed evidence that to show that he was killed inside the building at least that's what an official tells the Associated Press a president ... says the investigators are looking for traces of toxic materials\nOr\nProtection Act last bells out how landowners can develop their property alongside lakes rivers and other water body it's been on the books for almost three decades if I\nCan still create controversy and confusion send us an email before the show to exchange and H. P. R. dot org and join us this morning live at nine and again at seven pm on any PR [noise]\nSon for southern New Hampshire today between king of the coast but clouds build their way in in the north country to be some snow showers this afternoon maybe even an inch or so in the White Mountains eyes north move lower forties\nIt'll be in the fifties for southern New Hampshire tonight the clubs linger over the north the snow showers clearing south of the mountains it'll be turning windy and cold state wide overnight lows in between innings to lower thirties Thursday split once again clouds and snow showers north from sunny skies and southern New Hampshire but to stay in the thirties to mid forties tomorrow [noise]\nSupport for NPR comes from the station and from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price investor confidence\nFrom campaign monitor and email marketing platform used by more than two hundred thousand customers worldwide with email template that dragon drop email editor and twenty four seven customer service more campaign monitored dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men starring John flattering Amanda Peter Paul riser and Kathryn ... on\nA new episode every Friday on prime video [noise]\n\nIt's MORNING EDITION from an H. P. R. were less than three weeks from election day and this week on MORNING edition we're speaking with each gubernatorial candidate about health care issues in the Granite State today we speak with libertarian Gillette uh Jarvis first start with the opioid crisis you said you'd like to focus on improving posts care for people who are leaving treatment and re entering the workforce\nSo we need to provide them support which includes things like\nJob training getting into a new job wasn't that wasn't exactly what they were doing before so I'm not going right back to the same situation helping them find a new place to live so they're not putting themselves back into the environment that they were in prior to becoming clean\nAnd these are these are part of new addiction treatment models that are being used nationally and in some of that has been talked about regionally New Hampshire but what specifically is not being done that you want to see done that would help with that post care\nWell I think also that legalizing cannabis would assess because of those places that have legalized has seen a drop in their opioid addiction rates and we also need to provide the support to people that are homeless community\nThere has been some tension between grassroots organizations versus the state's plan to establish addiction hubs across the Hampshire which is something that's in the works right now how do you feel about that ... model that's now being proposed it's that's federal money has come to the Granite State\nWell my fear when it comes to federal monies that come in is that it all goes into a general fund and the general signed has a tendency to\nKind of had that money just get last show that concerns me all in itself if we're going to have money set aside for certain projects such as addiction treatment\nI think they need to be in a separate fund a fund that's dedicated to it so we always know how much money is in there how much money is available and how much money is going out when things get into\nRules about this might have been spotted how it has to respond\nKind of ... there are rules unfortunately not always are they completely adhere to\nArgue opposed the federal funding it all for addiction treatment\nI feared federal funds because they typically come with strings attached we'll give you this money as long as you do this with that money that doesn't come with strings attached this is our taxpayer money that we have spent we have sent over to the federal government and the form of income taxes\nGetting some of that back I don't have a problem with\nAs long as they don't tell us how we have to spend it or I Would rather have that if it's earmarked for treatment it has to go to treatment and not no strings on how how we treat it it can't be earmark saying this is for treatment but it must be used\nFor a Ninety percent of it must go to incarceration of addict\nWe're required of them but I don't have the energy right now for this particular money coming in for and I know that you know\nUm what about the workforce or should we have thrown in health care in general in mental health specifically what about ... you know it's difficult for people to get access to the already existing services that we have here in New Hampshire because there's no there's just not enough professionals immigrants do to to treat people well\nOne of our problems is that if you are a license provider in Massachusetts and you want to come and you want to work in New Hampshire\nYou have to make sure that you have a New Hampshire license to work but there's no difference between how you're going to treat people in Massachusetts and how you're going to treat people in New Hampshire I think we would welcome more people into the state by eliminating that knee as long as they're licensed in this country\nThere's already standards on how they treat patients here in this country so as long as they're licensed here we should eliminate that re licensing neat that would allow people to really come here without having to pay to do their job in another state so it would open a door\nWould you support and to re Medicaid expansion of Mr\n[noise] that's a difficult one for me um [noise]\nI Would like to change the way our welfare program is working currently I think that we when we were giving welfare to people we are we punish them when they start working again we punish them when they are\nFinally starting to become self sufficient instead of\nRamping down the payments we just cut them off so if you for example when I was working as an adjunct professor at the community college there was a student there who was on Medicaid and our son was on Medicaid and she had finally gotten a promotion at her part time work at\nA retail place to be a manager that gave her consistent hours across the board so that she could\nMore easily get care for her son and she got a twenty five cents per hour raise which made her lose her Medicaid options so you want to look into graduated from I think a graduating system would be better and then we promote people to get them back to work\nSo that they can be self sustaining because that should be the goal of a program like that if we're going to offer a program that helps you while you are unable to help yourself the goal is to get you to the point where you can help\nYourself again so you're not opposed to Medicaid expansion of principle but you learn to alter the system itself I'd like to alter the system itself would you support it paid family and medical leave initiative\nPaid family medical leave initiative that was introduced I did not support I think that it would hurt smaller businesses from the ones that I spoke to they said that they would end up laying off employees and just doing more work themselves instead of providing additional support\nBuild that was altered in some fashion that did not affect smaller businesses\nMost large businesses already offer it so the people who this will be focused that\nAre those who already offer and then there are five states that have already tried to initiate this program\nNow not than even Washington state which was the first one to initiate it and they have a mandatory you must be part of it you must pay into the system they still haven't been able to financially make it work it's not self sustaining\nUntil a program that can be offered can prove that it can sustain itself I don't think I could to the point that\n[noise] that was a libertarian candidate for governor Gillette ... Jarvis on health care issues here in New Hampshire and listen to all things considered this afternoon right here on earth Hampshire Public radio to hear her thoughts on economic policy\nTomorrow we'll be speaking of the Republican Governor Chris Sununu and Thursday Democrat moly Kelly [noise]\nThis is MORNING EDITION from an HP are [noise]\nHey there is Joshua Johnson the host of one day on any PR were bringing the show to New Hampshire can't wait for you to join the conversation I lead a distinguished panel of get through a special discussion about issues that matter to you and to the Granite State\nWill be at the Capitol Center for the arts in Concord on Thursday get your tickets right now at the C. A. N. H. dot com see their\nThis event sponsored in part by the New England employee benefits company and the community college system of New Hampshire\nSupport for the hamster public radio comes from you our listeners who said survey utilizing the latest technology including laser scanning an unmanned aerial vehicles to provide serving solutions throughout New England to set survey dot com\nBut within a few days Evan complained of severe pain in his back and legs he became extremely lethargic and went downhill quickly\nHe lost total control and both his arms and legs you know one minute you have a healthy head and the next minute your kid is totally paralyzed it it it was beyond horrifying to us\nIt's not clear what caused Evan sickness and the CDC's Nancy mess on ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know who may be at higher risk for developing and get them or the reasons why they may be at higher risk\n... says given the rise in cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery they do know that some kids who get it have also had viruses such as enter a virus another possible risk factor is West Nile virus\nWhich so far there's no common pathogens that links all the cases\nDespite extensive laboratory testing we have not determined what pathogen or immune response or the arm or leg weakness in paralysis and most of these patients\nGiven that the symptoms are similar to polio a disease that have been almost completely eradicate it nothing you pointed out that this is not polio\nRight now we know that polio virus is not the cause of these ads on cases CDC has tested every ... ... patients none of the settlements have tested positive for polio virus\nThe CDC says despite the increase in cases a FM is a very rare condition affecting fewer than one and a million children but she says it's good to be aware of the signs and symptoms the Ninety percent of those affected our children there are some cases in adults\nWe recommend seeking medical care right away if you or your child developed sudden weakness of the arms and legs\nAnd those are the CDC can't give any specific information about what's causing a FM nothing ... says it's good to take general precautions\nParents can help protect their children from serious diseases following prevention steps like washing their hands thing up to date on recommended immunizations and using insect repellent prevent mosquito bites\nIn the case of Susan coin son Evan he's healthy again he was treated with steroids and he was an occupational and physical therapy for Eighteen months\nIs fully recovered he has regained all movement and strength in all foreign land\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care\nAllison Aubrey NPR News [noise]\n[noise]\n[noise]\nThis is NPR News and this is an HBO are coming up next radio field trips\nBut reading the dust down which people were racing giant thousand pound pumpkins up to ... rubber as one does withdrawn bumped was the bumped into dot of next on an urge to [noise]\n\nA gift to engage PR fears they plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of major implant gifts for an HBO ... as an age we are inspired you to learn more about your staged and your world so to\nCan email me at ... at an H. B. R. dot org ... to learn more about including an HP are in your state plants or go to an H. P. R. dot gift plans dot org\nSupport for New Hampshire public radio comes from you our listeners sport also comes from the courier museum of art visiting myth and faith in renaissance Florence unveiling a newly discovered sculpture of Giovanni ... student uh Michelangelo's now an exhibition\nNorris helping New Hampshire businesses and schools and organizations by designing and servicing engineered systems for security life safety and communications ...\nBeer is popular current affairs program one day is coming to New Hampshire tomorrow join host Joshua Johnson at the Capitol Center for the arts in Concord seven PM is your moderate so special panel of gas you get your tickets event at C. C. A. N. H. dot com or\nWhether it's changing partly sunny for southern New Hampshire today but clouds with some rain and maybe some snow showers and parts of the north country\nIce north no lower forties fifties between keen on the coast tonight the clouds linger over the north but some snow showers it'll be clearing out south of the mountains put turning windy and cold state wide with overnight lows in the twenties to lower thirties\nAnd Thursday clouds in the snow shower to the north sunny south put very chilly highs only the thirties to mid forties\nIt's an HP yard six forty five\nSupport for NPR comes from the station\nAnd from long me in makers of go to meetings and collaboration meeting platform that comes equipped with teachers to help people stay focused to get work done\nLearn more and go to meeting dot com\nFrom indeed used by over three million businesses for hiring where employers can post jobs and you screen or questions to build their short list of preferred candidate\nLearned more it indeed dot com slash higher [noise]\nAnd from listeners like you who donate to this NPR station [noise]\nThis is MORNING EDITION on an age PR a Rick gambling for this week's radio field trip we went to see a boat race speech ring false favorites squash dumped it [noise]\nIt's a gorgeous Sunday afternoon in Moscow skies bright blue yellow orange red leaves cover the ground and to fall heir justice CRISPR enough\nDowntown is completely packed there's huge crowds of family and friends visiting them any vendors local businesses lined up along main street\nThere's been a donut eating contest even something called apple slinging but everyone's waiting around for the main event a regatta race with boats made out of giant pumpkins I don't think a lot of people are realizing that you probably wouldn't last year round them yourself pumpkin slow\nOr yeah they are they float a float Jim ... is a long time ... town residents and a giant pumpkin grower himself\nThere Ninety five percent air that so you can't sing a these things and they're like a big fishing barber and eighth floor on water and pretty cool\nJim came up with the idea for the annual ... town pumpkin weigh often regatta Eighteen years ago when he pitched the idea to the town's main street program\nWere looking to create an event it's an eight gosh down a destination and what better thing than these giant pumpkins and and putting them in a river racing um you don't see that everywhere and and so when I presented it to them the idea they looked at each other and they said [noise]\nSupport for an age your life's dream comes from you our listeners and from community minded sentence family dealerships serving keen swan CSI and all of Chester county giving back to the community for over Thirty years ... dealerships dot com\nThe farmers bringing their giant pumpkins for a way off during the first day of the event and then the participants who will captain pumpkins cover them out and decorate them this year's largest pumpkin boat waist sixteen hundred pounds how do you get a good time when you're racing a pumpkin\nWell you know you take a thousand pound pumpkin and you get inside it and you've got you get your paddles and there was a strategy leaning you know you look for the current and you put all your all your waiting and waiting and you you get the river\nHundreds of people are gathered along the ... river the cuts through downtown several more aligned along the bridge that America's finish line for the race everyone is jockeying for the right spot with a good view [noise]\nThere are six giant pumpkin boats each elaborately decorated to fit in with this year's theme\nMagic there spray painted all different colors with flags and pin wheels Gulf town's slick woman Kelly Boyer what kept in the towns pumpkin in this race she's dressed in a wet suit and a pastel greenway faces painted bright pink and blues would sparkle so I'm I'm pretty sure that your piloting the unicorn\nBoat\nMetro nicely with bucking her boat is the second largest in the race is over a thousand pounds it has the head of unicorn attached to the front with a giant rainbow structure arching over the top so what's your strategy we're going\nFor style over speed at this point but I did get to practice a little bit this morning and and I think I can kind of do a slow but steady\nA few more unicorns a wizard and the famous Harry Potter or among some of the other captains representing local organizations and businesses in the race\nPretty soon they get into their boats the all line up with a river\nIn his state of lines you can assumption\nHarrowing\nAgainst the turn of the river to get to the bridge the race is a tight one several pumpkins pulling ahead that falling back [noise]\nThe boats are getting closer to the bridge and Harry Potter and gold pumpkin his head to head\nGolf equipping unicorn blood pumping\nIt looks like it's going to be a tie [noise]\nAnd then Harry Potter polls had to take the way\nEvery Potter or actually Mike Leonard is a teacher who was representing Mountain View middle school in Boston\nWPN keen Ninety point seven\nW. E. V. C. ... one of those seven point one W E v J jak some Ninety nine point three\n... e v F ... book Ninety point three ... W E the cute little ten Ninety One point nine and on line at an H. P. R. dot org\nGood morning Saudi Arabia is taking heat or the disappearance of Saudi writer and dissident which I'm all for show ... the kingdom appears to have at least one prominent defended President Trump [noise]\nMORNING EDITION from an HBO [noise]\nFor the Saudis facing criticism Trump told the Associated Press quote here we go again with you know you're guilty until proven innocent I'm Rick gambling with Steve Inskeep and okay [noise] also this hour we talked to this year's co winner of the Nobel Peace prize she's only twenty five but she's on a mission to draw attention to atrocities committed against her people\nThe federal deficit jumped to twenty eight chain on your finger pointing in Washington\nAnd later on chat would want to go to Joshua Johnson as you get set to bring a show from Washington to their Hampshire for a couple of days It's Wednesday October Seventeen [noise]\nAre you ready for some snow [noise]\nOh yes some areas supposed to get to [noise]\nNews in forecast next\nLine from NPR News in Washington on corporate Coleman the death toll from hurricane Michael is rising nearly a week after the storm made landfall\nAt least twenty six people have been killed and Florida officials say that number sixteen people perished in that state what's unclear is how many people are missing NPR's Debbie Elliott has more\nTwelve of the debts are reported in Bay county where hurricane Michael made landfall last week with a hundred and fifty five mile per hour winds search and rescue efforts continue thousands of people are still unaccounted for\nTheir response has been hampered by heavily damaged infrastructure roads electricity and communication systems prolonged cell phone outages have made it difficult for friends and family to check on people who remained in the Florida Panhandle during the storm\nGovernor Rick Scott has been critical of telecommunication companies for not restoring service more quickly Debbie Elliott NPR News\nSecretary of state Mike Pompeo has arrived in on corrupt for talks with Turkish leaders over the disappearance and suspected murder of Saudi Arabia and writer ... ... spent the day in Riyadh talking with the Saudi king and crown prince and says they've opened an investigation\nThey made no exceptions to they would hold accountable they were they were just they were very clear that they understand the importance of this issue\nThey're determined to get to the bottom of it and that they will conduct the report we'll we'll all get a chance to see it\n... a critic of the Saudi Government vanished October second after entering the Saturday consulate in Istanbul, Turkey Turkish official\nIt inside and his body removed something the Saudis deny\nPresident Trump initially said there would be consequences if the Saudis were found to be responsible now he's comparing criticism of the Saudis to allegations of sexual assault against Supreme Court justice Brett Kavanaugh the Trump says is innocent\nThe U. S. is offering ten million dollars for information leading to the rest of the head of Mexico's most powerful drug cartel NPR's Carrie Kahn reports the Justice Department announced the reward as part of a crackdown on the ... new generation cartel\nAttorney general Jeff Sessions says the ... state based ... at least five tens of cocaine and five tens of Mac and to the U.S each month it's one of the five most dangerous criminal groups in the world they announced reward is dabble what the U.S House had last march for the rest of the cartels leaders in the ... to get us advantage\nMexico is also offering roared as about one point six million dollars to see it as a raft known by the nickname a main show\nUs prosecutors also announced Fifteen indictments against members of the athletes go new generation as they say the cartel has influence in Seventy five percent of Mexico and in several countries around the world Carrie Kahn NPR News Mexico City you're listening to NPR\nIt's no seven afford this was an age PR News I'm Rick gambling\nHospitals will operate seven of the nine hubs at the center of this new new administrations newly designed approach to treating substance abuse as an HBO is Josh Rogers reports despite the promise of millions of dollars in aid no hospitals in Manchester or Nashua chose to produce participate in the program governor Christian new new says\nNew Hampshire's quote hub and spoke system will be running by years in the goal is to put a round the clock addiction services no more than an hour's drive from anyone in the state\nIs it going to work perfectly on day one no probably not but that's what it's about having now coordinated system to get the feedback from different regions of the state to get information to get the data so we're constantly making the system better\nOr the bulk of the systems hubs will be run by hospitals new new says a New Hampshire's two largest cities the state will partner with granted pathways a local subsidiary of national provider fed\nCat we approach hospitals in Manchester Nashville and they didn't want to participate or under the contract that we're providing\nMost of the federal money to states we're going on to fund the new system about forty six million dollars over the next two years is expected to be spent on services to patients fringe PR News I'm Josh Rogers\nLebanon residents will present more than a thousand signatures to their city council tonight opposing new natural gas infrastructure in town feel Bush with the group sustainable Lebanon says he hopes the city council will take a more active role in opposing a project under way by liberty utilities\nContinuing to rely [noise] economically viable source for\nState public utilities commission approved liberties plan to build a new natural gas distribution facility earlier this year but with stringent requirements for its financial sustainability\nThe state's unemployment rate held steady a to point seven percent during September new figures from New Hampshire employment security for the economy added approximately fourteen hundred jobs last month\nDips in the number of construction and manufacturing positions were outpaced by gains of the education sector September ... report continues along streak of positive numbers ... unemployment rate has remained below ... percent since late twenty Fifteen in\nSports the red Sox now have a two games to one lead in the American league championship series after beating the Astros eight to two last night game for is tonight in Houston the Celtics the Seventy Sixers one of five eighty seven and their season opener forecast for today partly sunny for southern counties but clouds with some rain and maybe some snow\nYou have an inch or two in the higher elevation areas of the White Mountains and across North country later this afternoon and tonight eyes north in the lower forties it will be in the fifties between king in Portsmouth support furnished PR comes from you our listeners and from ... New Hampshire resident music of John\nWilliams on Saturday October twenty seventh in Nashville and Sunday October twenty eighth in Concord symphony N. H. dot the Massachusetts General hospital using research can develop treatments for complex conditions also help their patients get back to their lives Mass General revolutionizing care [noise]\nSupport for NPR comes from NPR station [noise]\nOther contributors of foods do\nFeaturing the own new three\nRow essay with seating for up to eight and a choice of second row captain's chair [noise]\nLove it's what makes us to be with us to\nLearn more room dot com [noise]\n\nIt's MORNING EDITION from NPR News I'm Noel\nKing and I'm Steve Inskeep President Trump has dug in supporting Saudi Arabia's crown prince in the same way that he dug in for a Supreme Court justice literally the same the president compared a judge accused of sexual assault\nWith a Saudi leader accused of ordering murder here we go again said the president and an AP interview guilty until proven innocent\nHis secretary of state just visited Saudi Arabia as well as turkey where Saudi writer disappeared\nBut Mike Pompeo explicitly said he did not ask about the facts of the case he only said he wanted a transparent process what are the Trump Administration and the Saudis doing Washington Post columnist David Ignatius knows people well in both capitals Washington in\nRiyadh and he's in our studios David welcome back thank you you would think that a U.S administration would be acting in support or as an advocate for a U.S resident who has disappeared this writer has disappeared who's connected with your paper I guess we should mention um butter the two countries actually working together here well\nThat's that's the biggest fear after Trump's comments and pumped ... visit is that the u._s. is trying to help Saudi Arabia cook up a a process that will uh rather than putting out the facts put out a a a cover story that ah that supports the Saudi leadership\nWe should be demanding as American citizens that our government our our president's X ray state hold the Saudis accountable Jamal ... she was my colleague at the Washington Post but he lives in Virginia lives ah I was with his three children of this week uh who are American citizens\nWe have a stake in helping them helping everyone understand the fact of how he disappeared and if he's dead I was killed\nI Want people to know for those who don't that you have met the crown prince Mohammed bin Salman you've interviewed him more than once at least once this year as a matter of fact when you hear of these accusations that the crown prince himself could have been involved in ordering the murder of this man do you say yeah that sounds plausible\nHe combines two thinks he is a real change agent ... he he does want to change Saudi Arabia place that needs change or any accomplish some of those changes these reduce the role of the road just please use\nAre more Honda dealers have New England dot com and you want to ... school of law specializing legal education for the information age with masters in L. M. degrees and intellectual property to drive innovation in the state and beyond the law Doug UNH dot edu [noise]\nHey there is Joshua Johnson the host of one a on any PR were bringing the show to New Hampshire and we can't wait for you to join the conversation I lead a distinguished panel of gifts through a special discussion about issues that matter to you and to the granted they\nWill be at the capital's Center for the arts in Concord on Thursday get your tickets right now at C. C. A. N. H. dot com see their\nDisadvantage sponsored in part by New England employee benefits company and McLean Middleton\nPartly sunny over southern New Hampshire for the day but we'll see clouds moved some rain in some some showers and parts of the north country maybe an inch or two in the higher trained about Mm\nYou'll be in the lower forties their fifties over southern parts of the state tried the clubs linger for the north where the snow shower and it'll be clearing out south of the mountains and turning windy and cold state wide overnight temperatures in the twenties to lower thirties Mm some sun on Thursday morning in southern parts of the state clause bringing to the north high staying in the thirties and forties\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security to compliance\nMore information at build on dot AWOL\nFrom it last in the collaboration software company towering teams around the world\nAnd committed to providing the tools and practices to help teams plan track building work better together\nMore at Lausanne dot com\nAnd from Lyndon mood bell learning process is\nCommitted to helping all students learn to their potential\nThey're learning centers and on line private school offer instruction and reading comprehension\nLyndon ... bell dot com slash NPR [noise]\n[noise] It's MORNING EDITION from NPR News I'm Noel King and I'm Steve Inskeep good morning when the Nobel Committee said that ... there was one of the recipients of this year's peace prize they cited her courage\nRefused to accept the social colors that requires\nOn the shades of abuses to which they had been subject to the\nFour years ago as ... fighters enslaved thousands of women and girls in Iraq many were repeatedly raped and sexually abused in other words\nNot humor odd was one of those women she was only Twenty one years old at the time and from a tiny but ancient religious minority groups they use ET\nYazidi people into their money and\nThey just on a simple life they they can they can leave we any group in Iraq in even here but they are they're very ... these people in the ... yeah they just want\nTo live in in peace and fixing\nTo feel safe I talked to an audience brought in NPR's Washington studios earlier this week it was her first full interview since she won the Nobel Peace prize with the help of an interpreter she spoke mostly in ... which is her native language about what she now hopes to achieve\nUm diminishing vision we had set it over and over that it's important for us the justice is done out of the six thousand years ET women who were abducted by ISIS we hope to see at least one ISIS number who did this\nTo one me as a woman to be punished for the crimes they committed against gives me the women have and we hope to see them in court in public\nI think it is easy to see winning the Nobel Peace prize as a kind of combination or end of a person's career you've you've done what you said how to do\nIn your case it twenty four years old that is clearly not true you clearly feel like you have a lot less to do what is next for you after winning the prize\nAnd I'm twenty five twenty five ... and ...\nAfter I delivered our message and we have as a community delivered our message that how we would like to see the reconstruction of our homeland incident jar take place and to provide security for ... said that they can go back\nAnd we would like to see this never happen again not to any other community or any other religion or any other group are you angry\nUs in the guide them ... ... I Can't just simply saying I'm angry cheap because that word only will not describe how much we have suffered but what I can say is that we are right we have the right to speak about this we have the right to deliver a message\nIf anger doesn't quite capture it what is the word what do you feel every day\nOr what chemicals to show them that you know like I said what makes us feel good at least is that we are delivering a peaceful message we are not delivering a message to hurt anyone when I meet with students and presidents and anyone I speak about what happened to us and I deliver my message with a clear conscience\nThat I advocate for people\nDuring our half hour interview not humor odd seemed at times pretty shattered but also strong she says that strength comes from her UCD identity she calls the rape of using the women and the murder of UCD men including many people in her own family a genocide\nShe wants these atrocities to be classified as war crimes but even after winning the Nobel Peace prize she's not sure if that's going to happen and she sometimes find yourself frustrated ...\nSometimes I feel that my message has not been clearly heard what that is not my fault because I feel like too much is going on in terms of woman ... victims and it's not the first time and certainly it's not the last time\nAnd perhaps every year a woman someplace in the world or groups of woman or the house\nOr terrorist groups and so I feel like this is not new to people and it's not going to be the last time and people have become numb to this kind of news\nI'm your mother\nYour mother was killed by the Islamic state and I wonder when you think about her now\nWhat do you think she would think about everything that you've done what do you think she would think about you having won a Nobel Peace prize being the voice of the ... community to the rest of the world how do you think your mom would feel\nIn some of the ...\nWhen I received this news it was around probably five\nAM in the morning us and the first thing I did was look at her picture and cry but because they felt that he needed her her ... and not just her but the eighty women the ... are women that were with her\nAnd they were all executed for no reason just for being a CD and for being older women I feel like they will be proud\nProud\nYou are twenty five years old you've just gotten engaged congratulations in your life is not what you thought it was going to be just a couple of years ago what kind of life do you want for yourself now\nWork ahead a modern huh yes we have gotten engaged but it's still difficult for me to deal with all of that so much as much as they try to come close to finding a simple life nicer things come up and then we have to deal with them and they'll continue this work\nBut I Hope that I can but I Want to learn English I work on my English in school and I want to create a family with my fiance and being able to live the simple life and just be safe\nI Hope you get exactly what you want\nIt was really a pleasure speaking to him right thank you so much [noise]\n\nThank you for listening to us on your local member station you can keep the conversation going with us on social media I'm Noel King you can reach me on Twitter at Noel King Rachel Martin is at Rachel NPR David Greene is at NPR green and Steve Inskeep is at nprinskeep\nTo find out more about the people who put this show together every day go to our website NPR dot org slash MORNING EDITION and click on the staff taps to read about are amazing crew of editors and producers [noise]\n\n\n\nThis is NPR News a gift and HBO ... day plan is a wonderful legacy to leave for those who need a trusted source for news\nHi I'm Sarah Alger director of major and planned gifts for an HBO\nAs an HBO ... inspired you to learn more about your stage and your world so to wear your legacy gift inspired future generations email me at S. Alger at an age B. R. dot org and to learn more about including an HBO or in your state plants or go to an H. B. R. dot gift plans dot org\nThe news is next support for an age PR comes from you our listeners in Barron's major brands appliances credit employee training in order to help customers find the right appliances and mattresses to accommodate their lifestyle barons major brands dot com\nEarly but he was very popular and gets to county and and\nI Would have loved to have more early voting locations it came down to having more locations you know helping more voters versus are this year he responsibilities to the county\nSome democratic lawmakers see this as another attack on voting rights in a state where a voter id redistricting and early voting rules have all been struck down by the courts at various points in the last few years\nDuring a Jew and debate about early voting democratic state representative Amos Quick said the requirement that if one side is open on the weekend the rats also have to be could discourage counties from having any weekend hours\nWeekend early voting as them refer and has been referred by a certain population and certain populations who's right to vote as not only in it but it's been rejected in recent court decision\nHe's referring to black voters and appeals court ruled a twenty Thirteen law that among other things cut early voting by a week targeted African Americans with quote surgical precision but Republicans who champion this law argue they're only trying to minimize confusion here state representative David Lewis also during the Jim debate\nWhat we set out with the tuition to do is to be able to make it more reliable and dependable voters would know that the early voting site or side in the county was open from ... I'm In the morning to sit on the evening\nThe law has some bipartisan opposition run riot is the Republican Party chair of the ... county about fifty miles north of Charlotte the county has had to cut its early voting sites in half frustrated just a word we would use and he says even though this may not seem like an unfunded mandate\nThat's exactly what it translates to being at the end of the day\n... counties with smaller election budgets like ... are disproportionately affected by this change well individual locations maybe open longer they released Seventeen percent fewer sites that selection MIT political side\nFor voters convenience Trump's hours\nAnd there's a lot of research that's been done that suggests that whenever you move a polling place further away from a voter there are less likely to vote there\nStewart says the rule change could simply shift turn out to election day which could mean longer lines at the polls in a state where voting rights has become such a political hot potato elections officials say they just go with the flow Becky ... at the elections director in ... county due to\nCourt cases legislation all of that kind of thing factors and and it just seems like we always had some ... ... and that\nTakes us in a different direction the question remains will voters adapt as easily\nFor NPR News I'm Alex ... [noise]\nIt's NPR news\nAnd it's an H. B. O. Joshua Johnson host of NPR show one egg is coming to New Hampshire we broadcasting his show nationally from an HP are tomorrow and product coming up we'll talk with him about what he has planned as he heads for the Granite State and getting out of Washington DC affects\nA show that conversation in about ten minutes here on MORNING EDITION from an HBO [noise]\nFlorida has some of the toughest building cars in the country but certain areas are exempt from rules to protect them against storms like hurricane Michael\nThe garage door shake somebody's trying to get in and the inside door was shaking I knew the ... at that point because everything was shaking I thought just hang in there and Hi faith everything was going to be OK\nStrengthening building codes after hurricane Michael this afternoon on all things considered from NPR News [noise]\nAll things considered between four and six this afternoon on an age PR\nSupport for the Hampshire Public radio comes from you our listeners infirm tele BMW Nashua between the full lineup of all new BMW performance plug in hybrids Kelly's BMW hybrid inventory is available online a tele BMW Nashua dot com [noise]\nEngineer Hampshire businesses for social responsibility hosting the sustainability swam Thursday November first labelle winery an evening of sustainability story telling and H. B. S. our daughter\nWas [noise]\n\nYou can listen to the radio on your schedule with an age beers podcasts checkout civics want a one refresher course and how our democracy works you can also check out outside in an exploration of the natural world and how we use it but a complete list of our news and information podcasts at an H. P. R. dot org [noise]\nPartly sunny for something new Hampshire today most cloudy to the north was raining snow showers their eyes and the lower forties and fifties today\nMaybe seven forty five good morning [noise]\n\nSupport\nFor NPR comes from this station from Charles Schwab who believes the modern approach to wealth management starts with asking questions and providing straightforward answer Charles Schwab own your tomorrow learned more at Schwab dot com [noise]\nFrom Amazon Prime video with the ... a new series from the creator of Mad Men starring John Slattery Amanda Pete polarizing Catherine ...\nA new episode every Friday on prime video and from that\nStation\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King there are reports of a surge of new Ebola infections and the Democratic Republic of Congo\nToday and emergency committee of the world Health Organization is meeting to advise on what the outbreak should be declared a public health emergency of international concern and ... and man has\nThe story the w._b. Cho has only sounded the alarm this way for times most recently in twenty sixteen when's eco erupted in Latin America and before that in response to the twenty fourteen twenty Fifteen Ebola outbreak in West Africa that infected more than twenty eight thousand people\nThis outbreak and the DR see has been much smaller about a hundred and eighty confirmed cases so far but it's centered in a particularly challenging area\nProven that cars are more than Twenty years of conflict\nPeter salon I as a top official with the W. H. O.\nOne million a million residents internally but early on the losing your potted democratic Republican ...\nAn armed rebel group called the allied democratic forces has been launching attacks on government forces UN peacekeeping troops and also civilians now so on and says despite that when Ebola first surfaced in early August\nWe're quite confident we would get on top of the up and\nThe government W. H. O. and partner organizations launched a major effort to treat infected people and administer and experimental vaccine to anyone who had had contact with them the strategy started to show success\nAnd then what happened in September is an editor a major ...\nViolent attacks by the rebels including one in a city called Benny where they killed more than twenty people mostly civilians\nThe population of interested enough is enough\nPeople who for years have felt completely abandoned by the government and the international community started turning against the health workers who were seen as an arm of the government people would say\nLook you can't even go to a physical security\nWhy should we go along with this unfamiliar anti Ebola campaign you're pushing\nNail salon stresses that the vast majority of people are still cooperating but rumors that started the vaccination campaign is actually a plot to spread the disease members at a safe burial teams were attacked with rocks and severely injured and often after rebel attack whole neighborhoods shut down in protest\nWindow to live in the streets of barricaded or young people sometimes droning ties are objects and sometimes for the ... other with them\nIn the last week and a half the effects of this have started to become clear with not just a rise in the number of new cases each week but ever more cases who contracted Ebola from someone the W. H. O. had not previously known about\nThat's the situation that the emergency committee that's meeting today has been asked to assess David Hayman is an infectious disease expert and an advisor to the W. H. show\nSome fielded by calling the public health emergency crews political importance of the event will possibly increase the mobilization of from\nThe deli they chose asked for thirty three million dollars to help neighboring countries prepare for the possibility of a spread across their borders and declaring this kind of emergency could also have a wider affect\nIt may also help and increasing the security in the area\nBy convincing the UN or other groups to bolster peacekeeping efforts but Hayman says there's also a danger here\nThere are others who feel that may be such a declaration would embolden the rebel forces\nThey'll figure ending this Ebola crisis is clearly important to the D. R. C.\nAnd the rebels don't want the government to succeed and revise and then NPR News\nKnow point one W. E. V. S. Nashua eighty eight point three W. E. H. Hannah weren't Ninety One point three W E the end keen Ninety point seven\nWABC ... one of those seven point one\nW E v J injunction Ninety nine point five WBFO Holbrooke mighty point three and W. E. B. Q. little ten Ninety One point nine an on line at an H. P. R. dot org\nGood morning moments President Trump's so eager to defend Saudi Arabia president backs up a vital ally suspected of ordering the murder of a U.S resident It's MORNING EDITION from an HBO [noise]\nI'm Rick ... Stevens president compare the Saudi crown prince to Supreme Court justice Brett Kavanaugh he complains and both men were found quote guilty until proven innocent Republicans ... near may not be quite as tough which you know voters are largely presumed hostile to President Trump put some back Florida's Republican Rick Scott [noise]\nAlso this hour with less than three weeks till election day for speaking with each group of turtles candidate about health care issues here in New Hampshire today we'll speak with libertarian till other drivers and health officials trek a mystery homeless and children in some parts of the country\nLater we raised giant pumpkins on the ... river\nAs one does It's Wednesday October Seventy [noise]\nThe news is next\nLive from NPR News in Washington on corporate Coleman secretary of state Mike Pompeo is an uncle or a turkey for discussions about the case of missing Saudi Arabian journalist ... ... Turkish officials have suggested he was killed inside as Saudi consulate in Istanbul and his body removed\nThe Saudi Government is vehemently denied that secretary Pompeo traveled to Saudi Arabia to speak with the Saudi king and crown prince and NPR's Michel ... says reporters question ... about that conversation\nWe asked him directly to the Saudis tell you that they killed ... and he said he didn't want to discuss the facts and the case and he didn't and he said the Saudis didn't either he said that was reasonable to give them time to investigate any also a cold district incredibly successful\nBecause he said they agreed to fully investigate this um which by the way something they've said before and\nOf course you know early on they said that ... left\nConsulate and their story seems to seems to be changing but we didn't really hear I'm a I'm a away in on any of that\nNPR's Michel ... traveling with the secretary in Ankara turkey\nLeaders in the European Union are gathering in Brussels for what it's supposed to be the deadline for a deal to ease the United kingdom out of the block by next march NPR psoriasis Saudi Nelson reports from the Belgian capital no deal appears to be forthcoming\n... a lot still needs to happen even if the leaders were to agree on a breakfast strategy during the summit here experts have to hammer out details of the continental sized divorce and the twenty eight you parliament's must ratify the deal\nBut president Donald Tusk says negotiations are once again stalled over the same snag us before what to do about the border between Ireland\nWhich is a member state and Northern Ireland which is in the u._k.\nThis looks like a ... of the gold yellow and fulfill that guy come to you and your version of because those are raised the call\nAnd British prime minister Theresa May to deliver new facts that could break the log jam psoriasis are heading out with an NPR News Brussels\nWall Street opens in about an hour and a half after closing the day sharply higher on Tuesday the federal government released news showing the labor market is in good shape with a lot of job openings and big companies release\nJust this week NPR's Scott Horsley says President Trump is complaining about rising interest rates even as the stock market zooms up\nThe Federal Reserve has been slowly but steadily increasing interest rates and that boost costs for all kinds of debtors including the federal government itself the federal deficit balloon by Seventeen percent and the fiscal year that just ended and the government's expected to borrow more than a trillion dollars in the upcoming year\nNPR's Scott Horsley this is NPR\n... within age PR news it it'll for Lebanon residents will rally ahead of their city council meeting tonight as an age peers breed Greene tells us they're finding a plan by liberty utilities to build a new natural gas infrastructure in the area\nThe steep public utilities commission approved liberties plant earlier this year but with restrictions that includes that that company not ratepayers to be on the hook at the project doesn't meet its budget\nThat let some speculate that the utility would walk away that liberty says they're still living forward a group of local residents including ... percent at the kitchen with over a thousand signatures to city counselors urging them to help stop the project\n[noise] [noise] [noise]\nThat's what the reality of climate change we need to move away from fossil fuels ... greens\nYou and ages ... to the completion of a two year project to build an awkward political research facility in ... and H bureaus Robert grew up as more on that\nThe three aqua Ponting greenhouses will allow researchers to grow crops like lettuce from nutrient rich waste water that comes from fish farming I cut UNH agricultural engineering professor Todd ... outside of hardware store where he was buying PVC pipe to put the finishing touches on one of the water systems he says there are occupying farmers in New Hampshire\nBut not many people have been able to really make a successful go at it because the business models are based off of a single designed essentially that's not really scalable\nGr dot says he and his team of student researchers will test new methods that could be more attractive to industry they think they'll produce one thousand heads of lettuce a week and one hundred pounds a fish a month as for how the farm fish tastes good out says one local restaurant or a called the rainbow trout fantastic for H. P. R. News I'm Robert grove at\nNoon sports the red Sox have a two games to one lead now and the American league championship series with the Astros after the age to win last night Jackie barely junior hit a grand slam capping a five run burst in the eighth inning from Boston game for is tonight in Houston\nJason Tatum at twenty three points and nine rebounds says the Boston Celtics outlast the Philadelphia Seventy Sixers one of five to eighty seven and their season opener last night\nThe forecast today partly sunny for southern counties but clouds with some rain and snow showers to the north and there's a possibility of an inch or two or snow of snow in the higher elevations of the White Mountains later this afternoon it tonight\nEyes in the north country in the forties today fifty so it's not the clouds link or over the north with some snow showers it'll clear out south of the mountains returning windy once again and cold overnight lows in the twenties lower thirties a blustery Thursday with some clouds in snow showers north son to the south I staying in the thirties to the mid forties tomorrow\nSupport for H. P. R. comes from you our listeners and whiskey and wine internationally inspired tap his unwind now open for pm to ten pm Monday through Saturday additional menu cocktail and beer selections one\nForty eight more mainstream conquered\nHampshire women's foundation fourteenth annual women building community lunch in October twenty third to Manchester special guest Tiffany do for an age women's foundation dot org [noise]\nSupport for NPR comes from NPR's Beijing other contributors includes this got insurance providing customize insurance for small and medium businesses so they\nCan do more and be more to learn more at age ... CEO X. dot com or from an agent this got insurance encouraged\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Noel King\nSecretary of state Mike Pompeo traveled to turkey today right after a visit to Saudi Arabia on pay was sent by the Trump Administration to try and find out what happened to Saudi journalist Jamal ... the writer disappeared after entering Saudi Arabia us consulate in Istanbul\nBecause you have been critical of the Saudi Government and many people believe he was killed by Saudi agents but the Saudis so far are denying any knowledge and President Trump so far seems to be taking them at their word\nNPR's Peter Kenyon is with us now from assemble Hi Peter\nI Know so secretary of state Pompeo was on something a fact finding mission here out what did he learn were not learn in these meetings in Riyadh and in Turkey\nWell if you learn anything new from the Saudis there's been no public discussion of that so far and he did say Riyadh is committed to a full transparent investigation\nOf the Saudis as you note deny any involvement in ... disappearance or their stated position is still that he left the consulate freely within an hour of arriving and they don't know where he is a there are however these multiple media accounts reporting the Saudis were preparing to acknowledge ... died in the consulate during questioning\nNow in Turkey bump bio certainly got a very different story a Turkish investigators have said they have audio video evidence of the show just killing\nAnd dismembered meant at some more gruesome details are coming out today um after the meeting today Turkey's foreign minister uh wouldn't comment on those media reports uh but he said a full investigation will be conducted\nWell we know that Turkish authorities are looking hard I mean they've searched the consulate where 'cause she'll disappear two weeks ago and now we're hearing that those same authorities are waiting for approval to search the Saudi console residents are what are they hoping to find\nWell police barricades did go up around the consul general's residence last night journalists were waiting outside but the investigators didn't show up at Turkey's foreign minister says today they were waiting for final mission\nThey're expecting to search to happen today or this or to the consulate building Monday did healed evidence that to show was killed inside the building at least that's what an official tells the Associated Press a president ... says the investigators are looking for traces of toxic materials\n\n\nA gift and each PR theory they plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of major and plan gifts for an HBO at any age PR inspired you to learn more about your state and your world so to wear your legacy gift inspired future generations email me\nAt ... at an H.\nB. R. dot org and to learn more about including an H. B. R. and your estate plans or go to an H. B. R. dot gift plans dot org [noise]\nSon in southern Amsterdam partly sunny overall but most of the cloud north some rain and snow showers could develop their eyes and the lower forties north and fifties over the rest of the state pretty windy and cold for all of us tonight it'll be in the twenties to lower thirties [noise]\nThursday clouds and again is no shower from North country son for the south but ... thirties to mid forties will be blustery day tomorrow [noise]\nSupport for NPR comes from this station and from T Rowe price offering a strategic investing approached that examines investment opportunities firsthand\nInstitutions advisors employers and individuals choose T Rowe price\nT Rowe price invest with confidence [noise]\nDedicated to bringing the traveler closer to the destination like river and by the offering a small ship experience with the shore excursions included in every court\nLearn more at Viking Cruises dot com\nAnd from Amazon Prime video with the Romanoff a new series from the creator of Mad Men\nJohn Slattery landed Pete polarize are encountering hunt\nA new episode every Friday on prime video [noise]\nThis is MORNING EDITION from an H. P. R. or less than three weeks from election day and this week on MORNING edition we're speaking with each gubernatorial candidate about health care issues here in the Granite State today my conversation with libertarian Gillette ... Jarvis\nFirst start with the opioid crisis you said you'd like to focus on improving post care for people who are leaving treatment and re entering the workforce so\nWe need to provide them support which includes things like job training getting into a new job wasn't that wasn't exactly what they were doing before so I'm not going right back to the same situation helping them find a new place to live so they're not putting themselves back into the environment that they were in prior to becoming clean\nAnd these are these are part of new addiction treatment models that are being used nationally and in some of that has been talked about regionally New Hampshire but what specifically is not being done that you want to see done that would help with that post care\nWell I think also that legalizing cannabis would I says because of those places that have legalized have seen a drop in their opioid addiction rates and\nSupport for an HP ours live stream comes from you our listeners and from conquered regional visiting nurse association\nA home health in hospice agency serving people of all ages and more than forty one communities discover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nVisit C. R. V. N. A. dot org\nFund and the general fund has a tendency to\nKind of have that money just get lost so that concerns me all in itself if we're going to have money set aside for certain projects such as addiction treatment I think they need to be in a separate fund fund as dedicated just to its we always know how much money is in there how much money is available and how much money is going out\nThings get into the general further or specific rules about this might have been spent it how it has to respond kind of ... there are rules unfortunately not\nAlways are they completely adhered to argue opposed federal funding it all for addiction treatment\nI feared federal funds because they typically come with strings attached we'll give you this money as long as you do this with that money that doesn't come with strings attached this is our taxpayer money that we have spent we have sent over to the federal government in the form of income taxes\nGetting some of that back I don't have a problem with as long as they don't tell us how we have to spend it or I Would rather have that if it's earmarked for treatment it has to go to treatment and not no strings on how how we treat it it can't be earmark saying this is for treatment but it must be used for\nA Ninety percent of it must go to incarceration of a decade\nRecorded I don't know not entered right now for this particular money coming in for I Know that you know\nUm what about the workforce who she ribs running healthcare in general and mental health specifically what about high turnover rates we over the state and it was difficult for people to get access to the already existing services that we have here in New Hampshire because you know there's just not enough professionals immigrants do to to treat people well\nOne of our problems is that if you are a license provider in Massachusetts and you want to come and you want to work in New Hampshire\nYou have to make sure that you have a New Hampshire license to work but there's no difference between how you're going to treat people in Massachusetts and how you're going to treat people in New Hampshire I think we would welcome more people into the state by eliminating that knee as long as their license in this country\nThere's already standards on how they treat patients here in this country so as long as they're licensed here we should eliminate that re licensing neat that would allow people to really come here without having to pay to do their job in another state so it would open a door\nWould you support and to re Medicaid expansion of Mr [noise]\nThat's a difficult one for me um [noise]\nI Would like to change the way our welfare program is working currently I think that we when we were giving welfare to people we are we punish them when they start working again we punish them when they are\nFinally starting to become self sufficient instead of\nRamping down the payments we just cut them off so if you for example when I was working as an adjunct professor at the community college there was a student there who was on Medicaid and our son was on Medicaid and she had finally gotten a promotion at her part time work at\nA retail place to be a manager that gave her consistent hours across the board so that she could more easily get care for her son and she got a twenty five cents per hour raise which made her lose her Medicaid options\nWe want to look at who graduated from\nAnd then we promote people to get them back to work so that they can be self sustaining because that should be the goal of a program like that if we're going to offer a program that helps you while you are unable to help yourself the goal is to get you to the point where you can help yourself again\nSo you're not opposed to Medicaid expansion of principle but you'd like to alter the system itself I'd like to alter the system itself would you support a paid family and medical leave initiative\nThat paid family medical leave initiative that was introduced I Do not support I think that it would hurt smaller businesses from the ones that I spoke to they said that they would end up laying off employees and just doing more work themselves instead of providing additional support\nCould you be in favor of a paid for them to build that was altered in some fashion that did not affect smaller businesses\nMost large businesses already offer it so the people who this'll be focused that\nAre those who already offer and in the five states that have already tried to initiate this program\nNone of them even Washington state which was the first one to initiate it and they have a mandatory you must be part of it you must pay into the system they still haven't been able to financially make it work it's not self sustaining\nUntil a program that can be offered can prove that it can sustain itself I don't think I could support it\nThat was libertarian candidate for governor in Gillette of Jarvis on healthcare in New Hampshire you can listen to all things considered this afternoon here on New Hampshire public radio to hear her thoughts on economic policy\nTomorrow we'll be speaking of the Republican Governor Christie of new and on friday ... It's MORNING EDITION from an agency on the news is actually [noise]\n\n[noise] a record number of Native American candidates are running for office they could have an outsized influence on the mid term still both major parties are giving these communities cause for concern\nWhether it's Senator Elizabeth Warren ... DNA test or new rules making it harder for many Native Americans for tax vowing that\nOne day this morning at ten on HBO\nSupport for New Hampshire public radio comes from you our listeners in St Joseph hospital Nashua a member of covered health specializing in breast health inexperienced in partnering with women on their health needs are more your best to you and H. dot org\nSheila total control and both his arms and legs you know one minute you have a healthy head and the next minute your kid is totally paralyzed it it it was beyond horrifying to us\nIt's not clear what caused the Evan sickness and the CDC's Nancy mess on ... says unfortunately the cause of this condition is still unknown\nI'm frustrated that despite all of our effort we haven't been able to identify the cause of this mystery illness we don't know who may be at higher risk for developing them or the reasons why they may be at higher risk\nNothing ... says given the rise in cases the CDC is escalating its response and consulting with a variety of experts to solve the mystery they do know that some kids who get it have also had viruses such as entering virus another possible risk factor is West Nile virus\nWhich so far there's no common pathogen that links all the cases\nDespite extensive laboratory testing we have not determined what pathogen or immune response the arm or like weakness in paralysis and most of these patients\nGiven that the symptoms are similar to polio a disease that have been almost completely eradicate it nothing you pointed out that this does not polio\nRight now we know that polio virus is not the cause of these ads on cases CDC is tested every thought specimen from math and patients none of the settlements have tested positive for polio virus\nThe CDC says despite the increase in cases a FM is a very rare condition affecting fewer than one and a million children but she says it's good to be aware of the signs and symptoms the Ninety percent of those affected our children there are some cases and adults\nWe recommend seeking medical care right away if you or your child develops sudden weakness of the arms and legs\nAnd those are the CDC can't give any specific information about what's causing a FM ... says it's good to take general precautions\nParents can help protect their children from serious diseases following prevention steps like washing their hands thing up to date on recommended immunizations and using insect repellent to prevent mosquito bites\nIn the case of Susan coin son Evan he's healthy again he was treated with steroids and he was an occupational and physical therapy for Eighteen months\nIs fully recovered he has regained all movement and strength in all foreign land\nBut this is not always the case some kids who've been diagnosed with a FM continue to have paralysis and require ongoing care\nAllison Aubrey NPR News [noise]\n[noise]\n[noise]\n[noise] this is NPR News\nAnd this is an HP are coming up next radio field trip today we're heading to gossip town to meet some people who are racing giant thousand pound pumpkins up the ... river [noise] why not listen to the pumpkin regatta next on HBO\n[noise]\nA libertarian candidate for governor Gillette uh Jarvis says to promote wage growth in New Hampshire the state needs to provide tax incentives for high tech jobs because those are the ones that pay more and a tax break for film industry\nJob Jarvis also says legalizing hemp would strengthen the state's economy a conversation with Gillette of Jarvis about the economy had November's midterm that's today on all things considered from four to six months in each PR\nSupport for an HBO ... comes from you our listeners sending a Hampshire union leader is forty under forty program by dark message got\nTwo thousand Ninety nominations being accepted a union leader dot com slash pointing\nNortheast credit union offering financial products and services for members and since Nineteen thirty six information on joining it and ECU subtle [noise]\n\nYards popular current affairs program one day is coming to New Hampshire tomorrow and products join host Joshua Johnson at the Capitol Center for the arts in Concord tomorrow night with the moderator special panel guests tickets now at C. C. A. N. H. dot com [noise]\nPartly sunny over southern counties today but more close to the north could be your rain or snow shower their eyes in the lower forties and fifties [noise]\nReports for NPR comes from the station\nAnd from the levels and foundation\nCommitted to improving lives to invention us in developing countries\nAnd working to inspire and enabled the next generation of inventors\nMore information is available at ... dot or\nFrom the John Dean Catherine team MacArthur Foundation recognizing exceptionally creative individual\nThis year's MacArthur fellows and more information or it's not\nAnd from a listener support this NPR station [noise]\nThis is MORNING EDITION on an age PR a Rick gambling for this week's radio field trip we went to see a boat race speech ring false favorite squash the pumpkin [noise]\nIt's a gorgeous Sunday afternoon in God's time skies bright blue yellow orange and red leaves cover the ground and to fall heir just Crispin up\nDowntown is completely packed there's huge crowds of family and friends visiting them any vendors local businesses lined up along main street\nThere's been a donut eating contest even something called apple slinging but everyone's waiting around for the main event or a got a race with boats made out of giant pumpkins I don't think a lot of people are realizing that you probably wouldn't unless your ground them yourself pumpkin slow\nOr yeah they are they float a float Jim ... is a long time ... town residents\nAnd a giant pumpkin grower himself\nThere Ninety five percent air then so you can't sing a lot of these things and they're like a big fishing barber and they float on the water and pretty cool\nJim came up with the idea for the annual ... town pumpkin weigh often regatta Eighteen years ago when he pitched the idea to the town's main street program\nWere looking to create an event to make gosh down a destination and what better thing than these giant pumpkins and and putting them in a river racing um you don't see that everywhere and uh and", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Keene", "day": "17"}