{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. V. S. ... eighty eight point three\nW E VH Hanover Ninety One point three\nW ... Ninety point seven\nWABC Gore him one o seven point one\nW E v J Jackson Ninety nine point five W. E. V. S. Holbrooke Ninety point three\nA W E v cute little to in Ninety One point nine and online and H. P. R. dot org\n...\nGood morning the FBI is done with it supplemental background check on Brett Kavanaugh senators are reading it in shifts inside of your room in the capital of the morning It's MORNING EDITION from NPR News\nThe White House says it still full fully confident in the Senate will vote to confirm Kavanaugh to the Supreme Court in the first vote on the nominee's set for tomorrow I'm Rachel Martin\nAnd I'm David Greene in the midst of a trade war we'll talk with China's ambassador to Washington says the U.S seems to be struggling to decide what you want to seek a love story radio documentary brings us in the lives of children born with normally small hit them and [noise] it is\nOver for the actress Susan Sarandon turned Seventy two years old\nAnd the news is next\nLive from NPR News in Washington I'm neuron an FBI report on sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh is to be available to senators today in a secure room on Capitol Hill said majority leader Mitch McConnell says senators and some staffers will have access\nTo those will have the opportunity to review investigators records at as a standard procedure desert motives reduce your staff members with a require ...\nWill be all of the ... member\nMcConnell has scheduled a procedural vote on the nomination tomorrow if that passes a final vote as possible this weekend\nAnd Florence South Carolina seven law enforcement officers have been shot and one killed while trying to serve a warrant South Carolina Public Radio's Victoria Hansen reports authorities say a suspect barricaded himself inside a home\nSay the way the suspect was positioned he had an advantage shots were being fired everywhere three of the officers were removed with a bullet resistant vehicle as a suspect continued to open fire will need for more police officers\nAuthorities say the standoff lasted two hours some of the injured officers are in serious condition that children have been taken to safety the suspect is in custody the shootings happened in an upscale neighborhood police have not said why they were surveyed the warrant for NPR News I'm Victoria Hansen\nThe problem of disinformation on social media networks like Twitter remains a major threat ahead of the mid term elections next month NPR's Tim Mak reports a new study casts doubt about whether effort to stem disinformation campaigns on Twitter is really working\nResearchers at the Knight Foundation found that more than ... percent of the Twitter accounts to spread disinformation during the twenty sixteen presidential campaign remain active now the results of this new study raises questions about whether Twitter has effectively been able to crack down on accounts that spreads false information\nThe authors found that disinformation networks continue to pump out more than a million tweets today much of them through automated or semi automated accounts\nTwitter set in July that it was purging suspicious accounts as part of its efforts to build trust the company has also highlighted how many more accounts it is removed this year as opposed to last year Tim Mak NPR News Washington\nBritain cybersecurity center is accusing Russia's military intelligence unit of being behind a wave of global cyber attacks\nIn a report released today Britain's that Russian hackers have targeted political institutions businesses media and sports foreign secretary Jeremy Hunter says the attacks are reckless an indiscriminate that they're designed to interfered elections around the world and to undermine international security\nAnd this is NPR News from Washington\nThe occupational health and Safety Administration has find superior refining company more than eighty three thousand dollars for a worker safety violations as Wisconsin Public Radio's Daniel ... reports the violation stem from an explosion earlier this year that injured thirty six people ocean\nFound the company which is owned and operated by husky energy failed to inspect and test equipment to make sure it was fit for service the agency said those measures could've prevented the explosion that constant evacuation for much of the city of superior in April ginger jewel with the activist group twin ports action alliance says the ... is a slap on the wrist\nThis wasn't the first time this company the superior refining company has been cited for some of the serious issues file shot on so how does he really wants to be a good neighbor to our community they'll make a commitment that they will not continue operations like this\nA husky energy's spokesman says in a statement that the company has continuously improving safety programs for NPR News I'm Daniel painting in superior Wisconsin\nA Canadian company will not be allowed to open a robot brothel in Houston a place where people could rent adult love dolls mayor Sylvester Turner says he's spoken with his constituents throughout the city and they are not interested\nRegardless of where it was\nFrom ...\nTo ... with\nWhat you're going what's going to happen with those role but Andre\nTurner says he wants businesses to come to Houston but there are some ... which he says you know it's fine if you go someplace else I'm door rom NPR News in Washington\nFor NPR comes from Heather ... and Paul ... supporting African wildlife foundation working to ensure\nWild lands learn more at a W. S. dot org and Americans for the arts and Americans for the arts dot org\n[noise]\nGood morning it's five or six and this is an H. P. R. Jessica hunt\nFor gambling sorting we hear how the controversy over the Kavanaugh Supreme Court nomination has become a part of the gubernatorial race here in New Hampshire at the head on MORNING edition and have your public radio is conducting a test of its emergency alert system equipment\n[noise]\n[noise]\n\n[noise]\n\nIn the forecast for today will have something clouds reached the low seventies and the south mid sixties in the north\nDon't put the umbrella wait just yet though we have some passing showers possible in the late afternoon and a bright unseasonably cool friday in store for us with ties in the upper fifties and sixties currently it's humid fifty eight in Portsmouth ticket and natural is well fifty and little ten fifty seven in Keene [noise]\nFive or seven and you're listening to MORNING EDITION on an HP our morning [noise]\n\nThis is MORNING EDITION from NPR News I'm David\nGreene and I'm Rachel Martin good morning congressional sources say it is finished results of the FBI supplemental background check into Supreme Court nominee Brett Kavanaugh will be delivered to the Senate today\nThat's right and Senate majority leader Mitch McConnell wants to keep this process moving forward has scheduled a vote of the full Senate on Kavanaugh's confirmation tomorrow\nThere'll be plenty of calling for members to review everybody brings on the supplemental materials before friday cloture vote\nSo I'm following cultural and George ... this evening so the process can move forward\nNow Senator McConnell was speaking late last night before he or any senators had read the FBI's findings the White House put out a statement\nSaying they are still confident that the Senate will vote to confirm President Trump's nominee now meanwhile of course public debate over this is becoming more divisive than ever more than a thousand law professors have signed a letter saying that the sexual assault allegations against Kavanaugh\nShould not necessarily ... preclude him from sitting on the high court but the partisanship he displayed at the hearing should and there's also a new pulling out about how the Kavanaugh debate is playing politically\nAlright so much they get to this morning we've got two of NPR's finest year NPR justice reporter Ryan Lucas\nNPR lead political editor Domenico Montanaro money to you both born in the morning All right Ryan I'm going to start with you and the FBI investigation itself this was never supposed to draw any conclusions rights but remind us what additional information the Senate panel wanted from this additional background check\nWhether it's kind of a tricky question because what one wanted kind of depends on whether you were a Republican or Democrat on this\nRepublicans wanted us to focus on Ford's allegations that's Christine a bomb was right or to um who came forward with allegations about sexual misconduct by a Brett Kavanaugh as well as a second allegation from Deborah Ramirez ... classmate of Kavanaugh's\nWho says that he exposed himself to hurt a party\nUm Democrats however however have increasingly talked about Kevin I was drinking as well since that might have bearing on his behavior at the time of these alleged incidents um but it's important to say that this was a this is a ...\nAnd each well women's foundation dot of work on the New Hampshire union leaders forty under forty program presented by Dartmouth Hitchcock\nTwo thousand Nineteen nominations being accepted that union leader dot com slash forty [noise]\nSupport an HP are today and you could win a triple the lifetime to land down under are lucky winner has the choice between Australia or New Zealand which means job to choose between kangaroos are ... the bright lights of the Sydney opera house or the stunning views of mouse cook national park [noise]\nSupport the news you trust today as an N. H. P. are sustainable and you'll be automatically entered to win make you're getting now at an H. P. R. dot org\nAnd then forecast for New Hampshire son clouds today reaching the low seventies and the south in the sixties in the north to some housing showers possible in the late afternoon [noise]\nSomeone around fifty brightened season will be ...\nI'd never fifties and sixties [noise] it's five Twenty one says and H. P. R. [noise]\nSupport for NPR comes from this station and from the Kennedy to fund supporting individual dignity and sustainable communities through investments and transformative leaders and ideas learn more at K. E. N. D. E. D. A. fund dot org\nFrom the Walton family foundation where opportunity takes root more information is available at war\nFrom the state of Joan be crock who's requests serves as an enduring investment in the future of public radio and seeks to help NPR producer programming that meets the highest standards of public service in journalism and cultural expression\nAnd from the William T grant foundation at WTC grand foundation dot org\n\nThis is MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin three years ago this week an epidemic swept across Brazil as a result thousands of babies were born with microcephaly or I'd\nNormally small heads among other impediments that come with that around the same time BBC producer William Kramer had a child of his own who was also born with microcephaly although not because of the guy\nCramer wanted to know how Brazil's so called ... babies were developing so we went down and produced a radio documentary called seek a love story among the people he met there where I Am on a ... so ... she's the head of a support group for parents called the United mothers of angels\nHe lost to him I don't know ... to get him the hottest whom I gave us two options either be a victim in don't do anything or become a protectionist in the lives of these kids\nI talked with William Kramer about his reporting earlier this week\nCan you introduce us to the women you met so you go to Brazil to try to follow up on the children who were born out of this week a crisis and you meet this network of mother\nYeah that's right I mean it was a it was quite remarkable because they they are overwhelmingly from very poor backgrounds uneducated many of them very young as well mothers so they did have a hard time I'm typing with what happened\nBut they certainly didn't come across as victims to me when I when I was a um they were very very big you know there were very tight group loss of solidarity very determined women some of them I'm wearing caged in you know political campaigning\nUm they certainly didn't take any known since from us so it was a ... a degree of skepticism towards the press because they feel like the press was involved in their lives and then kind of just forgot about them um they are pretty skeptical about doctors as well which is kind of common to special needs parents\nSo they were quite a strong set of women I mean obviously very different ... the leader of this group which is called the mothers of angels [noise]\nUh this is a group in punt on because states which is a sort of\nIt's just that one of the states which was worst affected by the ... the leader of that group is ... and she is you know really quite a powerful personality uh she doesn't mince words you know she's one of these people that just give you a look and you sort of just stopped talking\nA but also very charming and you know she's made a lot of friends with politicians sympathetic ... people have started to try and campaign for the women\nWhat is the health status of these children who were born with the guy I mean you write that in the beginning these mothers were getting a horrible prognosis that their children on may not even survive beyond a year or so I'm ... how are they doing\nWell that's right and so around ten percent of them have died most of those so that's about three hundred and twenty children most of us children probably died very soon off the bus\nOr a few of them are things that chest infections for three breathing food in when they were learning to wean but on the other hand there are children who are actually doing pretty well I mean this is actually this is one of the things that fascinated me the most is\nHave children so there was some children's you can walk to can stand there was some children who got what we can talk I'm Still may be a little bit behind the pay is it you know at the at that age\nBut then there are other children who you know they can't roll over on the fed through achieve into that told me that that much much more um you know disabled\nSome of the children who are more physically disabled or actually talking to the left side and some of the children who are more cognitively disabled cannot stand up and and walk around it's an incredibly mixed thing\nUp so much so that you actually tell the stories twins a girl who was born with a virus and her brother did not was matter of fact it\nYeah it was you had this for a job that will go ... she was cooled or she really couldn't move very much a tool she seemed very aware of what was going on around her but then she had her twin brother who was turned off him who he was acting just like you would expect it to an offer a boy to act\nJumping up and down and climbing on his mom and I know I Know this kind of thing um so they don't really understand they didn't know why it affected one twin and another ... ... ... it's it's quite possible that it was because of genetic differences between them so that they now know that\nSome people seem to have a sort of genetic defense against the cap\nYou write that Zeke affected families are at a turning point why is this an important moment in in their story\nWhat ice or is that the families had a really thinking about the social aspect to solve their lives are going to be like like [noise]\nWhat school are they going to go to ... and how would they be able to access the school um will moms be able to go back in and work again what they can about child care and and\nSo we're able to join um the the actual ... she went around ... some of the more deprived parts of northern Brazil and she was kind of giving talks to these women and giving the pep talks interest sort of saying you know you need to write to the magnates right to the health ... tree telling to give you a bus to tell your child to school you know just kind of thing\nAnd those are the kinds of social campaigning up the issues that they really start to deal with now [noise]\nI Wonder because you have this personal connection because your own daughter has microcephaly\nHow did you come back from is Chet how did it did it change your alter the way you think about her condition in any way\nThe children were very some some of the children ... the political you mentioned Melissa the twin she especially it was very similar to my gosh you reminded me so much with my little girl a year ago and holding her it was just like holding my little girl and\nHer mom was at that point where I was kind of Eighteen months ago when I was kind of despairing an Eighteen month Katie my daughter has done so much and I really wanted to say to ... she's got to worry she'll come you know\nBut you can't you know you just don't know where every child different uh ... I just felt like they were very like kind of just as almost you know [noise]\nThe piece is called V. got love stories it's on the BBC website and it\nWas written by William Kramer billion thank you so much for talking with I think you might slow [noise]\n\n\n\nThis is NPR News [noise]\nKnowing what's happening in the mid term elections before you vote in November is important but what about what's going to happen in December or January [noise] Hi I'm Lauren children\nYou give each month and the ... and you will an H. B. R. and NPR cover the entire election what happened for what's going on now and especially what's coming next [noise] be a part of what comes to become an N. E. T. R. standard today\nAny age PR dot org\n[noise]\nWould you encourage greater openness going the other way if Americans scholars who may have controversial opinions one to visit China if American journalists want to go to sensitive areas like Tibet would you encourage greater openness on China's part\nYou see well open to American students\nProfessors June it is a scholars of cause uh\nFor some of the cases that Tibet because it is very high or ought to do it and the uh the comments could be very tough that\nVery high altitude yeah I think American journalist and scholars could handle the altitude I mean we have filed to do it in the United states\nWell not everybody could quickly get used to sketch comment unnatural conditions even for Chinese men over them would not feel very well ... what\nAbout weaker areas and far northwest China\nWell at this is part of China so the whole country is open to the rest of the wood sets in this part is also open but honestly in this part of China with a particular problem\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl\nExperienced the beauty of autumn in New Hampshire from high up on the castle on ... what a trails or taking colorful views while dining on the terrorists open deli through October twenty first castle in the clouds dot org\nMay not be the true stars a single whatever we're doing in that part of China is for the wellbeing and soups and security of the people that are you putting people in camps to do that it's ... you see first of all we have to take measures to make sure that\nGroups a lot like officers will not be spreading into positron certainly will have to make sure that people have means to build a better life for them to learn more skills they have to learn techniques to develop themselves\nAnd also we have to ... loco stability people will\nBe listening carefully to your words um\nThey hear you saying that yes there are camps at a ... are you saying there or not\nI'm not going to come to a single ... efforts to help people to learn skills techniques to have a build up as a\nEconomic Kabila too and saw my best ... thank you for coming by him through\nSwitching ... Chinese ambassador to the U.S Steve also asked him about North Korea and China's global ambitions and we have a transcript at NPR Duterte this is NPR News\n[noise]\nGood morning it's five forty three this is an HP are ahead we'll find out why the two thousand Eighteen Nobel Prize in literature will not be awarded this year [noise]\n\nSupport for an H. P. R. comes from you our listeners [noise]\nI'm from ... states rent for an art center present in the music of Tom Waits with Vicki Christina Barcelona on October fifth information at Kean dot edu slash arts flashed Redfern and nor is helping him for businesses schools and organizations by designing and servicing engineered systems for security like safety and communications\nIn Fort north ... dot com and Mac's apples on mammoth wrote in London buried with farm stand and you pick orchard now open and picking Honeycrisp McCown and other prime varieties information at ... dot com [noise]\nSupport an HP are today and you could win a trip is a lifetime to a landowner under are lucky winner has the choice between Australia New Zealand which means you'll have to choose between kangaroos are ... the bright lights of the Sydney opera house or the stunning views of ... national park [noise]\nSupport the news you trust today as an an H ... n you'll be automatically entered to win make you're getting now at an age PR died or [noise]\nIn the forecast for today will have fun and clouds that should reach into the low seventies in the south and mid sixties in the north that humid currently temperatures around fifty eight degrees of passing\nShowers possible in late afternoon overnight in the fifties the bright unseasonably cool friday highs and the upper fifties and sixties and the long holiday weekend looks looks good [noise]\nIt's currently fifty eight and sailing it's if you ate in Manchester as well fifty seven in Lebanon fifty three in Berlin\nWon a often offer is one of the most dynamic national discussions on the radio today and its host Joshua Johnson is coming to New Hampshire what will certainly be a special evening stomach your chance to see him in person at the capitals and for the arts in cooking on October Eighteen get your tickets now at C. C. A. N. age\nFive you're listening to an age PR morning [noise]\n\nSupport for NPR comes from the station and from the Pew Charitable trusts marking Seventy years of non partisan research and data\nLearn more at ... dot org slash Seventy from the Ford Foundation working with visionaries on the front lines of social change worldwide to address inequality and all those forms learn more at Ford Foundation dot org\nAnd from the ... and James L night foundation helping NPR advanced journalistic excellence in the digital age [noise]\nIt's MORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin this week leading researchers in medicine physics and chemistry had been awarded the prestigious Nobel Prize and usually today we'd be telling you about the winner in literature\nExcept there isn't one not this year the academy is taking a year off after he was involved in a scandal involving sexual abuse but the husband of one of the academy members NPR's Andrew Limbong has more\nAn expos they published late last year by the Swedish newspaper ... and he had told the story of Eighteen women who said they were sexually harassed or assaulted by French arts promoter named ... or no\nHe's married to poet Catalina ... and is friends with horse and two members of the Swedish Academy which award the Nobel Prize in literature earlier this week or no was sentenced to two years in prison after being found guilty of raping a woman in two thousand eleven\n... new book nobody wanted to admit that they knew what she was up to\nAndrew Brown is a writer for the London newspaper the guardian and author of the book fishing in utopia Sweden and the future that disappeared\nHe's been following this story for awhile brown says on top of the sexual abuse there is a matter of a club called form which are no and his wife ... and ... and which also got some money from the academy\nSo that was an element to possible financial corruption because they were voting on subsidies to themselves\nOn top of that there were reports of Providence and leaking names of winners to our know allowing him to win some gambling money\nWhen all of this came to like ... and an angle refused to step down so three members of the academy left in protest and permanent secretary ... was not just out here she is talking to a press jaguar after she stepped\nDown must be it's already affected your vote ties to the late ... is the big problem\nBecause being a member of the Swedish Academy is a lifetime appointment you can't leave the most you can do is not participate the Swedish Cancun intervene it's kind of a mess of a situation that brown says music deserved black mark on the reputation of the Swedish Academy which declined to comment for this story\nI think it certainly damage was because of the academy and assuming question you know how well it will recover\nOutlook yeah there is a professor of English at George Mason university who's taught a class a Nobel Prize winning novels he thinks the academy might be better served with more international jury\nAnd us with things like the Supreme Court and so on there's problems with lifetime appointments in general\nAnd he points out that there are other literary award in fact one has\nSprung up to take the place of this year's apps and Nobel Prize in literature\nWe decided that the criteria would be the ... democratic\nAnd Palestine is an independent publisher and editor she's also the president of the jury for the new academy she says its members reached out to Swedish librarians to create a long list got reader input to prove that list down and\nTwo we'll get an award banquet the same types of thing a Nobel winner would get but not as much money once that's done the new academy will dissolve\n... or ... ... it is the Swedish Academy\nIs coping very well with this Nobel Prize\nFor his part journalist and author Andrew Brown thinks the Swedish royal court majors take the power to award the literature prize away from this current Swedish Academy\nOn the street or Chicago to me as shipped to a bunch of very highly paid ... inch Limbong NPR News [noise]\nW. E. D. S. Nashua eighty eight point three W. E. V. H. Hanover Ninety One point three\nW. E. B. young teen Ninety point seven\nW. E. V. C. Gore on one of seven point one\nIt'd be a BJ Jackson Ninety nine point five\nW abs of cobra Ninety point three and W. E. B. Q. little ten Ninety One point nine and online at an H. P. R. dot org\nGood morning as senators read through the results of the FBI investigation into Brett Kavanaugh this morning a new\nPoll says the fight confirmed the nominee is energizing Republicans ahead of the mid term elections It's MORNING EDITION from NPR\nPresident Trump says is a dangerous time for young men who could be accused of sexual misconduct this hour we'll hear from a Republican strategist about whether that's a winning message I'm Jessica hunt for ... about a year after the battle to force ISIS out of the Syrian city of Raqqa find out what the city looks like now\nAnd you've seen plenty of girls on the roads and New Hampshire ahead and each ... read a green finds out maybe you should be worrying about them in your house it's Thursday October for [noise]\nThe news is next\nMine from NPR News in Washington encore of a coalmine in a statement released in the middle of the night the White House said he'd received the FBI's report if its investigation of sexual assault allegations against Supreme Court nominee Brett Kavanaugh\nThe Senate Judiciary committee says it has gotten the report from the White House meanwhile Senate majority leader Mitch McConnell has scheduled a procedural vote known as cloture on Kavanaugh's nomination\nNPR's Emily Sullivan reports the vote is set for tomorrow\nBy checking off for procedural box McConnell has set up an important vote to take place on friday as the White House prepares to send the FBI's completed report on Kavanaugh to the Senate\nThere'll be plenty of town for members review and be briefed on the supplemental materials before fraud and cloture vote\nIf fifty one senators vote in favor of passing the culture the upper chamber will stop its debate on Kavanaugh's nomination moving it to the floor until then senators along with teams of ten staffers will take individual turns viewing just one physical copy of the report in a secure room\nEmily Sullivan NPR News Washington\nA shooting in Florence South Carolina has left one police officer dead and several others injured South Carolina Public Radio's Vince cold ... reports that a suspect is in custody\nPolice say the suspect exchanged gunfire with officers for two hours while holding children hostage before he was taken into custody\nNeighbors described hearing burst of gunshots dozens of police cruisers warm the neighborhood including an armored vehicle that was used to rescue three of the wounded officers by the time the shooting stopped seven officers have been shot one fatally as well as the twenty year old male who was in the home too though it's not clear who he is or why was their\nPolice have not released the name of the shooter or the condition of the other officers police identified the slain officer as parents care away a thirty year veteran of the force for NPR News I'm Vince cold blue go in Columbia\nOfficials in Indonesia say they will end search and rescue efforts tomorrow for survivors of last week's nominee an earthquake that hit the island is still the way the more than fourteen hundred people were killed in the disaster the BBC's Rebecca ... is on to the west the island\nOf ... that could around that as being completely sit by the name of that quake and sit in a sense that the devastation that don't help or the or the collapse tar it is fairly unlikely that anyone would still be alive\nTeams stretch and they ... they ... they held that date survive\nThe BBC's Rebecca ... a touch of winter is coming to the upper plains the national weather service says a mix of rain and snow will fall in upper Montana and North Dakota today up to three inches could fall meanwhile heavy rain persists in parts of Arizona and Utah following the remnants of the Pacific\nHurricane you're listening to NPR\nSupport for NPR comes from indeed used by over three million businesses for hiring more employers can post jobs and use screener questions to build their short list or preferred candidates learn more\nAnd the corporation for public broadcasting\nGood morning at six so for this is an H. P. R. News I'm Jessica hunt\nGovernor Chris ... says he can't judge Brett Kavanaugh's judicial temperament based on Kavanaugh's testimony before the U.S Senate as an HBO or as Josh Rogers reports democratic candidate for governor Molly Kelly wants a new new to withdraw his support for Kavanaugh\nChristian and his son daughter supporting Brett Kavanaugh's nomination shortly afterwards and no small like Kelly was dead set against Kavanaugh from the start during a visit or car could health clinic coach said adding carbon out of the Supreme Court puts abortion rights at risk ... new new knows it\nI Am asking a Christian union if you say stand with women and you're there for a choice you need to rescind your support for new news\nSaid it's right for the FBI to evaluate allegations of sexual assault against capital but ... also says he thinks Kavanaugh's been ill treated by the confirmation\nProcess this man's life has changed forever one way or the other so that's going to be an emotional situation so I I don't think we should judge his temperament on 'em again the circus that that he's been\nPut through the FBI is expected to finish the view of the capital nomination as soon as today a vote by the full Senate is expected this week for an HBO News I'm Josh Rogers\nA west Lebanon library will host the public information session tonight I'm accessory dwelling unit the units often called in law apartments are seen as one solution to the regions significant housing shortage\nMy keys is with vital communities the organization sponsoring the event he says the goal is to make use of infrastructure that's already built\nA school system water sure transportation lines all those first exceptional neighborhood alpha community here that are available to other people\nYou know if you're formally legalized accessory dwellings last year protecting them from local regulation ... says he was expecting more home homeowners to start leasing out parts of their property but so far there hasn't been a significant change\nThe status chosen granted pathways to operate a new substance use disorder treatment facility for teenagers on the grounds of the sooner you center in Manchester the executive council approved a four year contract with the group Wednesday was serves as expected to begin in early November\nThe thirty six bed facility will be open to children ages twelve to Eighteen who are in need of inpatient treatment\nIn the forecast for today will have sun and clouds preaching to the low seventies south mid sixties north passing showers possible in the late afternoon Susan each PR\n[noise] support an HP are today and you could win a strip of a lifetime to land down under are lucky winner has the choice between Australia New Zealand which means you'll have to choose between kangaroos are key leads the bright lights in the Sydney opera house for the stunning views of mount cook national park [noise]\nReport the news you trust today as an an HP are sustainable and you'll be automatically and to do when you make your gift now here's how [noise]\nUh the end H. P. R. dot org website and give certainly it's securely right there it takes just too but it's every time or you can give us a call at eight at age eight oh five\nSix four seven seven either way you can get entered when that grand prize trip what a what a great trip that would be either do Zealand Australia your choice but you can't win if you don't get entered you can do it during an aged girls fall fund drive good morning I'm Rick ... in the studio this morning with Rebecca lavoy\nAnd there is another fantastic reason to give right now your gift in any amount we matched dollar for dollar so let's say you want that engage P. R. T shirt that we've been talking about so you get ten dollars a month\nAnd an HBO leadership circle number will match it with another ten dollars a month but it could get twenty dollars a month they'll match that twenty dollars so that's how kind of work you know doubling your dollar and it is your chance to do that and when you give\nTrip your choice of either Australia or New Zealand I don't know I I'm really on the fence about which one I Would shoot I'm not eligible to winnow you our listeners don't make the call one eight eight eight eight zero five six four seven seven or make a gift online you could even do it on your mobile phone at N. H. P. R. dot\nOr a tough choice for the next one to have if you win and you can when you give us a call or you get on line get entered when it becomes a standing member consider that New Hampshire public radio pays NPR about five hundred twenty five thousand dollars a year\nI think it ... or the ... MORNING EDITION and MORNING EDITION of all things considered sounds like a lot of money it is but think about this thing about all of the programming twenty four hours a day seven days a week you get 'em it's money well spent all reporters producers equipment logistics NPR is more than thirty bureaus worldwide that keep us well informed\nAnd contributions from listeners like you is what helps pay those bills and it's why your support is so vitally important right now it's really easy it's convenient to give\nTen dollars a month twenty dollars a month of course you get a match to a dollar for dollar right now perfect time to call it eight eight eight oh five six four seven seven or an H. P. R. dot org\nNow monthly contribution is the most convenient way to support any PR it's the way that you pay for a lot of things now I think that all the subscriptions that are just deducted from your checking account things like Netflix and Amazon Prime\nThe president does not coy about how much he enjoys tariffs\nThat raises prices for American consumers and other countries retaliatory tariffs hurt\nCheese makers for example now face terrorists of up to twenty five percent when they try to sell their cheese in Mexico that's likely to offset any additional sales they might gain in Canada through the increased market access to Trump's team to go she ate it\nThe administration has also open trade talks with the European Union and Japan White House advisor Kudlow says progress there could be the way for a coordinated crackdown on bad behavior by China\nThere is a trade coalition of the willing that is beginning to fix a lot of broken areas in our international trading system\nAnd that coalition will\nStand up to China maybe so but the Peterson Institute's bound says the administration now has to re assemble a coalition that was already inclined to side with the U.S before Trump started targeting friends with terrorists\nThere's a lot of healing that needs to take place I think between the United states and a lot of allies for effective action toward China's gonna transpire\nTrump has already ordered terrorists on about half the products us imports from China than more could be on the way Scott Horsley NPR News Washington\nPresident Trump's nominee to lead the Census Bureau was back on Capitol Hill yesterday if confirmed he'd have to join multiple lawsuits against the Census Bureau over a new controversial citizenship citizenship question on the farm Here's NPR's Hansi Lo long\nIn twenty twenty a Trump Administration is playing to ask every household is this person a citizen of the United states administration says it needs responses to that question to better enforce the voting rights act protections against racial discrimination dozens of states cities and other groups have felt six lawsuits to try and get it removed\nThe mornings or come to order and Wednesday on Capitol Hill senators considering the nomination of a new Census Bureau director raised the citizenship question\nHaving understanding of something as fundamental as how many citizens and non citizens are in the country I think that's essential\nSenators Steve Gaines Republican from Montana as President Trump's nominee Steven Dillingham if he supports including the question on the census\nSenator I ah have no plans to voice an opinion on that question I think it would not be advisable in my position if I'm confirmed to be the director of the Census Bureau\nDillingham said the courts will decide if the citizenship question stays or goes when that decision will come is not clear right now the Trump Administration is trying to get the Supreme Court to weigh in on the lawsuits the administration wants to stop the plaintiff lawyers from questioning to key officials behind the question including commerce secretary Wilbur Ross\nWhat are they hiding why such extreme measures to block the essential deposition\nLiz oh young is a census consultant for the New York immigration coalition there one of the group suing the Trump Administration because Census Bureau research suggests asking about citizenship status could discourage non citizens from participating that would harm the accuracy of information collected for the headcount of every person living in the U.S that the constitution requires\nThe first trial for the census lawsuits is set to start in November the day before the midterm elections on July ... NPR News Washington [noise]\n\nGood morning you're listening to MORNING EDITION on an age PR it's six twenty three\nSupport for an H. P. R. comes from you our listeners\nAnd I'm from North country ... little tin providing comprehensive office space gee I care since Nineteen Ninety six\nSeven graft in ... and Carol counties and see a gastro and H. dot com and pony automotive group with pre owned and certified ... vehicles available to meet the used car automotive needs of New Hampshire one simple price no hassle no surprises\nAnd then I have a union leaders forty under forty program present\nThan Nineteen nominations being accepted at union leader dot com slash forty forecast for today the sun and clouds in the warm up into the low seventies and the south mid sixties in the north\nIs a chance of passing showers in the late afternoon six twenty four this is an H. P. R. morning [noise]\nMaybe a little less rain and we've got little days but no matter the weather is a beautiful day to give you an age PR you listen to any PR to get up to date on what's happening in our world because\nIn each PR dependable trustworthy source of local national and international news and I'm here back a little I along with ... to rent Brian due to support this station right now what is it worth the ten dollars a month Fifteen dollars a month maybe\nMake the gift right now it's super easy to do at N. H. P. R. dot org and it's\nA fantastic time to give because right now in any amount your contribution will be matched dollar for dollar when you become an an age PR sustain her current members of ... leadership circle are going to measure contribution\nSo let's say as Rebecca said ten Fifteen twenty each of those contributions will be doubled that's not bad you attend becomes twenty or twenty becomes forty and so on\nAnd when you get right now don't forget you'll also be entered into this fantastic drawing were giving away today or later ah in the drive a trip of a lifetime for two to your choice of Australia or New Zealand\nBut you don't want a way you want to give now because you can get this dollar for dollar match and yes you could get entered to win that trip be a tough choice I think Rebecca yes New Zealand Australia would I Would like to have the choice myself I'm not eligible\nYou are if you're listening to get our mind right now become a sustaining member of New Hampshire public radio and you can get injured and H. P. R. dot O. R. G.\nIt's definitely one of the most exciting trips we have given away since I had a history of my pitching these fund drive\nThink about why you listen to MORNING EDITION we've had stories this morning about the ... Republican and democratic rap sort of coming together as a result of his cat on the nation's we just heard a really interesting story about controversy over a question in a sense is and coming up we have a local story you know had the ear of the squirrel those like smashed girls all over the place\nApparently it's also a problem at squirrels are breaking into people's houses\nAnd each ... Brita green has that story for us this is why you're listening to MORNING EDITION that variety\nAre all reward let's face it when it's affecting vile I for one welcome most liberal or if you support this kind of coverage you support and the kind of station that follows up on a\nCritical story like the squirrel invasion support the station right now with the gift of ten dollars a month or Fifteen at any age P. R. dot org\nShout out to the squirrels in the audience [laughter] think about how much um I think about how you might spend Fifteen or twenty dollars today maybe you're taking a collie go to lunch and you're both grabbing a sandwich maybe you're going to see a movie maybe you're going to grab a couple of magazines like Rebecca said earlier maybe\nYou know you spend twelve dollars a month and your Netflix but think about this how often do you listen to New Hampshire public radio I'm willing to bet you knew you use New Hampshire public radio a lot more than you use Netflix or some other things that you pay monthly for and when you were Fifteen or twenty dollars a month a gift right now you can get that match dollar for dollar so your contribution goes all the further\nFor the news service that you rely on so it's a it's a great day to get a New Hampshire public radio get your contribution matched dollar for dollar it's a great value Fifteen twenty twenty five dollars a month and H. P. R. dot O. R. G. or you can give us a call at eight eight eight eight oh five six four seven seven\nThis is David Draine when you tune into public radio don't you feel a little sigh of relief you hear that straight ahead news reporter and your brain kicks into gear you can think about issues simmering right beneath the surface or you can enter\nWe breathing a sigh of relief when you support and what not here and we do we just want to take this opportunity and\nAll you gotta do to say thanks is go to an H. P. R. dot org make your gift right now it will be matched dollar for dollar and of course you'll be entered into this incredible drawing the deadline is just thirty six and a half hours away you could be the winner of the trip of a lifetime\nTo your choice of either Australia or New Zealand is that a little poll going which would you pick the maybe you can choose based on the celebrities from that country or the ... for instance has this thing or lord\nWell Australia has met at work which we heard a little bit from her in the hour you more of a large amount of work than maybe I don't have it on your generation ... give a gift or right now you will be under way at N. H. P. R. dot or you can\nTell that this was a news operation because we have a scientific poll going and we you know we're debating we have a\nA a you know a New Zealand common column and in Australia column so we've been trying to be very data driven with is a fantastic time to give to New Hampshire public radio not only do you have a chance of that that a fantastic grand prize\nBut your contribution will be matched dollar for dollar right now you're ten becomes twenty and you're twenty becomes forty this is a great time to give to the news service you rely on its here for you because of listeners support you can do your part now at an age PR dot O. R. G.\nOr call one eight eight eight eight zero five six four seven seven you can run into those hands were brothers in Australia but only if you get you can get that done at an H. P. R. dot org support\nFor NPR comes from this station and from his Cox insurance providing customized insurance for small and medium businesses so they can do more and be more to learn more H. I. S. C. O. X. dot com or from an agent Hitchcock's insurance encourage courage\nFrom at last in a collaboration software company empowering teams around the world committed to providing the tools and practices to help teams playing track build and work better together more at at ... dot com\nLearn more at Raymond James dot com and from tire wreck offering a tire decision died for help customers buying tires that fit their car and driving conditions with a network of more than seven thousand independent installers tire rock dot com helping drivers find deliver in stone [noise]\nGood morning at six forty you're listening to MORNING EDITION on an age PR it is the year of the squirrel in New England they never had so much fame or been the subject of so much attention it's partly because they've put themselves in the spotlight or in our headlights that might be more accurate\nTheir populations have boomed in recent years fed by a glut of acorns and now they're running across roads on math in search of more food the thing is all the squirrels aren't just affecting our highways and ... has more\n... worth we can't even drive down the street without a memory of one of his jobs coming to mind\nThis yellow unit here in\nFlying squirrels I rent a wildlife control company out of Cain has brick house here why squirrel ... through the back and one was actually inside the house in the bathroom\n... complaints makeup Seventy five percent of his business he recently had to hire another employee piece getting double the demand he had last year and that was double the year before\nThis done this past year I've taken bath squirrels dogs were charged with\nToday we're in his white pickup headed to a call about ten miles south of Lebanon we pull into the driveway of a beautiful old brick house sun shining through the yellow and leaves of a giant maple outback Carol little the homeowner answers\nThat or some of the day we've had a recurring\nTold her client squirrels that side dishes that\nI don't what are the what the schools are doing this year we have\nTons of 'em was outside force\nPoints his by not killer up towards where the houses brick sides meet the roof he points out holes he can see leading straight into the addict\nPerfect access point for the rodents he says where are you hearing activity seeing actual yeah I didn't I I heard a couple of nights ago didn't last night because they get real busy some nice hat or chatter chatter and ... scamper\nWorth ... directs us inside for more inspection the climbing stairs to the drop down doors to the attic he climbed through on a ladder Carol little weights anxiously below for word her face is now I Level with his boots things looked pretty good up here he says Ben\n... like that\nAll right so what do you have here is on the outside wall was to\nAt least three flying squirrels toilets\nFor the un initiated squirrels tend to use the same location repeatedly to do their business over time their feces and urine meld together and liquefy often forming a brown stain that will start to run down the wall climbs down the ladder to explain more night and you got your your raft are\nBeing showing dogs and in between three of them there there is an mhm\nSquirrels like these he says are common in houses that they can be a big nuisance because they live there you go around to throw wires and can be tricky to get rid of four six\nSupport for an HP ours lives dream comes from you our members and from the law firm of or in Reno sustain excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how or in Reno can help you on line at or dash Reno dot com nearby\nShe had a flying squirrels soaring across her living room she thinks she has it trapped out in her bathroom she just had a round of chemotherapy she says and she just doesn't have the bandwidth to deal with is worth ... he'll be right over\nThere I'm straw\nWoman's house is small a single story it's bright yellow surrounded by woods she shows us the bathroom at this point she sealed the gaps in the door frame with a hazard arrangement of bed sheets and what looks like insulation phone\nYes for a second I squeeze ourselves inside and shut the door it's a small space painted baby\nBlue shall I spoke to someone can joke show those can\nShe starts grabbing at hand towels moving the shower curtain back and forth he goes through the cabinet checks behind the toilet but he's at a loss\nSuch as her window\nSo I'm\nSure\nHe decides to try one more place a deep built in shelf above the sink actually has to climb up on the counter to reach its hands and first thing he encounters is a wig stored on a glass head he takes it out gingerly and rest it on the sink and he reaches his arms back deeper all the way up to his elbow [noise]\nIs in a way that you\nOnly course that\nHolds up the poor thing no bigger than my hand wrapped in a plastic bag it's gray and brown perfectly still with black whiskers and a white nose to lopsided teeth sticking out from the bottom of its mouth ... in the living room lowest the homeowner is watching TV or he was in his bed [noise]\nAnyone who is in the bed right now oh you're going to get rid of ...\nAnd also the ... of their own\nAnd I had a\nReason to worry about the\nRole of government when I'm On a trap but a very hard to do a lot of the bed and into a trap jaw legislation Roosevelt okay\n[laughter] [noise]\nWorth like loads a squirrel into a cage in the back of his truck and we hit the road\nOver the course of the day he tells me again and again man is part of the wildlife management equation\nWhat he means is we're not victims but enablers we move into their habitat and build houses that are way better than the cold trees there used to and then if that weren't enough we set up birdfeeders outside learning them closer with seeds and nuts\nAnd over time we leave open holes in our roofs and walls floors so they can climb right in\nA um a select women in my town and I'm active in the nation's so it all the people I Know in the nation's but people I Know in the tone or all asking me to watch going on watch torn squirrels like your moment yeah [laughter] yeah the squirrel philosopher but he\nSays unless it's a real emergency adequate job like that bathroom situation is waiting list is now running many weeks long meanwhile squirrel calls they're continuing to come in for HP our news and breaching green\n\nTo MORNING EDITION on an H. P. R. forecast for today will have southern clouds temperatures in the low seventies south Mississippi in the north there is a chance of showers this afternoon\nSupport for an HBO comes from you our listeners an from hyper than shaping possibility for customers worldwide for over fifty years from headquarters in Hanover New Hampshire clear information that's ... ... jobs\nAnd Dr Jonas visa presenting providing dental care to adults and children in Concord area for over Thirty years and now that the new patients information at two to six to nine nine five\n[noise]\nSupport for NPR comes from this station and from exact science is offering coal to guard for average risk adults over fifty a non invasive colon cancer screening test it can be used at home by prescription only information at coal to guard test dot com\nAnd from battle a European made language learning program babble teaches practical conversation and Spanish French German and other languages available and the app store or online at B. A. B. B. E. L. dot com\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm David Greene and we're going to visit rocket now it was once the capital of ISIS territory in Syria but it was captured nearly a year ago NPR's Tom Bowman was in the Syrian city when he spoke to our colleague Steve Inskeep\nOn the soccer stadium right in downtown rock and this is the stadium that ISIS use to jail people for executions as well beheadings and it's interesting that now the stadium is being rebuilt to be used for an actual soccer stadium now\nHow is the city different than it was when you were there early in the year shortly after it was captured from ISIS\nWill Steve a rocket seems to be coming back to life step by step there's still a lot of rubble removal being done for the streets are pretty clear\nClean water is widely available now some electricity is coming back it was really interesting is a lot more shops are open is kind of bustling in a way but what's curious is the shops are open on the first floors of a lot of buildings\nIs sort of a skeleton of a building and a lot of rubble just above the shops and they say there were more than five hundred homes have been cleared of booby traps and more and more kids are going back to school but there's still an enormous need for health officials say\nVoter an advocate plus great topics for conversation says it all joined Jenna make a gift right now to engage PR advantage PR dot org you'll be joining Janice supporting something that is a value to you when you get ten dollars a month or twenty dollars a month\nPlus of course there'll be entered to win our grand prize a trip of a lifetime to your choice of either Australia or New Zealand get it done at at H. P. R. dot org and good luck [noise]\nGood morning at seven o'clock and support for an HP are comes from you our listeners I'm from ... freedom plan and northeast out the dental a partnership created for better oral and overall health right here in New Hampshire learned more pizza toes dot com and they've been Wexler and company professionals providing comprehensive audit accounting tax and dozens advisory services\nIncluding forensic accounting offices in Keene conquered in Lebanon\nThese are the stations of New Hampshire public radio W E video conquered eighty nine point on\nW. E. D. S. Nashua eighty eight point three\nIt'll be easy age Hanover Ninety One point three\nW ... team I'd be point seven WABC going from one o seven point one\nW E v J Jackson Ninety nine point five\nWCBS cobra Ninety point three and W. E. V. cute little ten Ninety One point nine and online at an age P. R. dot org\nLine from NPR News in Washington I'm core of a cold and the White House announced overnight that it had gotten the FBI's report on its reopen the investigation of Supreme Court nominee Brett Kavanaugh he's been accused of sexual assault allegation he strongly denies the White House says it's sent the report to the Senate\nNPR's Scott Detrow says senators will begin reading the report ahead of a procedural vote on Kavanaugh's nomination that set for tomorrow\nThe report is being held very closely every senator is being given a chance to read it but they'll have to do so in a secure setting they have to go to a special room the Senate uses for classified information to read the report Democrats and Republicans will be able to do so in alternating shifts\nNPR's Scott Detrow if the Senate passes the procedural vote tomorrow the chamber will stop debate and move Kavanaugh's nomination to the floor for a vote\nOfficials from the Netherlands alleged Russia has tried cyber attacks on the United nations chemical watchdog agency the Dutch Defense minister says the alleged Russian attack was against the organization for the prohibition of chemical weapons\nIran's Supreme leader says his country will defeat American sanctions and deliver a slap to the U.S NPR's Peter Kenyon reports us oil sanctions are due to be reimposed next month\nSupreme leader Ayatollah Ali Khamenei delivered a televised speech to an audience of besieged paramilitary forces calling it a sensitive time for the Iranian people which he blamed on arrogant powers how many appear to respond to a comment by President Trump that Iran could collapse under American sanctions reimposed after Trump's decision to withdraw\nWith the wrong painful sanctions on Iran's oil and gas sector are due to return in early November European countries say they're committed to continuing trade with Iran despite the American sanctions but a number of companies that do business with both of us and Iran have already announced their decision to drop their run business Peter Kenyon NPR News Istanbul\nPresident Trump's nominee for the next Census Bureau director is refusing to offer his opinion on the controversial citizenship question the administration added to the twenty twenty cents as NPR's Hansi Lo Wang reports the bureau is facing multiple lawsuits from groups that want the question removed\nSenators tried to get Stephen Dillingham to discuss their twenty twenty cents a citizenship question during his confirmation hearing Wednesday but doing have avoided taking a position on whether or not the question is should be included\nThe decision as I understand it will be determined by the courts and to be my responsibility if confirmed to administer descend you'll census in accordance inconsistent with that judicial decision\nCommerce secretary Wilbur Ross who oversees the bureau has said he approved adding the question to better enforce the voting rights act more than two dozen states cities and other groups are suing to remove it because Census Bureau research suggests that could\nScare of households with non citizens from participating in the head count on these little long NPR News Washington You're listening to NPR News\nSupport for NPR comes from the NPR stations other contributors include the three I O T providing a software platform that enables organizations to deploy artificial intelligence predicted analytics an audio solutions and industrial scale learn more at sea three I O T dot AI\nGood morning at seven oh for this is an HP our News I'm Jessica hunt a residential treatment facility for kids struggling with addiction is slated to open in Manchester in early November as an HP are taught book reports the executive council approved a four year contract Wednesday\nThe group granted pathways will operate the treatment center it's going to have thirty six beds all the dedicated to servicing kids ages twelve through Eighteen who have substance use disorder\nThan if you saw these located on the grounds of this new youth services center in Manchester\nThat the state secure facility for juvenile offenders recent reforms in how the state detained and punishes juveniles who break the law has reduced the population at the NYU center opening up space for this separate addiction treatment program for H. P. R. News I'm Todd book in\nDartmouth College is celebrating one of Wednesday's Nobel laureates that's Francis Arnold who received this year's prize in chemistry start with awarded Arnold an honorary degree last year and she delivered a personal address to graduating students at the colleges their school of engineering\nWhen I was asked to speak to you on this day when you and your family's celebrate your hard work\nAnd your achievements my first thought was to say no\nI don't have any advice to offer even words of wisdom because so many things in my life have gone awry\nHad recently lost her college aged son unexpectedly she urged the graduating engineers to build something beautiful and create something meaningful she's only the fifth woman in history to receive the Nobel Prize in chemistry she's widely recognized her work on the evolution of enzymes\nState health officials have identified a batch of mosquitoes in Manchester with the virus eastern ... blight us or triple e\nThis is the third detection of Tripoli in New Hampshire this season there have been no reports of human cases of the virus so far Tripoli is less common but more serious than mosquito borne West Nile virus symptoms or flu like up here for ten days after being bitten\nThe Manchester health department says as of now it does not plan to spray for mosquitoes but it will continue to monitor mosquitoes for Tripoli until mid October\nLove southern clouds today it will warm up into the low seventies\nShower responsible in the late afternoon\nThis is an H ... support comes from you our listeners\nAnd from our I'm Davis providing investment management trust services and financial council throughout northern New England with offices in Portland and Portsmouth information are I'm Davis dot com and the courier museum of art presenting the blue trees and environmental community art installation at the career and in city parks now on few details that career dot org\nKnowing what's happening in the mid term elections before you vote in November is important\nBut what about what's going to happen in December or January Hi I'm Lauren jolted housing in policy reporter for any young when you give each month and the ... and you will an H. B. R. and NPR cover the entire election what happened poor what's going on now and especially what's coming next [noise] be a part\nOf what comes next to become an NFC our standard today\nIt's as easy as going online to engage PR dot org or just giving us a call ... eight oh five\nSix four seven seven I promise is a painless process at all just a committed or two\nAnd and it'd be the easiest thing to do all morning becoming standing member feels great too cause you're supporting this new service you rely on when you wake up when you're driving to work when you're getting throughout your day and checking Oman and driving home it's here because of listeners support so become a skinny member now and a half your public radio well we're getting to be\nWinning hours early fall fund drive I'm Rick ... here this morning with Rebecca lavoy\nAnd here's a fantastic reason to get right now right now you're gifted we matched dollar for dollar by some leadership circle members who have put their money to work to help you double your get so\nThey want the H. P. R. T shirt the very soft very awesome and HBO T shirt for ten dollars a month your gift essentially becomes twenty dollars a month to any PR he want the teacher and the mug and by the way it's really beautiful\nUh that Fifteen dollars a month and that becomes a thirty dollar a month gifts are right now you get to match dollar for dollar plus of course we have this trip of a lifetime to Australia or New Zealand we're giving away tomorrow\nIt is a fantastic date you gave is a fantastic morning to give don't miss your chance of getting your gift match to make it right now it's quick and easy takes about Ninety seconds at N. H. P. R. dot org\nYou know I Do want to say the McGee is state of New York um it is a is hurting on it it is our economic and it was beautiful fantastic it looks great I'm Glad to be a lot of the color red it is and looks good trustworthy love worthy on it it's a great way to show your support from New Hampshire Public radio suitable for all liquids by the way\nEvery day you know you get hours and hours of live up to the moment news on New Hampshire public radio it's here twenty four hours a day for you you never miss a development or what's happening on the national scene you never miss what's happening internationally and you never miss what's happening right here in our own backyard around the Granite State this was thanks to award winning reporting\nRight around the board you know you were lighter Hampshire Public radio and you know it's here because of listeners support so maybe it's time for you to throw in ten or Fifteen or twenty dollars a month become a sustaining member of New Hampshire public radio\nWhat do you make of them as someone who defends Brett Kavanaugh who was at the center of all this\nWell I I think that someone one woman's experience or or\nBecause there are other experiences and certainly women have um had these assault experiences and we know that they go unreported and a lot of cases and things like that but that just sit on its own on its face doesn't make Brett Kavanaugh or any man guilty\nOf doing what they did they say they don't I mean in our country we have due process and you are supposed to be presumed innocent until proven guilty and this situation has been the\nComplete opposite of that where he was presumed innocent based on a single accusation starting with it being anonymous then it would be accusation had to face in the name to it than there were four witnesses hall who could not corroborate that story\nBut have you ever had any friends who've had this happened to them to have people in your life who have suffered a sexual assault I'm sure that I Do yeah and how many men do you know who've ever been falsely accused\nI don't they haven't told me who the who they're accuser who they are accusing so I Know it's a very small percentage but that does it's about I think ten percent of the cases I think the the data shows it just doesn't mean that\nBrett Kavanaugh is guilty because Ninety percent of the men who are accused are guilty ... there are men who are accused of things and they're not guilty\nOr we can look at UVA you can look at um a visit to do across\nYou know there are instances and frankly this one is a very public one um the timing of this was incredibly suspect um there's a lot of holes in the stories of I'm Dr Ford there's Ramirez is fairly credible the New York times\nSays you know do we know we're operating any of it knowing women who have endured this you know that there are eight is common to have holes in one's memory that you can't recount necessarily The Elders older one\nThing but lies or other things I mean I'm you know fear of flying not true\nThe second door on the house um again the the data the the history shows that was that you like indoor was put on for years before the therapy session that apparently it was about this incident there are a lot of things like I said in the testimony that Rachel Mitchell did not follow up on that uh you know now\nWe are holes in her story we we do not know it is true that we don't have conclusive evidence either way may never we may never but I just wonder and closing is there any part of you that wonders what if I'm wrong what if you did you\nKnow there actually isn't\nUm and it's just not enough in our country to make an accusation against somebody anybody for any job any position um or just for their life without having some cooperation um you know\nMaybe the lesson is that women if these things happen to you need to either report them confide in somebody or something like that so that you know you have a strong case but um that's not the case here\nUm and and all three of these instances one who was much more salacious and the next there is no cooperation\nWe all have to leave it there but we appreciate you sharing your thoughts ... missing a big old car ... Brett Kavanaugh's thank you so much for your time thank you for having me and this is NPR News [noise]\n\nGood morning at seven twenty three you're listening to MORNING EDITION on an H PR support for an HP are comes from you our listeners from UNH in Manchester hosting an open house on October twentieth campus tours available to explore degree programs and learn about financial aid\nManchester diet UNH dot edu slash open house and the loss and group conquered providing worker health and safety services workers' compensation management employee wellness programs Martha lost some groups dot com\nAnd whiskey and wine internationally inspired tapas in line now open for pm to ten pm Monday through Saturday additional menu cocktail and beer selections one forty eight north main street in Concord\nForecast for today suddenly clouds temperatures ... the low seventies in the south mid sixties in the north don't leave the umbrella behind however passing showers or possible in the late afternoon and this is an H. P. R. [noise]\nHi this is Steve Inskeep with MORNING EDITION from NPR News\nYou can tell\nThe difference between a town where there is a good local news operation and where there was not no I Would have told you in the past you can tell the difference between a town where there's a good newspaper local newspaper where there was enough and now we have a situation where newspapers have been hollowed out in so many places in somebody else has to step in and cover local news\nSomebody else has to do that I'm really delighted to be part of a gigantic network of organizations across the country hundreds of NPR member stations but\nIn addition to covering national and international news are are digging into local news in New ways and creative ways and working to to fill the void thats what you get when you support this public radio station thanks very much for your support\nThat is what you get and you can tell there is a great news operation here at any age PR when you look around thinking about the stories that\nHave taught you more about your community about your state I think about the things that have actually happened at the state house as a result of some of the accountability reporting we've done here in each PR\nThat's what a quality journalism does it makes a difference in your community in your state in your country and if you believe that kind of journalism matters supporting an age PR is a great way\nTo invest ten dollars a month or Fifteen dollars a month in supporting this nonprofit journalism operation had on over right now to end H. P. R. dot org and make that gift\nI'm Rebecca ... in the studio with Rick gambling\nOr you'd recognize with her Hampshire Public radio and NPR maintain very high journalistic standards you think about that long form interview we just heard with a Rachel Martin here on MORNING edition\nI I don't think anybody does it better than ritual and Steve Inskeep are these days they are fantastic at that type of in depth interview pushing back with ah with with other information and trying to get the most out of their their gas and going well we won't be on the ...\nJust kind of Trump at the same headlines over and over again you don't get that from public radio you get a much more in depth\nLook at both sides or all sides of an issue I think that's one reason we all love public radio is one reason we all supported as well\nAnd you know if you do love New Hampshire public radio this was a great time to support there's no better time in fact right now because you can get your contribution contribution mashed you can also get in a for some great great grand prize was like how about a trip for two to Australia New Zealand\nCome do I go to an H. P. R. dot O. R. J. or just give us a call become a sustaining member it eight eight eight eight oh five six four seven seven\nSo with that dollar for dollar imagined play what that means is saying you want the T shirt and muggy I thank you get that the Fifteen dollar a month contribution will get you that thank you\nRight now that gift becomes thirty dollars a month because of these dollar for dollar matching dollars when you take action and support public radio it sends a lot it says that you care about quality journalism and also says that you're willing to step up and support and nonprofit any care about in your state\nAnd your voice Judy other voices of listeners who have contributed during this Dr injuring other drive\nAnd joined I joined in the public radio family make a gift right now and of course we'll send you some great any PR swag when you do you can check out that swag and are drawing prize for that trip to Australia or New Zealand at N. H. P. R. dot org and we made it very easy for you to give give your gift there too it's just an H. P. R. dot or\nAs it is really just takes a couple of minutes it'll be the easiest thing to do all day but you do want to do with this morning because you can get your gift match to a dollar for dollar if you give us a call or get on line before nine o'clock\nCourtesy of an age yours leadership circle members they're going to match your contribution your ten becomes twenty you're twenty dollars becomes forty and so on so this is a test of time it's the best time to give the New Hampshire public radio and yes you have a chance at a grand prize which will be given away in under thirty six hours so the end of the drive we're going to pull the name of a lucky winner\nWho is going to get a trip of a lifetime now it's a big choice you have to choose between Australia or New Zealand huge Joyce tough choice but and I just wanted to have a lucky listen is going to get it it could be you know at first you gotta get entered you can do that and H. P. R. dot org\nYou think about using that trip are you more of a flight of the concourse person or a ham is worth rather than person I think I may just tip my hat which one I Am\nI don't get to choose though 'cause I'm not eligible to when you are making after we are giving away that trip in about thirty five and a half hours that will be here before you know it\nMade your give now get your name in the hat and of course you are supporting a place that you make the content that you you you listen to any PR for hours each and every week weigh more than you watch TV way more than you can assume\nOther news sources support it with a gift right now how 'bout ten dollars a month and an H. P. R. dot org\nAnd H. P. R. dot O. R. G. or give us a call becomes a sitting member of New Hampshire public radio get your contribution matching dollar for dollar and get into the wind and fantastic tripped either Australia New Zealand eight eight eight eight oh five six or seven seven Oregon and H. P. R. dot ORG support\nFor NPR comes from the station and from Amazon Prime video\nPresenting the return of the men and the high castle\nWere America's history is under siege but the resistance rises to fight for the world today was the new season premiere this October on prime video from farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs\nMore at alliance for a lifetime income dot org [noise]\nAnd from voting with the bonus certified craftsmen program a network of hardwood flooring contractors committed to expertise\nAnd customer service\nContractor locate her dance more information storage Foner dot com this is\nMORNING EDITION from NPR News I'm Rachel Martin in Washington DC and I'm David Greene in Culver City California Good morning China's ambassador believes the United states needs to make up its mind sway ten ... says the United states doesn't seem to know what it once on trade and the middle of this escalating conflict\nSway is China's man in Washington this elegantly dressed diplomatic veteran and he sat down with Steve Inskeep for a rare interview\nWhat is preventing and and to the trade war with the United states\nWe certainly don't want to have a trade the wall was the United states or with any other country you have one yeah this is very unfortunate but we want to solve it would do need good will and the good faith from both sides\nAre you seeing good will are good faith from the United states\nWell into the truth or not sufficient to what is the evidence of that\nWell for instance so us position keeps changing all the time so we do know is actually whether us would lumped as ... we're ready to make a deal where I read it to make some compromise but in needs the goodwill from both sides\nThe best or you use the word priorities I'm reminded that a few months ago the U.S treasury secretary Steven Mnuchin went to China for some negotiations and it was said that the United states made a very wide range of demands that were rejected out of hand by China\nWant the United states to pick a few items rather than demanding every complaint be fixed it once\nBut actually in the last few months it's ever been contacts between the two governments and the ... foot to reduce the trade deficit of the United states for instance and then we also present a very good proposal to the side of odds that for the reform and open up in China\nI seen them more than once we had some tentative agreement between the two working teams\nThen just overnight the tentative agreement was rejected and the demand the from us changed so this is very confusing\nThat perhaps leads to another question um\nWhat is your method for trying to determine what the president of the United states thinks\nWell we'll have to look at the uh ... we have to look at\nThe the what the U.S team would tell us on the negotiating table [noise] but I think that we still need more good faith if people tell you a west are it one day and another star a very different started another day then you've got confused\nUm do you follow the president's Twitter feed [noise]\nWell I think many people falling over each it as a ... so we're just doing the same but\nDo you find meaningful information they're some of his political allies will say disregard that there's actual policies or something else\nHonesty I think if it's written by the president it has to be meaningful\nThere was a news story here\nAre suggesting that foreign embassies and consulates were\nBuying large numbers of copies of a Bob Woodward book about the inner workings of the White House is the Chinese embassy filled with copies of Bob Woodward's book\nNatural that people would like to get a copy and see what happens what is written the book\nIs that yes you have lots of copies of fear around the Chinese embassy\nI don't know it's really you it's really up to the individual is whether they want to abide for not\nI certainly have a copy so I have talked to many other ambassador here we all share the same ... all of us want to have a better understanding of what is happening here and what it would mean for us\nDo you feel you understand the president at this point well ah I Hope that could have a better understanding\nWhat have you thought about as there had been news reports that the administration has considered proposals to ban Chinese students from studying at American University's\nIf this is true I think that this is a very dangerous situation because so many Chinese students are studying here and there were a number of American students are studying China\nSuch people to people contact would be the real foundation of friendship and the cooperation between the two great countries and I I could give you a very specific is it on pause in the state of Indiana\nIndiana Indianapolis where I'm from\nYeah that is the children's museum sure it's a great one it's a great one and a few years ago the museum hosted a big big event on Chinese culture and I was invited to address the opening ceremony and I had a meeting with then governor Mike Pence\nGovern the past it was a great supporter to such people to people and the cultural exchanges so why should we cut off all these ties all the natural ties between now to people's [noise]\nWould you encourage greater openness going the other way if Americans scholars who may have controversial opinions wants to visit China if American journalists want to go to sensitive areas like Tibet would you encourage greater openness on China's part\nYou see well open to American students\nSupport for an HP arts live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nCould quickly get used to such comments unnatural conditions even food Chinese men over them would not feel very well ...\nWhat about weaker areas and far northwest China\nWell this is part of China so the whole country the open to the rest of the woods Sutton is this part is also open but honestly it in this part of China will have a particular problem that is\nTerrorism very violent extremist groups I'm sure some people oh there's some attempt\nTo create a situation and lacks the ISIS in that part of which on\nWhat have you thought about is the United nations has said that hundreds of thousands of people and weaker areas have been put into camps\nYou see very often widespread star as may not be the true story I think whatever we're doing in that part of China is for the wellbeing and safety and security of the people that are you\nPutting people in camps to do that\nIt's not you see first of all we have to take measures to make sure that\nGroups a lot like ISIS will not be spreading into powder which on second delay will have to make sure that people have means to build a better life for them to learn more skills they have to learn techniques to develop themselves\nAnd also we have to maintain loco stability\nPeople will be listening carefully to your words um they may hear you saying that yes there are camps and it's a ... and ... are you saying there or not\nI'm not saying that al ... I think of that effort to help people to learn skills techniques to have a build up at the economic ... song\n... thank you for coming by hand to\nSwitch here in ... Chinese ambassador to the U.S Steve also asked him about North Korea and China's global ambitions and we have a transcript NPR dot org [noise] this is NPR News [noise]\nGood morning at seven forty eight and you're listening to MORNING EDITION on an age PR where support comes from you our listeners and from ... construction providing professional commercial and residential construction renovation services for over Thirty years more information at ... dot com\nAnd the ... museum of science exploring the science art and wonder if music\nAt the recently opened exhibition making music the science of musical instruments learned more at ... dot org I'm southern clouds today temperatures in the low seventies in the south mid sixties in the north was passing showers possible in the late afternoon this is an HP our morning [noise]\nSupport for NPR comes from the station and from Iraq with more than five hundred tire models for\nWhen the few manufacturers and and non life for finding tires based on vehicles have budget and brand tire rack dot com helping drivers finds deliver installs and from capital one\nOffering a variety of credit card options with features for a range of customers from food Easter travelers\nCapital one what's in your wallet credit approval required capital one bank usa NA\nMORNING EDITION from NPR News I'm David Greene and I'm Rachel Martin this week leading researchers in medicine physics and chemistry have been awarded the press\nAnd usually today we'd be telling you about the winner in literature\nExcept there isn't one not this year the academy is taking a year off after it was engulfed in a scandal involving sexual abuse by the husband of one of the academy members NPR's Andrew Limbong has more\nThen right now that is being matched dollar for dollar get it done at N. H. P. R. dot or all the\nJokes are well while you're listening and H. B. R. dot O. R. G. is the Web address it takes two minutes of your time to become a skinny member of this new service that you wake up to each and every day it's here for you because of listeners support eight eight eight oh five six four seven seven or an H. P. R. dot O. R. G. and thank you\n[noise] to say the clock there is more of MORNING EDITION just ahead on and H. P. R. where support comes from you our listeners and from White Mountain oil and propane in North Conway and Lincoln\nFeaturing the run I heater and intelligent heating solution for homes additions condos and vacation homes and ... states Redfern art center representing the music of Tom Waits with sticky Christina Barcelona on October fifth information that team dot edu slash parts slash Redfern\n\nThese are the stations in New Hampshire Public radio W. E. Z. O. conquered eighty nine point one W. E. V. S. Nashua eighty eight point three\nOr ... you'd be H head over Ninety One point three\nW ... keen Ninety point seven WABC Gore him one of seven point one W. E. D. J. Jackson Ninety nine point five W ... Ninety point three and W. E. B. Q. Littleton Ninety One point nine and on line at in each P.\nR. dot org\nLive from NPR News in Washington encore of a cold in the Senate Judiciary committee says it now has the FBI supplemental background check on sexual harassment allegations against Supreme Court nominee Brett Kavanaugh he strongly denies the allegations all senators are being offered a chance to take turns reading the report in a secure room at the Capitol\nOn Wednesday night Senate majority leader Mitch McConnell said he will hold a procedural vote tomorrow on Kavanaugh's nomination\nThere'll be plenty of time for members review and be briefed on the supplemental materials before friday cloture vote\nSoftball and culture on drugs ... this evening so the process can move forward ... earlier before\nThe woman who is accused Kevin of sexual assault when they were in high school Christine Blasey Ford says she was not approached by the FBI this week Britain is accusing Russia's military intelligence service the G R U staging global cyber attacks to undermine international stability Pete Ross reports from London\nThe ... national cyber security sensors as as I say with high confidence that the G argue is almost shifts and they are responsible for the CDs of international cyberattacks\nTargets included firms in Russia and Ukraine a TV network in the u._k. and the U.S Democratic Party Britain's foreign sec street Jeremy ... said the geo you had to wait for the campaign of indiscriminate ... cars cyberattacks that serve no legitimate national security interests Russia strenuously denied the accusations\nSpeaking at a live broadcast on social media Russian foreign ministry spokesperson Marie is like a rover described the allegations as mindboggling on a rich fantasy of our colleagues from Britain for NPR News in London on Pete Rose\nSeparately the Netherlands accuses Russia is carrying out cyber attacks against an international chemical watchdog agency the Dutch Defense minister legit it happened as the group investigated the nerve agent poisoning of a former Russian spy\nA federal court in California has blocked the Trump Administration from ending a program letting certain immigrants temporarily live and work in the United states NPR's Richard Gonzales prepared this report\nProgram was called temporary protected status or GPS and it was designed for immigrants from countries facing civil conflicts or environmental disasters us district judge of origin granted a preliminary injunction stopping the administration from ending TPS for immigrants\nWe're in Sudan George ... ending GPS would cause irreparable harm and great hardship you also said there is evidence that President Trump tried to end the program because he is motivated by quote an animal is against non white non European aliens a spokesman for the Justice Department so the administration\nWill continue to fight for the integrity of the nation's immigration laws Richard Gonzales NPR News San Francisco you're listening to NPR News from Washington\nSupport for NPR comes from NPR stations or their contributors include T Rowe price\nOffering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose T Rowe price T Rowe price invest with confidence good morning and\nSaid oh for this is an H. P. R. News I'm Jessica hunt Governor Christie ... says he can't judge Brett Kavanaugh's judicial temperament based on Kavanaugh's testimony before the U.S Senate as an HP are as Josh Rogers reports democratic candidate for governor Molly Kelly wants a new new to withdraw his support for Kavanaugh\nChristian even signed a letter supporting Brett Kavanaugh's nomination shortly afterwards and no small like Kelly was dead set against Kavanaugh from the start during a visit or car could health clinic Kelly said adding carbon out of the Supreme Court puts abortion rights at risk ... new new knows it\nI Am asking ... noon and if you say stand with women and you're there for a choice you need to rescind your support\nFor new news said it's right for the FBI to evaluate allegations of sexual assault against capital but ... also says he thinks Kavanaugh's been ill treated by the confirmation\nProcess this man's life has changed forever one way or the other so that's going to be an emotional situation so I I don't think we should judge his temperament on 'em again the circus that that he's been put through\nThe FBI is expected to finish his term view of the capital nomination as soon as today a vote by the full Senate is expected this week for an HBO News I'm Josh Rogers\nAfter two years of contract negotiations Manchester and its firefighters have reached a tentative agreement\nTuesday night the board of mayor and alderman approved a three year contract that is now headed to union members for a vote the decision comes after tense month of many firefighters taking sick leave and fewer firefighters working each shift\nUnion leadership expressed support for the tentative contract which offers a two percent salary increase in two thousand Nineteen and twenty twenty contract should be finalized by the end of the month\nIn the forecast four and a half your today will have some clouds temperatures in the low seventies and the south mid sixties in the north with a passing shower possible like this afternoon overnight around fifty then\nFor friday bright sky is unseasonably cold temperatures highs and the upper fifties and mid sixties and the long holiday weekend begins with sunshine and temperatures in the sixties on Saturday\nSupport for an HP are comes from you our listeners I'm from the career museum of art presenting the blue trees and environmental community art installation at the courier and in city parks now on view details at career dot org and after school administrators association representing school superintendents and administrators championing the education of children every day\nAnd age S. A. dot org this is an H. P. R.\n[noise]\nAn HP are today and you could win a trip of a lifetime to land down under are lucky winner has the choice between Australia New Zealand which means you have to choose between kangaroos are key leads the bright lights in the Sydney opera house for the stunning views of mount cook national park [noise]\nReport the news you trust today as an an HP are sustainable and you'll be automatically and to do when they get now here's how [noise]\nMind do an edge PR dot O. R. G. or again you could call it a you know five six four seven seven seven to support\nThe news service you rely on each and every day you're born in ... here with Rebecca boy this is an HBO hours fall fund drive by the way we are in the winning hours ... we don't have long to go\nIf you haven't dug called are you having gone on line to become a sitting member now is a perfect time Rebecca is going to tell you why\nBecause your gift right now whether it's ten dollars a month or Fifteen dollars a month\nWe'll be matched dollar for dollar in these waning hours of any age PR fall\nNumber driving me to ... hours a day and age ... signed dry but we are in the waiting hours just thirty five hours remaining right now leadership circle members have stepped up to match your gift dollar for dollar so if you give that ten dollar a month the gifts that you can get the H. P. R. T. shirts you will get matched\nDollar for dollar W. or giving power and you'll be entered into when that trip of a lifetime for two to your choice of either Australia or New Zealand that's why it's such a great morning to gave heroic and we're telling listeners I'm asking you please head on over right now to an H. P. R. dot org\nJoined Susan from Milford in Elizabeth routine Shelly in ... and and ...\nWe've heard from Aaron in Manchester Lisa in Hampton all have done their part for Hampshire Public Radio's fall fund drive now they're asking for you to step up to the plate and do your part as well their contributions together with yours and other listeners provide that ongoing support for the news and programs\nYou trust the news and programs you love they are here because of listeners support and H. P. R. dot O. R. G. what\nMakes public radio stand apart is the editorial independence\nThat members support gives us we have strong fire walls between our newsroom and money we get from listeners from grand jurors from businesses you under right on the station from even people we work with down the hall and the business side our newsroom is independent\nPublic support your support listeners support is what helps us maintain that independence we are not beholden to corporations to fund our newsroom your gift of ten dollars a month right now helps make our award winning reporting possible if it is important to you it's important to you to have reporters at the state house\nThe president does not coy about how much he enjoys terrorists\nThat raises prices for American consumers and other countries retaliatory tariffs hurt us exporters Wisconsin cheese makers for example now face tariffs of up to twenty five percent when they try to sell their cheese in Mexico\nThat's likely to offset any additional sales they might gain in Canada to the increased market access to Trump's team negotiated\nThe administration has also open trade talks with the European Union and Japan White House adviser Kudlow says progress there could be the way for a coordinated crackdown on bad behavior by China\nThere is a trade coalition of the willing that is beginning to fix a lot of broken areas in our international trading system\nAnd that coalition will\nStand up to China maybe so but the Peterson Institute's bound says the administration now has to re assemble a coalition that was already inclined to side with the U.S before Trump started targeting friends with terrorists\nThere's a lot of healing that needs to take place I think between the United states and a lot of allies for effective action toward China is going to transpire\nTrump has already ordered terrorists on about half the products us imports from China and more could be on the way Scott Horsley NPR News Washington\nAuthorities in South Carolina are in mourning after seven law enforcement officers were shot yesterday in Florence South Carolina one of those officers has died NPR's James do back has more\nLocal officials said Terrence care away was killed in a line of duty he's wanted for city police officers in three sheriff's deputies who were shot Wednesday while trying to serve a search warrant Allen hide litter the police chief in Florence a city of thirty three thousand was visibly distraught as he praised the police\nForce pray for these officers and their speedy recovery pray\nPolice officer that I have ever know care we had\nBeen an officer for Thirty years the shooting started when investigators with the sheriff's office arrived with the war in in a subdivision in Florence county sheriff's office as a man barricaded himself and an unknown number of children inside the house and open fire\nPolice from the city rushed to help put the shooter engaged those officers to\nThey were responding\nTo the seat of an incident\nWhere they knew that their brothers\nFrom the sheriff's officer brothers and sisters and the sheriff's office or in the\nStandoff lasted about two hours it became so intense that police had to use a bullet resistant vehicle to remove wounded officers from the scene police did not named the shooting suspect but see he is in custody and the children are safe\nThe sheriff's office as a twenty year old man was also shot and wounded inside the home\nOfficials wouldn't say why sheriff's deputies wanted to search the residents\nCalls for prayer came from all around governor Henry McMaster called the officers' actions selfless acts of bravery President Trump also offered his thoughts and prayers Florence mayor Steven ... says the city is safe because of the work that police do every day\nAnd your say because\nOf those officers and deputies\nWho are willing and have been willing and our continued to be willing to put their\nThis of the wounded officers James do back NPR News [noise]\nThis is NPR News [noise]\nGood morning it's eight twenty three you're listening to MORNING EDITION on an H. P. R. where support comes from you our listeners I'm from parents major brands appliances offering energy efficient appliances in a variety of styles for home and professional use\nFamily owned and operated parents major brands dot com\nAnd northeast delta dental keeping smiles healthy with a nationwide network of dentists learned more northeast delta dental dot com and the ... street group at Morgan Stanley helping clients create enduring financial value in a lasting impact sustainable investments solutions\nThe ... street group at Morgan Stanley dot com this is an H. B. R. say twenty four\nI this is Steve Inskeep from NPR News sometimes would basically like the world is full of bad news\nI'm afraid we cannot promised to bring your better news but we can't promise to bring you do that is better examined better explored better exploited we have to live up to some of the highest in most exacting standards in the world\nYours your wide range of interest and everything for Broadway to broadband gives us a lot to live up to and your financial support is what makes it possible so please help us continue to bring you the best become a member of today\nYou can do that at an age PR dot org ... an age PR dot O. R. G. or by calling eight eight eight eight oh five six four seven seven this is ... ... with Rebecca lavoy this morning about what's happening around your worlds up to the minute news and reporting from all over the country all over\nNew Hampshire as well that is while you listen to New Hampshire public radio sure source for the news that you need an HBO relies on you to help pay the bills you can do that when you do give us a call or get online and become a standing member and H. P. R. dot O. R. G.\nOne of the reasons why you rely on public radio to be your primary source for news is the measure delivery of stories whether they are sensational or whether they are really difficult like that story we just heard\nWell we got in that story we just heard about that incident with the police officers as we heard the facts we heard what happened\nWe heard what people on the ground were saying we heard the circumstances of the situation there that it's measured news coverage that is real journalism telling you what happened no speculation no hype no flashing headlines no partisan politics\nLiterally the fact if you support getting the facts from the journalists you rely on that is a real good reason to support this public radio station because that is our mission to bring you the facts to tell you what happened\nMake a gift right now of ten dollars a month or Fifteen dollars a month right now there is that dollar for dollar match on the table to help stretch your gift twice as far you can get that done so easily at N. H. P. R. dot\nOrg and sometimes we hear from people that ask why we need listener contributions since New Hampshire public radio does get some financial support from the federal government\nBut an age very successful because and receive support from a variety of sources you know from businesses and foundations that underwrite the station and you know a little bit from the federal government but it's very small percentage listeners make up the bulk of that funding in fact\nSo what matters is that you know image beer doesn't just rely on that one source for its ability to provide news do you realize that many sources with support from listeners at the top of that list so listen to support really is what drives this new service and it wouldn't be here otherwise you can become a first time member today\nUse your checking account of your credit card to become a standing member for ten dollars or twenty dollars a month at an age PR dot org\nHow about Fifteen dollars in my view if you choose Fifteen dollars a month we'll send you to thank you get those the awesome new\nOh New Hampshire public radio T shirt plus\nThe bright red really big really awesome coffee mug New Hampshire public radio it says on the front love worthy trustworthy it says on the back we'll send you both of those gets very gifted Fifteen dollars a month plus your gift will be matched\nDollar for dollar and you'll be entered into when that grand prize we're giving away tomorrow that trip of a lifetime to your choice of either Australia\nOr New Zealand so many reasons to make that Fifteen dollar a month gift right now plus it takes less than two minutes when you do it at an age P. R. dot org and of\nCourse you're paying for the service you rely on day in and day out fifty dollars a month what a value for all that you get from New Hampshire Public radio you know we're we're over inundated with information these days social media TV radio\nWeb sites of course but especially now you want more than just the headlines you want more just the information in what context you want measured reporting is Rebecca was saying earlier you want the facts and relevance and understanding\nThat's what you get from New Hampshire Public radio day in and day out and it's all thanks to sustaining listeners like you make that phone call right now get online right now become a sustaining member ten Fifteen twenty dollars a month\nAnd H. P. R. dot O. R. G. or eight eight eight eight oh five six four seven seven\nThey're less than thirty five hours remaining in an age PR it's fall member drives that means you less than thirty five hours to get in on the chance to win a grand prize drawing and it's one of the best grand prize dry we'd ever given away here in each PR giving away the trip\nFor two to your choice of either Australia or New Zealand and a dream destination that's like a bucket list place to go and\nThat trip could be yours you could be the one with a loved one or your kid or your family member or your college best friend in that airplane heading to Australia New Zealand\nCourtesy of your games to engage PR make the gift right now get your name and a half whether it's ten dollars a month or twenty dollars a month the choice is yours at N. H. P. R. dot\nOr your choices if you win where'd you go and who do you bring it would be a nice choice to make the yard or become a standing member of New Hampshire public radio get entered to win that trip there and H. P. R. dot org or eight eight eight eight oh five six four seven seven\nSupport for NPR comes from the station and from Amazon Prime video presenting the return of the men in the high castle for America's history is under siege but the resistance rises to fight for the world's they want the new season premieres this October on prime video\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life ups and downs\nBrown ... slash NPR and from visiting angels professional caregivers assisting adults in bathing dressing meals and light housework nationwide visiting angels America's Choice and senior home care office\nLocations are visiting angels dot com [noise]\nIt's eight forty and you're listening to MORNING EDITION on an age PR it is the year of the squirrel in New England they've never had so much fame or been the subject of so much attention it's partly because they've put themselves in the spotlight or in our headlights might be more accurate\nTheir populations boomed in recent years fed by a glut of acorns and now they're running across roads on math in search of more food the thing is all these squirrels aren't just affecting our highways and each ... has more\n... worth we can't even drive down the street without a memory of one of his jobs come to mind\nThis yellow unit here in\nFlying squirrels you rent a wildlife control company at Cain has brick house here ... through the bat and one was actually inside the house in the bathroom\nScore complaints makeup Seventy five percent of his business he recently had to hire another employee piece getting double the demand he had last year and that was double the year before\nThis daughter's pleasure I've taken bath squirrels dogs which are you\nToday we're in his white pickup headed to a call about ten miles south of Lebanon we pull into the driveway of a beautiful old brick house sun shining through the yellow and leaves of a giant maple outback Kara little the homeowner answers\nThe door so we've had recurring\nTold her flying squirrels ... book is that [noise]\nI don't what are the what the world is doing this year we have\nTons of them was outside forces\nPoints his by not killers up towards where the houses brick sides meet the roof he points out holes he can see leading straight into the addict\nPerfect access point for the rodents he says\nWhere are you hearing activities shooting I yeah I just I I heard a couple of nights ago didn't last night because they get really busy some nights she had her chatter chatter ... scamper\nWorth ... directs us inside for more inspection the climate stairs to the drop down doors to the attic he climbs through on a ladder Carol little weights anxiously below for word her face is now I Level with his boots things look pretty good up here he says then\n\nAll right so what you have here is on the outside wall was to at least three flying squirrels toilets\nFor the un initiated squirrels tend to use the same location repeatedly to do their business over time their feces and urine melt together and liquefy often forming a brown stain that will start to run down the wall force climbs down the ladder to explain more night and you got your your raft are\nBeing showing dogs in between three of them there there is an mhm\nFlying squirrels like bees he says are common in houses but they can be a big nuisance because they'll live there you are around to throw wires and can be tricky to get rid of\nCourse access for this house heat sealed the holes install a one way door for a period of time so the squirrels can get out but they can't get back in it'll cost about eight hundred dollars a little says she'll get over she takes him and we get back on the road\nTired of Scott Walker stayed oil control your call about a squirrel and your bathroom\nAlong the way it gets an urgent call from a woman nearby she had a flying squirrels soaring across her living room she thinks she has a trap now in her bathroom she just had a round of chemotherapy she says and she just doesn't have the bandwidth to deal with is worth ... he'll be right over there I'm straw\nWoman's house is small single story it's bright yellow surrounded by woods she shows us the bathroom at this point she's sealed the gaps in the door frame with a hazard arrangement of bed sheets and what looks like insulation phone\nYes for a second I squeeze ourselves inside and shut the door it's a small space painted baby blue\nSo what I spoke to someone going to jump show those can\nHe starts grabbing at hand towels moving the shower curtain back and forth to go through the cabinet checks behind the toilet but he's at a loss\nSuch as her window so houses\nHe decides to try one more place a deep built in shelf above the sink you actually have to climb up on the counter to reaches hands and first thing he encounters is a wig stored on a glass head he takes it out gingerly and rested on the sink and he reaches his arms back deeper all the way up to his elbow [noise]\nThis in a way that\nGo Mike ...\nHolds up the poor thing no bigger than my hand wrapped in a plastic bag it's gray and brown perfectly still with black whiskers in a white nose to lopsided teeth sticking out from the bottom of its mouth meanwhile in the living room lowest the homeowner is watching TV or he was in his bed [noise]\nAnd it is in the bed right now oh you're going to get rid of\nIt all out so the ... of their own\nAnd I had a\nReason to worry about the\nRole of government what I'm going to travel but a very hard to get him out of the bed and then to attract charges lawyer most that's okay\n[laughter] [laughter] [noise]\nLike loads a squirrel into a cage in the back of his truck and we hit the road over the course of the day he tells me again and again man is part of the wildlife management equation\nWhat he means as we're not victims but enablers we move into their habitat and build houses that are way better than the cold trees there used to and then if that weren't enough we set up birdfeeders outside learning\nAnd over time we leave open holes in our roofs and wall floors so they can climb right in\nA um a select women in my town and I'm active in the nation's so like all the people I Know in the nation's but people I Know in the town or all asking me to watch going on watch torn squirrels are like your moment yeah [laughter] yeah um the the squirrel philosopher but uh [laughter]\nHe says unless it's a real emergency adequate job like that bathroom situation is waiting list is now running many weeks long meanwhile the squirrel cause they're continuing to come in for an HP our news and breaching green [noise]\n\nSay forty seven and you're listening to MORNING EDITION on New Hampshire public radio where support comes from you our listeners [laughter]\nI'm from the New Hampshire charitable foundation helping generous in Hampshire people achieved their charitable goals more at any age CF dot org and the law firm of Donahue Tucker and shouldn't della offering legal representation to New Hampshire\nBusinesses individuals and municipalities with offices in Exeter fortunate and Meredith\nSupport for NPR comes from the station and from the Pew Charitable trusts markings Seventy years of non partisan research and data learn more at Pew trusts dot org slash Seventy\nFrom the Ford Foundation working with visionaries on the frontlines of social change worldwide to address inequality and all of the forums learned more at Ford Foundation dot org\nAnd from the John F. and James L nice foundation helping NPR advanced journalistic excellent in the digital age [noise]\n\nAnd the forecast for today we should've sun and clouds temperatures original low seventies in the south mid sixties in the north with passing showers possible in the late afternoon overnight around fifty and a bright seasonally cool friday is highest in the fifties and sixties the long holiday weekend begins with sunshine and temperatures in the sixties on Saturday [noise]\nThis is an age PR\nOr support comes from you our listeners from foreign I'm ... and hamsters on orchard made siders with bittersweet apples served with food or on its own filled in stores that New Hampshire liquor outlets state wide\nAnd the ... center proud to feature the boreal is ventures team village at the king challenged bike ride October ... to benefit individuals with brain injury details that king challenge dot org\nAnd the New Hampshire moose license plate program thanking drivers were helping to preserve the state's natural historical and cultural heritage online at ... dot com\n[noise]\nThis is Ira Glass of this American Life and an email came into our office this week from a listener urging me to make a phone call\n[noise] oh here's this David is growing\nDoes any suspicious he was totally right to be explained why was what this was all about so I got I got this", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Keene", "day": "04"}