{"month": "10", "state": "NH", "station": "WEVN", "content": "Guy but he EDS ... eighty eight point three W. E. V. H. Hanover Ninety One point three W ... killed nine point seven W. E. D. C. Koran when a seven point one that ... Jackson Ninety nine point five\nW. E. V. S. Holbrooke Ninety point three\nAnd W. E. V. cute little in Ninety One point nine and online at an H. P. R. dot org\nWho\nMorning secretary of state Mike Pompeo hail me to the leaders suspected of having a journalist Kelly the chief diplomat in meetings Saudi Arabia's king and ... ... It's MORNING EDITION from NPR News\nComing up how their reactions which I'm all for show genes disappearance is threatening Saudi business I'm Rachel Martin\nAnd I'm Steve Inskeep drug makers face a demand to disclose more information the Trump Administration wants them to put the list prices of their drugs and have\nAlso what happened when France received three months of rain in two hours and we have a story of protests during the national anthem to Olympic athletes lost their medals for raising their fists fifty years ago and I do\nIt's Tuesday October sixteen the singer John manners forty one years\nAnd the news is next\nLive from NPR News in Washington I'm Dave ...\nSecretary of state Mike Pompeo was in Saudi Arabia for talks with king selmont in Riyadh at issue the disappearance of Saudi journalist ... he was last seen entering the Saudi consulate in is simple two weeks ago Turkish officials say they fear to show gee was killed in later dismembered inside the consulate\nA Turkish forensics team spent time inside the building earlier today defense secretary Jim Mattis says it's important to get the matter resolved the\nImplications of everything going on [noise]\nExtend far beyond our defense for life [noise]\nThe president and the secretary of state park currently dealing with this year to Spanish\nSpeaking to reporters in Vietnam showed gee what has written extensively for the Washington Post and has been critical of Saudi Arabia is wrong\nPreliminary tests on a threatening letters sent to the home of Maine Senator Susan Collins indicate there's no threat to the public a note with the letter claim beyond full of contained the poison rice and\nRelief efforts are continuing in the Florida Panhandle in the aftermath of hurricane Michael ... with member station WFSU as more\nCrossroads academy a charter school in Quincy, Florida outside Tallahassee remains closed but students and teachers are here distributing hot meals and food to the community you know people's is here eating with her son and daughter she says the storm was\nTerrible it was terrible [laughter] watching how the wind was blowing and we're making all of a single drop them home and everything and I will watch now the tri ...\nDefine everywhere crews are working around the clock but officials say could be anywhere from weeks to months before cleanup efforts are complete talk when electric hopes to restore power to most Quincy residents by friday but the hardest hit areas could be in the dark for two weeks or longer for NPR News I'm Shawn okay he in Tallahassee\nA head of tomorrow's Brexit summit in Belgium senior officials with the European Union or expressing doubts about the prospects for a breakthrough in talks with Britain the BBC's Gavin lay has more from Brussels\nHuman is is arriving here this morning went into a brief that leaders who will then decide tomorrow whether or not there is sufficient agreement to Kona special breakfast some is in November\nTo finalize a devote steel Austrians foreign minister Karen ... has said European governments are waiting in suspense of Britain's next move up to ... to hold on Sunday night because of the failure to make a breakthrough on the issue of avoiding customs checks on the Irish vote to\nSeveral senior U.S officials have told the BBC that have breakthrough it this week some it is still possible but the expectation that would be the moment of truth for breaks it was no them all\nAt the BBC's Gavin lady reporting from Brussels [noise] this is NPR News from Washington\n\nIn major league baseball game three of the American league championship series shifts to Houston tonight the Astros host the Boston Red Sox with a series tied to the game of peace\nIn the national league championship series the Milwaukee Brewers lead the Los Angeles Dodgers two games to one last night Milwaukee beat the Dodgers for nothing in LA game for is tonight again in Los Angeles the winners of the championships series advance to baseball's World Series\nABC debuts its sitcom Connors tonight it's a spin off of the networks former top rated show Roseanne\nNPR's Mandalit del Barco says the cast of ... does not include comedian Roseanne Barr\nThe network isn't giving away any spoilers about what happened to the matriarch of the con our family but just like the original Roseanne show her TV family includes actress John Goodman Sarah Gilbert and Laurie Metcalf\nEven noticed how much better the flow is between the freighter in the sink the\nConnors is a re booed of a re booed at the Nineteen nineties popular sitcom Roseanne when it debuted last year bars character with back as a Trump supporter inmate Disney ABC quickly canceled that series and fired bar after she went on what was seen as a racist Twitter rant about former Obama White house adviser Valerie Jarrett\nThe comedian apologize for making a bad joke ABC agreed to salvage the TV family without bars character ... NPR News\nStocks in Asia end of the day mostly higher they fell in Shanghai after China reported inflation and its economy rose for a fourth\nConsecutive months I'm Dave ... NPR News in Washington\nFor NPR comes from NPR stations other contributors include them Melville charitable trust driven by one goal ending homelessness for good learn more online at ... build trust\nSupport for any ... life's dream comes from you our listeners and from Congress regional visiting nurse association\nA home health in hospice agency serving people of all ages and more than forty one communities discover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nDid it the RV an A. dot org\nMostly sunny\nBreezy Wendy highs me upper forties and the north country fifties so partly cloudy tonight the winds diminish flows in the thirties and then Wednesday\nPartly the most ... is a chance but afternoon shower\nPretty would be some snow showers mixed in with a high terrain to the north ties in the forties or fifties to our\nWeather is changing in\nSports Red Sox his crew sales been released from the hospital he rejects they'll rejoined the team in Houston for game three American League championship series later today\nGame gets underway after five o'clock in\nThe NBA season gets underway tonight and the Celtics host the Philadelphia Seventy Sixers about the garden in Boston\nFor for an HBO comes from you our listeners that from diversions puzzle games committed offering fun social and technology free ways to connect one hundred twenty three Congress street Portsmouth and diversions games dot com [noise]\nAnd our age Irving homebuilders building homes whose total annual power and heat load can be generated by solar panels on the roof or more are HR being home builders I've got\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin in President Trump's top diplomat is managing an exceptionally delicate situation\nSecretary of state Mike Pompeo arrived today in Riyadh Saudi Arabia let's remember Saturday leaders are suspected of having a journalist murdered ... cars show she lived in the United states and wrote for the Washington Post was last seen in Turkey President Trump responded to that disappearance by sending his top diplomat we want to find\nOut what happened and he's got instructions to find out what happened was talking about the whole situation with Saudi Arabia bought\nPresident Trump is already signaled which way he may be leaning he said Saudi Arabia's king called denied any involvement and President Trump also spread a conspiracy theory with no evidence that rogue killers might be responsible\nFor the presidential remark may have foreshadowed a new explanation by Saudi Arabia NPR's Peter Kenyon joins Peter Kenyon rather joined us from ... where ... was last seen a Peter I want to start with what is happening right now in the investigation in Turkey\nWill in Turkey there was a search finally of the Saudi constantly at some Thirteen Days after ... disappearance\nAnd this was a surge to the Turkish authorities have been talking about for several days but only last night did they get in there and they were with Saudi investigators at the same time there's they came out about nine hours later no word yet on what they found a they did reportedly collect some samples that there'll be looking at\nA there is being reported in Turkish pro government media a bit of anger as well uh this is because there was a photo circulated yesterday hours before the surge began\nOf cleaning crew brain ushered into the Saudi consulate pushing their equipment right past this crowd of reporters waiting outside or what they were asked to clean isn't clear whether it has any bearing on this will have to wait and see\nSo how does that fit into the new theory that's being postulated about what could have happened to ... G because up up till now the Saudis have said they have no idea what happened to the journalist ... that could be changing\nFilings document retrieval and you see see surgery on then to conquer church dot net\nRanchers community colleges brings kill the graduate every region of the state in high demand fields C. C. F. N. dot edu\nI'm more interested in exchange for him but the Democratic and Republican nominees from New Hampshire second congressional district\nDemocrat immigrants after receiving a fourth term in Congress Republican Steve New ground is a state lawmaker businessmen and veterans recover many issues including the economy immigration any harm and you send your questions to exchange it any doors and joined us when he lived nine seven piano on any piano [noise]\nThat resource the state's largest electric utility reporting about seven thousand plus customers about power this morning gusty winds overnight is causing some outages scattered throughout the state\nIt will be mostly sunny today but it will stay windy for a while I was in the upper forties minority fifty itself partly cloudy tonight the winds will diminish temperatures in the thirties Wednesday looks probably the most exotic maybe your shower late in the day temperatures in the forties and fifties now five Twenty one this is an HP are\n[noise]\nSupport for NPR comes from this patient from Heather started Kagan poll gee Hagen supporting African wildlife foundation working to ensure wildlife and wild lands thriving modern African\nLearn more at age W. S. dot or\nFrom the ... foundation dedicated to the idea that people can live in harmony with one another and the natural world\nLearn more about our partners at ark is found\nThe John D and Catherine T MacArthur Foundation\nRecognizing exceptionally creative individual\nThis year's MacArthur fellows ten more information or at max found dot org [noise]\nI'm from the Robert Wood Johnson Foundation uh R. W. J. F. dot org\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed rivers into raging torrent wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nFlying in a helicopter over the old river in southeastern France a reporter from the F MTV points out villages Rosen fields underwater you can see cars and trucks floating like toys in a bass\nDuring the night Sunday Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun was sweat from her ground floor room when the floodwaters crashed through the confidence front door\nHer furniture was carried out onto a veranda the nuns body was later found in the trees outside\nMovie they sound Ninety nine year old ... such a faith because her bedroom is on the second floor and she\nSpoke on French television again just to rip up to ... I wanted to come downstairs but water was coming up the staircase so I just went back to bed she said and what else could I Do go on ... how many how many\n... says never in her life has she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger\nIs rising\nThat's so not only do\nWe weren't given any warning that this group of people meeting with a local mayor\nYou couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea or regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... is the mayor of habit which lost six people he says they did everything they could\nShoot him because he didn't come up from the rainfall was three times what it was predicted and he says and the sudden violence of these waters was terrifying we're dealing with the dream situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley NPR News Paris\n[noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track fans anticipated in a special you're starting to hundred meter rich\n\nBut it was what happened after the race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports or Nineteen sixty eight\nNineteen sixty eight was a tumultuous year around the globe and Mexico City was new exception the games begin and tumult because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was washed from the street and the games begin soon after\nIt was in the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City\nThey had a plan they were going to protest racism and injustice on the world stage in an oral history for the library of Congress\nLuther King just before king was killed [noise] king's vision of how effective a non violent Olympic protest could be left a lasting impression\nI Want to do and there will be sold Paul ... is an earth and you're still in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold setting another world record as they walk to the Olympic podium people notice both of them were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the flex began to rise Smith and Carlos belt their heads and raise their black gloved fists in the air years later talking to ABC Australia TV Australian Peter Norman the silver medalists to share the podium with Smith and Carlos recalled the moment the rise to um [noise]\nThe claims paying\nA was a symbol of unity with the news coming together and assume was spring [noise]\nIt was never on the unbelievable was able to me is threatening to\nExactly how it was taken by many aftershocks silence the stadium filled with booze the photo of the race this loop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\n... we're going to leave the Olympic Village I'm Mexico within forty eight hours they were both stunned by the decision but regarding the composure\nBoth men were stripped of their medals they got hate mail in death threats they wish on for decades in the U. S. for their silent gesture many black Americans thought Smith and Carlos were heroes though there are braced this became a symbol of refusal to give into racial injustice the precursor to taking a knee\nSan jose State University professor Steven known or teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nUnder the students there soon as they saw Tommy and job walking toward the podium and for the rest of the decade the raised taxes indicated the unity and the determination and the real appreciation for Smith and Carlos\nBut there was a cost to those principles for years both men struggle to find good jobs their marriages suffered\nTheir children were bullied at school employers shied away from them\nSmith and Carlos were banned from Olympic participation for life to live with that I don't want to go to number I had to talk of the Los Angeles public library in June John Carlos says he realized he was an Olympic presence even in his absence ... showed up in art work at the games in Munich in Melbourne\nA huge statue of him and Smith at San jose state is a much visited tourist attraction earlier this year Tommie Smith told DWI news higher authority inspired the moment\nWho was finally justified in the ... of a young black athletes who were hopeful for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrated and into designate this happened\nTo the recipient of the audacity of wars and terrorists and Tommie Smith\nVindication last Karen Grigsby Bates NPR News [noise]\nIt's NPR news [noise]\nHey there is Joshua Johnson the host of one day on any PR were bringing the show to New Hampshire can't wait for you to join the conversation ... distinguished panel of guests through a special discussion about issues that matter\nCapitals Center for the arts in town for on Thursday get your tickets right now at the the A. N. H. dot com see their\nDisadvantage sponsored in part by New England employee benefits company and McLean Middleton [noise]\nSupport for an age PR comes from you our listeners colonial theater in Bethlehem presenting the moment to film about the origin of free ride mountain biking October nineteenth and seven thirty PM Bethlehem colonial dot org [noise]\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamonds C. E. O. J. P. Morgan Chase has said he won't attend again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the ... disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince are making companies nervous says Kirkegaard he says remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them\nI'd on corruption charges and force them to pay the government as much as a hundred billion dollars\nI mean he basically sends the signal that the rule of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly send them\nBut Karen young a resident scholar at the American Enterprise Institute says U.S companies whose snow but the Saudis will likely pay a price because the Saudis will take it personally\nThe decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn its back on the Saudi Government as a partner will not be forgotten about the Saudis\nYoung says it could be two decades before the Saudis will re engage with these companies young also says us sanctions against the Saudis could be tricky\nThere's lots of Saudi money in us tech real estate and stock market she says and the Saudis on lots of US government bonds not to mention the country's key role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\n\nThis is NPR News\nNot five forty two you're listening to an HP aren't [noise] last year the ... fire destroyed thousands of homes\nIn California it was exploding at a rate that I would've never imagine you couldn't actually make out individual homes inherent just like an entire wall of fire\nNow some residents of rebuilding and those same areas even though the risk of fire remains [noise] more than that next on MORNING edition and [noise]\n\nI guess to an HP are the are they plan is a wonderful legacy to leave for those who need a trusted source for news Hi I'm Sarah Alger director of nature and plant gifts for an HBO at any age PR it's inspired you to learn more about your state and your world so to wear your legacy gift inspire future generations email me\nAs the algae add an H. B. R. dot org and to learn more about including an HP are in your state plants or go to an H. B. R. dot gift plans dot org [noise]\nSupport for an HP arm comes from you our listeners and the root of group serving successful families and businesses with sophisticated planning an investment management firm for thirty five years by UPS financial services member ... sit back [noise]\nIn New Hampshire school administrators association representing school superintendent and administrators championing the education of children every day and age S. A. dot org [noise]\nIf you can't catch the exchange in the morning or you've got a standing arrangement that keeps you from checking in with word of mouth and other shows on the weekend you can subscribe to any fears podcast you can listen when it's convenient for you\nFind a complete list of our news and information podcast set\nAn H. P. R. dot org [noise]\nVery gusty winds overnight cousin power outages scattered around the state\nWill be mostly sunny windy today ties the upper forties and fifties\nTwins diminished tonight turning partly cloudy with those in the thirties and Wednesday looks partly the most exotic maybe an afternoon shower maybe it snow shower for the north country of mountains\nSupport for NPR comes from the station\nAnd from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller is working to\nOur jobs and resilient city\nSound dot org [noise]\nAnd from ask Jacey\nThe foundation of donor advised fun\nWorking to maximize the impact of charitable giving and to create customized philanthropic solutions\nJ. C. dot org [noise]\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep\nAnd I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California now despite the risks some are rebuilding in those very same areas from member station KCPW Judy and NPR's energy environment and environment team or several reports\nIt was late at night a year ago when ... was called in to work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the tops fire was moving fast\nIt was exploding at a rate that I Would have never imagine would occur\nHours later he drove past his neighborhood\nYou could actually make out individual homes in heritage is looked like an entire wall of fire and then realized right away that\n... gone lowenthal has spent the last year picking up the pieces\nAnd a crucial question came up for him and thousands of others should they rebuilt in California wildfire it's a fact of life the Thomas Fire with a repeat of a fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nBut honestly it also added a lot to do my daughter this is where we were before the fires in the world want to be up to the fires [noise]\nNow the drywall is just about to go up at his new house\nIt appears that don't really moving as quickly as you'd like to do but yeah you still knows the on the side\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof decide and things of that nature um it's definitely a stuff that I wanted to\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loan does house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa's director of planning David ... about that\nWe don't have a an an extra set of rules are are requirements that we put on people um to to rebuild\nGiven says legally the city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that's not to the role of a city\nPlus the the housing shortage is even worse now\nWe need to walk and chew gum at the same time we're going to rebuild our communities fast and quickly officially as we possibly can but we also have to build new homes as fast as we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the hills right where the fire swept through\nSo this is the forty acre parcel of where they want to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top as I'm standing there after turning off my recorder imam comes up to me because I'm looking at the sign for the development and said I definitely wouldn't want to live there [noise]\nHe didn't want me to record that's\nIn February the city council debated this project\nTo public hearing around ... village project\nSome members light at the town home to be fire resistant and create much needed house\nJulie combs had doubts I just think we need to put more sleeping people in a fire hazard area combs was the only no vote and I know\nI've heard stories of flooding along the Mississippi and thought why did they keep rebuilding their\nShe says some insurance policies pay people less if they don't rebuild and the same place or they just can't afford to allow swear and the city doesn't have a way to bite people out and some don't want to go\nI think that in a disaster there's such a strong emotional pull to get what you lost back\nThat poll means it's the hardest time to make tough decisions about the future for NPR News I'm Lauren Sommer in San Francisco and you'll hear lower and reporting on MORNING EDITION from NPR News\n... not the point seven W. E. V. C. gar I'm One of seven point one W. E. D. J. Jackson Ninety nine point five that you eat the F ... Ninety point to me and\nW. E. B. Q. little to Ninety One point nine and online at an H. P. R. dot org\nMorning nearly weeks as hurricane Michael made landfall on the Florida Panhandle and many of those who are still there no power while others who evacuated kick it back in ... It's MORNING EDITION from an HBO [noise]\nLawrence joins us by from the\nWith details and the recovery effort there I'm Rick gambling with Steve Inskeep and Rachel Martin several thousand granted state or is it working\nI was caused scattered outages across the region will hear the forecast us secretary of state Mike Pompeo was in Saudi Arabia to the Saudi regime was accused of murdering a journalist President Trump says it could be votes Rogan killers\nThis hour we'll explore the arms deal between the U.S and the king of the new poll shows that are two issues motivating rural American voters this year drug addiction and the economy about boats Tuesday it's October ... [noise]\nThe news is next\nLive from NPR News in Washington I'm more of a Coleman hurricane cleanup continues along the Florida Panhandle the death toll across several states remains at Seventeen people but dozens of other people are still missing and rescue teams and loved ones are continuing to search for them\nNPR's Hansi Lo Wang reports tens of thousands of homes are still without power\nUtility companies are scrambling to repair downed power lines across the region Florida governor Rick Scott has been sending extra cruise to help my clearing debris from roads officials are warning residents devoid touching downed wires run Florida's panhandle hundreds of families now without homes are continuing to shelter in schools and community centers\nHundreds of National Guard members from Florida and other states are helping to lead search and rescue efforts and Bain Gulf counties to the areas hit hardest by hurricane Michael ... NPR News Destin, Florida\nSecretary of state Mike Pompeo has met with Saudi Arabian king cell man to discuss the disappearance of Saudi journalist ... turkey believes he was killed after entering a Saudi consulate the king Solomon has told President Trump he has no knowledge of ... fate\nHowever media reports suggest that Saudi Arabia is considering whether to announce that show because he was killed as the result of an interrogation gone wrong\nNPR has not confirmed these reports meanwhile Google has canceled plans to attend an investment conference in Saudi Arabia as NPR's Emily Sullivan reports the cancellation\nIs the latest pressure placed on Saudi Arabia since ... a critic of Saudi policies was last seen entering the U.S consulate in Istanbul earlier this month the Turkish government alleges he was killed\nPresident Trump has threatened sanctions that the Saudi royal court is behind the show 'cause she's disappearance the Saudis said retaliate even further Google Cloud C. E. O. Diane green has an offer to reason for her cancellation the company said earlier this year it would open five innovation hubs in the kingdom\nOther prominent companies have also pulled out of that investment summit including over in J. P. Morgan last year's conference generated lots of excitement about doing business in Saudi Arabia Emily Sullivan NPR News\nHarvard's top admissions official will face more questions today as the trial over the school's admissions policies continues for a second day from member station WBFO you are in Boston Sherry young reports that the plaintiffs are trying to prove the school is discriminating against Asian Americans attorneys with students\nFor fair admissions that group that filed the lawsuit are expected to continue walking through the fine details of Harvard's admissions process there'll be reviewing officer handbook instructions and statistical analysis of application records\nThe plaintiffs say Harvard uses an unfairly biased formula that puts Asian American applicants at a disadvantage\nCarry young reporting you're listening to NPR News\nYou know six so far this is an age PR News I'm Rick ... state police where we're at the scene of a death of a man in Greenland yesterday in Hampshire attorney general in state police major crime you to and are investigating the untimely death police were called to the home Monday morning the attorney general's office of the investigation is ongoing as no threat to the ...\nCandidate running for first congressional district picked up a big endorsement Monday and they spirits Sarah Gibson has more\nHouse speaker and Republican leader Paul Ryan has endorsed Eddie Edwards who is running against ... for the seat vacated by democratic congresswoman Carol Shea Porter\nRyan said in a statement that Edwards will be quote a voice for commonsense policies are smaller and more efficient government and ideas that expand economic opportunity throughout the Granite State\nRyan is retiring from office this year but in the meantime he's traveling the country to campaign for Republican candidates in swing district for any guarantees I'm Sarah ... Epps an\nHampshire's department of health and Human Services is preparing its next for your plan on aging and wants to hear from older residents and HBO or as Robert grew up as more on that\nThe bureau of elderly in adult services will hold Thirteen listening sessions across the state it's also asking seniors to complete an online survey bureau chief windy Altman says well she's seen an increase in family members need support to care for the state's aging population there's also a reverse demand\nMore and more we are helping and engaging land and grand parents who are now full time caregiver for grandchildren\nShe says the state struggle with opioid addiction is one factor in that the plan December twenty ninth team London hampered receive federal money that funds things like delivering meals and in home care for an HP our News I'm Robert grow the\nSports Red Sox says Chris ... has been released from a hospital bill rejoined the team in Houston before game three of the American league championship series later today is illness was announced by the team during game to Sunday night when the socks want even the series\nManager Alex courses everything's fine but wants to see how seal feels before determining when he'll pitch again\nSucks and Astros would begin game three later this afternoon the NBA season gets underway tonight when the Celtics host the Philadelphia Seventy Sixers had the garden in Boston it's an eastern conference playoff rematch Boston ousted Philadelphia in five games last season and both teams are expected to make deep runs this season\nForecast mostly sunny today windy pies in the upper forties more than fifty south wins diminished tonight will be partly cloudy but blows in the thirties Wednesday partly to mostly cloudy there's a chance for an afternoon shower maybe some snow showers and the high terrain highs and the forties and lower fifties\nSupport for H. P. R. comes from you our listeners and ... piper Adelson and Kramer PC providing experienced legal guidance and collaboration\nWith businesses and individuals throughout New Hampshire learned more perimeter dot com\nAnd the colonial veteran keen visiting Engelberg property Thursday October Eighteenth\nTickets to the colonial dot [noise]\nSupport for NPR comes from a milk it companies that delivers semi pressed me to be finished at home in Fifteen minutes with one paying ... do the prep work like chopping marinating this week's menu is at ... dot com slash NPR\nAnd Americans for the yard [noise]\nSix or seven this is an HBO ... good morning [noise]\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing well\nMean there were a their trees down everywhere these towering pine trees that are just snapped over at the middle of some of the communities along the water and they've been they've been flat and then I Know people so to say that word or they try to describe it mostly uh people down\nSupport for any ... life's dream comes from you our listeners and from Congress regional visiting nurse association\nA home health in hospice agency serving people of all ages more than forty one communities discover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nDid it the RV an A. dot org\nSee what was a house in what was a vacant lot I'm so in those communities there are people are really asking how\nCan you rebuild that's talking about like Mexico yeah\nYeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of others that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shop do you see widespread damage up and down the coast\nAnd everywhere in this in this a swath dozens of miles and miles wide you can see that the storm just tore straight up I'm for miles and miles all the way to Georgia really are and you see these trees down live oak trees that are very old it looks like someone who just\nTwist at the top off like a you know breaking off the top of a flower or so the destruction it sort of like a two and some people told me it was like a tornado inside a hurricane and some places it drop one house\nAnd the twelve year old black New England conference and awards dinner at UNH has to cover Nineteen twenty of\nBritish version of cola Doug ... CD [noise]\nHardin a fry has included an HP our inner ...\nIt may not be the biggest trust but I Want to be able to pay back what I feel I've received so people coming after me will be able to enjoy that\nLeaving it gets to an each PR isn't inspired way to support an organization than than the rich your life and that of others in your community to learn more about including an HP are in your state plans to go to an H. P. R. dot gets plans dot org\nGusty winds overnight have knocked out power to ... thousand people across the Granite State money\nWill be mostly sunny today but the wind will continue for a while I was in the upper forties north and fifty south would advisory North Country birthday party tonight temperatures in the thirties Wednesday looks partly the most ... afternoon showers ... lives in the forties or fifties tomorrow\nNo six Twenty one this is an HBO ...\n\nSupport for NPR comes from the station and from PBS wouldn't be eugenics crusade American Experience explores the history of the early twentieth century campaign to breed better American race eugenics crusade tonight at nine eastern on PBS\nFrom western hotels and resorts Weston is committed to the wellbeing of travelers offerings like heavenly beds super foods are ex menu and gear lending for when we're ... years left behind at home [noise]\nWest and floods rise learn more western dot com\nAnd from the financial services firm of Raymond James offering personalized wealth management advice in banking capital markets expertise\nAlong with a legacy of putting clients financial wellbeing first learned more Raymond James dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy ... according to a new poll that is what is on the minds of rural voters as they go to the polls this election season the poll was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the troubles that face some rural communities income Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nAnd his dad that bring the black lung and having a real hard problem where they thought it was time for him to come out anyway\nAnd drug addiction has hit her family especially her two grandsons hard\nMy daughter and her husband\nUm got Keith on and walked off color because they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her in her home a lie [noise] September\n[noise] [noise]\nShe was thirty three years old she left behind three boys\nBrenda NPR's not using her last name to shield her grandchildren lives in Coburn Virginia a town of about two thousand people near the point where Virginia meets Kentucky and Tennessee her experience fits into the findings are new poll which showed that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis would react if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf he were to approach can families\nGive them a piece of paper and have you had someone in your immediate family owned her eight out of hand with ...\n... says in Coburn jobs and opportunities have dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf you come out of college with a degree uh you're more than likely going to leave this area to find work\nBut experiences in rural America very widely in our poll bears that out the survey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done the pulled them out of these economic problems they face\nWhile some rural communities are suffering others are thriving says Christopher Thor and burn the founder of beacon economics and Los Angeles\nWho might have a cold town and an oil town or the coal town is doing terrible because coal can't compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on ... oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says that killed Powell\nAlone hum of its own\nTalents to twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost like a turban on this starting to expand fall and bigger restaurants are being put her now within the past two years we really do believe\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them it was twenty six hundred dollars we ... we're all in one year so there's good people get hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win the series and Dodgers fans will insist on the yes\nIf they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\nThe ring [laughter]\nThat is the voice of Bob euchre one of baseball's great voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do was playing career started there in sixty too\nLong ago you could start in an ad were an usher and removes him from his good seat at a ballgame must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching you want to explain to Johnny Carson his technique for handling the knuckleball\nThe easiest way to catch it was to wait until it stopped role in and just pick it up\n[laughter] it's like ... he earned him a role as a play by play announcer in the film major league in his most famous line of the movie he said this to the radio audience\nThe ... by about a city block\nThe sun this season though he's been enjoying real brewers success there's video of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head of course here is reacting tweet Fox Sports Wisconsin report\nAbout what may seem\nWell they're all they're always there is no eyes and ears and [noise] I mean to be treated me treated like one on one of them all the time [noise] I think that special for me\nRemember there is no high euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles [noise]\n\nIt's NPR news\nA record number of openly el G. P. T. Q. candidates are on the ballot this November what we're\nDoing I think is bigger than we realize oftentimes impact we're having on young people is more significant deeper than we can conceive\nI'm Ari Shapiro around table of algae BP cue candidate plus the secretary of state visit to Saudi Arabia this afternoon on all things considered from NPR News [noise] all things considered we dance to news between four and six here on an HP our news from NPR's an HBO straight ahead support for the hamster public\nStarting with Hitchcock is here\nPresident with a conservation group\nIf we had in front of our allies leading the house of representatives they could do badly needed oversight on the minister Asians effort to cater to poll leaders every day over our communities\nThat word oversight is one you hear a lot from Democrats in part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example or to crack down on methane emissions but they can force him to explain himself\nArizona congressman role ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past the part of the Trump Administration that the independent and that they have responsibility is co equals for oversight and accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a step back for the administration\nAnd they will be able to tie them up mercilessly so that they would kinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane and to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigations in hearings around the methane rural and clean power plant and they think car rules you're going to be seeing I look more in debt at conflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut that when President Obama was elected in two thousand eight we were able to move back legislative agenda because we had spent the last two years developing it\nNo of course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda Nathan Rott NPR News\nAnd later today on all things considered the outcome of the mid term elections could also have a major effect on the future of U.S policy it can listen to that story by asking your smart speaker to play NPR or your local member station by name [noise]\nThis is NPR News this is an age PR\nSocial scientist says some portion of people's political leanings come from an unlikely source ...\nFrom this one cause any controversy that story coming up in the next few minutes here on MORNING EDITION from an age ...\nI'm more into the any change for him but the Democratic and Republican nominees when you have second rational district Democrat in Lancaster is seeking a fourth term in Congress Republicans eating the grounds of the Islamic businessmen and that will cover many issues including the economy immigration and the environment\nIt gives the doors and joined that this is only lived nine and seven pm on any piano [noise]\nSupport for an age PR does come from you our listeners and UNH in Manchester hosting an open house on October twenty campus tours available to explore degree programs and learn about financial aid Manchester dog UNH dot edu slash open house\nAnd white man to oil and propane north Conway and Lincoln keeping homes and businesses warm in the White Mountains lakes region in western me for three generations [noise]\nNPR's popular current affairs program one day is coming to New Hampshire this Thursday you can join host Joshua Johnson at the Capitol Center for the arts in Concord seven PM see moderate to special panel just get your tickets now for the event at C. C. A. N. H. dot com [noise]\nMm gusty winds today will continue for a while to be mostly sunny temperatures in the upper forties in the north country fifties so\nWhat's your diminished by tonight partly cloudy overnight lows in the thirties state wide mostly it looks probably the most exotic as a chance for an afternoon show our eyes in the forties and lower fifties [noise]\n\nStates pleasure utilities reporting several thousand power outages because those wind gusts overnight [noise]\nSix forty five this is an HP arm [noise]\nMm [noise]\nSupport for NPR comes from this station and from Amazon Web services used by millions of customers a W s provides a range of cloud services and functionality from tools to security compliant more information it build on dot W. S.\nAnd from T Rowe price offering a strategic investing approach that examines investment opportunities firsthand institutions advisors employers and individuals choose the right price [noise]\nT Rowe price invest with confidence [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz here's your quiz master Noel King it comes from political scientist John ... at the University of Nebraska he's going to describe two towns and you have to guess which one is liberal and which is conservative huge number one\nThe schools with stress patriotism and respect and it would be a very rules based on educational system but how is this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode or the town of be quiet with lots of churches\nAlright and here is ten number two\nThe schools would be based more on experience for all kinds of things rather than than rote memory people would prefer older houses with wooden floors or rather than wall to wall carpeting um they would keep the yards natural um lots of bars and community theaters and foreign films are more of those than churches\nThis quiz was probably pretty easy for you and to explain why we're joined now by NPR's social science correspondent Shankar Vedantam Hi center I Know so the first time I'm guessing was conservative and the second one was ... right\nNot hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer author and rules liberals prefer exponential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hitting and others are asking is how companies stereotypes\nLiberal and conservative is all about our political views how come these labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we left\nTo where we want to hang out so he is arguing that our political views spring from something deeper than just our beliefs about big government or small government\nPrecisely he's arguing that our political preferences at least in part\nCome from a psychological and biological predisposition the most compelling evidence for this comes from studies involving large numbers of twins some of whom are identical and some of whom are fraternal identical twins share the same genes fraternal twins share fewer genes\nIdentical twins turn out to have more political preferences in common than fraternal twins do even though each twin ... presumably share the same family and upbringing\nHeight for example turns out to be about eighty percent a heritable when you're subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology yes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously is you know fifty sixty Seventy percent that comes from the environment so all we're saying is that that genetic component is not zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues are saying is that biology and psychology play a role in our political preferences snow liberals and conservatives in the United states often accused one another or stupidity or malice but it's hitting and his colleagues outright one reason we might not see the world the same way is because we simply not lie at\nThe same way that is a nice way of looking at it indeed offer some compassion for the other side sinker right down to miss hosted the hidden brain podcast where you can learn more about how psychology Shapes Our political views thanks center thank you know [noise]\nSupport for hidden brain coming from zoom zoom offers cloud video conferencing online meetings and a video conference\nRoom solution in one form featuring digital video and audio screen sharing account registration and more at zoom dot US [noise]\n\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin ... with the producer Mary American sorry Mm\nWCBS Nashua eighty eight point three\nW. E. V. H. Hanover Ninety One point three W. E. V. in Keene Ninety point seven WABC Gore them one o seven point one W. E. D. J. Jackson Ninety nine point five\nW. E. D. F Colbert Ninety point three\nAnd W. E. B. Q. little to Ninety One point nine and online at any age P. R. dot org\nWho good morning secretary of state Mike Pompeo meets with the leaders suspected of having a journalist killed which you might as meaning Saudi Arabia's king and crown prince It's MORNING EDITION from an HBO [noise]\nComing up our reaction is threatening Saudi business ... with Rachel Martin in Steven's drug makers face or demand to disclose more information the Trump Administration wants them to put their list prices of the drugs and that also what happened when France received three months of rain in to our [noise]\nAnd we have a story of protest during the national anthem two a month ago they lost their mental through Memphis fifty years ago\nHere in New Hampshire group convened by governor Sununu to study whether schools should start after Labor Day is meeting for the first time today because of the save our summer series record a border It's Tuesday October sixteen [noise]\nThe news and windy forecast next\nLive from NPR News in Washington encore of a Coleman authorities in the U.S southeast say at least Seventeen people have been killed because of hurricane Michael but dozens of others still remain missing there are areas where there's no cell phone service especially in the Florida Panhandle that's where the storm made landfall so people cannot check on their loved ones\nNPR's Quil Lawrence is in the Florida Panhandle\nThere are Eighteen shelters in Florida alone and hundreds of people are still living in those\nOthers are having to start finding contractors or get insurance claims filed or trying to get help from from FEMA trying to get their roofs covered up with ... so that if it rains it will cause more damage than what already happened in the storm NPR's\nQuil Lawrence secretary of state Mike Pompeo has met with Saudi Arabian kinks out man in Riyadh they're discussing the fate of Saudi journalist ... 'cause she feared murdered\nNews reports suggest the Saudi Government is considering saying he died in an interrogation gone wrong NPR has not confirmed these reports\nRural Americans are as concerned about drug addiction as they are about the economy NPR's Alison Kodjak reports on a new poll from NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nPoll shows that about a quarter of the people living in rural areas said drug addiction or abuse is the biggest problem facing their communities that's about the same share that side of the economy is their biggest worry\nThose two categories overwhelmed all the other responses in the survey of Thirteen hundred people who live in rural areas but even with those worries people say they have a positive outlook about their future ...\nSchool who directed the pole in terms of the future at least half of people are quite optimistic\nMost of the people who responded to the survey said they are doing better than their parents and the majority said they expect their kids to do even better Alison Kodjak NPR News\nI'm a federal judge has dismissed a lawsuit against President Trump from adult film actress Stormy Daniels shape claimed the president had deep fainter earlier this year on Twitter NPR's Jessica Taylor has more\nGain sued over a tweet Trump sent in April thing Daniels was lying about being threatened getting twenty eleven\nNot to go public with their story of an alleged sexual encounter with Trump\nBut in his ruling the federal judge wrote that the tweets quote constitutes rhetorical hyperbole normally associated with politics and public discourse in the United states\nThat is protected by the first amendment in a statement and Trump's attorney called this a total victory for the president gave his lawyer Michael ... they would appeal the ruling and the other legal action over a nondisclosure agreement Daniels signed would proceed Trump has denied any sexual encounter with Daniels\nBut did finally and met you'll be embracing his lawyer for a hundred and thirty thousand dollar payment to Daniel's on the eve of the twenty sixteen election\nJessica Taylor NPR News Washington You're listening to NPR News\nI'm Rick ... with an H. P. R. news thousands of New Hampshire residents were without power this morning strong winds were blowing through the Granite State every source the state's largest utility is reporting over six thousand outages of this hour in eastern and southern a hamster primarily the school's over twelve hundred customers and the Dover area\nA group convened by governor Crist's so new to study whether schools should start after Labor Day is meeting for the first time today\nIn August the governor issue they save our summers executive order calling for a commission to study the impacts of a later start date the commission's newly named chair is Jimmy Burnett apparent and consultant who assisted the governor's news transition team that says the commission's job is to hear opinions from all sides\nHe says one of the problems with the current system is that the start date varies by district\nFor instance you have Manchester you know they start after Labor Day you've got conquered that starts before Labor Day and elementary schools go back for two days and then their offer for so I'm very eager to see what people have to say about it or maybe some people who are close to it but but I Would imagine there are going to be a number that are very supportive of it\nThe commission will issue its recommendations by the end of November\nTwo of the candidates running to represent New Hampshire's second congressional district will meet this morning for a forum hosted by an age appears the exchange income a democratic congresswoman Eddie Custer and Republican state Representative Steve Negron are slated to debate policy issues ranging from the economy to their respective records in office\nThe formal air live at nine and again it's seven PM it's the second and a three part series who candidate forums hosted by an HP are the first district congressional candidates met last week and the gubernatorial candidates are scheduled to meet next week\nUnited Airlines has announced plans to change some of its flights from Manchester Boston regional airport WMU our reports the airline will no longer fly to Newark New Jersey starting to spring\nInstead United will add flies to Dulles international airport in Washington DC there are lines also discontinued service between Manchester in Chicago O'Hare international airport in early September\nAnd sports Red Sox aids Chris Sale is been released from the hospital he's going to rejoin the team and Houston before game three of the American league championship series tonight is illness was announced by the team during game to send in a Red Sox won that manager Alex courses everything's fine but wants to see how sales feeling before determining what help pitch again\nIn while the socks and Astros get underway for game three later this afternoon the NBA season gets underway tonight with the Celtics host the Seventy Sixers at the garden in Boston\nAre forecast mostly sunny today but still Wendy wood advisory for the north country eyes me upper forties and fifties tonight partly cloudy temperatures in the thirties Wednesday will be partly to mostly cloudy less when it was a chance\nFifties support for an HBO ... comes from you our listeners and poured in Portland PA representing businesses trustees and institutions of bankruptcy troubled commercial matters immigration board in Portland and winter new furniture withdrawal rooms in Amherst king and when she did Massachusetts between\nFurniture married by America craftsman more wind in furniture dot com [noise]\nSupport for NPR comes from the alliance for lifetime income a nonprofit composer financial services organizations working to educate Americans about options for securing protected lifetime income in retirement Morehead alliance for a lifetime income dot org\nSeven of us has an HBO or the morning\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin when journalists ... went missing two weeks ago Saudi Arabia said it knew nothing about it even though 'cause she'll gee was last seen walking into the Saudi consulate in Turkey\nTurkish officials are accusing Saudi Arabia of murdering the journalist who was a vocal critic of the Saudi regime\nNow there are several reports suggesting that Saudi Arabia's leaders may have known more than they let on meanwhile President Trump dispatch secretary of state Mike Pompeo to Riyadh where he's meeting today with king selmont and with crown prince Mohammed bin some on\nNPR's Michele Kelemen is on that trip traveling with the secretary and joins us now from Riyadh and I will just know what we do have a delay on her line Michelle can you just start by explaining what the Saudis believe happened to ... to show you what are they saying\nWell you know officially they've um haven't gone they haven't said anything different when what they've said all along you're hearing sources privately I'm floating some other ideas that he was um\nA interrogated and it was interrogation gone wrong there are lots of different versions of events out there um but what the U.S officials who are traveling with Bombay or saying is look we haven't heard that from\nUm them directly we're waiting for these meetings we want to hear what they say face to face and that's what I'm secretary Pompeo is doing here they did they've been very tight lipped about what they think about um this changing storyline that seems to be happening from from the Saudis\nYeah you're referencing all these media reports we saw in the last twenty four hours suggesting that Saudi Arabian officials were about to release a report saying that uh it was actually an interrogation gone wrong as you point out Saudi Arabia has yet to confirm or release any such report\nBut can you explain what secretary pump pales role is in this moment why when Saudi Arabia would be connected even tangentially to something like this would President Trump dispatches secretary of state to stand right next to other people at the center of it allegedly\n\n\nRaces are on the up for grabs in every state keeping up with the mid term elections can feel like running a marathon\nWas about eating out there every day on the front line from you know [noise]\nStaying on top of all the election news can be a challenge and all things considered help keep the faith here the bigger picture every afternoon on all things considered from NPR News [noise]\nHow things considered every weekday afternoon between four and six on an HBO are\n[noise] mostly sunny today Wendy ties me up or forties and the north country fifty so did I partly cloudy with temperatures in the thirties [noise] Wednesday partly the mostly cloudy much less when there's a chance for mentioning showers with highs and the forties to lower fifties tomorrow [noise]\nSeven Twenty one this is an HP argument [noise]\n\n\nSupport for NPR comes from this station and from fidelity investments\nTaking a personalized approach capping clients grows preserve and manage their wealth to learn more at ... dot com slash wild civility brokered services that allows same [noise]\nFrom the Brown University school of professional study with executive master's degrees for mid career professionals in the fields with business cyber security healthcare and science and technology leadership\nBrown dot edu slash NPR\nAnd from campaign monitoring and email marketing\nPlatform used by more than two hundred thousand customers worldwide with email tablets a drag and drop email editor and twenty four seven customer service more ad campaign monitored dot com\nIt's MORNING EDITION from NPR News I'm Steve Inskeep\nAnd I'm Rachel Martin flooding in the south of France has killed at least eleven people heavy rain transformed reverse into raging torrent that wiped out roads and bridges even swept people from their houses in the middle of the night Here's NPR's Eleanor Beardsley\nAlec off her over the OED river in southeastern France a reporter from the F MTV points out villages Roseanne feels underwater you can see cars and trucks floating like toys in a bass during the night\nSunday Monday three months of rain fell in only a couple hours catching people off guard when most had already gone to bed and eighty eight year old nun was sweat from her ground floor room when the floodwaters crashed through the confidence front door her furniture was carried out onto a veranda\nThe nuns body was later found in the trees outside\nMovie they sound Ninety nine year old and these ... such a fate because her bedroom is on the second\nFloor she spoke on French television again to do with the ... I wanted to come downstairs but water was coming up the staircase so I just went back to bed she said and what else could I Do go I'm new to me is how many how many ...\nSays never in her life has she's seen flooding like this the French prime minister visited the devastated villages Monday President Emmanuel Macron heads down today as the waters and fear recede anger is rising\nSo not only do we weren't given any warning that this group of people meeting with a local\nMayor you couldn't have maybe given us a heads up at two AM that we needed to evacuate\nBouts of heavy rain in areas of higher elevations surrounding the Mediterranean Sea our regular fall phenomenon the downpours are caused by hot moist air pushed up from the Mediterranean and meeting colder air from the north\nBut the frequency and intensity of these ranges increasing Eric ... is the mayor of habit which lost six people he says they did everything they could\nSupernova grew up with them up from the rainfall was three times what it was rejected and he says and the sudden violence of these waters wouldn't terrifying we're dealing with the dream situations brought on by climate change says ...\nAnd no one can be sufficiently prepared Eleanor Beardsley NPR News Paris\n[noise]\nFifty years ago at the Nineteen sixty eight Olympic Games in Mexico city track fans anticipated especially you're starting to hundred meter rich\n\nBut it was what happened after the race that was so memorable Karen Grigsby Bates of our Code Switch team has one of our reports or Nineteen sixty eight\nNineteen sixty eight was a ... year around the globe and Mexico City was new exception the games began in ... because a few days before the army had opened fire on thousands of students protesting in a city square\nSome reports say as many as three hundred were killed their blood was washed from the streets and the games begin soon after\nIt was in the atmosphere that runner's John Carlos and Tommie Smith came to Mexico City\nThey had a plan that we're going to protest racism and injustice on the world stage in an oral history for the library of Congress John Carlos said he'd met Martin Luther king just before king was killed [noise] king's vision of how effective a non violent Olympic protests could be lifted a lasting impression\nOn more to do and there would be So Paul ... is an earth and you're still in a while\nAt the games Carlos won a bronze medal for the two hundred Smith a gold sitting another world record as they walk to the Olympic podium people notice both men were carrying their sneakers and wearing black Sox symbols of an impoverished black America\nAs a national anthem played in the flex began to rise Smith and Carlos ... their heads and raise their black gloved fists in the air years later talking to ABC Australian\nNorman the silver medalists to share the podium which Smith and Carlos recalled the moment the rise to um [noise]\nA was a symbol of unity with the news coming together and a symbol of spring [noise]\nThat was never on on believe it was even means is threatening to\nBut that's exactly how it was taken by many aftershocks silence the stadium filled with booze the photo of the race this loop was front page on newspapers around the globe within hours as the ABC tape showed the consequences were immediate\nSmith and Carlos we're going to leave the Olympic Village and Mexico within forty eight hours they were both stunned that the decision but retained or composure\nBoth men were stripped of their medals they got hate mail in death threats they were ... for decades in the U.S for their silent gesture many black Americans thought Smith and Carlos were heroes though there are braced this became a symbol of refusal to get into racial injustice the precursor to taking a knee\nSan jose State University professor Steven known or teaches African American studies now but he was an undergrad at the school in Nineteen sixty eight he vividly remembers the two runners reception when they came back to campus shortly after Mexico City\nHundreds of students put their shift as soon as they thought Tommy and job walking toward the podium and for the rest of that decade the raised just indicated the unity and the determination and the real appreciation for Smith and Carlos\nBut there was a cost to those principles for years both men struggle to find good jobs their marriages suffered their children were bullied at school\nEmployers shied away from them sniffing Carlos were banned from Olympic participation for life to live with that I don't have to go to number ... ... talk at the Los Angeles public library in June John Carlos says he realized he lives in Olympic presence even in his absence\n... showed up in art work at the games in Munich and Melbourne\nA huge statue of him and Smith at San jose state is much visit a tourist attraction earlier this year Tommie Smith told DWI news higher authority inspired the moment\nWho was finally justified in the meetings of a young black athletes who were hopeful for the Olympic movement\nThe gesture that was so misunderstood in Nineteen sixty eight is now better understood even celebrate it and then to designate this\nHappen recipient of the ash award for courage joined Carlos and Tommie Smith\nVindication happened last Karen Grigsby Bates NPR News [noise]\nIt's NPR news\nHey there is Joshua Johnson the host of one day and age PR were bringing the show to New Hampshire and we can't wait for you to join the conversation I'll leave this thing was panel of gets through a special discussion about issues that matter to you and to the Granite State\nWill be at the Capitol Center for the arts encountered on Thursday get your tickets right now at fifty a an H. dot com see their\nDisadvantage sponsored in part by New England employee benefits company and McLean Middleton\nNews update in our forecast is next on MORNING edition support for an age PR comes from you our listeners and tough self freedom planet northeast to tell to dental a partnership of credit for better or all in overall health right here in New Hampshire teeth to toes dot com\nThat scenario is fading as the CEOs of large us and global companies one after another announced they will not attend the second vision twenty thirty conference scheduled for next week Jamie diamonds C. E. O. J. P. Morgan Chase has said he won't attend again Jacob Kierkegaard\nI think the fact that as CEO as prominent as you know J. P. Morgan Jamie diamond not going to the summit and saying so publicly and linking it to the ... disappearance means that many other CEOs will probably put out\nTo other prominent Wall Street CEOs Larry fink of black rock and Steve Schwartzman of the Blackstone group also say they won't be attending\nAccording to the New York times the trio of CEOs tried but failed to get the Saudis to postpone the conference the CEOs also reportedly failed to convince treasury secretary Steven ... to stay home\nThe ... the allegations along with previous behavior of the crown prince\nAre making companies nervous says Kirkegaard he says remember that back in twenty Seventeen the crown prince rounded up four hundred Saudi princes and businesspeople detained them at the Ritz Carlton in Riyadh on corruption charges and force them to pay the government as much as a hundred billion dollars\nI mean he basically sends the signal that the rule of law in Saudi Arabia is amiss when you're trying to lure foreign investors into your country that is about the worst signal you could possibly send them\nBut Karen young a resident scholar at the American Enterprise Institute says U.S companies who ... the Saudis will likely pay a price because of the Saudis will take it personally\nThat decision on the part of the U.S corporate to walk away from this conference and to in some ways you know turn its back on the Saudi Government as a partner or\nSupport for an HP our live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swan CSI and all of Chester county giving back to the community for over Thirty years ... dealerships dot com on lots of US government bonds not to mention the country's\nKey role in the oil markets so the Saudis have ways to retaliate\nJohn Ydstie NPR News Washington [noise]\n\nThis is NPR News\nAnd this was an age PR seven forty two last year the Thomas Fire destroyed thousands of homes in California\nIt was exploding at a rate that I Would never imagine if you could actually make out individual homes in here and just like an entire wall of fire and\nNow some residents of rebuilding and those same areas even though the risk of fire remains but more than that next MORNING EDITION from New Hampshire Public radio\nAnd [noise]\nA dedicated lift their Joanne harden Frank has included an HP our inner ...\nIt may not be the biggest trials but I Want to be able to pay back what I feel I've received so people can be after me will be able to enjoy\nLeaving I guess to an each PR isn't inspired way to support an organization enrich your life and that others in your community to learn more about including an HP are in your state plans to an H. P. R. dot gets plans dot org\n[noise]\nSupport for HP are does come from you our listeners and David walled associates presenting Paul texture playing Tchaikovsky with great bay philharmonic\nSaturday October twenty upset the musical Portsmouth musical tolerance [noise] conquered food co-op with a reminder the tropic of the corporate helping locally sourced products is like a vote to support local farmers and membership is not required conquered food co-op got caught [noise]\nAn HP as popular current affairs program one day is coming to New Hampshire this week [noise] join host Joshua Johnson at the Capitol Center for the arts and conquered at seven PM Thursday moderate to special panel of guests get your tickets now at C. C. A. N. H. dot com [noise]\nWhat what has been wild overnight gusty winds Nazi several thousand power outages scattered about the state [noise] mostly sunny and windy today has me upper forties and the north where there was a widow advisory fifties south [noise]\nOnce you're diminished tonight partly cloudy was temperatures in the thirties from many of us Wednesday partly the most cloudy this chance she's ... showers\nTies in the forties or fifties [noise]\nMORNING EDITION from an H. B. R. seven forty five\nSupport for NPR comes from the station\nAnd from long me in makers of go to the collaboration meeting comes equipped with teachers to help\nPeople stay focused to get work done [noise] learn more it go to meeting dot com [noise]\nBy over three million businesses for hiring where employers can post jobs and Springer question to build their short list a preferred candidate [noise] learn more it indeed dot com slash higher\nAnd from listeners like you who donate to this NPR station\nIt's MORNING EDITION from NPR News good morning I'm Steve Inskeep\nAnd I'm Rachel Martin it's been a year since the most destructive fire in California history the tubs fire destroyed thousands of homes in northern California now despite the risks some are rebuilding in those very same areas from member station KCUR weedy and NPR's energy and environment team Lauren Sommer reports\nIt was late at night a year ago when ... was called into work\n[noise]\nHe's assistant fire marshal in Santa Rosa and the tubs fire was moving fast\nIt was exploding at a rate that I Would have never imagine would occur\nHours later he drove past his neighborhood\nYou couldn't actually make out individual homes and heritage is looked like an entire wall of fire and then realized right away that while John\n... has spent the last year picking up the pieces and a crucial question came up for him and thousands of others should they rebuilt in California wildfire is a fact of life the Thomas Fire was a repeat of a fire that burned the same area more than fifty years ago but ... says the housing market was too tight\nBut honestly it also added a lot to do my daughter this is where we were before the fires and this is where we want to be up to the\nFires [noise] now the drywall is just about to go up and if you have\nIt appears it's not really moving as quickly as you'd like to do but yeah you do know that the un's inside\nAnd knowing what he knows about fire he's making sure this home will be better protected with fire resistant materials\nBetween the roof decide and things of that nature um there's definitely a stuff that I wanted to\nBut he doesn't have to take that step California building codes require fire resistant materials if you live in a designated wildfires down\nBut loaned those house wasn't technically in that zone before the fire and neither were almost two thousand other housing units and so far they're still not asked Santa Rosa's director of planning David ... about that\nWe don't have a an an extra set of rules are are requirements that we put on people um to to rebuild\nGiven says legally city couldn't change of the building codes overnight and it can't stop people from rebuilding\nWe can go in and take somebody's property and that's not the role of the city\nPlus the seed housing shortage is even worse now\nReally to walk and chew gum at the same time we're going to rebuild our communities and quickly and efficiently as we possibly can but we also have to build new homes as fast as we can\nHe says the city is trying to entice developers to build downtown but one big project is proposed for the hills right where the fire swept\nThrough so this is the forty acre parcel or are they wanted to put the two hundred and thirty seven homes the trees all around me are are black and almost all the way to the top as I'm standing there after turning off my recorder\nA man comes up to me without me looking at the time for the development and said I definitely wouldn't want to live there [noise]\nHe didn't want me to record that though\nIn February the city council debated this project\nTo public hearing around ... village project\nSome members liked as a town home to the fire resistant and create much needed housing but one council member Julie combs had doubts\nI just think we need to put more sleeping people in a fire hazard area\nCombs was the only no vote and I know I've heard stories of flooding\nAlong the Mississippi and thought why did they keep rebuilding their she says some insurance policies pay people less if they don't rebuild and the same place or they just can't afford to go elsewhere in the city doesn't have a way to buy people out and some don't want to go\nI think that in a disaster there's such a strong emotional pull to get what you lost\nThat poll means it's the hardest time to make tough decisions about the future\nOut and you were here Lawrence reporting on MORNING EDITION from NPR News [noise]\nOne WCBS Nashua eighty eight point three W. E. H. Hanover Ninety One point three W.\nE. V. in Keene Ninety point seven\nW. E. V. C. Gore I'm One of those seven point one W E v J Jackson Ninety nine point five W. E. B. S. cobra Ninety point three\nAnd W. E. B. Q. Littleton Ninety One point nine and online at an H. P. R. dot org\nMorning nearly weeks as hurricane Michael my fall on the Florida Panhandle and many of those who are still there have no power while others were evacuated can't get back\nTo this is MORNING EDITION from an HBO [noise]\nReal Lawrence joins us live in the panhandle with details of the recovery effort to reduce our\nNumber gambling with Steve Inskeep and Rachel Martin\nSeveral thousand granted staters are waking up to no power this morning as gusty winds overnight across to scattered outages across the region where the forecast us secretary of state Mike Pompeo was in Saudi Arabia today the Saudi regime was accused of murdering a journalist President Trump now says it could be quote rogue killer\nSorrow explore the arms deal between the U.S and the kingdom\nBut a new poll says there are two issues motivating rural American voters this year drug addiction\nAnd the economy [noise] talk about them but It's Tuesday is October sixteen [noise]\nAnd the news is next\nLine from NPR News in Washington encore the Coleman rescuers in Florida continue to search for dozens of missing people from hurricane Michael cell phone services down in large areas and people are still trying to reach missing loved ones the storm killed at least Seventeen people\nSecretary of state Mike Pompeo has met Saudi Arabian king ... to discuss missing studying journalist ... who's feared dead the Saudi king has denied knowledge of his faint turkey alleges ... was murdered when he went into a Saudi conflict and Houston Bowl and never came out\nNPR's Peter Kenyon says Turkish and Saturday investigators have now searched the consulate looking for evidence\nTurkish officials say the nine hours surge involve the collection of samples which will be examined further the consulate was searched with the Saudis permission end with Saudi investigators in attendance turkey says it also wants to search the consul general's residence and possibly diplomatic vehicles as well the Saudis denying any wrongdoing\nNPR's Peter Kenyon there are media reports suggesting the Saudi Government is considering saying ... died in an interrogation gone wrong NPR has not confirmed these reports\nThe Trump Administration is planning to require drug companies to include the retail price of their medications in television or other consumer ads NPR's Alison Kodjak has more\nHealth and Human Services secretary Alex ... says he'll require drug makers to include retail prices in t._v. advertisements for prescription drugs\nPatients deserve to know what a given drug could cost when they're being told about the benefits and risks that may have\nUnder the proposed rules companies will have to disclose the monthly list price of any medication that costs more than thirty five dollars\nThe pharmaceutical industry is already taking steps to preempt the administration's actions the industry group farmer says it's member companies have agreed to include in their ads information about where consumers can look up and medications price\nBut that plan fall short of actually disclosing retail prices Alison Kodjak NPR News Washington\nStop admissions official will face more questions today as the federal trial over the university's admissions policies moves into a second day from member station WB you are in Boston carry young reports Harvard is accused of discriminating against Asian American applicants theme\nHeat a book from US Senator Ben Sasse amount the state of politics and the country's future\n\nIt's MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep let's take a walk around the Florida Panhandle which is cleaning up after hurricane Michael we will focus this morning on the Panama City area\nIn the beach communities there are some buildings are fine others no longer exist and NPR's Quil Lawrence has spent days taking it all in either Quil tasty so what have you been seeing\nWell I mean there were a their trees down everywhere these towering pine trees that are just snapped over at the middle in some of the communities along the water and they've been they've been flat and then I Know people so to say that word or they try to describe it mostly uh people down here keep using sort of\nChildren's toys metaphor saying like a kid's swept all the houses off the monopoly board\nOr you know a kid snapped his his toy tree I don't think people can really believe that uh that if a wind could snap that sort of keep they keep on trying to reduce it to some metaphor they could understand how how this could just get picked up and move to blocks\nAnd flipped over and so the point where you can't see uh what was a house in what was a vacant lot Mm I'm so in those communities there are people are really asking how can you rebuild that's talking about like Mexico yeah\nYeah Mexico beach I think we've seen the overhead shots were there seems to be about one house that is intact and a couple of others that are severely damaged and everything else utterly destroyed but when you pull away from that spectacular shot do you see widespread damage up and down the coast\nAnd everywhere in this in this a swath dozens of miles and miles wide you can see the storm just tore straight up I'm for miles and miles all the way to Georgia really um and you see these trees down live oak trees that are very old it looks like someone just\nTwist at the top off like a you know breaking off the top of the flower or so the destruction it sort of like a ... some people told me it was like a tornado inside a hurricane in some places it drop one house\nCandidates for New Hampshire governor will be speaking with in each PR ... only this week in tomorrow tune into here libertarian Kennedy Gillette of German speak about health care and economic policy\nThis state was build on small businesses they are the backbone of our state and we have been ignoring them in this desire to bring in more big businesses\nThat's tomorrow on MORNING edition and all things considered in each PR [noise]\nNot forecast today it's been windy and it's going to stay with you for a while longer\nAs the winds of forty miles an hour even more in some spots in the north country today where there's a wind advisory\nMostly sunny said why the wind will diminish later today and early this evening temperatures in or if your forties to help her fifties partly cloudy tonight down to the thirties overnight Wednesday some sun for the south partly sunny overall but mostly cloudy north of the lakes miss a transfer Labor Day rain or snow show I was in the forties or fifties\nAs an HBO forecasts made possible with support from New England Honda dealer speech from the all new two thousand Eighteen to court and all those tribes C. R. V. for life around here they are more hunted healers New England dot com\nAnd Vermont Academy of voting day high school with a three hundred and fifty see theater hosting an open house Saturday October twenty seven Vermont Academy dot org slash open house\nSupport for NPR comes from the station and from T. I. A. T. I. A. is committed to helping those who are driven by purpose reached their definition of success investing advice banking retirement learn more AT T I Am a dot org [noise]\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs\nCoverage options and more information can be found at farmers dot com\nAnd from Kara data working to transform how businesses work through the power of data using pervasive data intelligence ... data leverage is all relevant data to deliver answers to complex business issues\nTara data dot com [noise]\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin drug addiction and the economy according to a new poll that is what is on the minds of rural voters as they go to the polls this election season the poll was done by NPR the Robert Wood Johnson Foundation and Harvard's th Chan School of public health\nBut NPR's Alison Kodjak reports that even with those real challenges many rural Americans are optimistic about the future\nIf you want to picture of the troubles that face some rural communities income Brenda a self described homemaker from the heart of Appalachia she fifty seven and married to a former coal miner\nOr ... ... s that from the black lung and having a real hard problem where it was time for him to come out anyway\nAnd drug addiction has hit her family especially her two grand sons hard\nMy daughter and her husband um got a son and he walked off color because they couldn't give up his truck\nHe's still alive but some of her other relatives aren't including her niece\nThat found her and her home\n[noise] the timber [noise] [noise] she was thirty three years old is she left behind during boy\nBrenda NPR's not using her last name to shield her grandchildren lives in Coburn Virginia a town of about two thousand people near the point where Virginia meets Kentucky and Tennessee her experience fits into the findings are new poll which shows that in rural America drug abuse ranks with the economic outlook as residents top worry\nAlmost half of rural Americans have been personally affected by the opioid crisis on react if they personally know someone who struggled with addiction forty nine percent said yes Brenda says it's worse in her community\nIf he were to approach can family randomly and give them a piece of paper and have do you have someone in your immediate family on the road I out of town would say yes\nBrenda says in Coburn jobs and opportunities have dried up state officials have been promising to bring an economic development but none of it has reached her community yet\nIf you come out of college with a degree I knew more than likely going to leave this area to find work\nBut experiences in rural America very widely and are pulled there's that out the survey of Thirteen hundred adults all living in rural areas should that many people are optimistic about the future of their communities most of the people we surveyed say they're better off financially than their parents and a majority think their children will do better still\nRobert Blendon professor of health policy and political analysis at the Harvard th Chan School directed our poll\nThey're optimistic about about the future and they're also optimistic that things can be done to pull them out of these economic problems they face\nWhile some rural communities are suffering others are thriving says Christopher thorn burn the founder of beacon economics in Los Angeles\nWho might have a cold town and an oil town well the whole town is doing terrible because coal can compete in this era of cheap natural gas\nOn the other hand because of fracking these rural community sitting on ... oil are booming and incomes are up dramatically as a result of all that new money flowing into the region for oil exploration and drilling\nThe economy and grenade in Mississippi a city of fourteen thousand about halfway between Jackson and Memphis, Tennessee is doing well says it killed Powell\nAlone job of its own\nPalace to twenty four year old truck driver who grew up in Grenada he says the town has a drug problem but its economy is growing\nIt's almost like a starving tone on this starting to experiment fall and bigger restaurants are being put her now within the first two years we're really ...\nAnd Brenda says she's seen flickers of hoping Coburn the town's high school has a new football coach and the community has come together to support the players\nYou know one of the inflatable how much that the kids run three way bottom one of them it was twenty six hundred dollars we ... the white wearing all in one year so there's good people did hard working people\nEven though sometimes things still looks bleak Brenda says her view of her community is getting better Alison Kojak NPR News\nThe Milwaukee Brewers hold two games to one lead over the Los Angeles Dodgers and baseball's National League championship series if the brewers should win this series and Dodgers fans will insist on the yes\nIf they win the brewers would reach the world series for the first time since Nineteen eighty two one man is celebrating already\n[laughter]\nGreat voices and he happens to be a long suffering brewers fan euchre has been calling gains for Milwaukee since Nineteen Seventy one he was a player to do is playing career started dairy and sixty too\nLong ago you could start in an ad where an usher removed him from his good seated a ball game must be on the front row euchre says only to be taken back to the cheapest of cheap seats high up up up that self deprecating style fit a catcher who had trouble\nCatching you want to explain to Johnny Carson his technique for handling the knuckleball\nEasiest way to catch it was to wait until it stopped rolling and just pick it up\n[laughter] it was like ability or number role as a play by play announcer in the film major league in his most famous line that the movie he did to the radio audience about a wild pitch that misses the strikes down by about a city block\nThe sun this season though he's been enjoying real brewers success there's video of him in the locker room after one of the teams biggest wins the players crowd around him this man in his eighties dumping beer on his head of course here he is reacting tweet Fox Sports Wisconsin reporter\nMargaret Feldman anyway what may seem\nWell they're all they're always there is no I wasn't here and [noise] I mean to be training to be treated like one on one of them all the time [noise] I think that special for me\nRemember there is no high in euchre Bob ... Milwaukee Brewers face off against the Dodgers once again tonight in Los Angeles [noise]\n\nIt's NPR news\nThe threatened clear I'm not denying climate change but try explaining that President Trump\nYou have to show me the scientist because they have a very big political agenda\nExplaining the facts behind climate change is not enough to convince Tonight Show what would it take a reality check on debating climate change next time one\nThis morning a ten minute Hampshire Public\nRadio [noise]\nAnd it said thirty news from NPR in an age PR is next support for ... radio comes from you our listeners income bill construction\nIf we had in mind our allies leading the house of representatives they can do badly needed oversight on the minister Asians efforts to cater to the leaders every day over our communities\nThat word oversight is when you hear a lot from Democrats in part because there's not a whole lot else they can do most of the role backs and environmental policy are happening in the executive branch under Trump appointees a shift in house leadership won't change that\nDemocrats can't force interior secretary Ryan Zinke you to restore Bears Ears national monument for example or to crack down on methane emissions but they can force him to explain himself\nArizona congressman ... is the ranking Democrat on the house natural resources committee\nI Want to change the narrative of this whole thing where the Resources Committee is not just the past ... part of the Trump Administration that the independent and that they have responsibilities co equals for oversight accountability\nTranslation expect hearings lots of them if Democrats retake the house Tom pile heads the American energy alliance which supports Trump's agenda he says a Democratic majority in the house would be a setback for the administration\nAnd they will be able to tighten up mercilessly so that they would\nKinda be able to slow walk a lot of the good work that's being done with respect to these issues\nDemocrats already have a working list here's Colorado congresswoman Diane to get the ranking Democrat on the oversight committee for energy and commerce\nI think you will be seeing investigations in hearings around the methane rural and claimed power plant and they think car rules you're going to the scene look more in debt at conflicts of interest in corruption at the EPA\nAnd the list goes on to get says this year's midterms reminder of what happened in two thousand six when Democrats took back the house under President George W. Bush for the following two years Democrats called hearings and investigations and crafted legislation that they knew would not passed under Republican president\nBut then when President Obama was elected in two thousand and we were able to move up Rebecca legislative agenda because then spent the last two years developing you\nKnow of course Republicans could keep their majority in Congress which would mean continued support for the administration's deregulatory agenda\nNathan Rott NPR News\nAnd later today on all things considered the outcome of the mid term elections could also have a major effect on the future of U.S policy can listen to that story by asking your smart speaker to play NPR or your local member station [noise]\nThis is NPR News\nAnd this is an age ... said forty to the social scientist says some portion of people's political leanings can come from an unlikely source they're digging in\nThis one goes any controversy I'm sure that story is coming up next year on MORNING EDITION from an HP are\n\nHey there is Joshua Johnson the host of one day on any PR were bringing the show to New Hampshire can't wait for you to join the conversation I lead a distinguished panel of get through a special discussion about issues that matter to you and to the Granite State\nWill be at the Capitol Center for the arts conquered on Thursday get your tickets right now at the C. A. N. H. dot com see their\nThis event sponsored in part by the New England employee benefits company in the community college system of New Hampshire [noise]\nSpecialist supported New Hampshire public radio support also comes from do set survey utilizing the latest technology including loser scanning and unmanned aerial vehicles to provide serving solutions throughout New England do set survey dot com\nNorth Country gastro ... and little to providing comprehensive office based GI care since Nineteen Ninety six servings wrapped in Boston Carol county and see gastro mh dot com [noise]\nListen to the radio on your schedule for then age beers battery broadcasts checkout civics one of one refresher course and how our democracy works for outside in an exploration of the natural world and how we use it to find a complete list of our news and information podcasts at Penn H. P. R. dot org [noise]\nWhat advisory still up for the north country this morning gusty winds for awhile today\nMostly sunny across the state with temperatures in the upper forties supper fifty years later\n... partly cloudy with overnight lows in the thirties for much of the state of Wednesday partly sunny south [noise]\nClose to the north may be late to rain or even snow shower the mountains highs and the forty slower fifties tomorrow\n[noise]\nSay forty five this is MORNING EDITION from an HBO [noise]\nSupport for NPR comes from the station and from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers worth in food health\nJobs and resilient cities\nAnd from F Jaycee foundation of donor advised fun\nWorking to maximize the impact of charitable giving and to create customized philanthropic solution [noise]\nJC dot org [noise]\nThis is MORNING EDITION from NPR News I'm Rachel Martin and I'm Steve Inskeep this story starts with a quiz here's your quiz master Noel King\nIt comes from political scientist John ... at the University of Nebraska he's going to describe two towns and you have to guess which one is liberal and which is conservative huge number one\nThe schools with stress patriotism and respect and it would be a very rules based on educational system but how is this would be fairly similar the lawns would be a very nicely kept in a beautifully green and mode or the town of be quiet with lots of churches\nAlright and here is ten number two\nSchools would be based more on experience for all kinds of things rather than than real mess\nSupport for an HP our live stream comes from you our listeners and from castle in the cloud mouth and borrow\nToward the Nineteen fourteen arts and craft a mansion elegantly dressed for the holidays by local businesses and designers enjoy activities for all ages including an artist and fair craft making and a visit from Santa more capital in the clouds dot org and gr I Know\nSo the first time I'm guessing was conservative and the second one was liberal right\nExactly not hitting is drawing on fairly traditional stereotypes about liberals and conservatives\nConservatives prefer author and rules liberals prefer experiential schools and community theaters now those are stereotypes which means that they're going to be liberals who hate community theaters and conservatives who despised churches but the question that hit being and others are asking is how come these stereotypes are so often accurate\nIf being liberal and conservative is all about our political views how come these labels describe all kinds of other things about us from the kinds of food we prefer to eat to the kinds of poetry we laugh\nTo where we want to hang out so he's arguing that our political views spring from something deeper than just our beliefs about big government or a small government\nPrecisely he's arguing that political preferences at least in part\nCome from a psychological and biological predispositions the most compelling evidence for this comes from studies involving large numbers of twins some of whom are identical and some of whom are fraternal identical twins share the same genes fraternal twins share fewer genes\nIdentical twins to not to have more political preferences in common than fraternal twins do even though each ... presumably share the same family and upbringing\nHike for example turns out to be about eighty percent a heritable when you're subject to the same kind of design personality traits are about fifty six percent political views thirty to forty percent\nThirty to forty percent so he's saying some part of our political beliefs come from biology\nYes and of course that conclusion upset a lot of people\nAnd they tended to over interpret those results and make it sound like we were saying that everything was was genetic but you know if it's thirty four percent genetic that obviously is you know fifty sixty Seventy percent comes from the environment so all we're saying is that that genetic component of not zero but apparently that was enough that that some people were upset about that\nWhat he and his colleagues are saying is that biology and psychology play a role in our political preferences snow all liberals and conservatives in the United states often accused one another or stupidity or malice but it's hitting on his colleagues I'll write one reason we might not see the world the same way is because we simply not why at the same way\nThat is a nice way of looking at it indeed offer some compassion for the other side shouldn't get right down to miss hosted the hidden brain podcast where you can learn more about how psychology Shapes Our political views thanks Juncker thank you know [noise]\nSupport for hidden brain coming from zoom zoom offers cloud video conferencing online meetings and a video conference room solution and one's hot for featuring digital video\nAnd audio screen sharing account registration and more zoomed on us [noise]\nIt's MORNING EDITION from NPR News I'm Steve Inskeep and I'm Rachel Martin", "year": "2018", "show_name": "Morning Edition (NPR)", "city": "Keene", "day": "16"}