{"month": "10", "state": "NH", "station": "WEVN", "content": "W. E. V. S. Nashua eighty eight point three W. E. V. H. Hanover Ninety One point three\nW ... keen Ninety point seven\nWABC ... one of seven point one\nDeadly EJ Jackson Ninety nine point five W. E. Z. asshole Burke Ninety point three and W. E. Z. cue Littleton Ninety One point nine and online at an H. P. R. dot O. R. G.\n\nFrom WHYY in Philadelphia I'm Terry Gross with fresh air\nToday the journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia which out with Washington Post's reporting Greg Miller who broke several related stories and shared a Pulitzer this year we'll talk about the stories he broke including one about what she says\nThat was a sort of one of the more fascinating and interesting episodes I've ever lived through as a reporter\nAnd we'll talk about reading and combing memo that in an Oval Office meeting between Colombian President Trump Trump complained about leaks and about a reporter and Miller realized he was that report and\nThey're talking about heads on pikes reporters in jail chasing down sources it was unnerving\nAs a TV critic David be including considers has Saturday Night live and sixty minutes responded to the Kavanaugh hearings that's on fresh air\n\nFirst news live from NPR News in Washington I'm ... beer President Trump today said he's given the FBI freedom to interview any witness it deems necessary to complete the investigation into sexual misconduct allegations against Supreme Court nominee Brett Kavanaugh\n... last week Christine Blasey Ford testify on Capitol Hill the Kavanaugh sexually assaulted her when the two are in high school and lawmakers agree to push the pause button middle our further investigation\nFormer Senate majority leader Mitch McConnell says vote on the nominee will happen this week and he blasted Democrats are continuing to go after capital\nIf you listen carefully Mr President you can practically hear the south of the Democrats moving the goalposts\nTrump says he wants a comprehensive investigation of the allegations against Kavanaugh but also once you're done quickly and continues to stand by as nominee President Trump is celebrating a new agreement with Canada and Mexico today as a storage and terrific trade\nSupport for an HBO ... comes from you our members and from Dartmouth Hitchcock imagine nationally ranks healthcare in your community was convenient location throughout northern New England world class providers are closer than you think\nIs at Dartmouth Hitchcock dot org to learn more starting with Hitchcock is here\nParts can be made in North America it also calls for higher wages for auto workers the president says the deal is good for everyone\nBut we have negotiated this new agreement based on the principle of fairness and reciprocity\nTo me it's the most important word and trade\nCanada and Mexico are promised exemptions from ... but not from America's ... that's the deal still needs to be approved by Congress can you hold on a ... NPR News\nBaton immigration officials defending a plan by the Trump Administration to deny green cards to immigrants who use public benefits NPR's Joel Rose explains the head of the agency in charge of illegal immigration spoke about the proposed rule change today\nThe head of US citizenship and immigration services ... wants to ensure that immigrants are self sufficient by enforcing a long standing law that immigrants cannot be a quote public charge\nUnder a proposed rule the administration wants to expand the definition of public charge to include a wide range of benefits including food assistance and housing vouchers\nBut at an immigration conference in Washington ... said the changes do not apply to all forms of assistance so there should not be a mad rush to an subscribe from all benefits\nThat is unwarranted I think that critics say the proposal is already scaring immigrants away from using many benefits and potentially inflicting long term damage on public health Joel Rose NPR News\nRelatively strong strong for blue chips on the first trading day of the fourth quarter though tech stocks gave up some of their games but I was a hundred and Ninety two points at the closed NASDAQ closed down nine points this and be five hundred roast ten points this is NPR\nAn American and a Japanese researcher or the recipients of this year's Nobel Prize for medicine known as the Nobel Prize for physiology American James Alison and Japan's to sue ... awarded the prize for their discoveries about how to harness and manipulate the body's immune system to fight cancer\nScientists work in the Nineteen nineties was led to new and improved therapies for cancers such as melanoma and lung cancer their show that releasing the brakes on the immune system can help attack cancer cells\nA drunk commonly used to treat the bone thinning disease osteoporosis could prevent fractures in older women with less severe bone loss that's based on a new study published today by the New England Journal of medicine Here's NPR's Rob Stein\nThe drug is called ... it's long been used to treat the bone thinning disease osteoporosis but there's been a big debate about whether it might help prevent factors and people at earlier stages of bone loss\nSo researchers tested it down to ... thousand women ages sixty five an older with the less severe form of the last known as ...\nAnd it's significantly cut the risk states suffer broken bones so the researchers say the drug could help protect the bones of millions more older women Rob Stein NPR News\nAssociated Press photographer max Nash known for his work covering conflicts in Southeast Asia as well as formula one auto racing coverage is died natural to nurture new generation of female photo journalist with the a P\nHe was known as younger years was flaming red hair eccentric color combinations ... chains that he smoked to give him up later in life max ... died after collapsing and his home\nHe was Seventy seven years old I'm jak sphere NPR News in Washington\nFor NPR comes from the Conrad Hilton foundation supporting shining hope for communities the twenty Eighteen recipients of the Hilton humanitarian prize nomination\nIn foundation dot org slash prize and the any EKG foundation\nThis is an age PR it's nine oh six good evening body along with some showers likely for tonight with low temperatures upper forties to lower fifties men tomorrow it'll be cloudy with rain some heavy downpour responsible\nHigh temperatures mid fifties to around sixty degrees support or an age PR comes from you our listeners from UNH in Manchester hosting an open house October twenty of\nCampus tours available to explore degree programs and learn about financial aid Manchester Dodd UNH ... use slash open house\n\nThis is fresh air and Terry Gross President Trump has denied Russia interfered in our election or he is a quid vacated in spite of the evidence presented by American intelligence agencies and journalists when other reporters who has broken stories that have revealed new information to the public about that interference\nAnd about connections between the Trump campaign and Russia is my guest Greg Miller\nHe covers intelligence and national security for the Washington Post\nThis year he shared a Pulitzer Prize for national reporting now he's written a new book called The Apprentice Trump Russia and the ... version of American democracy\nIt's a chronological narrative connecting many of the most important stories on the subject and adding new reporting to those stories\nGreg Miller welcome to fresh air is your story that you helped break the you consider the most consequential story of candidate or President Trump and his administration ...\nI mean there there are several um stories are obviously many stories at the Washington Post broke that I had a a hand in one way or another uh ... obviously working very closely with some terrific an amazing colleagues here\nI think the one that jumps out for for many people as the story or that said that that former national security adviser Mike Flynn had not been honest about his conversation with the Russian ambassador Sergei Kislyak\nWe wrote the story saying that he in fact had discussed the lifting of sanctions on Russia in those conversations and then lied about it to the White House or to news organizations including our own and to the American public\nUh and this was the sort of just one of many huge stories that we broke during that time in a couple of others that I was involved in include\nThe revelation that the CIA had reached to a ... a secret conclusion that Russia was not just trying to disrupt the election was about was trying to help elect Donald Trump\nAnd then later when Trump was in office I broke several stories about his rough conversations\nWith foreign leaders ah we had the transcripts of some of those calls and the story about his um revealing of highly classified information to the Russian foreign minister in the oval office\nThat start with a ... or I guess that really direct consequences Flynn was fired\nSelling was fired within days yeah yeah so you know you helped write the story\nThat Flynn had calls with the Russian ambassador to the U.S surrogate Kislyak telling Kislyak that the Trump Administration would lift sanctions to like don't worry about it uh the sanctions imposed by the Obama administration and these calls happened\nAfter the election but before the inauguration\nOf right so how did how did you get onto this how did you start investigating this story\nI mean the ... ... ... absolutely so troll ... attacked a lot um and that has not really a beta [laughter] I mean that that continues now not just for me but for a lot of reporters covering the ... at this really highly politically charged time where we're living through\nI'm On the other hand we're things happened that had never happened to me as a reporter um several of us started getting cards ... actual letters in the in the mail a thanks for readers from far away places\nUm notes on on our even on my doorstep at home I Would walk through the neighborhood and suddenly people would stop me and thank me and\nI mean that was ... that was felt great too and it was odd it was something I had never experienced\nLet's take a short break here and then we'll taxing more if you're just joining us my guess is Washington Post reporter\nGreg Miller he covers intelligence and national security he's part of the team that shared a Pulitzer this year for national coverage his new book is called The Apprentice Trump Russia and assume version of American democracy we'll be right back this is fresh air\nIs fresh air on an HP our\nSupport for an HP aren't comes from you our listeners and I'm from New Hampshire it's Business Review presenting it's health care confronting disparities event on October tenth discussing the cost of healthcare nationally and locally tickets at an age we are dot com\n... hours likely tonight low temperatures upper forties to lower fifties then tomorrow cloudy with rain some heavy downpours possible high temperatures mid fifties to around sixty degrees\n\nThis is fresh air and if you're just joining us my guest is Greg Miller\nAnd national security he shared a Pulitzer Prize this year and now he's written a new book called The Apprentice Trump Russia and the ... version of American democracy\nAnd it kind of brings together a lot of stories about candidate and President Trump and the Trump Administration\nSeries that have been reported by Miller and other reporters at the Washington Post you know you're right in the book that Trump has avoided consequences for offenses that were long considered politically fatal often by lying in the face of overwhelming evidence Flynn however had noticed that community\nI was interested in that you used the word lion award lying when used in the same sentence as Trump is very cutting controversial in the journalism world\nBecause mine implies intent\nYou know a fall to is when you speak something that isn't true line implies that you know it's not true and you're saying it anyways\nSo people are just weighing ... is is worthy of using the word lie or not so you've used the word lie so I Want to ask you about how you decided to use it\nYeah I mean I feel like um\nIt is a difficult decision and we don't we don't throw that word around lightly we um we often get criticized at the post for being\nToo reluctant to use that word and I think that's true with other news organizations as well but at the same time I mean we're at here at this moment are you know we have a fact checker at the Washington Post to his documented\nFive thousand or more fall swords from this president since he's taken office many of them are false words that he repeats despite repeated corrections public corrections repeated efforts even by his own staff\nTo um to correct his misstatements I mean there is an intent to I don't think there's any doubt that there is an intent or that it is part of it's part of Trump's per se car very complex personality it's part of it and it traces back to\nHis origin as a as a as a public person um I mean we have run fascinating stories here at the post about\nA times earlier in his career when he would adopt\nPhony persona and call reporters for Forbes on the phone and try to lobby them into inflating his net worth for magazines in magazines annual rankings I mean there's a there is an ... year and I don't have any doubt about that or or real any hesitation when appropriate from using the word lie\n[noise] after Flynn resigned under pressure\nUm you spoke to Devin Nunes has the Republican chair of the house intelligence committee and you say that what he told you was basically the opening of what became an ongoing siege by Trump and his allies to discredit the FBI what did he tell you\nThis is at a time when we're trying to figure out well we now know that Flynn had discussed sanctions would the Russians was basically cutting a deal behind his government's back with Moscow\nAnd not just raised a lots and lots of questions about well who else was in contact with ... with the Kremlin during the campaign if anyone rights of ... there was digging by our news organization and many others\nAnd this was a conversation with the chairman of the house intelligence committee Devin Nunes has who has who is read into all of the most sensitive intelligence on questions like this\nAnd I was asking him you know what else is there we are seeing lots of indications contact between Jared Kushner\nAnd and officials for Moscow and other members of the Trump Organization we already knew about Paul Manafort of course and he says that the FBI has been looking at this and all and it's all a dead trail and I ...\nThat there was already abundant evidence of contact that you could say that that was incidental and meaningless and harmless but you couldn't say it didn't exist but he says it you know when I pressed him not even pizza boy delivery contact\nAnd it just struck me at that time that that was\nSo implausible um that he was you know he was trying to throw sand and ... it's basically a in my eyes as a reporter\nHe was trying to um protect Trump and that that was um more important to him in that conversation that adhering to the facts that had already been established\nMy guest is Greg Miller who covers intelligence and national security for the Washington Post\nAnd has written a new book called The Apprentice Trump Russia and the ... version of American democracy\nWe'll talk more after a break and TV critic David being Cooley will consider had the season premiere such Saturday Night live and sixty minutes covered last week's Brett Kavanaugh's confirmation hearings I'm Terry Gross and ...\n... ... ...\nNew boom boom\nBoom boom\nBoom boom boom boom boom\n[noise]\nThe little blue moon\n[noise]\n[noise] [noise]\nThe new our family foundation supports WHYY it's fresh air and its commitment to sharing ideas and encouraging meaningful conversation support for NPR comes from ... and from Rhodes Scholar and not for profit offering learning adventurous for adults and natural setting off the couch we\nLearn more at R. O. A. B. scholar\nDot org slash retreat and from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major remodeled homeowners can read reviews of local pros and book appointments online at home at ... dot com\nThis is an HP are eight to nine thirty good evening [noise]\nKnowing what's happening in the mid term elections before you vote in November is important but what about what's going to happen in December or January Hi I'm Lauren ...\nYoung when you give each month as a ... and you will and H. B. R. and NPR cover the entire election\nWhat happened for what's going on now and especially what's coming next [noise] be a part of what comes next to become an N. E. T. R. stand her today\nAn age PR dot org [noise]\nSupport for NPR comes from the station and from progressive insurance offering or weights or by home insurance with their own quote\nExplore it's custom quotes in a race or reliable online\nLearn more progressive dot com or one eight hundred progressive now that's progressive and from the I. A. T. R. A. is committed to helping those who are driven by purpose reach their definition of success investing advice\nBanking retirement learn more at CIA dot org\nThis is fresh air and if you're just joining us guest is Greg Miller he covers national security and intelligence for the Washington Post he shared a Pulitzer Prize this year for national reporting now he has a new book called The Apprentice Trump Russia innocent version of American democracy\nMy understanding is that there are members of the Trump Administration who have been told that they had to sign non disclosure agreements\nWhich means that they wouldn't be able to divulge anything to a reporter like you and if you called them and this is an attempt to prevent any kind of damaging information about the Trump Administration from from getting out to the public\nDo you know when somebody you're speaking to has signed\nI Can't say I've ever encountered I'm somebody who has signed such agreement I Know that they exist in this White House I Know that they've\nUm tried to offer financial inducement 'em to those will be willing to sign them as they as they leave the administration and move on I'm On a morose it comes to mind\nUm no I I I just think that's such a bizarre approach these are these are supposedly public officials they are they are are public servants they're not President Trump's public servants um the idea that anybody would be required to sign\nAny kind of loyalty oath to him personally I'm is just goes against the grain of so many ah principles that it's hard to fathom\nSome people who want to just credit reports about the Trump Administration that reports that exposed I'm either you know lies false heads misdeeds\nSay all those stories relying anonymous sources I'm not going to like chest I'm not going to trust and not in an anonymous source [noise] um so what are your own rules what are your guidelines for using an anonymous source and for how to use them\nAnd and and also like who knows within the editorial hierarchy at the post who those sources are so they can be confident and do any fact checking that's necessary\nSo that's a great question Terry and it's really him in a really important one\nAt this moment because we do depend on anonymous sources um for a lot of the stories we do and frankly if we weren't able to use anonymous sources\nWe would really be unable I think to give our readers in the world an accurate picture of what's happening in the U. S. government inside the Trump Administration inside the CIA or abroad\nAs Bob Woodward says over and over again I wouldn't really say anonymous source the reporter knows who the source as it's the readers who are kept in the dark about the SARS but it's not like you know that that really have any of the information\nThat's absolutely right the sources are not anonymous to us\nUm these are sources that um we know who they are um many in many instances their sources we have known for many years and have developed trust in because of how reliably they have given us information\nUm and you know frankly even in that case when we're writing sensitive stories I we talked earlier about the the Mike Flynn story in how we ended up\nHaving nine separate sources there's no magic number nine was not the magic number we had to get to to be able to go forward with the with the publication of that story could have been two or three\nIt's more about the caliber of the sources their their positions and whether they have access to the information that they are providing a how trustworthy are they how much do we know about them inside inside the Washington Post there are lots of conversations at varying levels of specificity about that sourcing\nSo sometimes you might be asked well what is the position of the ... where is the source in coming from from the story um who are we talking about here and you can you can basically described their positions in government\nSometimes if it's highly sensitive senior editors are going to want to know more they're going to want you to identify your source and that you know that sometimes can get a that can get touchy depending on the nature of your agreement with sore say or source be\nBut it's something you know ultimately despite you know we we all of these accusations and criticisms that's our reliance on anonymous sourcing\nI mean the the records of sort of holds up the stories that we've written over the past two years attributed mainly to anonymous sources of almost all proven overtime to be accurate I mean there might\nAre there were a news organizations aren't perfect in ... and we do make mistakes but boy we've gotten a lot right\nUm and I know Marty Baron executive editor at the Washington Post talks frequently about you know the post and other news organizations um are always trying to get it right but at this moment in our history where we are under such attack all the time and accusations of fake news\nYou know there's extraordinary care\nGiven to getting the facts and even the nuance exactly right it it's really it would really be damaging to not just the Post's credibility in my credibility as a journalist but to\nThe broader um journalistic community if whenever we get things wrong there's a lot riding on the media right now in its ability to do its job and do it well and do it right let me try to give you one more example of\nThe reporting environment that we're trying to operate in just how much pressure we're under as reporters how much pressure our sources are under a as well\nUm there came a time this past year when\nThe Justice Department in Congress released the memos that former FBI Director Jim Comey had kept every time he met with Trump every time he meets with Trump something happens troubles him he goes straight to his computer types up a memo to record what ... what transpired\nOne of those talks about a conversation he had with Trump in the oval office and most of the coverage about that memo focused on their interactions about what Trump wanted him to do in terms of backing away from the Flynn investigation\nBut Trump has also complaining to call me in that in that setting\nAbout the leaks that are plaguing him at that point early in his administration he's complaining about how people Howard news organizations learning what I'm saying into this phone and he points to the phone on his desk and the oval office\nHe's complaining about stories and he's talking as I read this memo I realize he's talking about me he's talking about the stories that I had written for the post\n... is talking about yes I agree with you sometimes it's great to put somebody's head on a pike as an example the Trump goes on a joke about putting\nTrump goes on to put joke about putting would just say he believes reporters should be put in jail or in jokes about how once reporter spends a little time in jail they make new friends suddenly they're willing to talk\nIt's a really disconcerting moment for anybody in journalism anybody who cares about journalism um but for me it it was just eerie um to to think that he's talking specifically about stories I had written for the Washington Post\nThey're talking about heads on pikes reporters in jail chasing down sources it was it was unnerving it make you afraid\nWell let me let me put it\nIt made me afraid I I was confident enough in my ability in in how I approach sourcing that I wasn't worried about that I work for a news organization that has my back um and that's a good feeling\nBut it is frightening in a way Terry and I remember talking about this at home um when I saw this memo describing this document to my wife and what what's in it\nAnd our seven year old was at the table with us and he heard me talking about it and using words like jail and he's following this conversation and I maybe it was being too careless his parents and bringing the subject up in front of him but he started to cry\nA he started to get really worried and asked whether I was going to be put in jail\nIt's um we're just trying to do our jobs um we're just trying to get to the truth we're trying to fulfill the role that the founders and vision for for the media in this country and it's an important mission\nWet Miller thank you so much for talking with us and thank you so much for your reporting\nThank you\nGreg Miller is the author of the new book The Apprentice Trump Russia and the subversion of American democracy he covers intelligence and national security for the Washington Post\nAfter we take a short break TV critic David being Cooley will consider how the season premiere of Saturday Night live and sixty minutes covered last week's Kavanaugh's confirmation hearings this is fresh air\nIt's fresh air on an HP aren't coming up at ten o'clock it's as it happens from the CBC\nTen dollars a month combined with with everyone else's really adds up when you contribute ten dollars a month or you get to choose a the new headphones tease it thank you gift um bring it really think you're really going to love it there's there's a lovely picture of a big heart listening to an each PR it's kind of\nA metaphor for for what we do um uh contribute now and and and get your chance for that T shirt and H. P. R. dot org just a place to do it and thank you very much\n[noise]\nDisadvantage yards three o'clock [noise] support for an itch PR comes from you our listeners and from the elm street group at Morgan Stanley investment professional for global perspective and helping clients achieve their investment goals female the elm street group at Morgan Stanley dot com [noise]\nAnd from Red River theaters preventing Fahrenheit eleven nine by Michael Moore cast a getting a system and society that what the outcome of a presidential election details I Red River theaters dot org [noise] this is an HP are\nThese are the stations in New Hampshire Public radio\nW. E. V. O. conquered nine point one\nW. E. V. S. Nashua eighty eight point three\nTo ... age or Ninety One point three W ... keen Mandy point seven WABC Gore him one of those seven point one\nW E v J Jackson Ninety nine point five\nWCBS cobra Ninety point three ... W E v cue Littleton Ninety One point nine\nAnd on line at an H. P. R. dot org than President Trump is in Philadelphia today but before departing reporters caught up with him on the White House lawn with more questions about Supreme Court nominee Brett Kavanaugh among other things they asked how he would feel\nIf the report shows Kavanaugh lied to Congress\nI don't think they should lie to Congress under a lot of people over the last year that have laws that Congress to me that would that be acceptable\nSenate majority leader Mitch McConnell has promised a floor vote this week even as a probe continues he says each lawmaker will get a copy of the FBI report on sexual misconduct allegations against Kavanaugh\nDemocratic leader Chuck Schumer says he wants a briefing at least twenty four hours before an initial procedural votes\nWhite House economic adviser Larry Kudlow is defending the administration's new trade agreement with Mexico and Canada as NPR's Scott Horsley reports that agreement drew criticism from the conservative editorial page of the wall Street Journal\nKudlow who's a former CNBC commentator calls the Journal's editorial writers dear friends but he takes issue with their criticism of a trade deal nothing is perfect Kudlow says ... an update to after which could affect a quarter century ago\nWe've improve the supply chains of tariffs would we notice a tariff free zones and spin effect sly James would be their business will not be disrupted all those threats have not come to pass so I could do all the presidents are spread never mind that it was depressed\n... change with promises to tear up NAFTA if you didn't get his word Kudlow stumbled over the name of the new NAFTA which Trump insisted on rebranding as the u._s. um so you're Scott Horsley NPR News the White House\nThe Trump Administration has started denying visas this week for same sex partners of un diplomats who are not married NPR's Leila Fadel reports the state department says the change in policy is about equal treatment\nThe department says the shift makes the policy consistent for same sex and opposite sex couples so same sex domestic partners can no longer get derivative diplomatic visas unless they are legally married this will also impact other foreign officials like ambassadors and fulltime into the employees\nBut many worry that the shift unfairly targets couples who come from countries where same sex marriage is not legal former UN ambassador Samantha Power who served under President Obama tweeted that the change in policy is cruel and bigoted\nGoing on to say only twelve percent of un member states allow same sex marriage in some cases these relationships are punished\nPeople stationed in the U.S now have until the end of the year to get married somewhere where it's legal ... NPR News\nThe Dow is up a hundred and thirty six points this is NPR\nSupport for NPR comes from NPR stations other contributors include constant contact who's email marketing tools help small businesses and nonprofits connect with their customers learn more accustomed contracts dot com and that listeners who support this NPR station\nThis is Renee Montagne in today's media climate reporters are not always where they need to be newspapers are cutting back or shutting down cable channels are closing bureaus and doing less reporting from the field at NPR though things are different\nWe still send our reporters out every day across the country and across the world\nAnd it's not that it's any less expensive for us to do it then for other news organizations it's just that we have the missing link to help make it possible a link no other organization has we have you you as a contributor you as a public radio member\nAnd in a society with a free press that is not able to do its work for free yours is the most important contribution of all\nIt is because of you that we're able to do the work that we do here at an age PR and public radio stations across the country\nAnd HBO provides you with high quality news we've got seasoned journalist from across the region and also journalists from across the globe upbringing you reporting the second to none today we're asking you to contribute in any amount to help pay for the news you trust and the programs that you love\nGiven out the your checking account or credit card debt and H. P. R. dot org\nWe're trying to make this fund drive a little more fun and we've got a bunch of really cool giveaways or that you can get 'em when we've also got some ah some drawings of one of those um if you make your gift at ... dot org right now you'll be entered to win to south ... south west excuse me airlines one thousand dollar gift cards\nImagine telling a friend or family member that you're going to take them on a trip\nAnd then you have the air for covered they would love you for that\nThe best way to give is on line or through your checking account or credit card an HBO dot org Fifteen or twenty bucks a month or works um you appreciate it given out any fear that or the phone number just in case is eight eight eight eight oh five six four seven seven called uh go on line now to support them as you trust and the programs you of\nAnd you know this is a moment that I really love taking a look at listener comments people who have already given and have told us why they've given I'm Susan\nAnd reporters like Shon Hurley Ira Glass Nina Totenberg\nWho gave inspiring reasons to donate today that said we've been hearing from a lot of the greats here at public radio I giving you really great reasons to contribute\nAt John and western Vermont is an excellent station when I'm traveling outside of Vermont thank you for being there and I'm Glad I can support you thank you John and thank you see this and we truly could not do this without your support and we appreciate you telling us why it is that you care\nIf you're looking for the best way to fit a contribution into your budget um one great way to do that is to become a sustain or so that means giving automatic monthly support with no yearly renewal to worry about uh you give five ten maybe Fifteen bucks a month the amount of totally up to you\nWhen you choose to be assisting or you'll get special access to our pledge free stream so you would not be listening to me tell you this right now which gives you the ability to listen to in each PR without hearing the pledge breaks\nLike the one I'm Talking like the one we're we're doing right now give your checking account or credit card go to an H. P. R. dot org the phone number is eight eight eight eight oh five six four seven seven\nYou can become a stain or Fifteen dollars a month and when you do you've got to ask for the un HP our new heart phones T shirt and mug combo I Love them both\nAnd you're going to love the new eye catching design it's got a big heart with headphones on and New Hampshire public radio right below him the T shirt it's a charcoal grey\nAnd the mug is bright red with the same heart phones plus two words trustworthy and love worthy\nYou can see a picture of the T shirt and the mud when you go to an H. P. R. dot org to contribute you can also give us a call and we'll talk you through the description where it won eight eight eight eight zero five six four seven seven\nHeart phones is a recording of the school of it um well you know the middle of the great thing about an HP are coming up we've got fresh air with Terry Gross every day as she gives contemporary issues an art to look through thought provoking often intimate conversations\nSome people make all the talk show 'em but if you listen regularly you know that it it doesn't really fit that traditional mold um went awarding fresher ah the Peabody Award the committee said fresh air is is so show quote with probing questions regulatory interviews an unusual insights\nThat's what makes it one of our favorites one of my favorites um and ah we think it's a reason enough to to give in each PR so you can support that programming to do that go to an H. P. R. dot org or give with your checking account or credit card or if you'd like to the phone number instead that eight eight eight eight oh five six four seven seven\nTen bucks a month right now gets you the heart phones T shirt and looking at it right now it's got Robin egg blue on it it's it's pretty cool um again you've got to go to an H. P. R. dot or to get involved a and thank you very much\n\nIs fresh air I'm Terry Gross\nThe federal government under President Trump is the subject of the new book the fifth risk by my guest journalist Michael Lewis who's also the author of the best sellers Moneyball and the big short which were adopted into films and the undoing project\nAnd the head of the Commerce Department Wilbur Ross is not now involved in a lawsuit pertaining to a question on this sense as um I I don't know if there's a definitive or not the question on the twenty Eighteen census whether it's on there and\nWhile they're still is still argument about whether they're going to insert on the census a question of establishing whether the person who's replying to the census citizen what we'll do is queer the responses to the census\nLet's let's talk about why because a lot of people will be afraid to answer that question\nWill be if people will be afraid to answer the question or people will be suspicious of the motives of the census takers\nRight and and a lot of immigrants live with somebody who isn't here legally so even if you're here legally if you know someone who isn't you might be afraid to say that you're an immigrant\nI think at this point that even people who are here who are legal who are fearful though actually because that's the back of a second they haven't even begun to prepare them for the census I mean the the the real problem with the census is that it's way behind schedule when it hasn't been budget it for\nSo there's some question whether they're going to be able to pull off the census in the first place but then how you pull it off\nIs another question in there and starting this they're inserting a question it seems designed to dissuade especially Latinos from answering it\nAnd one of the consequences if Latinos are underrepresented in the census\nFor starters you don't get a picture a correct picture of the correct congressional districts so we're districts need to be with redrawn because of shifting in the population they won't be redrawn\nOf late one of the things we've learned is just how valuable the date of the government collects is researchers have been doing things with this data that they've never been able to do before and so for example\nUm we wouldn't know that there was an opioid crisis in the country if the data on prescription drugs had not been made available and not been possible\nIf we don't have a picture of what the society looks like there's all sorts of misunderstanding of the society that will occur\nSo that people suing Wilbur Ross the plaintiffs include over a dozen states in big cities who say that he acted improperly and trying to add this question about are you um are you a U.S citizen I'm that he acted improperly and trying to ...\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nSince as you say commerce has more to do about data and I don't want to sound ages here but I'm data and how it's collected and how it's interpreted has is changing so rapidly and I have no idea if he's kept up with what that means anymore\nWell we know he was falling asleep in meetings where he was supposed to be learning about the department and I know that the people who try to explain to him how the department work came away and these were Republicans who who were brought in to try to explain how the department worked to him\nFound that he was really utterly disinterested in anything betrayed so even if he was an eighty he just wasn't particularly interested in the mission is apartment additive at\nWhat became very curious is that the exposure is finances they put them in a bad order with the White House you know he had to declare as financial holdings ... when he was nominated for\nThe job and it turned out he had two billion dollars less than the forms rich list to calculated him having and four of us who watches this investigation discovers that he'd been lying to the for the rich list all along\nWhich then apparently caused Trump to take a lot less of him but he you know he is an odd choice she was very odd choice because with that department really needs is someone who's really comfortable with technology [noise]\nWell if you're just joining us my guest is Michael Lewis and his new book is called the fist risk and the book is about the federal government under President Trump and the book looks at the energy agriculture and commerce departments [noise] we're gonna take a short break and we'll be right back this is fresh air Hi\nI'm Ron Elving the twenty your team mid term elections will be one of the year's biggest news stories the stakes are high on we're a long way from knowing who wins\nBut even when the results are in they'll leave us with questions questions about the future of our communities are states and our country you're counting on us to be there with the latest news from Washington and reports from your community to explain what it all means for you your friends and your family all of us here are counting on you to\nElection is months away your challenge is now this is the time to ensure our future is a place for in depth election coverage expert analysis and measured conversation [noise] become a sustaining member now it's a simple and when you're done you can relax because you know the election coverage\nYou need will be there for you and your neighbors thank you for all of us [noise]\nUse in each PR because you want to keep up with the news I Do too I have to it's my job I'm here with Hannah McCarthy and uh my name is Robert ...\nYou know the news affects you whether it's from the other side of the state or the other side of the world day after day you choose to listen to in each PR for high quality news and information today we're asking you to contribute any amount to help pay for the news you trust because this is in each PR member Dr this works only when every listener contributes on than any amount that they can\nGive out your checking account or credit card at N. H. P. R. dot org\nAnd as usual we have a ... going on throughout the fund guys and one that I find particularly wonderful is one for a one thousand dollar gift card from Southwest Airlines you know I have lived in New England most of my life and still every single winter winter around\nJanuary and maybe mid February\nI get the edge to go somewhere warm to just get some kind of ...\nSnow of New England though I Love it\nAnd you know if you have a thousand dollar gift card from southwest you're not really burdened by you know waiting for the best deal are planning Lee ahead you can wait until that moment hits and decide you know what and buying myself a plane ticket right now and I'm going to a robot or Jamaica or Bermuda\nAnd you can also use that card to bring people to you I mean imagine what an amazing gift that is to say hey I Want you to come visit me but it's all expense paid I'm taking care of it\nIf you contribute today you will be entered for a chance to win this gift card you can do that now and H. P. R. dot org\nOkay now it's back to the ongoing segment that we're doing today which is reading listener comments which is a really fun part of the fund drives okay so we've got James H A n keen he says daily all day cannot live without and listen to nothing else on the radio enjoy the humor thanks Rick\nThinks Rick his name as an wreck he's thinking like okay that's a thank you for Rick uh see another one um we've got Sarah and Deerfield she says excellent and informative reporting so their contributions together with yours a and lots of other ... other listeners like you provide ongoing news programs were\nAsked me to do today is joined them go to an H. P. R. dot org and make a contribution in any amount if it's for you\nTo think about how much you gain from an H PR you've got the news of the day the context for ongoing stories cultural stories the unexpectedly fascinating stories and laugh or to thrown in often from are very young ... Danley\nI this is worth your financial support especially since listeners provide the largest share of the money to keep an eight to PR on the radio\nSo think about just Fifteen or twenty dollars a month that you can give to the station that you listen to all the time that you gained so much from support news ideas and information and do it right now become a sustain are at an H. P. R. dot org or call us remember that one eight eight eight eight zero five six four seven\nSeven right now he's got a special thank you gifts for those that can contribute a twenty dollars a month we have a New York times digital subscription um and uh the trustworthy love worthy because what what what we're calling it's a public radio muggy every one of your hands on one of those\nUm when you make a sustaining monthly gift of just twenty dollars you can ask for a year long new New York times digital subscription and the in each ... newest it's the newest mug a trustworthy level where the um when you choose this thinking if you will get unlimited access to all times content throughout any smartphone tablet or a ... a Web browser\nAs you are browsing the time you can ship your favorite beverage from your new favorite in each PR red mug show the world how much you appreciate in each PR with a twenty dollar gift go to any fear dot org again she's that New York times description with a twenty dollar gift\nOr the number of years eight eight eight eight oh five six four seven seven uh and thank you very much\n\nThis was an HP ours free twenty nine support for an HP are comes from you our listeners from downs rock than Martin business law group providing legal services are growing and established companies throughout northern New England more at the R. M. dot com\nAnd from the courier museum of art for them to blue trees and environmental community art installation at the courier and in city parks now on view details that career dot org\nInterim absolute resource associates or Fort Smith providing drinking water lab and office for the fast arsenic led bacteria and more\nAnd I am Hannah McCarthy co host of the civic center one pot cast with Nick ... sending a thank you out to lily in Texas and reminding olive you out there that we actually have a mid terms special series the first of which is dropping today you can find it on line that civics when one podcast\nDot org and programs like this like the next one to one like fresh air it Terry Gross everything that we make here at the station that we bring you some stations around the country is made possible by listeners like you and today we're asking you to help pay for these programs\nBy contributing during our fall fence drive you can do that and H. P. R. dot org I'm Hannah McCarthy and with me here in the studio is Robert grow that\nYeah you know I I haven't been fishing to make eye or like Lilly or listen to civics went on back when I was in California and it was a just a great resource for to learn about the politics and and get read up on everything listened up I don't know whatever you want to\nUm when you make your gift note and HBO dot org you'll be introduced into Southwest Airlines one thousand dollar gift cards\nUm imagine telling a friend or family member of your going to take a trip a move back to California um and you have their airfare covered the best way to give as much of your checking account or credit card Fifteen or twenty dollars a month works\nAh we're asking you though now to do your part and give now a support civics when one all the great reporting that comes out of an each PR you knew that at a by calling eight eight eight eight oh five six four seven seven um or the best way to do it really is an H. P. R. dot org\nAnd we want to get you back to fresh air as soon as we can you know fresh air is really a one of a kind show Terry Gross treats us to interviews with people from around the world with newsmakers with celebrities and even if you've never heard of some of the guests that she had on the show you know that are really great conversation is coming up her Congress\nA movement or a movie or a life for a life's work\nAnd if you've just discovered fresh air and if you've just discovered an H PR welcome but know that your support right now no matter how recently you've discovered as helps to pay for all of your favorite programs here at the station can act now it's simple when you get on line at an H. P. R. dot org\nWhen you listen in each PR you're you're getting your great journalism everyday um so we're asked me to do now is make a generous gift of maybe ten Fifteen dollars a month um when thousands of listeners step up to do that ensures that this great journalism gets to keep going that it continues\nUm we continually separate fact from fiction in the news every day spend half truths false foods\nI'm One of the roles of the free press releases to walk past the spin and call out on a lot of the false heads that that gets ... around on Facebook or or anywhere else\nPublic radio journalists are persistent and courageous in their efforts to report the truth um these professionals are supported by listeners like you listen and contribute um we're what we're asking you to do now is um show your support go to in each PR dot org or just takes a couple of minutes really\nAnd if you go to an H. P. R. dot org right now and contribute five dollars a month you can choose the new red mug this is our latest in a series of any age PR mugs with the words trustworthy level where the on it it features a heart wearing headphones listening to none other than of course and H. P. R.\nAnd you can be one of the many who like me collect your local public radio ... and this is one of my favorites so far you can see a picture of it and if all of the thank you get when you go to end H. P. R. dot org to contribute you can also call us here we are at one eight eight eight\nZero five six four seven seven again now is the time to contribute and if you already have the thank you we couldn't do it without you\n\nThis is fresh air and if you're just joining us my guest is Michael Lewis his new book the fifth risk is about the federal government under Trump a lot of the government as a often dismissed as being a\nBureaucracy that slows down anything it slows down enough and prevent anything from getting done\nAnd that it's just like layers and layers of of bureaucrats of like managers and\nI'm so lazy stupid people is it has your has your an understanding of like our bureaucracy change through writing these stories\nOh my God I so I didn't know what I was going to find when I start knocking on the door of the Energy Department or the agriculture department the Commerce Department and archer to having exactly the same experience\nThe political people have when they're appointed to these jobs running these places and have these some preconception with vague preconception of what the bureaucrats are like\nUm this happens over and over again that that a new administration comes in\nIf they have cut up contempt vague contempt for the people who were there and four years later they walk out and say those are the most amazing people I've ever worked with I I expected to be brief can be you know become informed about these people I did not expect to be inspired by them\nThe kind of person who is still working in our government despite all the abuse the government takes is is a mission driven person they're not paid well\nUh they're they're because they're interested in the task the people in the national weather service or people who have had a passion for the weather since they were little kids the people in the department of energy aside just about a passion for their particular size since they were little kids\nAre essentially it's essentially what they are all these people are firefighters are in spirit and\nMoving about groups of people who were doing what they're doing not for money but from mission uh they they have a purpose in life and it just jumped off the page I mean it jumped is jumped into my mind to dealing with the Minnesota I came away from it thinking [noise] wow\nI Can't believe we as a society of treated the this slice of our society these kinds of people who are really the best among us as badly as we have and\n... yeah the structure screwed up that's what's screwed up people screwed up it's screwed up that it takes a hundred and six days on average to hire someone new in the federal government or or you don't know your budget when you're planning or that\nOr you make a slight is mistaken you you become public enemy number one but you do something really great no one pays any attention all that's really screwed up\nBut that's about their fault that's our fault\nAnd that's that's sort of needs to be fixed or because in a way what we're doing is wasting the greatest spirits in our society\nWell Michael Lewis quite to talk with you again thank you so much thanks for having me\nMichael Lewis his new book is called the fifth risk\nTomorrow in fresh air my guess there'll be a camera Jenkins who wrote and directed the slums of Beverly Hills and the savages\nHer new movie private life starts Catherine hunt and Paul Giamatti\nAs a couple in their forties trying to have a baby do any means necessary ivy F adoption egg donor I Hope you'll join us were closed today show with a song from one of my favorite moments of my career but it's with great sadness and I'm going to play this for you\nThe person who made this moment possible died last week ...\nSydney was famous in San Francisco's arts and literary world for Nineteen eighty founding city arts and lectures a series of onstage readings lectures in interviews\nThat she ran until retiring last year\nHer series became a model for cities around the country one of the things she left to do was to book a guest and then find an interviewer she felt would be a good match she loved Rosemary Clooney and knew I did too so when she managed to book Clooney for a concert and interview in Nineteen Ninety seven\nCindy invited me to be the interviewer what a privilege to share a stage with Clooney and what a wonderful generous perform and she gave another time Sydney and I worked together was when the annual public radio conference was held in San Francisco\nAnd city arts and fresh air co produced an event for our fellow radio folks was an onstage interview with the great magician and magic historian Ricky Jay Cindy was part of the radio community she produced a radio version of city arts and lectures that was broadcast on cake you eat the in San Francisco\nAs well as over a hundred other public radio stations around the country although we lived on opposite coast Sydney and I became friends\nSydney changed my life in several ways and so that a couple of people she introduced me to but I Want to thank her not just for being a friend and colleague but for ... to the world of arts and culture\nThe boost she gave writers and the thousands of interesting evening she gave audiences\nCount me as one of the very many people who mourn her loss I send my deepest sympathies to her family [noise] here's one of the songs Rosemary Clooney performed onstage that night at city arts them after [noise]\nSentimental\nMy ... [noise]\nSense to me and", "year": "2018", "show_name": "Fresh Air (NPR)", "city": "Keene", "day": "02"}