{"month": "10", "state": "GA", "station": "WNGH", "content": "[noise]\n\n... and beyond this E. G. bb radio on line and GB news dot org I'm Tom Barclay it's seven fifty nine coming next savannah music festival live followed it nine by the green island radio show [noise]\nHello this is Harry oh done inviting you to join us for the next green island radio show when we bring in music from Tampa Katie Eileen iris fair port convention\nThat's the next green island radio show [noise] see then tonight at nine here on GB radio and on line a gp be news dot org\n[noise]\nNinety seven forty seven FM double your G. P. B. S. W. A. G. P. H. D. role portable Georgia Public broadcasting radio network [noise]\n\nJulian lodging Chris Eldridge crafts songs that sounds familiar but never easily classified\nChanges a bluegrass in folk insinuations of jazz and pop into classical would add on guard composition\nThey rarely settle into any one category\nRather their music dances around the territory between genres put traps at every turn\nDo are simply push themselves to find new ways to play their flat top Martin Guitars and very special ways\nWelcome to savannah music festival live\nI'm Ryan ... making it over the next hour will listen to a two thousand seven\nBut Martin Guitars and very special ways\nWelcome to savannah music festival alive\nI'm Ryan ... making it over the next hour will listen to a two thousand Seventeen performance given by Julian lodge and Chris Eldridge special guest IPO Donovan at the Charles ... center\nAfter meeting and jamming backstage at a punch predator show Julian lodge in Christ Eldridge became fast friends and eventually started playing concerts together\nThey made their severely music festival debut in the spring of two thousand fourteen after having only known each other for about twelve months three years and many concerts later\nThey return to our festival in the spring of two thousand Seventeen on a tour called released the hands well let's go now to the stage of the Charles each worst center and trustees garden and listen to the set by Julian lodging Chris Eldridge along with a bow Donovan\nAt the two thousand Seventeen savannah music festival\n...\nThank you so much credit is going to the new one now\nYeah Google things in life\nThat all the\nDumb things in my\nSome things in my\n... by ...\nIn a\n\nA\n[noise]\nNah\n\nI'm\nOne\nGoing to go\n\nOn and on my view in [noise]\n\n\nChange\n\n\nAnd [noise]\n[noise]\n\n\nDa da da da da da da da\n\nLet's say if you fall down and [noise]\n...\nHow we're going to play one more a song for you guys thank you all so much you would have been truly a great audience the place where it's been really fun\nThank\nYou to get everybody\nEverybody works here is awesome um we're just so thrilled to be here and thank you all once again we're going to do a song to close out that ah I stole from my my father's banned um just to to to make a long story short it was my favorite song when I was little kids to open up the window Noah and um\nWhen I was a boy the word the course goes open up the window open up the window open up the window and let the dump fly and it's like a you know no a dark kind of song\nBut I really love that song and I\nBecause I thought the words were open up the window open up the window open up the window and let the bugs spy and [noise]\nI don't know what that says about me but\nCertain like the song anyway a thanks again and we'll see you later\nOwn a looming on the line you\nKnow there is to the store", "show_name": "Savannah Music Festival Live", "year": "2018", "city": "Chatsworth", "day": "29"}