{"month": "10", "state": "FL", "station": "WJCT", "content": "Anyway Andrea Ingram entered the D league with the hopes of being called up to the NBA\nYou end up staying for ten years\nAlmost nobody stays in the league for ten years it pays so poorly roughly twenty five thousand dollars a season\nThe most young players give it a year or two before going to play pro in Europe or elsewhere\nIngram tried Australia briefly didn't like it plus\nHe wants to stay nearby just in case the NBA finally came calling\nThere were many times where I was you know ready to just to turn the other way and do something else and uh you know wife and kids family you know the the legal Julie's not paying you much like you know you need to do something else like I came to that point so many times and you know something kept me going every time\nLast year he played for a team called the south bay Lakers they're owned by the NBA's Los Angeles Lakers which you've probably heard of Ingram led the G League in three points shooting percentage but still he was thirty two years old by now and still in the ... league for extra money tutor kids in math\nAt the end of the season he was called in for his regular exit interview so\nYou know I'm thinking All right this is you know the same old thing but then we did upstairs begin this big conference room and not only use the GM in head coach there our president is there and I'm like okay this is a bit different I've done this before and usually our president's not hear\nThe president he's talking about is the president of basketball operations not for the south bay Lakers but for the Los Angeles Lakers Magic Johnson you've probably heard of him too\nSo you know heart is kind of racing at that moment and then they tell me the news\nThe news was that the LA Lakers with just two games left in their season we're calling Andrea ... up to play he would make his NBA debut at age thirty two but\nJust everything that I was feeling is exactly what you thought or would anybody with thing no one my story nor my situation I just didn't let it out like my wife and ah my mom did when I told him to lose they let it out they just let it be raw and you know the real emotion that you know people love to see\nUm I was a little bit more to do but was feeling at all inside and so you know immediately after that though my first thought goes to okay you who do we play again tomorrow\nThey were playing the Houston Rockets late in the first quarter Ingram finally got his chance to play in the NBA\n\nAnd I think before I got there is in the night before was when all the emotions were running wild and I'm not sure how to feel than it was so excited get nervous and all these other things but when it came time for the actual game it really turned into basketball very quickly for me and made things a whole lot easier how easy it was it [noise]\nIngram scored Nineteen points that night including for three point shots it was one of the best debuts in Lakers history as one of the most amazing debuts ever is thirty two year old ... [noise]\nThe crowd began chanting MVP MVP [noise]\nSo\nUh we had no idea of the reach of this until my brother and my niece had called and told me they said hey you are blowing up on Twitter you ... you know your everywhere and you just have no idea\nSo I Know that your great three point shooter um historically great so but forgive me for saying this\nYear's shot looks a little bit\nInstead of you know with the um it's you know it's a little off balance and I know it works but I'm really curious to ask you I don't mean just to insult you it's an insult with a question do I get it I think that maybe is part of what's kept teams are in the past from from giving you a shot at the NBA and\nAnd I asked is thinking about um the story about Jeremy Lin knew so many teams overlooked\nAnd they later admitted they overlooked him because he was an Asian guy and he didn't fit the template of what you know an NBA player was and I'm curious if whether you think that you're an traditional shot may have ah hurt us in some way even if just like perception wise\nYou know what that means a good question I don't think so I Would say the gray hair probably has more to do with it but\nThen I guess maybe the the awkwardness the shot or\nNot not so much the awkwardness of it but the release point of it because it's a bit lower than most guys I'm already not the tallest guy so maybe there is worry about well hey this shot is going to get block that are leaving the guys are too athletic for him to get that off so maybe that was a maybe that was the thought to be honest with\nYou All right so here's the big question um what's your future\nYeah so right now I'm uh my agent is in talks with a you know different teams were trying to get into a training camp right now that's the goal and you know hopefully there'll be some new soon to be but nowhere yet\nSo what happens if you know you don't get in a training camp you don't get to play for an NBA team what do you do this coming season\nYou will um it could definitely be the G leader did um you know and it it could be another season of it I mean the job for me is simple you know just stay ready but the goal is and we will be continue into play that that much I can tell you\nIt's interesting you know as a sports fan I've been you know my whole life seen people ... trying to squeeze meaning out of sports beyond the game itself and a lot of times it feels kind of force but it strikes me that your story was really different what is the lesson that we maybe should take from your story ...\n... what I Would like for people to get out of the most is that it it it wasn't just that you know I stuck with it all the way through and was happy about it all the time I've definitely had doubts ahead\nYou know disbelief discouragement you know you don't get to something or any dream or anything we're having um just you know Scott Free but I think that part about it is is the real is part\n\nWe use joined me in wishing ongoing Ingram the best of luck whatever happens next\nTo play us out today here's his family's gospel group Maggie Ingram in increments this song is called appropriately enough\nWork until I die [noise]\nI'm Stephen ... and that was pre comics radio thanks so much for the thing we will be back next week and if you don't want to wait that long you can find our entire freakonomics radio broadcasts archive at freakonomics dot com foreign ... and you can always subscribe and listen to the latest three months of episodes on any podcast\nAlert today Florida working to improve the safety of bicyclists and pedestrians distracted driving not only puts motorists at risk those who walk and bike are particularly vulnerable the role of public safety begins at alert to the Florida dot com\nJacksonville Center for clinical research and W. J. C. T. present insomnia argue nocturnal and informative luncheon learns seminar Thursday October eleventh at W. J. C. T. studios registration at W. J. C. T. dot org\nThe distinctive Mediterranean look up coral Gables is largely due to the influence of towards marriage I broke my ankle and coming up on water frontiers weekly radio magazine of the port a Historical Society we'll talk with Mary biographer are more part\nWill discuss historic Sanborn fire insurance maps and talk about Ernest Hemingway six two cats\nThat's loaded frontiers Monday evening at six thirty on eighty nine nine W. J. C. T.\nJoined us tonight at seven W. J. C. T. presents radio the other\n[noise]\nIn age Steve from palm coast to the golden miles this is eighty nine nine W. J. C. T. F. M. Jacksonville listen to anywhere on your computer or mobile device at W. J. C. T. ...\nYears to find a man question for you okay what is the best way to raise the price of milk died and more people that drink it made me when I'm thinking about history here think back in Nineteen Seventy seven with Jimmy Carter was practicing\nSo to raise the price of milk government basically opened up the world's largest cheese shop\nAnd their talent and can am planning many we can get one of the world's largest [noise] and we discover what happens when you met with supply and demand\nAnd I'm Guy Raz and how I don't believe that the empire was taking when he landed in jail in my life is titled yeah very much\nI thought my ... but I get out the sense that I could get\nOur economic and innovation on any money\nThis was generally the approach that we would use to support other kinds of farm industries the government would buy up say massive amounts of corn or wheat and then just throw it into a silo until we needed it for some reason\nBut that does not work for milk because milk starts going bad the minute it comes out of the cow felt so mostly water so you got to haul it around into like gas tankers\nThe federal government wouldn't have before you started do what to do was tanker loads of milk what was the government's too if you drove is into downtown Washington and said here you go\nSo the clever folks USDA's or what if we went down to supply chain one step at a and looked at dairy products that are storm\nSo the basic question was what kinds of milk products can the government by and store\nWas one nonprofit dry milk and cheese and in particular a shuttered type trees so\nTo raise the price of milk the government basically opened up the world's largest cheese shop you know in powdered milk and butter too\nSo the the way this program works literally is the federal government puts out a piece of paper that says we will buy as much cheese butter or non federal crime milk because you want to sell to us at these prices mhm our operators are standing by let us know\nUSDA figured out that if they paid about thirty nine that for forty pound block of cheese then it would have this ripple effect government buys more cheese cheese makers by more milk and the resulting demand just pushes the price of milk that\nThe government is creating a price for and in order to do this they have to be willing to buy all of the cheese that anybody wants to sell them at this price\nAnd if you're a cheese cellar and you hear this that someone's going to buy your cheese at this high price you're like well I'm going to sell the crappy as cheese at that price so to prevent this the government said look if we're going to buy your cheese first you have to meet with Bob\nYes I started in Nineteen sixty seven ... with the U. S. D. A. and I was hired as a cheese greater\nYou were hired someone to show up with a ... a greater where you do quality checks on this must be a common confusion in the industry yeah a greater yeah Bob ... was one of the government's cheese graders he spent Thirty years testing and tasting cheese for the United states government\nYes this is a real job it sounds amazing\nAre you pretty annoying to eat cheese with like are you the most picky cheese eater in your group of friends I Am absolutely\nNot I owe any cheese in fact if you see my shape you would know that I eat enough to keep the little\nBugs job was to make sure that all of that she's met USDA grade aged cheddar standards the right choice or level the proper shade of yellowish orange to correct flavor profile\nSo if you wanted to sell choose to the government Bob would show up with this like hollow Raj called E. cheese trier and you inserted into the block or the barrel or whatever when you turn it and you pull out a quarter of cheese a little core sample of cheese yeah ooh\nAnd that's what you grade and ah they're Seventeen flavor defects that could happen in cheddar cheese\nI can tell you what we had to reject it for a flat bitter use the mall the old mill Rudy Rudy great taste like apple that sounds lovely you don't want that know how metallic sour ... onion Barney life ... and ... and you can taste all of those things in a piece of cheese you betcha\nBob says the number one flavored effect he had to look out for was acidity a teeny bit was allowed\nBut not too much anyway the government had its plan in place it was ready to start buying cheese and it took a few years but a flood of she starts to come in\nSo much cheese that Bob starts having to spend more and more time on the road because he has to actually go to the cheese degrade it\nHe and his colleagues or drowning in cheese and they go to their bosses know like we need more cheese graders and so they try to hire more cheese graders I travel\nThirty nine states and I was gone as long as ten weeks at a time doing that so getting people to do it was always a challenge the young people do they see\nWell I Can't go out with a girl or I Can't go out with a guy because I'm On the road all the time\nWho's got time for dating when you're traveling around eating cheese everywhere\nI think cheese eating as better than dating sometimes I don't disagree with you I don't agree with you\nMore graders creating more cheese that the government than by is\nBut then we had that issue was storing stuff I mean every warehouse in Wisconsin was full all our area around everybody had she's even the beverage distributors they head cheese and the storage I mean we had cheese and every cold storage in the United states including the caves in Kansas that were full of that stuff\nThe caves in Kansas yeah the underground caves the government of the United states of America\nHad caves full of cheddar cheese\nAnd when you get out that the government is filling a cave with cheese the press goes nuts because this is exactly what people think of when they think of a government program gone awry like this is the original bridge to nowhere\nTo secede cave full of cheese in Kansas City\nCatholic actually like to welcome you went a little\nI had to kind of had to of course you did\nOh I Am currently about thirty five feet underground in an old converted limestone\nMine that is the size of one hundred and twenty football fields\nGovernment is she that's pretty good\nYou don't do that huh I'm never thought about yeah probably get all this is Dan Callahan he's been working here since the Nineteen seventies since the cheese debacle and he tells me these were never government owned caves but one day government rented out a ton of Cape space\nAnd then cheddar cheese started to show up massive blocks of this stuff palate after pallet in fact he remembers the exact\nWe walk inside his massive columns and it looks like something the lord of the rings towards build and it is also very ... good for the government should be able to see\nHow high so you'd be Seventeen faith sixteen the then says\nThe cheese took up about half an acre\nOf space just wall to wall\nFlorida Oreo filling and then as you can't fill in the worst way right back out and so there was no more room for you to be in this room right\nBy the early Nineteen eighties the dairy support program with costing taxpayers around two billion dollars a year\nThe government was buying one in every four pounds of the country's cheddar cheese they actually had to rent out space in multiple case at one point the government was storing two pounds of cheese for every single American citizen\nBy this point Jimmy Carter was out of office and the Ronald Reagan team was stuck dealing with these caves full of cheese and not all of it with aging well there was an incredible press conference where agriculture Secretary John block went before reporters and held up a giant hunk of cheese like it was a national emergency\nYou see that take a cheese [noise]\nWe've got sixty million of these\nThat the government owns with mold\nIs deteriorating we can't find a market for\nFinding a market for this stuff is in fact a pretty fascinating puzzle because getting rid of government surplus anything is an economically tricky thing\nExactly so the thing that the government was concerned about is what's called commercial displacement\nAgain economist Andy ... Fitch and he says the government could not just released a flood of surplus cheese onto the market because it would crush she's producers\nYou can imagine the the cheese company that's in the business selling shoes is going to say what's the deal here you took away my customers is important to me\nSo this leaves a couple of options you could destroy the surplus but that looks pretty bad\nOr you can try to get your surplus goods to people who were not going to buy it anyway and that you won't be flooding anyone's market\nWhen we have a surplus of grain or soy or even powdered milk we can send that stuff overseas as part of foreign aid\nBut she's just doesn't travel well so the government gave a punch to schools than to the army that this was not putting even a dent in the surplus so they created a brand new special program to give the cheese away through food bank\nThe idea was that if you give this food to people who suffer from food insecurity then maybe it is going to go to somebody who wasn't going to buy cheese anyway so you're not hurting the market as much\nBut the problem Andy says was that a lot of this was not easy to give away cheese there were forty pound block than five hundred pound barrels so\nYou can imagine you know you don't just kind of rules on one of these barrels down a seventh avenue in New York City and say anybody wants to choose what\nYou just have a big knife yeah there you go to help yourself\nSo instead the cheddar cheese was processed that helps that keep longer and then it was repackaged in two and five pound like bricks\nPeople will remember as a government cheese because when government starts to give away hundreds of millions of pounds of cheese people notice\nThe great changed give away began today in California San Francisco was one of three cities in which needy people lined up to get the surplus this\nFootage is amazing style massive\nCrowds of people being handed rec center she is and it was the most of the government packaging you will ever see just like brown cardboard some black USDA stamps on any", "show_name": "Planet Money", "year": "2018", "city": "Jacksonville", "day": "07"}