{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise] can you think that peace will just dandy hen or capital fantasy by composer then sent dandy his fantasy on French popular themes and ... I Hope you have a really great Saturday\n\nLooking for a youthful perspective on classical music oh I'm going to play delicious transcendental attuned number seven it's very exciting an energetic and there are even parts of South Park and overall it's a pretty good [noise]\nNo further than from Utah joined me for for a running for our anniversary seen each week right here on NPR Saturday morning at nine on M. P. B. music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte W. M. P. in Jackson\nW. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at him be be online dot O. R. G.\n\n[laughter]\nOh my God\nWhen you think of nature people when it comes to me is like you know like Beethoven who like to walk out in nature and more shocker\nWas so inspired by stealing is often isn't one of the first name that comes to mind right [noise]\n\nThat he\nWrote a little something called the trees with and then he thought well what's how well that I speak well\nWhy not\nA franchise that they would call it the film business nowadays and soon after\nThe trees when he came up with this [noise] the flowers and it sounds you know I Know Lowery [noise]\n\nWritten at a very ... time in history you're going to hear about a half an hour\n[noise] this is the slow movements from Max Brooks serenade for drinks\nMm\n[noise]\n\n\n\nThe ... the beautiful melody by ... the St Petersburg silver Monica played that they were led by your eight to ...\n\nThis is a recent release between violinist is down south stand friends largely artist from Germany and the Netherlands playing ... Schubert talked to have this is the second most\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] Mm\n\n\n\n\n\n\n[noise]\n[noise]\n[noise] Mm\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\nMm\n\n[noise]\n\n\n\n\nMhm\nWell what\nLearn\nA\nLittle bit\nBut\n\nIt\nWill be a you know\nWhat to do\nWell tell\nMe [noise]\n\n\nNo no\nNo\nNo no but [noise] [noise]\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[laughter] we find pieces each one representing a different slant where the flowers by John ... daily the pianist what Eric Thomas cheering\n[noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\nThis is guitarist John Williams to play a concerto originally\nProvide linked by Bach but as long as you played something well he didn't mind if you substitute there solo instrument even his lifetime he brings here's John Williams Andy ... led by kind of silly\n", "year": "2018", "show_name": "Creature Comforts", "city": "Jackson", "day": "06"}