{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nThe Belgian are dead photograph musically for you there by the national orchestra of Belgium music comes just as you don't get ...\nMississippi students are going to the polls this month to participate in a mock election for the upcoming Senate race teachers there still time to register students for the promote to build initiative which provides a variety of ways to learn about civic engagement if your school or clashes already registered\nLet the voting began deadline for submitting votes since October twenty six more information at NBC beyond line dot org ... and ... and the Mississippi secretary and speech\nThe stations have been ... music radio R. W. M. A. H. Biloxi there'll be ... ... ... you may you Butte\nW. M. P. in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. green ... check out what's happening on MTV music radio and listen online at him be be online duck or gee\n\n[noise] [noise]\n[noise] [noise]\nIn addition to being a really swell composer I ran a red speaking was passionate about music ... music history especially going way back\n\nTo an addition to his Roman trilogy he wrote a couple of sets over well be really part of the twentieth century of ancient heirs and dance [noise]\n\nBased on ... tunes from his the lead to a native Italy\nThe second one coming out\n\nThis is anonymous for ... music from early Americans\nHave\nThat I really\nDo not see\n\n\n\n\n\n'em\nA\nKey\n\nWe need\n\n\n\n\n\n\nKnow\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[laughter]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[laughter]\n\n\n\n[laughter]\n\n\n[laughter]\n\n[laughter] [laughter] [laughter]\n[noise]\n[laughter]\n\n\n[laughter]\n\n\n\n[laughter]\n\n\n[laughter]\n\n\n[laughter]\n\n\n\n\n\nRight [laughter]\nRight\n[laughter]\n\n\n[laughter]\n[laughter]\n[laughter] [laughter]\n\n[laughter]\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n[laughter]\n\n[laughter]\n\n\n[laughter]\n[laughter]\n[laughter] [laughter]\n\nI was not being cool the pianist and number three in B flat plate blind pianist to get a lot of temperature recording yeah throughout your career to cheat coming up a neighborhood in London they tell us luckily as it went in just a whole day\n[noise]\n\n[noise]\nBut once you know we're here you have memories connected to certain names are places her neighborhood and I'm spending a lengthy time in London a couple of months when I was younger and I fell asleep on the tube on the train and I woke up just as I went past the sign at the station for Brian Greene and I thought oh good stuff oh I remember that\nBut green is actually a very lovely neighborhood out in the west end of London out in a hammer Smith um and it takes its name from park that's nearby called brook green it's a rather large park and just a whole new the whole area because that's\nPretty much where the St Paul school for girls where he taught for thirty five years is located here's the brick green sweet like this top whole with the ... and yet I led by Norman del mar\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nNo no no\nAn open sure by medical she might sound the Toronto chamber orchestra played that they were led by Kevin ... Mellon well countrymen have she met her I was just a couple of generations later auto re interest speaking in one of his tributes to his love music ... coming up\n[noise]\n\n\n\n[noise] this is a collection of lieutenant it's one of three sweets that that recipe you put together oh from about Nineteen twelve to I think about Nineteen thirty on most because engineers and dance is this the second sweet with the chamber orchestra Lausanne led by cases Lopez ...\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nDun dun dun dun\n[noise]\nTo do\n", "year": "2018", "show_name": "Creature Comforts", "city": "Jackson", "day": "20"}