{"month": "10", "state": "MS", "station": "WMPN", "content": "\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\nThe opening movement from Beethoven's simply number six the pastoral symphony that was the the NFL harmonic conducted by Simon Rattle\n\n... yes I'm Talking to you know obviously you're going to continue to radio we appreciate your point I mean are you are in the minute you become a member of our members are part of\nThe name of the country needs to be me me me and you can\nYou hear all the time to be on the conversation today like on line three seven to one eighty three Seventy four four\nStations have been Bebe music radio R. W. M. A. H. Biloxi\nW. M A boondoggle W. M. A. you view\nThere'll be MP in Jackson W. M. A. W. Meridian that'd be it may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nOne of the things I Love about this job is getting a chance to learn something new almost every day I'm surprised I was not aware of this before rather just discovered this morning there is a town\nCalled Mozart West Virginia\nAccording to space book the big draws in Mozart West Virginia or the pizza below and Douglas market which apparently is quite famous for its chicken\nThe story behind this really there is a bronze statue of Mozart's in the center of town\nMost are coming up next our classical music from heaven for sure and the Danish national chains\n\nHis music from Eighteen century France by ... and a pretty accurate musical depiction of the chicken in the piece called love pool the hand\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\nNo no no no\n\n\nWhen we started Williams was getting to be mad at once multi receive a package in the mail from halfway across the world plus ... New Zealand inside you tried the gift of a couple of jars of Christ New Zealand honey gift trauma old student is that the oil academy\nIs Douglas little burns Oleg ... for strings play by the New Zealand chamber orchestra\n\n\n\nMm [noise]\n[noise]\n\n[noise]\n\n\nMhm\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nNo [noise]\n\n\n", "year": "2018", "show_name": "Creature Comforts", "city": "Jackson", "day": "25"}