{"month": "10", "state": "NY", "station": "WRUR", "content": "Oh man you\nKnow well we didn't [noise]\n\n[noise]\nSee are\n[noise]\nNo we\nDo\nYour\nTo make [noise]\n[noise] argues\n[noise] [noise] oh\nWe [noise] [noise]\n[noise] [noise]\n\n\nYou\nDo [noise] [noise]\n[noise] [noise]\nDo you\nKnow lead in [noise]\n[noise] [noise]\n\n[noise]\nOh I\nWell\n\nYou find\n\n\n\n... ... ... [noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] oh gosh\nI Wish\n[noise]\n\n\n\nThey're\n\n\nYou're a two day eighty eight point five double you are you all ask them an HD Rochester Ninety point one W. I. T. H. O. them and they the one if the sun is not well it's time for black and blue\n\nDidn't\nGet this straight read the new government is now\nIt's great to miss the government is now\nThat you did what do you go\nGreen energy from that but\nDon't have the right if you will\nMe and you know more than\nStream\nUp your\nNot get to get you get out the back\nWhat\nThey\n\nAnd it merrily we rock our way into the studio for friday night edition of blacks in blue good evening and welcome I'm Doug occurring and this is black and blue from now the midnight we've got the pleasure of bringing you the very best of the recorded black blues and then some fear it eighty\nEight point five W. R. U. R. Ninety point one W. I. C. H. different radio all the\nBest of the recorded black lose and then so I'm not sure a mouthful\nWhat does that mean that usually\nMeans you'll hear some combination of musical Buddy Guy BP Julian Bobby Bland but on this this and the black and blue how about these made how about DC dealt with me and I'll be back for speed Roy Gloria Harvey\n[noise] Mm\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nThey go early in the morning\nOr big goal late\nIn the knees you know [noise]\n\nIt goes really are in the morning [noise]\nNo I didn't know they got along\nVery very lead and [noise]\nYou know the beer professor for the record and\n[noise] all the new one that's nothing nothing going oh man [noise]\nMhm\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n...\nSaid oh no\nAnd then come\nWith them a break or\nShe's been shaken\n...\nThe the the bad\nGuys ski around to like say\nJuly stake in\nDa da da da dun man\nMean you've been shaken\nYou've been speaking you only do\n\nSaid I Know in Chicago when he lived\nToday no rematch Chicago we need\nLeave Canada\nSay did you\nSee you'll you'll\nDa da da na ... ... ... like black and blue I buy that the music\nOf Joe beard job you're going to be one or two later in the ... with the guitar licks and the whole the odds of a lightning Hopkins to Joe beard from an album called blue ... and then joke on real\nDeep and subtle ... to ... so called friends of mine\nRip me prior came back to the ... all again and it was to shake your book either to let Sonny Boy Williams and a quarter to quarter\nAnd so had a ... weeks bother a movie prior and so we had three records that were rolling through the first step out on this edition of blacks in on the ... hoping you're trusting that you enjoy what they're doing so far\nSo the early music has been dominated by the musical but at least two man Joe beard of course being one\nClarence at was opened our so to call this the other why don't we laid out the back to back lift up the ... speed things up a bit with job it this time but to me that was out in the Nineteen sixties Joe be remembered it will lay the better the group it's called ... ...\n... ... ... ...\nKnow when\nThe same\nDead in\nI can tell you that you may get news [noise] [noise]\nAnd maybe I'm going to give it to be in\nA\nBig\nDeal you know the man [noise] that is\nYour oh you haven't oh\nDo they\nDo you really not good\nAnd you're saying\nYou\nKnow\nHaving a second\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nUm\n[noise]\nAbsolute perfect and I got to tell you something\nOutside of the boat major blue hubs of Chicago in Memphis Los Angeles when you go around the country all the cities have their real deal blue man one guy keep in mind\nThat as job be a great job beard has ruled the roost here in Rochester at the same time don't forget it was rock and rock but it don't forget\nThat it was John coal there had been John ...\nWho just lets you know track stop those coal\nWith a view for additional over to second chance there'll be it starts us off with two law tall Shorty and Clarence Edwards was or as usual artistry he plays it cools it gets our talk on electric guitar\nGo way back deep and the ... comes right back up front with music that's popular on the radio don't make me wait for his mistake that and second chance by John goal of solve that we first heard come from the lips of the vehicle [noise]\n\n\n\n\n\n\n\nJohn Paulson man [noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\nBut along the way you must have a lot\nThe common man is\nIn the back\n\nBut then the the three times\nDay\n\nI was told to do what you know you're always ... me [noise] I Try to always ... me the\nDidn't buy Brian Pease and then\n\nAbout good\n\nAnd bad I had\nTo do that\nAbout that by\n[noise]\nAnd\nDon't try to\nDo [noise] but that got\n\nMad and da da da da da da\nDa\nDi\nDi\nDi di di\nDi\nDi\n\n\nDi ... ... ... the lesson to me [noise] [noise]\n[noise]\n[noise]\nI was raised up on Jimmy Reed corn bread ... green and black eyed peas I took my breath\nAnd money while\nAnd um you lovers you better watch out for you know\nBecause some of whom my [noise]\nAnd I'm a blue man [noise]\nMan\nMay [noise] let's\nSee that I'm an original will be ... I don't do nothing he was on my mind I ain't got no bonds man\nThe hounded me I'm Out here on the road and I'm really\nGreen [noise] because I'm a real nice to be [noise]\nUm ... blue man yeah [noise] you know I'm a blues man you know\n[noise] I'm a new movie\nThis was the music a set of music that celebrated the music that was given to us by ... record back in the Nineteen eighties\nWere music from the the hill everybody knows about my good they\nAre from the album the celebration which was an album that was meant to all those easy ill and his passing a tribute to the late great reveal principally was Bobby ... taking on a little ... as he got stated that song\nOut you can you talk to the ghost of the past she said you hear me well you know he's talking to you in your pocket and how little on the ... and we're talking blue here or black or will they quick shout out the any and everybody who came out and saw John ... last weekend it the Wilder rule [noise]\n\n\n[noise] and\nYou and\nYou know and when you\nI don't know\nMy\nMom in New York\nSaid oh no [noise]\n\nCan be and\nAnd I\n[noise]\nMy\nGuy [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] and and then\nWell but do you\nDo [noise]\n\n[noise]\nAnd\nYou know he'll be my\n\nJohn [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] no\n\n\nThey [noise] they [noise] they [noise]\nThey only\nBad thing about\nBeing in the morning I saw this thing and then they get in\nThey needed a dead end job to make sure\nThey [noise] they [noise] they they are\nBeing hit and then in their\nBig thing\nThey don't let him in a personal thing and I\nMake your mom being dead end up you know\nThink they [noise] they [noise] they [noise] [noise]\n[noise]\n[noise] there's\n... there's been plenty\nPlenty weren't\nThey [noise] they [noise] they [noise]\nThey did they did in my own dog you know being a back door back and do you mean by myself being made now well now this song\nThey [noise] they [noise] they [noise] [noise] [noise]\n\n\n\n\n[noise]\n[noise] [noise]\nI'm a move on to the top of the ten o'clock hour actually amended after and you're listening to blacks in\nHere in eighty eight point five W. or you are about ... the Rochester might be boring one W. I. D. H. F. M. and they the one at the big daddy stolen than ... big daddy can model battle football's bowl or the leap to\nRight before that we heard music by John Ellis and put on a magnificent show here about a week ago John Ellis will be your weight so my ... my place as your last friday night\nAnd a girl and this is black and blue the very best quarter black blues and then some every Friday night from nine to ... [noise]\n[noise]\n\n\nGod you know\n...\nOwn down\nLike to read and [noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nI've been down there that [noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\nYes you and me just blew them a long corridor friday night easy does that I'm right across with them through the deep blue level title to rumble CD\nWe began this hour was music with Gerry bell and somehow we don't hear a lot of Gary Bell and he was the guy was a constant producer a good record any toward a lot he came to Rochester a lot and we got a chance to see 'em and enjoying in various than you\nAnd that time we heard him with a Jew must stop hollow massage shake them all know\nJohn room came along John ...\nAnd he had the services the Billy Branch on the harmonica the to what's called they called me the ...\nThey call me Doug Cory I'm your hold on a friday night we enjoy the fact that you enjoy the blues we bring you every Friday night from nine until midnight and we hope as well but you tune in from sick since aligned\nAnd here's Scott Wallace with the jubilation a retrospective of ... song from the pet Scott Wallace is your hopes for six cents a line that makes the night complete friday night here in eighty eight point by W\nThe ... might be why why do we see see W. I. C. H. F. M. S. H. B. one yeah [noise]\n\n[noise]\n[noise]\nWell we are ... [noise]\n\nGoing to be over by a [noise]\nWe can make love and we\n\nYou\nKnow your water [noise]\nLaying in bed for me to have a big day\n[noise]\n\n\n\nI\nIn [noise]\nOh\nAnd God no\n[noise] [noise]\n... me\nSane sane thing you can go to be All right\n[noise]\n[noise]\nGo\nQuite\nQuite\nThe thing\n\n\n\n\nHurt you\n\nMm\n[noise]\n\nWell no\n\nNo no\n[noise] well\nThe\n\n\n\nTom and\n\nYou draw the\n\nYou love them on and on the\n\nYou do me a\nNo no I'm the one\n\nIn the\n\n\nAge\nYou know\n\nKnow\nWant\nAnd then\n\nThe new\nNumber\nThat\nAnything\nAnd\nThen\nThey walk\nThe mall\nAnd not ... dog and the\nIn la di da\nDa da da da da da da da\nNa na\nNa na na\nNa\n\nNa na\nNa na\n\n\n\nNa na na\nDa da da da\nDa da da\nDa da\nDa du da\nDa da da\nDa da da da da da da da\nDa and he may\nDragging out how woman now and then they are and\nGave her\nA\nNa na\nNa\nNa na\nDa da da da\nDa da da da\nDa da da\nDa\n\nDa da\nDa\nDa\nDa da da da\nDa na na\nNa na na\nNa\nDa\nDe\n\nDe\nDa\nDe da de\n\nLa\nLa la\nDe de de\n\n\n\n[noise]\n[noise]\nWell\nOh well\nMhm mhm Mm [noise]\n[noise]\nOoh\n...\nJimmy Rogers\nJimmy Rogers back from the early Nineteen fifties when he and Muddy Waters were putting together the blueprint for the Chicago Bulls guitar players in there he was with a piece of ...\nJimmy Rogers and money marbles and trouble and if you couldn't take it out for yourself from the lyrics money marbles in chalk had to do with being well heeled you had money marbles and job doing All right\nAnd it was Jimmy Rogers Jimmy ride is going down deep and on that instrumental break it was breathtaking if you I Hope that you would ever get the chance to hear and really listen very closely to that too\nBecause on that recording when he goes into that instrumental break you can hear almost gas you can hear exclamation from the other musicians and that's how effective they were about what Jimmy Rogers was playing his guitar but Jimmy Rogers could be quite joke we'll end a lot of fun as well\nAs a whole\n... thing and go on and getting the chain became the meals to motivate you may just let it is time [noise]\n[noise] ...\nYou you're not\nThe way I could do is find out you know me me you know the president is trying\nTo lay in\n\nOn the boat [noise] [noise] [noise]\n\n[noise]\n[noise]\nThe ban on gay and held ... wouldn't miss jeez you know this is all\nYou know\n\n[noise]\nGo overboard on the\nMenu that way the world and you can do all that you love me one to go to Ed Ed ms ... all the time they ever\nDon't know how long you\nWhen you say\n\nJay said no\nAs we approach to the top of the hour you're listening to black and blue here they weren't ... W are you ... them and they the Rochester Ninety point one W. I. C. H. yep them at age the one at the\n[noise]\nA way\nWait three days he said\nGoing to be\nNo\n\nI mean the most in\nWay from the\nMan in\nWay\nFor me\nBelieve me\nThey they\nDon't really\nKnow what I wanted\nTo me [noise]\n[noise]\n\n[noise]\nAnd\nThen they\nGo low [noise]\n\nAnd mom North Carolina man mowing the lawn [noise]\n\n\nAnd my\nNominated for\nThe way that judge manuals\n[noise] a guy\nGo home and does he use [noise]\nThe way that is a is a\nTown called ... have been saying\nDo they\nBut you don't jak [noise]\nJames dreams and\nWay that by the way you combine there'll be a man\n\n[noise]\n\nBut\n\nAnd then by the\n\nOr a\nThat [noise] do\nThey do do\nDo do do that [noise] longer than they do that do\nWhen those new man\n\nI have found is\nGoing to be a God\nDa da\nDa\nDa\n... ...\n... ... ... ... ... ... ... ... ... ... Mm\nMm Mm Mm\nMm\nMm\nMm\nMm not get along these ... and you're trying to get home\nBut you are in another dreamer ... we learned all all alone and then the man that just the Asian ... you know came up and down when we know ... and you know the\nKid says back home to pay the\nBills and a\nHalf your neighbors and all the\nTime because of the\n\n\nYour mind Jacob of your mind taking the train and\nEven if you walk\nThrough you know ...\n... ... your home and go\nAhead and give them more that the bottom line\nNow\n\nHave you know he was in order\nTo be\n\nMen and women\nAre\n\nNot um\n\n[noise] no no\nNo [noise]\nAnd now there's one near ... ... do well in some ways you're ... you're betting keep your luggage ally ... they're going to answer to manage ... they'll ask\nYou what are you going to do what you ... ... and you just want to get things\nDone a\n\nPeople know\nAnd\nThen and then you see the world\n... we've got a whole\n\nLot of things you're ... you're far\nThan you need a passion\nPicture of your\nYou first\nSee in a\n\nNo\n[noise] [noise]\nUm [noise]\nNot really\n\nNo no\nNo\n\nNo\nWe don't know\nWho\nKnows you know rural rural town\nWe want to live on the same thing for them to\nGrow\n\n[noise]\n\nOh\n\n[noise]\n[noise]\n\n\n[noise] ooh\n[noise]\n\nOh\nNo\n\n\nOh\n\n\n\nOh\nNo\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\nOh\n[noise]\nAnd\n\nCall mom flew [noise]\nOoh\n[noise]\n[noise]\nRight by the\n[noise]\n\nWhat can you say\nI\nKnow [noise]\nBeen back my low [laughter] [noise]\nI Know\nKnow what to do [noise]\n\n[noise]\nAnd I like Ike a class [noise]\nThe rhythm and blues up the Nineteen fifties one of the better period for music and we heard everything from big may bill to Roy Hawkins and bb king and little Greenwood in between but we heard\nFrom Laura Hawkins as to what's called blues all around me are before that we heard\nFrom a lady named little green would seem that that would have been a played on the name of a little green was very popular in the Nineteen forties but she was ... and the two\nAlong about midnight a song that Roy Brown and guitar slim made decent version so\nWe heard bb king and very curiously the very earliest version of\nWhy I sing the blues it was kind of a typical boy girl kind of blues affair and of course in the late Nineteen sixties he would redo that song and it will become more of a protest kind of an anthem at the end of the Nineteen sixties why I sing the blue\nAnd of course the first two we heard was by big may bell and I think one a couple of occasions I remarked about songwriting ability\nOf Roosevelt Sykes and here's a Roosevelt Sykes tuned into the hands of a female Blue Bell too big may bill this one was called my big mistake\nWell the best thing we've done all week no mistake about it was coming here to bring you these moves on a friday night we hope that you are enjoying the music as much as ... so we're enjoying bring or do we tell your friends they can find those wherever they may be on a friday night you were\nA W. R. U. R. dot or G. W. R. G. H.\nRadio that or see what we already deal with this well we we can you come here to find\nGo down\n\n\n\nMean\nVery bad\nMan I Love your\nKnow that they\nDa da da da da da da\nDa", "year": "2018", "show_name": "Blacks & Blues", "city": "Rochester", "day": "27"}