{"month": "10", "state": "FL", "station": "WJCT", "content": "\nBreathing down your takes it to the lake so this is fantastic makes you this is the big boss of the big thing you do you own the goal is to what we do show in the world we live on the ... and of course it comes to wait for something I write it W. J. C. T. yet you got to be rude\nA huge job\nOh\nI write law\nNew ...\nGo oh\nThe dog oh\nI'm\nOn the dining\nHall on man you seen a lot I don't know but the\nOh Tom all\nYou know I Need\n\nGo to a new law\nOh\n\nI\nSee\n\nAnd usually a at all but yeah\nI'm In\nHong Kong wow\nDi di\nDi di di\nDi\nDi\n... you know I I cried far\n...\n...\nOh\n\nA ...\nSay\nOh wow well I\nI'm\nA I'm\nUh uh\nUh\n[noise]\nWe uh\nUh that's a pretty pretty doo wop from the ... that's the flip side a lot of calls that we played for Bob ... a little bit earlier was somewhere in my heart from Nineteen fifty nine and the middle ... Connecticut for Nineteen fifty six we regret when I leave with love so true\nAnd let us off one of the great besides of all time last Night's Dream by the ... that it's the flip side of so far and not a butter rap I Know suspicion that the new opera vital as always I appreciate your spending the last sixty minutes what may\nRemember folks together we really are keeping this great music a lot that gives home run regime or on a third edition a good\nNight you know\nYou've been wanting to be we we knew\nFrom the ...\nWe ... you and when they\nDo now\nDo you\nOh thank you\nUm [noise] ...\nUh\n[noise] and now I'm ... I'm ... now I\nBeen been wanting to be we we knew\nFrom the bomb ...\nWe ... you know I'm ... and when\nThey do know how much do you oh maybe D O\n[noise] ...\nA\nGood\nA\n...\nA\n...\n[noise]\nA\nHearing and balance Institute and co clear Americans are hosting solution for severe hearing loss at W. J. C. T. luncheon learns seminar Wednesday November seventh from eleven thirty to one open to the public register at W. J. C. T. dot of work\nDo you have a story to tell since two thousand three story corps has been collecting and archiving stories from all over the country from November Eighteen to to December twenty first StoryCorps we'll be right here in Jackson story corps the two time Peabody Award winning\nWhose mission is to preserve and sheer humanity story if you've ever listened to their NPR programs you know how powerful touching the stories can be to find out how to record can record your story go to W. J. C. T. donor ...\n[noise]\nIn age deep from palm coast to the golden ... this is eighty nine nine W. J. C. T. F. M. Jacksonville listen to anywhere on your computer or mobile device at W. J. C. T. dot ...\nWelcome to the ... joined lots of music stacked up and ready to go for forty five Seventy eight and a lot of groups you've probably never even heard the entrance LDL Caprice the rebels the top [noise] the superior to the five Tina what's\nThe name of replacing it's next such a joy\nMm well a lot I'm\n\nHuman being\nWhen you're you\nKnow they can do to\nMe\n\n\n\n\n\nBut I Do uh\n[noise]\n\nOh I\n\n\nI\nDon't\n\nCome from\n\n\nA lot [noise]\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n... the ...\nOh\nMe ...\n... you\nKnow body but let me\nKnow one by\nOh man de\nLa\nLa la\nLa la ball\nYou know uh they do though they\n\nRow yo know Laurel that they will lower ...\nLa la la\nLa\nLa la\nLayering though a lot by\nThe day\n...\nModels who\n\n... ... ...\nA ... oh\nMan the\n... the\n... and ... and they walk in there the other thing is that right\n...\nThey didn't even know how\n\nTo my good news is that\n\nWay not ... no no no\nThat ...\nMay not\nBack we're going to go back and\n[noise] um [noise]\n\nI\nOh\nYou know\nThe news\n\n\nAnd you know any\nAny\n[noise]\n\n\n\nMan and a\nHalf\nAnd\n[noise]\nNa na na na na na na na na na na na na na na\n[noise] [noise] well [noise] well [noise]\nWell [noise] well [noise]\n[noise] [noise]\nMy\n... my ... the last ...\nRow warn you ... ...\nMaybe ...\nBetter than\nNine little girl named ...\n... ... ...\n... ... ...\n... ... ... ... ... ... ... ... ... ... ...\n... nine we now well when we were ... we went on\nMy way before I let you go now not\nA\nLower paying\nLower ... ward you were ... ... ...\n...\n... ... ... ... ... ... ... when you go down\nA mine not mad about that in mind\nA\nMhm Mm well I\nDon't want a lot of la la\nLa la la la la la la\nLa la la la\nLa la la la la la la la\nLand and you know paying money to spend a\nLot of that God I got to pay a little bit younger than ... la la la la\nLa and that was a two man by not ready\nTo turn on the bottom line may not as many as I learned a\n\nLot of\nWalking to the new will be due to a church\n\nLa la la la la la ...\nDo you want to hear about how\nDo\nWe do\nDo\nReally don't want to lay in my free\nTime you know I mean we have to do about Iraq\n[noise]\n[noise]\n\n[noise]\nKnow pretty much\nDo you have\nTell you about\n[noise]\n\nYo\nA and\nDay\nDay your heart rate\nAnd\nIf you were saying well go\nMy age right\nThe way you fall on\nLike me about that do go no go oh there are\n\nDay going\nYou know I don't know\n\nMany law I\nThe to the ball or\nMe but I Do you do so\nWell let's go\nAnd\nTalk to you know when there's stuff that nor can is an overdose reversal drug that saved thousands of lives in Philadelphia every year but knowing when to use it can be complicated\nCertainly if you had somebody is you know six foot four it was like three hundred pounds you ought to be very very careful how you wake up or shut up you have to be prepared to protect yourself\nOn the next MORNING EDITION from NPR News tomorrow morning from five to nine on eighty nine nine W. J. C. T. O.\nN. beyond November there still twenty twenty and I'm not talking about the presidential race more than eight hundred state legislators who are in this year's\nCould have a hand and drawing the new map why mid term matter for redrawing our electoral map that next time on the take away from WNYC NPR I\nWeekdays at two on eighty nine nine W. J. sci", "show_name": "Footlight Parade: Sounds Of The American Musical", "year": "2018", "city": "Jacksonville", "day": "29"}