{"month": "10", "state": "FL", "station": "WMFE", "content": "Support for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician that committed to children tell by the health care partners dedicated to their well being from birth to adult had including us all important teenage years later how over twenty pediatric location to control for the family more information including locations that are lined up health dot com slash kids\nMm [noise]\nMm\n... don't show me of celebrating their twentieth anniversary you can help support in Ninety four Seventy WMA ivy during our silence lived and get some cool wait wait don't tell me twentieth anniversary thank you gifts at W. M. F.\nE. dot ORG don't wait wait visit W. M. F. E. dot ORG\nNinety Boeing's Evan Hughes is always on line\nVisitors at W. N. F. E. dot org you'll find more on Ninety point seven programs news stories and audio streaming find that a whole lot more at W. M. F. E. dot org this is not the point seven W. M. F. E. F. A. M. Orlando Melbourne Daytona Beach\n... the world service on Jeanette Judeo the Australian prime minister apologizes to thousands of victims of child sex abuse it would let down by the state\nWas very very murder and for me so for me it made a lot of companies\nAre actually sent to a couple of them share\nWaist weighed lived long enough to hear it\nBut other survivors say would not have enough Saudi Arabia denies the crown prince was involved in the middle of the journalist your mouth shut Jay and also his condolences to his son and\n[noise] there was no hiding the joy of these migrants are sick of police\nThousands of hunter migrants macho on to the U.S that despite warnings from President Trump that they will be granted asylum plus we look back at the heroism of the Norwegian Resistance fighter who has died at the age of Ninety nine that's all coming up on the news and\nI'm David ... who is the b._b._c. news\nThe Australian prime minister Scott Morris and has to live as an emotional national apology to victims of child sexual abuse\nIs to Mars and told parliament in Congress that the Australian states had failed to protect victims from decades of what he called evil dunk crimes and institutions including schools churches and charities as one of those in family homes hundreds of abuse survive as gathered in parliament to hear the prime minister\nTo die as dry there confronts a trauma\nAn abomination hiding in plain sight for far too long to die we confront a question too horrible to us little an answer\nWhy weren't the children are nice and loved new should and protected\nHis apology was one recommendation of a royal commission that investigated the institutional child abuse in Australia\nThe phone writes presidential front runner in Brazil's ... both scenario has threatened to ban the left wing workers' party if he defeats its candidate for them to do that in next Sunday's election is to both in our remake the threats in a video link supporters in Sao paolo ... and reports\nJai boats than ours sounded victorious he spoke to the crowd even though this didn't wait to go before Brazilians costs that he's an average was threatening promising he'd sweet red whack his posse criminals from Brazil\nAdding that would be a clean up never seen before in the history of the country and this climate is the ... and hatred that threat today well to support his young democracy and memories of ministry dictatorship still strong for many it's a discourse that concerns and Indians\nSaudi Arabia as kings how am I on crime prince Mohammed has made a telephone pole to the son of the murdered journalist Jamal ... to offer that condoning says\nIt comes two days after the Saudis reverse that policy of denial to admit mister show gee was killed inside that comes she lives in Istanbul three weeks ago the Saudi foreign minister ideal out ... had this message on Twitter\nType of tragedy and don't go out to them we feel their pain and I wish [laughter] happen and I wish that this isn't unfortunately [noise] huge and very mistake was made and I assure them that those responsible will be held accountable for this\nPresident Trump says full efforts are being made to stop what he called the onslaught of illegal aliens in connection to the convoy of about two thousand Hungarian migrants marching towards the United states\nMr Trump tweeted that they will be turned away if they did not apply for asylum in Mexico fest on Sunday the migrants walks for seven hours and the quest amount of Mexico border to the Mexican city of Tampa Chula well news from the BBC\nActually have a few hours to satisfy the European Commission ... budget plans for next year or affordable and comply with your resume rules the commission rejected the budget forecast last week and\nIt's that today as a deadline for an urgent revision the Italian government when office this year on a promise of increased spending and the report says the world is losing the war on drugs you adjust the UN to be more realistic about the impact Tom Simon's has more details\nIn two thousand nine a un declaration that the world targets to reduce the cultivation and smuggling of drugs on cops global demand\nThe targets of being missed today's report by a consortium of truck research organizations concludes\nThat fee increases in almost all types of drug use under one hundred and forty five percent rise in drug related deaths\nEight hundred and three new substances of being discovered the report to adjust the UN to abandon the dream of a drug free world and and the war by finding less punitive policies\nEthiopia and the separatists are good to national liberation front have signed a peace deal a move that and I went out last fall yeah armed rebellion deal stipulates that both sides will cease hostilities with the oh and I laugh at green to use peaceful political means to pursue independence Somali speaking of Bijan region\nFrom declared a cease fire in August after Ethiopia's parliament removed it from a list of ... terrorist groups [noise]\nThan a legion resistance Harris who led a dairy mission that halted Nazi Germany's nuclear weapons ambitions and the second World War has died at the age of Ninety nine\nIn Nineteen forty three your key run back come into the six men team that destroyed key parts of the heavy water plant in occupied southern away the right was lights turned into Hollywood film the heroes of ten of milk starring ... Douglas BBC News\n\nAre listening to the news room from the b._b._c. World Service with me tonight Judeo\nTwo months after he took office the Australian prime minister Scott Peterson has apologized for one of the most shameful scandals and the country's history\nToday with his voice trembling at times he stood in parliament and can breath to express his sorry for the institutional child abuse that lost it decades churches schools spoke clubs in China she's old guilty Mr Morrison says the crying\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children have been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nShy dishes apology is for them and their families to\nAs one survivor recently said to me it wasn't a foreign enemy who did this to us this was done by a stride as to his driver's enemies in our midst enemies in our midst the enemies of innocence\nMiss the most and made a speech after five year inquiry which found that tens of thousands of children had been abused Richard ... who lives in ... was one of the victim of a piece of priests he welcomed Mr Martin's apology\nAre was actually caught was er I didn't think I wouldn't be I gotta sorry what was the words from the prime minister or it was very moving from me so for me a lot of comfort\nActually said to a couple of them see\nAt least we lived long enough to hear it um maybe a little bit later coming but we did hear\nHundreds of people from across Australia gathering ... here the prime minister speech many survivors have criticized the government's response to the inquiry in particular the national compensations game around sixty thousand people are eligible our correspondents in camera how quickly this listened to Mr ... speech\nSpoke at length by the way to the impact on so many lives though both those up surviving victims\nAnd those who take their own lives and I think that was a moment to try and get many here who\nSay they've come to listen but also to remember as those who simply couldn't cope with the impact of the sudden spent decades not being not being as not being acknowledged show\nThe apology I think it probably wait but there are so many concerns about how this issue is being addressed the has led the way and yet dealing with the questions it raises is still very difficult\nAnd and survive as well more than just woods\nIt may be that actually did stumble across the professional shoot and and and that's what they said but either way a hundred and forty thousand people have retreated the original message that the direction of like when he stations but safe on the couple of habit being found\nBut of course if this was a genuine proposal we didn't actually know what her response was and it was a no\nHops they may not want to have this intimate ... nobody has gone viral come back to them it could be able to quit\nOn his Porsche and a reminder of the main news the Australian prime minister ... has delivered a national apology to thousands of victims of institutional child sexual abuse and Saudi Arabia says the king of the crown prince have offered their condolences to the son of the ...\nThe new region resistance fighter who let the top secret wartime raid in ... in the film heroes of ... has\nDied at the age of Ninety nine the operation disrupted German development of the atom bomb the for many years you I came running up bag was reluctant to talk about it ... reports\nIn Nineteen forty three the allies were in a race with Nazi Germany to develop the atom bomb each knowing success could win the war the Germans needed so cool to have the water with an extra ... Portugal and they talk to Jim nucleus and\nWas made only at a heavily guarded plummeted where you can in the ... region of Norway\nThey made it a target for the resistance your key random bag and five other fighters parachuted onto a plateau skied across country descended into a ravine and cost an icy river before using the railway line to get into the plant and set the explosives\nThe operation coupled with American average the following year let the Germans to abandon their plans and was later described as the most successful active sabotage of the war of words European ruined a bag worked as a journalist and became known for raising awareness of the dangers of war among young people\nAnd a week after suffering huge losses and a German states should action Chancellor Angela Merkel's conservative colleagues and had a very insist the policy to see a few uh holding coalition talks\nTo see is you have given the very up on the un since Nineteen fifties but are now considering a coalition with the voters movement which came and said\nThat he was actually a free vote is and what are the main point is he demands a year ... has been finding out\nThe free voters came up on the blind side in the election while everyone was looking out for the anti immigrant populace alternative for Germany the free voters racked up a credible eleven percent of the birth of area Germany's largest second most populous inserted richest state\nSprung from the towns and villages they've been fighting local issues for sixty years the general secretary ... isn't surprised you know the exact yeah\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now with the family\nDoes your support all uninterrupted programming donating a dollar a day the W. M. S. dot org or cold one hundred Seventy five twenty twenty\nIt's more exciting when you talk radical so we've flown under the radar sometimes that changed now not truly before the election and especially after it with our toasted as a possible coalition partner and if we go into government we will be regarded differently their aims\nAre still regional they oppose the runway from Munich airports referring to revamp other airports and trade links\nThey want to scrap fees for nursery school places\nThat could cost the state more than half a billion dollars a perceived profligate see that feeds into the sea is huge odd that they all the free beer policy the to share a conservative outlook including on migration\nThe free voters want to speed up asylum claims and deportations and want a candidate style system to attract the migrants the work place needs\nThat could end up reinvigorate sing the sea su and by extension the central government but that's not ... priority\nI ... on the east ... owners like ...\nWill saving the national government is not our most important goal I don't know as far as the face of the PSU leader Horst Seehofer goes up to them to the site for us to be enough to bring Bavaria on a bit I'm saving the national government or the country that will be the next that even if\nThe free vote has ended up saving hosted the whole for John ... at the end the shake you national coalition will face another ... test soon enough this time in ... in the southwest\nMy son just now David has another story someone used to ask\nThe French government has ordered the friendship ... and into what is causing babies to be pulling with stumped missing limbs after these faulty cases were reported in three rural areas and initial investigation by the French public health authorities some type ...\nFell to find any comment exposure suggesting the cases will probably down to chance but this was rejected by environmental research is who argued the pesticides used by the agricultural industry are most like was the most likely cause the full he happened to monitor these [noise]\nThe governing law and Justice Party in Poland has come out on top and the first round of regional elections it's first electro task since winning an outright majority in parliament three years ago\nPolls gave the right wing party ... thirty two percent of the votes seven percent more than a centrist liberal coalition [noise]\nAnd the u._k. conservation charity is planning to kill every most on a remote British overseas territory to protect a number of rat bird species\nMice were introduced to go ... I Lived in the south Atlantic in the nineteenth century and have grown in size since then I've learned to eat ... chicks and are killing about two million every year and the rural country for the protection of birds just putting some species on the path to extinction\nSouthern US state of Tennessee should be an easy win for the Republicans in next month's midterm elections in twenty sixteen Donald Trump won the state by twenty five percent and the presidential vote but the ... there'll be much tied to\nBig money is pouring in and big names are weighing in\nOn what's become one of the most important Senate races in the country Bob ... a ... I went to Nashville to find out more\nAt the new hope Baptist church in Nashville voting faith issue [noise]\nAfrican Americans didn't turn out in large numbers for the presidential election and they don't like the result so the black clergy has mobilized\n\nAfter James B Turner the second to believe that if African Americans in Tennessee vote as a block that can scales in the Senate race and spend a Democrat to Washington\nOr new spirit has awakened and uh we just happy to see this energy and now we turn to the polls\nIt's extraordinary that the Democrats think they even have a chance in this ruby red state\nDemocrats that there is some black white but [noise]\nThe Republican candidate Marsha Blackburn has a reputation as a firebrand she's tied herself closely to President Trump he's campaign for her twice in ... grade [noise] look I'm not\nRunning against Donald Trump aren't running for a ... D represent the people who have Tennessee\nAlong the Democratic candidate Phil Bredesen is a popular former governor he talks about his personal brand as a politician who gets things done rather than his party [noise]\n\nThat pitch is aimed squarely at disaffected Republicans but an hour outside of Nashville the party is pretty important\n\nIt is an annual fair and the town of Louis for Trump country still there is some impatience with parties and shutting matches in Washington\n\nTennessee is an interesting test of whether a political moderate still has appeal in this hyper polarized climate but it's also crucial because the Democratic wind here is the key to helping to party take control of the Senate and that's a deal breaker for me\n\nI Will Donald Trump\nI think America back on the run right now I think we're really spreads out all over the world but what about ... what do you think of a nice guy I vote for him\nBut he's somebody who might get things done right\nNow he's got his name he's only going to get done what his party wants them to get the [noise]\nIn a state where music is the currency the singer Taylor Swift has raised the odds she threw her mega star power behind Tennessee's Democrats in a recent social media posed to her one hundred and twelve million followers [noise]\nAsserted millennials registered to vote but that doesn't seem to have changed many minds in downtown Nashville on a party Saturday\nNight and you're\nTaking me right there\nDonald Trump CNN Myrtle Beach [noise] and I don't have any ties right near ... percent [noise] I don't think they tried to tell you for\nThat report by ... ... and we will of course have special election coverage in a couple of weeks time when there's midterms are held\nA reminder of our main use the Australian prime minister Scott Morrison has delivered a national apology to the thousands of victims of institutional\nNobody showed me she and the crisis coming not doing that I I don't feel particularly bad about not seeing coming is another problem right my doctor doesn't see my diseases coming either\nBut my doctor can prescribe at least I Hope so derived meds once the disease has been diagnosed but much of\nThe fashionable economics of the ... the last thing to say about how to handle the crisis\nIt to go far too long to diagnose disease and responses appropriately Walsh school of economics at a kid that was how to handle the crisis that was old fashioned Cajun economics\nBut the number of people made that point people recommended fiscal stimulus\nIn the face offered the position they weren't using the frontier economics with a guy that got stolen graduate schools that are using stuff that they remember from the undergraduate days yeah so do you get onto the searches\nThat rather better than the economy of the eighties and nineties early to says\nThe financial crisis highlighted the extent to which was being tortured universities was increasingly irrelevant\nWhen do you call them was head of graduate studies at University College London a top rated economics departments she saw how unhappy who'd students were with a mismatch between what they were learning in close ... there was seeing on the news\nAs first banks and then the whole financial system began crushing down\nWe're all watching this and in some sense struggling trying to understand what was going on there was similar a sense of students being very perplexed\nAnd what they would come and say is can you help us understand what's going on we're not learning this in our classes and they were right that we're not getting in their economic tosses a set of tools that was helping them to understand the day by day dimensions of the crisis\nAnd Christmas was a good sort of catalyst because at Christmas people are thrown together with their relatives and one typical question is well\nYour studying economics you can tell us about the global financial crisis and the students having to say well we're actually not covering that knocks off is\nThe fact that students around the world continue to be two courses which has seemed to weigh a financial crisis but it was actually raging all around them both home to many out of touch the profession has become when do you call them is the most widely used university textbooks\nIn retrospect she admits these books ... subjects but we ... really important in terms of understanding the crash\nThings as basic as how finance works\nI can put my hand up I had to spend a lot of time writing macroeconomics textbooks which we're addressing particular issues in the macro economy started to the one published in two thousand six was all about inflation targeting\nAnd there was no section on banks all the financial system and just it was very typical of the way that curriculum excess taught in universities around the world\nAnd has not changed it has changed I write in your textbook that that really catches it in other words with my co author we felt really challenged and I think that's true not just the opposite of many others\nAnd if you're wondering why we should care about what's going on economics classrooms remember these are the people who graduate and go on to steal the financial systems in which we will depend if they give bad advice and can wreck your economy\nThe growing frustration felt my students and their teachers around the world has given rise to a number of new initiatives to overhaul economics courses in one of these Wendy and many others of building a new free online curriculum known as cool this was a concern I feel passionately about and so I have to\nPut my own hand up here I chaired the core charity\n\nBut will it different curriculum be enough\nIn finance in so many other areas the person who pays the piper cool to to bankers and politicians founded convenient to listen to those economists who argued for deregulation and who's morals allowed them to justify the housing bubble [noise]\nNot much easier comics professor at Stanford University in the U.S [noise]\nShe's frustrated by economists taking refuge in theory and saying what people want to hear well turning a blind eye to the bond even criminal behavior by bank because that can freshman financial stability\nThere is definitely a problem it is a very very shocking they remain really fantastic early in the sense of how they explored the system but in the end ignoring the biggest the elephant in the room and all the ... and all that deception and fraud and all the excessive\nEndangerment Stetson tire early unnecessary it's just taken as a given it's just what they said the system and does she think this is changed following the crisis\nYou hear is more ... you know very shockingly you know stuff happen abs and you know we're doing our best and it's going to be sort of the big crisis just wakes you up because you notice it and then he's like oh\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called a five hour drive and this is how we do it now with the family\nDon't your support for uninterrupted programming donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty\nCan't prevent it stuff happens\nIt's not much of a comfort to think that the economists could be happy with the idea that stuff happens some things clearly going wrong for professor Joseph Stiglitz it comes down to the continued reliance record numbers on the totally unrealistic notion that democracy is always right\nHe dates this right back to the founder of modern economics Adam Smith\nThey were blinded by the same ideology that had blinded the central banks and other policymakers\nThose blind believed that markets work well on their own unfettered markets will deliver for wellbeing for all citizens as been at the center of\nYou might say conservative economics since Adam Smith\nAdam Smith actually understood that wasn't true\nI think it'd be horrified at the abuse of his ideas he recognized that ah whenever businesses get together that conspire against the public interest to raise prices but ... and the two hundred and some years after Adam Smith that conservatives I'd\nMiss used his ideas even more astounding\nWas the fact that beginning in the Nineteen fifties sixties seventies and my own work or in the seventies and eighties advances in economics explained why markets often don't work the reason this will have often seemed invisible wasn't it wasn't there\nThe notion of invisible hand and supremacy of markets is based on the idea that if everyone buys themselves things in their self interest in trades freely without government intervention everyone will be better off\nJust statements won the Nobel Prize for economics by identifying some of the ways in which the key assumptions about perfect markets offload the presumption that everyone has all the information they need to make the right decisions just isn't borne out by experience\nThe notion of asymmetric information is very simple it's just that somebody knows something that somebody else doesn't know\nAnd the banks obviously knew some things that others didn't know about their bad behavior the banks knew that they were engaged in market manipulation\nOthers didn't know that is that the people who want to believe that markets were perfect close their eyes at in Dr aided their students\nThat markets basically worked perfectly\nWider economists expects humans to behave like rational calculating machines despite all evidence to a country\nFor some this tendency indicates a key problem at the house of economics which is to explain human behavior as if it were signs only works if you imagine all humans are the same responding in the same way an old contributions to the economy can be counted\nJournalist Katrin muscles book who cooked announcements dinner argues the traditional economic theories and methods only makes sense if you imagined humanity to be self centered so unlike humans as almost a different species in fact some economists have given the species name Homer economic us\nHome economic it doesn't have any failing states failings and not relevant to his economic decision making he says that have rationales bake calculating brain that it always acting additive south and chest and all of the set of characteristics or characteristics that we have been told to view as a male\nAnd even more of a it's sort of all the characteristics that economic case to great lengths trying to excluded from these models like emotions family and their party failings compassion our trade them\nAnd all of the things that we have been told that these are not economically round event they are not anything that we need to studying economics they sent me the same things that we have been torched view as female\nAnd there'll be the after the crash a lot of people are saying\nThis great is a good philosophy and is very narrow idea of what human beings are it's not good we need to bring these other values back and\nWe can't solve our economic problems without the courage to the U.S house with all that makes us human and failed economic models in economic theory that is actually based on that\n\nYou're listening to the b._b._c. world therapists with signs from all over the turn it on the sun\nWill face me batty lashed towns have stopped at one point [noise] [noise] [noise] [noise]\nThen he got on a day and it is I had to get caught saying he sat in [noise]\n... [noise] feed the world\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician that committed to children tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years later how over twenty pediatric location to central Florida family more information including locations at Arlington health dot com slash kids\nCorrespondent Katie ... some reports from Brazil put on your resume and just had my son this is here in the studio or America's editor to the gallon by telling me about\nOn air online on my mind because the b._b._c. world therapist the world's meetings they can\nPoint seven W and then the Orlando [noise] [noise]\nHello and welcome to stay on the b._b._c. was service Lawrence pulled out and James ... this morning [noise]\nStrong emotions in the Australian parliament to the prime minister sky marshal apologizes to victims of child sex abuse going back decades as a nation we found them\nAnd that was always very\nShy [noise] plus we have from the migrant caravan crossing Mexico in hopes of getting the United states\nOr were these so called Islamic state on the verge of losing territory in Syria what makes for the country on the medicines captured in the fighting\nThe ends of the physical caliphate a bias in this country does not mean the the the ideology\nMikhail Gorbachev is back in the news with a warning on arms control explosive is coming up to his own you signed up for the sake of it I just want to be [noise]\n\nHello I'm David ... who is the b._b._c. news the Australian prime minister Scott Morris them has to live at the national apology to victims of institutional child sexual abuse he was speaking in parliament in camera as well previous reports\nDeep and symbolism decades overdo the apology was one of the measures recommended by finally view would be ... it had evidence from schools churches cat homes and ... it's estimated around sixty thousand ... eligible for compensation\nThat's the prime minister spoke at the betrayal of trust I'm struggle many stealing do uh some of the survivors God the parliament with the full\nTensions remain however over how financial redress is being managed under a cold for tougher laws to prosecute those who cover up the big ...\nFound writes presidential frontrunner in Brazil shy about Saddam has threatened to ban the left wing workers' party if he did pay six candidates and undo died in next Sunday's election ... was speaking to supporters via video link his case you want some\nJibe personalities sounded victorious as he spoke to the crowd\nHe's an average was threatening promising he'd sweet red whack his posse criminals from Brazil adding that there were dead cleanup never seen before in the history of the country\nAnd that's climate is the ... and hatred that threat today well to he supported the young democracy and mid memories of minute tree dictatorship still strong for many it's a discourse that concerns minions\nSaudi Arabia has king Solomon and crown prince Mohammed have telephones the son of the murdered journalist ... to offer that condoning says\nIt comes two days after the Saudis admitted Mr ... was killed in science that comes she lives in Istanbul three weeks ago Saturday foreign minister has blind a rogue operation\nThe Mexican president elect Andres Manuel Lopez Obrador has urged the authorities in southern Mexico to protect the thousands of migrants making their way towards the United states\nHe was speaking in the southern states of Chiapas where the migrant caravan has reached the city of Tampa Chula President Trump has said migrants will be turned away if they reach the U.S border ... reports\nThe migrants mainly from eastern Honduras have already ... the length of their own country than watch a mullah across the river other forms of border with Mexico with the intent of continuing north to the usa\nHere Mexicans have come to feed the migrants and give them water and close though they sleep out in the open\nIt's been a welcome boost for the men women and children who spent more than a week on this arduous journey\nThere still more than a thousand miles from America's southern border and Donald Trump has promised that none of them will get through but many here say they feel they have no choice but to do whatever they can to escape the poverty an insecurity of their lives back home\nWell news from the BBC\nEthiopia I'm the separatists okay it's a national liberation front have signed a peace deal move that ends in our laps ... armed rebellion deal stipulates that both sides will cease hostilities with the separatists agreeing to use peaceful political means to pursue independence for the Somali speaking ... region [noise]\nActually has a few hours to satisfy the European Commission that its budget plans for the next year or affordable and comply with yours and rules\nThe commission rejected the budget forecast last week I'm set today as a deadline for urgent revision the Italian government one office this year on a promise to increase spending on welfare infrastructure and a lower retirement age\nYour key ruined bag and no wage and resistance hero who led a daring mission that halted Nazi Germany's nuclear weapons ambitions in the second World War has died at the age of Ninety nine the raid was attending to Hollywood film the heroes of ... this report from Baton to\nA Nineteen forty three the allies in Nazi Germany was in a race to develop the atom bomb each knowing success could win the war\nThe Germans needed so cold heavy water made only at a heavily guarded plant in the ... region of no way\nYou can ruin bag and five other five just parachuted onto a plateau and skied many miles across country before using a railway line to get into the plant and set the explosives the operation was later described as the most successful active sabotage of the wall\nBritain is passing a scheme to get better protection to people being exploited to work in the largely unregulated hands carwash industry\nIt's sold ... mostly Eastern European men are being lunch to work as slaves stricter that documents forced to accept lower wages and unsafe working conditions under constant threat of violence the ... the lead consumers science to treat their workers safely BBC News\n\nThat they had everybody will continue to stay with Lawrence and James on the way America's national security advisor is in Moscow just off to the U.S announced it was about being a major nuclear weapons treats we'll get reactions from most Scots\nHave from Roger Cohen yeah outfit to South Beach Lee an easier on collision course that fabulous story on news that he felt so notch or anything else he on the program please send us a tax numbers ... Seventy seven eighty six twenty six eight eighty five [noise]\nWe saw in Australia who are just a few hours ago the prime minister to live at the historic national apology to the victims of child sexual abuse ... Mars and said it was a day for the country to confront the suffering that so many had to do it in silence\nAs a nation we found them we ... them and that will always be ... this is apology is for them and their faith\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDoes your support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nTwo is driving\nThe apology comes off for five years loan inquiry in responses to the abuses in churches schools\nAnd the Australian defense force among other places when the McKenzie is an investigative journalist in Australia who did some of the original research on the issue make eh thank you for talking to us I Know and many of the survivors the abuse in the audience when the national apology was made did many of them except it\n[noise] I think a lot too many things in apology\nOfficially at least I'm white too stemming the dining all the suffering that's extremely important it's important symbolic moves for many many years in some cases many decades victims have been asking for\nA minor offenders the Catholic Church and others and there's other churches and other institutions precise or is it out of that show government deliver a powerful apology obviously is important to\nMany science they ... own thing out of the government follows through on promises to introduce the recommendations about five years rose commission inquiry recommendations or they implemented allergic to where I can say\nLike well for example because obviously played a key issue now is not just ah what happened in the past but making sure this never happens again\n[noise] indeed and one of the findings of the royal commission was that the spy\nIs happening it's happening again and again I'm not on the scale of previous offending but some of the ... the guy says the royal commission dealt with were lost and they weren't historical out one of the cage ... the government has introduced to the national raiders game which is a I mean I we can get compensation\nFor a democratic country than most Russian relations\nWith all of a phrase which looks like to join back to the Cold War Iraq this is not a Cold War\nRussia is much weaker than the Soviet Union and you'll still be Russia a week old they are we are in this call\nIn steal a county way weaker and there's no food no to the challenger who is a world a United States can just convey storms butter is\nVery much ended of encouraging will have to live as a preference relations to the European University in St Pete is\nBecoming of twenty minutes policy awkward headlines the Australian prime ministers called Morrison was to live as a national ... victims of institutional child sexual abuse\nThe Brazilian hot right presidential candidate juggle so NATO has threatened to ban the policy was left wing rival if he wins the election Mexican volunteers me giving food and medical attention to hundreds of Central American migrants who are marching towards the United states through Mexico ... Lucia\nHi Lawrence think he could learn English Channel ten will have to make a little longer so he fits well for me one time till\nAfter he couldn't he finished fed and he's ... is that the U.S ground pre in a state just one place ahead of his name is Dr Sebastian sorority\nAnd this means that kind of had to make it kind of Nick he can\nWhich somewhat skill to do it once had a very special day for finance Kimmy writing in any other sorority his strategy nine years of age he killed his fence grown pre when after one hundred and Thirteen ray says my staff and the second in his rental\nAnd so intimate on Captain Mariner economy school dramatic injury timeliness they beat rifles AC Milan one Neal in the city into remains said in the tables six points a fetus event is\nAnd the tools for next month's women's Africa Cup of nations was made a glitzy ceremony in a crowd on Sunday night\nHas gone up we'll say Algeria money I'm kind of ruined includes a Nigerian the defending champion his one eight to ten tournaments I saw a ... seats in ... the day will say South Africa Zambia and Kenya the temperature will kick off on the seventeenth that's been\nLike more from the shop in twenty minutes time allows business and Italy is going to have to explain to the e you how it's going to adjust its spending plans to comply with the eurozone rules\nThe European Commission was already a road to revise its plans assigned the first draft of the budget is unaffordable a European Commission is demanding to see a new budget by midday on Monday which isn't going to go down well politically in Italy the news\nIs here from a business that's what is the basic ... wants to do this you just want to spend spend spend money does not spend\nMoney doesn't have exactly gotta Italy had elections back in ... Iraq not remember that resulted in a new coalition government forming between the late ... and the five Star Movement ... made a lot of spending promises during that campaign now they're in power and that trying to honor them some of those promises included\nReducing their time and age increasing spending on welfare introducing something\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatrician that committed the children's health by being health care partners dedicated to their well being from birth to adulthood including us all important teenage years later how has over twenty pediatric location to serve central Florida family more information including locations that Eileen Dole health dot com slash kids\nThe European Commission says you've already got an enormous debt and that means that against the rules for more on this now I'm joined by ... boring lecture at economics that Louis ... University in our studio thanks that they ...\nThe Italian governments that it's going to pay for all this with higher grocery but great in the economy and easily has been pissed distantly week and that's the problem\nExactly could also has been slow and that has been lower in the last I Would say Fifteen to Twenty years\nThese government to claim said that that these new budget or that or a contains a lot of additional spending will be financed by our young girls\nAnd did you take them down likely in fact the bank of eat that he says the meetings that are the good old age that there was already ... is so far as the slowing down even farther\nAnd on top of that the economic uh toward the economic environment to definitely in a positive and this means that the the outlook for the economy is negative so I Would say that it is likely to the doctor said that uh will beat a larger or if the government among the and the promises me\nWhat do you expect will happen today than at midday who's going to back down here in Brussels\nI think nobody's going to a break down I think the government there we ... a stick with the we did a budget so we didn't plan\nAnd we try to find a clash with the European institution which is a populist government to that uh is high and get the next to European elections in the spring\nAnd there is a finding domestic popular support to buy a showing that you can the fight against the European institutions in the in the ... or did he say\nRecently a growing sense of ah did he said his faction would you like the institution as a consequence especially of the\nMeeting of the immigration policy or you will ... policy and uh it's a tight to gain support tending to sense the institutions we'd probably a response to that to a better I think we will see has turned off\nOkay make elaborate from at least thinking about the Enron thanks for joining who\nKnew this was a business you've seen a U.S military commanders coat and Britain to type I British medicine sipping captured on the battlefield in Syria us also wants help in the rebuilding of Raqqa from wet chosen bail report [noise]\nForty chemo buttons from the front line us backed Syrian troops occurring at best final drill before they will be the last big battle against the group known as the Islamic state in northeast Syria\nIt'll be up against an enemy of moves on the surrounded but still willing to fight to the end\nOf the Kurdish come on to the Syrian democratic forces tells me the extremist still include many foreign forces vision general ... says that includes an unknown number of British hadn't\nESPN has already captured seven hundred foreign point is among them to know as we speak tools of Shaquille shape and I like going to concede associates or the food on yes executioner known as the Joan\nNow held in limbo as prisoners in Syria screw the u._k. nationality I think you'd have to remember that these guys I'm a senior U.S military officer on the ground says it's now time to Britain are taking them back [noise]\nIt's not the only written some of the nation's being off\nLimits to the whole idea of it is with us about this on the\nRecord civil council is trying to get that shuttered cycle its feet but they complained that none of the city ... bridges to be repaired much a racket is when I went to central services like running moved to an electricity under us to sleep is so great you\nKnow couldn't shut up with the ... everyone you cannot be the destruction of the city should help rebuild it including Britain and the U.S and we had that I said to eat ... Moustapha likens records will stick man with the media tell I'm not going to save his life [noise]\nI think Frank is returning to some people might not see much of a city is still alive and ruin the question for the people around here now run your own pace to to rebuild their\nCountry for America say they weren't at least until there is a peace protest for the whole country\nChildren's future little suffer if you will find a way\nIt's one of the education for grants from the body US state department\nThe beholder is in charge\nUm we actually have some children some cells or I just tried one girl was married at eleven and she had had and they had been hit by shrapnel her face is mark\nAnd married her off at eleven she was divorced at Thirteen and we got her into the program and at first when the when I met her she was one of the top performing students in on her lettering and being able to write and to draw\nThe the noodles Abdel Rahman lost his wife was blowing just bought one of the thousands of IDs left behind by the extremists that he says he draws pictures of the conflict because he still feels afraid of the U.S\nHoping the funding for this program is an effort\nOther nations to do the Trump Administration is cussing [noise] two hundred million dollars him off to help stabilize Syria\nRe direction as I can really affect your program and then he was\nA while my funding will actually end at the end of January\nCountry canal is the senior State Department official in the country\nThe president said that this is a burden that needs to be shared a ISIS is a a a scourge that affects a much more of the world than just zero or even the United states and so it's the obligation of the international community to help with that [noise]\nAmerica still have reached on the ground moving to sound country did other nations need to do you move\nIs one of your own some frogs lined up to be um should be in and out of jail many times for a ticket to the streets to put a minute just across I spoke to a top while on on the line to dwell on a business how she described how the tuition\nAbout three doses police\nIn riot gear we the machine guns have been outside my house\nThey packed the pickup truck my driveway so they'd know wait for anybody to leave the house with a car and they tell me they have received instructions for me not to leave the house\nSo I Am on down an illegal how correct leak out because they happen to know why they have no document they are not um accusing me of any ... they simply want to stop me from leaving the house\nThat's kinda what I one of the opposition activists in Cameron and a a ... a reporter Randy Joe stop [noise]\nWhat about some stories this morning comes as a migrant ... in Mexico and that's kind of one of our top stories from the newsroom and the headlines um the question of the migrants not really a camera and the boatloads of migrants crossing the Mediterranean remains as a constant headache it's so constant\nIt's kind of not really even in the headlines anymore Italy believes the NGO should played no role in trying to save lives in central Mediterranean they use those rescue boats you may remember of basically being beat taxi\nService and for the people smugglers I'm encouraging migrants to makes a dangerous journey across the Mediterranean\nIn order to facilitate this time in government has closed its ports to the non profit organizations or one of the operation by the Spanish and geo ... open arms decided to defy the Italian government it's set sail for the central Mediterranean from Barcelona will happen next\nCorrespond the James rentals was on board [noise]\nWe are just setting sail now from Barcelona\nHeading into the open office of the Mediterranean [noise]\nWhere sailing on a convert hit your eleven of us on board [noise]\nI'll Scott ... founded the ... open arms organization at the height of the migrant crisis in twenty Fifteen\nWhy this operation if this is my mother and I said well into dining room medical\nBut I'm there were no rescue boats operating in the Mediterranean so we saw herself forced to come with that only about ...\nYou know it costs to watch it leaves interior minister ... says he accuses you and other NGOs whipping taxi services for migrants how do you respond [noise]\nWarner got under a issue no there was\nA ... it's one of the trade in the world Ninety seven thousand shaped pass by here every year on two hundred and fifty of them every day maybe even ten an hour I don't think we are the ... or important enough to gather all the attention\nWill do I get I guess if you send them if you can't use Italian Port Sudan to travel for days expensive operation how long can you keep doing [noise]\nA lot of support the ... he was supposed to but\nWe're a state of sense first of all it's doing such we won't stop operating we have the support of many fiancee ... but the thing that people don't have to die around an abandoned in the military [noise]\nWe'd be saving for a movie for days now we've made it from Barcelona all the way to the Italian island of Lampedusa in the central Mediterranean\n\nPlus three in the morning [noise]\nReading green flashing lights [noise]\nWe're really close to that both sound how do you know it's fishing boats and not a migrant while\nThey're buying or whatever we can see that [noise]\nWhy why so why should I use the ... okay [noise]\nSo that's the kind of lights a fishing boat how old am I heard but I\nOh I see around me now to empty ocean [noise]\nKind of a monk fish is one of the crew members on this ship she's a former competitive swimmer\nAnd to choose what for many years as a lifeguard\nDuring this mission we being at the fed seven days\nWe haven't seen any migrant how is that for you when you just don't see any one\nHe needs to take a train it's just taking because\nWe know I Know a a a man yeah we do have their own leaving for higher up and then um we don't know how many lights [noise]\nSo you see the same thing because we\nAre able to help and now you seem to mind because of course because when you hear\nMe\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do we now have you been happy family\nDo you support and interrupted programming donating a dollar a day W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nSet sail from Barcelona I can now see that in quotes of jazz bar in the distance\nThis is where I get off\nThe astro boats will continue its operations in the Mediterranean for another few days\nThey haven't found anyone yet\nAnd if there's no way for them to rescue\nWhat's left for them to do [noise]\nJoins Reynolds on a board the both of the Spanish and Jay ... open arms on the seas of the central Mediterranean\nYou stay on the surface with loans pulled out and meet James ... top story right now the Australian prime minister Scott ... has to live in a national apology to thousands of victims of institutional child sexual abuse [noise]\nWanting change the tacos celebrations are on hold for British strike often include any finished that the u._s. swimming among grown tree in his ... just one page the head of his name is ... Sebastian faculty adults in whatever\nPits trying this championship teams echo by eight points that he fell just short Kenny rising and one hit sprayed since March twenty thirty to stop and look how to get rid of his team strategy\nWe should have been able to suffer you gain that you get from from a super self turn off the shelf in the eyes of the stock is quite significant gimme capitalize on that I couldn't do anything about that but then once he was the head was quicker I couldn't keep up with them being that I saw a tire on and then we have a living which is\nWay way too early and they came out nine seconds behind so I had to catch up by the time I caught up the cause of death from bad to worse throughout the race\nFor Hamilton any need to finish in second place in Mexico next to tend to be crowned champion\nIntimate contact in my early ... scored a traumatic injury timeliness they beat sticky rivals AC Milan one now instead of yeah I mean we don't keep in touch bed in the table six points behind me to defend\nIts Danielle second in Spain's I Need that just to point behind popular now after a tuna when ... English Premier League action cue like coastal advocate and help them be put some kind of you know kind of had any I had a penalty saved by England don't keep a job in the station and some kind of stuff's very much than\nOthers and do\nWhat you do this or that question of deserving release or crush the result do get to or things that we can lose her beauty was were well enough and plays roller results\nBusing was so totally\nTotally ... no one would've begrudge just because of the way we played a role or is this place to place\nThe tool for next month's women's African nations was made in a crowd last night now has gone up and hold it in Nigeria will be the top seat for the tournament which kicks off on Seventeen sniffing\nGone on a drone in group hey with kind of in Algeria and money Nigeria will say South Africa and Kenya including the tournament well also plenty fights for next just women's World Cup\nWith three places on\nAny kind of a season ending WTO tournament continue in Singapore today\nNo dancing with a big match up of the day Japan ... or ... against American Stevens and if I come to us from being in a sense of touch your body and that meant that has been a lot of scientists and hit\nThe intention of she was of course we had a coming back from New York she has four hundred and four hundred and fifty different media outlets [noise] you know waiting for her first on the phone if you look at it you know in the beginning of\nThe year nobody are all people knew about they didn't really care as much before she was much success for [noise] but um something beautiful to see that you can create you know like that but one individual come\n\n\n\nYou're listening to the b._b._c. world therapist with night from all over the turn it on the phone\nSo I Will beat me that much from the township in South Africa [noise] [noise] [noise]\n[noise] I'm a DJ on it and if I had this music in the east side and not go down [noise]\nBlue movie at BBC World service dot com slash movie\nYou are listening to the b._b._c. World Service\nOur technology reporter then we can find the oldest or Washington correspondent for about ... what was in the north east England is good Emma ... joined one of the key to be torture and abuse or however you want to own their own line don't smart so\nThis is the b._b._c. world there but the world's radio station\nSupport for Ninety point have the news comes from Orlando Health\nRelated health network a pediatricians are committed to children tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years later health has over twenty pediatric location to serve central Florida family more information including locations that early in the health dot com slash kids\nTo the BBC a concept celebrating experimental and I've only got ... week old insect notices have naked instrument\nThe amazing ... Juliet phrase that tells us what it's like what were the young living ... has ties to singing the music of someone centuries dad if you're talking with the past and you can you can discuss what they mean by a certain\nKnocking on the pay trip I sat musical gesture we chose to hew brunt of the London contemporary okay started dating methods of me the black\nCanadian vine and his name is Benjamin plays a peace inspired by the voice of cat campaign and Israeli ... tells us how high level one simple attack or adapt\nTo this day when I'm On my family comes to coincide within ten minutes they were Texan in getting me advice that I should write things that I'm On all day cars they do have a two and pull that animal coming up on the tap backstage [noise]\nHello I'm David Hawk or with the b._b._c. news the Australian prime minister stalled motorists them has to live at an emotional national apology to victims of child sexual abuse in parliament Mr Morris inside the states had failed to protect victims from decades of what he called evil dunk crimes in schools churches and charities as\nWell as in family homes\nWe own a every survivor in this country\nWe love you we ... and we only matter if\nYou were here at this meeting twice or elsewhere this apology is to you and for your your presents and participation Mike's tangible where I worked in dire straits while those who are yet to share what has happened in the world\nIs apology was one recommendation of the royal commission that investigated the institutional child abuse in Australia\nThe fall writes presidential front runner in Brazil shy of both scenario has threatened to ban the left wing workers' party if he defeats its candidates and undo a dad in next Sunday's election to both Saddam remade the threat in a video link to supported in Sao paolo\nHe said he would plans Brazil arms sweep once he calls the rat workers policy criminals\nThe Mexican president elect Andres Manuel Lopez Obrador has urged the authorities in southern Mexico to protect the thousands of migrants making their way towards the United states\nHe was speaking in the southern state of Chiapas where the migrant caravan has reached the city of Chula President Trump has said they will be turned away if they reach the U.S border I mean my book reports\nThe migrants mainly from eastern Honduras have already trick the length of their own country than watch 'em all across the river other forms of border with Mexico with the intent of continuing north to the usa\nHere Mexicans have come to feed the migrant and give them water and close the sleep out in the open\nIt's been a welcome boost for the men women and children who spent more than a week on this arduous journey\nThe sole motive of thousand miles from America's southern border and Donald Trump has promised that none of them will get through but many here say they feel they have no choice but to do whatever they can to escape the poverty and insecurity of their lives back home\nSaudi Arabia says king Solomon and crime prince Mohammed have telephones the son of the murdered journalist ... to offer condolences comes two days after the Saudis admission Mr ... was killed in that country let in Istanbul\nThree weeks ago the Saudi foreign minister Adel al ... posted this message on Twitter\n[laughter] have a tragedy and don't go out to them we feel their pain and I wish [laughter] happen and I wish that this wouldn't have done what leads you to bring with me and I were them with those Muslims who will be held accountable for this\nWorld news from the BBC and the report\nSays the world is losing the war on drugs and that the United nations should abandoned the dream of a drug free world\nThe international drug policy consortium which brings together more than one hundred and Seventy drug research organizations such targets sat in two thousand nine to reduce cultivation and smuggling are being missed it or just the UN to be more realistic about the impact of drugs and two adults less students have policies\n[noise] a landslide in central Columbia has killed at least nine people including five children landslides in a poor neighborhood in the city of barren combat musher buried three ... tons of mud [noise]\nItaly has a few hours to satisfy the European Commission that its budget plans for next year or affordable and comply with your resent rules the commission rejected the budget forecast last week as a business reporter Jonathan josephs\nMe Nikki faith the Wendy ... is in China's back South Africa next week to you that [noise]\nThey said the b._b._c. world surface were unemployed since you asked if some of them to repeat can help speed Africa\nProbably looking at how big money for doing this is a goal to hire\nUsing crop varieties that are seen as much\nFor Muslims about also one of the richest people they wanted to control so let me see let me just wondering how this gives me for the lives of Africa Africa's for them to repeat BBC World service don't lash documentaries\nYou are listening to the b._b._c. World Service\nIn Washington for ... cents\nHour South America correspondent keeps you watching reports from Brazil\nWon on your regional Mike ... is here in the studio or America's editor count as being the gang much\nOn their own mind smart smart speaker to BBC World service the world's me do you see some\nID point seven W and the Orlando\nAnd welcome can you stay from the BBC will learn spot I'm James ... [noise]\nEverybody strong emotions in the Australian parliament or prime minister ... more since apologizes to victims of child sex abuse going back decades as a nation we found them [noise] we used to ... and that was always ... ...\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nRows of the U.S by Mikhail Gorbachev to back in the news with a warning on arms control on the head of the midterm elections we go to Tennessee where African American throws you say they can tip the scales incentive Democrat to Washington or new\nSpirit has awakened and I'm just happy\nTo see this energy and now the traffic to fall\nFor say ... percent of life is well [noise]\n\nYou know ... with the b._b._c. news under the survivors of child sexual abuse in Australia have had that prime minister Scott ... to live at a national apology upon them in the Australian stated failed to protect them from decades of what he described as evil dark crimes Griffiths report\nDeep and symbolism decades overdo the apology was one of the measures recommended by a falling view the inquiry it had evidence from schools churches ... homes and ... it's estimated around sixty thousand ... eligible for compensation\nTensions remain however over how for natural to address is being managed under a cold for tougher laws to prosecute those who cover up the big ...\nIt's All right presidential front runner in Brazil's valuable scenario has threatened to plans Brazil of corrupt elements to the left wing workers' party if he defeated candidates than I Do a dodge in next Sunday direction that he would sweep what he called red ... what his policy criminals from the country\nAnd actually can president elect Andres Manuel Lopez Obrador as the authorities in southern Mexico to protect the thousands of migrants making their way towards the United states President Trump is at the migrants will be turned away I Need to report\nThe migrants mainly from eastern Honduras have already ... the length of their own country than what the law and across the river other forms of border with Mexico with the intent of continuing north to the usa here Mexicans have come to feed the migrant and give them water and close the sleep out in the open\nIt's been a welcome boost for the men women and children who spent more than a week on this arduous journey\nThere still more than a thousand miles from America's southern border and Donald Trump has promised that none of them will get through but many here say they feel they have no choice but to do whatever they can to escape the poverty an insecurity of their lives back home\nSaudi Arabia has king Solomon and crown prince Mohammed has made a ton of coal to the sun never met a Janice Jamal ... she to offer that contaminants in it comes two days after the Saudis admitted that Mr cash out she was killed inside that consulate in Istanbul three weeks ago\nThe Saudi foreign minister has blamed around corporation but many think the crown prince ... bin ... Mohammed bin Salman has responsibility for the murder his marching patients\nMany believed that mom up and saw him on most of sanctions or at least she knew enough about this kid like he's going to oversee Saudis investigation into the killing he's going to oversee\nThe reformation or the reform of the intelligence agencies who have been widely blamed for their smarter so if you believe that Mohammed bin some on the side of the crown prince was ultimately responsible for this well he hasn't been taken on a ... a man also like\nYou can argue that things will change in Saudi Arabia if she continues to run the show\nBBC knees Chinese state media has denounced comments made last week by the U.S secretary of state Mike Pompeo the China was engaged in predatory economic activity speaking during a trip to Latin America he said that when Beijing show Dr deals that seemed too good to be true that may also be the case\nChinese media quote Mr Brown paint his remarks wild disrespectful ...\nEuropean economic ... has called a constructive dialogue with the Italian government over the country's budget times rather them has a few hours to satisfy the commission that its budget times the next year or affordable I'm comply with you resign rules his donors in jazz is\nIts least government one they see it the lectures with promises to spend big including one infrastructure welfare um dilemma retirement age\nBut the question is whether it can really afford to do that while sticking to the spending rules the members of the euro zone\nA bottle of political will seems to be in the offing but the financial markets ... the ultimate say the cost of borrowing has been rising for the Italian government and its credit rating ... by one leading agency with little find that the economy will grow enough to fund it spending palms\nThat seems to be an easy way out to the showdown between the yours and won't make his third biggest economy\nMexico's issue didn't last long positive specific seaboard as hurricane winter approaches to cancer before storm is gathering strengths before unexpected landfall on Tuesday it's already creating top sustained winds of more than two hundred kilometers an hour\nA new report says the world is losing the war on drugs and the United nations should abandon the dream of a drug free wild\nInternational drunks policy consortium which brings together more than a hundred and Seventy dropped percentage organization is as you see you and to be more realistic about the impact of drugs and to adopt less punitive policies\nBBC World that his knee\n[noise]\nLike do folded like just or as Muslims\nMutate with Lawrence and James on the way we'll be hearing from Tennessee strongly Trump concentrates on how Democrats have hopes for the midterm elections we how Mexican volunteers are giving out food and water to the Honduran migrants on march to the U.S from white Italy\nCould end up on the northeast I've been Brussels overspending with money that doesn't have a whole lot coming up on news like [noise]\nWe saw in Australia well you know if you have to go to the prime minister delivered to start national apology to the victims of child sex abuse sky marshals said it was a day for the country to confront suffering so many injured inside we\nHonor every survivor in this country we love you we ... and we only hear\nMatter if you were here at this meeting twice or Elsewhere U.S.A apologies to you and for you you're presidents and participation Mike's tangible our work to die in a few strays to others who are yet to share what has happened in the world\nHas the Australian prime minister ... sorry on behalf of the nation to victims of child sexual abuse\nHundreds of people gathered in camera on Monday to him Mr marsh and deliver the emotional address in parliament that follows a five year inquiry code royal commission\nWhich from tens of thousands of children who suffered abuse in the nation's institutions over a period of decades inquiry which computers last December HUD more than eight thousand testimonies from victims about abuse\nOne of those who testified on who was also there to here Scott Martians apology was re leery\nApology prime minister stage choice or sales but I think the opposition male shortage stage or\nSupport for Ninety point have the news comes from Orlando Health\nLeno health network a pediatrician that committed to helping tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years later how over twenty pediatric location to central Florida family more information including locations that early no health dot com Plaskin\nNuns people at the situation site Heinz celebration army every won't get wet cage go inside she looked after in love and care for that which isn't abused basically mentally and sexually\nHow does this kind of occasion\nMeasure up when you were comparing it with something like criminal justice would jump through in your case the man who abused you ended up dying in prison how do you weigh those up this is a different kind of justice a different kind of moving to closure how does it compare with the criminal system\nGrowth has been slow and has been lower in the last I Would say Fifteen to Twenty years\nThese government to claim said that the new budget or that the uh contains a lot of additional standing will be financed by higher growth\nAnd do these extend them now likely in fact the bank of easily says the main thing that the uh the growing age that there was already ... is so far as the slowing down even farther\nAnd on top of that the economic uh toward the economic environment is definitely not positive and this means that the the outlook for the economy is negative so I Would say that it is likely to the doctor said that uh will be a larger or if the government among the and the promises has made\nWhat do you expect will happen today than at midday who's got it back down here in Brussels\nI think nobody's going to back down I think the government there we are a stick or with a weed it's a budget so we didn't plan\nAnd we try to find a clash with the European institution which is a populist government to that uh uh he's hiding or the next to European elections in the spring ...\nAnd there is a finding domestic popular support to buy a showing that you can uh a fight against the European institutions the institutions would probably fall into that but I think we will see us enough\nTo make a lot for a ... let me see what happens in about three hours time the moon is many things [noise]\n\nFormer Soviet leader Mikhail Gorbachev is back in the headlines describing a decision taken by President Trump has showing a lack of wisdom that verdict came off the American president announced plans to withdraw from a Cold War era nuclear weapons treaty mystical shelf is the one who signed the original documents back in Nineteen eighty seven with President Reagan\nAnd one person who live certainly read the critique is Mr Trump's national security adviser John Bolton who arrived in Moscow on Sunday\nIt doesn't look like miss the boat and we'll have an easy time Ivan ... professor of international relations at the European University in St Petersburg\nOh yes I Am from uh most of the reasons I Would say when\nWe speak when would discuss new\nYou know the news of all the abbreviation of an extreme which will remember\nTo do about a three two to three two was how they treat their was violating by way Russia or the three\nTo smoke you know you lose the street in the United states too much uh the stalks of goals for years already made them she'll suggest to do or you know to to\nRead when you're older and wiser in American\nHistory from Fifteen Years ago\nAnd there was you know it used to ... for at least like ... years and what ... what what's the difference between those talks on the news but we always show you know I see this is a\nProjection older domestic programs most Russia and the United states here right now [laughter]\nYeah I I can you know that the deterioration of Russian American relations ... to start to well from the Russian side to text auctions going to show some boils\nOff to me support in a needed to know to to to keep his power off though there'd be protests against looting elections and\nAnd the United states side the deterioration to start to us from doing to sixteen soon fuse to drop was a little bit older than I can states\nYou know we we all for all this way for for a you know of criticism towards Russia Russian meddling in Russian but you see patients I'm holding them in American domestic political must be more than a boat or American domestic\nPrograms so that means that Mr ... then it's actually kind of ...\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nOr than it used to be giving them used to be in Russia are we only we are among men beginning this cost is she a become the way we can go to Rio challenger or the world\nTo live in ... the European University in St Pete Stark choice woman his posse I'll just go back to the U.S where the midterm elections off fast approaching\nUm you may remember that you may even guess if you don't remember the president Donald Trump won Tennessee a pretty something we bought twenty five percent in the presidential election\nAnd now there's actually a contest going on in what is traditionally a deeply red Republican state big money pouring into big names of weighing in almost become the single most important Senate race in the country\nBob or ... went to Nashville taught up [noise]\nAt the new hope Baptist church in Nashville voting is a safety issue [noise]\nAfrican Americans didn't turn out in large numbers for the presidential election and they don't like the result so the black clergy has mobilized\nTo\n\nJames eternity the second to believe that if African Americans in Tennessee vote as a bloc they ship the scales in the Senate race and sent a Democrat to Washington\nOr new spirit has awakened and uh we just happy to see this energy and now we've got to the polls\nIt's extraordinary that the Democrats think they even have a chance in this ruby red state\nDemocrats saying that there is not black white timing about [noise] the Republican\nCandidate Marsha Blackburn has a reputation as a firebrand she's tied herself closely to President Trump he's campaigned for her twice in great [noise] look\nI'm not running against Donald Trump I'm running for a Senate seat to represent the people look Tennessee I\nLearned along the Democratic candidates still bread is in is a popular former governor he talks about his personal brand as a politician who gets things done rather than party [noise]\n\nThat pitch is aimed squarely at disaffected Republicans but an hour outside of Nashville the party is pretty important\n\nThis is an annual fair in the town of Louis Berg it's Trump country [noise] still there is some impatience with parties and shutting match in Washington\n\nAnd if he is an interesting test of whether a political moderate still has appeal in this hyper polarized climate but it's also crucial because the Democratic wind here is key to helping to party take control of the Senate and that's a deal breaker for many\nFunny I Love Donald Trump\nI think America is that going to run right now I think we're really spread but all over the world but what about Phil Bredesen what do you think of heroes nice guy I vote for him\nBut he somebody who might get things done right\nNow he says he's ... he's only going to get done with his party wants them to get done with the extreme conservative than extreme liberals moderate is really really nice thing to have [noise]\nAnd but you don't know if you're going to vote for the moderate to feel better that sure right now I'm not you might I might and is that one of the main reasons why yeah\nIn a state where music is the currency the singer Taylor Swift has raised the odds she threw her mega star power behind Tennessee's Democrats in a recent social media posed to her one hundred and twelve million followers [noise]\nAsserted millennials registered to vote but that doesn't seem to have changed many minds in downtown Nashville on a party Saturday\nNight Live you're\nTaking me right there Donald Trump said nine ten in Myrtle Beach [noise]\nAnd I know a lot Taylor because she has a great music and keep the great part that I don't think he tried to tell you about more\nThan\nThe Republicans have pulled ahead in the polls but so much work at Penn who actually shows up to go\n\nTo Russia\nIn Nashville are looking ahead to to the Senate race there that is one of the\nMost uh see contested bumps in the mid term elections will submit term stuff goes to a special uh will service programs being cut from uh from America Jimmy ... comics who support you may have heard will be a part of that as well uh we'll bring you all the flap here on a new study as well [noise]\nYes indeed uh what's come across in a yeah I'm Sorry about ten days trying something like that would be a couple of weeks and that's it for the suspicion of nice to meet with James announced thanks very much for this company that tomorrow floors will not put back on the old way way too very into [noise]\nSo for all of those five hundred and sixty four live as reports in the paper to have come from volunteer Dina's would have required that just about every single one of the volunteers dined nations across China during that period had gone to the ... office\nAnd we said that we didn't have direct proof but it was just so unreasonable that they could of sauce five hundred and sixty fold Davis from volunteers during that period when there was any a pilot program that we asked the editor to take action\nBecause in the paper they say the older buildings were quote him terribly donated\nThey do say that on diets my contention is that's a false claim and how did ... respond to criticism eventually they show the email ... his claim they declared that all the ... from darkness after cardiac death no ... from executed prisoners\nAnd then they said that old ... so rich that China liver transplant magistrate as if this was proof that they would somehow ethically per kid\nThat registries no shape and two independent all public ... so we couldn't tell whether the information that would actually verify that claim\nAnd also that register was a ... a thousand and five at a time when all the ... by the Chinese on that mission was so from prison is so it didn't seem it very useful piece of evidence to say that the Trump stumps or right just said\nAnd then we um enlisted the services of a Chinese speaking reset shots so actually looked into the hospital documents from ... province department of health to find out when the pilot program started that\nAnd those documents showed that the pilot program didn't start in ... hospital until late ... eleven so his research program ran for Eighteen months before that was even a pilot program actually hospital\nAnd in fact his hospitals only approved for use hops not live as so we really felt that he had provided any proof a soul\nAnd then he and his colleagues suggest that claim that they would have needed three times as many diagnosis to get the same number of live as because of the problem with the live as not being verifiable after ... death\nAnd they claimed that Chinese message late to his successor ... Ninety percent for retrieval live as rather than ... percent which is the best practice and the rest of the world\nAnd they gave a reference to that claim that we look to that type ... which was a Chinese and ...\nAnd not pay for it was just a discussion article about how ... D D C D and there was no evidence in that type it just showed that the Chinese retrieval rights were Ninety percent\nSo we felt that that lesser in fact raised some questions that it on such and it certainly didn't amount to prove that they would not lying there between the logical\nSo we thought we'd all spoke to she should\nBe [noise] you know whether you want to say\nI went up to ... to ... off the tool but he didn't want to talk to me\n[noise] you're all the way [noise] [noise]\n[noise] [noise] you're right in the middle of international [noise]\nYour paper was trying to see the new minimum to not so much more [noise]\nDid you want in the paper you misled before about you know there's a shame you almost want so my question as I approached\nA group of his largely female entourage formed a tight circle around in protecting him from me and then they will Howard off off the whole down the escalators and into a new way to vehicle\nNot much luck there then\nMeanwhile in the session to promote China's new direction the Australians being wrote to him who robot one specific Australian\nTwenty six year old to hang coke headed tight tradition [noise] he loved to China to school kids English he wanted to give back\nJust helping another English teacher Phil ... who died in China last may\nWhen feel lost his life after complications from type one diabetes last month he donated his organs leading his Chinese don't do stunned they bowed at his bedside\nAnd he said he bumped up the opportunity and I'm In that situation then let them type with I think\nIt was hard for this is a reporter for mobile phones channel seven news tight here not to convince the outside world of China's new found direction it's rather an industry shouldn't have the kind of publicity campaigns now used within China\nTo encourage open detonation and trying to many people hold Confucian beliefs which teach the body should remain hole in death\nA tradition which is potentially in conflict with this new coal football ... nation\nSo how many people have become open donors in China joined the mortgage just reforming the second highest number of ... in the world of the usa around ten thousand is a figure from quote seeds and official sources\nThe campaign group international ... and ... abuse in China believes\nThe figure is higher they got research has to analyze published Chinese medical data on the capacity of cost one patient the senators eastern Goodman presented their assessment to congressional hearing two years ago\nThe Chinese medical establishment commonly claims that two hundred performs ten thousand transplants per year you had imagined a typical state licensed\nTransplant center in China three or four transplant teams thirty or forty beds for transplant patients are twenty to thirty day recovery period would it be plausible to suggest that such a facility might do one transplant from day\nOne hundred and forty six transplant facilities ministry approved meat that general description that yields are back of the envelope answer you can do it right here are not ten thousand but over fifty thousand transplants per year\nOn the campaign has also conducted another research project ringing around Chinese their nation centers\nTo have dedicated researchers call every day the same centers every day where you could donate your organs and the phone rang and rang and rang sometimes they would not pick it up for over a month finally when somebody did the researcher instructed to say I want a volunteer I'm going to donate my organs\nHi I'm off on taking all of our president and general manager of make the point that W MSG it's been a for two years since we first tried this less intrusive style the fundraising called fine with dry and this is how we do it now with the family\nDo you support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nTotal I mean there was almost no volunteer organ donations at all and now the numbers if you look at some that are appearing there a while they look pretty suspect it looks like they're just pretty much making them up but I'm not on the ground I Can't verify that\nWhile these findings suggest a low up take China now has a national database access thrown up where people can offer to donate that opens\nSo how many are now registered I don't know if the person in charge when Jay too ... says you form a Chinese minister for health and courage chat and director of China's national organ donation on transportation committee\nNot take a call ... ... ... that ...\nSeventy percent of the people in China\nSeventy percent of the Chinese people are beginning to do they do okay as long as that she's been ... open and transparent so how many have you read that and you don't\nYou dare we stop it and that some registration and they're so far is just that Danny harmful for billions of people read just as it is a ... year\nSo that's another very loving proportion of it for three or that and you know this is not of the nation these wind shear gas and everybody how does that explain the number of Trump's bombs in in the country I mean how many Trump's also taking place each year you'll you'll\nYou'll sure didn't know that the concept launched a debt wind shear more just a donor mostly restricted otherwise could ask your question yes because you have people in\nThe official figures I think it's about ten thousand or Charles Bronson Charlie is that right\nBoss here we have a Fifteen thousand organ transplantation purple including teeny leave a hot law right now every year in China ... billion people by ... I see you'll you I I feel\nThat rich decision for that one kid is nothing to do this donation ... you'll be able to read it at least understand me\nWell how can white white labeled I was offered to live a very quickly but but you're from a hospital in China about that now is that possible ... wants to jump question how is it possible if I bring up as a member of the public yeah one of the first hospitals I\nRaise you to get in the ...\nThey say yes it's possible we can do your if you come away but you're in a short space of time that I was not possible oh is that possible\nYou you you got to you you you just to be a hole in the sense that he was just at least not I'm not a happy to share the conscience of usually in China wants to have a chance to do is only\nHi I'm off on taking all of our president and general manager of Ninety point seven W MSG it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and how we do it now have you been to the family\nDoes your support all uninterrupted programming but donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nPounds shapes down south [noise] [noise] [noise]\n[noise] I'm a DJ and as soon as I had to mediate ... than it is fun and not so bad [noise]\nThe D the world's service dot com slash movie\nYou're listening to the b._b._c. World Service\nHow technology ... told us last Washington correspondent for some sort of what was going\nTo be the one to get Emma lane of drawn to want to see this will be torturing them either one or two\nOn their own line smart so this is the b._b._c. World Service the world's radio station [noise]\nBody point seven W. M. F. E. Orlando\nComing up after the news on the b._b._c. World Service it's hard to quit managed to even factor what gives each of us our sense of who\nWe are not the most personal level we all have our own family background of a general sense we all all of U.S policy the human species\nBut it's the stuff in between that puts us in groups or tribes and often it motivates our behavior gender religion ethnicity nationality things all the persistent fault lines that seemed to separate us\nFrom then on my guest today is Kwame Anthony Appiah an academic on public intellectual\nDo close yourself off people who live with people of diverse identity tend to be less bigoted then people can do or don't allow yourself to be channeled off into a world in which you're only are among white people early among Catholics only among a straight people and so on\nBats Kwame Anthony Appiah all talk after the news\n... at the\nBBC need Italy has shown no signs of backing down from running a budget devastated\nThe breaches European Union rules with a deadline fast approaching\nThe deputy prime minister Luigi de ... said he was willing to explain the plan which includes a budget deficit of two point four percent to finance will that spending the end of the economy commission app yeah most of the quotes a constructive dialogue and said he didn't want to crisis\nSomething you could just be doing ... ... my eight minutes to lead a constructive dialogue the European Commission doesn't want a crisis between Brussels in Rome the European Commission believed as I Do that is released place is at the heart of Europe and the euro zone a note outside it we have to do everything possible to respect that\nBut I Hope it to leak will respect Europe Phil do want to start\nThe Australian prime minister Scott Morris and has to live with an emotional national apology to victims of child sexual abuse in parliament tomorrow and said the states had failed to protect victims from decades of what he called evil dark crimes in schools judges and challenges as one of his time and they had on this\nWe on every survivor in this country we love you we ... and we only hear\nMatter if you were here is meeting flies or elsewhere these apologies to you and for you you're presidents and participation Mike's tangible I worked a dire straits while those who are you to share what has happened in the world\nThe far right presidential front runner in Brazil which I Am both an hour and a threatened to Clinton's Brazil or what he called corrupt elements of the left wing west his posse if he defeated candidates than I Do I dont in next Sunday then action\nThe b._b._c. Brazil correspondent that his rhetoric is causing deep concern in the country with a recent memory of ministry dictatorship the Mexican president elect Andres Manuel Lopez Obrador has actually oh surges in southern Mexico to protect the thousands of migrants making their way towards the United states\nThe migrant caravan has reached the city of Tibet you that and she asked President Trump has had the migrants will be turned away if they reach the U. S. Puerto ... reports\nThe migrants mainly from eastern Honduras sorority trick the length of their own country than watch 'em all across the river the forms of border with Mexico with the intent of continuing north to the usa\nHere Mexicans have come to feed the migrants and give them water and close the sleep out in the open\nIt's been a welcome boost for the men women and children who spent more than a week on this arduous journey the sole motive of thousand miles from America's southern border and Donald Trump has promised that none of them will get through\nBut many here say they feel they have no choice but to do whatever they can to escape the poverty and security of their lives back home\nWell news from the BBC actually kind of this you didn't last long positives Pacific seaboard Atari can win a prize chance the Kaiser ... gathering strength before the expected landfall on Tuesday\nIt's already creating tops detained wins more than two hundred kilometers an hour focused as a warning a hurricane will produce pounding rain want a life threatening storm surges liking\nChinese state media denounce comments made last week by the U.S secretary of state Mike Pompeo that China was engaged in predator ... economic activity speaking during a trip to Latin America he said that when Beijing showed up with deals it seemed too good to be true that may also be the case commission of the ... report\nChinese state media has called the remarks wild disrespectful and not based on truth are fact\nThe U.S and China and the mixing of protracted trade war with night and aside appearing like it's willing to budge observers say that's because while the U.S sees this trade war\nAs an opportunity to set right what it believes a decades have unfair trade from China Beijing sees it as an attempt by the Trump Administration to cut China's rise\nDaily life in much of Indian administered Kashmir has come to a standstill because of the strike cool by separatists dreams schools colleges chops and businesses are closed in Sri Lanka and other than to the Kashmir Valley roads a disaster aid and trains running\nThis effort is to angry about the deaths of seven civilians in explosion on Saturday and encountered between the security forces and three suspected medicines\n[noise] the new region resistance hero who that a daring mission that whole team Nazi Germany nuclear weapons ambitions in the second World War that died at the age of Ninety nine\nIn Nineteen forty three your can ruin a bag demanded a six men team that destroyed key parts of the heavy ... occupied southern away the rain was later turned into a Hollywood film the heroes of ten o'clock\nBBC me\nWelcome to talk on the b._b._c. World Service my gosh today has become one of the world's leading public intellectuals who spoke as much attention on identity how we as humans see ourselves and the others through the complex prison of race gender religion class on\nNationality for Kwame Anthony Appiah the drive to dig deep\nSuch questions comes from a very personal place the is the child of a so called mixed marriage his father was a lawyer\nFor any planes and the news comes from Orlando how are they now have Arnold Palmer hospital for children have been caring for the children and teenagers central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nYeah it was a gifted student who went to Cambridge University and became a professor of philosophy and law at New York University He is a gay man who's married to his partner have more than two decades\nSo his own life is a fascinating example of how complex on multi lead our sense of self can be\nAnd yet the way we humans define ourselves and define others often tends to be focused on the vision we use race religion and the class to separate us from then increasingly and this young century the politics of identity seems to be fueling conflict and hate\nSo is there an end to vote to this preoccupation with group on tribe well\nKwame Anthony Appiah joins me now welcome to talk fit to be here you\nHave to spend a great deal of your recent professional life thinking about identity and how each and every one of us labels ourselves so let's start with a simple question how do you label yourself\nA little bit on who I'm Talking to a taxi drivers are usually I explain that I'm half a gun and enough British by origin and that I live in the United states that's the that gives me three countries to talk about in terms of some sort of national origin\nTo you when you describe where you're from and and the sort of mixed Scipio identity although ... are you thinking that you're sending signals to go into lucky to er about about who you are\nYes I think I'm sending signals I think that sort of as a weak signals some faraway planet or something because because they don't tell you as much as I think many people assume\nUh they they will so I I grew up and got on my father was going to end but that doesn't tell you very much about how interested I Am and got her doesn't tell you how much I Know about guys since I'm ... years and so on many people that would be more informative to know what their nationality is you know if if at\nBut I end up pretty quickly in a conversation I think you move beyond the the stereotypes into into more detail and then it doesn't matter so much that it's not all that helpful\nHow do you interpret what is happening in America today\nWell I think that the important things to see is that the temptation to use simplified\nUh pictures of the way the world is divided up to generate support for political campaigns and submitted all genders that that's just a feature of the world\nAnd one of the things one tries to do as a political person I've been in in one's life as a as a citizen or trying to think about politics if that is to try and undermining and reduce the support for the people who take advantage of this easy mechanism mechanism of dividing us into a often them\nAnd to create a kind of solidarity based on false beliefs about what we alike and folk places now that I I think those people are dangerous the world is full\nOf ... so you ... I mean this isn't just about Donald Trump won Glenn other look at the populism and a nativism in Europe where they are very low income I tell you we're solving your mind if you're on TALK recently in Italy and you're flipping Victor Oh about an hour you can look at a whole host of frankly you could look beyond the shows have Europe to to India where\nThe current government uses nationalist and polarizing cultural measures [noise]\nIt does but the point you alluded to earlier you ultimately are not ... I Believe that the trajectory of the human condition is in a in a positive sense toward a more universal list a more\nHumane understanding compassionate humanity I guess how can you square that with what you see well uh\nI I guess because I'm looking at it over a longer horizon than just five or\nTen years or ten or Twenty years I'm thinking about how much things have improved in these respect\nOr in many ways over the last century outside for example think about the massive improvements in the condition of waiting to ask people and many many countries over the last century look at the massive reduction in a racial\nOr discrimination in the law in the United states over the last hundred years look at the end of the increasing\nComing together of Europe at the same moment of these moments of nationalism and put him back to that the one side which one has to do on your ... is way more unified in the United uh than it was in the in the nineteenth century\nSo uh or even in the middle eastern countries I think older they say if you look over long enough horizon\nYou can see the general tendency is in the direction that I Would regard as up one\nArea where I can see that you would find solace would be in the way in which certainly in the western world ah societies and cultures view a gender issue has been particular\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support for hunting corrupted programming donating a dollar a day with W ... or call one eight hundred Seventy five twenty twenty\nUm partner how far can we go with the notion that human beings are now free to choose their identities in ways that we never even thought of before not just in terms of of sexuality believing in terms of of basic gender where now there is a\nA very powerful movement to to change the way the binary way we see men and women are a lot of people who define themselves as known binary there are others who are transgender ring and society slowly appears to be moving\nTo to accept them and new ways where does this end\nWell I don't think he ends the there are two things at the airport but where it doesn't that doesn't end with the disappearance of identity we are reforming our gender system but by not getting rid of gender altogether I can ... I Believe that I was alone all into the remote future\nWe'll still have ... it'll be more complicated than the old simple binary system but there will be men and women and some people in between now\nAnd there's the question is where Anders self\nIdentity and because the interestingly I I'm I'm lurching between different spheres but but I Am mindful that on how to not so long ago we spoke to a woman called ritual does though who\nIs white parents age but identified them indeed became an activist on behalf of the black community and on and lived a life as a black woman though when she was challenged about this because people realized eventually that she had two white parents it became a fascinating and difficult debate about who is to say\nWe want being black is and she said look I I've never identified as white I feel myself to be black so therefore to that extent I'm black well\nI think she's a very good case to think about because you ask what's the relationship between self and and another I think you have to think of these things as a matter of a negotiation you can't simply declare the meaning of the euro and rice all on their own race has a special category you need to\nSee if you if you'd have life where it's put you you need to persuade the well to change that is what trans people have done\nThe trans people have done what Rachel Dolezal didn't do\nWhich is they created a movement to allow them\nTo be what they want to be an artist and they've asked us to change the system I'm not I'm happy to respond I found that they believe that request and change the system I don't think it has any harm to me to buy masculinity to adapt system in that way and even if it gets a little bit of how do I am asking them they are they happy because obviously very important to them\nA fragile do they'll have could have provided a could've made these arguments at the ... began the thing and if you could have done it in the way it was a little bit more straightforward because what she was actually doing she knew involve\nConcealing something that other people thought was important now she didn't think it was important and that's an interesting fact about her but unfortunately a black in America doesn't belong to her and so the only way can be changed in the direction that she wants and I'm ... I'm willing to listen to her arguments visiting it that way\nIs if she makes the argument creates the movements and she can't do that on her and she has to do with other people to have to persuade other people\nIn this interview and indeed in some of your writings you would have been very consistent saying it's not my job to fix the society is simply to understand and explain how societies work to my fellow citizens now I I get that\nBut do you have ideas which you can share with me as as to how to overcome the lies that currently under paying our identity\nWell I think the most important thing for us to overcome and to the extent that getting rid of the lies helps I'm In favor of that is is the the moments when identity leads to to hostility and hatred and division that's the thing the ones that can full\nSo that I think some things can be said a but these are the things that are known to social psychologist one is so close yourself off people who live with people of diverse identity tend to be less than people did that so don't allow yourself to be channeled off\nInto a world and when she only are among white people only among Catholics certainly among 'em\nStraight people and so on open your eyes open your social experience do people live all the major kind and do things with them about race or religion or or sexuality but there are about soccer or about to go to the movies are about\nUm you know building something in the community together woods together with people because I think working together with people to divest identities makes the identity is less dangerous and then frankly\nIf you have folks ideas about them as long as the falls ideas how leading you to behave badly I'm not so worried about the people have false ideas about absolutely everything not just identity level of ideas about cooking and the ... and if it comes to my Tom I'm not too worried about\nThe final thought that we have a a thinker and rice or in the United kingdom David good heart who said that these days the most\nImportant distinction and identity that that one can use when looking at people in western society is between those he calls\nAnyways and Lucy coals some ways not anyways other highly educated usually metropolitan highly immobile people who are comfortable\nIn an open intellectual environment living pretty much anywhere in our own country or indeed in the world that would be you and then there's some way as on the the route to people who are not so immobile whose fault persist as a a small localized not so open\nAnd then they according to David good hot I'm much less interested in the kind of\nIdeals that you've just been painting with me\nI Am happy to live in the world with the thumb whereas I just don't want them shaping the well for the rest of us in a way that makes us it's very difficult for us to do what we want to do so if my my favorite example this is the American example of the Amish in Pennsylvania\nThey called themselves off they don't like to talking to strangers and they don't like money they have like the guy that had like lots of things that I think of as ... as sort of inevitable ... will\nAnd they've made a well to themselves I think they're entitled that I Believe I Believe that that that that freedom in their bones anybody else's freedom\n... but and they don't do any harm to the rest of us they go out into the world campaigning against the other thing just live separately I don't mind that I think if you want to be somewhere like that that's fine\nBut if you want to be the kind of someone who wants to take over the United states or Britain and turn it into a country of some wise or than I Am a on the other side from you I I I'm a live and let live kind of person I understand the attractions of locality I remember the pleasure of\nOf my grandmother thing is really as mentioned after that goes to show it's a it's a lovely place that I can imagine that perfectly decent life\nOr living there are all the time mostly hanging out with people from engine after\nIt's not the life that I've chosen and it's sort of people want to live that life I think that's fine but I don't think they should um ... shape of world in which what I wanted to do is impossible\nYou are driven by deadlines you set yourself up by without long that by your clients\nUntil recently David Mali was the global senior partner leading Alan and every one of the elite magic cycle ...\nSays he'll clients for example says that ties friday night\nYou're about to go out and you got a phone call from a client and they say I Want to do this do you want or close it by some day weekend is going to be trashed you how much they about law on his relentless\nBut you will of the people try to nine farm and some good about it\nIf you do today and you enjoy it that's very stimulating newcomer and there are a large fellow at the end what she's paid by the grants the client um situation\nAnd so you guys are tangible number on the page demonstration in the valley Utah didn't\nAnd then the phone rings you know and that's from some it's like a drug and if you're good at that as a loss as\nClose to four boys that come from a financial but also tend to go in your senses fulfillment\nDavid money sounds like an elite athlete driving himself constantly to achieve his personal best what\nIf you're feeling secure you know sometimes that can mean concise them\nI think his whole market people like this that they are quite worried about becoming complacent because they tend to not be complacent they quickly leaked to selfish which leads to the clients and ultimately them a nation\nWould reframe security is parents she claims to complacency and certainly a relentless drive to excel at least something these farms select for when recruiting\nWhere there is an effort to find people that they've been reasonably restless and not easily satisfied\nUntil recently you've al ... who's a senior partner at McKinsey FM which MBA graduate so one around the world dream of joining he explains that McKinsey looking surgery with personal stories to tell about as coming significant obstacles in their lives\nLearning about that gave us a lot of interesting insights about how much of that came easy natural to them as opposed to how much of that was driven by wanting to stand up and willing to put a lot of work for it was a story that spoke to the fact that you\nWere not overuse person to achieve what you're choosing the place but you were\nDrawn to that and believe in yourself and put the extra work against uncertainty and managed to excel or think was more interesting than someone that was maybe ... story tennis player from age three and was always his number one Opie and yeah you can still do that\nAnd the talks to some discipline some hard work but it would be less inspiring as evidence for Dr and overtreatment\nThis said as I had reached assessing bar I've raised the bar against myself and I continued to invade\nConsultant Jessica comedy if KPMG ... to achieve\nI never ever achieved and felt that I had was satisfied once I had done and I think that there is an element of that and probably and what makes a good employee because we're always always day and all that bad\nI think Michelle out used to be some create the ideal environment for exploiting insecure river Cheever by combining a ton of competition with a lack of transparency\nThe reward at the end of the year ... depends on your evaluation in relation to each other and you don't know what that produce and you just know that they're still ... they're working super hot though is the standard on evaluation college because\nIndividuals' I being pitched into competition with each other\nBecause everyone in the system is touching them sounds incredibly high standards the standards just get higher and higher and higher that's exactly right\nSo this these highly paid an highly successful professionals of victims networking environments and then\nWhen you ask who designs these college or is there is no designer there is no management really an investment banks the top person and an investment bank that's what everyone else is doing and that is being inclined contact and pitching deals\nSo there is no power being exerted from the boss there up process cease being created by the individuals themselves that then tracked the individual\nIf parts of acute narrative the partnership structures and tapes that you're related to that position boggle partners\nGerman human never felt cities despite being a kind of loner an elected by his fellow countenance to become the global CEOs\nI felt I was there for me because I had the good went off my ... as as if I was to lose it mocked position would be undermined\nShortly after being elected Jeremy hosted he's focused upon the conference\nI basically sit on stage I talked to three hundred and fifty dollars and if you'd have awesome afterwards and said what was that life is when he starts how confident he delivered yes [noise] I changed my shot five times that today because between each session I was\nTo be dripping and it's still because the room was halt I cannot tell you how many near offend or otherwise I popped in order to make my act Nazis Richard I'm by the other day I could not\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nEffect professionals mental and physical wellbeing according to our next Michelle for the last four years most young banker can withstand the pressure by develop various ways to maximize that productivity such as limiting their sleep to twenty minutes this time\nIt's a bit like being ... being an ultra marathon runner and continuing to run and continuing to run and never stuffing\nManagement consulting just comedy also paid a passionate price so this intensive Patton working\nOff the second month on a project which was more intense and that ... I didn't come tasted dining out in a way that was detrimental to my house\nIt's not necessarily the loan I always say is that's the problem in the long hours on an unrelenting and sustained basis I have\nMany many months yeah I could not sustain the high quality of what and I need to take a break because I was actually not well say I went to see a psychiatrist stopped watching and I went into the primary hospital\nIt takes extraordinary strengths to reveal touch them or ability but there's just too intensely personal story telling us about the system as a whole professional happens out is just an unfortunate but inevitable casualty of rule David money\nYou didn't eat those policies have deep resilience on the couch with a stressful situation I don't think at least we couldn't figure out a way that you could avoid them without losing we're business it's a ...\nAnd ... and they're all many people aspiring to do the ... what they go to the source of clients that we worked for have the choice of any or in the ... and if you come to divert for them time they wanted to live as\nAn in the manner in which they want you to live as if there are plenty of others who well so you can quickly find yourself from your position at the top if you are too if you are trying to adults we might call them or lifestyle approach to how he practiced a little\nSo Dave is the reason it's such an intense sweat culture is simple the client demands it but Nigel joins sees things very differently like David he was a magic suck a lawyer but you know ... the mental health and science\nWe recognize that to do a good job for you or lawyers have to be well parents that was partly proactive but also increasingly condoms are demanding that just I was in the past several\nDoctors teams and we'd have clients who will interview junior people to find out how well they're being treated to decide whether to retain some X Y on the basis of the office they get the short term the risk for annoyed and say nice or client\nBecause there's something else that might be more important particularly when that something else does not work what it is very high but I genuinely believe that is changing\nI Hope those rights but the performance culture in these in eight times is exceptionally strong just listened to David money for my ... a senior partner that's what Jerry ... chairman of boxers investment bank\nIdentifying anyone who comes into the palm and shit I mean my son can be under any illusions about the challenges that can affect on to the degree of stress that don't have to deal with\nI think perhaps as much though for Social Security retriever would you do what the last of ... will move all\nYou may realize that you yourself an insecurity which even care about someone who have\nI've learned from my own experience the insecurity that drives you may diminish as he succeed but it never goes away important to make peace with it\nRecognize your phone or ability to being manipulated by your organization and by other people unless\nA channel you're insecure she says it works for you [noise] Robison against you\nProfessor at lower and ending her report I could talk with her often and off to why should it matter to the rest of us who don't work ... professional says his company's it's these employees are living exceedingly stressful working line\nI think it doesn't matter I think it upsets me when anybody is living a U.S up to life\nOf a U.S cities deadly drunk speaking epidemic Louisville in Kentucky has twice the national average of I Would think that probably wasn't the bathroom lying face down for being hit hard on what the opioid crisis\nIt is the issue of our times\nPills everyday Americans we look at how the truck high impact criminal\nEveryday American at the BBC\nSupport for Ninety point have the news comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their well being from birth to adulthood including us all important teenage years or Leno health has over twenty pediatric locations ... served central Florida family more information including locations that early and do health dot com slash kids\nRegional editor Mike ... is here in the studio or America's editor count as a as a gallon by telling me about\nTheir own line on march so smart because this is the b._b._c. World Service the world's me do you see him [noise]\nBody point seven W. M. F. E. Orlando [noise]\nIt's ten o'clock at London five in Washington May Day in Nairobi I'm Julian Marsha with well duck tape from the BBC\nComing up on today's program the Saudi got much admits for the first time that your mouth shut Jay was murdered in the Saudi conservationist stumble\nWill really difficult to understand how palm tree projects for the whole\nTruth to have ... ... ... ratio mission fold holds his personal for you called\nIt early in the European Union looked to be on a collision course Ari birds Rogers\nAnd destroyed and prime minister gives to national apology to victims of child sexual abuse women\nAlways leave for many lovers what they're thinking is should pull some Fonda in the past two middle loves\nPasta justice that's coming up after suddenly this world view [noise]\nHello I'm ... with the b._b._c. news agency has shown no signs of backing down from running a budget devastated the breaches European Union rules with a deadline fast approaching\nThe deputy prime minister Luigi de Maya that he was willing to expand upon which include the budget deficit of two point four percent to finance welfare spending the Indian economy ... bc called a constructive dialogue\nSomething new he's just returned general Austin my aim is to lead a constructive dialogue the European Commission doesn't want to crisis between Brussels in Rome the European Commission believes as I Do the Italy's place is it the heart of Europe and the euro zone\nA note outside it we have to do everything possible to respect that I Hope Italy will respect Europe fell short people want to start\nIn Australia hundreds of survivors of institutional sexual abuse of children have had that prime minister got more than than if national apology from one day and others have suffered a royal commission said the abuse cases dated back at least Ninety years I'm Still continue today how aggressive report\nHundreds of abuse survivors are gathered inside parliament to witness the apology others watched him screens outside\nIt's estimated that sixty thousand victims eligible for compensation payments including some who arrived in Australia has charged migrants from Britain but tensions remain over how for natural to address is being managed um the recalls for tougher laws to prosecute those accused of covering up abuse\nThe fall right presidential front runner in Brazil which I Am both an hour and a threatened depends Brazil or what he called corrupt elements of the left wing workers policy if he defeats its candidates than I Do a dad in next Sunday's election\nIt's both an hour that he would sweep what he called the red workers' party criminals from the country BBC Brazil correspondent as his rhetoric is causing deep concern in a country with a recent memory a ministry dictatorship [noise]\nThe Mexican president elect Andres Manuel Lopez Obrador or there's the authorities in southern Mexico to protect the thousands of migrants making their way towards the United states\nThe caravan has reached the city of Tibet you that the state of job as President Trump has had the migrants will be turned away if they reach the U.S for that and he met to report\nThe migrants mainly from eastern Honduras have already trick the length of their own country than Guatemala and across the river other forms of border with Mexico with the intent of continuing north to the usa here Mexicans have come to feed the migrants give them water and close the sleep out in the open\nIt's been a welcome boost for the men women and children who spent more than a week on this arduous journey\nThe sole motive thousand miles from America's southern border and Donald Trump has promised that none of them will get through but many here say they feel they have no choice but to do whatever they can to escape the poverty and security of their lives back home\nBBC News Saudi Arabia says king Solomon and crown prince Mohammed and by the telephone cold or the sun at the Magic Johnson is Jamal could show she to offer that condoning says\nEconomist two days after the sound is reverse that policy of denial to admit that it doesn't show gee was killed inside that confidence in Istanbul three weeks ago\nThe Saudi foreign minister has blamed around operation that those responsible will be held to account\nTwo days after President Trump announced plans to withdraw the United states from the intermediate range nuclear forces treaty his national security adviser John Bolton is in Moscow, Russia expected to be tens and sensitive talks with the Russian foreign minister Sergei Lavrov\nIs ... two day visit but also into discussions with President Putin\nBetween the White House and the crime then have already been soured by allegations of Russian meddling in us presidential election and most goes round and Ukraine and Syria\nChinese state media denounced comments made last week by the U.S secretary of state Mike Pompeo the China was engaged in print a tree economic activity companies Memphis Ronnie has the details\nWhen China comes calling according to the U.S secretary of state Mike Pompeo it's not always to the good of us citizens he made those comments during a trip to Latin America in reference to Chinese investment in the region he also said that when Beijing shows up with deals that seemed too good to be true well that often may be the case\nChinese state media has called the remarks wild disrespectful and not based on truth are fact the U.S and China or in the midst of a protracted trade war with night and aside appearing like it's willing to budge\nIn northern Nigeria twenty four hour caffeine has been extended to cover all of the city and the surrounding areas in an effort to prevent the sectarian violence fifty five people have been killed in clashes which reported he began as a dispute between Christian and Muslim unions BBC News\n[noise]\n\nDwell duct tape from the BBC I'm Judy ... joined the program of beginning reaction from a victim to that apology from their stride and prime minister to survive as a child sexual abuse ... will be paying tribute\nTo the Norwegian well bowl resistance to resist a Norwegian ... to resistance fighter who hold tribute tempered by the nachos to develop nuclear weapons\n[noise] murder they Saudi authorities have fund the admitted that's how dissident join this Jamal ... measures and nearly three weeks softer claiming that he left the Saudi consulate in Istanbul on October the second alive on on harm they repeatedly denied\nMr could charge you can't do any harm before saying most recently he died in a fight\nThe Lakers versions still clashes with Turkish media claims that Mr Kushner OJ was tortured killed them dismembered allegedly on audio and video evidence the Saudis also tend to have no knowledge of way his body\nSupport for Ninety point have neither comes from Orlando Health\nRelated health network a pediatrician that committed the children's health typing health care partners dedicated to their well being from birth to adult had including us all important teenage years later have had over twenty pediatric locations to serve central Florida family more information including locations that are lined up health dot com slash kids\nThe murder of rogue elements ... with comments made by President Trump last week the latest admission was made by the Saudi foreign minister of allows your beer in an interview with Fox News television\nOf tremendous mistake made with them as they have to try to cover up that I think things have happened\nWe had a very clear that we wouldn't even know stone unturned relationship is with us or to just kind of believe that when he was over the hill who was responsible those who were on it [laughter] the procedures for this from happening for whether this\nWas a minister again denied any involvement by crown prince Mohammed bin Salman mind and said condolences had been offered to Mr ... family David has just the editor in chief of the news website to Middle East died he was a friend of your mouth shut gee what does he make the Saudi foreign minister his comments\nThink it will crumble very shortly as all the previous said\nThey had a number of explanations they claimed that he ... the council twenty minutes after writing and that will see the footage of this\nYou know and as far more detail pay a ... a member of the team as you know ... and they went convinced by the light they poop harm\nDrops opposite the camera and I think this claim will also crumbled current quick sneak the Turkish president Erdogan has vowed to say everything that happened I prosecutor general in Istanbul is about to issue is reports\n[noise] I was to make it better Kevin ... director royal museums Greenwich\n\nCome out later in the program in what could become the most important Senate race in upcoming us midterm elections we hear from voters in the Republican held a state of Tennessee\nWith the extreme conservative than extreme levels a moderate is really really nice things have\nAngered but you don't know if you're going to vote for the moderate celebrated I sure right now I'm not you might I might and if that one of the main reasons why yes\n[noise] are reminded of our top stories ... district and prime minister is to live at a national apology to thousands of victims of institutional child sexual abuse and the phone right presidential candidate jai edible so nervous wreck tend to read the country and the\nCriminal elements of the left wing watches workers' party if he's elected will have more on those stories later in this edition of world [noise]\n\nYou're listening to wild updates from the BBC in London I'm Julian marshal the huge migrant come boy traveling through Central America to the United states has set up camp in the Mexican city of ... Chula\nThousands of people mainly from Honduras of being on the move for more than a week in spite of threats from President Trump to or denied them and treat if they do reach the U.S border on North America correspondents or Lee ... Buddhist traveling with the migrants and sent this report from top to choose [noise]\nAppears\nTo be a little that can stop this called Voyager migrants it started in a town in eastern Honduras and people in that thousands strict west across the country\nAnd then across quite a mother to the gate for what Melissa Mexico shut they were stuck on the bridge between the two countries is anyone who thought that'd be the end of the story was wrong\nSome did decide to turn back but most climbed onto operated by enterprise in Guatemala\n\nTo cross the river the forms of water from Ohio who got the author by\nLooking for luck in the usa because in our country we have enough dismantled the as the left he was on the riverbank [noise]\n[laughter]\nWe don't have Trump's been demanding that Mexico stops them like we worked with the ... mile inside Mexico totally have\nWe didn't\nNeed cars and buses weren't on migrants says well started looking many days ago was stop here [noise]\nWe all know hundreds of miles from home or how they left the door if eight days ago they wash all day again today\nOn the night they rest in a sweat and the sound of a [noise]\n\nMexicans came out to give the migrants\nSupport for Ninety point have needed comes from Orlando Health\nLeno health network a pediatrician that committed the children tell by the health care partners dedicated to their wellbeing sometimes do they all had including us all important teenage years later how ... pediatric location to central Florida family more information including locations that Eileen Dole health dot com slash kids\nAnything that will never know I think that's the kind of\nDifficult when you come without family members or friends and sell it had my feet up listed in pain whole body hurt him when I sit ... have to tell myself it keeps going\nOn these big downfall yeah [noise]\nSo what is it that keeps people going many tell us the main driving force his food in their mouth\nAnd throat Trump says with criminals but that's the truth is twenty five year old man let's anyhow and okay like I'm going to want to work for the future of our families who wants to leave the crime in Honduras were risking it pool to do that\nIt's a big sacrifice but we really have no choice and he saw it on some\nWhat is striking looking around the migrant set of golf service well who are now\nSet up camp for the night laying out [noise] blanket [noise]\nPlaying out cardboard boxes or just finding\nA place to rest and this is just how many children have made this fall after having second dangerous journey across the river the ... what mullah Mexico\nWe meet general ed and her young daughter [noise]\nChildren have suffered so much on the trip so ... for them for their sacrifices we are doing this for them and their teacher [noise] the jobs we have an interest are worthless [noise] we kill ourselves working nonstop and Nick nothing [noise]\nMedics in Mexico a tree can what a general that students who became ill and the journey in this town square and many others are getting help from volunteers medical workers to\nThey'll need oldest strengths they can muster if they really are against the old to get to the U.S many hundreds of miles away Donald Trump has promised that who who may ... to everyone here\nAt least ... reporting Italy has less than an hour to satisfy the European Commission that its budget plans for next year our full doubling comply with rules of the years and\nNow the populace far right coalition won elections undid the ship promised to increase spending on welfare and dumped a structure and the retirement age but with no clear idea of how this would be funded a within ... spending rules in the European economic commission was questioned\nThe levels of debt that much funding from these increases professor in around ... his former chief economist at the talent treasury what did he think Italian government was hoping to do with this budget\nMitchell parties where elected in the latest political elections back in March with some uh an feasible promises and now they pretend they want to deliver on the promises they made to to the voters\nAnd as a matter of fact the budget that was presented the recently it's a four to assert the deficit spending a thirty minute there is basically taxing and banks and insurance and on the spending side there\nAny any grazing character Spanish are mainly pension expenditures and also the so called basic ink on so\nAnd you can imagine where they hide that to be a citizen of this is not the kind of a budget that easily needs and or it could actually undermine the long term sustainability and that it's no wonder that\nThe agency has done some actual market or you know concerned about the the opposite\nI think you'll understand that the government is going to make any effort to modify this budget I'm following they the the ... the the European Commission\nOr not immediately I think it will take a wide and I think\nThe the governments were applied to the commission that there's no intention to change it or the numbers and the target for next year that these two point four percent that's sue for next year\nI'm either they will go ahead with the budget and eventually it will be protein in it that's the procedure which implies are preparing a plan correction plan for the following year so\nMy guess is that two thousand Ninety ... gone but then after that that probably will never see that time to return\nTo a balanced budget over there a reasonable period of time that's my guess there is that that's an extra market with with a lot of pressure on equally\nWell ahead of that time and that would probably escalate the crisis\nShould the government is more concerned with the selling its promises to do to send observing you resign spending rules\nExactly exactly that's exactly the point um we changed or something that you know it's a big problem in Europe I think because the the very fact that the governor and he's an incomplete business\nMeans that you're standing around the reading skills but our government running something which is not in line with the European rules and those little you can do about it but to put the country to excess deaths due procedure eventually\nThey should be sanctions but so far sanctions have never been lied and the process because he's a very long run\nIt could be all do you do some the government did need to do something to worry about the whole the economy and spending more for instance some infrastructure has the potential did it not to boost the economy\n[noise] yeah my point is that they really need to really an over all as you said about that on the supply side not on the demand equally does not need the support to the man I'm not I mean eight major reforms structural reforms to a better prepared the supply side to cope with the\nChallenges of the global economy if that imply some uh\nInvestment infrastructure spending that's fine that's perfectly fine but the government needs to find a way to finance those initiative saying in the proper way\n\nThey'll come of elections has often said to produce a change in the political landscape ... threatening something much more dramatic\nHe's the right wing presidential candidates in Brazil's upcoming elections when he says that if he wins he'll claims the country of what he called the criminal elements of the left wing workers' party of his opponent for the men do out that\nYou're wrong to\nMe that Lula da Silva if you're expecting Mr ... can be presents\nTo give you a presidential pardon I'm going to tell you something you're going to breathe and not that he's going to be there soon [noise] not as easy to but just a few years by your side and sees you love each other so much you both real reason\nBecause the place for criminals who steal from people used to be on Mars\nYou want to do with your love of ball goes through\n[noise] we're doing now is a ... who spent years working during the summers and then as now senior lecturer in sociology and media at City University in London what are we to my girls these comments election rhetoric to fire up Mr most Americans support has\nNow this is much serious than that I'm there has been an attempt of\nTrying to naturalized hits fascism oil as being a candidate within that\nDemocracy and being a right wing candidate which both ... clearly\nIt's not an extreme right wing candidate and at the moment he is and go ... also in accusations of a legal campaigning practice of using what suck to spread fake and you end up as they didn't election\nSo the problem here it's not just in relation to the Workers Party but also how other up and down from ... of the center right\nFrom the ... have been at a disadvantage because of the legal campaigning practices that today upcoming across and with documents to prove them\nThe electoral justice has just accept it\nA request from ... to\nInvestigate both NATO and these accusations which could lead him to be um a tent unelectable and he could be electable for eight years so what we have is a very complex and audio and his rhetoric is showing took it's proving\nI'm correct what many Democrats already worried about that it's beyond simply a right wing rhetoric\nSo you think he is absolutely ... road that or if he is elected president he will in some way or another attempt to make the workers policy and legal organization\nWell it's just this is what I'm trying to explain it's not just about a a knowing that left this goes much deeper than that his rhetorical is against minorities um\nThere's been a spike in hate crimes against gays against blacks and also um there's been recently a big campaign from women\nWho have a kid that we don't want to uh uh both on our end the presidency so it's it's very complex to a naturalized came and assume that have simply assuming a right wing stumps because what we have at the moment is a possibility that this election could be a note and another one could be um a cold\nAnd see the Senate dot which ... what would be the ones that would be um uh in in in a second route so this is much more serious and which goes very much beyond simply keeping Lula in jail or not\nSo why is it to to despite these kinds of comments these kinds of views giant ... continues to need in the opinion polls\nYet this is a very good question and this is exactly what people are finding out is that he has had\nUm a an extreme support from the ... shop and\nAll the illegal practices of his campaign particularly praying at the front ability of many Brazilians because what we have is four years of economic recession to a certain extent we can blame that on the previous government of film or as well but it has also been intensified by the actions of time in the last two years\nSo you have is a very disillusioned electorate\nWho is find a boat to being manipulated and who is fearful of violence and who is at at thinking perhaps that heart government is the solution\nI ... a dumb Monday which the military might play a more prominent role\nRight exactly and this has been a mutt basically this is related to and they'll tell she ah around the years of the dictatorship as if it was not that hard\nI think there is Tariq is not really serious and actually was a period of no corruption economic merit cold and person extend Brazil has not\nOvercome this toss and has not really assess the dictatorship period on his crimes so there is a lot to manipulation going on and disillusioned with and the sense of a hard precedent is the one who would put things in order right so this is how he has managed to acquire a wide support\n... thank you I was kind of run amok coach who spent ten years working as their job is to Brazil and is now see me Electra and sociology major City University in London\nThe British prime minister Theresa May is expected to told parliament in London today the negotiations on the you can just withdrew from the European Union a mighty five percent complete\nWith her upbeat assessment is in sharp contrast to arrange standing as leader of the governing conservative party with a number of Sunday newspapers reporting the rebellious impede so once again plus seem to get rid of ... with the students the BBC's wrong some\nLet's start with some ... to use them as expected to talk about a month later today\nSupport for any point in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nIs complete or do you use the figure about Ninety five percent of sports heroes and another ... the problem she faces the I'm just not show that many people in their own policy particularly believer\nThat Ninety five percent what does it include\nSo it includes how much money the Europe the cable settle with the European Union often leaves thoughts about thirty nine billion pounds or ... billion dollars\nAnd it concerns or what will happen to them three million also EU nationals living in this country but what it leaves on Saddam is what is going to happen so Northern Ireland and people tend to focus on all the modern but actually the problem with all the modern focuses on\nThe big problem somewhat say the contradiction at the hospital ... or they're not as if you think about it ... as the slogan we want to leave we want to take back control of our borders are laws on Monday but still have free trade with the European Union despite sharing regulations and not having a border in Northern Ireland so\nYes the problem is specifically about love and all that but I actually that the real paradox real problems are going to be about the whole of the case future relationship with the European Union and a lot of employees note uh\n[noise] and it's Theresa May's hum proposed a way of of of dealing with that a Republic of Ireland Northern Ireland border that has created such a rump is within Iran policy\nIt is without getting into too much detail you essentially have the conservative policy I I mean I think it's not an exaggeration to say it is a war with itself I'm In a coma brink of imploding and it's essentially because those are very infused you asked about Brecht said or what the the three of them a solution of a solution she comes up with will leave\nBritain fall too close to the European Union economically diplomatically and every single way\nWhereas the other half of a policy thing the however she saw this out it just looks like a total disaster in the making an economics is often I looked at the magic disaster so she's managed in a way to do what many people might have thought it was impossible which was to unite remain as I leave us in thinking that she's play\nA pool higher and extremely badly\nOkay so let's turn now to a leadership ... as I mentioned the Sunday newspapers or for the reports of a rebellion um I remember reading something of an MP actually tend to bring you knew or to a meeting of some ... where do we stand\nOff I told you that the conservative policy has divided well I guess it didn't say it was just how poisonous says I'm going to have to have a conservative MP suggested she bring a news\nIt's also been said that she's going to have a wall knife put into her from I mean that is the state of the more conservative policy it I mean there is a war over ... leadership his the things you and\nThe reason why she's that today I'm was she was last week and then we performed a month before about\nThe spies well this criticism as her critics can't agree on who should stand in a place where an alternative Brexit plan might be on the other thing is of course they will go to our eyes on the clock Britain is supposed to be leaving the European Union not much I mean the idea of having a a a leadership cold so I called such that will take weeks maybe months\nIt's not exactly great timing ... says I mean may be a challenge ... who knows I mean certainly\nThe popularity of this contends about leadership and and the conservative policy is going on\n[noise] rope and he thinks back to the group sees a rough ... speaking ahead of a segment of the British prime minister Theresa May is expected to give to a parliament in London later today saying that the guys Haitians on new case we drove from the European Union Paul Ninety five percent complete [noise]\n[laughter]\n\nJoin here and now to more often than not one on ... [noise]\nI'm making ... coming up with an excellent point the department of homeland security says hacking attempts or from the head of the mid term source taste ready to protect the vote against foreign interference some experts warn the election system is more vulnerable than ever that are coming up with an excellent point from NPR's [noise]\nDenied at age ... on ... point seven use support for Ninety points that news comes from Westminster towers as senior living community in downtown Orlando offering maintenance free living with services including dining housekeeping twenty four hour security and transportation\nThe community offers active living as well as assisted living in skilled nursing care available when needed more at Westminster towers Estelle that'll work\nThis is not even seven W and that the it's three o'clock\nIn the news from the BBC well set it on or they can be today it's any said they came to the London times even if that makes it by the European Commission that he's already twice a year as a minute and it wants to increase it\nCould only stock and now the global financial crisis the Italian prime minister today needs to come they say is\nThat is no shame\nSupport for Ninety point of a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nAnd they want is the Turkish government hoping to get from Saudi Arabia justice for cash\nAnd I'm James ... Wisconsin two weeks before us midterm election is Donald Trump still a political science in a state that moved now really but significantly in his favor in the twenty six the election coming out often any [noise]\n[noise] hello this is the b._b._c. news is you know McDonalds\nPresident Putin's spokesman Dmitry ... by the United states to pull out of a ... year old treaty on intermediate range missiles is deeply concerning Mr pass golf said that there's this winter hand Russia would have to act to restore the new ...\nThe U.S national security adviser John Bolton is visiting Moscow from where it rains for report\nJohn Bolton visit to Moscow was expected to focus on Syria now the U.S national security advisor is having to explain to you to in America's nuclear weapons policy on the risks every ten to the arms race that's what officials in Moscow this morning church today Clements that's meant to me to pass Gulf\nDenied that Russia had violated the treaty as President Trump claims it's a packed off that Russia was couldn't stand by the U.S announcements\nAnd want to ... the historic deal with making the world a more dangerous place he went on that the U.S would develop the bombs weapons once again forcing Russia as he puts it to follow suit\nThere's been heavy fighting in a disputed Somali Region which has left more than forty people change\nFighting in the area first erupted in two thousand and four and the leaders clashes come just after a peace deal in the region which is claimed by both the self declared Republic of Somaliland and Puntland tournaments region of Somalia who wrote supports\nThe governor of the solar region of the receipt Hussein says the fighting started shortly off the door and the last ... day has the two rival ... each other using heavy weapons mounted on the backs of vehicles\nExcuses for the people were killed and more than a T ... injured leaving health facilities overwhelmed\nLengthy peace talks between the rival factions of the do the hunting ground ended with a cease fire just ten days ago the mediator of those talks has appealed for both sides to agree to a new cease fire to end the fighting which has got hundreds of no matter how does on the life stalk\nTurkey says it will do everything it can to shed light on the merger of the Saudi journalist Jamal ... G A spokesman for president ... said nothing would remain in the dark regarding the investigation into the killing in the Saudi consulates in Istanbul\nTurkey should officials earlier just Mr Saturday assertion that Mr ... G died during a fistfight\nOr my challenge is a spokesman for the governing party\nDoes some that are a little bit on the which one of the luggage and have shorter\nSituation in which a murder was brutally down\nAnd a lot of us are there has been married to cover it up when we look at this from this point of view it's a very complex search for us it's a ... to reveal the truth the truth will come out of presidents that he is personally following the situation\nThat we're the spokesman for the Turkish government ... you're listening to the ... world news from the BBC\nOur our Michel Martin Kelly McEvers Ari Shapiro your voice when he was under the law for many Chinese all day\nAnd my name is David Draine co host of MORNING EDITION you know there's something you hear when you turn on public radio is the sound of voices across the world the sound of information the sound of a nation listening together why do you listen\nI literally listen to anything or not in the eye when I'm Talking to friends and family the fray and I've been listening to NPR yesterday and it's something that I just find myself repeating over and over and over again I find that diversity different groups of people are listening to NPR they're getting real new real information on NPR\nReal new and real information or great Lewis and they're also great reasons to call or go online and gifts and when you do you make of venting stories and voices from around the country possible and best of all you make your own voice for so called go online and make a contribution to the station today\nAnd thank you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. E. during this silent Dr make financial contribution on line at W. M. F. U. dot org or you can call one eight hundred Seventy five twenty twenty in fact your\nSupport for Ninety point seven news comes on the lake whales museum presenting the forty third annual ... festival this Saturday and Sunday October twenty seventh and twenty eight on the shores of lake whales disadvantaged open to the public and celebrates the communities history with heritage arts historic tours and other family friendly events more a city of like whales dot com\nDon't miss the next point seven W. M. F. E. speaker series on Monday October twenty ninth Dr Helen ... turned forty I Am Dr hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information into ... to this free event\nGo to W. M. F. E. dot org slash events\n\nHello and welcome to the news on live from the BBC well service in London\nOn where they can catch the in a moment is a new economic crisis breathing and could it stops initially reading is claiming up to the European Commission in Brussels is the latest budget will assess the potential damage later in the program we'll have the latest details on the ... murder case\nAnd orange James ... is in Wisconsin two weeks out from the mid ... he\nMade me think of 'em are affected by but not against President Trump's trade policy\nWhere they can renovate right now but it needs to be darn we need to\nBe on a level playing field though I think in the laws were all going to be better off so much\nMore on that to come but let's begin in Italy and the potential showdown with the European Commission today it's any published it's proposed national budget uh say routine occurrence\nBut as the the biggest economy in the euro zone which is already in considerable debt it's important to take it a late as the populace collision government wants to be public spending which could punch escalate into yet more debt\nYou know as I Move mean Brussels could reject the budget and the ... the European Commission in ... to spend on she's saying oh this at a time that economists are warning that an economic crisis in a city could seriously damage the economic health of the whole of Europe and perhaps beyond\nSpeaking to the press today the Italian prime minister ... said it's any needed to make the deficit in order to stimulate the economy that he said there was no chance it's any would leave the EU all the European single currency the euro\nAnd leave [noise] forty ... shame no way to get to the lakes there is no way to get out of your of of\nSupport for Ninety points at a news comes from Orlando Health Orlando Health Arnold Palmer hospital for children have been caring for the children and teenagers at Central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com\nState and they told me that kind of mean let me the rest of the world yeah called cook a gun is a senior fellow at the Peterson Institute for international economics think tank in Washington DC\nYou have a country in its elite which has a very large existing debt and doesn't because of structural features like an aging population et cetera have prospects for growing very fast in the future\nAnd a country like that or if it's suddenly stunts running significantly larger deficits than had previously been agreed\n\nOn the next fresh air Melissa McCarthy quite by accident\nFind myself in a rather [noise]\nMcCarthy stars in the new film can you ever forgive me as a biographer turned literary for germ we'll talk about the film growing up on a farm for early comedy act hurling bridesmaids and playing Sean Spicer on Saturday Night live joined us [noise]\n\nJoined Terry Gross for another edition of fresh air tune in tonight beginning at seven right\nHere on Nike point seven\nI'm Brendan Byrne from the Ninety eight point seven news team\nBecause of support from listeners just like you were able to report on the issue is happening in your backyard\nBut your contribution also helps us explore not only our community but our world in our universe so let's keep exploring give a gift to W. M. F. U. dot org recall one eight hundred Seventy five twenty twenty twenty minutes off the three and this was not he points to\nThis is your bank it can be with me that I live from the BBC\nAnd migrants convoy of thousands of people including children mainly from ... continues to travel up three Central America heading towards the Mexican border\nToday in a tweet President Trump threatened to cut aid to countries that failed to stop and reaching the U.S southern border you'll say claimed that criminals and I'm known Middle Eastern his his lead all mixed up with the ...\nOver the weekend the cans I'm set up camp in the Mexican city of ... on North America correspondent and Lima peru is traveling with those ... and he sent this report [noise]\nAppears\nTo be a little to install this convoy of migrants it started in a town in eastern Honduras and people in the thousands strict west across the country and then across quite a mother to\nThe gate from Melissa Mexico ... they were stuck on the bridge between the two countries because anyone who thought that'd be the end of the story was wrong\nSome did decide to turn back what most Columbus to operate to white enterprise in Guatemala\n\nTo cross the river to form supporter from Ohio who got us where the older\nWe're looking for look in the usa because in our country we have enough dismantled the west to resolve the riverbank\n[laughter]\nWe Donald Trump's been demanding that Mexico stops the migrants we worked with the miles and so I'd Mexican totally on hand\nYou don't need cars and buses were migrants as we can smile started looking many days ago was stop here [noise]\nWe all know hundreds of miles from the left door is eight days ago they mosh school they again today\nOn the night they rest in a square and the sound of a [noise]\n\nMexicans came out to give the migrants food and water and how about clear the journey starts in its toll on many like kind of things in the late forties and traveling alone\nBut she said that if it was that one no one another and I think that that's I mean it's\nDifficult when you come without family members or friends I'm so tired my feeder blistered and paint my whole body hurt when I sit ... acid tell myself to keep going\nAll yes yeah that\nSo what is it that keeps people going many tell us the main driving force to condemn our\nWay through but\nTrump says with criminals but that's the truth is twenty five year old and there was any I went okay like\nSupport for Ninety point have a new one comes from Orlando Health\nOr Leno health network a pediatricians are committed to children tell by the health care partners dedicated to their wellbeing from birth to adulthood including us all important teenage years or Leno health has over twenty pediatric location to serve central Florida family more information including locations that early in the health dot com slash kids\nWhat is striking look around the margins sort of go to this world who are now\nThat the outcome for the layout blanket [noise]\nOut cardboard boxes or just finding\nA place to rush in the square\nIs just how many children have made this fall sick of angels journey across the river the borders Marla Mexico\nRemains journalists and her young daughter our\nChildren have suffered so much on the trip so God overboard them for their sacrifices we are doing this all for them and their future the jobs we have an interest are worthless [noise] we kill ourselves working nonstop and make nothing [noise]\nMedics in Mexico a tree what journalists do to to became still on the journey this town square many of us are getting help from volunteers medical workers to\nFill need full destroying so he can muster if they really are against fields to get to the U.S many hundreds of miles away donate Trump has promised that he will remain firmly shut to everyone here [noise]\nAnd lean the bull with that report from Mexican so let's pick up on that point to President Trump's threat to cut aid to Central American countries that fail to stop migrants ...\nAdministration has already reduced funding to those countries louder protests in with the inter American dial great for the think tank she explained the current situation some\nTwenty Seventeen to twenty Eighteen the funding has already been caught substantially for example in this specific case of an door as it dropped from Ninety five to sixty seven million [noise] the other thing is that there's funding is usually focused\nOn attacking them why do we know are the root causes of this big migration pushes a basically in violence and lack of economic opportunities\nHalf of this report urges cooperation from the U.S usually those stores security initiative on the other half towards a various economic development and social development project so it is kind of counterintuitive\nTo try to caught you know the farms that actually focused on what is the root causes of this\nSo you know saying that if the government's receive age in the United states more reason for people to prosper and their own country\nThat is actually what has been happening the cooperation from the United states to this country's have more and more fuckers precisely in this type of initiatives to try to strengthen the countries\nAh it's not like now it's going to happen like and and some of this project's actually show advancement in this topics specifically so yes these are the things that we know that have worked and they start are I mean there is a long process\nBut that are starting to work and caught in it does not help but\nTo President Trump's supporters would say that that aid has been wasted because it hasn't got rid of the problem corruption still rice across ... countries\nThe power of the criminal gangs is gripping city centers and hands around at the whole region and this aid issue as opposed to them as pets the more you give them all the countries need where does it end\nFirst of all I think that the problem is that you pretend to try to solve a problem that is very long time and a very short time it's very complicated we're talking about countries that years ago were at war that democracies are starting even view and\nI'm not saying that I agree with it but there's a lot of people that actually could responsibility of the current situation on us and us intervention do end as wars and afterward I Do believe that this project how old do this is a slow process but this is the one that works if you say well we're we're not close the border are we going to stop ate\nWhat is that going to do is that going to help you know what's going to have less Kate\nHow able all the old so it's easy in these various countries to stop this caravan of migrants passing through that countries\nThat problem is what's gonna be the solution of what you can do about it if you're gonna you know accept than as refugees and try to establish camps then\nI got to have support in order to do it because without support it is very limited what the government can do and what shape that takes is definitely going to be very political and that is the other thing right the rhetoric and the election being so close also make this a little bit more complicated there's not a problem up to date\nThis guy is not the first cabin but definitely put in pension and more pressure because of its disability\nWhat other options on ... to the United states to try to stop so many illegal migrants coming through\nI think a lot has to do with the condition in the countries and promoting migration that is documented and that is legal the other thing is that we do see lower numbers of integration in there are more\nImmigrants crossing and everything but it's in much lower numbers that it was five years ago and it specifically for Mexico you see that a lot that for me what needs to be done his support this concrete and the other thing that needs to be done is promoting migration that it's orderly that document that that is that it that is checked because the other part of the migration and\nWe'll factors that the U.S unemployment is underway has been in decades and there is any mind for this labor\nYes yup he's probably got more my sport and all the new ...\n... well just what John John said Hi nice to see you get you going to vote in the mid term elections ... yes I Am but you know how you're going to vote\nI have to stay and probably a little more Republican than I Would normally\nBe so you're you're confident that he can come to an agreement with China than it's all going to work out for the best\nYeah you just got to tighten your belt and just hang on for the pretty much what it is going on for the right people\nThe things we asked for to level the playing field but postcards and dairy farmers went in there that was good news at a time when our dairy farmers the good news in\nWisconsin Republican Governor Scott ruled\nReduction rice thing on a trade\nWar the hunting some farmers but on a trade deal that should help others and the ... campaign to defend in Milwaukee suburb we talk about the Trump administration's recent trade agreement the UN and CIA\nWhich is given Wisconsin's dairy farmers accent to the previous the cleanliness Canadian market he told me that my Donald Trump's campaign Romney later this week will be in a traditional swing district of Wisconsin but in a rural part of the states when the president is popular\nAre the reason why we asked them to come to also I was I Want her to the heart of the states were dairy farmers protect appreciate what he did what the deal with Canada and\nCannot do you want things took place do you think you're telling this story you'll economic stories are good news story why things are still so close\nTo better stay in many ways it's kind of white ... oh you got urban areas you got rural areas\nSuburban areas and the other challenge we have historical or you look when a when Bill Clinton was President George W. Bush was president when rock along with Donald Trump is president\nAnytime or the party in the White House is up in the mid term it's always a challenge all across the nation particularly or in the seventies [noise]\nYou're right you're hungry I am going to eat what\nDoes the president to in on palatable to many voters make it harder than usual for the Republicans roadside fast food restaurant we meet and other senior Wisconsin Republican speaking of the state assembly Ruben loss\nAnd I order a butterfly was\nDoing his part for the Wisconsin dairy farmer with his choice of food he's also rushing between campaign to advance the state assembly as well as the U.S Congress is not for election next month both currently in Republican hands and\nLike governor who can speak law says that means the headwinds are against his policy that he sees the president not as an asset but it's a liability\nIn Wisconsin we have our largest majority in the legislature since Nineteen fifty seven or we have the highest number of legislature is controlled by the Republican Party Nineteen twenties so we are really at the high water mark in an awful lot of ways so of course when you have a president who is controversial\nWho is opinionated and people are fascinated about him is going to probably result in some give back all our high watermark it's really because of the person in many ways that people identify with the Republican Party\nI'm fascinated by your arms I thought I was gonna have to drag the view that President Trump could be a big problem for the policy but your friends about it yeah it's very it's it's the truth\n[noise] [laughter]\nThe night called the big\nGovernance debates and none of the big Senate debate here in\nWisconsin times uh there's a big crowd out [noise]\nBut I don't care for the politics of fat I'm at the Milwaukee Brewers stadium because it's a big night for baseball fired from a guy in the world series playoff the Milwaukee Brewers against the Dodgers and difficult tailgate parties you get ... guys here in America about people\nHaving barbecues drinking the local militias fair I'm that well some of the same\nAlso a bit about [noise]\nKids like catching the compound where the title gates is taking place next to families who are flipping burgers and in some cases slipping that political legion so many of these\nRuins fans of from the affluent suburbs is little Wilkie which in a free Donald Trump age would reliably Republican but not anymore\nI'm a Republican but I didn't vote for Trump and I don't like him but I think his [noise]\nHis behavior and some of the antics on foreign policy is a shame you know and I think people who are maybe more on the fence it doesn't go on and so a lot of Republicans feel that way\nThey're looking at the president and what he does and that will affect the voting for governor for Senate races\nAnd there's a lot of independence I think that's going to have a big effect on the election\nAnd is your sense than the very faithful\nCaught a lot of them will vote again so we'll we'll not want to vote Republican because of the president I think so\nHow do you starve yourself are you an independent vote you\nYou're brought with five Republican and what about the guy that's running the country the ... how do you feel about it you know I'll tell you exactly how I feel that him I owe him the trading stopped his back stabbing that we should stop that\nThen\nI think Trump is a double edged sword\nAt a nearby venue with just through his game on TV we meet new movies veteran conservative commentator and Trump counties [noise]\nHe's currently crunching the stops trying to work out when the the policy will hit home runs in these midterm elections his conclusion in a polarized age it's not the less committed arm changed opposes the Tea Party diehard fans who are the key to success\nTrump will help turn out the Republican base but he also brings all of his negatives all this baggage and he will mobilize the Democratic base as well in an off year election Republicans tend to be more motivated they have higher turnout and they've done very very well\nI think this year is going to catch the proposition whether Democrats can expand the electorate if they can turn out in general election numbers I think might have very different result here [noise]\n\nTo Democratic Party get out in the dumps event told new rookies Martin Luther king drive a birthday cake is Bruce ... for a visit to\nOf the party's rising national stuff the African American senator from California\nFor her I said I cannot see the question of why can a senator from California helped candidate for what comes to win a congressional right\nWell in\nHi I'm off on taking all of our president and general manager of maybe point seven W. M. F. it's been a for two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDoes your support all uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nOn what Americans think about the man who leaves that country and perhaps about those who might lead it in the future freebie Kamala\nTrying trying to find out what I Am [laughter] [noise]\nElections that are getting all their friends\nComedy in question is how many Goldwyn Wisconsin democratic senator\nFor reelection I'm going to come over the election\nMyself for years ago a lot of people say the ... and I got to the Democratic party supporters what are you going to do to convince some I mean\nThere's all kinds of issues that we took it very hard look at the legislature making it may get hurt people about\nThat is really reaching out to vote or that they gave us some even not have come out I think it matters so much to show outside a lot to cut out for the state of Wisconsin we shall see thank\nYou All right [noise] well\nThat that is you can't really allowed to vote out\nFrom the California Senate ... message for her fellow African Americans in the room mountains of black people in this city voted for Barack Obama but not for Hillary Clinton once again that votes could make all the different uh Seventy three year old democratic activist donor is all too aware\nThat a lot different than what are you out convincing where I Am and making phone calls at all I can do [noise] what did you think of Kamala Harris ... message today\nMotivated me I feel like it's not a bad thought out but I Will be calling them about three can America will be coming up when you are not\nAfrican American women also what do you do bring my wife is important but I don't buy and get them and grab a bite I've had to take care of their voting that\nYou're going to be on your wheelchair grabbing hands right that's right [noise]\nDetermine democratic dawn ... local baseball team debris was actually lost out to the Dodgers and yet but the Democrats have more big hit this coming into town including the record bomber on friday\nNight though is not on the ballot in several none of us Democrats have expressed that concern to me that for all the generic confused as a candidate for governor\nIsn't the most inspiring on the Republican side Governor Scott Walker's embrace some of Donald Trump's policies but it's a part of the U.S Senate candidate who's running all Trump in campaign if she wins it could be assigned President Trump can remain competitive here in twenty twenty you're listening to you", "year": "2018", "show_name": "BBC World Service", "city": "Orlando", "day": "22"}