{"month": "10", "state": "FL", "station": "WMFE", "content": "Hi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now have you been in the family\nDoes your support for uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\n... well\n\nI'm Joshua Johnson the host of one a become a sustaining member of W. M. F.\nE. during our silent to drive your generous supportive a dollar a day and make sure the reliable need to know information on Ninety point seven W. M. F. E. stays right where you want it so please call eight hundred seven eight five twenty twenty or visit W. M. F. E. dot org\nCheck out our website is W. him after he died or for the most recent are we there yet podcast access local and NPR News content as well as our community calendar bookmark W. M. F. U. dot org and stay connected sponsored by violence calmer graduate school of business and Orlando Health\nNutty point seven W. N. F. E. FM Orlando\nOff of the news on the b._b._c. World Service it's hard to talk with me Stephen ... Afghans will have to wait till next month to get the results of last Sunday's parliamentary election\nBut in one sense the verdict is already in the ballot again exposed widespread insecurity and the actions of government control\nIn many parts of the country my guest today is president Ashraf Ghani has recently appointed and strikingly young national security advisor how ... will he\nThis is our country if it does not winnable we have no other option we are in this country and we have to live our lives and protect ourselves while I'm I Do not want to comment on a on colleagues from previous government\nUm they have their own opinion what I can say to you or is this is a changed country as a result of your investment\nThat's how we do a lot more ... on Hong talk often the news\nI'm ... Macintosh with the b._b._c. news hello President Trump has condemned the shooting dead of eleven members of a synagogue in Pittsburgh has an evil act of mass murder the Jewish civil rights groups that are believed this was the deadliest attack on Jews in us history\nA man identified as Robert bows open fire as a Saturday morning service was getting under way he was detained after exchanging fire with police officers here's Gary of DOMA hue\nThe FBI says robot bows be prosecuted for hate crimes and the justice will be swift and severe\n... old Jews must die as he opened fire in the tree of life synagogue and it's become clear that he was a prolific ... an online anti Semitic hatred and conspiracy theories even posting the phrase I'm going in\nJust an hour before the shooting took place\nPresident Trump is called the killings evil and says he'll traveled to Pittsburgh shall fleet or flags at the White House the other federal buildings will be a half months for the next four days\nA vigil for the victims of the shooting has been held in Pittsburgh several hundred people gathered to read Jewish president light candles one young girls said she felt differently now as a Jew realizing that anti Semitism has not been relegated to the history books\nThe White House is find us ... miles in memory of those killed Mr Trump said the killings must have been prevented if that had been an armed guard in the building\nIn Britain the helicopter belonging to the tide billionaire businessman we'd shy see what's an apropos is trashed and burst into flames that left the city football club witnesses say it spiraled out of control after taking off from inside the stadium following a match between Lester until last time\nWe'd shy who'd been watching the team he boating twenty ten usually leaves the stadium but headache up to a source close to his family has told the BBC that he was on board the aircraft when it crashed the club one the English Premier League titles two years ago Victoria Hicks is the ...\nIf you'd have ... time to play it safe to try to stay and fight for them to stay away from his major incidents that\nThey ... uh well less ... less than say has poured millions into the class and test taking it to pay me ... they have one son tells me tonight they've made a clean kind of trade\nThe meeting at the Vatican Roman Catholic bishops have recommended that women should play a greater role in the church\nThe Muslims and it was cold to examine how the church could relate better to young people that conservatives and progressive from different confidence often fail to see eye to eye the final document was vague on the churches after two to homosexuals\nAnd attendance doing to the acronym elegy be tea in the text Web blow up\nThis is the world news from the BBC\nBrazilians vote today in the second round of presidential elections they have a choice between the far left candidate gigantic bow and arrow and the left is Fernando ... died of the Workers Party polls have been narrowing but Mr Bo scenario is still expected to win Kansas pit reports\nHow to right wing candidate without the backing of an established party gets since ... shy as both a novice exceeded by writing the wave of public anger at the country's corrupt political establishment\nHe channeled the disillusioned south by sent many with the last week like his posse run Brazil for fourteen years promising to help the pool who were found to be stealing from the public pass\nMystical narrow his whole St promise to fight to find that crime winning as many women and minorities who are its biggest victims and who are now prepared to give his history of abrasive chauvinist and racist comments\nMotives in the republic of Ireland of overwhelmingly backed moved to remove a prohibition on blasphemy from the country's constitution\nNearly sixty five percent voted yes in a referendum held on friday alongside presidential elections the constitution currently holds the blasphemy is a criminal offense voters also reelected islands incumbent president Michel de Higgins\nPolls that show in the first round of Georgia's lost direct presidential election there at twenty five candidates from relatives include two former foreign minister is selling ... I'd be really who is backed by the governing party and the ... who's running on behalf of a new coalition of eleven parties\nThe African American poaching playwright ... has died in Maryland at the age of Seventy she was best known for a Broadway hit from the Nineteen seventies entitled for colored girls who have considered suicide when the rainbow\nIs enough and that is the latest BBC News\nTo hard to overcome the b._b._c. World Service for ... factor Afghanistan\nJust held its a parliamentary election since the Taliban regime was toppled in two thousand and one of the poll expires oil they recovering problems of insecurity in the dorm the country in the years since\nDozens of security personnel were killed hundreds were wounded and in some areas voting simply didn't happen as the Taliban attempt to scab Afrikaans away from polling station\nHi I'm off on taking all of our president and general manager of Ninety points grabbing W. M. S. it's been a fool two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nOf progress on the road to stability but we all the rhetoric want as reality look like the Taliban operates with impunity and swaying ... the national security forces are short on numbers and morale corruption as well as the insurgency undermined the authority of the state\nWell my guest is president ... recently appointed national security advisor I'm do a lot more easy formally Afghanistan's ambassador in the U.S a technocrat with little previous security experience these the Afghan government really in a position to shape the future of the country\nWell hum dilemma he joins me now on the line from Kabul welcome to talk to Steven good to be here\nWe speak of course after the parliamentary elections would you a sense that the\nWay those elections works out with so many Afghans\nAre facing the possibility of going to the polls because of insecurity and the lack of government control of key parts of your territory like Bruce Lee exposed everything that is currently wrong with Afghanistan and its politics\nThere were multiple threats by the Taliban are and there is precedents of attacks on polling stations the African people defied all of that and came out to vote I think that speaks for itself on what the AFC on people's verdict on democracy is and what it is that they want in their life\nThis was the first election that was completely organized by the Afghan government and security provided by the Andy is F\nA I think they did a tremendous need a good job compared to what we had in the past\nUm even from the number of attacks that that ... that were um launched on on the election day in two thousand fourteen when we had foreign security assistance and the elections or had a lot of support from the international community ah we're much larger scale than we had this year\nVery interesting point about the bravery of some of your security force personnel let me tell you what one of them said the Reuters news agency after that terrible a ... ... blood shed a loss of life and times and he went and Taliban forces assaulted the city or more than a hundred\nA mostly police Afghan police were killed in in that are sold\nOne of the policeman who survived afterwards said look we fight for our country but we do not get the benefits and respect that I gave them even to Afghan soldiers we suffered so many casualties so many policemen were killed but the government paid no attention to us he said we haven't even been paid yet what\nDoes that say about your own government as a national security adviser that is exactly what is on my mandate to change I I Do realize that we have a lot of challenges because I knew was one of the reasons I accepted into this job it hurt\nMe personally as an Afghan to know that we failed our security forces from a policy standpoint and I'm dedicated me and the national Security Council will be working to resolve all of those issues\nI issued a statement to our people our security forces that what I Would be doing is to reflect their voices in our policies it's true we haven't been able to deliver the kind of services that our soldiers in on the front line deserve they have not failed us\nBut I Want to make sure that we also do not failed and when it comes to policies and other genes that that protect their lives and their families\nYou know what I'm mindful law mindful of something that Hamid Karzai's former president said as he was leaving office it was something that deeply upset many people are in the west in NATO particularly family members of those who lost their lives because he said this he said the name so exercise all of its operations in Afghanistan\nHave been ones that have caused Afghanistan a lot of suffering and loss of life\nAnd no games because our country is not secure he says that of NATO's operations and of course the operations costs more than two thousand American lives more than four hundred and forty British lives one could almost say\nThe same thing today to Afghan veterans the families of those who lost their lives in uniform serving the Afghan government all of this loss of life either from NATO forces off from your own Afghan forces unfold Walt because this is all you can't win\nAgain um something that you have the luxury to say as Afghans we don't this is our country if it does not winnable we have no other option we are in this country and we have to live our lives and protect ourselves while I'm I Do not want to comment\nHi I'm off on taking all of our president and general manager of Ninety points grabbing W. M. S. it's been a fool two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty your\nInvestment in those are fewer and fewer than one of the reason I came on this show is to tell you and and your viewers that this is not the Afghanistan that you only see t._v. there is so much more to that context I understand that there is only so much news\nA space for them on a sunny and it's usually covered by the spectacular events which are unfortunate\nBut this is a transform country whether you look at it\nPhysically or you look at it socially I'm a generation Seventy five percent of this country ah grew up in the war\nOur aspirations are to end this conflict and bring peace to understand where extremely proud of our country and what we have but we also realize that the challenges that we ... we face are also hours we're thankful that we get support from our allies\nOr to help us along the way they know that your investment in this country has not gone to waste yes we are at war it's not an eighth it's not a war that we have brought upon ourselves\nIt's a war that we must end\nA and it takes a it it it takes more now than just a statements to be able to uh to end it there are we are taking measures every day and thanks to reason with support who are being helping\nAnd equipment and training our security right is to provide the kind of security that the Afghan people deserve\nWe ... we don't have much time has to move so let me ask you some quick questions are pitching to what you just alluded to that is the support of allies in particular the United states and of course you a former ambassador to the United states on behalf of Afghanistan or let me ask\nYou this Donald Trump has said of course that he will keep troops in Afghanistan advise and training fourteen thousand of them\nBut he clearly wants to end this conflict in America's commitment to it as quickly as possible one thing moved to America is privatizing\nThe U.S military commitment in Afghanistan I spoke recently so Eric friends formerly the head of Blackwater who wants to get a piece of that action how would you feel if the Americans offered you instead of the U.S military privatized contract to force\nWe have a decision by the national Security Council and we should a statement this is we will not allow a businesses to ah to make to to turn our war into profit\nA it's an honorable cause we're proud of our partnership with our our life we're fighting terrorism or and counter insurgency in this country and and that's not for profit\nA second and more important point about the diplomacy right now it turns out that in October I Believe October the twelve Donald Trump's Afghan envoys ...\nHe had talks with senior Taliban officials yes or no did you know who the those talks were taking place at the time we told beforehand\nWe knew he had talks there Steven ... this I Want to clarify there is a lot of confusion about this people confused talks with negotiations\nThe Afghan government has the initiative on the peace and reconciliation process we held two major conferences here in Kabul called the ... process to bring regional countries on board on what we're doing on peace and security we are also had the initiative on the ceasefire where where\nAre you an hour and a lot of us because we have now is on you or I don't think it'll stay straight down said who are very important question 'cause it's about who really is driving efforts to engage the Taliban right now the New York times reports it's sources saying quote\nFills that I had these meetings with ah the officials from the Taliban just uh he flew to the Gulf states have ... he quietly met them on Ashraf Ghani your president your boss and his government\nHeard of that meeting only afterwards through news reports is that true or not\nAre you asking me a question that you just want confirmation for or or what is going on it's a lot more detail than what you see in a news report\nAdjust because few words were not set in a meeting doesn't mean that was intention behind a hiding that it was a quick meeting a and a ... you know he is very exhausted from his strip\nYou didn't want to be clear then I think you've cleared it up first you didn't know who the ... the special envoy was talking to the Taliban and it just strikes me that the signals we're getting right now is that the Americans have decided\nThat far from this position in the past where the Afghan government always says we must own any\nPolitical process with the Taliban now the American seemed to be saying no we're going to engage with the Taliban ourselves\nNo you you cannot have one incident uh dictate an entire policy or that's not what the Americans are saying and that's not what the American stands as we are a ... I mean in constant contact with our American partners\nNot their policy and let me let let me tell you one other thing it's not that Afghans must own and drive the peace process Africans do\nOwn and drive the peace process and that's the only way\nFor success it's not that we we want the ownership just for the sake of ownership we think that without it there will be no peace in Afghanistan and it would be ashamed that old your investment in our and mess investment in sacrifices go to waste\nI'm already asked by a ... through a process right on that process and it's very clear our final thought\nWe've discussed and you've been quite Frank about the degree to which the Taliban has a ... a real presence on the ground in many parts of Afghanistan but what would it take much to national security advisor for you to formally recognize the Taliban's\nRight to a stake in the governance of your country what would it take\nWell where the Taliban contend elections there more than welcome to participate and see that the Afghan people want that process despite their threats\nThey participated in elections if the Taliban really feel that they have a place in Afghan society other than driving fear into them then they must come and content and see where whether the Afghan people really vote for them or not\nThey they can only be a force of military force that um that Dr fear can they provide governance and the Afghan people accept can only be known if they participate in a in a in a democratic process and let the Afghan people choose\nFrom from the bridge more celery Irish what I like about an eighth in order to see the email you need everybody to come together\nTo heat it up so\nPeople collective action will reveal the work but of course\nIf the collective group of people\nRemain only image you'll have you'll have a positive image they start getting set to go see a nation of how people help each other pot of yeah yeah well see the image is it a professor\nSo we can if it's going to be a part time that we cannot tell you what it is today we're going to know the parts were telling her today that she has been selected\nAnd she's been selected by the group of name titan neighbors yeah\nSo just to summarize where we are in the process\nOf hopefully when we come back and speech in a couple of weeks time these are the issues that you will result one is negotiation of this person who's been selected\nThen you have the physical challenge and the material challenge of how this person's face oh image can be put on to a black ... as well as all the text\nAbout why we don't know because we're discussing I say I don't think she will want her face\nThat's why I don't know they must be because I Want her to the side why they say much that we should bring into\nThe ... it could be used in the ministry called techs before but not to not to speak well I'm certainly no on the scale Isabella ... he's one of the tapes curators on the project working with Tonya to make you don't happen\nThis is something that we wouldn't usually using them you income tax code that ink incentive to temperature change of temperature and things like that since it's changing all the time so it's been very interesting to watch with the axe that\nIn this very specific material to understand how they think can really be a ... in the states what's been very interesting for us to learn is how\nStumped the temperature so how can that those friends how we then what and\nHow we price the actual printing\nIn actual fact what's interesting is that the the tiles that will be laid will be printed by a large machine that will be handled by how\nWe will be sending out of time to time for you to actually actually in the bank to ensure that prices at times if I have\nOne thing in London\nBetween October fest you're going to get a letter writing that we can guarantee you that much tonight But Rand certainly yeah what about wet too that people try to stay in the ... how does that affect\nSo that was one of them very early questions we have a\nLot of the nation and a nephew that will look invisible it will look like knowing that they're taking place but actually it's a very happy JT flooring news in Akron, Ohio say if we can plan depending on it I think we'll be okay\nAfter work gets fully underway with princes would ignore usually on site to hide the tip of the protests I make another visit\nWell it's been a few weeks since we were last there and the tub I Know that type of this being transformed there's a black flooring\nThe some men who were rolling white paint on the floor and you've got to start an Icelandic nearly where she was before but the floor is completely different I'm rubbing my first on this blood flow nothing's happening in this has been treated yet not yet\nWe have a black so they didn't want it and I spent like again\nThis shift will hit the looks different looks more like she doesn't know does he get tested it's kind of gray and what it is treated\nSweet tastes like these fun to watch free to write these fancy say there is a pipe\nThat goes five nobody knew what she said\nSo we look at the past of heat\nOf the flood water to the building\nSo this ... whitefish field is the heat something they want somebody that would show yeah yeah\nI'm taking one ... year old ... smell but but basically it's a one for the ... it's it's a U.S ally in print but my feeling is kind of these primordial print it really is like sort of\nA drill is that people\nKnow they have the pizza everything it can [noise]\nAnd now he's responsible to make it project is it all\nThe on the black he's an area of life to gray tiles which is where the ... will be the launch image which will take collective action to uncover which could only be seeing it needs to counter the from the bridge above\nLast time I was here you'll remember the time he was about to break the news to the titan ... we'd be chosen and do the image at least that's what I thought but it turns out she could select inappropriate image not necessarily so stay with me\nAnyway we can now revealed the person is necessarily belt head abusing community programs for the local community organization\nWho's worked with young people in the area over twenty five years no certainly will she be represented in some way to the flu the idea is also to name possibly take off the three year\nNormally naming rights to build a ... or the privileged the grace of the good this will turn on each had shifted the emphasis for wealth and social status to a brutally unknown individual to return\nThe bar for Ninety point have the news comes from Orlando Health coverage or whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six out patient ... more information is that she's going to help dot com\nTo project some of the values actually belt still coming to terms with it though\nI was told us about three weeks the guy that had been nominated to be the name of the building gets in a life changing event and I'm quite private testing phase half my name on the building and it to be so public is and my six they came to me\nI was under the impression that it would be you'll face\nNice very nice space I don't know why wouldn't it [laughter]\nThought it would be more appropriate and I think ten years following trade came that that image would be assembled a\nWhack and the and it changed that and it's like my nine ... percent say the images that share the young passing the I watch that too is now and that's ... ... you have to pay its studying fire medicine\nAnd but it has and I met the chance that guy he was playing the war in Syria\nAnd she came to this country and I see nothing and he joins how you for I'm actually on the United states and sweet\n... with him for a number and she has\nHe taught me a lot about you know what it means that see nothing he told the young people and they're like an area\nAnd what it was like she has no opportunity and I accept tape and the resources and he turned his life completely around and I'm just so proud to have him and say to me that it's a huge symbol of the white guy to its power\nNot young mom mode simply for this procedure is use of is allowing you to turn on the head the customer ... ... migrants\nNow some of these ... big actually a note of hope this will have their face revealed on a huge scale but to do that the technique of representation I'm concealment must be precise perfect\nI cannot see ... paper the scope policy lift up she's more Florence is\nDisease and also special tiles for them to do the work goes on well\nTaken that sort of used to\nUse the old technique of mistakes or do you have to put Dutch yes it is that the lead in order for it to friends\nAnd then we have friends that he will face like\nTells we'll go to watch this space to speak French is the ... and then when we walk on top of it\n... to the face will be rebuilt\nWhen you're ... you're going to see a little something different you know and hopefully that will trigger people's desire\nTo cut more and see what are those dodge\nAnd tried to find out what the ducks are\nWe get close to the machine which is now\nRepeated backwards and forwards and forensic this is a complete intervention into this space machinery to see how you were you you will make a studio wherever you are\nActual Suzie I'm In a moment so what I like those things you just should I\nCalled Davis from the company in ... monkey is book you'd be an opera an impressive machinery it's\nTime and change the way to handle the really well\nBudget frigid on top of it before\nBut they fishing as long as they try\nFor the rights of production I'm really tired today on the twelfth soils you know in a section and wondering around and say to fully sections with that [noise]\nLong would it take to the dollar image if you're a boss died the brigade father projects have them all in the lodge fall any section\nSize does not\nWhat is the most unnerving thing is how people interact with the fee\nFor example you have a twenty five major by sixteen ... that can only be revealed what collective action\nThere was one ... month old now it's not enough yeah not\nOnly ... everybody gets together to do that's who\nYou're listening to in the studio the b._b._c. World Service where we are following the Cuban Atsushi taro uber Guerra now when I first met you at the entrance to the two of mine who she told me about the black flew the renaming of the building the tape neighbors plenty boom but she didn't mention one other thing\n\nThis is the b._b._c. World Service and here's Lawrence ... for next\nWe'll all be in China to reach me Zsa Zsa skate life in munitions factory by teaching English but they'd be normal looked to see the title of a migrant workers pulls into a life of prostitution was published last year so much\nJoining the regime that\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now have you been happy family\nDon't your support for uninterrupted programming donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nHour South America correspondent case he walks in reports from Brazil when I hear regional Mike founded his hair and his team are America's editor to\nThe gallon by telling me about\nTheir own mind on my mind because they did the b._b._c. world the world's meeting thinking [noise]\nBody point seven W. M. F. E. Orlando\nThat forward GMT a vigil for less than people shot dead at a U.S synagogue\nEvery Jewish person for the nightmare they attacked the Pentagon Shabaab morning takes leadership to stop and our leaders are not stopping at\nAnd that ... with the news or even on the BBC outside his BBC understands the ... the football cup was in a helicopter which crashed outside the stadium\nMy nephew came running towards like it was in a row started to shock said shame that helps us far without control within a section just starting to fall\nBrazil will elect a new president the far right candidate needs the polls the tools to help spot false statements I'm working harder than less time an experiment and New Zealand decision to discussion about days in the office it's about on paying you to produce acts if you can do it in two days three days one life\nI don't care at all to come first the updates\nUnderstood Macintosh with the b._b._c. news hello\nPresident Trump has condemned the shooting death of eleven members of the synagogue in Pittsburgh has an evil act of mass murder a Jewish civil rights groups that are believed this was the deadliest attack on Jews in us history\nA man identified as Robert Powell is open fire as a Saturday morning service was getting under way he was detained off the exchanging fire with police officers here's Gary of donors you\nThe FBI says robot bows be prosecuted for hate crimes and the justice will be swift and severe\nPowers reported you shouted old Jews must die of the open fire in the tree of life sooner gulp and it's become clear that he was a prolific ... an online to anti Semitic hatred and conspiracy theories\nEven posting the phrase I'm going in just an hour before the shooting took place\nPresident Trump is called the killings evil and says he'll traveled to Pittsburgh shall fleet or flags at the White House look other federal buildings will be a half months for the next four days\nA vigil for the victims of the shooting has been held in Pittsburgh several hundred people gathered three Jewish prayers and light candles\nOne young girls said she felt differently now as a Jew realizing that anti Semitism had not been relegated to the history books the White House is find us ... memory of those killed Mr Trump said the killings might have been prevented if that had been unarmed jobs in the building\nIn Britain the helicopter belonging to the tide billionaire businessman we'd shy see what's in the upper ... his crashed and burst into flames that's the city football club witnesses say spirals out of control after taking off from inside the stadium off the less the last time\nMr we'd shy who'd been watching the team he bulletin twenty ten usually leaves the stadium by headache up to a source close to his family says he was on board when it crashed\nLeft the city fans are anxious to reach eyes family\nThat heart and soul of the city for for profit off of them don't know if this would have been possible in recent years the primary league wouldn't environment which I'm sure if it wasn't for them ... from a from her\nHorrible horrible horrible horrible\nWealthier than everything I was ten years old it's just a lot of concern\nMexico City is dedicated Daniel Day of the dead parade this year to migrants who've lost their lives in trends is\nUnder those who settled in the capital alongside the traditional giant skeletons of marigolds in Saturday's possession was a segment featuring grey metallic panels representing the Mexican side of the U.S border\nThe parade took places thousands of Central Americans continue that track through Mexico to the United states defying President Trump's and treaties to disband\nThis is the world views from the BBC\nBrazilians vote today in the second round of presidential elections they have a choice between the far right candidate ... ... and the leftist financial or that of the Workers Party soldiers have been narrowing but Mr most an arrow is still expected to win Kansas pit reports\nHow did it right wing candidate without the backing of an established party gets so far shy as both an artistic seeded by writing the wave of public anger at the country's corrupt political establishment\nIs channeled the disillusioned south by so many with a left wing work is hockey ran Brazil for fourteen years promising to help the pool but who were found to be stealing from the public pass\nMystical narrow his whole say promise to fight violent crime winning as many women and minorities who are its biggest victims and who are now prepared to give his history of abrasive chauvinist and racist comments\nVoters are going to the polls in the first round of Joe just latest direct presidential election\nThey're twenty five candidates two of them are former foreign minister is so low may ... issue really who is backed by the governing party and the ... who's running on behalf of a new coalition of eleven policies in future Georgia's president will be chosen by an electoral college\nAt a meeting in the Vatican Roman Catholic bishops have recommended that women should play a greater role in the church the mom flung Senate was cold to examine how the church could relate better to young people but conservatives and progressive from different continents often fail to see eye to eye\nVoters in the republic of Ireland of overwhelmingly backed moved to remove appropriate ... blasphemy from the country's constitution nearly sixty five percent voted yesterday in a referendum held on friday alongside presidential elections the constitution currently holds the blasphemy is a criminal offense\nBBC News\nThat he is reading on the b._b._c. while at the time that ... had a we start in the United states where ... had been killed and to wounded by government who bust into a synagogue in the city of Pittsburgh in Pennsylvania during a Saturday service you sailing reportedly shouted old Jews must die\nFor police officers who rushed to the scene will also wounded speaking as a news conference following the attack the FBI Pittsburgh special agent in charge of judge said the government was armed with an assault rifle at least three hundred guns\nDemand in his mid forties and identified this robot powers was eventually shot and taken into custody he's now in hospital with bullet ... he's been charged with twenty ... counts of violence and firearms offenses\nYou may also face federal hate crimes charges convicted according to the U.S attorney general he could face the death penalty or speaking as a political rally in Indianapolis President Trump condemned the attack\nHi I'm off on taking all of our president and general manager of made the point that a W MSG it's been a full two years since we first tried this less intrusive style the fundraising called it's fine with Dr and this is how we do it now with the family\nDo you support and interrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nThat is on imaginable our nation and the world\nAre shocked and stunned by the grave this was an anti Semitic act you wouldn't think this would be possible in this day and age but we just don't seem to learn from the past\nOr the president has oh did flags at the White House to fly at half mast and says he will travel to\nPittsburgh and the next few days earlier he said the attack may have been prevented if\nThe synagogue has had an armed guards inside local residents close to the synagogue organized an evening vigil for the victims and is that the community gave their reaction to the check\nEvery Jewish person worth nightmare and they attacked when you are\nThan a dog on Shabaab morning um when you are there with your family um worshipping and being with your community on a day to day ever asked we have\nTo stop that high leaders have to stop that [noise] it takes leadership to stop and our leaders are not stopping at him much whereas civilized society we have to say several\nCorrespondent Daria Donahue was out last night's vigil we asked him whether it's a new could be described as some\nVery much so I mean there were several hundred people from the local community that just just really standing at an intersection in the streets in front of a ... a ... a there was some Jewish prized ... there were people holding candles and there was some speeches particularly from\nBut above all a Brazilians are desperate for some kind of stand to be taken on violent crime and giant both scenario has promised to be tough on this loosening up gun laws is one of the things he's committed to giving more funding in power to the police so people are really really he's even gaining support\nAmongst other women and minorities in the policy has railed against\nYou even got stumped during the campaign ... his support base he\nGained a lot of sympathy from that um but there are other things that contributed to this so this dramatic rise of his last few months\nTraditional policy coalitions both in the left in the right to collapsed so there's been little resistance against him and he's also successfully built support through social media just when it became apparent that it that it had to replace TV ad time as a dominant force interested in politics\n[noise] kind of spirit that\nThis is the newsroom from the b._b._c. World Service no main story President Trump has called the shooting of eleven\nJews in Pittsburgh synagogue an evil act of mass murder vigil has been held in the U.S city this week marks one hundreds on the street\nAnd the foundation of Czechoslovakia back you know type at Nineteen Eighteen country existed for less than Seventy five years it's split into two in Nineteen Ninety three but ... still regarded as their first taste of independent states it despite the decades of turmoil that followed\nRapamycin has this report now from Prague\nRising from the ashes of the astro Hungarian empire at the end of the first World War the New Republic radiated energy and optimism but soon fell prey to the dark forces stalking the European countries [noise]\n\nMember to Munich hide why the Nazis one hundred and fifty thousand Jews monitors and there's three million Germans\nThey expelled off to the war the republic badly had time to catch its breath before coming to a new communist dictatorship so how should checks in Slovak remember that common state if you have all the\nPeople I mean I think it's appropriate to remember the scenery through the stories are those people's knows dude up for freedom and democracy those willing to lay down their lives for the ... of the woods remembering the stories but of course all of our heroes who just was\nThe ... not the ones loomed over cowering fifty was blown up by the communist authorities in Nineteen sixty two\nLegend times it ... had tumbles down the hill\nAnd into the river unlikely perhaps but they're on chunks of granite still piled on inside the dunked in Colorado's reminders that decades of totalitarian rule leave very real crisis on track to sign up to the\n\nReport from rural town now how about this\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now that you've been happy family\nDon't your support all uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nCompany has been trying a four day weekend opened and found the results to southern impressive that is now expanding the scheme across the country from New Zealand his illness [noise]\nExperiment wanted to see if the author squeeze a week's pluck into jumped for days moral conditioned\nTo think you've got to spend five days in the office why it's something I Wish that people could have faith and people to manage themselves we kind of made to the micro managed to be productive\nAt Oakland city I say it's a full day working we could work in any business and provide a massive boost to museums productivity\nPerpetual guard units and investment some it's the first major business in New Zealand to trying to reshape the traditional working week it's Boston foundries the British born on for ... Andrew bonds he says the trial went well the\nResults were really exciting and find productivity went mountain lamp\nStress levels dropped [noise] company has\nTwo hundred employees in sixteen officers around New Zealand capes Palmer is a client manager in Christ Church she says the trial was challenging but liberating\nSome paper over initially at that and show last match before I ... could wake and we still had to ... or ... some people that she can on nearby off sometimes\nI think the key point is that working smarter not necessarily holiday\nThis isn't a discussion about days in the office it's about on paying you to produce acts if you can do it in two days three days one like I don't care do you believe them when they say has improved productivity\nCompletely\nJackie Walters runs her own public relations business in the city of Nelson she championed the idea of corporate flexibility ... from home set their own shed jewels and ours\nWhen people are within an organization and feel like a carbon in the shame\nSometimes take 'em ... at the end they feel that they should take extra time at lunch or whatever because they put upon them in a sense of the constraints that living with them\nI think any type of wind say here the task his uh trust we had ... people just thrive and grow and ... and it works and more companies like that they chose that and wanting to take the chance\nTo know everyone thinks the perpetual guardian experiment will catch on media commentator Mike ... is one of the\nDownturn as I'd like to change it up style and they don't type of this is your type yeah but the future can you actually do more all the science in less time can you really do ... if there's more down to a Mike actually says now\nNot every company would be able to do our Muslim\nBut I Will be signed to every company in New Zealand try this gave it a\nGod though in the lines of the lone white clouds many workers will no doubt be hoping that both states will allow them to enjoy the benefits in the ... the lone we can\nFilm is that for us in New Zealand students hanging out with some other stories from our needs to a human rights group in the Balkans was criticized the decision by the ... government to publish books by two former generals convicted of war crimes for trophies committed by sub groups in costs vote in the late Nineteen nineties\nThe Serbian defence ministry insist that the two men have the right to give their view of events\nThe leaders of turkey Russia France and Germany ever getting stressed that opponents peace in Syria can only be found through political means following somebody in Istanbul they promise to work to ensure the currency saw in the northern province of Idlib became permanent while reiterating and determination to combat terrorism\nThe African American poet to play right into ... has died in Maryland at the age of Seventy she was best known for Broadway hit for ... from the Nineteen seventies entitled for colored girls who've considered suicide when bring both is enough to think you\nKnow across many pots as was lying to the police is a crime that cannot someone in jail now scientists have developed a computer tools that can spot if someone has filed a false statement but no details on this is Denise ... technique and\nIt's a huge problem in fact it's a worldwide problem and it's especially related to low level crimes such as rubbery and it's basically where a full report is made sometimes to shift the focus of an investigation from from the past and making it or to make an innocent party appear guilty\nAnd the oldest does really is it contaminates please databases it damages the outcome of criminal investigations wastes police was those who is of course that could be used or on other crimes\nAnd of course that full statements carries serious consequences of their own they are a crime in themselves and the system just looks at how people are lying to the place\nThat is where it's been done by a scientist in Spain and in Wales laws if they develop them how\nWill this it's a system it's a computer's a tool and it's cool to ferry Paul various kind of to do with the truth\nAnd uh it specific to reports of robberies and it was developed by being fed historical reports known to be foods so that the computer could learn patterns a thousand reports were fed to it from the Spanish national police records in the head of success rates of eighty percent\nAnd it's based on the protests known as natural language processing a branch of artificial intelligence and it helps the computer to understand the ... human language basically using algorithms to study adjectives acronyms the lives kind of grammatical\nThings that we don't always pay too much attention to and it looks at the finer details of those just or is it in that way able to\nFind out false reports briefly why does it go from here will it's being developed by researchers and caught if you knew best University in Madrid a pilot was done and in that case in just one week twenty five cases of faults reports were found and now it's being rolled out right across Spain [noise] ... that\nThis is the newsroom on BBC well so this just before we got a reminder of our main news flags flying at half mast at the White House and other us federal buildings after a gunman killed ... members of cynical in Pittsburgh President Trump has called the shooting an\nComment hot far enough accessory that aren't as if the place that you're not because\nIt's not justify the practice to unite there are many factors\nEducation nationality or nationally but this is very premium fees and visited free\nJai ho you don't like the idea of February ...\nWhich is actually on the raising of\nThe reason why ... I can not find any evidence ... fires fake gates because this is the\nForemost be somewhat very benign form of Islam than their legality Segal a forty to Kelly from\nAll the ... shame pong and Maureen\n\n... off from a law firm\n... meaning\nVoice entirely twenty five year period of independent will speak your son was ruled\nBy the former communist leader Islam came up with government's treatment of opposition to swim meet those ... one of the most repressive country in the world [noise] thousands of Muslims were\nIn prison for having long beards praying five times a day we met we experience from universities or lost their jobs or reading but she ... like when Islam cutting died in Trenton sixteen he's in our time's man shop got me to the audience to all the if the new president\nEven those big I didn't expect any changes so quickly but the country seems determined to do need to be on the religion in college was next to visit the shrines to showcase the new parliament Islam [noise]\nThe ... part of the capital touch can cut armed by medieval mall in ... I'm In charge in Nevada from\nThe head of the newly established Islamic civilization center\nOr scribble is charged Florida either starts the idea of all I'm up all the SCA\nHuman nature to perform pilgrimage learn new things and find solace in peaceful their souls old people they pick the science and I'm such as it\nWas a little misleading to suffer will bother sees a slum\nIslam of life for\nOur goal is to promote the east slum of enlightenment we will to educate people and promote peace and we want to teach our young people tolerant Islam\nLogic early in the ... the founder is a lot of them was a law many\nExperts and politicians they leave the or the ... is the result of ignorance\nLearning is the biggest two to five or ... ... is one of the options to five hundred to ... Lynn you visit the shrine you learn you learn that these people try to teach to peaceful Islam\nI just want to say that today there was a loss of innocent life\nIn lower Manhattan and on the wall was just trying to ... had been connected with the seat itself event in the Nineteen nineties hundreds of young was they joined the Taliban and al ... we have developed evidence establishing a say pop committed this attack\nIn support of ISIS [noise]\nOr like a really good is with us forever ...\nWell the last two years we have abundance the old way of controlling religious people now we are giving them more freedom we want to keep peace at the same time we need employment and justice for all the people the whole society has already started looking tools to school [noise]\nSo we are living to ... to ... and hedging just how much time did four hour drive from ... to ... thousand waste of the country did sit all used to be the ancient she's grown on different ... files and there are more than ... things I Can't see you around here\nBut many people still live in clay house or because it's very good uh in hot summer the way the here and with your son is six months very hot\nI'm Will stone called the hot sauce from the b._b._c. was cited you can join the conversation why social media gestures ... BBC how insult to share with us important in sacred buildings that shrine\nAnd monuments to your [noise] see that's the kind of get on the house with some ... I found myself in this magnificent ...\nAnd I know I mean to me that I said he gets Times Square\nWherever I look I find the beautiful ...\nRetires golden dome and diverse us from Holland called out about these speeding some mosques days where this is law make universities where people are not only the religion but I strongly me science in geometry\nWants the capital of one of the greatest medieval empire ... has always been secular\nAnd disputed states tattooed on [noise]\nAdjacent to the students of ancient for us yeah all the all summer Kahn which runs for the eastern center finally found a great empire there is an unusual side on top of the ruling which I Believe it from all the release in\nFor Ninety point have the news comes from Orlando Health coverage whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that to do health dot com\nHold on to that same with a whole lot of you as you did it who come here to visit in a perfect meal and then the most of them so everyone\nMainly mainly Muslim because we are Islamic people and to also came in Jewish people encouraged him to be best that I needed I used to live with and the top of the hill and it's more yeah that'd be a local guy tell the story of\nThe the the biblical profit Daniel ... better than men and women or young so let's listen to the local guys ... if he points to the unusually long ... about them or did too big of a song called the bricks\nI'm listening to this story if you want\nTo and the\nTruth is extraordinary Jimmy ... and ... with the dark green very\nDiverse is from the holy Koran written in ... on the cover diligent say almost team or a ton of lame but the profit Daniel remains from Iran\nShe beat the saints too long so if the Iranians came to collect ten they couldn't find him and not diligent say that the ... grows his arms to mentor yeah the leafy caught it on to to all these clouded by\nVery diverse pagan the overwhelming majority Muslim\nAnd to call him the profit\nThen yeah and it was ... [noise]\nNow let me see some ... some ... how\nWe never had I've come to these storms in ... I feel that that was even they don't quite\nOpen at least I have my money back to me that laugh at\nHow it's flying into the\nScent Daniel was not only a Jewish profits profits for old men kind that's why I even called my grandson then he had in his own and\nI Want him to move a little like the same time you see\nThe level at the local Muslim since his visit to the tune of about the condition it's the pilgrimage to solve them so much to visit some countries and it was\nJames uh before I did not know anything about the perfect Daniel being buried here so he certainly mentioned in the Bible as a as a profit in the Bible did some amazing things some amazing prophecies even process say Jesus Christ the son of God coming on earth the businesses back as soon as many voted to religious appreciation\nYou know we don't know about these things in America we don't learn much about central Asian history that I'm from Texas and those records like Texas hot and dry lots of cattle so I feel at home here\nIs a great deal of my name is Christina I go out here and like to move to Russian my mother told me about this thing she told me that well they\nActually not one of those joined in St dania came here and you touched me to meet you and it came on life and it is still standing I Believe in its powers because it's a sacred place I've heard the same reviews for many people my friends from law school came here and it made a wish by their illness\nAnd it came through yesterday that got the million man let's everyone who comes here to visit the two of the profit they come to the ...\nTreaty and touch it and both Christians and Muslims believe if you touch this treat\nYour dreams come true and your difficult to go away so I'm thinking since everyone who comes here that why don't I and you know I mean if you wish and touch industry\nFlorida oh no no [noise]\nNo I'm the b._b._c. World Service the parents they change meant to\nBe so absolutely wonderful since childhood memory\nYou know there's no greater beginning knocking wants to be turning on watching pool I Try and\nAdded sprinkling I've ... I've been married for very long time to me that due to the new relationship I finish off with some passion can\nConnect people I run at the food chain as BBC World service telecom\n\nYou're listening to the b._b._c. World Service\nHow technology reporter very time until this last Washington correspondent for some ...\nWas in the north east England is ... ... one of the key would be torturing them from being monitored\nAir online and on march so this is the b._b._c. world there but the world's radio station [noise]\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fire with Dr and this is how we do it now have you been happy family\nDo you support all uninterrupted programming donating a dollar a day the W. M. F. U. dot org or call one eight hundred Seventy five twenty twenty\nWhole hadn't been coming up we'll hear from the counselor whose district in the U.S city of Pittsburgh was the scene of a mass shooting at a synagogue\nThe controversy in Nigeria over ministers cool for people to have fewer children\nYou have no ... in Iraq with the economy if you have not done anything with the resources that we have to prove to the people that kind of Israeli doom where how can you blame population\nThe ... votes in favor of a ban on the use of things go use plastics and New Zealand experiments with a flexible work policy in the full day a week when they\nWere wrong type of this is the future can you actually do all the science ... can you really do if there's more than ... that's all to come here on the weekend\n\nUnderstood Macintosh with the b._b._c. news hello flags flying at home most of the White House and the U.S federal buildings after a gunman killed eleven members of a synagogue in Pittsburgh\nRobert Bauer says been charged with murder and other offenses President Trump described the shootings as evil the Jewish civil rights group the Anti Defamation league says it believed this was the deadliest attack on Jews in us history his Gary are Donahue\nYeah says robot bows be prosecuted for hate crimes and the justice will be swift and severe powers reported you shouted old Jews must die as he opened fire in the tree of life cynical and it's become clear that he was a prolific pet ... an online anti Semitic hatred and conspiracy theories\nEven posting the phrase I'm going in\nJust an hour before the shooting took place\nPresident Trump has pulled the killings evil and says he'll travel to Pittsburgh shortly or flags of the White House the other federal buildings will be ... for the next four days\nIn Britain the helicopter belonging to the tide billionaire businessman which I see you watch them apropos has crashed and burst into flames ... foot pole club\nA source close to his family has told the BBC that he was on board the aircraft at the time witnesses say spiraled out of control after taking off from inside the stadium is Simon ... some reports\nAt the end of every home game we she saw us enough prop pause helicopter takes off from the page and our off to the final whistle on an easing much last night just to say it cleared the stadium but then there was a ... is it crushed in the ground and the huge ...\nPlace for our thoughts as nominates cruise with holes and many of our main task throughout the night says investigators begin work they're still not official confirmation of who was only a cough for casualties\nA regional election is taking place in the German state of has whose outcome will influence the fate of ... federal governing coalition\nBoth Mrs medical policy the CD you into STD coalition partner have been doing badly in opinion polls and has a while the greens and the far right AFDC a project to make gains Jenny Hill reports\nGermany's coat against this chick south ... over they had destiny and what happens in half the today and they indeed the all I'm going to knock on state\nHow is waning and how conservative they are getting badly in the polls and ... and a half now will be ... ... when we didn't have ... kind of ... I mean in next to free food many in the speedy blame that uneasy alliance witnesses Michael ... puppy in our city\nIf the hockey do not only as predicted in its leader might pronounce it the commission and bring down the government\n[noise] this is the world news from the BBC\nVoters that going to the polls in the first round of George has lost direct presidential election they're twenty five candidates two of whom are former foreign minister safe no candidate wins and overall majority there'll be a second round\nBrazilians vote today in the second round of presidential elections they have a choice between the far right candidate shy you both so narrow and the leftist Fernando died of the Workers Party counters pit reports\nHow did it right wing candidate without the backing of an established party gets so far shy as both a NATO succeeded by writing the wave of public anger at the country's corrupt political establishment\nIs channeled the disillusioned south by so many with a left wing what his policy ran Brazil for fourteen years promising to help the poor who were found to be stealing from the public pass\nMiss the most narrow and so say promise to fight violent crime winning as many women and minorities who are its biggest victims anywhere now prepared to give its history of abrasive chauvinist and racist comments\nMexico City is dedicated Daniel Day of the dead parade this year to migrants who've lost their lives in transition to those who settled in the capital\nAlongside the traditional John skeletons and merry go since Saturday the recession was a segment featuring grey metallic panels representing the Mexican side of the U.S border\nAnd Australian police officer has successfully resuscitate should a kangaroo ... nearly drowned in rough waves of Melbourne safety beach officers found the mouse to peel headed evaded would be rescue isn't helped back into the sea\nSergeant Christopher Russo and seniors sergeant kitty cubby token at the creature was struggling by the time they managed to drag you to show the kangaroo was unconscious not recovered after being given compressions by sergeant Russo\nAnd that is the b._b._c. news\n[noise]\nHello ads six or six GMT welcome to weekend from the b._b._c. World Service my name's poll Hendley coming up following a mass murderer to Pittsburgh cynical or local rabbi reflects on the history of violence against his community\nWe've been victims of the kinds of mass shooting attack over and over again for the many years and that doesn't seem like there's been any change a resolution our decision to try and rectify the situation\n[noise] American prosecutors have broad twenty nine separate charges against a man accused of killing eleven people at a synagogue and Pennsylvania Robert Bowers who's forty six went into the building during a service yesterday morning carrying an assault rifle and pistol and open fire\nAddressing a Republican campaign rally for young farmers in Indiana President Trump condemned the attack\nThis wicket act of mass murder is pure evil [noise] hard to believe and frankly some things that is on a measure of our nation and the world\nAre shocked and stunned by the grave [noise] it was an anti Semitic acts you wouldn't say this would be possible in this day and age but we just don't seem to learn from the past\nPresident Trump our cars\nFor Ninety point at a news comes some land out how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six out patient ... more information is that she's darling do health dot com\nOr very moving vigil hundreds of people showed up in the cold and the rain\nOr a nice sign some like if some Jewish press Jewish present healing\nAnd the interesting thing that struck me that was that the older people that said look we we thought we should perhaps do this you know after a day maybe come back tomorrow evening for the young\nYoung members of the Jewish community she'd said no we want to do right now we want to get out of the street and do it right now and there was some very powerful speeches for some very very young people one\nOne I spoke to off to a young girl who severe living just Fifteen Years old she stood in front of the huge groups and said I'm a different Jew today than I was yesterday so anti says anti Semitism happened elsewhere\nOr in the past but now I Know it happens right here right now he's\nIncredibly moving the president's reaction has been swift and clear hasn't it it\nHas it's been on ambiguous and very clear he's described it as evil he's used incredibly strong language to fund damage and there's been no equivalent patient from him and all of this one unlike the criticism you faced pops last week over the\nWho are killed or under the age you know pulling all at this issue is quite serious I mean that it's not really about it yet and also or it'd be a clown ain't\nA diver also other countries who are supporting them underneath on a that was a PR campaign about in a you know and then the rest of the media so other actors also are possible or you know crisis okay and it's on turkey is not really keen to you know\nMake it that uh you know a crisis which in Saudi Arabia and the only up and I said it's a crisis of the most of the old conditional on many many thanks anticipate rapidly in Istanbul [noise]\nFinished shake up to the traditional five day working week in New Zealand where productivity lax well behind other developed countries and Oakland based finance company trial to four days a week and the company found the results impressive so much so in fact\nThen are bringing in a flexible working policy across New Zealand from that film of some reports\n[noise] experiment\nOnce it to the effect off squeeze a week's work into jumped four days old conditioned\nTo think you've got to spend five days in the office why\nIt's something I Wish that people can have faith and people to manage themselves without ... managed to be productive\nTo ... well paying the employees for five dice pretty good deal actually federal\nClemency you always say it's a full day working we could work in any business and provide a massive boost to museums productivity\nRitual guard units an investment from it's the first major business in New Zealand to trying to reshape the traditional working week it's Boston foundries the British born entrepreneur Andrew bonds the\nResults were really exciting and find productivity when mountain lamp\nStress levels dropped [noise] company has\nTwo hundred employees in sixteen officers around New Zealand kites Palmer is a client manager in Christ Church\nSome people were initially at that ... the phone I can wait could wake and we still have to ... or ... lines and ...\nWe're looking more freedom to organize at time and by the name of the time everyone was really positive about it because at the same from South than it can lick\nThis isn't a discussion about days in the office it's about on paying you to produce acts if you can do it in two days three days one like I don't care to believe them when they say has improved productivity\nCompletely\nJackie Walters runs her own public relations business in the city of Nelson she champions the idea with corporate flexibility ... from home set their own shed jewels and ours\nWhen people are within an organization and feel like a call than a machine\nSometimes take 'em behaviors that they feel that they should take\nExtra time at lunch or whatever because they feel put upon and it seems like the constraints that living within I think if you take this and why and say here's attack his of trust we haven't used people just thrive and grow in Boston and with more companies like fifty to that and wanting to take the chance that they\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising cold it's fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nOh Paul kings don't ... although views of us ... they might just make the daily grind more bearable flexible workplaces could ease that sort of pressure on people and the environment [noise]\nBut not everyone thinks the perpetual gone to an experiment will catch on media commentator Mike ... skiing is one of the\nDownturn is I'd like to change it up style and they don't type of listeners utopia but the future can you actually do more all the science in less time can you really do base out if there's more downtown Mike actually says now\nAnd Tim ... an economist at the University of new south Wales believes any changes to the working week need to be carefully managed\nYou do have to look at the customers are facing the business so they were on a food I work with each other clients will come on frog does it might be difficult to Mitch referred to the last one died of comes to ... so they can manage that that it probably would work will\nNot every company would be able to do our Muslim\nBut I Will be signed to every company in New Zealand try this gave it a\nGod though in the land of the lone white clouds many workers will no doubt be hoping ... will allow them to enjoy the benefits in the ... the lone we can [noise]\nFilm is reporting from New Zealand now it's time for the sports news and James Craig joins me moaning James good\nMorning we'll start with Premier League football west side I'm On ice cold twice to help a little bit will be ... for one am fields moved to the top of the Premier League ... conceding while leading to nail actually helps that\nThey ... or something like that I don't like it but I Am today down a little bit even because I thought so too one called ... leaving here maybe something can go today and I'm going to use that space for for a nice goes\nWell boom of stay six that's thanks to a three and a win for them they remain in the ... who does feel lost three no ... for to drop to the ... some of the table and that one of the Premier League seems without so when did it is rough have been each other's new castle they dream ... at South Hampton\nAnd delight to getting less that rescued late draw against ten men west channels things to an eight to nine to ... equalizer from Islam ...\nBut ... games impulse is somewhat being shrouded by what happened after the game a helicopter belonging to the owner of ...\nHas crashed after just taking off from the club stadium witnesses describes in huge fireball the craft drop to the ground we just don't know whether we ... see what the ... and his family were on board\nEl sweat full mingling manager Glenn huddle remains in hospital he felt seriously ill on Saturday morning and became on well after appearing has a ... on the television station and he said to be responding well to treatment\nTo formula one what Daniel recalled I picked read both teammate maximus tap into pole position at the Mexican grown ... would lose Hamilton and stood how most of them can win a fish will likely she finishes at the race in at least seven flights after a difficult week he's thrilled to be stopping stood on the grid\nYeah feel good I'm pretty much happy yesterday was the car yesterday was a typical day for us and we had a lot of work to do over overnight and I'm a college it was a real struggle for for us and and terrible feeling to drive you said yesterday I was gonna be sorry for the rights are out of such a crazy [noise]\nSo it's really happening today and then it did a great job\nWill finish off with some baseball whether the Boston Red Sox produced a stunning light rally to defeat the Los Angeles Dodgers nine six and moved to the brink then ninth World Series crown on Saturday the now leads the best of seven series three you won the red Sox can clinched a major league baseball cramped\nWould victory in game five of the Dodgers stadium on Sunday [noise] thank you very much\nA that was the sports news now returning to a top story this out which is the merger of eleven people by a lone gunman in a synagogue in Pittsburgh in the U.S mob Goodman is a rabbi in the city and he sees the attack as part of an increasing threat to minorities in the U.S\nWe've been victims of the kinds of mass shooting attack that over and over again for many years and it doesn't seem like\nThere's been any change a resolution or decision to try and rectify the situation so as much as I'm devastated as a Jewish American and as much as I'm afraid\nFor feeling like a target and for all of us feel like targets I'm I'm devastated as an American that I feel like\nThese shootings keep happening in America for all variety of reasons\nThe main one being the proliferation of guns and a very powerful guns that can shoot a lot of rounds at one time because we as Jews are seeing things in social media in national media and and kind of overall statements and in the world are that\nAre directed at us that we are singled out as a minority to be disliked and to be targeted but we have been in situations in the United states where\nThere was no rhyme or reason to the purpose for which the killer would attempt to take life there are times when we feel vulnerable because we are the ethic as Jews there are times when we see feel vulnerable\nFor no other reason than we are human trying to live a our regular daily lives the amount of anti Semitic anti black anti Hispanic\nUm anti gay hatred in the United states has been on the rise we're living in a time when people are dividing in conquering I'm minorities in America making her feel less safe just making people feel other and different um breaks my heart\nMount Goodman who's the rabbi and Pittsburgh and I'll be discussing this story and much more without gets to be joining me in the studio and a few minutes time I'll be\nIntroducing them very soon and never have the calls for the next two hours when life from London this weekend from the BBC will to [noise]\nI'm a little puzzled as to what the objective is if it's to reduce carbon that's fine but you have to consider that a sweeping ban\nMay cause producers are manufacturers to come up with solutions that are even more harmful to the environment\nMustang airplanes because a lot of plastic inside the cabins or airplanes that may never get re is is that single use and what will it be replaced by you know metal or some kind\nAlso and takes resources to make that metal just like into plastic and takes energy and it's heavier as a consequence that may cause the airplanes and get less gas mileage so to speak and have a bigger carbon footprint\nSo those people who carry around a metal a knife and fork in that bag when they go to work so they don't have to use a plastic one they're doing the wrong thing or they\nAll I don't think so I don't think that's quite the same thing I think avoiding the use of disposable plastic there's not a bad thing to do however I don't\nKnow that just banning it out right across the board is necessarily going to achieve the most desirable result\nWhile it's not out ... isn't it it's just in the European Union and surely that's a good start\nNo it's outright inside the European Union what I'm saying is that\nAlternatives we'll have to be found for example if you don't use a plastic bottle then you'll have to use a glass bottle how much damage he goes into the use of that glass bottle how much energy goes into either recycling yet are destroying an in a landfill one has to consider when the alternative is for each use of a single use plastic\nI thought the whole point was that they were single use plastics and a glass bustle you can take back to shop and refill and using many times as you want to tell them I mean that is the perceived wisdom surely\nWell not necessarily I haven't seen many return of a bottles in the United states in about twenty five years\nWhile there are a lot modem in Europe I can tell you\nWell that's fine they're also costs money to screw up those bottled up and use them again it's not the single use plastics should be used and it's not that getting rid of them isn't a good thing but you have to be careful about being sweeping\nI'm just curious as to what the alternative to sweet thing is I mean if if you introduce legislation to find the single use plastic\nIn August ... doesn't and did a good thing or is it no it's in your opinion I don't think it's a good thing to have a sweeping ban should such measures to expand that so that it becomes written into global trade deals that well as\nIn not just the European Union that is certainly not good for the world I Would like to see fewer single use class snakes out there right now what's your life in your plastic forks or are going into restaurants are being handed Styrofoam cups and things of this nature\nHowever one one has to be judicious about this and think term you have\nTo be careful about how you go about this because you might end up using more energy rather than less it depends on the energy use of the alternative that's the problem\nRight then you decide to just you know\nBlindly regulation on you know something this is a good example of why ... ...\nIt's the kind of I'm thinking man made out of Brussels better for people to vote the way they do\nBut surely it boils down to whether it's best to to use reusable items again and again or to use plastic I convinced the science shows that you are damaging the environmental ... by not using plastic full surely there isn't much of a debate about it unless you represent the interests of plastic folk makers\nDon't represent anyone's interest by the way I guess I've said over and over again to you that getting rid of most single use plastics probably makes pretty good sense but getting rid of all\nI don't know and that's what bothers me about this legislation because they may be circumstances which the alternative material actually causes more arms the environment because in in the nature and the way you use\n[noise] Peter Morici who's an economist and business professor at the union but University of Maryland in the U.S what did you make of that Chitra\nWell [laughter] I understand what he's saying about having to look at the energy footprint of alternatives but I Do think that environmental degradation on climate change that we're seeing in the world today is such a pressing issue and we need\nSleeping on edge inaction scale on this and of course looking at stake is not new and we've seen plastic bags being banned on the African continent for example in Rwanda Kenya my ... and Morocco\nAnd of course across the world ... taxes on drastic bags and I think it's a very welcome development my flights and vegetation is around the plastic strollers in particular\nAnd I'd be leading the consensus from disability rights cars and campaign is about this and it took about how many people with disabilities need prosthetics jaws and in order to be able to drink liquids and\nKind of use metal ones opaque\nWell I well actually other materials such as paper and metal a glass of silicon don't necessarily what\nSo many people can be allergic to them they can cause injury and they can be choking hazards metro for example is not safe for hot liquids and pay per head all the way it's repeated jeeze\nAnd so I Do think I Do have some concerns around the balance plastic strollers um but by and large I think it said beyond that it's it's a welcome development\nAnd I'd also like to let not just a single use plastic but other kinds of plastic that's in the oceans as well so I just really struck by the high proportion\nOf steak and in the oceans that's deep sea fishing gear\nI think twenty seven percent of the ... on a beach is from that\nAnd I like to look at that as well as and clean up as well as prevention\nMatthew I Know this is an issue close to your heart's it's a civil liberties issue I think is is won't stop boils down to the Peter Morici interview that people should be free to believe the environment if they want [noise] ...\nWell quite an I guess every time we come from the supermarket Laden with a huge pot\nFor Ninety point at a news comes from Orlando Health to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nPolitical the politicians are an on any political ... is used in Europe taking strong action on this um but there's things sort of a ground breaking it will cry yeah it is it's it's a directive at this age is not yet nor of course but hopefully we'll meet two legislation which will force\nIndustry to change on but there's also things we can do as well I don't know if you've come across ... brakes\nMusing incredible innovation that's being used plastic both ... yeah that's right it's it's they're being used in South Africa or in parts of Southeast Asia where essentially you take a plastic ball for Rothman for in a way you fill it up\nVery you you you you pocket very densely with all the pieces of plastic a way that you would normally have just shots in the band and gradually you get a very solid piece of building material it if you can get it to the right place can be used to create a structure that's going to stand there for a thousand years so we need to do a feature on [laughter]\nYeah that's an idea of us an idea but but yeah I mean it's a way to sequester the plastic take it out of the environment without even having to recycler\nYou're listening could weekend from the b._b._c. world services Scott coming up to forty seven minutes past the hour there's been a lot of public debate even anger in Nigeria this past week after the finance ministers they not Ahmed said\nPeople should consider having fewer children or at least leaving long the gaps between the children they do have she spoke about the issue\nDuring an economic summit Boucek she later clarified her remarks by saying the federal government was talking to a traditional and religious leaders about encouraging families to think about having only the number of children they can realistically castle\nNigeria's vice president that echoed her message saying the government was working hard to reduce population growth because of the pressures of the economy according to the un Nigeria is set to add a hundred and eighty nine million to its current population between now and twenty fifty\nMany were unhappy with her remarks and those ... Ahmed the Nigerian actor and social activists jokes if a cut 'em up it's made marked eventually okay chew who said that the b._b._c. told the BBC the government should think about tackling corruption first rather than trying to get fewer people to have fewer children\nI think the best time to talk about population is when you have memorized where they count on me the truth of the matter is that\nCorruption has around staged every\nAspect of our life in ... if you have not been able to fight corruption where one two or three people getting sick enough of enough money money that can feed an entire nation this series on Sundays out of the country if you have not gotten Iraq with the economy if you have not done anything with the resources that we have\nProved to the people that come Israeli doom where how can you blame population you blame population only when all these things are in place with corruption has been reduced the fairest minimum when they kind of easing the rights Hansen technocrats professional a humbling they come here and doing the right thing\nPeople believe that when you have a child it's a lesson from the lord people believe that when you don't have a child it's a curse\nSome people even go to the foreigners off by reversing their wives sending them away just because they're not about your direct\nFrom me if you give me that jumped to do our target the main focus our target demanding the women are the ones who are the risks and who always want to make this happen and the men always on in there with the best thing to do is talk of the men and that's why I was talking about a grassroots movement\nOf the society thank you this is the b._b._c. World Service in weekend you're listening to the b._b._c. world therapists with signs from all over the turn it on the phone\nSo I Will face means ... from the town shapes that are out of town [noise] [noise] [noise] [noise]\n[noise] I'm In the day and as soon as I had that can you get caught then he fell in love [noise]\nThe D the world's service dot com slash belief\nYou are listening to the b._b._c. World Service\nWashington Porsche and he says more\nAre South America correspondent Katie ... some reports from Brazil won on your regional and just had my son is here in the studio or America's editor counter space again by telling me about\nOn air on line from march so smart speaker to BBC World service the world's medium station [noise]\nBody point seven W. M. as the Orlando oh\nBBC World service seven hours GMT this weekend on the whole ... coming up on the program ... or ... miles to the White House in memory of eleven people shot dead in a synagogue in Pittsburgh\nThis wicket act of mass murder\nHard to believe and frankly some things\nFor Ninety point at a news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that kids are lined up health dot com\nSo easily through along with us for the whole program or August ... Rajan a Nigerian writer and activist and Matthew Breen has a British writer and a journalist with Roy says that's come here and we can [noise]\n\nI'm Stuart Macintosh with the b._b._c. news hello\nFlags flying at half most of the White House and the U.S federal buildings after a gunman killed eleven members of a synagogue and Pittsburgh Robert ... has been charged with murder and other offenses President Trump described the shootings as either\nThe Jewish civil rights group the Anti Defamation league said it believed this was the deadliest attack on Jews in us history is Gary of Donahue\nThe FBI says robot bows be prosecuted for hate crimes and the justice will be swift and severe powers reportedly shouted old Jews must die as he opened fire in the tree of life synagogue and it's become clear that he was a prolific ...\nAn online anti Semitic hatred and conspiracy theories\nEven posting the phrase I'm going in\nJust an hour before the shooting took place\nPresident Trump is called the killings evil and says he'll traveled to Pittsburgh shortly or flags at the White House the other federal buildings will be a half months for the next four days\nIn Britain the helicopter belonging to the time billionaire businessman we'd shy seawater and opera power has crashed and burst into flames at less to city football club\nA source close to his family has told the BBC that he was on board the aircraft at the time witnesses say it spiraled out of control after taking off from inside the stadium assigning climate some reports\nAt the end of every home game we see so often enough profit pause helicopter takes off from the page and our off in the final whistle on an aging much last night just to say it cleared the stadium but then there was a ... is it crushed to the ground and the huge ... in Iraq ...\nPlace for Fox has now been as pays for colds and many of her main task throughout the night to investigators began that worked there still not official confirmation of who was on the cost for casualties\nA regional election is taking place in the German state of Hester\nWho's outcome will influence the fate of ... federal governing coalition\nBoth Mrs ... party the CD you into STD ... have been doing badly in opinion polls and has a while the greens and the far right to AFDC a project to make gains Jenny Hill reports\nGermany's coating it this chick south now or the destiny and what happened to have to today and they indeed the all I can and I said\nHow it's waning anti conservative getting badly in the polls at ... will be ... ... ... ... ... ... I mean in next to free food many in the pd blame that uneasy alliance with ... ... puppy in our city\nIf the policy do not really as predicted and its leaders might pronounce the condition and bring down the government\nThey see the world news from the BBC\nVoters are going to the polls in the first round of Georgia's lost direct presidential election\nThey're twenty five candidates two of whom are former foreign minister is no candidate wins and overall majority there'll be a second round in future Georgia's president will be chosen by an electoral college Mexico City has dedicated to Daniel Day of the dead parade this year to migrants who've lost their lives in transit\nAnd to those who settled in the capital alongside the traditional John skeletons and marigolds in Saturday's procession was this one featuring grey metallic panels representing the Mexican side of the U.S border\nAt the meeting in the Vatican Roman Catholic bishops have recommended the women be allowed to play a greater role in the church the month long and it was cold to examine how the church could relate better to young people but conservatives and progressive from different continents often fail to see eye to eye\nThe final document was vague on the church is actually to to homosexuals and attempts to include the acronym LGBT in the text were blocked\nThe African American poet playwright and toes arcade shine gay has died in Maryland at the age of Seventy she was best known for her Broadway hits in titled for colored girls who have considered suicide when the rainbow is enough Vincent Dowd ripples\nForty two years ago on to ... days for colored girls who've considered suicide when the rainbow is enough was an extraordinary precedent on stage in New York\nThe fact it stayed the booze theater for seven hundred and forty two performances showed taste was changing\nShown gay born pool at Williams used drama and poetry and dance to explore the role of black women in America in twenty ten a film the shoe features Janet Jackson and Whoopi Goldberg\nThat report by Vincent doubt in this edition of the b._b._c. news\n[noise]\nAnd it's seven owes six GMT you have to remember the time change here in Europe and they say this weekend from the b._b._c. World Service my name's pool henley coming up this how why young children can sleep through smoke alarms that sounds like they [noise]\nNobody favorite sound a neuroscientist we'll explain all the tradeoffs that we make as humans is to build children that basically ignore everything when they're sleeping\nBecause sleep is more important than working out what's going on and that's because we're all dependent on our parents sort of soft or\nWe have two guests with us throughout the program they are Chitra ... a Nigerian writer and activist and Matthew Green British writer and journalist with Reuters move from them very soon because President Trump\nHas called the shooting of eleven members of a synagogue in the American city of Pittsburgh an evil act of mass murder among them to fight as Robert Bowers open fire on worshippers at the tree of life synagogue during a Sabbath service\nThe Jewish civil rights groups the Anti Defamation league said that this was believed to be the deadliest attack on Jewish people in us history President Trump said he could barely comprehend what had happened\nTo this wicket act of mass murder is pure evil [noise] hard to believe and frankly some things that is on a measurable our nation and the world\nAre shot and stunned by the grave [noise] this was an anti Semitic act you\nWouldn't think this would be possible in this day and age but we just don't seem to learn from the past our correspondent\nGary are Donahue is in the city of Pittsburgh where the attack took place when I was at a a vigil\nFor Ninety point at a news comes from Orlando how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nOr a ... some like some Jewish press juice present healing and the interesting thing that struck me that was that the older people that said look we we so we should do this you know after a day maybe come back tomorrow evening but the young\nYoung members of the Jewish community she'd said no we want to do it right now we want to get out in the street and do it right now and there was a very powerful speeches for some very very young people one one I spoke to off to a young girl who severe living\nJust Fifteen Years old she stood in front of the huge group and said I'm a different Jew today than I was yesterday or two on two says under Semitism happened elsewhere\nA few months ago and there's evidence that that\nAre found in the staple of fish really for West Africa is also moving north to try those are the fish\nThat make fish meal it feed livestock all around the\nWorld that's right the problem is is that the that the fish thoughts of West Africa are being subjected to a kind of double whammy\nClimate is forcing the fish the sort of swim for their lives but at the same time you've got Chinese and other international investors turning up building these giant factories are which grinding the fish up into fish meal to feed fish farms on the other side of the world so\nI can absolutely enormous subjects and we'd go to a fantastic package of stories that go into real that from is coming out next week\nThank you you with the b._b._c. World Service or a reminder of the main news flags flying at half mast of the White House and public buildings in the U.S in memory of eleven people shot dead\nAt a synagogue in Pittsburgh now time for the sports news coming up to twenty five seven GMT and James Gregory joins us a big day had James Lewis Hamilton\nYes a huge day had folder Brett he's guiding for his faith formula one drivers title he just needs to finish sevens or above it to win the championship at the Mexican grown pray he'll stop from third on the grid than with Red Bull Daniel Ricardo on pole position\nAnd then they can learn all weekend I had a great job so really happy for him but the great fun to talk to [noise]\nTry back to the Taiwan which I'll give everything but also\nWhen I was I went\nOver there to football now livable labor tuned to the top of the Premier League they'd be taught at sixty four walls side I'm On ice called twice most Salah scored another ... Carrie also found that to our field the reds remain I'm basing that eight\nTop flight when it sends and three points Claire Manchester City they don't play until Monday and they play against Tottenham webley than elsewhere Nigeria's Isaac Success was on target as well for one three no hold his field\nUnless that drew one Old West him\n\nPales into insignificant due to the events um after the game doesn't it near the stadium\nYeah ... ... well a helicopter belonging to the island of ... crushed 'em just after taking off from the club stadium witnesses have described Seamus huge fireball the craft or up to the ground is not whether we ... I'm just lost the Iraqis family were on board\nChilling seems that there'll be updates on across the b._b._c. as soon as we have\nMore information and away from that most of the country a news story now what's to come sporting wise today\nWell the three Premier League fixtures taking place a badly hives Chelsea by sworn off no visit crystal palace in the evening game ... to take on have it's an old traffic on for baseball fans the Boston Red Sox produced is studying like rally they defeated the Los Angeles Dodgers nine six and move\nTo the brink of a ninth World Series crown on Saturday to lead the best of seven series by three games to wall on\nThe red Sox can clinch and the major league baseball ... if they beat the Dodgers at the job just stadium on Sunday and they'll play tennis action taken place shortly American slave and Stevens ... search to find overseas ending to be to be a files in Singapore\nAnd that she'll play Elaine us at ... in the final and the defending champion Roger Federer will face Mary is called pale of Romania in his waist indoors filing Basel and that's after he'd be Russia's Daniel matter of as in the seventies\nThank you very much James Greg research published last week suggests that using a mother's voice on a smoke alarm could save more children's lives than the conventional high pitched sounds that we associate with those loans\nA team at the nationwide children's hospital in the U.S state of Ohio carried out of the study on one hundred and Seventy six children they founded any Hoff woke up to a noise like this on a conventional smoke alum\n[noise] but [noise] about Ninety percent of children woke up to a voice alum sounding something like this\nWhite cop time get off the bat wakeup\nI suppose if it's your actual mother to continue to explain why this might be returned\nHi I'm off on taking all of our president and general manager of maybe point seven W MSG it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDoes your support for uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nWell all the time they'll talk show sound or smell taste your eyes even with your eyes closed on monitoring the world all the time\nAnd we have very sophisticated mechanisms from birth to direct our attention to things that are important and to filter out the things that don't and actually it's the filtering out that's more important than the direction because if we were alive to everything that was happening all the time with the overwhelmed and so\nThe question is why do children succeed to ignore things in their sleep\nWith an adult and this is clearly true for any of us who've had young children alone or others you can take them to a disco\nPractically let's say to a wedding with a pounding music and once they're asleep they stay asleep through and and the answer is that ... that developmental stage of childhood\nSleep is more important than knowing what's going on the street from Paris let's say two elephants baby elephant ... immediately able to walk around to see the difference between sites in dangerous places a baby humans all blown dependent\nSo the trade off we make us humans is that with ... unable to the cough drops elves and in that time with that early stage of development the first few years sleep is incredibly important because it's in sleep that we replay the experiences of the day\nStrengths and the connections that we've developed and lose the ones that are simple so the tradeoffs that we make as humans is to\nBuild children's laps basically ignore everything when they're sleeping because sleep is more important than working out what's going on and that's because we're both dependent on all parents sort of officers\nEssence can fend for themselves pretty much from the human contact\nNow the question of why your mother's voice is more important than any other\nIs an interesting story also about humans from before with tuning in to sounds that message to us and so the first few months of life we're exquisitely sensitive to the whole range of environmental sounds that we encounter\nThe kinds of music that we hear the kinds of language that we hear\nA very very young ages changes aren't perceptions of hold of our lives and so babies tune into that my voice is\nFrom the very young age and be on the initial period\nWas is the sound is most salient the most relevant to them so it's not surprising that this credit him in a result is a small sample a study that's just been reported find that a mother's voice is much more salient much more relevant to the sleeping life of a human child than an olive tree along\nDaniel Glazer who's in euro scientists where we thought\nWe would test a couple of human voice slums which we've had specially recorded on I'll guess chitter I'm asked you what do you make of ... which would be more effective you think his ... in your oven for when your food might be overheating your food ready your food ready\nYour dinner is on fire your tennis on fire might not do the trick messy but you know it was ... yeah I I'd be concerned I don't know I mean I didn't it comes right the idea that you'll have it on his now become\nSort of some sort of off sufficiently intelligent machine in the house which has kind of Robert soon as the implication which mere might be wearing my audience was talking to me I'm I'm getting married would you be reassured Chitra by talking oven\n[laughter] not really I find that when I have something in the oven like a Clinton nice to nominate my phone as the just the job\n[laughter] here's a burglar alarm with a direct message for both glowing true to your home\n... smile you all being filmed now gets out of the premise is immediately guest house of these premises immediately\nIt's the kind of cooked meat or perhaps yeah it sounded very um acted like didn't it forget the name of the person I'm trying to think of but um yeah that scare off to determine bugs or do you think\nI'm not sure like like like the idea of directly addressing that but let's let them know that you'll have no burglar cleats let them know that your lab that they're about to someone's house and um yeah telling them that they're on camera is quite a nice touch whether or not that's actually true in real life\nJust known gender specific books it case it's a woman intruder\nIt does happen wouldn't have been better to have the voice saying that the police I mean that would have been slightly more intimate I Would ever be a lie [laughter] well that's true it might might be some legal implications\nThat right [laughter] but you you want to buy the odds visual intelligence implications though you might be generally but\nWell I I'm I guess I I guess the idea that everything now has to be so kind of ... everything says sophisticated on a digital level that we're losing our capacity to the basic\nThings I mean I I can barely navigate around London anymore now without getting my city map around um won't bring around the street with my head bowed my screen usually colliding into someone else is doing exactly the same things that I may sound like a lot of it but I I think it's I think I think we can live without human voice Saddam's\nAs a as a teenager Chitra briefly you wouldn't have been very susceptible to your mother's voice telling you to get up in the morning or to get up there were smoking you room indeed\nYeah and this is actually my first reaction to the story that it would be good for them to actually see\nWhen that waking up to your mother's laced tens and see trying to ignore it took out just a little bit longer than that and my parents can tell you that my reaction would have been oh just another ten minutes monitoring me jumping out the hill and maybe see of it and we can we live from London\nFor Ninety point at a news comes from Orlando how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nWill face mean get matched towns have stopped at a town called ... who is [noise]\nDo I have I had to mediate ... ... [noise]\n... [noise] feed the world service dot com crash movies [noise]\nYou're listening to the b._b._c. World Service\nHow technology reporter really climb into this I asked her Washington correspondent for about ... what was in the last one to get Emma ... drawn to want to\nBe torturing them from being monitored\nOn their own line smart so this is the b._b._c. world therapist ... station [noise]\nBody point seven W and as the Orlando um\nBBC World service seven or eight hours GMT this weekend I'm whole Hendley coming up flags are as ... said the White House the memory of eleven people shot dead in synagogue in Pittsburgh\nWhere he's from a counselor who represents a district by the shootings\nRight now or the state of shock which meant for them like that in\nOur country what you're gossiping and horrible again we're just trying to answer that at this point and\nAlso the run off in the presidential elections in Brazil and be growing sophistication of sex rover saga with us Chitra not garage in Nigeria and writer and activist and Matthew Green British writer and journalist or come on we can act the main will need [noise]\n[noise] hello I'm David hotter with the b._b._c. news\nFlags flying at half mast at the white has signed up a U.S federal buildings after a gunman killed eleven members of the synagogue in Pittsburgh\nHow's he opened fire he reportedly ... to the old Jews must die the Jewish civil rights groups the Anti Defamation league said it believed this was the deadliest attack on Jews in us history and the one that anti Semitism was on the rise rabbi mark Goodman is from a synagogue near the one which was attacked\nThe entire Pittsburgh Jewish community is It's MORNING or devastated were crushed were\nLower and we're really struggling and we're suffering um but you know in addition the entire American community Jewish non Jewish is struggling with this\nIssue of this these mass shootings that less violence that seems to our country week after week without any a solution any ideas any change on the rise\nIn Britain the helicopter belonging to the tide billionaire businessman we try to see what turned to prove pa has crashed on burst into flames that less just to see football tub\nA source close to his family has told the BBC that he was on board the aircraft when it crashed witnesses say it's spiraled out of control after taking off from inside the stadium which do we try usually leaves the stadium by helicopter Ryan Bryan so what happened\nOr adults or take off state in which are like the idea for a lot about what radical within a short time and then\nThe engine block survived it made a fifth of worrying about growing up to Iraq to environment bidding wired bidding and then there was a big big firewall\nWas do we try poured millions of dollars into the club which won the English Premier League titles in twenty six team\nOriginal election is taking place in the German states have passed two outcome will influence the fate of Chancellor Merkel's governing coalition\nBoth Mrs Merkel's party the CD you and her as speedy coalition partner I've been doing badly in opinion polls while the greens and the phone right after the projected to make gangs Jenny Hill reports\nGermany's coding each Sheikh south now wasn't the destiny and what happened in ... ne ne indeed the all I'm going to knock off state\nHow is waning and how conservative they are doing badly in the polls Applebee's and a half now will be ... today and he ... he he won't be as high as ... I mean in next to free food many in the pd blame that uneasy alliance witnesses Michael ...\nIs the policy do as badly as predicted and its leaders might pronounce it the commission and bring down the government\nMexico City has dedicated to the annual day of the dead parades to migrants who have lost their lives in transit and to those who have settled in the capital the parade took place as thousands of Central Americans continued that track through Mexico towards the United states define President Trump's in treaties to disband\nThe rights group in the Balkans has criticized the decision by the Serbian governments to publish books by two former generals convicted of war crimes\nTo use the initiative for human rights had promotion off the wall memories of ... and ... which amount to the to the rehabilitation of war criminals both men were convicted aren't the international tribunal in the Hague for trophies committed by sub troops in costs about in the late Nineteen nineties\nThe African American poets playwrights tacos Asian guy has died at the age of Seventy she was best known for her Broadway hits entitled for colored girls who have considered suicide when the rainbow isn't enough than some times reports\nForty two years ago ... for colored girls who've considered suicide when the rainbow is enough\nWas an extraordinary presents on stage in New York\nThe fact to stage the booth six or seven hundred and forty two performances showed taste was changing shown gate ... pulled it Williams used drama and poetry and dance to explore the role of black women in America\nIn twenty ten filled the shoe features Janet Jackson and Whoopi Goldberg\nAnd Australian police officer has successfully resuscitate you the kangaroo after it nearly trend in rough waves of Melbourne safety beach officers coal to the science center they found the most to peel had invaded would be rescuers and helped back into the sea they said the creature was struggling with blood from coming from it's a matter of\nThe country was unconscious when they try to shore but recovered after being given compressions racist from BBC News\n[noise]\nAll over the age of six GMT this weekend from the b._b._c. World Service in here\nFor the rest of the program Chitra ... a Nigerian rights and human rights activist and British writer and journalist ferocious Matthew Green one in Lagos and one here in London my name's pool Hendley\nNow are coming up American prosecutors have broad twenty nine separate charges against the man that cute\nFor Ninety point at a news comes from our land out how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nSoaked rifle and pistol at least two of them and opened fire addressing a Republican rally for young farmers in Indiana now President Trump condemned the attack\nThis wicket act of mass murder is pure evil [noise] hard to believe five\nAnd frankly some things that is on imaginable our nation and the world are shocked and stunned by the grief\nThis was an anti Semitic act you wouldn't think this would be possible in this day and age but we just don't seem to learn from the past ...\nLate yesterday evening we'd go through to Cory ... who's a counselor for the district of Pittsburgh where the attack took place\nRight now or the state of shock we've seen incidents like this\nCountry which is gossiping and horrible and then when it hits you at home so surreal stealing and we're just trying to the incident at this point and you know work with that community on moving forward supporting each other\nSo what's the neighborhood like [noise] it's actually one of the most\nDiverse in the city of Pittsburgh we have all ethnicities all religions all backgrounds\nAlways say that scroll hill is a melting pot from where this shooting or are we probably within ten blocks maybe Fifteen blocks there's about six more synagogues as well as churches\nAnd four or five blocks from our main business district that had\nA couple hundred shops and restaurants so it's a really close knit community and that shook us all off today\nIt's our residents dealing with the shootings\nWe've had a couple of visuals over the past couple of hours actually it was really nice that a number of high school kids stood up and said hey we're all gonna meet here and there had to be\nProbably a thousand residence came to a corner set some ... some candles had a couple of song and then an hour or so ago some residents showed up at the synagogue again as well just outside\nFor I think you know when will election results be known it's the final round today isn't it voting today\nYeah so we do either trying to keep voting so we might know the results are very very San\nLuis federal show of BBC News Brazil thank you very much for joining us here with the BBC will service and here's a reminder of our main news headlines the south\nI flags flying at half mast of the White House in public buildings in the U.S in memory of eleven people shot dead in a synagogue in Pittsburgh and a helicopter belonging to the tire owner of Leicester City football tapas crashed here in the u._k. at the team's stadium\nIt's on now is approaching twenty minutes past H. G. M. T. to introduce I'll find them on the program today I'm going to turn to the American soul singer James Brown\nI don't want to get into it man you know\n... machine doing it you know\n\n\nMachine\nJames Brown was Ninety Seventy hit singles coming into the sex machine what James Brown would have thought of today's world\nIn which sex machines were actually available to buy is anyone's guess you see the link or he might have been intrigued by the fact that sex robots Brussels\nHave popped up in some cities on this subject is fair to say that science fiction films haven't inspired optimism from the Nineteen seventies the step for the wives where ambitious women are transformed into do style husband pleasing automate\nAnd more recently the British movie ... which are female robots stabbed in the city is create to the city is having used that word for a while to death\nSo robots are going profoundly to change our lives and all sorts of ways but how will they affect on sexual behavior\nChildren after the room perhaps and slides health warning Kate Devlin is a senior lecturer in digital humanities at London University of King's College and she has the answer to everything you've ever wanted to know about sex robots but were afraid to ask a new book\nIs called turned on science Texan robots and she joins us in the studio welcome Kate morning go quite positive about sex robots aren't you\nEither way I mean I think there is the tension for technology to help us relationships to help us with intimacy and tipping pleasure to people but whether or not comes in the form of the currents extra votes is another story what's how the cover insects ... there's really no to any we ... we kind of have one in ...\nFor Ninety point have the news comes from Orlando Health to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com\nAnd that was why it's so different from a blow up love so I wouldn't say blow up because he thinks it quite expensive um they ... up with a [laughter] it's probably up with a little too early matter\nDies of dollars up words to buy one of these robots um five thousand dollars up words if you just wanted adult version they're made out of silicone they\nAre um sculpted they are they are kind of think it works of art and but they don't look anything like humans rated\nOkay we're going to dispel a few minutes in a moment what do you make of the concept Chitra very briefly of the sex robots before we go on well I find it really striking\nThat human beings can do all kinds of things with technology and this is why we put a ethics\nRice infects robots kind of feel ... and you know divorcing the sexual act entirely from feeling comes with risks or does it\nI don't think it necessarily does we know that sex toys for example have been around for hundreds if not thousands of years the difference here is that the current form of ... is a humanoid form that's that's the problem because it tends to be a very productive stereotype of female body\n[noise] and and that's the problem why are we talking just about the female body on the robots for women on the sex robots for gay women\nNow are not yet there are not yet at the ... version of a sex or will it tends to be I'm straight men that are buying the robots that doesn't\nVenturing because on most sex toys bill does which suggests that big to the classic lead on would be a you know deal do based sex Robles notoriety so\nEssentially there's something else here and I think there's two streams while the two lines of developmental one is the sex toy like you say this is being things like the lives of my readers around for years on the other is the ... and the sect still has always been a fan in the market for mind\nOkay entitlement and a firm in in in sexual to you know this is an area of the rings huge alarm bells\nUm the compliance ever willing female figure is in policy isn't it in the form of the passive sex do which takes what he's given to it it it it's offensive to many people on all sorts of levels\nAbsolutely I I'm not something we'd be fat by sigh fight on the air is this fall and of course which always the hinges on a dystopian plot where the the woman gets a bag of potato and the female robot uh takes over it is a threat to ... I think there's a\nCertain power levels is with real life ... not fear a but yes it is it's just this past the female form that we have and I I strongly half kept me from your wife not because we have technology that could do wonderful things in terms of\nHelping relationships them in terms of bringing pleasure and it doesn't have to be in this form\nIt's open field for questions Matthew\nI'm tired of mothers to venture into this minefield will have to admit pull when I saw that this was going to be a topic of discussion it just before I let you in the morning but K. I. average don't shy away from our nurtured by my has raised sitting at\nThe table can you tell us how you go into this topic what drew you to this you know I wanted to address that question but I thought it was to route\n[laughter] well I mean it's a fascinating subject area um it came in by Randy from a sitting up in a pub after a conference on cognitive systems talking with a group of colleagues said what is it a bite develop have symptoms that could think why or why why why repeal this effort into creating\nA ice that half human like traits we have very specific traits that changed the way we think\nAnd sexuality is one of those it affects how we how we ...\nIt's kind of a fundamental driver to humans because\nThe the whole point is whether we like or not we want to replicate our our genes Chitra\n[noise] yes I mean we've touched on this slightly already by one in ... I went to the mall or we don't want to read about one six robots would mean for human sexuality particularly given that as we mentioned already designed by men Forman says Gen did straight man\nWhat are the implications for women especially when it comes to attitudes about an agency consent and rights\nAnd and also linked to that is not perfect and allergy but when you look at pornography then up to kill the racial stereotypes um that uh I put fluids in pornography as well\nAnd I'm just wondering about I guess the the race and gender implications of a move towards um sex robots I left the Yale ideas Kate\nYeah that's right I think it's very problematic at the moment it's very much a male straight while I'm ...\nI'm a last word has her normative so the idea that people um are in relationships are straight on on monogamous and I'm featured gender in this case um it's it's a month and a woman and it's it's a sex that evil speed is of China [noise]\nUm I think that that sounded problem I think um we know that that's all the old stuff he made the sex all that we have today all tend to be in this um\nSalmon I type of sexual form and they all tend to be why does rile on whether they aren't where there there are all the different skin color they are as you say they're kind of exhaust sized um this is problematic on and I think that we do have to really address stop and look at new ways of doing these things I'm just a check or are we at the technological\nStage of development where robots can really accurately imitate a ... not not the other problem we're very very bad at making human like robots which was amazed how sexy can they possibly be wow ... ... it's a kind of the nation I think it will stay incredibly nice for quite some time but we\nCan can you know integrate virtual reality now these the I mean showing the technology is changing so quickly that office official intelligence as hyper realistic veal I mean\nThe fries on or at least if I can talk to you convince me not facility so they had these are not in the mood give you a bit [laughter] this robot these\nRobots have personalities that are being developed that you can carry around ... app on your phone tablets you have a virtual girlfriend in your folks they're working on a meal version as well partly um so I think that's that's probably a more realistic convincing human than any robot what's\nBeing reception fuel bookcase oh sorry to a quick point realize you're going to\nSay just you know he makes me I'm wonder why people need vet she'll go for it\nAnd whether it is is is there to say something about the people who had boyfriends and girlfriends don't let me let's be honest it's not boyfriend but she'll go friends that were talking about and does it say something about masculinity\nI'm In an era that you would rather have a vet she'll golf and who doesn't it's not a real human being with her own ideas and soul mate ... ... ...\nYeah I think that's probably about it and I think it stems from sort of the ... the idea that women are the emotional gatekeepers and so we of course you know we are able to go out there and and bomb socially but perhaps\nMen have more problems with a K Devlin all sort of turned on south science sex on robots many types of coming on the program big thanks to August ... Lagos Matthew Green here in London Thanks to you for listening and joined the rest of your weekend by by for now\nAnd installing this happened to ... I have my ride is Florian ...\nI'm a professor of terminology\nThat says University of tubing in and in the at the cutter Leno's bitter cold\nDry and what's ... what's your name\nWill you onto plays a ritual employment under the ... of patients completely blinded by rich and not to speak much closer to roost or some kind of vision\nWe'll say my menu out the day before his saturate at the hospital and it's like hey man you al is in his early twenties while I was six foot tall\nJustin ... he's looking quite relaxed but someone just a few hours away from eight to saturate century that will take Florian and three other such ends up to nine hours to conflate\nBruce Willis I'm feeling good about reading the doctors have explained ever say really well we'll do\nA story and tells us that you had ... and um I just wanted to know more about what happened\nOh to um ... when I was about nine years old I started to notice that I couldn't read the boarding schools and the next two years ago really bad for a ...\nOff of them will be vision that went from about eighty percent down to four or five percent of your books or the local news\nWith your vision now how much can you actually say is that any science\nTo or is it just last\nMonth you know as long as I can see the difference between life and dog so when it's Bryce outside I can still see that and I can see things as sort of shutters that like whole makeup well they also\nRecognizes ... is one of many diseases that damages apostrophe I called the ...\nThe right to not contain many many different fields and the first layer of\nFunction is a photo receptors so their life goes through the cornea through the lens through the original and then it's the photo receptors in the photo receptors\nTurn the lights energy into electrical signals and these electrical signals\nAre transmitted through the optic nerve to the brain and the ... can replace the photo receptors by photo diodes like solar panels but very tiny\nOut what actually is the ... what does it look like do you have one in fact that\nYou have to look out over there and that's an actual that that's a that's rational side yes\nAnd it's like a computer chip made from silicon but three by three millimeters contains one thousand six hundred electrodes and one thousand six hundred micro photo diodes which is a measure the amount of flights coming on to it and the rest is a connecting lanes\nI wasn't expecting the chance to be so tiny it's amazing how some things so to mold can bring about such a big change for someone\nTo a ... year which is place behind the year\nThe other components if the check is some wiring the wind sits White House to vi and behind the air from habits palate wind the fleet from a battery pack that mind you all can carry around with him\nI was almost it was one over ... pretty hard to be all that but in the back of my mind all the way that it might not work on purpose and so I'm hopeful that although I Know it might not what it was only ... who was on the slum crumble\nFishing behind might as well as his mother and tear on like manual out\nShe seems on edge shifting around and has said like she couldn't get festival of course a very very nervous the clear\nAnd how are you hoping it will change his life\n[noise] [noise] I Hope he\nCan see a little little bit more for him is that a great great hope\nFor tomorrow for this the\nWell like I catch up with some are mourning and the ... century by uh we've just wish you good luck and I have a good night's sleep tonight looking for things you tomorrow morning\nMhm [noise]\nHis anatomy style again and a half a manual saturate it's about how stuff and at the moment and we've just drives pricing pass\nAnd that would just like ... to come and help us get changed and he's put scraps on so that we can get into the face with things despite his parents and that's really excited as ...\nHe needed to get ready for the surgery to changing instead green scribes than crux phosphate grammar and I taught a habit checking into hats and lost to go along with face masks [noise]\nTax on my new out before and he went and but it's ... and he has already been and so he thinks\nThe bar for Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that she's darling do health dot com\nLung south of that kind of go in with my new out into the things I said I pay three in the building and that way since the ... and has the whole thing and not just this last obviously that got to be assisting [noise]\nWe have to go to the sub retinal space to the space under the right to know and then we'd be touched the right to them\nThen we found him slumped until it is under the phobia which is the region was to a higher visual acuity that's where we're going to have the drive in the center of the British and to\nBe less sorry into and went to find ... [noise]\n\nAs we begin casting anti his face compose electoral how science wedding up\nOh I I feel a very very nervous\nTire little bits of sleepless nights and that's good yeah so we have played them\n\nHe seems very today I mean\nVery a\nDozen other than they were for now the U.S came\nSavings and he's getting positive\nYeah okay thank you [laughter]\nI'm a little bit nervous [laughter]\nYeah it led to that we really have everything ...\n[noise] [noise]\n[noise] hello Hi sorry in how you doing Hi how are you he had we not to ... how are you I'll steal science to nine hours went to ... yeah five great strength [laughter] how's menu al\nHe's fine today the size of course that's some small bleeding but for us it's a very good results what\nComes next what some acts that\nIf you will also good for maybe another\nBut he can go home and that way for heaving protests and the and it will be switched on\nYou are listening to science and the BBC wound seven\nOh and my question was about ought to be should we shouldn't\nI bought the camera and went on during a question from hunting in India ... investigating the latest technology helping blind people to see and\nI have such a lot on the Internet and elsewhere but I didn't get any details about optics we shouldn't be ...\nPlus nine year old is recovering we used to be in that at other times that can restore vision and blind because ... is life changing it anyway so nice to have a damaged retina\nAnd many other ways in which the visual system can malfunction Mohammed mentioned cameras just and he had been used in the usa semi parties that grass about investigating\nHi Hi how are you I'm good how are you a good things can I introduce you to present type up a he's a famous name Hi how you doing good how are you right if we can and just stop I can get used to in ... south and that type of the fact that the the fact is I'm sure I'm\nDr ... and associate professor of neurosurgery at UCLA\nNineties Podesta well fast and yet they yeah they can you tell me what happened [noise]\nSure this is work that's been a collaboration between UCLA and a company called second site medical products with a goal towards developing a prosthesis or a brain stimulate or to try and restore\nSome form of vision to people who are blind\nNatives brain and found a very very young young infant tiny handful of patients that they knew something\n\n\nThey sued the b._b._c. World Service with the story of a U.S cities deadly drug seeking epidemic Louisville, Kentucky has twice the national average of doing that\nI went into the bathroom and then he was lying face down before it's the talk of what the movie actually twice this is the issue about times in part to everyday Americans we look at how the Trump Card [noise]\nFor Ninety point at a news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care\nIncluding nine hospitals and emergency rooms and urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nAre South America correspondent case he wants the reports from Brazil won on your regional editor for my son is is here in Studio or America's editor campus began by telling me about\nTheir own mind smart smart speaker to BBC World service the world's meeting station [noise]\nBody point seven W. M. F. the Orlando\nOoh well can outlet weekend on and then he went today the ... back\nAt just Seventeen piano or yellow was forced to marry into and it totally is criminal family on the Italian island and he\nWas like cleaning one of dentists circles of Hal Hal owners\nThat after them with method she became a police informants\nI couldn't stand the idea that my town with a ton of weight does or friends I had had enough of seeing people killed\nIt was a decision to having to heighten\nI lost my name out of contact with my family I Know everything I couldn't go to a crowded place she could make new friends I couldn't trust anyone would wherever they may say\nSaid why after twenty five years so she decided to show her face in public for the first time the true cost of standing up for what you believe in after the knees\n\nAnd I I'm David ... with the b._b._c. news flags flying at half mast at the White House another us federal buildings after a gunman killed eleven members of the synagogue in Pittsburgh I see open fire he reportedly shot to the old Jews must die President Trump described the shootings at an evil\nCampaign has believe this was the deadliest attack on Jews in us history his Gary owed on the Hugh\nHundreds of people from this community came to grieve to come for one or not I mean I chose to\nSpeak up some just to stand and remains Saddam's still in shock disbelief over the horror of what it takes in place of the religious hatred for the seemingly motivated the killings\nBy Bob and issued a horror washed out here to be with everyone else [noise]\nUsually I say get her to my friends that has a different meaning down and the community [noise]\n\nLittle from without election campaigning in Illinois announcing his intention traveled to Pittsburgh\nIn Britain had comforted belonging to the tide billionaire businessman which I see what turned approved power has crashed and bust into flames lasted the football cup a source close to his family has told the BBC that he was on board the aircraft when it crashed ... Davis is from electricity supporters group\nPlay investment as if it was just a phenomenal we won the late because of families not just the things with them as a community that things are done with the locals to hospitals\nThe sons you know they used the phrase points on the guy in the ... has been well publicized but they just stopped so it's nice humble faithful and yeah it was just such a tragedy to\nThe speaker of the Sri Lankan parliament\nAs president my trip Potter series than us to reconsider his decision to suspend parliament saying it will have the risk of undesirable consequences presidents series saying assigned to Mr ... on friday and replaced him with the former president mind ...\nOr Southeast Asia ... Rajan reports\nIn a letter to the president the speaker ... writes up all street Lincoln the MPs including the ousted prime minister on ... should be protected in the context of the current political on constitutional crisis\nYou know shock move President's Day to stay in fact Mr ... on friday and replaced him with the former president mocking that I ... the speaker also pointed out that the forcible takeover of state media by supporters of Mr ... will have serious international implications\nPeople in the German state to pass a voting in an election that could decide the future of chance to the ... federal government a Christian Democrats and that coalition partners the SP do you have been doing badly in opinion polls while the greens and the far right after the are expected to make gangs\nWill use from the BBC\nMexico City has dedicated his annual day of the dead parades they shifted migrants who have lost their lives in transit and to those who have settled in the capital\nThe parade to price as I was in the Central Americans continue that track through Mexico towards the United states defying President Trump's treaties to disband\nBrazilians will vote today in the second round of the presidential election they have a choice between two politicians with very different views the far right candidate ... both in our group um and undo died of the left wing workers' party case he wants to reports from Sao paolo\nIf the polls are right it's an action as Mr both in our cities\nHe's got you know I don't the hatred towards the neck wing what party with is found a new to the silver in jail for corruption he's painted the policy is responsible for Brazil groaning vine and economic was and political ground\nOn Saturday rivals down to her dad warn voters Mr both an hour is proposal and bombing Brazilians with any increased crime\nHe's the border the done can\nThe hungry for change and believe Mr both knowledge didn't read but he's open their mind to countries form a dictatorship and they haven't said making racist comments and many fish it'd be deals young democracy with as far right populist in\nCharge after meeting in the Vatican Roman Catholic bishops have recommended to women be allowed to play a greater role in the church the Muslims to know it was cold to examine how the church could relates back to the young people but conservatives um progress is from different continents often failed to see eye to eye\nAnd Australia and police officers have successfully resuscitate you the kangaroo after it nearly drowned in rough waves of Melbourne safety beach officers coal to the side on Saturday side the creature was struggling with blood and frost coming from it's a matter of\nKangaroo was unconscious when they try to the shore but recovered after being given compressions my sergeant Christopher ... and that's the right to BBC News\nNew\nPiano I spent years in her life in the shadows\nI lost my name I'd of contact with my family I Know everything [noise] I couldn't go too crowded place she could make new friends I couldn't trust anyone wherever they may say [noise]\nShe had to go to extraordinary lengths to keep ... identity secret crafting a wild ... even had to name her real name my daughter asked me mom who is this yeah yeah a little it began with a teenage boyfriend a boyfriend for an entity Italian mob\nIt was like leaving in one of the circle of hell\nIt resulted in piano becoming one of Italy's top ... informants which many enemies the police where we need all the time twenty four seven [noise]\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that to Orlando Health dot com\nDay the fallout standing up for what you believe in on the Web and this is out this weekend the mafia bride to fall back [noise]\n\nSaid yeah the Seventy thank you very much for joining us I really appreciate you speaking to us [noise] okay\nYeah I yeah I Know it's a small village in northern Sicily in the ... province growing up in the Nineteen seventies life was in\nMy family is a very humbling on his family initially we say a family of bread and oh onions meaning we were poor but generous\nSimple until she was fourteen years old and started dating a bully ...\nWe've linked with them but I Want a lot of the beginning was like an everyday teenager reminds boy meets girl Florence debate\nAt what point did you find out what the family he was from\n... ... yeah\nWhen I was about Seventeen years old a person from my village said to me do you know what do you call those family out of my ... I'm a very direct person so went straight to Nicholas fodder and asked him why people in the village said to where my ...\nHe tried to dismiss it saying it was a very respected men and because he had many interests people will call him a few although\nI did buy what Nicholas father had told me I was young but I wasn't stupid [noise]\n... [noise] the reason that was really worried the era was the ... and reputation\nThere in organized crime syndicate renowned for them ruthless treatment of enemies and for power structure that relies on the left on media a family hierarchy whether relationship between a father and son is ... important as is actually my family loyalty\nThat know yet I don't know ... someone we could trust completely\nHe was always there for us especially at the beginning when it was easy to get disheartened scared it was an amazing relationship\nYeah and we had been told that their lives are in danger but the reality of that situation hit them when they were watching TV ONE Sunday afternoon in Nineteen Ninety\nTwo [noise] that'll be setting up what would what did he just said I think that's what he got ...\nShow was interrupt you end up with him you flash because\nThe ... does have on the machine duty ship out of what Cindy naughty muscle cheese in it as soon as\nThey said of bone had exploded India demand in ... and ... had been killed\nSatellites that are devastated it was like losing a father\nThat moment would even think about him is a famous ... a judge we mourn the loss of the amazing human being you being\nGenerated so you never knew Fisher for we're looking after us for actually very understanding kind they suggested that would go back to the city to spend some time with my family in a protected area\nPierre and we were about to leave but at the last minute retake cancelled and state behind\nA little older I left on a Saturday and Sunday I was told she killed herself\nReturn it had written a suicide note it said Bush Lena you die for what you believe in without you I Am debt\nWith that she threw herself out just a window of death seventh floor apartment\nShe was just Seventeen years old\nAnd\nShe couldn't stand the idea of loosing yes another important person in her life\nShe had lost her father\nAnd when she decided to join me and filed charges\nHer whole funny even her own mother\nI was there for her of\nCourse but I wasn't enough\nI couldn't replace or the low she had lost and when ... was killed I think she also Los face in the justice system\nIt set it off to read to suicide her mother took her to stand with a hammer but the evidence she gave still stood before high death three dead named the big mafia bosses given details about the mafia wars and also named the man who killed her father and brother [noise]\nAnd had death didn't stop ... eat that she says that ... own evidence led to the arrest is Fifteen to twenty Matthew amendments that with those around the threats on her life increased\nOnly twenty five you had your daughter that you didn't have any friends or family around you us living in hiding you had a fake name a fake identity\nFor Ninety point have the news comes from Orlando Health to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that to Orlando Health dot com\nFinally I lost everything the couldn't go too crowded places could make new friends I couldn't trust anyone\nThere was always a chance that could be criminals I often did you have to check in with the police\nLieutenant they well they became part of my family is often\nEspecially it at the beginning the police were with me all the time I did for seven so every time I left the house to go to the doctor the dentist doesn't for market that has to be there\nIt was when you were living in northern ... that you will see started a new romantic relationship [laughter] how did you manage to do that when you were living with this fake identity\nIn order to start to go for it wasn't easy that's all\nTrying to explain this whole situation to someone who needs the the normal world and wants to get close to use twice or difficult task this man\nWas really determined and I didn't like that our relationship will be based on my life I have a person the oldest ones to tell the truth even if that often means losing a person you love\nSo I decided to tell him everything even if I knew that was a high chance would lose him\nAnd his reaction was like it did you not to pay you off to that the old uncle\nYes when I finished telling game who I was uh told him if you want to live no don't worry I told you to understand I won't blame you at the end of the day it's not unusual to tell such as towards your date but he said that if up until that point you'd liked me from then on he would like me even more\n[noise] so they got married and had nothing to do to a daughter who didn't know her mother secret until one day last year\nYou know I don't I don't know that's what I was when my daughter in the Arctic death tickets worst or all my paintings\nThese are the paintings that piano did that when she was married to landscapes and sea skates who signed with her name she they would have done all my\nMy daughter asked me mom does get a yellow and that's when I decided to tell the truth so I told her\nI had done those paintings as a young woman and I couldn't hang them on the world because I couldn't show my real name I told her and everything about my life and I told her who I was and very mind she knew me under a different name on the way the\nAtlanta a few months later when you put you if you came up to run for parliament took too much time in about ... my husband was a bit worried about the consequences for my daughter was the one who said I think mom should run she'll have a chance to talk about truth and justice to a wider audience\nAnd should be able to shore facing public [noise]\nEver since she didn't fool not piano had been trying to find a way to continue the work of ... and Rita\nSeventy thousand in Seventeen with the support of her family she decided to run as a member of parliament she added her real name to the candidates lists that she still didn't show her face how did that was\nWhen they start before she was an easy at all because you know ... to ... but I took the risk\nI run as an MP in the top and he probably in the same constituency went ahead to region they filed charges and TV interviews and public debate or would wear a veil of my face and my campaign leaflets only had my name on them no pitcher but then when I met people face to face I did show my face\nAnd I would ask people not to take pictures of me\nTo instance during a rally in February but one of the campaigning politicians were filmed giving speeches except for the era that when it came to the camera was we looked around pointing instead at the audience\nOr ... and it was amazing how people respected my request they never posted the future line they told me that I really admired my courage and my decision to pull myself out there I promised that if I was a ... a which my facing public [noise]\nOn election night the results wrote in and the piano and it was trying to\nPeople from all over the region people affected by years of Matthew control came out and voted for her in some places she got Seventy percent of the vote and with a victory she decided to keep that promise\nFor a few months later I I decided to show my face in public for the first time\nIt was during an event Tacoma writes a kind of been yeah they were being killed by the mafia it was my way to say thank you to the people who had voted for me and also to the police force that have been protected me my whole life\nLasted that reveal a righteous uh one of the country's ... newspapers wrote has they should become a reminder to all the on his men in Italy a reminder never tobacco that had the piano and it was a name and to remember the people he didn't make it\nBy the ... you know every day is seeking parliament I think about\nAll the amazing men and women who have been killed by the mafia\n... editor of via being an MP is my way to honor them and to make sure that sacrifice most of the same vein\nYour whole life in a way has been shaped by that marriage you had to Nickelodeon when you were so young how how does that make you feel when you look at your life now she is like I read the rest of the big\nRally yes you're right my life to these direction because of ... to me but all of these Spain and all the sacrifices I made man that I also got a chance to meet some amazing people and so many others who helped me I don't look back any more I only look forward\n[noise] [noise]\nThe problem as I say enough yet hasn't gone away early this year there were twenty two arrests NPR's province positive benefit to track down the current enough yeah king pin to Pierre at this means that she still lives on the constant police protection\nBut she's decided to live with that being said every day she meets\nAnd then there's just a public with an uncovered face and greets them with her real name\nPierre ...\nThank you so much piano thing\nThey think you're right now I ...\nOn ... and you've been listening to outlive returned the mafia bright he's full back [noise]\nAnd then there were the digital people looking at ... phones will clues married in the ... of household appliances\nBritish politicians have just been hearing about the role of digital forensics as possible while he's a parliamentary investigation into the site of forensic science\nOne of those reporting on the competing SARS ... head of the digital forensics unit ... crime field university just outside London Michael's with Sarah offers you'd be speaking to the politicians and I want to learn more about the kinds of investigations in which she gets involved\nIt was a suspect buying the case and it was a Robin you washing machine way you could control it using an ...\nSay we went off to prove whether the suspected actually hit the button on the washing machine physically and that was in the building or whether it's a way using the app on the night of fighting and if they will use and I was the fighting in the house who was the ...\nSo that does this mean going through records from so fucking towers\nYeah so we're looking for more information on the line about whether it was connected to why if I had to take any pictures or is there any like patient dies on the find\nMore information could you pick up the washing machine itself\nSite restoring when a sad thing had been pre set say if you set your loans rates be washed it say five AM you could get that information I Wonder if they useful things are able to get was you could tell ... washing had been sat on via the Boston or not from the washing machine itself where\nIs that in the washing machine guns just within the smart grid prices that you can download the title\nYes that that's a small dates check which we have to remain on then report on to a nice ... four to eight to check\nThe number ... ... but it makes them see that this would be a particular manufacture I'm sure many of these systems are quite proprietor you I just wonder how how you even have a ... D I used to fall because it must vary according to manufacturers\nSay that's a nice ... digital forensics it makes competing say much more fun you're looking at a puzzle and trying to count how each of these devices wax on how each of them still safe to say it does involve a lot of\nPlaying with the device and try and different types of activity until Patton stop too much and you can then walk out I had this cat and appears to me that the devices on their devices cheese and from that translate into something meaningful\nSo is it a bit like CSI were you have the washing machine you take notes you alive you're wearing a white covered everything of course is completely ... everyone's incredibly attractive him up and then you've got like a computer that suddenly list of ... and then somebody presses a button on a big green light flashes saying it ... it must be definitely like that and\nI said ... ... some fortune at age ... computer geeks and ... days that we read that I Try and washing machine again and again with different cycles and try and get with a sigh and\nTrying to find connects to the like Hawaii fight the washing machine was on trying to find a way from the device not and why\nAnd each time just looking at the day though it was still hold\nThe data itself comes out in binary for map on from there it's just a nine year old case is going three and physically ... ...\nWhat was the outcome of this investigation around the washing machine\nSay we're able to say that if I was ... and I was on site on not helped to shy is that the suspect was indeed involved in an instant\nSo the suicide of this that is the ... investigative it's computer scientists forensics in action and what I guess be quite typical of the many investigations and what you're going to vote\nYes but I Love the investigations are they called in a department as well as the mall is like device says something unusual all I really tricky binary format they haven't seen before and they're looking for that ... re such to a three and try and translate that into something that can you\nGive them that much crime and you know digital crimes scams especially all global in nature what role can you as digital forensics expert supply and hoping to get some ... some of these scams for instance\nThat can be really varied depending on the nature of their devices involved but he usually if we've got a device say the victims device you can find quite a lot of information about the day so that we received\nFor example when people are on Facebook\nYou can see a lot of the people have message Ga Hays how ... they said it might not be able to get it all back you can get really good indication of what happened and it's about making people laugh that even if you have an ... device it was sent from the syllabus you can get from the other device\nSo people and ... and a lot of what Sarah was telling me especially the geeks and for these things that reminds me of because of white ...\nWhite if this is a form of attacking and this guy talking for good to attract criminals and so on who are always really struck a ... in many ways about these digital trials that will leave and we use washing machine now like a lot of what\nIt is it's ... left everywhere and on the Internet to things things that angle which is wet this small washing machine go this suspect but also even about science GPS tracking when we use our credit cards and what we're talking about is actually a recognition which she can\nCost out I was at anyone's life and see what they've been doing heavy wet and also who they may have to match where they ... they were doing with a bean who they were with excitement get ... but I think you know I think I actually I think not to make it makes you was one of his novels in two thousand and three\nFor Ninety point at a news comes from our land out how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six ... more information is that she's darling dollhouse dot com\nMatt ... which they stay in this case is brilliant because it's catching criminals that of course we know this could be ... ... ... am against any of that I saw in the wrong way and the wrong people can get ...\nWell yeah that's not yeah flip side if you ask but increasingly we all kind of trapped in Mali said story of my [laughter] ... yes\nYes we are glad to be on some gives them the cuts may as well the thing that that stuff is happening [laughter] I'm right vision for the mask I look at if you were talking about ... it was meant to failure was made regarding in that direction and this is a drug\nThat flies liken infects so it was my roses on this one but wings flap blocking fly instead in ... in the Netherlands I have a price type and it's called the ... ...\nA nimble it certainly is capable of rapid climbing and dissent and Arab project ... times the devices significantly bigger than a fruit fly with the wingspan of just leaving says he sends me too is\nGetting some wings to flap with enough force to maintain much especially like to be laws device well that must be quite deceased so why not just put some relatives on it like the drugs that you see flying in the ... well ... kind of sect of ... University of technology has been describing the insects inspired driving\nYou can imagine it as a robot it has a central body and then for links to on each side of the robot and these wings unlike in an airplane there are not fixed but they are actually fly think there are beating Seventy times per second and this has to keep the robots in the air so the weeks they produce lift forest that carries the robot\nNot only that we control the we motions off each wing individually and they served for control of the robot and this is similar to what insects arguing\nInsects also modified emotions so that they can steer their flights\nLooks is the actual mechanism for dropping the way\nWe have to use ... ... we have to then transformed is a rotating motion into flapping by a transmission which is a small linkage mechanism\nAnd when I think a human made wings flapping machines and this is an awful thing to say but I'm infringing those old CPA Italians movies of beef disastrous flowing\nContraptions before in the end we just ran for propel us [laughter] why exactly what you're essentially making it very hard for yourself what's wrong with the good old guy\nThe difference is scales of course back in the days people are trying to fly by flapping wings but does swing swear very large there are very heavy we needed a lot of a power just to move those wings but we're working with much smaller wings much lighter wings the smaller uh get\nThe better the power after she should get to\nSee you can end up with something that is really quite as oil and you know you just to give the Arab optics that you see it a free flow of oil and he kind of flight to fool me when you Troy smoking them how do you think this is going to plant will use is\nNot what we use the the robot for insect fight research because the robots flies very similar to uh fly that's let's say a research ... application the robot itself it's actually already useful in the real work stuff it's going to carry a camera\nSystem for example it can send images to the operator and you can imagine tasks like observations are explorations of a difficult to reach places\nFor future we can scale these robots down and they will become even more efficient technology will improve will be able to make these robots smaller and smaller than we would like to upgrade them not as a single unit but as a swarm if you have many of those for a ... for example\nYou could think of applications like a robotic pollination in greenhouse it\nI guess we have the problem that these are dying out we didn't know exactly why robotic pollination might be one of the applications\nGet involved into believing that thank you so much Joe ... who is being used in Seattle I'm Karen Michel and we'll see you next week by by\nYou're listening to the b._b._c. world therapists with planes from all over town it on their son\nWill be the last time we stopped at a town called ... [noise] [noise] [noise]\n[noise] I'm a gay guy and if I had to get ... ... ... [noise]\n... [noise] the D the world's seven dot com crash movies [noise]\nYou're listening to the ... who will have a\nWashington Post at\nOur South America correspondent Keith Watson reports from Brazil won on your regional Mike founders he's here in the studio are America's editor I can understand the gallon by telling me about\nTheir own mind on my mind because they did the b._b._c. world the world\nFor Ninety point have the news comes from Orlando hell to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that to Orlando Health dot com are\nAlso waking up to spiritual technologies that route is back in our center\nNearby bushes life is a lens on that story she helped bring put him to the west in the Nineteen seventies and she helped create Google Search inside yourself\nShe concedes that meditate or can be as narcissistic as any of us but she also reveals how the magnetism of meditation is activating contemplative impulse at the heart of many traditions and in the thick of modern life\nWhen I began to learn various contempt litter spiritual practices meditation younger and so on\nI realized that when I loved about it was and they help you get calm clear open better able to hear what it is I'm supposed to be doing this my life and then doing\nI'm Krista ... and this is on being stay with us [noise]\n\nLive from NPR News in Washington I'm neuron the man accused of killing eleven people in Pittsburgh synagogue yesterday will face multiple murder and hate crime charges six people were wounded the suspect is in stable condition after being shot NPR's Quil Lawrence reports the neighborhood is in mourning\nEvery congregation prayed at the end of the street where police still has cordoned off the crime scene at the tree of life congregation Jason Cooper was at a synagogue nearby on Saturday morning which went into lockdown when news of the shooting spread\nOr takes one person was a you know the one who is one crazy versus was the right word for it and they give you the\nOr is it a small community everyone would likely know a family that lost somebody the Anti Defamation league has called this one of the worst attacks on Jews in American history this year the ... mark the biggest rising anti Semitic attacks since the organization began tracking them in Nineteen Seventy nine Quil Lawrence NPR News Pittsburgh\nPresident Trump says he plans to visit Pittsburgh soon and has been in touch with those the mayor and the governor following yesterday's shooting as NPR's Tamara Keith reports he maintained his schedule despite the tragedy\nReading from prepared remarks at a campaign rally in Illinois President Trump condemned the anti Semitism in unambiguous terms saying the synagogue attack was an assault on humanity Trump said he considered canceling the rally but didn't want to let someone so sick and evil when\nWe have our lives we have our schedules and nobody's going to change it okay [noise]\nAnd if\nYou don't mind [noise] I've got to tone it down just a little bit is that okay [noise]\nHe didn't tone it down much and when Trump mentioned Hillary Clinton's name the crowd chanted lock her up this in the same week she had been sent a package containing explosives camera Keith NPR News\nThe voters in Ireland have reelected president Michel de Higgins with a strong majority they also passed a referendum with removes the word blasphemous from the Irish Constitution from Dublin Joseph and report\nSeventy seven year old Labour party candidate Michael D Higgins one with fifty six percent of the first preference vote is the first sitting Irish president to win a contested reelection and more than fifty years it's a largely ceremonial role and dusty is unable to stop the country's homelessness crisis\nWith almost a two to one margin voters also approved the only other item on the ballot a reference to remove the constitutional ban on blasts from me\nWell no one has ever been prosecuted under the modern law British actor Stephen Fry was briefly investigated Hussein stupid God an Irish TV for NPR News I'm Joe's effort and doubling this is NPR News\nI'm ... and all of our president and general manager of your station my viewpoint seven W. M. F. E. and this is our Cyrus drive\nFor two years since we first tried this less intrusive style of reasons and this is how we do it now if you imagine friendly fallen drives are no longer the new kid on the block but a tradition we are committed to keeping long as we raise the money needed to pay for programs you listen to deal with\nYour contribution to help pay for public radio news in programming\nWithout the pressure of commercial interests Ninety point seven W him if he is powered by you show your support now for uninterrupted public radio news and programming\nOr making a donation right now for support news that matters as existing or from your bank account or credit card will send you a player Monday points them and W. M. F. the customs socks\nHow 'bout contributing thirty dollars a month\nYou will become the power behind the news you use you'll make a statement wherever you go together we have come a long way with the silent style if one reason\nMore programming and less fundraising can only sustain with your participation contributed W. M. S. dot org ... cold one eight hundred Seventy five twenty twenty\nAnd thank you know need to have that driveway moment actually sitting in your driveway but do you imagine the mobile app is a powerful way to listen libel on demand to my point seven news in Ninety seven ... to classical music\nVisit your apple Android store today to download the W. him after the accident stay connected sponsored by violence calmer graduate school of business and Orlando Health\nSupport for NPR comes from NPR stations or their contributors include them Melville charitable trust driven by one goal ending homelessness for good learn more online at Melville trust dot org and on Twitter at Melville trust and Americans for the arts and Americans for the arts dot org\nSupport for Ninety point seven news comes from Orlando Sentinel\nInformation about home delivery of the Orlando Sentinel is available at four zero seven for two zero five three five three or on line at Orlando Sentinel dot com slash subscribe\nNineteen Seventy two married by bus writes I was at thirty year old American traveling in India with the smell of incense in my hair and monstrous repeating in my ears\nBack then if you had told me that I Would someday be training employees of corporate America to apply contemplative practices to help them become more successful\nI Would have said you'd been standing too long in India is hot new nation\nYet as soon as nearby Bush return to the U.S in Nineteen Seventy three she started a company called eliminations and was featured among site a young Steve Jobs in Fortune Magazine\nMore recently she helped create Google's wildly popular employee program search inside yourself\nNearby Bush is called in to work with educators and judges and social activists and soldiers\nHer odyssey from India ten now tells a defining narrative of our time and it's not just a story of tools that help us be more successful it's a rediscovery and reclaiming of contemplation in many forms and many tradition and secular sick of modern life\nFor Ninety point at a news comes from Orlando hell to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals and emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nLove and it's really when someone's heart opens that brings really change\nI had been more and more willing to take the risk to offer those practices even in just very secular working situations recently is and I used to be\nBecause people really want to look for it turns out [laughter] and um [noise] it's always the edges\nOn sounding like a hallmark card but I have found it to be very powerful if you can find the right way to do it [noise]\nI'm ... and this is on being nearby questions co founder and former director of the center for contemplative mind into society she's just written a new book together with ROM DOS walking each other home conversations on loving and dying we spoke anti that um Fifteen\nSo I Wonder how would you start to describe what that spiritual background of your childhood of your life or early life\nOf inner life fan out or action kind of find each other head fully [laughter] and you know you you didn't realize that you're going to be part of\nYou know you and a lot of other mostly Jewish and some Christian kids then kind of really importing would ask him back into the west\nYeah pretty amazing to think back on it I don't know how it is I mean when I first came back I mean the idea [laughter] we\nWere so marginalized let's put it mildly [laughter] and um [noise]\nUh we didn't quite know what to do that but many of us were really profoundly affected by it and felt that in some way or other we wanted to\nWell first integrated into our own lives fully and then share it with others and so most of them are single and came back and wanted to teach\nJust adults scene insurance sauce Bergen a number of other Buddhist teachers were there also be who became Buddhist teachers but when I came back two years later I was I'm pregnant and married and\nI had a child then so I couldn't when we first came back meditation we still have the model of it being monastic\nAnd so having a child and being a meditation teacher was just no one could imagine [laughter] right [laughter] [laughter]\nSo but I was just as committed as everybody else\nTo finding a way to bring this into um our lives in the west so first\nI started a business with my then husband John Bush and ... and yeah yeah I thought when I was most interested in a looming nations was integrating this sense\nNot just practice because not everybody who work there wanted to learn to meditate but we integrated and ways into the business that would embodied the perspective and the spirit and the values of contemporary practice ...\nYou know that was the beginning of the time when we were discovering you know it's all one [laughter] yeah I mean now we recognize that it's more\nComplicated and subtle and so on and it is all one and yet it's more than that but at the time that was radical yeah so we really wanted to express it and we knew that doing it visually would be easier for people and trying to do it in words as you can appreciate [laughter]\nYeah so and lemon nations we were trying to create an organization based on principles of what they call in the east right livelihood you know where what you're making\nIs wholesome and contributes to now we would say you know sustainability of the planet and the ... season and at the same time the way in which you're doing it is helping everyone who's involved\nTo wake up\nInterestingly we did so many things that when I many years later arrived at Google because they wanted to have a program there where their engineers could learn meditation\nSo many of the same things that they recognized about what makes a person\nMore creative more able to ah bring their their whole settles into work and to be able to grow from their work as well and not think of it as you know now I'll do my work and then I'll go home and be a real person\nHi I'm off on taking all of our president and general manager of might be point do you remember it's been a full two years since we first tried this was in truth style the fundraising called fire with Dr ... how we do it now that I'm happy family\nDoes your support uninterrupted programming donating a dollar a day W. M. F. ... call one eight hundred Seventy five twenty twenty\n... corporate culture and ideals and practicalities yeah this story of searching satirist stuff first of all I I I Love the story of how you that you had to find that language\nI mean isn't it right when you first just were offering a meditation course are mindfulness course it didn't take yeah [noise]\nUh actually my friend Ming who's now written a book on search inside yourself um he called me up one day I was at the Ritz still running the center for contemplative mine and he called up and first of all he said when I was younger\nHe been through some difficult times and meditation had really helped him so he'd been thinking for some time at Google that or it would be really great to bring into the workplace he'd been there since almost the beginning he was engineering number one o seven [laughter]\nAnd um when Google went public they told their engineers that who no longer needed to work if they didn't want to um [noise]\nThat they could stay but they had to do something that would in some way advanced Google's mission\nBut they could decide but it was so man decided it was going to be bringing meditation and he said I posted it and nobody signed up I don't know what to do and I heard you could help so I\nWent out there and we talk to and we looked around and what we identified was that people are employees there are\nAll quite young very smart graduated the top of their class from MIT or Stanford um [noise] had been in front of their screens most of their lives so I'm\nAfter talking for a whole day and figuring out what was going on there\nI suggested that we could offer the same practices but emphasized the practices that that more directly cultivate emotional intelligence and that we could frame and then a different way\nAnd so we called it of course they came up with this great name since they are the big search engine search inside yourself and then the subtitle is mindfulness based stress reduction and we asked Danny go home and who also was an bug guy or with us back all the right guy\nI'm asked him to uh give a talk at Google about the relation between about ... just so important in the\nWorkplace and uh the relationship between meditation and Marshall intelligence he did that and then we posted in the course and in four hours a hundred and forty people signed up and since then you know over two thousand\nLawyers around the world have taken the course and there's a lot of talk now about\nBringing mindfulness into the workplace yeah how's superficial it is and how it helps bad people do bad things better and and it doesn't help people question\nAnything it just makes them more satisfied with what they're doing but\nThis is a serious course and when you sit down and quiet down come calm quiet stable\nYou have to do that in order for any kind of insight to arise and you do feel better usually although sometimes you know really disturbing emotions rise but it needs to be taken\nTo the next kind of level of gaps in order for people to begin to question right higher but this course actually offers enough time practice and a teaching to help\nPeople do that [noise] I mean yeah and I think that's an important and refreshing thing to name that if you can be a great meditate or and also remained narcissistic right [laughter] yeah I mean this can be superficial and it can be up here it's like any like any spiritual practice like yeah political correctness um [noise]\nBut you know nearby something that really sell intrigues me in um in your work and in some of your writing is how you know like the language of emotional intelligence that you've just in using and that's now so widely familiar including workplace or um [noise]\nThat what this tradition is bringing forward and bringing to the surface for modern people has [noise]\nYou know has this faring noble lineage um [noise] you know it's split is um that is the tradition that has focused on that for ... years but you know you wrote about how in Eighteen Ninety William James and the principles of psychology\nSaid that the faculty of voluntarily bringing back I'm Wondering attention over and over again it's a very rare of judgment character and well\nAnd I mean I don't know I don't think he was British at that is the intention right have yeah that is seeing and that's just quite amazing and then in the seventies you had a somebody who actually I had never heard of David McClellan\nYeah and William James hall mhm um who became a teacher to all these figures have gone on especially in narrow science to this day to day Oklahoma cliff Darren Clarke abstain\nAnd also to me what's fascinating is that he was Quaker and they knew something in your work ... through\nAnd seeing that this contemplative impulse\nIs the kind of human tradition as much as it yeah it's in their religious traditions 'em me center Owen cs Lewis ... the idea of holding that goes back to play down high tech are somehow that you're just looking at your work has brought all that far from me and it's really", "year": "2018", "show_name": "BBC World Service", "city": "Orlando", "day": "28"}