{"month": "10", "state": "FL", "station": "WMFE", "content": "No yeah I have to protect kids from those\nA site of humankind [noise]\nWe usually refer to leave you feeling that this is just at the end this is just I'm\nA new um [noise] I I I think they will inevitably fail but they have to try and and and I think we should all be rooting for the [noise]\n\nSupport for Ninety points that the news comes from upper Linda presenting tales of Hoffman October twenty first rate the thirty is that the doctor Philip Center for the performing arts\nSetting a steam punk landscape of smoke and mirrors in featuring Metropolitan Opera ten or ... and the title role tickets in more information for Hoffman and all up around the main stage productions available and upper Arlene do that or\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children had been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available on line ... Arnold Palmer hospital dot com [noise]\nFrom the center for investigative reporting in our eggs is revealed about ... [noise]\nBrian Kemp is in a tight race for governor of Georgia [noise]\nHe's also the secretary of state there overseeing elections facing allegations of voters to fresh there are people on the left literally have called me the secretary of so fresh they don't why do we keep our voter rolls point [noise] camp set of threatening letter to hell in your home after she registered minorities to vote\nScares you know and then\nShe turned to Atlanta attorney who's been defending voting rights for decades\nIf you want to you guys hear K corral came for the right place on this episode of elections shootout and George [noise]\n\nSend Washington on Barbara Klein\nPresident Trump called Saudi Arabia's account of what happened to journalists Jamal ... G credible for the first time Riyadh admits could show Jesus is dead\nSaying he died in a fist fight with Saudi suspect and its consulate in Istanbul NPR's Deborah Amos reports the kingdom blame senior advisors for\nPolicy gone wrong\nThe Saudis now admit that there is a standing order to bring dissidents back to the kingdom by force if necessary but the account lays the blame on the senior security officials who went beyond the order they killed this dissident journalist they covered up\nThe murder Turkish officials continue to search for Chris showcased body meanwhile Republican Senator Lindsey Graham says he's skeptical of the Saudi explanation democratic Congressman Adam Schiff says he doesn't buy it\nPresident Trump is due to lead a rally in El ... Nevada that's our last stop in a three day campaign swing for Republican candidates in the upcoming midterm elections Paul Volcker of member station K. U. N. R. report\nThe triple marketing first visit to the northeastern part of the state which is widely considered a conservative stronghold according to campaign officials the president will use his time to urge people to get out to vote for Republican candidates like incumbent senator Dean Heller\nHoward the only Republican running for reelection they won by Hillary Clinton twenty sixteen and it's considered by many to be one of the most vulnerable Republicans in the mid term\nHeller is facing a challenge from democratic congresswoman Jacky Rosen in a previous to the state that President criticized resin referring to her as wacky Jackie for NPR News I'm Paul ... in Nevada\nU.S intelligence officials are warning that foreign adversaries have already targeted next month's midterms NPR's Carrie Johnson reports a Russian accountant is the first to face federal charges\nFederal prosecutors say Elena ... sign of a\nConspired to defraud the United states authorities say she managed a budget in more than thirty five million dollars aimed at targeting elections here and in other countries that methods familiar Russian bug domain names and Facebook ads just so division on issues such as race relations and immigration\nTheir messages targeted people including former president Brock Obama and late Arizona Senator John McCain they also mentioned special counsel Robert Mueller the man leading the investigation into Russian interference in twenty sixteen intelligence officials say the Russians are still on the attack\nBut they say there's no evidence foreign adversaries had been able to prevent Americans from voting or to change vote counts Carrie Johnson NPR News Washington\nSome forty thousand customers in the Florida Panhandle are still without power ten days after hurricane Michael roared ashore the company Gulf Power says all of them should be back on line by midnight Wednesday\nThis is NPR\nOur our Michel Martin I'm Kelly McEvers Ari Shapiro your for my name is under the law for many Chinese all day\nAnd my name is David ... I'm a co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of a nation's listening together why do you listen\nI literally listen to anything in the eye when I'm Talking to friends and family the friends I've been listening to NPR yesterday and it's something that I find myself repeating over and over and over again I find that diverse in different ... that people are listening to NPR they're getting real news [noise] real information on NPR\nReal new and real information or great Lewis and\nThey're also great reasons to haul go online and you and when you do you make authentic stories of voices from around the country possible and best of all you make your own voice for the call or go on line and make a contribution to the station today and thank you\nIf you're hearing my voice well then you are\nSupport for Ninety point seven news comes on alert today Florida committed in safeguarding those who bike and walk awaiting distractions is crucial to public safety drivers to just drive and walk I should just walk\nMore information is available online at alert today Florida dot com because safety doesn't happen by accident\nSupport for NPR comments from battle a European made language learning program Bible teaches practical conversation in Italian Russian Swedish and other languages available in the app store or online at B. A. B. B. E. L. dot com and the ... foundation\n\nFrom the center for investigative reporting NPR ... disease is revealed I'm Alice thank you so much thank you\nIt's Saturday Night in Atlanta final stage in one of America's closely watched election\nStacey Abrams speaking to a crowd gathered outside some restaurants and bars long enjoyed evidence she's a Democrat running for governor if she wins she'll be the first African American woman to be a governor any state\nAims is called herself and unapologetic progressive and she's all about making voting easier\nAnd then he got joy that\nBut I Do so much a free or you all have and later this morning Republican Brian Kemp is Abrams upon his Georgia's secretary of state strong supporter of President Trump calls himself politically incorrect conserve\nThere are people on the left and they call literally have called me the secretary of suppression really they don't why do we keep our voter rolls coin so many demands common sense we keep our voter rolls updated ... with the Democrats I don't want to remove then the one\nOn Kim's watch Georgia has moved more than a million voters from the rules and not just that people now\nHi I'm off on taking all of our president and general manager of made the point that a W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support uninterrupted programming donating a dollar a day the W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nBuddhist oppression in American with our partners at eight PM reports that the investigative unit of American public we\nWere also teaming up with public radio station W. H. B. E. and Atlanta Johnny Kauffman is W. A. B. east political reporter and he gets started in southern Georgia [laughter]\n[noise] it's weeks before the midterm elections I made a small town called Moultrie riding in the back seat of a Ford Focus that's moving slowly down the street it's getting dark in three women from a local chapter of the Democratic party are peering at the house members what's\nThe next one player for I guess that's\nWay things are history\nOne of the women steps out and walks up to a house [noise]\nThe women are looking for likely Democrats using a list they got from the state party\nAs the sun goes down and it gets darker no one's answering the door it's getting close to eight o'clock Sarah clean decides to try one last house some of the TV inside is turn to jeopardy and someone's head is visible through the window\nHe has with Trump in office enthusiasm is low in Moultrie in the last election voter turnout was below ten percent voters are also frustrated with all the obstacles purges confusion over polling locations and long lines\nThe black race it's been like is no longer more devoted in there and I think that's what we're we're we're in trouble with\nVan Angela asks about a name she started on the purge list\nKathleen plan there oh yeah yeah yeah they didn't want her\nShe's Monti yeah mhm\nState record say Kathleen ponder registered to vote in two thousand eight then earlier this year officials struck her name from the rolls Reverend ponder tells us he doesn't know about any of this but does he and know that she's been taken off the voting list\n[noise] Angela and I find ms ponder living in a small house just outside multiply ...\nI'm Angel I can say that I'm a reporter is Lance Public Radio's John and\nSorry about people who send removed from the last I don't know if you've heard of that day St\nAngelo explains how Georgia cancels voters who don't turn out in multiple elections and then in some places blacks are being pulled off the rules at a disproportionate rates\nSo you registered to vote in two thousand and eight years I've heard that about ... member\n... known to both making her ... and\nThen a last July you were taken off the voter last I Would have been on July twenty eighth as twenty Seventeen hands but you didn't get any notification that you\nNeed to do this and you know\nDid you know their marriage to say that they take you laugh at sea down south\n\nMissed ponder tells us she had no idea she'd been purged although she didn't seem completely surprised she says she hasn't been a regular voter but she's thinking about turning out in November to support Stacey Abrams for governor\nRhodes obey the rules that you back at Reverend ponders office the angel it gives him the news about his aunt\nShe still lives within the county but she's been removed from the voter last and she had no idea\n... that's interesting is she was never notify or anything\nShe doesn't recall ever getting anything from election officials [noise]\nNo I think we need to get down to the bottom of it because if it happened to her to run a machine I Know\nHe says it just confirms his view that voter suppression is happening\nIt almost getting people to read mine said that this is a privilege not right and so now anything that as a privilege as they get permission and so if you don't do our way we will give permission to use this privilege\nHe says he'll take is on to re register so she can vote in the governor's race [noise]\n\n\nWe analyze all the people purged in Georgia just last year and we found that about a hundred thousand vermouth for not voting and not responding to notice\nNow we don't know how it breaks down by race but if you add in other obstacles like a voter id law enclosed polling places all this could tip a close race for governor when it comes to the purges Stacey Abrams and other Democrats said there's this illusion let people register all the way to election day\nAt least Seventeen states have same day registration but not in Georgia Brian Kemp opposes it and same with other Republicans in states where you have\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now with the family\nDon't your support all uninterrupted programming donating a dollar a day the W ... or call one eight hundred Seventy five twenty twenty\nHouse brands he's voting as a right and a privilege so he disagrees with Reverend ponder who says voting is outright period Brian thanks registering ahead of an election is important because it shows someone's educated and engaged enough to deserve to vote\nYou want people who have been following the election to some degree uh who knows what the issues are and what the candidates stand for I don't believe in the same day registration because I Do think is that an ashtray that's headache because I Do think it distorts the electorate Abad I Try to how to destroy the electorate [noise]\nI don't know how you describe it frankly I'm at a loss on all that but if you don't know on October the first so there's a presidential election or a gubernatorial election and uh the first two weeks of November you're not uninformed voter\nBrian argues purging people for not voting isn't taking anything from them because they're not voters\nLike if the presidential election and in fact two presidential elections don't get you out I don't know what that's going to take to get you out and I don't care what color you are what your partisanship is I think that they air standard\nBrian looks at the governor's race like this it's all about who shows up at the polls camped wins if the racial breakdown of voters stays about where it's been in recent elections Abrams wins by getting more people of color to the polls\nBoth probably need to win over some voters who haven't made up their minds but finding those types of voters could be really tough\nYou have to polarized angry tribes going at a job that you look at the falling today there's almost no one decided [noise]\n\nThat story from Johnny Kauffman of public radio station W. A. V. E. in Angela ... poodle from a PM report [noise]\n[noise] Mm\n[noise] Mm\n\nWhen it comes to voting something else distinguishes Georgia from most other states it's voting machines are easy targets for computer hackers was way you are doing here even technically hacking\nNo I Would not counted as hacking now what was it then [noise] it was it was browsing the Web site that's coming up next ... [noise]\n\n\nWhat percent of the food in American supermarkets do actually think his\nSuit the definition of food is something that sustains a nurse rushes yeah I'm nourishment is something that increases your health so forty percent of the stuff in American says markets wouldn't qualify as food like\nForty percent wouldn't qualify sued right\nHow we connect with our food that next time Ted radio hour from NPR\nBe sure to listen in to the Ted radio hour that'd be gives this afternoon at three right here on Ninety point seven FM W. M. F. E. Orlando\nFrom the center for investigative reporting in P. R. and this is revealed an outlet up till now we've been talking about all the\nBarriers to prevent people from stepping into the voting booth on election day like getting to the polling station in finding out your name is on the list\nBut even if you get into the booth your vote might not be properly County Georgia is one size fits that relies solely on touch screen voting\nMachines with no paper audit trail cyber experts warned about these machines for years and recently so as President Trump\nAnd one of the things we're learning is it's always good it's old fashioned but it's always good to have a paper\nSystem of voting it's called paper not\nHighly complex computers paper\nThere's a real cause for concern special counsel Robert Mueller has indicted twelve Russian agents for ... to target county Web sites in Georgia a lot of security experts are worried that when it comes to hack in Georgia is one of the most vulnerable states in the country but are the people in charge of election they're extremist reveals by a Dunkin'\nPicks up the story [noise] yeah so uh right now I'm like in the machine in movie land has a voting machine in his living room [noise] this is what one looks like on the inside so here's where in that regard [noise]\nLogan is a cyber security researcher in Atlanta she specialty is finding new ways to break into wireless networks and new ways to keep the bad guys out\nThe touch screen voting machines he has is the kind of Georgia uses edits polling places the machine is bulky and book shaped with the big screen it looks kind of like a cross between the Nintendo and the Bible Logan boots that\nSays you touch ... glitter and then it's the compressed being the image yeah\nSo one funny thing I've been wanting to do is pull off that little chime at the beginning and use that as my ... times\nAnd this is a direct recording electronic machine or DRA it doesn't produce any sort of voter verified paper audit trail for Logan and other cybersecurity tight that's a major red flag\nIn fact the areas have been criticized by technologists basically since they were installed across the country in the early two thousand one alternative to these machines is paper ballots and in recent years more and more people are pushing to start using them again\nLike last march and the Senate intelligence committee hearing on election security Ron Wyden a Democrat from Oregon had some questions for homeland security secretary Kirstjen Nielsen\nLimited truly only by one's imagination to commit fraud on a paper ballot\nShe also said that even though Logan findings for troubling they're different from a problem with the voting machines themselves\nA breach into a voter registration system is not a breach into the voting system in Georgia because those are two distinctly different systems distinctly different security systems\nIt's worth noting that cyber experts disagree with is strongly snapper and heart is a PHD student at the University of Michigan\nHe studies ... and they're on their abilities\nNot says the problem with George's system is that unlike a lot of other states it's all interconnected like a giant tree\nHe told me the secretary of state's office is the root your counties or like the upper branches and your precincts are like little leaves\nSo really you're injecting prevention or inject basically now we're a virus you do any part of the tree the way it's set up is that that virus could get transmitted to every other part of the ...\nNot long after Logan downloaded all that data a second time some election integrity groups filed a complaint against Brian Kemp for violating Georgians constitutional rights to have their ballots counted correctly [noise]\nThey asked Georgia to switch to paper ballots before the November midterms [noise]\nThere was a hearing in September in federal court in Atlanta was grueling took all day you at cyber experts on one side explaining why Georgia's system is so vulnerable\nOne of them even hacks voting machine right there in the courtroom\nOn the other side where can people telling the cyber experts hey you don't understand how Georgia system works [noise] a few days after the hearing\nA federal judge deciding again adopting paper ballots over electronic wind for the midterm elections\nJudging Amy Totenberg filed an order in favor of Brian ... she wrote that switching to paper ballots just weeks before an election would create total chaos but she also spent dozens and dozens of pages validating the testimony of cyber experts and scolding the state [noise]\nI'm going to read just a little bit from the order\nQuote the court is gravely concerned about the state's taste in responding to the serious vulnerabilities of its voting system by the way throughout the hearing camps team tried to paint the cyber experts as out of state elites judge Schoenberg was having none of that\nHow can she wrote is here to stay and quote defendants will fail\nTo address that reality if they'd demean as paranoia the research based findings of national cyber security engineers an expert so that's where we are Georgia's barreling towards mid terms with informal systems the machines that very few people trust\nKennesaw state is no longer handling election now the secretary of state's office does the people I talked to said that change won't really make much of a difference they say if a hacker\nGot the info Logan got back in twenty sixteen they could still use it to disenfranchise voters in twenty eight teams and it's worth noting here just how much judge Totenberg has ruined resembles the logic Kennesaw state right after Logan first email that we know are elections are vulnerable but we can't fix them because the elections are so soon\nBefore Logan I parted ways I asked him a question let me ask you this how sure are you that somebody didn't beat you to this uh there's there's not really a way of knowing at this point\nStill to this day I'm very concerned\n[noise]\nReveals by those you've brought us that story Mm [noise]\nEarlier this year Brian Kemp established a commission to look at options for replacing the curve voting system by twenty twenty oh and the other four states heading into the midterms that use touch screen machines with no paper audit trail or New Jersey Delaware South Carolina in Louisiana [noise]\n\n\n\nFear of voter fraud is driving a lot of experts to restrict access to voting around the country but where is that fear coming from that's next on reveal from the center for investigative reporting T. R. N.\n[noise]\n\nNinety point seven W him if he is here for you date in and day out you can be here for Ninety point seven W. M. F. ... in the same weight support news that matters with your own going monthly get from your checking account or credit card\nAnd we'll send you a pair of Ninety point seven W. M. F. E. customs socks call one eight hundred Seventy five twenty twenty or visit W. M. F. you down a war\n[noise] know this person that since they don't believe he's homeless person screens the loudest [noise]\nSnap judgment on the wrong way or the maintenance for national storytelling she continues [noise]\nStuff [noise]\nJoin us for snap judgment Sunday afternoon beginning at two right here on Ninety point seven W. M. F. E.\nDon't miss the next Ninety point seven W. M. F. E. speaker series on Monday October twenty ninth Dr ... turned forty I Am Dr hang fish kind will present healthy finances discussion on how to fine tune your planning process for a better today and tomorrow for more information into our cp to this free event\nGo to W. M. F. E. dot org slash events\nFrom the center for investigative reporting in P. R. ... this is reveal a melody today we've been talking about voter suppression in fear of voter fraud\nPeople are worried about it in part because of what President Trump has been saying\nIn many places like California the same person votes many times you've probably heard about that they always like to say oh that's a conspiracy theory not a conspiracy theorist Alex millions and millions of people those claims\nHave been totally to bump but one of the people who got those theories going was a Kansas lawyer who's waged a long running campaign against what he calls voter fraud his name is Kris Kobach he's the Kansas secretary of state\nHi I'm off on taking all of our president and general manager of might be point seven W. M. F. it's been a full two years since we first tried this less intrusive style the fundraising called the fire with Dr ... how we do it now that you've been happy family\nThrough your support for uninterrupted programming donating a dollar a day W. M. S. dot org or cold one hundred Seventy five twenty twenty\nOr constitution bars liquor over\nKobach spin a loyal Trump supporter from the beginning Trump appointed him to run his so called election integrity commission it was disbanded less than a year after it was started without accomplishing anything that you will with Casey you are in Kansas City has been covering Kobach for years\nThey ... hey yeah so Kobach is from a small state population wise but he has this big national profiles conservative circles how did that happen\nSo called book is a longtime anti immigration crusader he drafted in Arizona law that basically gave law enforcement a lot more authority to stop people and question them about their immigration status it was called the papers please law that's dating back to about twenty ten\nAnd since then he's been aligned with white nationalist groups who backed that effort and that's when he got on the radar of the Southern Poverty Law Center who now calls Kobach the lawyer for America's native his movement\nSince then his anti immigration crusade has morphed into this campaign against what he calls massive voter fraud Kobach claims that illegal aliens that's attorney loves to use our voting in great numbers and this frog could be swinging elections\nBut the way we know that that is not true\nThat is right now I could drew a bunch of the little zeroes in percentages at you here but according to the Brennan Center for justice\nIt would be harder for an American to be struck by lightning than to impersonate and how their voter but that doesn't stop Kobach he's a leader in the fight against this well it's a major problem\n[noise]\nYou interview Kobach last summer what was the looking person\nWell you know makes a really good politician he's good looking he's charming he's really articulate but as a reporter he is also just maddening he will tell you that even your question is inaccurate he will fight to line every term\n... ... ... ... if you're using the term last\nLine as an actor and it's not off line then you will throw all these studies in statistics that you which many of these studies have been debunked by academics but he's still uses them it's like talking to Kris Kobach is arguing with your high school debate coach\nYou know you're talking to a guy who really wants you to lose the argument\nAnd I think he's really respected in some circles because he has a very impressive resume he has degrees from Harvard Yale University of Oxford and then he also has this other big help it's a tool called the interstate cross check system\nIt's a massive voter tracking program under Kobach agreed to include more than half of the total voter registrations in the U. S.\nOkay so how does this thing work\nSo about two dozen states are enrolled in this cross check program it's free\nThey share information between stage keeping the voter registration rolls clean states don't want these duplicate voter registrations and most often this happens when people move so out when you moved from Florida California", "show_name": "Talk of the Nation (NPR)", "year": "2018", "city": "Orlando", "day": "20"}