{"month": "10", "state": "MA", "station": "WFCR", "content": "For may PM American public media\n\nListened to market place this evening at six thirty on New England public radio MORNING EDITION on any PR is funded by you and Amherst College presenting globalism and its discs\nStreaming of New England public radio was going to bother you at American International college offering low residency graduate programs for the working professional in education because most health sciences psychology a ...\nFour thirty in the science center Amherst dot edu by the ... valley Chinese immersion charter school an integrated public school and rolling kindergarten fixed and ninth grades P. V. C. I. C. S. dot org\nAnd by people in ... at eleven Nineteen Riverdale street west Springfield offering knowledge and selection of wind spirits and beer online at ... dot com [noise]\nDoes your news hour from the BBC and for new throughout the day tuned out to the any PR news network at Ninety One nine in Hampton county eighty nine three in Hampshire county and streaming at an E. P. R. dot net\nClassical music is next year on eighty eight five this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ended any P. R. dot net it's nine o'clock [noise]\n\n\n\n[noise]\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do that would roll it for school she sees the S. dot org\n[noise]\nMm\n\n\n\n\n\n\nStreaming of New England public radio was funded by ... architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n[noise]\nNa\nNa\n\n\nNa\nStreaming of New England public radio is one to bother you at the hotel Northampton offering six meeting the vets basis for a board room to room with a the equipment that the good house catering hotel north south on dot com\n\n\n\n\n\n\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic other repairs AS Easter defined technicians Massachusetts state inspections seek he's garage dot com [noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a seat on the [noise]\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do not want rolling fall gee CVS dot org\n\n\n\n\nStreaming of New England public radio is funded by un they got university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot E. D.\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the bench bases from board room to room with a the equipment and in house catering hotel Northampton dot com\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the [noise]\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org [noise]\n\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and asked in higher education administrator show rolling for October twenty second applications that they pass dot edu [noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise] na\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs and yes you certify technicians Massachusetts state inspections she keeps garage dot com\n\n\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vets bassist Ron board room to room with a the equipment and the house catering hotel north Hampton dot com\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\nMm\n[noise]\n[noise]\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... you [noise]\n[noise]\n\n\n\n[noise] [noise]\n\nAh\n\n[noise]\nMan I\nStreaming of New England public radio is funded by you know the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment to announce catering hotel north Hampton dot com\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise] that's music of the Belgian violin virtuoso\nTeacher I come to Asian he's I heard his\nStreaming of New England public radio is funded by you and killed riddle architect of forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nSession dedicated to shock T. Bo and imitating and playing on a tube goes obsessive style of warming up and that's the er you heard the DEA Siri theme in many variations and also quotes from boss and elsewhere\nViolinist Sherman park performing that music of usually and he's a guy\nIt's twenty six minutes after ten o'clock I'm ... this is New England public radio in Amherst in Hartford at eighty eight five plus one great Barrington at Ninety eight seven ended any P. R. dot net\nClassical music on any PR is funded by you and da da ... hurt Deerfield antique show at the armory in Hartford, Connecticut October twenty ... twenty first historic dashed Deerfield dot O. R. G.\nAnd by Berkshire buck presenting James back well conducting a twelve a capella voices that that is twelve occupied voices in baroque songs of praise in great banking on November third at seven thirty Berkshire ... dot org\nWe're going to stay in the same part of Europe in fact another composer born in Belgium says are from\nThree works at his which\nIllustrate his command of different musical farms and a different instrumentation\nThe first is his setting of Panetta's ... bread of the angels his bread for men and it features soprano church Yulia ... Lee with the ... academy orchestra directed by young who have shown and then we'll move directly to Frank as Oregon\nUh Oregon as to which was his major a professional capacity or\nA professor of working at the Paris Conservatory as well as the regular or going to set the church of ... here as a\nWheel after the pun essential like us we'll hear his corral number one in e which is one of the very last works that he wrote that will be performed by Marcel to pray just music of sets out from\nUm\n[noise]\nStreaming of New England public radio is funded by you add American editor national college offering low residency graduate programs for the working professional and education business health sciences psychology A. I. C. dot edu\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public odd like eight to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n\n\n\n\n[noise] [noise]\nStreaming New England public radio was funded by ... June ... architect of the year legacy of commitment to community design celebrating the next generation of leadership cute red dot com\n\nStreaming of New England public radio was funded by you at the American international college offspring low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the a\nNa na\n\n\nNa\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and valleys solar local TV design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar [noise]\n\n\nOrganist Marcel Jew pray performing the corral number one in a major one of the very last works composed by says out from the story goes it's more than a story it was actually written down by someone who was there at the manuscript for these\nThree girls oh we're on Trump's a bedside table as she lay dying\nFinished them just before he passed away Mars' failed you pray the organist we have one more work by from coming up first let me\n\n\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n\n[noise]\nNa\n...\nDreaming of New England public radio was funded by ... riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n\n\n\n\nDreaming of New England public radio was funded by ... rental architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\nGreat Sean and so warmly received ... whole cross weight performing the symphonic variations\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nGiuliani that is so\nHope you've enjoyed this small selection of music says are from different styles\nAnd um that you will continue to uh listen today as we are going to change moods completely in just a few moments\nAs we enter a little group of pieces for the films or that have appeared in films will have works of Copeland of Nino wrote a and a piece by Chopin and then music of Jews ... Verde his stomach monitor and\nThe uh over the valley music from Macbeth then a\nTwo works from Italy to more works mentally I should say one by cargo lazy and a piano sonata by but CEO Clemente\nThat's all coming up in the next few hours and then at one o'clock Steve Peck is infer Walter Carol got a great show lined up for you with ... and a series of sweets won by Bach won by Peter war lock and this week they are going to ask of blood WC\nHe'll be celebrating the anniversary of the birth of ...\nAnd music of Mendelson says the number one and much more on the coming up classical music control for here in New England Public radio and then we will be listening to all things considered from National Public radio [noise]\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst ended in ... P. R. dot net classical music on NPR is funded by you and Hartford stage presenting Shakespeare's Henry the fifth\nThe recently crowned king embarked on war that will solidify his reign but bring his country to its knees now through November eleventh Hartford stage dot org\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now we're rolling fall gee CVS dot org [noise]\n\nAnswer\n\n\n\n\n[noise]\nNo no\nStreaming of New England public radio was funded by the ... valley solar a local photovoltaic designed to the installation company serving people lined up to live carbon free one three valleys solar dodge shoulder [noise]\n\n\n\n\n\nStreaming of New England public radio was funded by un valley solar local ... designed the installation helping household secures state or federal incentives and live carbon free and look for one three valleys solar dot solar Mm\n\n\n\n\n\n\nDreaming of New England public radio was funded by us cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call [noise]\n\n\n[noise]\n[laughter]\n\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n\n\n\n\n\nThat's pianist and Marie ... German\nPassion performance I shake up the ball a number one in June minor a traitor Chopin and that changed music pit was featured in film the piano ... which you have not seen anything if your music lover or a lover of film\nAnd certainly recommend it and start term by Adrian Brodie it's forty minutes now\nStreaming of New England public radio is funded by you and said that the university graduate schools MS and applied laboratories science at operations enrolling now for August twenty seventh applications at ... dot edu he'll be back\nOn Monday This is New England public radio in Amherst in Springfield at eighty five also north Adams at one one one ended any PR dot net\nClassical music on any PR is funded by you and Greenfield savings bank with offices throughout Franklin in Hampshire counties including their new happily location across from the town hall on line that Greenfield savings dot com\nAnd buy a gift from the Richard ... at the Hartford foundation for public giving\nWhat are the important issues facing Massachusetts voters you can find out what the candidates for Senate have to say ... joined us on Sunday evening at seven for a debate between democratic Senator Elizabeth Warren and Republican challenger Jeff deal\nAnd they're only western Massachusetts debate before the November sixth election WB wise carry cell do will moderate Sunday evening at seven right here on the five WFCR in on the stations of the N. E. P. R. news network\n\nNext and a final installations little set to music films is by composer Nino wrote to him\nAnd in Nineteen sixty three he was working with director looking at this county on an ... an adaptation of the leopard the novel by does that did not produce a about a political turmoil and social change in\nThe second half of the nineteenth century in Italy particularly in Sicily where the action takes place in involves a print send his family and to their reaction to the political turmoil the battle between the ... and ...\nAnd uh the changes especially to the princeling class which are are\nConsidered by the hero the prince himself to be a inevitable the Nineteen sixty three film a\nSpends a lot of time at a scene at a large I'm a ball and to this country was looking for music to a company in it and try to string together pieces of a a classical music\nStreaming of New England public radio was funded by un June riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nHis friend and sometime collaborator ...\nPlayed for him a little excerpt from a symphony that Russia had written or early in his career and could never published and that turned the trick for that job time toward a road trip adapted that music and it became the soundtrack for the film\nHe later are extracted you're damn rewrote it into a\nConcert form of natural here now so the music is by Nina wrote or their performance despite the scholar to him on a ... strip record of ... the conductor here's music from your guts are part of what\n[noise]\nStreaming up New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs s e certify technicians Massachusetts state inspection she keeps garage dot com\n[noise]\n\n\nOh [noise]\n\nStreaming New England public radio was funded by un valley solar local ... designed the installation helping household secures state or federal incentives and live carbon free and the ... valley solar dot solar [noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot E. D. or [noise]\n\n\n\n\n[noise]\nUh\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com oh\n[noise]\n\nNa\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\n\n\n\n\n[noise] we've been listening to the score to the film delivered it we've got the part on\nThe Nineteen sixty three a\nSetting of the novel the leopard filmed by look you know this country and the music buying you know wrote to the film started Burt Lancaster\nAnd cardio Carter now my favorite and I learned along among others and a toll so political and social strife in Sicily and throughout Italy in the revolutionary age the second half of the nineteenth century\nRicardo ... conducted la scala philharmonic orchestra match\nPerformance of the music of ... I think a loving me perform chair and given all the\nRespect that it deserves very talented composer of many different types of music you know ... ... it's eight minutes after twelve o'clock on this Thursday I'm drawn so one's sitting in for John Iraqi today and will be with you tomorrow is well John Will be back on Monday\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ended any PR dot net ...\nWith mid term elections just weeks away now to find out what matters most to voters around the country\nStreaming of New England public radio is funded by you and bait that university graduate schools MS in higher education administration enrolling for October twenty second applications at bay pass dot edu\nMind a national conversation with voters candidates activists and you that's Monday through Thursday evening at age on the any PR news network\n[laughter] [noise]\n\n\n\n\n\nYeah\n[noise]\n\n\n\nOh\n[noise]\n[noise]\n\n\nStreaming of New England public radio is funded by un date that university graduate schools and the S. and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu [noise]\n\n\n\n\n[noise] that's the second to the fore sacred pieces but I just have to be Verde\nStomach monitor performed by the minority choir and the orchestra [laughter]\nI should say this way or kissed wherever Lucio an F ... home on T. [noise] directed by John Elliott Gardner [noise]\nThat was just a twenty two minutes now afternoon I'm John Sorensen for John new wacky classical music on any PR is sponsored by U. N. WFCR partners Amherst Hampshire Mount Holyoke Smith colleges and the University of Massachusetts Amherst and by Colbert real cheese services pool\n[noise]\nI'll read that again Colbert grilled cheese services for brokerage surfaces property management ten ten representation since Nineteen Seventy four officers in Springfield in Holyoke co Burke real T. dot com\n\n[noise] sorry I seem to temporarily lost my voice there there's more music of very deep I'm\nIn his prime Macbeth was the first of his settings of works of Shakespeare [noise] not really all that successful for a variety of reasons including the difficulty of a throws Lady Macbeth who has to be both a horrible person was not a beautiful voice and\nAnd yet capable of singing they're extraordinarily difficult music\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling no for August twenty seven applications that they pass dot edu\nSorry that just won't go away tears belly music from ... more about it\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n[noise]\nStreaming of New England public radio is made possible by you know by the keys garage in Williamsburg offering foreign and domestic under Paris AES Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\nStreaming of New England public radio was funded by you and they got university graduate schools and I asked in higher education administrator show rolling for October twenty second applications that they pass dot edu\n\nStreaming of New England public radio is funded by un they that university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot E. D.\n[noise]\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AS Easter defined technicians Massachusetts state inspections she keeps garage dot com\nHe's ... he performed by a young Spanish ensemble the ensemble named ... ... with ... and he's now CEO prego we heard the concerto for two hearts accords orchestra by ...\nIt's just forty seven minutes now after twelve o'clock I'm John Sorensen for John Iraqi this huge New England public radio in Amherst Hartford at eighty five plus when we at Ninety three ended any PR dot net classical music\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nAnd what's not just by ... soon to Thursday at eight o'clock Smith dot edu slash Smith arts and the PTA announcing their new chicken vending machines where the purchase of passage and fast breaks smart cards P. V. T. A. dot com\nStephen peck he will be here in just a few moments with the music of by Peter ... first symphony of mental ... and the ... most hurts going to be a fine afternoon of music are we leaving now with a not for piano by the\nComposer performer publisher and a merchant of piano material Clementine born in Italy but made his career in London Christ is not it can be slapped performed by Nick ... go\n\n\n\n\n", "show_name": "Classical Music with John Nowacki", "year": "2018", "city": "Amherst", "day": "18"}