{"month": "10", "state": "MA", "station": "WFCR", "content": "MORNING EDITION on New England public radio is funded by you and the law offices obsessing during both Ryan and who's providing legal representation\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nDot com and by Blue Cross Blue Shield of Massachusetts helping connect the dots with a Medicare plan that fits all lifestyles eight eight eight eight hundred eight to zero for\nThis is eighty eight five WFCR immersed W. N. N. Z. A. M. six forty Westfield W. N. N. Z. FM Ninety One seven Deerfield\nWFCR eighty eight five HD three Amherst W. N. N. you eighty nine five great Barrington W. N. N. I. Ninety eight nine Adams WAMC Ninety One nine Springfield in W. N. E. M. H. eighty nine three immersed\nIn partnership with Amherst College and UMass Amherst ended N. E. P. R. dot net good morning it's nine o'clock\n[noise]\n[noise]\nScreening of New England public radio was funded by you and they sat university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot edu [noise]\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\nMusic by rarely does taken from the mission of folks that was the right country march and the Baltimore Symphony orchestra conducted by David zoom in on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and it and the PR dot net\nIt's five minutes after not in good Thursday morning I'm John ... thank you so much for joining me this morning in this half hour you'll be listening to music Microsoft host with the some of them your window and so I'm all\nMusic by Joseph ... music but Juan Williams a little later this morning music by Mozart's in Racine Ian tours are there's lots here for you to enjoying this Thursday morning\nThe vinyl Thursday morning of our of a full fun drive your New England public radio for asking you to become a stinger and help support everything you listen to on this station and the way you do that has been sitting on our website and a PR dot net\nAnd making a contribution there or call one eight hundred six three nine eight five zero\nBut us role as with me this morning but that's a welcome\nThanks John it's nice to be here as always we're getting ready to wrap up this fund drive today you've been listening along with us ah asking you to become a member of New England public radio with your contribution F five ten or Fifteen dollars a month\nIt's very easy to do when you go to an A. P. R. dot net or\nOr give us a call at eight hundred sixty nine eight eight five zero and when you do will be entering your name into a contest for our giveaway Joan Baez tickets she is on her fairly fairly well tour her last tour\nUm she's planning on in her career and she's making a stop in Northampton, Massachusetts on April twenty eighth you could be there\nThe seats are fantastic and dining Graham Greene John ... excuse me at Smith College\nAnd uh we can't wait to give away that pair John and I will actually be doing that at ten o'clock today so if you want to get into that contest\nStreaming of New England public radio is funded by you and killed rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nV. supporting you are a classical music here in New England Public radio station\nWell the reason we're here of course is to raise money for this station that brings you all of the news and information programming you listen to the classical music during the week day also in the evenings music jazz and so much more that's available here for you you know what we bring you each and every day\nSome business this morning we are in the driveway still have to raise forty three thousand dollars just over that\nAnd our goal today for their music for you listening to music this morning\nWe're going to try to raise five thousand dollars by one o'clock so your contribution\nWill help us to get even closer to our goal which is to bring you the best that we can in music and in the programming the news programming entertainer programming we can do that with your help at one eight hundred six three nine eighty five zero or online at ... P. R. dot net\nYeah we did is fun guys every so often to make sure that you can keep getting classical music here on on public radio now and we rely on listening it's like you to give when we come in and ask if so if you haven't had a chance to\nUh college your pledge and your contribution today at ... now a great time to do that\nSo close and we just need to hear from you to make it make our goal and continue to bring classical music to listeners\nThroughout the valley your contribution Afghan or Fifteen dollars a month to really helps us um continue to be on the air for you each and every time you turn it on one eight hundred sixty nine eight eight five or ... N. A. P. R. dot net\nNew England public radio as part of your day you wake up to the news you hit the floor you're listening to the updates on the news stories and then you might enjoy classical music while you're working many folks do just that when you get into your car for the commute home you find yourself to need to and if you are for your end of the day briefing on what's happened while you were busy during your day\nSince New England public radio listener supported we depend on your annual contribution\nIt's time to make that by calling one eight hundred six three nine eighty five zero contribution of a hundred and twenty dollars or two hundred and forty dollars maybe a dollar a day is something that you can invest in this community resource where you get classical music and news and entertainment programming you can also make your contribution at ... dot net\nStreaming of New England public radio was funded by you add bay path university graduate schools MS in higher education administration enrolling for October ... second applications at bay path dot edu\n\n\n\n\n\n\n\n\n\n\n\n\nEnter to win tickets to see joined by the Northampton you could win grape seeds that John M. green pollen April to show was on the way to selling out so enter right now at any P. R. dot net or eight hundred six three nine eight eight by zero\nOh\n\nOh\nThe Japanese sweet by Christopher holds and that was the son ammonia wind\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nFive also in Pittsfield at one of six one and it and eat P. R. dot net\nI'm John wacky more classical music is coming up in just a moment\nGreat classical music each and every day from the top Sunday baroque this is where you get to hear music you can't hear anywhere else your contribution right now is a vote for the programming you care about because this is a listener funded station Ninety percent of the funding for everything on New England public radio comes from our community\nWe're ... we're asking you today to give ten dollars a month Fifteen dollars a month or twenty dollars a month and help us raise the funding that your music requires donate now at ... medical one eight hundred six three nine eight eight five zero with you in the studio this morning has been ss relevant to welcome back\nThanks Janet nice to be here with daily are wrapping up this fun guy rapidly and we're on a good start this morning we're like five thousand dollars dang more on MORNING music today we can do that when you make your contribution is ten or twenty dollars a month to New England public radio to help keep\nThe station and all the music you love coming to each and every time you turn on your radio and today if you call us or go on line in the next half hour or so\nYou will be entered to win a pair of tickets to see John ... when she comes to town and in April of ... are great seats right on the floor right and I have close to the stage they can be yours\nWhen you make your contribution at one eight hundred sixty nine eighty five or ... some\nGood news Vanessa we've heard from five folks making contributions so far and that leaves just four thousand seven hundred dollars to go before before one o'clock this afternoon\nWe're going to be counting down the dollars as they come in hopefully to meet that five thousand dollars will buy one o'clock you can help right now with your seven dollar a month gift or your forty dollars a month gift or maybe a onetime gift of a dollar a day\nTo support the programming you listen to a New England public radio is something that you can afford\nVisit our website and if you are dot net or call us at one eight hundred six three nine eight five zero\nI'm AJ mission ski I did grow up listening to WFCR I mean there's always something that was on at my parents' house and now they've moved away have kept listening and and it's not something that my friends listen to either so it's kind of counter cultural and my my favorite is broke\nStreaming of New England public radio is funded by you and bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nAnd just because of all the talent that surround the one that comes to mind is the Arcadia players WFCR promotes those groups and you learn about all the local events so it keeps everyone in tune with the towns that's in the area\nKnowing that WFCR relies on your health I just kind of felt bad taking that resource and not doing anything about it so I figured I could do my part maybe things will sound a little clearer a little bit nicer knowing that you helped and I think maybe that's true\nWow that sounds a little bit clearer in a little bit nicer knowing that you have to thank you so much AJ for your contribution to New England public radio to help keep the music that you love on the air you know the Arcadia players knew in a public radio as a proud sponsor their\nSeason and I I Believe have contact coming up this weekend on Mozart contact you can find more information on that at a new Republican ideas events calendar which is also a nicer resource our community that the station provides to you\nOr if you want to get involved right now to help find things like\nA day event scanner and all the wonderful classical music that you find here that presto pod cast that John produces it's all here because of people\nLike AJ have made their contribution to already so if you can step up right now and be part of the community that helps fund public radio in western Massachusetts if we'd love to hear from you want to end it takes a Ninety eight five zero R. N. E. P. R. dot net\nThousand six hundred sixty dollars left to raise about one o'clock this afternoon\nYou know ages said something really important he says he's doing his small park yeah well there is no part that small when you think about it because\nWhat age has done as he's made his contribution\nAnd that contribution is joined together with other folks who've made their contributions and that's what makes the UP our family of support for the station so powerful because it's not just one person it's a community of listeners who have done their part made their contributions and they are making the station possible so\nThere's no parks it's too small when you really think about it but I get what are you saying I really appreciate that [noise]\nSo your contribution how much can you afford or how much are you willing to commit this morning to New England public radio we're not asking for a lot for asking you to simply do what you can whether it's ten dollars a month or twenty dollars a month [noise]\nThirty dollars a month to becoming a sustained her here in New England Public radio giving something per month and that's what helps us\nStreaming of New England public radio was funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\n[noise] don't take too long make your decision but please make it now is we're winding down our fall fundraiser counting down the dollars in order to become fully funded here in New England Public radio one eight hundred six three nine eight eight five zeros the phone number where you can make your contribution or an E. P. R. dot net\nAnd when you call us within the next half hour we'll be sure to enter you into that Joan Baez ticket given away John and I will be pulling the winner for that contest at ten o'clock today so it says tickets are of interest to you you could be the one that someone's gotta win and it could be you\nKnow make your contribution at N. A. P. I. dot net or give us a call at money it takes three nine eight eight five air to get in that contest\nGo to NPR dot net or call one eight hundred six three nine eight eight five zero to get an are drawing while you're entering pleas contribute to the public station that brings you all the great classical music and news and information and entertainment programming New England public radio one eight hundred six three nine eight eight five zero or ... P. R. dot net\nI'm Barkley ward and I live in Brookline Vermont we contribute gladly for two reasons the first is that we use it it's important to us because we ourselves get a great deal out of it than we think we should pay for it\nBut I think also it's a kind of an investment good news reporting GOOD Music or values that we want to promote and it turns out that any PR does a very good job of doing both of those things\nAnd so when we give to any PR were investing in the promotion of a value that's important to us\nThank you Barclay for your comments there and for your contribution you know he has two reasons for giving one is that he uses that he sees value in it\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nMusic and the good journalism those are the things that I think we can all agree are essential to our\nOur wellbeing here in western New England and if you agree with Barclay we're asking you to become a member of your public radio killing him and supporting those two\nItems and you could be I'm One of a padded supporter of New England public radio we want to hear from you right now joined days thousands of people in our community who make a choice to support public radio\nMy hundred sixty nine eight eight five you know art and eat PI dot net country\nIt's just you know thinking about it if it's important to you you will support it and something that is that you value and enjoy then take a moment if you've not given before and make your contribution at N. E. P. R. dot net or call one eight hundred six three nine eight eight five zero\nTake a look if you're on our website there are many thank you gifts are different levels that we could be glad to send you something as our way of saying things when you make your contribution for instance at the ten dollar a month level the N. E. P. R. thirteenth annual ... which was designed by Murray bets Bartlett\nIt's a beautiful mug take a look it's on the website and if you like that and want to add that to your collection and make your contribution of the ten dollar my father will send that as our way of saying thanks\nThere's like I said many different levels there's different things that we can send to you is our way of saying things just like you to consider just briefly\nThat life without and if you're a what would it be like\nWe hear over and over again from folks who say I don't know what I Would do if you weren't there I don't know where I'd go for my news I don't know where I'd go for classical music I don't know where I'd go for jazz and everything that you have to offer well here it is we bring it to each and every day we're committed to being part of the community and\nNow we're asking you to commit some of your dollars some of your financial resources to help make what we do possible one eight hundred six three nine eight eight five zero or an ... P. R. dot\nAnd when you make that contribution to for ten o'clock today will be and not dying for those don't die as tickets\nShe is coming to the John Green hot Smith College in April you could be they're seeing the queen of the folk scene and her final farewell to our to make sure you're in that contest you can do that when you make well on enter you automatically part of me when you make your country\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nAnd you would like to uh be entered into that Jain consider a tipping in a little after this time around how does this son died and you enter yourself into that giant one eight hundred sixty nine eighty five zero or an ape PR\nClassical music on and if you are is funded by you and Wildwood barbecue a neighbor who smoke how serving a southern brunch will say every Saturday and Sunday on ... nine in Hadley Wildwood cute dot com [noise]\nAnd the Hartford symphony orchestras celebrating its Seventy fifth season opener with pictures at an exhibition was Carolyn clung conducting October fifth seventh Hartford symphony dot org\nAnd Phoenix fruit farms are one hundred acre farm in Belcher tone featuring pick your own apples information and fruit varieties that Phoenix fruit forums dot com [noise]\nUsually by refund Williams is next to this morning this is the Norfolk Rhapsody number one Adrian boulders conduct in the new film on your orchestra [noise]\n\n\n\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org [noise]\n\n\nRight now not only the contest and hopefully you could be a winner of the joined by us tickets in the last remaining minute or of it but we're asking you to please make your contribution while you're entering into the contest one eight hundred six three nine eighty advisor or in a PR dot net\nPeter live south Deerfield is entered into the contest because he made his contribution this morning as is Roberta vice of Monterey mask she made her contribution today she said in her comments it's like our last semblance of civility well if you can agree with\nI Try to win tickets to see joined by yeah the Northampton you could win great seats that John M. green hall in April the show was on the way to selling out so enter right now at any P. R. dot net or eight hundred six three nine eight eight by zero net or one eight hundred sixty nine eight eight five zero\nClassical music on in a PR is funded by you and paradise city arts festival two hundred and fifty jury daughters and makers from across America this coming weekend at the three county fairgrounds in North Hampton\nParadise city arts dot com and Blue Cross Blue Shield of Massachusetts helping connect the dots with Medicare plan that it's all lifestyles eight eight eight eight hundred eight to zero for you're listening to New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst and that in ... P. R. dot net\nMusic from the late Italian Renaissance is next by Antonio but listen to a subtle variations on the tunes F bureau and this is the ... lumber also ... conducting\n[noise]\n\n\n\n\n\n\n\n\nStreaming up the wait was public radio was funded by you add Greenfield commonwealth virtual school public online eight to twelve school personalizing education for Massachusetts students now would rolling for fall genes CVS dot org\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n\nItalian ... ... ... conducting music by Italian composer Antonio but lengthy the sort of variations on the to death row on New England public radio\nIt's six minutes after ten I'm John wacky and there's more music ahead for you including use it by hand which will get to a just a moment\nYou stick by Mozart with the ... chamber orchestra using ... bc and much much more still ahead so I Hope so stay with me and enjoy the music I also hope that you will take a moment and become a sustaining pledging member of kinetic up a New England public radio\nTake a moment and visit our website and eat PR dot net or call one eight hundred six three nine eight five zero as we are working on a five thousand dollar goal this morning four thousand three hundred and sixty two dollars left to raise about one o'clock and we can do that if you will take a moment\nAnd make your ten dollar must contribution you're twenty dollars a month or thirty dollar must contribution and become ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nJoined me in the studio this morning ...\nHi John it's good to be with you again this morning you know maybe is given to New England public radio in the past and maybe have been meaning to get back into doing it sometime soon\nWell why don't you become a sustaining partner right now it's a practical way to set your support in motion and never have to think about it again you won't have to sit there and say I think the number and I remember\nI'm not sure whether this way you know you're a member it comes out of your bank account and a little installments as five or ten dollars a month and you can just set it and forget it it's kind of like your Netflix belly or Hulu account or something like that\nIt's really simple to make that happen for anything in public radio to on a service that you probably might listen to a little more often I get a little more value out of and your Netflix account for example\nI think that's certainly true for me though I Choose to support doing a public radio as well as Netflix\nI'm with my contribution I Hope you'll join me and all of the numbers of New England public radio who make it a point to support what the laws here on the radio one eight hundred sixty nine eighty five zero R. N. E. P. R. dot net\nTen folks have stepped forward so far during the music today and they made their contributions\nThey are now part of the end if your family of sisters who are making the music and news and information programming an entertainer program possible here at New England public radio rescued a joined them this morning and I don't think that an amount is too small or too big you can find something in your budget and make that contribution today and that is going to help\nBy joining together with the other contributions that have already come in\nAnd that's what makes this station possible so whether it's seven dollars a month or whether it's forty two dollars a month or maybe a dollar a day\nPlease make your contribution now during a false fundraiser and become a sustained her and help us to do what we do best and that's bringing you great classical music during the day news and information that so much more one eight hundred six three nine eighty advisors the phone number you can use or visit our website and eat P. R. dot net\nWhich representatives soul was he was also conducting the English concert from the keyboard you're listening to New England public radio in Amherst in Hartford an idiot five also in the Ninety three ended in ... P. R. dot net\nWhether you listen to little are a lot or for a short time or from the very beginning you're an important part of public radio\nAnd how do I know that because you're listening right now the average Joe tends to turn off a fundraising appeal but you are here no because you don't want to miss out on what comes next\nWell great programs brought you by you and that's what happens when you become a contributing listener assisting are here in New England Public radio one eight hundred six three million eight five zero or online at ... dot net [noise] I'm In the studio ... this morning when is a welcome back again\nThank you John good to be here we are counting down our ah ... end of our fall fund drive here at New England public radio and we are looking to um\n[noise] have you make your contribution at in the amount that fits your budget right now whether that seven or ten dollars a month for we'd like to hear from you at this moment so we can wrap up here and the next few hours\nOne hundred sixty nine eighty five zero or an A. P. R. dot net and we have a special guest in the studio with\nEverybody mad at you get in getting the right has magically appear Judy Hi welcome good\nMorning thanks for the music as always but I this is my favorite part of my job some business I have an announcement because I just pulled the winter for our mornings contest for two tickets to see Joan Baez and concert on her very final tour of the folk legend is coming to Northampton next April and we have\nExcellent seats and drum roll please\nThey're going to Bob Kavanaugh overall agawam congratulations ... is a sustain or to New England public radio which means awhile ago he just signed up with one phone call or click on our website to give automatically every month and since he is here every month just like magic he\nAlso is entered automatically like magic into every contest and so he wanted these tickets to see Joan Baez and her final tour so congratulations Bob and thank you sound like it's so great to have these people\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nPainter then you'll be in all of our drones as well just thought I'd throw in that little plug there you know\nThis round isn't mentioned that as a but once the once you've become assistant or you are automatically entered into all of a contest exactly so that's fantastic thank you and congratulations again to bomb\nWill be enjoys the shell can't wait to hear and the seats that he did you is there on the floor there on the floor in a section that's sold out so you couldn't even by the seat that Bob one because you know all this rain or to any PR thank you\nThank you so much Katie for bringing that information and you can be our next sustain her here in New England Public radio by making your contribution at N. P. R. dot net or by calling one eight hundred six three nine eighty five zero\nBy name is David Schneider I'm a contributing listener too WFCR I Love all the classical music I Am a classical musician myself so I feel like every time I turn on the radio it's a little quiz for me can identify that composer can identify\nThat peace is there a real treasure it's not something we want to lose\nAnd for that we do have to all contribute not a lot but we all have to give something to let them know how this he asked if we are about ...\nThank you David for your contributions and or your sentiments there if you are like David and loves the classical music that you find out New England public radio\nNow is the time to join us as a contributing member of the station that brings you all of this and so much more one eight hundred takes three Ninety eight five zero you can do that or at N. E. P. R. dot net\nOne eight hundred six three nine eighty advisors the phone number of you're kind of old school like me I like to use the phone and talk to somebody but lots of folks make their contribution while they're listening online at ... P. R. dot net\nThat's another place by the way where you can see the thank you gifts that we have at the different levels\nSo whether it's a seven dollar months sustain their level and you can get the new donor light bulb ... we have our or saying things to you for your contributions\nOr maybe forty dollars a month and you can pick up the and a PR Mason jar radio which is a ... I Love this\nIt's assembled locally and the radio itself is in the jar lid and there's a speaker of theirs and extend Abul antenna there's enough that you turn on and guess what it is one frequency just food student to eighty five WFCR and this is\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nHome you may well anyway it's our way of saying thank you at that forty dollars a month level the point is you can see all of those thank you gifts at our website and a PR dot net\nYou can choose from those and become a sustain or at any of those levels\nBut please do that today on this final Thursday of our fall fundraiser call one eight hundred sixty nine eighty five zero fuel prefer and you can also hear about what we have to offer you as our way of saying thanks either way you're supporting the station that brings you classical music during the day news and information mornings and evenings and so much more but that's some\nIf you've never gave a contribution to New England public radio let me tell you why it's important because individual contribution to seven or ten dollars a month add up to the largest percentage of our operating budget so when thousands of you get what you can your collective voice has become more powerful than any one person on their own\nTo now's the time to make that one time that first time contribution to New England public radio that any P. I. dot net or one eight hundred sixty nine eighty fives yeah it really does make a difference\nClassical music on NPR is funded by you and the constitution records resenting the parlor opera players in a game of werewolf at the Bushnell center in Hartford at seven thirty on October eleventh tickets Bushnell dot org\nAnd Devin lane power equipment in Belcher town offering the husk Varner robotic auto more more at ... dot com or husk Boehner dot com at a gift from the Richard ... funded Hartford foundation for public giving [noise] is it by Mozart\nIs next to simply an F major here is the ... chamber orchestra Charles matures conducts [noise]\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do now would rolling fall genes CVS dot org [noise]\n\n\n\nStreaming of New England public radio was funded by ... rental architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com [laughter]\nI've been part of the WFCR community since Nineteen Seventy two Russian husband and I live in Moscow half of every year and when I'm In Moscow I listen to WFCR on line\nAll the time in both the regular WFCR and the ... of classical music any time of day or night I've always appreciated the differences in different countries and other European countries have good public broadcasting but\nNone is better than our wonderful NPR oh I'm so grateful that WFCR exist I just couldn't imagine not helping it continue to exist\nWell go ahead\nDr hydrate listening all the way from Moscow half the year well she certainly takes advantage of New England public radio to get all the classical music that she\nWants and needs from our source here ah John and Walter bringing her music across the ocean not pretty fantastic thank you so much for sharing that with us Barbara\nAnd for adding a contributing member as New England public radio\nWe are able to bring you that music because of Barbara and all the other folks who have already stepped up to make their contributions it's your turn next or you can become the newest member of any PR when you call one eight hundred six three nine eight eight five zero or go on line at N. A. P. R. dot net\nI'd like to suggest the Fifteen dollar a month level for Fifteen dollars a month to New England public radio we can say thank you with a pair passes through the Springfield symphony orchestras Seventy fifth season Kevin roads is conducting a program of Mozart Mahler there's a star studded cast a soloist bringing the music\nStreaming of New England public radio is funded by you and they passed the university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nOr for you to select from we'd be happy to send you to passes through the ss so for a concert the season for your gift to Fifteen dollars a month to New England public radio and we've got a limited number of these passes so please make your contribution and request years now and it and if you oughta met her at one eight hundred six three nine eighty five zero\nYou know the feeling a little bump that you didn't pick up that has gone by as tickets we've got one more price contest ah it around out there and got so we're launching it now and the first to let you know that we are giving away a pair of tickets defeat Bob Dylan\nIn Springfield you could have been great pizza Tiffany ... and you also get a night at ... after they contact showed it on the latest shelling out to enter right now when you make your contribution at N. E. P. I. dot net I'm doing\n... well I'm doing and we're going to be giving away those tickets wondering when are we going to give those away\nWe're getting ten am tomorrow\nTomorrow so folks have got some time but don't wait because you know the tickets are going to sell out so if you can't get a hold of them are by buying the tickets you may be able to win so take a moment now become a sustain or at ... at her call one eight hundred six three nine eighty five zero to make your contribution and get entered into that contest\nClassical music on ... ... is funded by Ewan WFCR as partners Amherst New Hampshire Mount Holyoke and Smith colleges and the University of Massachusetts Amherst\nAnd the Harvard symphony orchestras celebrating its Seventy fifth season opener with pictures at an exhibition was Carolyn quantum conducting October fifth through seventh Hartford symphony dot org\nAnd Northampton in tech integrated medicine offering expanded diagnosis and treatment options for allergies chronic illness a natural hormone optimization N. I. M. E. D.\nDot org you'll stick by liberals coastal is next to ... in the flat here's the consortium classical\n[noise]\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now rolling fall gene C. V. S. dot org\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\nScreaming of New England public radio was funded by ... they passed university graduate schools MS in higher education administrator at rolling for October twenty second applications that they pass dot edu oh\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded value added American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n[noise]\n\n\n\n\n\nMm [noise]\nScreaming at their leg with public radio is funded by you killed rental architects a forty year legacy of combat but to community had designed celebrating the next generation of leadership at ... dot com [noise]\n\n\n\n[noise] I just love the ending to that piece by Frederick Chopin does not turn number two in deflect the sort of just letting you down very gently at the end and that was pianist John ... Parker on New England public radio\nIt's four minutes after eleven I'm John wacky thanks so much for joining me this morning and I hope you enjoyed the Chopin I Hope you enjoyed it enough to support it with your dollar sort of financial support to the station that brings you music by Chopin and ... Williams the Mozart of\nA handle and let's see who else was on this morning use it but ... and there's still much more of a Sunni and did you see and there's music by towards shock and got shot\nSo there's still plenty to go but this is the place where you can hear not only the well known composer but the not so well known so there's a little bit of everything for you on a daily basis and then we come to a couple of times during the year like during the ... fun driving we say please contribute in hell\nStreaming of New England public radio is funded by you and they passed the university graduate schools MS and applied laboratories outside operations enrolling now for August twenty seventh applications at bay paths dot edu\nSix three nine eighty five zero or by visiting our website and making a generous contribution at N. E. P. R. dot net burns max is joining me in the studio this morning Bruce welcome thanks for coming in so\nGood to be here and I to enjoy that show that was beautiful thank you so much for sharing that were dancing that I Want to damage like I just I just had the sense of drawing yes\nAnd you know this fund drive that we are running right now is raising the money that it takes to bring you that Chopin that takes to bring you that morning classical music\nThat you love to tune in to you and the music and culture you turn into here at NPR um each weekday and each each weekend day um you can join your fellow any PR listeners and paying for what you love to listen to and you can give ten dollars or Fifteen dollars or twenty dollars a month\nAnd you'll be an important part of what makes the station work what makes what brings you what you've left to listen to every day so go to any P. R. dot net and get right now or call one eight hundred six three nine eight eight five zero\nAnd it's really important on this final Thursday of our full fundraiser overall we still have about forty two thousand dollars left to raise\nDuring the music this morning we are trying to raise five thousand dollars I'm throwing numbers that you've been here now\nWe still have just three thousand five hundred forty four dollars left to go buy one o'clock so if we make that goal that's going to go to the overall goal and hopefully we can become successful in our fundraising efforts this fall fundraiser we won't know that until you make your contribution of ten dollars a month or two hundred dollars a month or thirty\nDollars a month or maybe more and become that sustaining partner that we're asking for during this Dr joined the and keep your family now by visiting and ... P. R. dot net or by calling one eight hundred six three nine eight eight five zero\nHi I'm Elliot fried chicken I'm here with my wife Marty ... than\nWe are from North Hampton I think so many of us benefit from public radio far more\nThan we are paying\nAll of us need to contribute to keep it our Radio Free of profit motive\nAs long term sustained errors for all the time that we got on the radio at home in our cars at work\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic other repairs AS these are defined technicians and Massachusetts state inspections seek he's garage dot com\nAnd they understand that this is a resource for us all and we've really come to depend on it we come to depend on the music that we love we love that reprieve from the noise at each and every day and you can join in with our friends in Hampton 'em by going to any PR dot net\nWhere you find those schedules and podcasts and all of the good stuff that you rely on visually along with what you're listening to 'em or you can call one eight hundred six three nine eight five zero\nOne eight hundred sixty nine eighty five zero that's the phone number to use or an ... P. R. dot net\nIs our website where you can also see the thank you gifts that are available at the different levels so if you're interested in something or thinking well what does it really looked like well take a look ten dollars a month and you could be the receiver of a new arts mountain this is the thirteenth\nIn the series of art mugs and it's designed by Murray vets Bartlett\nFor scenes spring summer autumn and winter and then the and the PR is also part of the design and uh I heard that it is our four seasons mud which I Love the idea and that you can be listening throughout the four seasons of the year and it's our way of saying things\nThat that ten dollar a month level that's just one example of a thank you give if you'd like to see more of them than visit in ... that have a look there but don't wait too long if you would make your contribution while you're looking that would be great or you can call one eight hundred six three nine eighty five zero and get descriptions and talk with a volunteer about those as well\n[noise]\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online eight to twelve school personalizing education for Massachusetts student now enrolling for fall gene C. V. S. dot org [noise] Mm\n[noise]\n[noise]\n\n\nNever\n\n\nNever never\nNever been there [noise]\nStreaming of New England public radio was funded by Ewan Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org [noise]\n\nThe Academy of St Martin in the fields with metal Mariner conducting ... overture on New England public radio it's eleven twenty two I'm drawing a wacky there's more music just ahead for and we'll get back to it in just a moment\nThe music you're listening to has been created with funds from listeners just like you\nKnow ... percent of the funding for everything on New England public radio comes from our community and I'm asking you to make a vote for great radio but giving it in ...\nOr by calling one eight hundred six three nine eight eight four zero contribute no because you want to help keep New England public radio on the air burns max who's joined me in the studio this morning Bruce welcome back\nThank you John I Want to give a shout out to hell in who it's from Hayden bill and pat is actually a broad right now she says that she loves the classical music right now and I'm listening on line while in India believe that the scripture yes yes I'm I'm Glad the streaming is working in India Africa the here\nAnd as as hell and said there's so much to love about New England public radio and you can join the any PR family right now and let me tell you why um number one it's super easy all you need a credit card to get started and number two its budget friendly\nSustaining membership starts at the contribution of seven dollars a month and you get this great new donor light Bob uh that just it's a mug that super cute as at seven dollars a month if you think about at seven dollars a month is really not a lot of money and it's practically a cup of coffee\nA one time cup of coffee at this in this day and age um but you can get whatever works best for you or whether it's ten dollars or Fifteen dollars or twenty dollars a month\nAnd number three it's important sustaining gifts make up the most reliable income for New England public radio station I when and when you any PR can count on you and me can always count on 'em you can count on New England public radio to be here for you day in and day out as we know you listen\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nGo to any PR dot net and click on that donate that and\nYou know whether you listen a little oral lot or a short time or from the very beginning you're an important part of public radio\nHow do I know that because you're listening right now the average listener tends to turn off this fundraising appeals but you have stuck around because you don't want to miss out on what comes next perhaps\nA great program and has brought to you by listeners just like you and you can join them by becoming a sustained her and making a contribution at one eight hundred six three nine eight eight five zero or online at N. E. P. R. dot net\n[noise] my name is Kenneth Fuchs American composer or music grows out of the American symphonic school my favorite composers were on Copeland and Leonard Bernstein I'm Wendy Sherman and Peter ... cutting my teacher so I wanted to speak the language but in my own voice\nIt's essentially important that listeners here contemporary American music understand how it's developed and what it sounds like and hear the voices of today and tomorrow\nThe airwaves music talk on the radio creates a community doesn't it to be actively engaged in your community through listening understanding whether people are saying hearing all different kinds of music and different opinions is part of being a living breathing American\n[noise] any PR is a part of our community has kind of sad and I believe can sign up presto is that right it was and I'm I guess that's right and presto if you don't know as a podcast that I'm John Mackey also puts out on top of hosting and putting together these wonderful shows that you listen to\n'em you can subscribe and have it come to your phone I'm at\nPie pass or just listen to it on line at any P. R. dot net slash pressed out and that's just another hum edition that we have added\nTo our plates here at New England public radio is bringing you additional programming that comes to your ears whenever and wherever you want to send 'em to support that all of the good programming that we're bringing to you go to any P. R. dot net or call one eight hundred six thirty nine eighty five zero\nYou know people often ask how much should I give to New England public radio and the answer courses whatever fits\nStreaming of New England public radio is funded by you and they had to go to ... graduate schools asset applied laboratory sigh outset operations that rolling now for August twenty seventh applications at bay paths dot edu\nThe forty dollars a month level we could send to you the N e PR Mason bald jar radio and it's like a mini ball jar with the lid that has the radio components in it\nAlso has the knob on top to turn it on and off it hasn't extendable antenna and iTunes to guess what WFCR eighty eight point five that's the only frequency but what's really cool it's beautifully done it's well put together it is constructed in made locally here\nIt's powered by two W. batteries and it's going to be a great\nA piece that puts a conversation started it's going to let folks know that you support New England public radio because we're the only ones that have these in the area so we are we\nSo don't wait get yours for forty dollars a month with your contribution at any ... that are what eight hundred six three nine eighty five zero\nAnd I really recommend going to any P. R. dot net to check out an image of that Mason jar radio because it is just so wonderfully adorable\nAnd you just want to be able to raise the debt and it it's it it sort of goes back to you know it's a it's a it's programmed right to eighty eight point five\nSo you don't have to think about your phone and and streaming or your radio and going from one station to another you can just turn it on whenever you want it's so simple until late fall\nAnd um you can do that by going to any P. R. dot net calling one eight hundred six three nine eighty five you're out\nWe're going to get back to some music by so did you see this is a relatively short piece but it's a beautiful beautiful piece because it was performed by hospice Jula under cutting us it's this is the romantic waltz\n[noise]\n\n\n\n[noise] use it for violent end orchestra by Anthony worshipped is next to this morning the romance and F minor featuring violinist Utah Perlman and the Boston symphony orchestra ... conduct [noise]\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional education business health sciences psychology A. I. C. dot edu [noise]\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\nStreaming up the weight with public radio was funded by un Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\n\n\n\nStreaming of New England public radio was funded by ... riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... dot com [noise]\nStreaming of New England public radio was funded by you an American international college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n[noise] [laughter]\n[noise]\n\n\n\nStreaming of New England public radio was funded by ... riddle architect oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n[noise]\nNah\nNah\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com na\nStreaming of New England public radio is made possible by you among the keys garage in Williamsburg offering foreign and domestic ... AFC certifying technicians and Massachusetts state inspections seek he's garage dot com [noise]\n\nThrough selections from kick walk by Louis moral God shock the Cincinnati pops orchestra with their or comes all conducting on New England public radio WFCR in Amherst Raphael Hartford in partnership with your bestsellers ended in ... P. R. dot net\nIt's seven minutes after twelve good Thursday Afternoon I'm John wacky thank you so much for joining me this afternoon I\nThink of what you get when you tune into New England public radio then take action to protect it as a non commercial non profit radio station listener contributions are essential to what you listen to ... percent of the funding for the programming you here comes from community support\nRescue to join the community of folks who are already making their dollars work by making their investment in New England Public radio vote for the station by giving it an ... or by calling one eight hundred six three nine eighty five zero\nAnd I'm joined by burns me actually this afternoon burns thanks for coming back I didn't\nThings are having the giants to be here\nI'm a we have a listener ... who ah contributed and said our democracy depends on the end that's accurate reporting that any PR consistently delivers\nThank you so much um range from ... we really appreciate your donation and if you to feel a little bit overwhelmed these days by the news\nAnd um the uh\nThe level of reporting that it goes on out there and rely on New England public radio and NPR if you're overwhelmed even by aps or I pads and downloads and swipes\nWe'd love she invites you to become a part of New England public radio and pecan part of our family and you can do so easily with out even going to the website at any P. R. dot net to give you can also\nTalk to a person I'm call one eight hundred sixty nine eight eight five zero and we where we have a lot of wonderful thank you get that you can choose from at any level you choose to get so um go to any P. R. dot net or call one eight hundred\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at a vet spaces from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com\n\n\n\n\n\n\n\nUsually by Leonard Bernstein three dance variations from fancy breeds and that was the royal Liverpool filled I'm On a orchestra Christian Lynn Lindbergh conducting a New England public radio in Amherst and Springfield idiot but also in North Adams at one uh one one and that in a P. R. dot net\nIt's twelve twenty I'm John wacky thank you so much for joining me this afternoon\nYou know listeners sometimes ask how much should I contribute to New England public radio especially during the fund drive\nMe answer is it's entirely up to you like you to think about how much you listen I'm In place a value on you're listening and I'm off the ditch your budget so it'd be seven dollars a month maybe ten dollars a month maybe twenty dollars a month that would make you sustain your New England public radio in ...\nStreaming of New England public radio is funded by you and cute little architects a forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nDr joined the and if your family now at Anne ... medical one eight hundred six three nine eighty five zero burns max who's in the studio with me this afternoon burns Hi welcome aboard again\nHaving the in the studio with you\nUm we're nearing the end of our fund drive and um I like to create a sense of urgency that you can see the opportunity right now to give\n'em right if you've been thinking about it maybe you've been listening and you haven't you haven't given you've been listening for months a year or more and you're finding you like what you're hearing you depended upon what you're hearing and you're thinking oh my neighbor will do that but the thing is is you\nNeed to step up it's time for you to step up and give to the music and programming and news that you rely on each day I'm so many people are interested in the programming and information and music and\nIt becomes a part of your daily schedule and as we near the end of our fun drive we have a great give away to finish out to find Dr for uh some tickets to Bob Dylan in Springfield and a night at tower square hotel\nUm to be entered to went into this contest go to any NPR dot net and call one eight hundred sixty nine eighty five zero\nYou know it's really cool when we can do two things at once well we're dedicated to bringing great music and keeping you up to date on the latest news\nHigh quality news in the morning and afternoon when you're looking forward and great music throughout the day this public radio services supported by listeners each person contributing an amount they choose to support the station they simply can't live without\nTaking them on right now and support the station that provides the best of both worlds whether you contribute ten dollars a month or two hundred dollars a month\nThirty dollars a month you decide and make your contribution at N. E. P. R. dot net recall one eight hundred six three nine eight eight five zero\n... I did grow up listening to WFCR but there's always something that was on at my parents' house and now they've moved away of kept listening and it's not something that my friends listen to either so it's kind of counter cultural and away my favorite is broke but any kind of classical music that's pretty good\nGrowing up in this area is pretty amazing just because of all the talent that surround the one that comes to mind is the ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I ... you\nKnow so it keeps everyone in tune with the talent that's in the area knowing that WFCR relies on your health I just kind of felt bad taking that resource and not doing anything about it so I figured I could do my part maybe things will sound a little clear a little bit nicer knowing that you helped and I think maybe that's true\nIt is true and it's true and if you grew up listening to New England public radio or maybe you listen to another public radio affiliate and have moved to the area and came to school here and uh you're in school and you enjoy the classical music or stick around to that and the New England region\nAnd listen to New England public radio each day well now it's your chance to become a member of the family and join in at any P. R. dot net or call one eight hundred six three nine eight five zero\nAnd everybody's doing their part ages said that he just does a little part but you know it's a being a ... a sustained her and it's another another person in the community and another person and before you know it New England public radio is fully funded and so don't think that the part that you do is too small it's just not the case\nI'd like to suggest the ten dollar a month level becoming assistant or at that level we can send you\nThe new thirteenth annual art mug here in New England Public radio designed by Murray bets Bartlett it's the four seasons mud you've got spring summer autumn and winter and eat the are the letters are well kind of interesting and it almost didn't see\nHere but I get it now while when you actually see a single under so it's a beautifully done mug the colors are outstanding and this is going to be one that you'll want if you are collecting the art mugs so visit our website and eat PR does that\nMake your contribution of ten dollars a month\nAnd a pick up the art mugs our way of saying things at that level you can also do that by calling one eight hundred six three nine eighty five zero\nAnd what a great way to wake up and enjoy the music that you love to hear 'em out of one of these Beautiful Mind stat Murray bats Bartlett made special for New England public radio and you\nAnd you can do that right now by or you can have that Mike each and every morning by going to any P. R. dot net are calling one eight hundred six three nine eight five zero and supporting and music and the probe\nStreaming of New England public radio was funded by ... architect of forty year legacy of combat but to community design celebrating the next generation of leadership ... red dot com\nYou this afternoon with music by American born composer kind of feel this is titled Christina world features the U.S coast guard band with the commander Adam are Williamson conducting\nNah nah nah nah\n\nNah nah nah uh\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nMm Mm\nNa na na na na na\nNa na\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n[noise]\n\n\n\n\n\n\n\nUsing my American composer Kennedy ... Christine as world than the performance of the U.S coast guard band lieutenant commander Adam are Williamson\nConducting a New England public radio in Amherst in Springfield in eighty five also Williams talented Ninety six three ended in ... P. R. dot net\nIs twenty minutes before one I'm John wacky were just twenty minutes away from Walter Carol taking over and getting into an afternoon the classical music he's got plenty to come he'll be talking a little bit about that before the top of the hour so stay with me meanwhile as you are listening today here in um\nStreaming of New England public radio is funded by you and they passed university graduate schools MSA and creative non fiction writer enrolling now for August twenty seventh applications at bay pest dot edu\nPartner here at the station and that means giving a certain amount of money to support the classical music on the news and everything that we do here at and eat PR\nThe way to do that in his visit our website and eat P. R. dot net or call one eight hundred six three nine eighty five zero and make a generous contribution as generous as your your budget will allow again in ... the website or call one eight hundred six three nine eight eight five zero burns max is with me in the studio burns welcome back\nHi John good to be here it's easy to take New England public radio for granted especially if you've been listening for years and\nAnd you're listening to fund drive and you find out there's music here and there and the train the fund drives a pitching in but I like to you to encourage you to consider\nA thinking about all of the hours that you listen to you and consider giving a contribution right now we won't ask you to add up all those hours and get back what you have to listen to I I I used to be one of those listeners I must have met\nWho would listen and less and and and didn't get and the guilt that happened\nDuring the fund drives because you're waiting for that moment for that peace to come up that you want to listen to you\nIt's just too much to bear so take it off your to do less you can go to the website there is an orange button and the top right corner that says donate and and you can click on that or if you would like to speak to a person you can go to one eight hundred six three nine eighty five the route\nYou're listening to New England public radio and the station that's made possible through listener contributions Ninety percent of the funding for the program and you're listening to comes from community support some numbers for you to know about today the operating budget for New England public radio for fiscal year twenty Nineteen is for a million six hundred fifty thousand dollars\nAnd that works out to twelve thousand seven hundred and forty dollars a day to bring you everything that we do on a daily basis and to knock it down a little bit further five\nHundred and ten dollars an hour to make the classical music possible the news and information and everything that we do on an hourly basis your contribution will help us defray those costs and during this fund drive during these fund drives what we're doing is we're trying to get the funding in the door to me\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic other repairs AS these are defined technicians and Massachusetts state inspections seek he's garage dot com\nThen a contributor before they would be a great day for you to come on board our final Thursday in our fall fundraiser and become a sustained her at ten dollars a month or twenty dollars a month or thirty dollars a month and that will help us do what we do best and that brings great classical music\nNews and information jazz in the evenings entertainment programming on the weekends and so much more visit our website and eat P. R. dot net or call one eight hundred six three nine eight eight five zero\nHi this is Kenneth Fuchs I'm an American composer the music of our time of our country is crucially important for people to understand as I Hope they understand literature and painting listener supported radio just as\nPublic supported education such as the university that I work at the University of Connecticut the people themselves are making a statement about what is important to them and that's why public radio is so crucially important in the engagement of our community\nIt's true it isn't it in an important part of our community and it's important to engage those thoughts and conversations that you have kind of the it's a\nBrought to us Christine as world and that brought a conversation between me and John about the wife painting and those conversations\nThe and the music that you listen to\nThe conversations that brings between you and your friends and your family are important as you go through this world and um go and interact in your community\nAnd you can be a part of this you can be a member of any PR and support this programming that you love to listen to and that you love to think about\nSo to do that you can go to any P. R. dot net or call one eight hundred sixty nine eighty five zero\nWe are just a hundred and three dollars away from making the two thousand dollar amount here in New England Public radio the dollars have been raised from folks who started giving at nine o'clock this morning\nThank you to the twenty three folks who've made a difference here in New England Public radio and made their contributions becoming ... becoming part of the community that we like to call the and if your family folks supporting what we do here on New England public radio\nStreaming of doing when public radio is funded by you and killing rental architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nAnd send you to music western from one of their concerts this year that Fifteen dollar a month level you might want to catch Simone dinner student playing box Goldberg Variations or here the box cutter mechanics hall\nThe Shanghai offer a symphony orchestras going to be in town in February there's so much more you can choose one of those will be sending those passes as our way of saying thank you at that Fifteen dollar a month level and I'd like to say don't miss your chance\nMake your contribution and request or is now at ... ... or call one eight hundred six three nine eighty five zero\nOr maybe consider getting a hundred dollars a month it's really not that much um if you're able to do at least certainly would appreciate it and it would make up for the hours of listening that you have not contributed to or it's\nUm and it's a great way to get back to any PR and the programming that you love\nA hundred dollars a month there's a lot of things you get it as we now we have a lot of great and you get to give you that that's a incentive for you to give but it's not really why you get you get because you love this thing is that that you listen to\nEvery day um to do so to become a member of New England public radio it's pretty easy to do you go to any P. R. dot net or call one eight hundred sixty nine eight eight five year old\nClassical music on an NPR is funded by Ewan Kathleen Collins wealth management of north Hampton working to empower women men and their families towards financial independence K Collins wealth dot com\nAnd the Harvard symphony orchestra celebrating its Seventy fifth season opener with pictures at an exhibition with Carolyn Kwan conducting October fifth through seventh Hartford symphony dot org\nAnd Greenfield savings bank with offices throughout Franklin in Hampshire counties including their new Hadley location across from the town hall online that Greenfield savings dot com [noise]\nMusic by Welsh composer Paul Miller is next to this afternoon to selections featuring the ensemble tenant brain this is the world's the clustering spheres and blessing Nigel Short is conducting\n\nStreaming of New England public radio is funded by you and the hotel or Santa offering six meeting on the basis for a board room to room with a the equipment and the house catering hotel north Hampton dot com\nEm [noise]\n\n\n\n\n\n\nRight [noise] you're a\nMan\nA\n[noise]\n\n\nOr [noise]", "year": "2018", "show_name": "Classical Music with John Nowacki", "city": "Amherst", "day": "04"}