{"month": "10", "state": "MA", "station": "WFCR", "content": "You make all of this program impossible we greatly appreciate your support if you have yet to support New England public radio please do so now the Web address any PR debt net call us at one eight hundred six three nine eight eight five zero\nEDITION on any PR is funded by you and Blue Cross Blue Shield of Massachusetts helping connect the dots with a Medicare plan that fits all lifestyles eight eight eight eight\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall gene CVS dot org\nRestoration and fine art printing celebrating Twenty years with an open house on October nineteenth details at ... media dot com [noise] this is eighty eight five WFCR in Amherst W. N. N. Z. A. M. six forty Westfield W and end the FM Ninety One seven Deerfield\nWFCR eighty eight five HD three Amherst W and and you eighty nine five great Barrington\nW. N. N. I. Ninety eight nine Adams W. A. I. C. Ninety One nine Springfield and W. A. M. H. in eighty nine three immersed in partnership with Amherst College and UMass Amherst and it any P. R. dot net it's nine o'clock\n[noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\nMan\n\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org [noise]\n\n\n\n\nUse it for a BBC Television production featuring\nThe history of the English speaking peoples and that was music by Walton the march for history of the English speaking peoples the London full amount of orchestra with Carl Davis conducting on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and that in ... maps\nI've joined the wacky good Tuesday Morning thank you so much for joining me this morning there's plenty of music ahead including music by Peter ... will get to just a few minutes\nAlso music by William I'm John Williams this morning music but Bob Mueller and a little bit later on music by Darren hug him and called WC lots for you to enjoy and explore on this Tuesday Morning\nJohn ... program directors with me in the studio this morning we're here asking you to support the programming you value and enjoying New England public radio rescued or become a sustain are right now and join the end if your family at N. P. R. dot net her call one eight hundred six three Ninety eight eight five zero John good morning\nGood morning John we had a very good morning this morning with\nA MORNING EDITION we had a lot of support from listeners who are value the news programming a New England public radio\nIf you value the news and if you value classical music on New England public radio please take a moment to show your support by becoming a member or by making a a an additional gift or perhaps renewing your support whatever your circumstances are\nTake a moment to show your support to New England public radio by making a contribution at any P. R. dot net or by calling us that one eight hundred six three nine eight eight five zero and uh if you make your\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nCourtesy of New England public radio we have a pair of seats at the Boston opera house far Hamilton uh one of the hottest shows ever to play Broadway those are that's a matinee performance on Saturday October thirteenth\nAnd that'll be followed by dinner at eastern standard kitchen and Ken more square\nSo go to one eight hundred and go to call one eight hundred six three nine eighty five zero or go to any P. R. dot net to make your contribution to support news and classical music on New England public radio and that opportunity to win tickets to see Hamilton\nWe're asking you to support classical music programming news and information programming the jazz in the evenings everything that we do here we brings you each and every day and then we ask you a couple of times during the year to help support it and this is one of those times you know many folks think that a large portion of New England public radio is operating budget comes from the federal government when in fact\nNew England public radio gives a much smaller percentage from the federal government than was once the case we rely much more local support and that's where you come in Ninety percent of what you listen to a New England public radio is funded by the community so when we're asking you to do your part we're asking you to become a sustaining member today\nAt ten dollars or twenty dollars or maybe even thirty dollars a month\nAnd then help support the station because with out your support our mission wouldn't be possible choosing them out this morning and then make the call at one eight hundred six three nine eight eight five zero or you can pledge on our website and eat PR dot net\nMy personal view about learning is that you can never learn enough my name is Ruth best screen I have been a listener to end a PR for forty five years\nI got very interested in listening to the states should because of learning so much about classical music and being able to hear the history of this owns who the composers where I Am really thankful to have\nThe kinds of musical experiences that the station provides so that I can continue learning more about the things that I Am interested in I feel it's my responsibility and my duty to contribute to help the program today\nStreaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com at one\n\n\n\n\n\n\n\n\nUm\n[noise]\n\n\n\nTriumphantly from the ashes that was the Phoenix by Peter ... and that was the London symphony orchestra conducted by Peter board himself from New England Public radio in Amherst since ... eighty eight five votes on William Thomas Ninety six three and a and E. P. R. dot net\nI've joined the ... this is New England public radio ... fun drive there's plenty of music still to come your contribution right now is a vote for the programming you care about because this is a listener funded station in Ninety percent of funding for everything you hear a New England public radio comes from our community today we're asking you to give ten or Fifteen\nAnd tell you when to give to handle it came from and they are you could win two great the that the Boston opera house and dinner afterwards that eastern standard answer now in any PR dot\nYour music requires donate now at ... P. R. dot net or call us at one eight hundred six three nine eight eight five\nZero John both of your program directors with me in the studio this morning Jon welcome back\nThank you John and I know that throughout the hour you occasionally hear John and his colleagues who are on the air say things like programming on New England public radio is made possible by you\nAnd you may not pay attention to that all the time but it's a statement of support it's it's how we are funded as John said Ninety percent of the finances\nFor a New England public radio come from the local community the local community in the form of local businesses who support us through underwriting\nAnd most importantly from listeners listeners just like you find value\nIn our classical music programming in our news programming in our jazz and entertainment programming it's listeners who are the lifeblood of support for New England public radio and this is one of those times when we're asking you to support us by making a contribution maybe you've never contributed to New England public radio before\nAnd we're asking you to do so with a sustaining gift of seven dollars a month or maybe it's time for you to renew your support many times\nContributors are a renew every fall maybe you're in that position and maybe you can renew with a dollar a day gift or maybe you could make an additional gift of one hundred dollars whatever your circumstances are\nPlease take a moment this morning and make a contribution at any P. R. dot net or an one eight hundred six three nine eight eight five zero we need about four hundred dollars more to go before ten o'clock to reach our meaning goal we can do it with your help\nYou know listeners sometimes ask how much should I contribute to the New England public radio and the answer is it's entirely up to you but some figures for you this morning or operating budget for the fiscal year is four million six hundred and fifty thousand dollars and\nThat works out to twelve thousand seven hundred and forty dollars a day and break it down ... pi by the hour and that's five hundred ten dollars an hour to bring you the music that you're listening to this morning\nWell think about how much you listen and then please please the value and you're listening and amount that fits your budget\nInterviewing two tickets to Hamilton from an e P R you could win two great seat at the Boston opera house and dinner afterwards that eastern standard\nAnswer now in any PR dot and it\nTakes to bring you on board and to have you be assistant of this morning and that would be ... fantastic I like to suggest the ten dollar a month level because we have the new art mode that we've been talking about the thirteenth annual ... it has been produced by Murray bets Bartlett it's a beautiful mug\nHas for panels on it representing the four seasons and and the PR have a look at it at our website and eat P. R. dot net or call us at one eight hundred six three nine eighty five zero make your contribution of ten dollars a month and we can send the art book to you as our way of saying things\nI'm married that startling children's book author and illustrator and graphic designer I designed the artwork for this year's mug I made it right and cheerful and reflect as ah any PR and its listening audience originally I just thought it would be fun to do the artwork\nBut as I worked on it I did feel like you know this is for something that I Believe in I Believe in any pay are and I'm really glad to be able to contribute what can you can see the design at any P. R. dot net\nAnd Marie bats Bartlett art mugged at displays or those collages of the four seasons can be yours for your contribution of ten dollars a month you sustaining gift to New England public radio and think about that in kind of a weekly terms that's two dollars and fifty cents a week\nAnd you can't even go anywhere and get a cup of coffee for two dollars and fifty cents pretty much these days\nSo think about how much you use New England public radio think about the value that it gives you in terms of quality news reporting from National Public radio and from the NPR newsroom and think of the great music that John in Walter and our classical music department presents and think\nI guess that's worth two dollars and fifty cents a week make your contribution right now at one eight hundred six three nine eight eight five zero or at any PR debt that we need about four hundred dollars more in in the next thirty five minutes to to meet our many goal we can do it if you help out\nAnd then many goal but we're talking about is a thousand dollars by ten o'clock and we can achieve that goal if you'll take a moment and make your contribution at N. E. P. R. dot net or call one eight hundred six three nine eight eight five zero classical music on in ...\nInterviewing two tickets to ... and ... P. R. you could win ... seats at the Boston up or how they didn't have to worry that eastern candor\nEnter now in any P. R. dot net\nMade sausages in select smoked meat more information at ... dot com\nAnd Hartford symphony orchestras celebrating its Seventy fifth season opener with pictures at an exhibition but Carolyn ... conducting October ... through seven Hartford simply do to work at a gift from the Richard ... funded the Hartford foundation for public giving\nYou stick by John Williams is next this morning from Jurassic Park this is welcome to Jurassic Park in the studio orchestra being conducted by John William [noise]\n\n\n\n\n\n[noise]\nUh\nStreaming of New England public radio is funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I see dot edu [noise]\nThese are matinee tickets for the performance on Saturday afternoon October thirteenth\nAfter the your your trip to the theater you'll be treated to a wonderful dinner at the eastern standard kitchen in Kenmore Square in Boston fabulous restaurant I've been there\nSo all you have to do is go to any P. R. dot net\nMake a contribution there or call us at one eight hundred six three nine eight eight five zero you'll be supporting the classical music that is so important to you you also be supporting all of the other programs including the news here in New England Public radio\nYou can pick up a thank you gift and you'll be entered into the contest to win tickets to see how will turn on Saturday October thirteenth\nEleven folk so far have made their contributions they become sustain your New England public radio now we're waiting for you to join the family becoming an eat your dinner with your gift of ten dollars or Fifteen dollars or twenty dollars a month\nWe have thank you gifts that all those different levels you can see those at ... dot net where you can also make your contribution this morning or you can call us at one eight hundred six three nine eighty five zero\nThose have already done so thank you thank you thank you if you haven't yet\nNow is chance for you to do that very same thing\nClassical music I'm In ... is funded by you and the hearts brook school accepting applications for the ... Eighteen\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nThought warmth of heart strings of purpose heartbroken dot org\nAnd paradise city arts festival two hundred fifty jury artist makers from across America this coming weekend that the three county fairgrounds in Northampton paradise city aren't dot com\nAnd the good news garage a local New England nonprofit moving neighbors need toward self sufficiency with donated corners vans and trucks good news garage dot org or eight seven seven give auto\nYou stick by was composer Paul Miller is next to setting of Avi Maria this is the ensemble tend to break Nigel Short conduct [noise]\n\nUh\nUh\nUh [noise]\nUh\nUh well I I don't know I [noise]\n\nReally [noise]\n\n\n[noise]\n\n[noise] um Mm uh\nNo [noise]\n\nAnd truly she's tickets to handle things from and P R you could wait to see that the Boston opera housing dinner afterwards that eastern standard and you're now in any P. R. dot net\nA na\n\n\n\n\nNa\nA oh\nUh\n\n\nOh oh\n\n...\nOh\n\n\n\nOh God\n\nOh I'm running or\nOh my God\nOh\nMy\nGod I don't know [noise]\nScreening of New England public radio was funded by you and they pass university graduate schools MS and higher education minister ration rolling for October twenty second applications that they pass dot edu\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\nAh [noise]\nOh\n\nOh [noise]\n\nOh um God\n\nOh um [noise] oh\nOh\nUm [noise] oh\nUm\nUm\n\nOh\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with Avi equipment an inhouse catering hotel north Hampton dot com\n[noise]\nBad\nReally lush beautiful setting of Maria by Welsh composer Paul Mueller tend to break conducted by Nigel Short on New England public radio in Amherst in Hartford at eighty eight five also in ... Ninety eight three ended in ... P. R. dot net\nI'm John the wacky good Tuesday Morning I had a conversation with Paul Miller and it was one of my podcasts presto pod cast you know here that podcast at N. E. P. R. dot net and here about Paul's outlook on music and how his of his musical career was shaped by near death experience when he was a young child\nAnd to let him into becoming a composing a composer he is today fascinating story and it was a delight talking with him check out the podcast presto at N. E. P. R. dot net\nTell you what laws there this morning make a contribution to the station that brings you pull Miller's music and the PR and that we can we'd be delighted to have you on borders to sustain this morning at ten dollars a month or twenty dollars a month or Fifteen dollars a month\nCall one eight hundred six three nine eighty five zeros you can make your contribution there as well but we're asking you to take that step and become an N. E. P. R. sustain her\n\n[noise]\n\n\nStreaming of New England public radio was funded by you and they have university graduate schools and I say in creative non fiction writing enrolling no for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n[noise]\n\n[noise] the ... for strings by Peter ... novel Mariner conduct in the Academy of St Martin in the fields on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ended in ... P. R. dot net\nIt's three minutes after ten I'm John wacky thanks for joining me on this Tuesday Morning I Would like to say thank you to the Fifteen folks who made contributions in the last hour\nAnd helped us to make our one thousand dollar goal we really appreciate that and that's good to go into the programming here in New England Public radio and that's how the station is funded a contribution at a time and this is our fault fundraiser\nAnd I would like you to think what you get when you tune in and then take action to protect it\nAs a non commercial nonprofit radio station or listener contributions that are central to what you listen to Ninety percent of the funding for the programming you here comes from some unique community support\nSo we're asking you to take action right now and give it in a PR dot net or call one eight hundred six three nine eight eight five zero John ... with me this morning he's a program director and he's got more about our fall fundraising efforts good morning John\nGood morning John we've as we heard from some of our listeners and we thank them for their support Matthew\nFrom Brookfield contributes because of the classical music on New England public radio no I'm from New Hartford, Connecticut\nI he says that MORNING EDITION makes his commute much better and he and his family love listening to wait wait on the weekends\nTara from East Hampton I listen every day independent for keeping me aware and educated I trust any PR thank you so much for your support police joined listeners like them by making a contribution right now to New England public radio we were able to successfully may make our goal for the first hour of this program\nBut it's a new our so we have a new goal we're looking for an additional one thousand dollars before eleven o'clock this\nStreaming of New England public radio is funded by you and they passed university graduate schools and as a in creative non fiction writing enrolling now for August twenty seventh applications at bay pest dot edu\nLike the ... for strings that you just heard\nIt's an easy process I guarantee it'll only take a couple of minutes you can do it two ways you can call us said one eight hundred six three nine eight eight five zero or you can go to any P. R. dot net click on the pledge button and you can make your contribution there\nYou can also take a look at the many thank you gifts we have for your contribution on our website and as we've been saying if you make a contribution before all things considered tomorrow you'll be entered into a contest to end up here a matinee tickets to see Hamilton in Boston on Saturday October thirteenth\nPlus a wonderful dinner at the eastern standard kitchen and in Ken more square in Boston\nYou know this is listening to the ... but but ... the oven Maria by Paul Miller a little bit ago it just reminds me that this is a place where you can come\nTo get a break from all the instant messaging and the world that we live in and\nYou know keeping up with the news is good but taking a break from it is important as well it's listeners like you who provide New England public radio with our single largest source of income and that's how classical music you're listening to stays on the air for asking you to make a gifted generous contribution right now so that will make what we do possible\nThanks for calling one eight hundred six three nine eighty five zero or contributing at an ... P. R. dot net\nMy name is Eileen sound in a long time contributor to public radio I Know some people medicate what I Do is I listen to public radio and I feel more centered after I usually get around that time on my birthday 'cause I consider it it gets to myself\nBecause it does make me feel grounded to listen you know it's almost like investing in a good pair of shoes [laughter]\nThank you Arlene I Love I Love that\nThe fact that she uses New England public radio as a kind of censoring a device around I think that's what we were a touching upon earlier with some of the the music being able to bring bring you to that kind of space [noise]\nLet me suggest a few uh a possible contributions if you're new to New England public radio or maybe you've never made a contribution in the past how about a first time\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nWhite ideas a coffee mug for your sustaining gift at seven dollars perhaps you could make a dollar a day gift to think about\nAll the things that you spend over the course of a day on and think about how much you use New England public radio for perhaps for the news perhaps for classical music\nA dollar a day breaks down to a thirty dollar ... sustaining contribution a month and for that will send you the brand new anti PR baseball shirt or maybe you can make a special gift in support of classical music of one thousand dollars whatever works for your budget whatever you can afford please take a moment\nMake your contribution right now is one eight hundred six three nine eighty five zero keep us on track for our goal of one thousand dollars before eleven o'clock or you can make your contribution also by visiting us online at any P. R. dot net\nMusic from the late Spanish Renaissance is next for this morning this was a music featuring the ensemble or she ought to Christina ... conducting my name's Douglas coast I'm from east meadow in Massachusetts chill it contributed to any PR ... future [noise]\n\nIn band and the fact that they they make listening to New England public radio in our classical music programming a game of guessing what the pieces are and and a band or a young young man enjoying listening to classical music I just find that so so wonderful and so inspiring and\nBe like forests in bend be a supporter to New England public radio with your contribution at one eight hundred six three nine eight eight five zero or online at any P. R. dot net we're looking for about nine hundred dollars before eleven o'clock to make our our legal we can do it only if we hear from you\nClassical music on an NPR is funded by you and Greenfield savings bank with offices throughout Franklin Hampshire counties including their new Hadley location across from the town hall unlimited Greenfield savings dot com\nAnd the Harvard symphony orchestras celebrating it Seventy fifth season opener with pictures at an exhibition with Carolyn one conducting October fifth through seventh Hartford symphony dot org\nAnd Thomas Douglas architects and architecture and interior design studio designing renovations of historic landmarks including the Academy of music she does Douglas architect dot com\nMusic by ... next to this morning the concerto number ten in B flat for violin and strings this is the Italian ensemble interpret events Yani [noise]\nStreaming of New England public radio was made possible one you know by the keys garage in Williamsburg offering foreign and domestic on the repairs yes these are defined technicians Massachusetts state inspections seek he's garage dot com\n[noise]\nStreaming of New England public radio was funded by the un cute little architects of forty year legacy of combat but to community design celebrating the next generation of leadership that killed ... dot com\n[noise]\nStreaming of New England public radio was funded by your aunt Sally solar\nA local company install like roof ground amounts and do all access trackers\nHelping households lip carbon free for one tree\nValley solar dot solar\n[noise]\n\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org [noise]\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by un June ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n[noise]\nMm\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic under repairs and you ask each certified technician Massachusetts state inspections she keeps garage dot com\n\n[noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and the good house catering hotel north Hampton dot com [noise]\n\n[noise]\n\nThat enables us to translate your financial support into the programming that you rely on that you and you enjoy that you depend on programming like news from National Public radio in the any PR newsroom classical music with John and Walter every weekday between nine AM and four pm\nA news from all things considered at the at the end of the day in the afternoon jazz at night wait wait and says you on the weekends is all made possible because of listeners like you\nMaking financial contributions and again the best way to do that is making a small sustaining gift where you contribute a little bit every month\nIt just takes a couple of minutes to take that first\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nSecure website at any P. R. dot net or by calling us saying one eight hundred six three nine eighty five zero in when you make your contribution before the end of all things considered on Wednesday you will be entered into a contest to win tickets to see Hamilton in Boston\nOn a Saturday October thirteenth a matinee performance\nFollowed by dinner at the eastern standard kitchen in Kenmore Square\nClassical music on NPR is funded by you and Smith orange resenting music in the new number featuring violinist Joel pitch on performing works by Bach recall if you have been Chrysler Wednesday at twelve thirty Smith dot edu slashed Smith arts\nAnd the center for equal technology accepting donations of kitchen cabinets another building materials to keep them out to the landfill ISI old building bargains dot org and a gift from the Richard ... funded the Hartford foundation for public giving\nYou stick by American composer Darren hugging his next these\nOur wedding dances from his opera bandana this is the north Texas when symphony Eugene corporations conducting a\n\n\n\nA a\n\n\n\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households lip carbon free and the poor one three valleys solar dot solar [noise]\n\n\n\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by ... rental architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nAnd you're doing to kick it to handle in from an e P R you could lead to great seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\nUh\n\n\n\n\nInterviewing two tickets to Hamilton from an e P R you could win ... seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\nAnd you're doing two tickets to Hamilton from an e P R you could win ... seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org [noise]\n\n[noise]\n... and\nPianist when it's prior playing music by called WC his first Rhapsody for clarinet on piano on New England public radio in Amherst in Springfield that idiot five also in Pittsfield at one oh six one and that in ... P. R. dot net\nIt's eleven twenty five I'm John wacky good Tuesday Morning thank you so much for joining me this morning\nNew England public radio is a place that you can come to get a break from the instant messaging world that we live in keeping up on the news is good but I think taking a break from it is important as well\nIt's listeners like you who provide New England public radio with our single largest source of income and that's how the classical music you care about stays on the air I'm asking you to vote for him if you're with your gift a generous contribution that will make what we do possible\nThanks and advance for calling one eight hundred six three nine eighty five zero or contributing at N. E. P. R. dot net with more about our fall fund drives here is Rima dial we're not welcome back\nThanks Jon we are looking to raise five thousand dollars before ... pm will you join us and become the newest member of an E. P. R. we've heard from folks in Amherst to drift in Amherst to calls in\nA to support the station and to support our Media Lab ... and lives that friends Southampton he says I value of having the programs rate at my fingertips when I Want it\nYes we are here for you when you turn on the radio or when you click on your app or when you go to the website and stream our classical music or news so call us right now like one eight hundred\nStreaming of New England public radio is funded by you and cute little architects or forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nFifty dollars or a hundred dollars a month or join us online at N. E. P. R. dot net\nYou know we heard from a listener earlier in East Hampton who said I really enjoy and value the classical music you play each and every day music lights and I'm going to fill this music but Peter board this morning and John Williams and use it by Paul Miller music but Peter war luck\nMusic by during Haagen unquote WC which we just heard and so much more it's quite a variety I think you'll agree and I hope that you'll agree it's worth supporting with your dollars right now it N. E. P. R. dot net or call one eight hundred six three nine eighty five zero\nMoney Douglas cos I'm from east long meadow in Massachusetts so I'm a contributor to any PR price contributor originally from ... in Scotland\nPerhaps this is most relevant for someone isn't originally from the United states when you come here and you find that you go from illegal for a drink and you leave a tip and that's how you pay barman that's the way I see this as\nYou would not sit through a meal take that Sarah walk out the door and leave nothing for the person that produced it for you for a PR to continue to exist people like me half to put some money on the table\nThank you so much for that wonderful testimony now and let's follow our friends lady here by paying Forest Service right so one of the services we provide you is curated music\nMy friend John and my friend Walter and Tom rainy and ... they take the time in their day to really\nPut together the right\nRight play list that you will hear and then they'll tell you something about the composer is about the musicians\nAbout that that the ... in the piece I Love listening to music here on New England public radio for that reason I'm smarter because I Know what's behind the piece of music I'm listening to\nSo will you join me by making a contribution to New England public radio become our newest sustain her\nAny P. R. dot net or call us at one eight hundred sixty nine eight eight five zero\nThis is a nonprofit public radio station and you can tell because of the high quality what you hear each day and\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I see ... to\nThe service I think about all you've heard on the station and just the past few months and that's what your gift to spent on bringing equality radio and when do you continue to listen to your public radio station and here's something you really like you know that you made it possible when you make your contribution\n\n\n\n\n\n[noise]\n\n\n\n\nUh\n\n\nThe setting of unused day by Samuel Barber are we working I've visited ... for strings for chorus and that was the choir of new college Oxford Edward Higginbotham conducting on New England public radio in Amherst in Springfield that eighty eight five also in Williams town in Ninety six three ended in ... P. R. dot net\nIt's Nineteen Minutes before twelve I'm John wacky thank you so much for joining me this morning\nYou're listening to great classical music on New England public radio news has been created with funding from listeners just like you\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nUnity I'm asking you to join the folks who are part of the community of ... to the station by\nMaking a contribution at an ... that are calling one eight hundred six three nine eight eight five zero contribute out because you want to keep New England public radio and classical music on the air joining me in the studios this morning ... rental welcome back\nThank you John this is the fall find Dr here at New England public radio and his chance and we're asking you to give now to what you listen to on the radio\nSo if you're listening to us how about giving us a contribution at ten Fifteen or twenty dollars a month and John here's the exciting thing when folks give to us right now we will enter them into the Hamilton that gave away\nThat's for two tickets at the Boston opera house on October thirteenth that two PM matinee and then you'll be treated to a wonderful dinner at eastern standard kitchen and drinks\nAt Kenmore Square so call us and right now in well not only enter you into that drawing but you'll keep us on the air one eight hundred sixty nine eight five zero or online at any P. R. dot net\nIt's a great opportunity so don't miss a be sure you entered now than you could be the winner of this very special day in Boston from any PR these tickets for Hamilton\nYou know your contribution support everything that you hear a New England public radio but it also finances how you hear is by helping to pay for utilities and upkeep and are transmitters through the purchase and maintenance of our broadcast and recording equipment the streaming of all our services on the Web and so much more\nAnd it takes a lot to run a radio station with your help will keep doing our best to bring you the best and your support is essential call in a one eight hundred six three nine eighty five zero or make a contribution online at an E. P. R. dot\nI enjoy the classical music programming here because it's curated it's classical music but with the quality of the commentary that goes with it will certainly when I'm a contributor I feel like I'm listening to my public radio station\nAnd I think that's important there's a level of commitment I Know how committed any PR is to its listeners and I also really appreciate\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I ... you\nBoard member of the any PR foundation and I am indeed a contributor\nThanks Tim this is indeed your public radio station and asked him said what he enjoys is the quality of the commentary\nAnd that's something different that you get here when you listen to classical music on any PR versus just any other streaming service that is a computer driven\nA radio service so call us right now to pay for what you listen to eight hundred six three nine eight eight five zero how about forty dollars a month at fifty dollars a month or a hundred dollar a month gift you can go online at any P. R. dot net\nWhen you hear is a listener funded public radio what we're really saying\nIs thought provoking well crafted programs listener funded means your money that helps pay for those programs and not only the programming itself but the transmitters the computer's electricity everything it takes to bring you those programs if you've already made a contribution to the day and there are twenty ... twenty for folks who have done that\nThank you thank you so much because you become the listeners and listening funded public radio joined them today with their contribution of ten dollars a month or twenty dollars a month and select one of our thank you just have a look and make your selection to make your contribution at any P. R. dot net or one eight hundred six three nine eight eight five so\nWe need your help today we need your help right now will you become the newest member of any PR call us at one eight hundred sixty nine eighty five zero or online at any P. R. dot net\nHow about a monthly gift of ten Fifteen or twenty dollars a month whatever fits into your budget but don't wait call us now at eight hundred sixty nine eight five zero or online at N. E. P. R. dot\nI've got to talk about it it's sitting right in front of me I just love it so much\nThe thirteenth annual ... available for ten dollars a month for your gift right now for you to phone Murray bets Bartlett is the one who designed this year's mug she won the competition\nAnd it is for panels one with each letter the station in ... P. R. and each one is one of the four seasons so spring for daffodils daffodils for spring rather a beautiful cornfield in the summer and then when a fall is a beautiful leaf\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of combat but to community design celebrating the next generation of leadership at ... riddle dot com\n[noise] it has a winter scene of a tree with snowflakes and it's actually made up like electronic components it's really really cool\nIf you're a collector of the most you will want this one I promise you take a look at it and he does that make your contribution of ten dollars a month and select that as our thank you gift to you call one eight hundred sixty nine eighty five zero if that's easier for you and make your contribution there\nNot only is it a month for all seasons but it symbolizes that we are your radio for all seasons winter spring summer fall we are here for you were here for you when you need it lacks in coverage\nOr hear from you when you don't want to hear election coverage and you want a sanctuary\nFrom the noise of your daily life and the news\nThank you to those who have given and if you haven't why not become the newest member of any ... right now call one eight hundred sixty nine eight eight five ... or join us on the line at N. E. P. R. dot net\nClassical music on in ... is funded by you and the forty sixth annual apples and craft artist unfair in Woodstock, Vermont featuring jury crafts jewelry Arcton specialty foods October sixth and seventh Woodstock wreck dot com\nAnd Blue Cross Blue Shield of Massachusetts helping connect the dots with the Medicare plan that fits all lifestyles eight eight eight eight hundred eight to zero four and a gift from the Richard ... government funded the Hartford foundation for public giving\nMusic by ... next in the tournament for strings in the major here's Los Angeles philharmonic orchestra with ... president conducting\nStreaming of New England public radio was funded by ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that would rolling for fall gee C. V. S. dot org\nMembers time and time again that they listen to us because they want to get smarter they want to hear the stories\nBehind the music and the stories behind the news so called right now at one eight hundred sixty nine eight five zero pay for what you listen to\nGo on line at any P. R. dot net how about a gift of forty dollars a ... a hundred dollars a month or just cleaning or support today for five hundred dollars\nDon't wait call now one eight hundred sixty nine eight five ... or online at any P. R. dot net\nI Love the slots at roots been listening for forty five years and is this is just wonderful you may be one of those folks to who's been listening\nFor many many years to do the USC are and you may be a long time supporter of the station if you are thank you so much you're doing your part you're making the programming possible but if you've never given before I'd like to consider a gift of seven dollars a month\nAnd we can send us our thank you get the new donor like bolt mugs a bright idea and that's one way that you can show your support\nWhen you drink out of your your coffee or tea in the morning on your desk at work or at home and to remind you that you become a sustaining partners here at New England public radio that's what we're asking you to do right now\nBecome a sustain or join the N e PR family visit our website in ... better call one eight hundred sixty nine eight eight\nFive zero would you like to learn some more was like to have more music or write music by Malcolm are suitable for Japan is next I don't know if you've heard this before removed this performance is the ... in\nA flat major and this is pianist junkie moral park [noise]\n\n\nScreening of New England public radio was funded by you and they pass university graduate schools and the s in higher education administration enrolling for October twenty second applications that they pass dot edu [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nMm\n\nStreaming of New England public radio was funded by you at ... university graduate schools and I asked in higher education at ... at rolling for October twenty second applications that they pass dot edu [noise]\n\n\n\n\n\n\n\nScreaming at the ... public radio was funded by you and killed ... architects a forty year legacy of combat but to community design celebrating the next generation of leadership at ... dot com\n\n[noise] John ... Parker playing ... a flat major on New England public radio\nWhere it's twelve ... it's ... minutes after twelve it's just going to do that the other way round [laughter] well I Know what it is the the show painted it took me immediately back to our trip\nUp to follow the footsteps of ... that will be visited ... Warsaw or you know we've got to hear of Chopin we've got to ... to really wonderfully gifted piano playing Chopin in places a trope I knew\nAnd so that was an experience of sitting in those places cheering show punch music gifted young pianist being up to close your eyes it just imagined that it would show putting himself play it was just so absolutely magical well you might not have been on that trip but with you\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I ... you\n... you just get that feeling you can get that food and you're hearing the composer himself you're shooting the composers voice I Love being able to bring that experience to you on a daily basis and what I'm asking you to do right now during her full fundraisers help\n\n\n\nAnd to do when you get to handle in front of an e P R you could win two great the at the Boston opera house and dinner afterwards the eastern standard enter now in any P. R. dot net\n[noise]\n\n\n\n\n\n\nPercent of English dances by Malcolm Arnold and that was the only orchestra would broaden Thompson conducting on New England public radio in Amherst in Hartford it eighty eight five all some great Barrington in Ninety eight seven ended in ... P. R. dot net\nIt's twelve twenty three I'm John wacky good afternoon thanks so much for joining me in this state\nNew England public there is a place that we can come to get a break from the instant messaging world that we live in keeping up with the news is good but you don't take a break from it is important as well\nListeners like you provide New England public radio with a single largest source of income and that's how the programming you care about stays on the air please make a generous contribution so that\nStreaming of New England public radio is funded by you and killing riddle architects or forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nIt's three nine eight eight five zero or make your contribution that in the PR dot net with more about our fall fund drives here in the studio with me this afternoon is Rima dial remote will come again\nGood afternoon John and we're hoping to raise five thousand dollars before one o'clock won't you help we need to hear from you\nAnd twenty five other folks to raise thirty one hundred dollars that's not a lot of money left to raise and I know you can help us do it call us at one eight hundred six three nine eight eight five zero or join us on line at any P. R. dot net and John if folks give right now whether it's a gift of\nTwenty dollars a month thirty dollars a month or forty dollars a month we will enter them into our Hamilton contest and that's a\nThe winning the winner will be chosen on Wednesday afternoon and it's for two tickets to see Hamilton on Saturday October thirteenth at two PM at the Boston opera house and then we throw in dinner\nAt eastern standard kitchen at Cannes more square so don't wait jump on the phone right now an eight hundred sixty nine eight five zero or online at N. E. P. R. dot net\nI've got a question for you as you're listening this afternoon that is how long does a twenty dollar bill stay in your wallet between buying lunch or coffee run or picking up some groceries before going home at the end of the day it doesn't take long before you're down to change again and what are we got to show for it\nWell whatever you choose to dedicate to this public radio station whether it's ten dollars a month or Fifteen dollars a month or two hundred dollars a month whatever amount you decide you're still getting more than you're giving especially if you listen often\nSo what can you afford to give to a New England public radio you're always going to get lots more in return support and eat pure now at one eight hundred six three nine eight eight five zero or contribute online at ... dot net\nName is Alan sheer I'm from ... Connecticut if I go on the Internet if I search out music\nOther people know what I'm listening to where I'm going and maybe they're going to try to sell me something or maybe they're going to use my information to get profit from but by turning on the FM dial no one knows what I'm listening to accept myself\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I see ... you\nAway from the commercialism of modern society and it allows me to just really relax and get deeper into the reason I'm listening which is the music\nAnd the music needs to be supported so I'm happy to help and support public radio in that endeavor because I'm grateful to still have the avenue\n[noise] thank you Alan from ... Connecticut and are you like Allen looking to break away from modern society and that's why you listen to us\nIf that's the case joins us now as a New England public radio member with a gift to have twenty forty or sixty dollars a month to pay for what you listen to go online at any P. R. dot net or jump on the phone at one eight hundred sixty nine eight eight five Sarah\nIs interesting Allen was talking about that idea of\nKind of getting away from the modern world but not that you're not going to live in it every day but this is a place where you can come on a regular basis to kind of get a respite from\nThe news and the activity going around you and this is a way that we can accompany you throughout your date as you're working or whether you're at home or whatever you might be doing we can be a companion to you to bring you great music\nAnd that kind of give you a feeling\nDuring your day I I like that do that again you know\nThat sort of know you can get you get your news again you can pick up on the events of the day when we bring a news back with all things considered this afternoon but this is your place right now we're glad to be able to bring the music to you know we're simply asking you to help pay for it to help make it possible\nOf a contribution of twenty dollars a month or thirty dollars a month\nMaybe forty dollars a month you decide what it's worth to you to have that space and make your contribution now at ... dot net recalled one eight hundred six three nine aided by a river\nAnd don't forget when you gave right now we will enter you into that Hamilton contest a winner will be selected after all things considered tomorrow so don't wait you'll get two tickets\nTo the Boston opera house performance of Hamilton at two pm on October thirteenth enroll even send you to dinner call us at one eight hundred six three nine eight eight five zero or join us\nStreaming of New England public radio is funded by you and killed riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nSays Hamilton if you're the winner of this of course is taken in seeking Broadway by storm you can't get tickets in New York well almost all the time that I've I have friends have been trying for four months to go in there get tickets you can't get tickets but we've got two and they're yours\nMaybe you'll be a winner you we don't know unless you enter and eat P. R. dot net you can make your entry there are one eight hundred sixty nine eighty ... while you're there and make your contribution to New England public radio that brings classical music each and every day\nBrings your great news and information programming brings huge as in the evenings and so much more ... P. R. dot net or one eight hundred sixty nine eight eight five zero\nThank you for all the learning that you've given me already today listening to the wonderful classical music John and if you're like me that you appreciate the stories behind the music give a gift right now listen\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org\n\n[noise] you stick by Italian composer from just goes up by who was part of a group of ... in Milan area in the ... the early to mid Seventeen hundreds\nYou've been listening to a symphony and number three in B flat buys up I ... the European ensemble with funding morality conducting a New England public radio in Amherst in Springfield at eighty eight five also in North Adams at one oh one one ended and eat P. R. dot net\nIt's twelve forty one I'm John wacky good Tuesday Afternoon and thank you so much for joining me today\nIf you've been listening throughout the course of the morning into the afternoon you've been listening to music by\nBy Walton this morning by Peter boy your music but John Williams Peter war lock\nMusic by Mozart's involved the un during hugging music by Francesco ... that you just heard knowing much more\nAnd if you've been listening for any length of time to the station and are not yet a contributing listener to the station didn't take a moment and be assisting or today become part of the end if your family of people who support the station with dollars and that's what it takes to bring this to you on a daily basis\nA ten dollar a month contribution will help today twenty dollars a month to thirty dollars a month well you can see did whatever fits into your\nBudget and then make that contribution now it in a P. R. dot net recalled one eight hundred six three nine eight eight\nFive zero joining me in the studio this afternoon is Rima dial ... welcome back\nGate ... think about how often you listen to a New England public radio if it ...\nStreaming of New England public radio is funded by you and cute little architect or forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\nRadio fit into your budget typically our budgets are reflection of how we want to spend our time and\nSpend it with the things that we value the most\nSo seven dollars a month that seven dollars a month is an affordable way to fit New England public radio into your budget and maintain the independence and financial health of your favorite radio station that seven dollars a month and as I think you're gifted will send you are new donor light bulb mug\nDon't wake call us now at one eight hundred sixty nine eight five zero or join us online at any P. R. dot\nNet you know many people think that a large portion of New England public radio is operating budget comes from the federal government but in fact New England public radio gets much smaller percentage from the federal government than it once did we rely much more on local support ... percent of what you're listening to um New England public radio\nThat support comes from the community so when we ask you to do your part what we're asking you to do is make your contribution\nBecause with out your support our mission simply wouldn't be possible Jews in them out right now please and make the call it an ... an excuse me at one or two hundred and sixty nine or ... or you can make your contribution online at N. E. P. R. dot net\nMy name is Rachel handling and I must sustaining partner for New England public radio I Need to support the things that I truly believe in that I use every day even if it's just on a very small level not just once or twice\nBut continuously so that those things are always there there's also that little nagging voice that's like you do just a little bit more couldn't you just give a little tiny bit more and you know the answer to that is yes yes of course I can\nShowing Rachel by saying yes yes you can make a donation become the newest member of any PR by calling us at one eight hundred six three nine eight five zero or join us online at any PR dot net\nRachel did say that just supporting us a little bit each month is what keeps her engaged with her favorite radio station\nAnd so that you are listening to us and then also paying for what you listen to how about a gift\nStreaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nOr ... why an eight hundred sixty nine eight eight five that\nI'm going to throw some numbers around this afternoon the yearly budget for a New England public radio for fiscal you're twenty Nineteen is four million six hundred and fifty thousand dollars now let's break that down to a daily amount it takes twelve thousand seven hundred and forty dollars to bring you this day of programming\nAnd that breaks down for the five hundred ten dollars an hour to bring you classical music and news and information programming and all the things that we do here\nNow you might be thinking so just tell me what my hundred and twenty dollar contribution is going to do to defray the cost of well here it is\nYour contribution combined with the neighbors contribution across the street combined with others throughout our listening community\nThat's what it takes to make this radio station possible that's what it takes to make us a success as you joining together with other folks in this community that support the station it's not just you alone it's you and you and the other folks in the community so\nDon't hold back take a moment but not too long decide what it's worth to you to hear classical music each and every day\nThe news and information programming and everything that we have and then make the contribution in that amount and eat P. R. dot net or call one eight hundred six three nine eight eight five zero\nJohn how much fat in our five\nHundred and ten dollars an hour wouldn't it be great to get a five hundred and ten dollar gift right now\nSure because that would mean somebody paid for an entire hour of music\nOften one eight hundred sixty nine eight five there are online at any PR debt now\nI'm going to suggest a level her months because I Love the N. E. P. R. M. thirteenth annual arts mug it's available for ten dollars a month as assisting or this time around\nThe designers by Murray bets Bartlett and it is gorgeous if you collect the mugs you're going to want to at this one of your collection\nIt shows the four seasons for panels daffodils for spring a beautiful summer field for summer obviously a ball is an autumn leaf filled with all kinds of folks who are making their applauding and eat PR and then there's a winter scene for the are at the very end\nIt's beautiful and you're going to want to add this as I said to your collection for ten dollars a month\nIf you'd like that make your contribution now at ... P. R. dot net or call one eight hundred six three nine eighty five zero\nMinutes and mud for all the events\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nListening to don't wake college right now like one eight hundred sixty nine eighty five zero where the gift that either twenty forty or sixty dollars a month or go on line to any P. R. dot net\nClassical music on in the PR is funded by you and your cons Jorgensen Center for the performing arts in stores presenting an evening of flamenco with company up ... Eduardo ... on Wednesday October third at seven thirty\nAnd Worthington assembly in the circuit board manufactured in South Deerfield working to keep manufacturing jobs local to the community more Worthington assembly dot com\nMusic from the late renaissance Italy is next by Giovanni one I'm In the this is a NATO on the tune bottle do ground do cut and the ensemble is lots of each with junk to bury conducting", "show_name": "Classical Music with John Nowacki", "year": "2018", "city": "Amherst", "day": "02"}