{"month": "10", "state": "MA", "station": "WFCR", "content": "Thank you to everybody who was already supported any PR\nEDITION on any PR is funded by you an artist and beverage cooperative no offering catalyst ... now on top at better life whole foods\nInterviewing people get to Hamilton from an e P R you could win two great the at the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nPleasant journey used cars in Northampton offering pre own vehicles with the twelve ... twelve thousand mile warranty inventory a pleasant journey Todd I'm\nThis is eighty eight by WFCR in Amherst WN in the six forty AM Westfield W and then the FM Ninety One seven Deerfield WFCR eighty eight five each the three ... W and then you eighty nine five great Barrington\nW and then I Ninety eight nine Adams W. A. I. C. Ninety One nine Springfield\nAnd W. A. M. H. Amherst Ninety year rather eating nine three in partnership with Amherst College UMass Amherst and that any P. R. dot net it's nine o'clock\n[noise]\n\n\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org [noise]\n\n[noise]\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts student now enrolling for fall genes CVS dot org [noise]\n\n\nJohn Williams conduct in the Boston Pops orchestra it'd be kind of Lincoln's Ruslan a look Milo overture a New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and that in ...\nSix minutes after nine good Wednesday morning I'm John the wacky thank you for joining me this morning\nI had for you in this hour music by ... performed by the north Texas wind symphony music by John Adams and Eric would occur a little later this morning music by heightened ... Mozart much much more for you to enjoy and explore on this Wednesday morning\nIf this is the place where you come to hear classical music on a regular basis\nI Am asking you to help make this music possible and that means becoming a sustained her today during our fall fundraiser the way you do that as this at our website N. E. P. R. dot net and make a contribution there are called one eight hundred six three nine eight eight five zero\nJoining me in the studios right now is our program director John both see John good morning\nOr good morning John in it is a good morning I'm looking at what you have planned out for the\nStreaming of New England public radio is funded by you and they passed the university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nToday for listeners to show their support to New England public radio for all that we do\nBoth our classical music programming our news our entertainment programming it is all made possible by you and if you make your contribution today you will be entered into a contest that we will make the drawing on this this afternoon at the end of all things considered to wait a pair of tickets to see\nA Hamilton in in Boston a matinee performance on Saturday October thirteenth followed by dinner at eastern standard kitchen in Kenmore Square\nBut the important thing is to support the programming that you love the programming that you depend on joined people like a nice uh from North Hampton Melissa from East Hampton says it's an essential part of my day every single day Sarah from Conway\nKelsey for months in and Robert from Holyoke gives because I listen if you're like Robert please think about how much you listen and make your ten dollar amount contribution year one hundred dollar contribution at any P. R. dot net or act one eight hundred six three nine eight eight five zero\nWe have a goal of five thousand dollars to raised by one o'clock this afternoon so you're one hundred twenty dollar pledged can work out to just ten dollars a month\nThat'll make you sustain are here in New England Public radio and that will help us get closer to our five thousand dollar goal by one this afternoon can we make it that's the question I think we can if you will take a moment\nAnd make your contribution now whether it's ten dollars a month Fifteen dollars a month to twenty dollars a month\nYou make the decision of what will fit into your budget but make the decision to make your contribution\nNow at ... dot net or call one eight hundred six three nine eighty\nZero my name is Kenneth Fuchs American composer music grows out of the American symphonic school my favorite composers were on Copeland and Leonard Bernstein I'm Wim showman than ... percent cutting my teacher so I wanted to speak the language but in my own voice\nIt's essentially important that listeners here contemporary American music understand how it's developed and what it sounds like and hear the voices of today and tomorrow\nThe airwaves music talk on the radio creates a community doesn't it to be actively engaged in your community through listening understanding where either\nStreaming of New England public radio is funded by you and valleys solar a local photovoltaic design at installation company serving people and planet to live carbon free and the four one three valleys solar dot solar of being a living breathing America\n\n[noise]\n\n\n[noise]\n\nMm\n[noise]\n[laughter]\nScreening of New England public radio was funded by you and they sat university graduate schools and asked in higher education administration enrolling for October twenty second applications that they pass dot edu\n\n\n\n\n\n\n\nThe whole first sweet in ... for wins and that was the north Texas when symphony\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nIn Pittsfield at one oh six one and it and eat P. R. dot net\nIt's nine twenty four I'm John wacky good Wednesday morning ahead for you in just a few minutes music when John Adams and then a little later this morning news by or would occur music by a heightened coming up later this morning and music by ... much much more lies ahead for you on this Wednesday morning\nThis is the place where you can get great classical music each and every day of the week you get great insightful news and information programming you'd get jazz in the evenings you get entertainment programming on the weekends and so much more\nIf this is the place that you enjoy all of those things take a moment and support this station this public radio station\nThis community resource is looking for your support during our full fundraiser visit our website in a PR dot net to make a contribution recall one eight hundred six three nine eight eight five zero Martin Miller's with me in the studio this morning Martin welcome\nThank you John good morning and you know New England public radio has a thriving community if public radio fans who are connected by their love of the most beautiful music ever made\nYou have a lot in common you know you're passionate about music that's inspiring and challenging you expect your host to be knowledgeable you value culture and are willing to support it so please join your fellow listeners already stepped up to help support New England public radio\nAnd please do it right now it takes just a few minutes to become a member we have now just four thousand dollars left to raise one thousand in in the first twenty four minutes thank you very much\nIt takes a few minutes to address supportive\nTen dollars a month or thirty dollars a month or whatever you can afford because you're passionate about classical music close at eight hundred six three nine eighty five zero or contribute online at any P. R. dot net we're asking you to become assisting are here in New England Public radio and that means giving a certain amount per month\nTo support the programming that you value and enjoy I have a level I'd like to suggest for your gift to Fifteen dollars a month to the station we'd like to thank you with a pair of passes to the Springfield symphony orchestras Seventy fifth season\nKevin roads is conducting a program of Mozart's Mozart Mahler there's a star studded cast of soloist bringing music a Broadway to Springfield and the season finale is an evening of trick husky and ... those are just some of the selections that you could make\nStreaming of New England public radio was funded by you add bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nPledged to New England public radio now these passes or limited so please be sure to make your contribution now and request your passes at that Fifteen dollar a month level when you become a sustained her at N. E. P. R. dot net recall one eight hundred six three nine eight eight five zero Hi\nMy name is Margaret I live in Amherst and I'm a public radio listener and supporter for many years in the morning I listen to MORNING EDITION but then I often leaving on for classical music and music is amazing and very often I learn\nNew pieces new composers and I didn't know\nSo there's so many things about public radio then I could never get on any other station\nWell marketed you were like many of our listeners are talking about commonalities before\nA who like a lot of what they hear a New England public radio uh for example Mary from ... Connecticut who says I don't know what I Would do without any PR genes or from East Hampton says I'm happy to have any PR as a source of news I commute two hours to work every day and that is how I stay informed\nTracy from Amherst who says I listen to it so often in the car for news and much of the other programming I feel spoiled having its wealth variety of programming available I could have on and on I could go on and on but I've got to get my daughter to the dentist [laughter]\nObvious it's easy to take a new public radio for granted\nWell that's that's very sweet and thank you for letting us know that you only have so much time but it took only a few moments I Believe for Tracy to do that and still get her daughter to the dentist you can take a few moments right now and joined her and help us raised four thousand dollars by one PM\nBy giving it to a thirty dollar month level with a ten dollar a month level or perhaps the first time at the seven dollar month level of sustaining member eight hundred six three nine eight eight five zero or any P. R. dot net\nSo many reasons to give to a New England public radio whether you've been a long time listener or whether you're just found us there you might like everything you do that we do here you might like just a few things like the news or classical music\nYou may listen to little listen a lot but however much you are listening please take a moment now and make your contribution whether it's ten dollars a month or\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nA one eight hundred six three nine eight eight five zero classical music on in ... is funded by you and Thomas Douglas architects and architecture and interior design studio designing corporate office in years including time and bond in Westfield she Douglas architects dot com\nAnd Blue Cross Blue Shield of Massachusetts helping connect the dots with Medicare plan that fits all lifestyles eight eight eight eight hundred ... to zero for\nAnd the Hartford symphony orchestra celebrating its Seventy fifth season opener with pictures at an exhibition with Carolyn ... conducting October fifth to seven Hartford symphony dot org\n[noise]\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nCity\n[noise]\nFrom the opera Nixon in China music when John Adams the chairman dances and the performance by the San Francisco symphony orchestra eight and a bar conducting on New England public radio in Amherst in Hartford at eighty eight five also great brings in Ninety eight seven and that in a PR dot net\nIt's Eighteen minutes before ten I'm John wacky good Wednesday morning thank you so much for joining me this morning and I hope that you will stay with me for more great music coming up in just a few moments\nFrom the top Sunday baroque this is where you hear music you can't hear anywhere else classical music throughout the day as well\nYour contribution right now is a vote for the programming you care about because this is a listener funded station Ninety percent of the funding for everything on New England public radio comes from our community\nRescue to give ten Fifteen or twenty dollars a month and help us raise the funding that your music requires and you can do that by donating now at N. E. P. R. dot net recalling one eight hundred six three nine eight eight five zero Martin Miller's with me in the studio this morning Martin welcome back\nThanks John good morning every one I Want to thank right off the bat Alina from South Hadley\nStreaming of New England public radio is funded by you and they passed the university graduate schools MSA and creative non fiction writing enrolling now for August twenty seventh applications at bay path dot edu\nAnd not support independent news stations in a donor from Northampton appreciates the thoroughly reliable source of news and music and a listener from chicken be notes it's one of my local stations will thank you to all of those contributors\nAnd he's probably just we're just one of your local stations but unlike other stations who get their revenue from commercials we have businesses that underwrite because they support New England public radio but the largest part of our support comes from you our listeners\nNot from commercial sponsorship so we're asking you to join this partnership becoming a sustaining partner in New England Public radio perhaps at twenty dollars a month or forty two dollars a month\nAnd if that doesn't work maybe ten dollars a month the phone number is eight hundred six three nine eight eight five zero and John we have just three thousand eight hundred and forty five dollars no trees by one PM you can also make your gift online securely at any P. R. dot net\nWe've dedicated to bringing your great music and keeping up to date on the latest news high quality news in the morning and afternoon when you're looking for great music throughout the day this public radio services supported by listeners each person contributing an amount they choose to support the station they can't live without\nI'm asking you right now to make your contribution to support the programming that provides the best of both worlds\nOne eight hundred six three nine eighty five zeros the number you can call or visit us online and make your contribution at ... dot net\nWhich house on ... [noise] that particular in England\nThat I live right now like the holiday is classical music that I hear every day [noise] cats continues to\nNational with rioting offered [noise]\nInformation without any additional starts composers I Love all [noise]\nWell I Will say is one of the managers your station we agree with you and the quality and that has a lot to do with our host Jon ... in our hosts Walter Carolyn all of our host because they are knowledgeable about classical music\nAnd they are ... for you and you're doing an excellent job and we're asking you to support that job right now by calling us at eight hundred six three nine eight eight five zero\nStreaming of New England public radio is funded by you and bay path university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu\nSay John that um when people told me there was this incredible musical and Broadway called Hamilton\nHip hop I thought I have no interest in that whatsoever even though I like some hip hop I like music of all John ...\nBut then it went eleven Tony Awards and I said because I Love Broadway or I'd have to pay attention to [laughter] thing and I listen to the soundtrack and I was blown away now you have an opportunity to see Hamilton\nWere giving away a pair of tickets to see Hamilton in Boston you will also be treated to a wonderful dinner eastern standard kitchen\nBut you're running out of time to get into the contests were going to pick the winner\nTonight at six thirty after all things considered\nOne eight hundred six three nine eight eight five zeros where you can be entered into the contest and you can make a contribution to New England public radio\nWhen you make your of when you get entered in their four and a PR dot net you'll find a secure pledge page there you can also entered the contest while you're there have a look at the thank you give us we have available to you at the different levels whether it's ten dollars a month or two hundred dollars a month\nThirty dollars a month you decide but please make your contribution to New England public radio so we can continue bringing you the news and information that you use to get a grip on the world around each and every day classical music that I bring you in the morning Walter in the afternoons on the weekends the Pepsi and John ...\nTom reading in the news and the jazz in the evenings and there's so much more you know what's here were dedicated to bringing it to each and every day and now we're asking you to become a sustaining list or a partner with us in making it possible one eight hundred six three nine eight eight five zero or an E. P. R. dot net Martin\nJohn we have a Linda from Greenfield to thank 'em she gives because of the fascinating stories and fact based reporting\nWe are all in your debt that are from Linda thank you and we are in your debt Linda and everyone else who makes the contribution named cat from Northfield and Brian from Greenfield who gives because of our excellent stories because they produce wonderful dinnertime conversations with my family\nWell so many different reasons to give to New England public radio so many different reasons to listen for news for music I Know that many of you have told me personally that you love having a classical music care because you want an escape from the news we all do from time to time\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nAnd we're asking you to just do a small part of it whatever you can afford we make it affordable by asking you to make a sustaining gift of just ten Fifteen or twenty dollars a month at eight hundred six three nine eight eight five zero or at any P. R. dot net\nClassical music on and a PR is funded by un constitution records presenting the parlor opera players in a game of wearable for the ... center in Hartford at seven thirty on October eleventh tickets Bushnell dot org\nAnd birch are eagle under local ownership since twenty sixteen working to provide more coverage of the virtues and western Massachusetts subscription information at birch are eagle dot com\nAnd the gift from the Richard be government funded the Hartford foundation for public giving\nYou stick by Eric Whittaker is next to this morning this is sleep the Eric would occur singers are conducted by Eric would occur himself\n[noise]\nWhen\n[noise]\n\n\nI have another gift idea for you that we can give you for that Fifteen dollar a month level\nWell thank you for power passes to music western you might want to catch some own dinner steam playing box Goldberg Variations of the ... theater or the Bachmann caught and mechanics hall\nLittle later on you could hear the Shanghai opera symphony orchestra there'll be in town in February there was a whole bunch of listings that you can see take a look at our website and a PR dot net make your contribution at Fifteen dollars a month and we would be glad to send you a pair of passes to music was there for one of their concerts\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ... you\nKnow it in ... P. R. dot net or by calling one eight hundred six three nine eight eight five zero Eighteen folks have made their contributions so far you can be next and supporting the station that you enjoy your New England public radio\nClassical music on in ... is funded by you and the fine arts center resenting max richer and the American contemporary music ensemble performing music from the HBO series the leftovers on October tenth fine\nArts Center dot com and coal broke realty services full brokerage services property management intended representation since Nineteen Seventy four officers in Springfield in Holyoke cobra real T. dot com\n[noise] you're listening to New England public radio WFCR in Amherst Springfield Hartford in partnership with human sandwiched ended in ... P. R. dot net usually by ... W Donna is next this is ... performed by the academic ... ... ... [noise]\n\n\nStreaming of New England public radio is funded by un they that university graduate schools and that's and applied data science enrolling for October twenty second applications that they pass dot edu na\n\nNa\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nMusic by little vehicle W done other ... and a performance of the academic ... you'd probably on a better rosy conducting a New England public radio\nIt's five minutes after ten I'm John ... good Wednesday morning thank you so much for joining me this morning I had for you music by Johan hurdle for Trump put an orchestra music by hiding from the creation music by Mozart mental some and much much more still waits for you on this Wednesday morning\nToday we are here during a fundraiser to ask you for your support of the classical music programming that you can hear each day the news and information and entertainment programming on so much more\nIf you have never been a contributor before to New England public radio so there'd be a great day to welcome you aboard as a sustaining listener at an amount per month maybe ten dollars a month or twenty dollars a month maybe thirty dollars a month is something you could afford to pay for the programming that you value and enjoy\nMake your contribution at N. E. P. R. dot net or call one eight hundred six three nine eight eight five zero\nMartin Miller are CEOs with me this morning in the studios good morning Martin welcome back\nWhen John thank you it's good to be here with this morning and good morning everyone I Want to thank Andrew from Williamsburg and sue from shelter and falls and Nick from Northampton and Erin from Northampton Melissa from Springfield Susan from Greenfield and Kerry from Florence\nWho supports NPR because if I go to source for the latest news because they believe in supporting our local station and more broadly\nBecause wait wait don't tell me never fails to make me laugh and smile well there is so much going on here and so many reasons to support new public radio I Want to thank everyone who's made a contribution this morning\nA one hundred and nine individuals have done that\nAnd right now John and I are asking you to help us raise one thousand six hundred and Seventy more dollars during this morning classical music program and we're asking you to become a sustaining contributor at some level\nTen twenty seven dollars a month because that's the most reliable source of income we have when you can sustain this station\nAre you in two tickets to Hamilton from an ... P. R. you could win two great seat at the Boston opera house and dinner afterwards that eastern standard\n... N. E. T. R. dot and won't\nFive zero or give securely at any PR dot net lots of folks think that a large portion of New England public radio is operating budget comes from the federal government but in fact New England public radio receives that much smaller percentage from the federal government then was once the case\nWe instead rely much more local support Ninety percent of what you listen to a New England public radio is funded by the community so when we ask you to do your part what we're asking you to do is make a contribution and joined the community supporting the station without your support our mission simply wouldn't be possible\nAnd I'd like to suggest that ten ten dollar a month level because we can since you of the thirteenth annual New England public radio arts mug as our way of saying thanks a designed by ... it has for panels which was just to pick the four seasons\nAnd uh it's beautifully done the coloring as absolutely spectacular whether it's the of my favorite I think is the ... the spring panel which is and and but it shows daffodils beautiful yellow and beautiful sunny and bright\nThen in ... also all for panels one for each season it is very very beautiful indeed have a look at our website ... P. R. dot net you'll find all of the thank you gifts there you can select a certain amount per month and receive a thank you gift but like I said I'm suggesting\nTen dollars a month on the ... I'm partial to this one\nOne eight hundred six three nine eighty five zero you can make your contribution by calling or visit our website ... P. R. dot net\nI'm ... I did grow up listening to WFCR I mean there's always something that was on at my parents' house and now they've moved away have kept listening and it's not something that my friends listen to either so it's kind of counter cultural and my my favorite is broke but any kind of classical music that's pretty good\nGrowing up in this area is pretty amazing just because of all the talent that's around the one that comes to mind is the Arcadia players WFCR promotes those groups and you learn about all the local events that keeps everyone in tune with the town that's in the area\nAsking you to make a contribution to New England public radio your generous contribution is what makes what we'd do possible makes an advance for calling one eight hundred six three nine eight eight five zero or making your contribution at N. P. R. dot net with more about our fall fund drive is Martin Miller CEO Syria is Martin ...\nWarning John thank you um well right now in our full fungi during this program we only have one thousand three hundred and fourteen dollars left to raise thank you so much for everyone who's made a contribution [noise] you know if you listen to the New England public radio every day or almost every day it might be hard to imagine it disappearing from your life\nIt's something you depend on like your utilities your electric bill or your telephone or think of it as a utility for your soul and if you think about new in public radio is paying for your your utility bill\nExcept that you set the rate you decide how much you want to pay here for New England public radio so we can keep supplying that rich challenging an inspiring music comes your way we want it to keep flowing just like your electricity\nBut you pick the amount so we're asking you to become a sustaining contributor with a gift of ten dollars or twenty dollars a month\nAnd this is something that will fuel and fill your soul for days and weeks in years to come keep the music coming to you keep it turned on by calling us at eight hundred six three nine eight eight five zero or contributing online at any PR dot net\nAnd think about a little bit of your contribution to New England public radio makes these things possible great local and national news reporting\nExcellent well researched music programs entertainment programming and so much more if this is important to you than please take a couple of minutes out of your day right now and make a contribution to New England public radio and make a real difference in what we do each day\nYou can do that by visiting our website and eat PR dot net and becoming assistant of this morning or by calling one eight hundred six three nine eight eight five zero I'm\nBarkley word and I live in Brookline Vermont we contribute gladly for two reasons the first is that we use it it's important to us because we ourselves get a great deal out of it then we\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nNews reporting GOOD Music or values that we went to promote and it turns out that any PR does a very good job of doing both of those things\nAnd so when we give to any NPR were investing in the promotion of a value that's important to us\n[noise] that's so true and think of the investments that have been made over the years and how much it's done to increase the services we have a New England public radio so it truly is an investment in investment if not only expansion but keeping things on the air that you love\n'em if ... you could you invest two dollars and Seventy eight cents a day you might pay more than that for a cup of coffee but\nFor two dollars and Seventy eight cents a day or eighty four dollars a month you can become one thousand dollar a year contributor to New England public radio as a sustaining partner\nYou can start that partnership right now at any P. R. dot net or eight hundred six three nine eight eight five zero and you're eighty four dollars a month will help us sustain and make sure that we can continue to grow and have a radio service here that you are investing in that will be here far into the future\nYou know I have another little to suggest for Fifteen dollars a month to New England public radio we can thank you with a pair of passes to the Springfield symphony orchestras Seventy fifth season didn't invite a guest to join us symphony hall for one of their concerts this year Kevin roads is conducting a program Mozart Mahler\nAnd a star studded cast of soloist will bring the music of Broadway to Springfield\nThey'll have a movie night with the Springfield symphony chorus and much more we'd be happy to send you to passes to the ss so this season for your concert choice for a gift to Fifteen dollars a month to New England public radio they are limited so please make your contribution and request yours right now at one eight hundred six three nine eighty five zero or at ... dot\nJohn here a few people who have invested this morning in New Hampshire Public radio and helped us\nGet to over ... Eighteen thousand dollars race in six o'clock this morning at from from Conway and Elizabeth from Southampton in Yulia from Springfield and a donor from Westport, Massachusetts who says I cannot imagine my life with out NPR in ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nAnd you don't really want that to happen on this is not really ... me being threatening this is me saying that costs go up every year keeping a station on the air is expensive\nAnd we will need more and more of you to help cover the costs are as the rate of ... or the audience ... basis of federal funding keeps going down so we must have you as part of our family Ninety percent of our funding\nA far programs comes from community support please make you're gifted eight hundred six three nine eighty five zero or give at any P. R. dot net\nClassical music on NPR is funded by you and WFCR partners Amherst New Hampshire Mount Holyoke in Smith colleges and the University of Massachusetts Amherst\nAnd celebrate Holyoke local music festival in downtown Holyoke featuring music food and are open to all this Friday through Sunday celebrate Holyoke mass dot com [noise]\nMusic by Johan ... next of shouldn't be just the pep talk what's what the music of move but this\nIs a trick Kona performed by the armonica attributes ensemble Lawrence ... Schmidt is conducting\n\nEntered when two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd turned out any P. R. dot net\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\nOne eight hundred sixty nine eighty five zero that's the phone number you can use to reach us or our website N. E. T. R. dot net um take a look on our website ... P. R. dot net and you can see the thank you gifts that are available to you our way of saying thanks when you make your contribution so whether you choose ten dollars a month or twenty dollars a month of thirty dollars a month or more\nThere is a thank you gift we can send you I Would like to suggest\nThe forty dollar a month level because we could send to use the New England public radio a ball jar Mason jar radio\nThe radio components are in the lid it's powered by two W. batteries a little speaker or not but it turns it on an extendable antenna and guess what it gets you eighty eight five that's the only frequency and we're proud of that\nBecause you shouldn't be listening to nobody else strawberry rhubarb preserves don't put anything in it please but this is it's a great little radio and its locally made and produce\nUm thank you for your contribution at forty dollars a month we'll send you the radio just one way that we can say thanks when you make your contribution at N. E. P. R. dot net or by calling one eight hundred six three nine eight eight\nFive zero\nClassical music on NPR is funded by you and the Republican serving generations of families with news and information designed to enlighten educate and entertain readers every day for more than one hundred Ninety three years\nAnd paradise to the arts festival two hundred and fifty jury artist and makers from across America coming this weekend at the three county fairgrounds in Northampton paradise city arts dot com and a gift from the richer and the government funded the Hartford foundation for public giving\nMusic by Johan hurdle is next to this morning a trumpet concerto in you flap here's heck in harden burger soloist with the ...\nStreaming up the ... public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee C. V. S. dot org [noise]\nAnd to to link to kick it to handle things from an e P R you could wait to see that the Boston opera house they dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\nStreaming of New England public radio was funded by ... riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\nEntered when two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house the dinner afterwards the eastern standard\nAnd turned out any P. R. dot net\n\nFor a gift of ten dollars a month we could send you the N. E. P. R. art muggy it's the new thirteenth annual mug this time around\nMarie ... made the design it's absolutely gorgeous for panels and eat P. R. each one a different season and if you like to take a look at it see what furniture I see it for yourself visit our website and eat PR dot net and you'll see that before you make your contribution\nIs just one way we can say thanks for your contribution today and a pure dot net or call one eight hundred six three nine eighty five zero\nJust nine hundred and twenty seven dollars to raise a during morning classical music today and you can be part of that as John said with your contribution just ten dollars a month for a lovely new thirteenth in a series of art mugs you can see it on line in any PR done\nScreening of New England public radio was funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications that they pass dot edu\nLead into the contest for the pair of Hamilton tickets going to be drawn tonight at six thirty eight hundred six three nine eight eight five zero or at any P. R. dot net\nClassical music on in ... is funded by un Worthington assembly ink a circuit board manufactured in South Deerfield working to keep manufacturing John local to the community more Worthington assembly dot com\nAnd the Harvard symphony orchestras celebrating at Seventy fifth season opener with pictures at an exhibition with Carolyn quantum conducting October fifth seventh Hartford symphony dot org\nMusic by heightened is next from the creation this is the heavens are telling what the multiverse requirement English Brooke soloist John Elliott gardener conduct\nIn on [noise]\nYou know when\nAre going to be [noise]\n\n\n[noise]\n\n\nI Know\nStreaming of New England public radio was funded by you and they have university graduate schools and asked and applied laboratory science and operations that rolling now for August twenty seven applications that they pass dot edu\n\nSlowly [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\nThe heavens are telling from a creation by harden the multiverse the choir and English broke soloist John Elliott gardener conducting on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and that in ... P. R. dot net\nI've joined the wacky there's more great music just ahead of the number and stay with me because\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nInvolved and asking you to take action to protect your source of inspiring arts programming Ninety percent of the funding for everything a New England public radio comes from our community so please give now at ... P. R. dot net recall one eight hundred six three nine eight eight\nFive zero contribute to make this fall fundraising campaign of financial success because you want to be able to count on classical music here for each and every day throughout the week with me in the studio this morning as Martin Miller our CEO Martin welcome back\nThank you John good morning is supporting public radio is quick and easy it just takes a few minutes to get on the phone or on line to donate to New England public radio the phone number is eight hundred six three nine eighty five zero or contribute online at any PR dot net\nJust let us know how much you like to contribute how'd you like to pay an answer a few quick questions you can even select a thank you give if you want for example our new art mug for ten dollar a month contribution is a sustaining contributor our new donor light bulb mug for your first time contribution of seven dollars a month\nWe even have an any pure baseball shirt as we think about the post season\nAnd the red Sox playing well the Yankees or Oakland or a gift of twenty dollars a month to get you that baseball shirts and it has a on a giant picture of logic\nBut also Nina Totenberg and Billie Holiday\nWhich shows you the eclectic mix that you have here in New England Public radio so take a few minutes and support another great year of classical music\nEight hundred six three nine eighty five zero or contribute online at any P. R. dot net I discovered what they all the three of them have in common it's great hair if you look at those caricatures of them they have great hair\nAnd that's why they're on their together I'm certain of it anyway one eight hundred six thirty nine eight eight by your guy knows about here there you are with my hair right exactly one eight hundred sixty nine eighty advisor or an e PR dot\nNet I've got a question for you while you're listening this morning that's how long does a twenty dollar bill state in your wallet well between buying lunch coffee run you get to see it doesn't take very long before your dumped a change again and what have you got to show for it whatever you choose to dedicate to this public radio station ten dollars a month or Fifteen dollars a month or\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nYou listen often so what can you afford to give to New England public radio think about it you're always going to get a lot more in return make your contribution this morning at one eight hundred six three nine eighty five zero or contribute online at N. E. P. R. dot\nNet my name is David Schneider I'm a contributing listener too WFCR I Love all the classical music I Am a classical musician myself how I feel like every time I turn on the radio it's a little quiz for me can identify that compose air can identify\nThat peace is there a real treasure it's not something we want to lose\nAnd for that we do have to all contribute not a lot but we all have to get something to let them know how this he asked if we are\nSo many different words are used to describe new public radio I Love the word treasure people actually do treasure the station and what it offers and right now I'm asking to support classical music I knew was a public radio\nThe son drives or why public radio works listeners or our biggest most reliable source of funding and that's why we're turning to you for a few minutes each hour to remind you of something very important\nAnd we'll public radio is on the air right now because of listeners like you who have stepped up to support the station so thank you everyone who's already made a contribution if you have a major contribution yet\nPlease join your fellow listeners in supporting the programming you rely on it just takes a few minutes to make your gift of ten dollars a month or thirty dollars a month or another amount at eight hundred six three nine eight eight five zero or online at any P. R. dot\nNet and reminder that when you enter your it's when you make your contribution you'll be entered when possibly be a winner of the tickets to Hamilton that we have\n[noise]\nAnd tell you when to give to handle it came from and ... are you could win ... feet at the Boston opera having dinner afterwards that eastern standard answer now in any PR gotten [noise]\n\n\nWell in his Joshua Bell and the English chamber orchestra paid her mom conducting the Dow Jones in ... for violin and orchestra by Mozart on New England public radio in Amherst and Hartford at eighty eight five ... Ninety eight three ended in ... P. R. dot net\nI've joined the wacky it's eleven twenty thank you so much for joining me on this Wednesday morning you'll have a chance to hear violinist Joshua Bell in the next hour with music or by called WC and she'll be playing with a ... day so a little chance to hear Mozart and um WC performed by Joshua Bell\nA good example of him being a very flexible and very versatile\nViolinist engineered it here in New England Public radio\nThere's more great music as I mentioned coming up it's been created with funding from listeners like you Ninety percent of the funding for everything that you hear a New England public radio comes from our community I'm asking you to join the community and become a sustained are today at N. A. P. R. dot net or call one eight hundred six three nine eight eight\nFive zero with me in the studios this morning is Martin Miller our CEO Martin good morning welcome back\nTo morning John and good to be here again and good to be here with you this morning we are looking for nine hundred and Seventeen dollars that will get us to our goal of five thousand dollars for morning classical music and you can be a part of that\nBy making your gift at any P. R. dot net of ten dollars a month or seven dollars a month or an amount that works for you when you contribute to New England public radio you joined a community of thousands of like minded listeners who\nBelieve classical music is a vital part of life we're a vibrant community connected by a common love of great music and New England public radio gives his music in this community home both online and on the radio because you in the public radio as part of your home join us in keeping classical music on the air\nStreaming of New England public radio is funded by you add bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\n... online our twenty four seven h._d. channel call now it eight hundred six three nine eighty five zero to contribute or give securely at any P. R. dot net it takes just a few minutes of support and then you have a whole year\nOf world class music here from New England Public radio this is a non profit public radio station and you can tell because of the high quality what you hear each day public radio asks you directly to support this service I think for a moment about all you've heard on the station and just the past few months\nAnd that's what your contribution spent on bringing you call it the radio and want to continue to listen to New England public radio and you hear something you really like you know you made it possible after you've made your contribution if you haven't yet done so take a moment and become a sustained her today by giving a gift per month whether it's ten dollars a month or twenty dollars a month [noise]\nThirty dollars a month you can make your contribution now at ... dot net or by calling one eight hundred six three nine eight eight five zero\nAnd ... I Lived in ... I've been part of the WFCR community since Nineteen Seventy two now my question has been in I live in Moscow half of every year and when I'm In Moscow I listened to WFCR on line\nAll the time in both the regular that if they are and the ... I couldn't have classical music any time of day or night I've always appreciated the differences in different countries and other European countries have good public broadcasting but\nNone is better than our wonderful NPR oh I'm so grateful that WFCR exist I just couldn't imagine not helping it continue to exist\nWell there is someone who's been on many countries and hurt a lot of\nRadio in other places instilled believes that we're the best and which is wonderful we love hearing that I'm the best for supporting New England public radio and listening online as she does when she's in Moscow a for part of the year maybe you're listening right now from some other part of the world or some other part of the United states\nOr we want you to be part of the family to you are already\nBecause you're listening to New England public radio now we're asking you to take the next step and supporters with your gift to thirty dollars or seven dollars a month or something in between at any P. R. dot net or by calling us at eight hundred six three nine eight eight five zero and helping us to get closer to the goal of five thousand\nStreaming of New England public radio is funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\nThank you so much twenty nine people have step forward and made contributions online are called in and uh so far just nine hundred Seventeen dollars left to go so I Do that five thousand we'd make quite a bit of\nA progress today and that's thanks to these twenty nine folks won't you joined them now and become the next person to make a contribution at New England public radio become a sustained her today and you're helping us do the best that we can to bring you what you enjoy and expect\nI'd like to suggest the Fifteen dollar a month level because if you can contribute that we can thank you with a pair of passes to the Springfield symphony orchestras Seventy fifth season they're going to be having a movie night with Springfield symphony chorus and don't forget to have an spectacular holiday celebration\nTheir season finale this year as an evening of Chuck ... and there's much more to select from we'd be happy to send you to passes to the ss so this season for your gift to Fifteen dollars a month to New England public radio\nTo passes are limited so the number of them is limited so please make your contribution and request yours right now at ... P. R. dot net or by calling one eight hundred six three nine eight eight five zero\nI was at opening night John and it was pretty special great concert and you can hear one of those for your contribution to Fifteen dollars a month and you can also enter now to win a very special day in Boston from any PR we have two great seats at the Boston opera house when Hamilton\nThe Broadway smash musical comes to town it's incredible show I've seen it I hate to admit it sometimes people say oh you got to see Hamilton and how did you get to take a while or you may have a chance to get these kids it's Saturday October thirteenth\nIt's at two o'clock matinee and then I Will treat you to a wonderful ... eastern standard kitchen\nWe end drinks in Kenmore Square that a is a possibility when you go to any NPR dot net or call that eight hundred six three nine eighty five zero\nBecause once you've entered we are going to um pick the winner tonight at the end of all things considered eight hundred six three nine eighty five zero or online at any PR dot net\nTo continue with music by Mendelssohn a young Mendelssohn when he was a teenager his folks were quite wealthy and quite well to do and they were able to actually afford musician so that Mendelssohn could experiment with different forms whether it was a smaller or kiss\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and the house catering hotel north Hampton dot com\nTeenagers drink symphony number two indeed this is the Hanover band wrote Goodman conducting\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\nWithout you so classical music is alive and thriving on New England public radio thanks to member support now it's your chance to join all the folks who have been making this happen for you in the past by becoming a contributor yourself\nTo help keep classical music on the air\nIn our region in your town in your city in your community\nPlease do your part and celebrate another fantastic your music with the gift of support\nCall us at eight hundred six three nine eighty five zero to make your gift of ten dollars a month or contribute online at any P. R. dot net to make your contribution of twenty dollars or thirty dollars a month as you hear a say so many times\nYou choose the amount but please do it right now\nYour contribution supports everything you hear a New England public radio but it also finance is how you hear us by paying for utilities and upkeep are transmitters\nThrough the purchase and maintenance of our broadcast and recording equipment the streaming of all our services on the Web and so much more it takes a lot to run a radio station and with your help we're going to keep doing our best to bring you the best that you hear each and every day\nYou're supports the central called in at one eight hundred six three nine eight eight five zero major contribution of ten dollars a month or two hundred dollars a month maybe thirty dollars a month or you can make that contribution online at N. E. P. R. dot net\nName is Adam Gordon and I support at any P. R. I. corrupted any PIN number even as a young child waking up to ... whenever I was driving my car on the way to work and even this year being a stay at home mom I Love looking you in the morning with my daughter and I'll have to keep the classical music on\nAnd said it's really a daily part of my parents' support it I support it\nAnd I do prefer to be a sustaining supporter\nBecause then that's something I don't have to think that much about it I just get once and I know it just each month it's happening without me thinking I Choose to support it because I think it's an important part of what's available out there and I want\nStreaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nThat can means that your children will be able to enjoy it in the future as well and uh we ask you right now to make your contribution because\nIt's important to make sure that this radio station is here for you it's also important to meet the financial goals that we've set in right now with um time running out in our full fund drive we have a little over fifty seven thousand dollars left to raise\nAnd we're asking you to be a part of that because the majority of our support comes from listeners so please make your contribution right now if ten\nFifteen or twenty dollars a month\nThat's a sustaining gift that you don't have to think about after you've made it it'll take you just a couple of minutes to do it\nAnd then we won't have to remind you with letters and you can hear these fund drives and just sit back and say I know I've done my part but the fund drive is the most\nSuccessful and easiest way we have to reach you for the very first time so please make that first time contribution at any P. R. dot net or call us at eight hundred six three nine eighty five zero\nListeners sometimes ask how much should I contributed to New England public radio and of course the answer is it's entirely up to you think about how much you listened to New England public radio and then place a value on you're listening and I'm up that fits your budget maybe ten dollars a month maybe twenty dollars a month maybe thirty dollars a month\nSo the answer is really to give us generously as you can to support the station that you depend on\nI'd like to suggest the forty dollar a month level because we have a new gift this time around that we can use to say thank you to you for your contribution it's the New England public radio ball jar Mason jar radio it's got the components in the lid the little speaker and the little knob that turns it on and off\nAnd then extendable antenna you can see this at N. E. P. R. dot net at our website and uh it's powered by two W. batteries by the way it's our way of saying thanks for your contribution\nBecause we just would love to be able to send us do something a little unusual and that forty dollar a month level goes a long way to helping support the programming here at New England public radio just one suggestion make your contribution at N. E. P. R. dot net or call one eight hundred six three nine eight eight five zero\nWe heard from Greg in glass and Barry Connecticut says any PR has always been my driving companion\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at a vet spaces from board room to ballroom with Avi equipment and in house catering hotel Northampton dot com\nUse your smartphone when you were in the car to go on line but I'm asking you to do it when you get your destination or before you leave\nA where you're at right now if you're going somewhere else or when it's convenient and if it is right now please go to any P. R. dot net or cost at eight hundred six three nine eight eight five zero and right now John we're now down to six hundred and thirty two dollars\nTo raise to get to the five thousand dollar figure we said as a goal during this this morning music would joined the wacky so please do your part right now one eight hundred six three nine eighty five zeros the\nPhone number you can use or pledge securely and generously at N. E. P. R. dot net and thank you\nClassical music on NPR is funded by you and Blue Cross Blue Shield of Massachusetts helping connect the dots with Medicare plan that fits all lifestyles\nEight eight eight eight hundred eight to zero for and the university museum of contemporary art resenting four freedoms but community dialogue about the role of democracy art and civic action October eleventh and twelfth\nMusic by Peter ... festivities at a performance at the London fellow Monica ... conduct [noise]\nStreaming of New England public radio is funded by you and they got the university graduate schools and asked and applied laboratory science that operation that rolling now for August twenty seven applications that they passed dot edu [noise]\n\n\nWell\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the basis for a board room to room with a the equipment to the house catering hotel north Nelson dot com [noise]\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall gene C. V. S. dot org [noise]\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online cage at twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org Mm\n[noise]\n[laughter]\n\nAndrew to win two tickets to handle in from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\n[noise]\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seat that the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\n\nNa\n[noise]\nSweet the burn what Simpson yet with Richard ... conducting on New England public radio WFCR in Amherst Springfield Hartford in partnership with us Amherst ended in ... P. R. dot net\nIt's eight minutes after twelve I'm John wacky good Wednesday afternoon thank you for joining me this afternoon and I hope you'll stay with me for music by Hungarian composer Dennis ... coming up in just a bit also Joshua Bell returns for music by called WC usually by sharper and more well\nTo Carol will be taking over one he'll guide you through the afternoon with more great music and you'll get your updated on the news starting at four with all things considered because independent media is more important than ever New England public radio\nAnd tell you when to give to handle it came from and they are you could win two great the that the Boston opera house and dinner afterwards that eastern standard answer now in any PR dot\nYour source of inspiring arts programming Ninety percent of the funding for everything on New England public radio comes from our community\n\n\n[noise]\n\n[noise] Mm\n\nNo [laughter]\n[noise]\n\n\nMm Mm\n[noise]\n\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by ... riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com [noise]\nTo do that\n\n[noise]\n[noise]\n\n\n\n[noise]\nNo no no no no\n[noise]\n\n[noise]\n[noise]\n\nMm\n\n\n[noise]\n\n[noise]\nUsually dances by Hungarian born Dennis I'll go and that was the powers would when we tap on the week\nStreaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nSix one ended in a PR dot net it's twelve twenty three I'm John whacking on this Wednesday afternoon thank you so much for joining me today this is New England public radio fall fund drive\nFrom the top Sunday baroque great classical music each and every day this is where you get to your music you can't hear anywhere else on the radio dial these days are very few places your contribution right now is a vote for the programming you care about because this is a listener funded station\nNinety percent of the funding for everything you hear a New England public radio comes from our community\nWe're asking you today to give ten dollars a month Fifteen dollars a month to twenty dollars a month what you can afford to help us raise the funding your music requires and you can donate now at ... P. R. dot net recall one eight hundred six three nine eight eight five zero Martin Miller's our CEO he's with me in the studio this afternoon Martin welcome back\nThank you John good afternoon we have a good news for you we have just three hundred and twenty four dollars\nLeft to raise and the next thirty five minutes and I know that can happen with your support because when you support New England public radio with your gift of ten dollars a month or twenty dollars a month\nThey all add up to the dollars needed to keep classical music and to keep New England public radio running year in and year out uh it's been working for the last fifty seven years and um I don't know how much longer radio will be around it's been\nSaid that it was going to die many times before and it still hasn't happened so I expected to be here for a long time but here in New England Public radio\nThe only way we can keep it here is with your contribution so please join the others who have their contributions today and in the past now just two hundred and Seventy four dollars left to go\nEight hundred six three nine eight eight five zero is the phone number to call us\nOr call or go on line to any P. R. dot net\nYou'll go out of your way for quality you don't mind paying a little extra for coffee or for wine or for a great dinner out because you love what you get and it's the same way here in New England Public radio were not the usual radio station\nWe don't pay for our programs in the usual way either we stay on the air one listeners gift at a time and that is where you come in\nOne two minute phone call and a few dollars from your wallet helps ensure a full\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nOne eight hundred six three nine eight eight five zero or give online at N. E. P. R. dot net\n... house on ... [noise] that particular healing\nThat I live right now like holidays in heck classical music that I hear every day [noise] jak continues to national with rioting offered [noise]\nInformation without any additional starts composers I Love all of\nThe quality of classical music programming here in New England Public radio another good reason\nTo support New England public radio and you may be wondering who supports the station\nYou may want to ask your friends family or co workers chances are if you know people who love classical music you know people who have contributed to help keep it on the air and because you believe classical music deserves a dedicated home on the radio joins like minded listeners who value in New England Public radio enough to support it\nIt takes everyone support to keep New England public radio going strong every gift makes a difference decide what it's worth to you and do your part\nContribute twenty dollars a month or seven dollars a month or another affordable amount in your budget by going online to NPR dot net or by calling us at eight hundred six three nine eighty five zero right now\nFor a gift of Fifteen dollars a month to New England public radio we can thank you with a pair of passes to music Worcester\nYou may want to hear civil and interested in playing box Goldberg Variations or you may want to hear or see swan lake by Tchaikovsky or you might want to hear the western chorus and their performance of voters requiem just a selection of the concerts you might be attending this coming season\nPasses to music was there are limited so please don't miss your chance to make your Fifteen dollar amounts contribution become assisting her and request yours now at ... or call one eight hundred six three nine eighty five zero\nDon't let a classical music be silenced take action now by giving it an E. P. R. dot net or by calling us at eight hundred six three nine eight eight five zero your gift means that we can remain non commercial and independent and everything you hear whether your gift is ten dollars twenty dollars or thirty dollars a month this is something you can do\nStreaming of New England public radio is funded by un day path university graduate schools MSA and creative non fiction writing enrolling now for August twenty seventh applications at bay path dot edu\n[noise] the one of just um a few listeners\nThat we need to hear from before one o'clock to get us to the goal of two hundred and Seventy four dollars and that's\nA people coming together to do that it may be just you can do that with your gift to thirty dollars a month or is it a few people coming together and maybe contributing seven dollars a month whatever it is do your part in any P. R. dot net or costs that eight hundred six three nine eighty five zero\nJust a hundred and forty dollars left to go that chain wow you were talking Martin so what are you ... I don't know but whatever you said was great we've heard from forty folks\nWho have made contributions today since we started at ... at nine o'clock this morning with a five thousand dollar goal but just a hundred and forty dollars away from making that goal you can make a difference right now if you can give a hundred and forty dollars that would be great we would have made our goal for today\n\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment that again house catering hotel north Hampton dot com\n[noise]\n\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nThe violin artistry of Joshua Bell and pianist ... even today in the violence and not a bike club WC on New England public radio in Amherst in Hartford at eighty eight five also great Barrington at Ninety eight seven and that in a P. R. dot net\nIt's Seventeen minutes before one I'm John wacky good Wednesday afternoon thank you so much for joining me today whether you enjoy music club WC or\nDennis OB GYN which we heard a little earlier Peter ... Peter ... is it by Mozart Mendelssohn and Eric would occur and stuff ...\nYou get to hear all of these composes in these different periods of music and so much more each day here in New England Public radio and I'm Glad you're listening and I hope that you've been enjoying the music but if you have not been\nNot been contributing to New England public radio we'd like to ask you to do that right now during our fall fundraiser\nHere you can make your contribution at N. E. P. R. dot net or call one eight hundred six three nine eighty five zero simply be as generous you as you can\nAnd support us here in New England Public radio make the music possible the news and information everything that we do\nMade possible by listeners support and we'd like to include you as a sustain her today here in New England Public radio with me and the station right now in the studio is Martin Miller our CEO Martin welcome back thank you John or as\nWe marched toward the one o'clock hour and Walter carols will be here and we marched toward our goal for this program I Want to thank some of our contributors ... square deal is from a lately contributes because classical music is needed for the soul\nAnd Charles and melt them from infield who feel fortunate to hear\nBoth stations in Florida I assume that this station any any our news network thank you and Mary from Woodstock, Connecticut who's so excited that NPR's on the air and that we have this wonderful public radio system to listen to a game shows news\nAnd she says it's part of my every day and thank you to Barclay from Brookline Vermont who says sad to say\nScreening of New England public radio is funded by you and said that the university graduate schools MS in higher education administration enrolling for October twenty second applications at bay path dot edu\nSources but any fewer also this classical music well and that's important to us too well so many good reasons why you who may be sitting on the sideline\nAnd we don't ask for how long all we're asking is that you to get off the sideline enjoying your fellow listeners your community in supporting New England public radio at any P. R. dot net with your contribution of ten twenty or thirty dollars a month as a sustaining contributor or call us at eight hundred six three nine eighty five zero\nIsn't it great when we can do two things at once well here in New England Public radio were dedicated to bringing you great music and keeping you up to date on the latest news high quality news in the morning and afternoons when you're looking for great music throughout the day\nThis public radio services supported by listeners and each person contributing an amount that they choose to support the station they simply can't live without\nWe're asking you to take a moment out of your day right now to support New England public radio that provides you the best of both worlds and that's by making a gift of ten dollars a month or twenty dollars a month maybe thirty dollars a month and becoming a sustained her here in New England Public radio joined the N e PR family now supporting the station\nBy visiting our website N. E. P. R. dot net and make your contribution or calling one eight hundred six three nine eight eight five zero\nMy name is Kenneth Fuchs American composer music grows out of the American symphonic school my favorite composers were on Copeland and Leonard Bernstein I'm Wim showman than ... percent cutting my teacher so I wanted to speak the language but in my own voice\nIt's essentially important that listeners here contemporary American music understand how it's developed and what it sounds like and hear the voices of today and tomorrow\nThe airwaves music talk on the radio creates a community doesn't it to be actively engaged in your community through listening understanding where other people are saying hearing all different kinds of music and different opinions is part of being a living breathing American\nWell Ken if you compose his in his own voice and I'm asking you to lend your voice to address the voice of the community as he's so well describe this community that comes together to listen to music to listen to news to have it\nStreaming of New England public radio is funded by you and bay path university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths\nDot edu to keep this going and keep it on the air we require support really from all of you it would be so much easier if all of you actually stepped up to do this so this is your opportunity right now to support what you believe in\nAt any P. R. dot net with your contribution of forty two dollars a month or seven dollars a month or anything in between that works in your budget any P. R. dot net is the place to do this securely and to see all of our thank you it gives you can also asked for thank you gift and make your sustaining gift that eight hundred six three nine eighty five\nZero forgive to Fifteen dollars a month to New England public radio we'd like to thank you with a pair of passes to the Springfield symphony orchestras Seventy fifth season\nKevin roads is conducting a program of Mozart Mahler there's a star studded cast of soloist bringing the music of Broadway to Springfield the season finale is an evening of ... for shock and there's much more that you can select from is our way of saying thank you for your contribution at Fifteen dollars a month\nWe'll send you to passes to the episode the season for your gift we have a limited number of these passes so please make your contribution and request yours now at ... P. R. dot net or one eight hundred six three nine eight eight five zero and before John goes back\nTo music and I say farewell for today will be back tomorrow\nOr what I think a donor from leads a who noted it's the only station I listen to\nAnd set a tire from West Hartford Connecticut says it just makes my day when I listen to the station when I turn on the station it just brings a smile to my face when I turned it on in the car and a donut from west deals that gives to NPR because of quality and detailed reporting well whatever your reason joining these folks", "year": "2018", "show_name": "Classical Music with John Nowacki", "city": "Amherst", "day": "03"}