{"month": "10", "state": "MA", "station": "WFCR", "content": "From a pie and American public media\nTuned in for marketplace this evening at six thirty on New England public radio MORNING EDITION on any PR is funded by you and the ... school in ... Connecticut\nWe have so much for the last year we're doing it again New England public radio stuck in the end you'll just be be Nineteen twenties holiday party Saturday December first to the hotel north up and you're glad rig zone that get your tickets to the ... the middle of\nNovember eight Ethel Walker dot org by allergy and immunology associates of New England with doctors band ... fans D. N. Robertson brown sponsors of any PR in Worcester, Massachusetts\nAnd by the Bush no presenting an evening with Bob Woodward discussing his book fear Trump in the White House on November first info and Bush no dot org\nTo hear news hour from the BBC and for news throughout the day do now to the NPR News network\nAt Ninety One nine in Camden county eighty nine three in Hampshire county and streaming it N. E. P. R. dot net classical music with John wacky is next here on eighty eight five\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst ended N. E. P. R. dot net it's nine o'clock\n[noise]\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nStreaming of New England public radio is funded by un day path university graduate schools NSA in creative non fiction writing enrolling now for August twenty seven applications at bay past dot edu [noise]\n\nMusic by ... beginning the hour today the peasant woman and that was the b._b._c. fella Monica ... Gen Andrea no zeta conducting on New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst ended in ... P. R. dot net\nIt's five minutes after nine I'm John the wacky good Wednesday morning thanks for joining me this morning and I hope you'll stay with me for music by ... for flute quartets you stick by ... ... in this hour and a romantic sweet\nMusic by Brahms a little later on a trio for piano violin and mourn use it by ... much more lies ahead for you this morning to enjoy and explore with me today\nPartly sunny skies in the forecast with high is in the forties today today mostly clear with ... and the low thirties and then Thursday mostly sunny skies eyes in the upper thirties to upper forties\nMusic by dogs you're in is next to diverted mental performed by the Iceland symphony orchestra room on gumbo is conducting\n[noise]\n\n[noise]\n\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nOh [noise]\nOh\n\nOh\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu\n\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by un they that university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot E. D. Mm\n\n[noise]\nStreaming of New England public radio was funded by June ... architects or to your legacy of combat but to community design celebrating the next generation of leadership a cute little dog call [noise]\n\n\n\nMm\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asset applied laboratory science that operation rolling no for August twenty seven applications that they pass dot edu [noise]\n\n\nStreaming of New England public radio was funded by June ... architects of the year legacy of combat but to community design celebrating the next generation of leadership a cute little dot com\nUse it for a fluke quartets by ... the court said in a minor featuring the ensemble puree Mead on New England public radio\nDon't sour was built a born to a father who was a church music minister he learned at a young age to play a number of instruments\nIncluding piano double bass violin clarinet and horn he was also instructed in music theory by the local church organist thoughts are received his first shuttle lessons from the court trumpeter\nAnd having chosen cello as his instrument went on to study with various other teachers and eventually found his way into the Leipzig Yvonne post orchestra and then the dressed in court orchestra or adults are remained until he retired in Ninety in Eighteen fifty at age sixty seven which was just ten years\nBefore he died\n[noise] it's twenty minutes before ten you're listening to New England public radio in Amherst in Hartford at eighty eight five also in league Ninety eight three ended in ... P. R. dot net\nClassical music on in a PR it's funded by you an arm broke village senior living Westfield offering assisted living encompass memory support with evidence based treatments for those with memory loss more it on Brooke village dot com\nAnd the looming ... vocal arts ensemble performing works by Ryan burger Schubert and Mozart at Edwards church in Northampton on Saturday October twenty seven\nWe had so much fun last year we're doing it again in the window in public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags zone to get your tickets today any tiara done\nHealthcare is a tough issue heading into the midterms the arguments on each side had gotten cheated especially over preexisting conditions you'll hear the story and the days latest news on the next all things considered from NPR News starting it's afternoon at for here in New England Public radio\nIs it by ... romantic sweet this is the Berlin radio symphony orchestra conducted by joann ...\n\nUh\n\nUm\nMm\n\n\nWoman or\nStreaming New England public radio was funded by un valley solar local Bebe designed the installation helping household secures state or federal incentives and live carbon free and the ... valley solar dot solar\n\nA\n\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts do now with rolling fall geez see the S. dot org\n\n\n...\nStreaming of New England public radio was funded by ... they passed university graduate schools MSA creative non fiction writing and rolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n[noise]\n\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nNa\n\n\nNa\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\nWe had so much about last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at N. E. T. R. dot net\n[noise]\n\n\nFrom truckers romantic sweet with the Berlin radio symphony orchestra conducted by Joanne the letter on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and that in a PR dot net\nI'm John wacky it's six minutes after ten I Hope you'll stay with me this morning for music to Mozart in this hour one of his symphonies with the Scottish chamber orchestra a little later on a piano so not about your Honda humble music by tell them on and much much more lies ahead for you to enjoy on this Wednesday morning\nPartly sunny skies and the forecast for today has will be in the forties tonight mostly ... and the lower thirties and then Thursday mostly sunny skies with ... and the upper thirties to upper forties\nStreaming of New England public radio is made possible by you and by sea keys garage in Williamsburg offering foreign and domestic ... AFC certify technicians Massachusetts state inspections she keeps garage dot com\nCross Blue shield of Massachusetts helping connect the dots with Medicare plan that fits all lifestyles eight eight eight eight hundred eight to zero four and a gift from the Richard ... at the Harvard Foundation for public giving\nAnd buy New England public radio sustaining partners listeners who choose to contribute to small amount every month to help pay for what they listen to\nMusic by Brahms is next just trio in ... for piano violin the horn Lowell rears weren't soloist with Stephen looping pianist and violinist Stephanie chicks\n[noise]\n\nMm\n[noise]\n[noise]\n\n[noise]\n\n\n\n[laughter]\n\nStreaming of New England public radio is funded by you when they pass university graduate schools and bass and applied science at rolling for October twenty second applications that base paths dot E. D. [laughter]\n[noise]\n\n\nStreaming up the wait let public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org [noise]\n\n\n\nOh\n\nNa\n\nNa na na\n\n[noise]\n\nOh\nNo\n\nStreaming of New England public radio was funded by you add American International college offering lower residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the\n\n\n\n\n\n\nDreaming of New England public radio was funded by ... June ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com\n\nUh\nMm\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vents basis for a board room to room with a the equipment and the house catering hotel north Hampton dot com\n\n\nStreaming New England public radio was funded by un valley solar local TV designed to the installation helping household secures state or federal incentives and live carbon free and the ... valley solar dot solar [noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\nOh [noise]\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling no for August twenty seven applications at bay past dot edu [noise]\n[noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the basis for a board room to room with a the equipment to announce catering hotel north Hampton dot com [laughter]\n[noise]\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling fall gee CVS dot org [noise]\n\n\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org\n\nSymphony number thirty nine in ... with the Scottish chamber orchestra led by Charles Mick Harris on New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and that and a PR dot net\nClassical music on in a pianist funded by un WFCR as partners Amherst New Hampshire Mount Holyoke in Smith colleges and the University of Massachusetts Amherst\nAnd you'll ... Center for the performing arts in stores resenting underground railroad featuring American soprano Kathleen Battle and pianist Joel marching on friday October twenty six to eight\nStreaming of New England public radio is funded by you when they pass university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot edu [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org [noise]\n\n[noise]\n[noise] [noise]\n\nStreaming of New England public radio is funded by un they pass university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot edu\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy ask dot org\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nForte pianist Constantine ... playing musical Johan home all the piano sonata number one in the major by home all on New England public radio in Amherst and Hartford at eighty eight five also great burn Jeanette Ninety eight seven and that in a PR dot net\nIt's eleven twenty eight I'm John the wacky good Wednesday morning thank you so much for joining me this morning you may have heard about this already occurring serious planning an island hopping adventure through ... in Athens and you are invited to come along the England Public radio is going to be leading a small group and a twelve day tour of Greece next to me\nAnd you could be walking each an archaeological sites in Turin island winery and the sunset cruise around central rainy should be something to remember as well take advantage of an early bird discount before December first see the itinerary and all the details at N. E. P. R. dot net\nMusic by Taliban is next for this morning and ... concerto in a major [noise] this is a group called the fried tags academy\n\nWe have so much one last year we're doing it again I mean we've been public radio second then you'll get his baby Nineteen twenties holiday party Saturday December first at the hotel north happen to get your blood red zone to get your ticket today at NPR are done them\n\n\n\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org [noise]\n\n\nMusic by tell them on for ... and ensemble that was the concerto in a major and a group called deep fry dogs economy on New England public radio in Amherst in Hartford at eighty eight five also great ... Ninety seven and a and E. P. R. dot net\nClassical music on in the UP are funded by you and the SP shows resenting Judy Collins at the Academy of music theater Northampton friday October twenty six tickets at eight O M theater dot com\nAnd Blue Cross Blue Shield of Massachusetts helping connect the dots with the Medicare plan that fits all lifestyles eight eight eight eight hundred eight to zero for\nAnd the PTA providing public transportation to twenty four communities seven days a week or buses accessible for the ... ability impaired P. V. T. A. dot com\nSeventeen minutes before twelve I'm John wacky good Wednesday morning thanks\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org\n... mostly clear lows in the thirties tomorrow mostly sunny skies highs and the upper thirties to upper forties music by early Italian Baroque composer I'm telling you brutality is next that's not a ... D minor performed by the chamber ensemble acronym\n\nNa\n\n\nWe had so much about last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happened you're glad rags on and get your tickets today at NPR dot net\nMm\n\nMhm\n[noise]\n\n\n\nMm\n\nStreaming up the waitlist public radio was funded by ... Greenfield commonwealth virtual school public odd like eight to twelve school personalizing education for Massachusetts do now is rolling fall gee CVS dot org\n... na na\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nStreaming up New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AFC certify technicians Massachusetts state inspections she keeps garage dot com\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\nThe roof by American composer Michael Dougherty at a performance of the University of Nevada Las Vegas wind orchestra Tom less like conducting a New England public radio WFCR in Amherst\nWe had so much but last year with doing it again New England public radio secondhand you'll jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags to get your tickets today at eighty are done\nIt's nine minutes after twelve on John wacky good Wednesday afternoon thanks for joining me today partly sunny skies for the day today according to the forecast science will be in the forties tonight mostly clear conditions with Lowes and the low thirties and then Thursday mostly sunny skies high in the upper thirties to upper forties [noise]\n\n\nUm [noise]\n\n\n\n\n[noise]\n\nFrom their CD music of the spheres the ensemble votes shake conducted by their artistic director mark singleton to works by Eric would occur starting with the seal lullaby and then sleep\nYou're listening to New England public radio in Amherst in Springfield at eighty eight five also Pittsfield at one oh six one and that in a PR dot net\nIt's twelve twenty I'm John wacky good afternoon votes is going to be performing this weekend just want to make sure you know that have a look at our Facebook page will find a link there for more information how to get tickets directions et cetera [noise]\nClassical music on and he PR is funded by you and valley light opera resented Gilbert and Sullivan is gone to lose weekend performances from November second to the eleventh at the Academy of music in North Hampton veal oh dot org and WFCR partners Amherst New Hampshire Mount Holyoke at Smith College is at the University of ...\nStreaming of New England public radio is funded by you advocate that university graduate schools ass in higher education administration enrolling for October twenty second applications at bay path dot edu\n... on the air with mid term elections just weeks away find out what matters most voters around the country joined Jonathan Capehart evenings at eight for America on the line for a national conversation with voters candidates activists and do you that's Monday through Thursday evening at eight on the ... the PR news network\nThen on Saturday afternoon we're presenting the politics show NPR journalists speaking with voters about the critical issues for the midterm elections\nThat America on the line week nights at eight and the politics show Saturday at noon on the N. E. P. R. news network six forty\nAM eighty nine three FM in Hampshire county Ninety eight nine ... FM in northern Berkshire ... it on line at N. E. P. R. dot net\nMusic by American composer Kennedy Fuchs is next taken from his CD most recent city which was released this summer [noise]\nHe writes although electric guitars a powerfully expressive instruments or a few concerto sport in the classical genre is glacier concerto for electronic guitar indoor Chris wrote was commissioned by the Bozeman symphony orchestra and it's a five movement virtuoso concerto inspired by the sweeping vistas of Montana\nEach movements based on the composers oral conception of the natural elements that are present in Glacier National park and Yellowstone National park here is glacier by cannot Fuchs\nDJ sparse the electric guitar soloist with the London symphony orchestra led by joann ...\n[noise]\n\n\nStreaming of New England public radio was funded by ... riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\n\n\nWe have so much one last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your ticket today in the yard done\n[noise]\n\nA\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\nOoh\nDreaming of New England public radio was funded by ... rental architect or to your legacy of combat but to community design celebrating the next generation of leadership vacuum red dot com [noise]\n\n\nMhm [noise]\n\n\n\n\n...\nMm\nStreaming of New England public radio was funded by ... rental architect of forty year legacy of combat but to community design celebrating the next generation of leadership at ... riddle dot com\n\n\n\n\n\n\nGlacier the concerto for electric guitar and orchestra by Kenneth few DJ's bar was the guitar soloist with the London symphony orchestra led by joann ... on New England public radio in Amherst in Hartford at eighty five also great very intimate Ninety eight seven\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nBirch are by presenting James back well conducting twelve ... voices in baroque songs appraising great Barrington November thirty seven thirty ... dot org and live nation presenting Trevor Noah at the ... center on friday April twelve more information that live nation dot com\nAnd by the generous listeners and area businesses or donate Ninety percent of New England public radio is operating budget\nI'm John wacky good afternoon to you partly sunny skies for the remainder of the day to day ice in the forties tonight forecast says mostly clear skies lows in the low thirties for Thursday mostly sunny skies eyes of the upper thirties to upper forties\nMusic by October ... next to each and every and dances sweet number three this is the ... chamber orchestra\n[noise]\n\n\n\nWe had so much about last year with doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north happen you're glad rags on and get your tickets today at NPR dot net\nMm", "year": "2018", "show_name": "Classical Music with John Nowacki", "city": "Amherst", "day": "24"}