{"month": "10", "state": "MA", "station": "WFCR", "content": "From APN American public media\n\nListen to marketplaces evening at six thirty a New England public radio\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n... mental you can Smith colleges and the University of Massachusetts Amherst by the center for eco technology helping to save energy and reduce waste three recycled building materials that eco building bargains in Springfield ISI oh building back and started work\nAnd by the act no construction incorporated general contractors in clean energy efficient buildings bridges on projects of all sizes de ... construction dot com [noise]\nDoes your news hour from the BBC and four new throughout the day to now to the N. E. P. R. news network at Ninety One nine in ... county eighty nine three and half your county and streaming it N. E. P. R. dot net\nClassical music with John Sutherland is next year on eighty eight five [noise]\nThis is New England public radio WFCR in Amherst Springfield Hartford in partnership with the mass Amherst ended N. E. P. R. dot net it's nine o'clock\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\nSo here's a tip any PR is offering a special treat failed the tickets for our Janice baby oh buddy party on Saturday December first grab your tickets now it's P. R. dot net [noise]\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\nStreaming New England public radio was funded by June ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership cute little dog call Mm\n\n\nNah nah\nNah\n\n\n\n[noise]\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that would rolling for fall gee C. V. S. dot org [noise]\nAnd um [noise]\n\n\n\n\n\n[noise] that's music from the turn of the nineteenth century when the heart was all the rage and so what's Scottish folk Lauren Scottish folk tunes at music\nEncompassing both of those trends in the early years of their romantic age the composer the al ... and virtuoso composer named ... ... my ...\nAnd the piece was that you wet on Scottish shares performed by hospice princess Kelly and on the ... the Roberts\nWell good morning I'm John Silver one scene for John ... today and we have more music with a Scottish flavor Mendelssohn of Alex Alexander McKenzie where a piano sonata of shoe birch music of Richard Daniel poor\nStreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n\n\n\n\n\nPretty nice to be able to write music like that when you're Twenty years old the overture Hebert he's also known as singles cave by show which mental ... Eighteen twenty nine we heard the London show her monitor directed by Bernard I think\nWe have more ... Mendelssohn coming up in just a moment as well as a work by scotch composer Alex McKenzie a piano sonata Schubert Mr cookbook non ... and Paul Christian coming up I'm drawing someone's in for John wacky where it's classical music for human till one o'clock at which point culture\nMusic chosen by Stephen ... will be in for Walter Carol for the afternoon [noise]\nThis is New England public radio in Amherst in Springfield at eighty five also in Pittsfield at one of six one ended any P. R. dot net\nClassical music on any PR it's funded by un birch are or to predict ... associates and until we are to purchase health systems providing surgical and non surgical worth repeating services for one three for nine nine six six zero zero\nSo here's a tip any yours offering a special treat he'll deal on tickets for our Janice baby holiday party on Saturday December first [noise] grab your tickets no at NPR dot net [noise]\nSing permitting and financing of real estate S. s S. P. C. dot com and buy a gift from the Richard ... at the heart for ... for public giving\nGoing with public radio is planning another jazz baby holiday bash today is the final day to get a special pre sale deal on tickets for our Jazz Age theme party\nKosovo's hot chicks will again be coming up from New York City to swing the dance floor and speak easy at the hotel Northampton will be mixing up some prohibition era cocktails that early bird discount is only available today so grab your tickets now at any P. R. dot net\nIt's a great party you don't want to miss it if a\nTraditional jazz some old time a\nDrinks and entertainment or your thing any P. R. dot net that's where to get your tickets today\nTen years after the music we just heard until it's Mendelssohn issued his setups three string quartet soap is forty four and we'll hear the first to these now they're actually the last one that was composed but the first set the gene major cortex it's performed here by the court tour you say\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the [noise]\n\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot E. D. [laughter]\n\n\nNa\n\n\n\n\nStreaming of New England public radio was funded by you when they doubt university graduate schools MSA creative non fiction writing enrolling no gr August twenty seven applications that they pass dot edu\n\nNa\nNa\n[noise]\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs yes you certify technicians Massachusetts state inspection she keeps garage dot com\n[noise]\n\n\n\n[noise]\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... [noise]\n\n\n\n[noise]\n\n\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot E. D. [noise]\n\n\n[noise]\n\nUh well\nWell [noise]\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the [noise]\n\n\n\nStreaming of New England public radio was funded by un June riddle architect oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\n\n\n\n\n\n\n\n\n\nNo\n[noise]\n\n\n\n\n\nIn\nI'm In the\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio is funded by un they passed university graduate schools and asset applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\nHere's NPR's offering a special treat filled the chicken or a gender speedy although the party on Saturday December first grab your tickets now it's P. R. dot net\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\nStreaming of New England public radio was funded by un June ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nMm Mm\nMm\n\nMm\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n[noise]\n[noise]\n\n[noise] rubbers Lebanon playing the piano musical from Schubert the span is not a in a minor in the George listing for those keeping score is five three seven\nIt's thirty nine and a half minutes after ten o'clock I'm drawn so when sitting in for John ... each day and also tomorrow in friday\nI Hope you will stay with me today and also joined soon pet keyhole be sitting in for Walter Carol this afternoon he'll have a new recording of Beethoven's second piano trio\nAmong the works by both of my sister and how does that starting this afternoon here at one o'clock here on the wings when public radio in Amherst in Hartford at eighty eight five well some great bearing ... Ninety eight seven ended any P. R. dot net\n[noise] what are the important issues facing Massachusetts voters you can find out what the candidates for Senate have to say China Sunday evening at seven for a debate between democratic Senator Elizabeth Warren and Republican challenger Jeff deal\nIn their only western Massachusetts debate before the November ... election WB wise carry cells that will moderate that Sunday evening it's seven here on eighty eight point five ... WFCR end on the ... of the any PR news network\nStreaming of New England public radio was funded by you and bay path university graduate schools MS in higher education administration enrolling for October twenty second applications at bay pass dot edu\nIf you'd like to parties as well New England public radio was climbing another ... baby holiday bash and today's the final day to get a special pre shall deal um chicken for our jazz each team or jazz he teamed party cohost hot chicks and the ... coming up from New York to swing the dance for\nThe ... some prohibition era cocktails\nBed early bird discounters army available today if you're thinking about it because it's the time she knew it grab your tickets now had any PR dock that\nWe are going back to the sixteenth century Spain music ... the amount of hours this is his communion ... or ... them harmed by the choir Westminster ... say that again ...\nAround and I can say Westminster that's a quarter of Westminster ... Trump directed by James who Donald sorry about that ... ...\n... oh [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise]\nOr [noise]\nNo [noise]\n\nOh [noise]\nOh\n[noise] uh [noise]\n\n\n\n\nWho\n\n\n\n[noise]\nUm [noise]\n\n\n[noise] [noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts do not want rolling purple gee CVS dot org\n\n[noise]\n\n\nOh oh\nOh oh\n\nOh oh\nOh oh oh\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\nOh\n\nGod\nStreaming of New England public radio is funded by you and kill and read all architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com [noise]\n[noise] oh holy bank which\nIn which case just received in which the memory of his passion is renewed and a pledge of his future gory is given to us ... di ... music written in the middle years of the sixteenth century\nWe heard the choir of Westminster Cathedral directed by James O'Donnell\nIt's forty eight minutes now after ten o'clock classical music on any PR is funded by you and Blue Cross Blue Shield of Massachusetts helping connect the dots with the Medicare plan that fits all lifestyles eight eight eight eight zero zero eight two zero for\nAre going to listen to music now which I Am I chose not because it's obviously connected to the peace we just heard but for me they share a certain spirit it's a ballet written by the American composer a\nSo here's they get any PR is offering a special piece failed the chicken or our Gen is the whole buddy party on Saturday December first grab your tickets no at any PR no no\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org [noise]\n\n[noise]\nStreaming of New England public radio is funded by un they that university graduate schools and asset applied data science enrolling for October twenty second applications that they pass dot E. D.\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\nStreaming of New England public radio was funded by un data university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n\n[laughter]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with a B equipment and inhouse catering hotel north Hampton dot com\nOr later in the program I'm John solution for John in Iraqi it's Nineteen Minutes past eleven o'clock this New England public radio WFCR in Amherst Springfield Hartford in partnership with the UMass Amherst into any P. R. dot net\nClassical music on any PR is sponsored by you and WFCR partners Amherst New Hampshire Mount Holyoke in Smith colleges in the University of Massachusetts Amherst\nAnd by ... by presenting James back will conducting twelve archipelago voices in baroque songs with praise in great parents turn on November third at seven thirty Berkshire ... total work and buy a gift from Richard ... conduct of Hartford foundation for public giving\n[noise] speaking of songs of praise in October ... says here's the stupendous ... used to my ...\nMy choice of Johann Sebastian Bach has performed by the wrist chamber choir director by Renee ...\n[noise] [noise]\n\n[noise] [noise]\n[noise]\nOh oh I'm\nA\nAh [noise]\nOh I'm\nA little old\n\n\n\nLadies and um\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\nYeah um [noise]\n\n\nYou know when you're not [noise]\nAnd then there\nWas a a a oh\n\nI'm\n\n\nA mom and a\nHalf\n[noise]\nYeah [laughter] [noise]\n[noise]\n[noise]\n[noise]\nYeah I'm On\n\nA\nNavy [noise] Eighteen and\n\n[noise] you know\n... oh oh\nOh\nOh oh oh oh oh\nAh\nStreaming of New England public radio was funded by June ... architect or forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nOh a man I'm\n\nI'm On my knees you God\nOr\nMan in a\nLong long long long\nLong time and a na a\n[laughter] ... well no no no I'm not I mean um\n[noise] uh\nNo no no\nNo no\n[noise]\n\nNo\n\n\nOh\nNo\n\nOh\nOh oh I Know I'm ... basketball\nAmounts now do all access trackers helping households\nLip carbon free and the four one three valleys solar dot solar\nIn\n\nA ... game\nWas\nOn the\nLine when we\nWere on Iran\n\nOr no [noise]\nUm yeah\nUm mhm yeah well\nThat's\nWhy\nI'm [noise] oh\nOh oh oh whoa whoa\nWhoa\nA\nNo no no no no no no oh\nNo no no no\nNo no no no no no no no\n\nNo no no no no no\nStreaming of New England public radio was founded by you and valleys solar local TV designed the installation helping household secure state or federal incentives and live carbon free and the one three valleys solar dogs so\nNa na na na na na na na na na na na na na na na na na na na na ... mom\n\n... and now I'm a ... a\nLoan from a\nA\nA um\nA phone line I mean I'm a\n\n...\n\nA\n\n... you know I don't know I'm\nI'm On a uh uh uh\n\nThe\nThe low on the\nRolls grow the F a\nA a\nLot of those were the or\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nAnd\nIt it is [noise]\nOh no I'm\n[noise] give for your spirits of sadness for Jesus the king of choice ... censoring in toy suffer ... here yet even in my ... years who remain my joy\nYou some money ... ... ... to ... performed by the wrist chamber choir and that's a\nRadio when the American sector holdover from the Cold War when\nThe ... the director and the continual was provided by members of the academy for ancient music of Berlin\nForty two minutes after eleven o'clock I'm John filling in for John wacky today we have more music ... coming up and just a moment to seize New England public radio in Amherst in Springfield eight eighty eight five were also in North Adams at one on one one end at any P. R. dot ...\nClassical music on any PR is funded by you and Hartford stage presenting Shakespeare's Henry the fifth the recently crowned king and parks on ... on board that will solidify his brain but bring his country to its knees now through November eleventh Hartford stage dot org\nAnd Kathleen Collins wealth management of Northampton working to empower women men and their families towards an actual independents cake Collins wealth dot com\nAnd by ... assembly incorporated a circuit board manufacture in South Deerfield working to keep manufacturing jobs local to the community more at Worthington assembly\nDot com\nAnd now has promised to cook pasta violin concerto an e major perform but I ... with speaking\nBurke\nSo here's they get to any of the earth is offering a special pre Silvio on tickets for our Janice baby already hurting join us for an evening advancing thick helpful taught sex\nIt's sipping some bubbly our car in speaking at the hotel north happened on Saturday December first few clients with an early bird discount because once they are Seventeen\nGrab your tickets no at any PR\nFor years they get to any of the earth is offering a special pre Silvio on origins the whole wedding party on Saturday December first grab your tickets no at any PR no no\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the [noise]\n[noise]\nStreaming of delinquent public radio is funded by you and killed riddle architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nJohn ... who is away and um\nThis is a to say that there's a great deal more music coming up including a Stephen peck he will be in for Walter Carol this afternoon and he has a wonderful program for you hope you'll stay tuned and to stay with us throughout the day one tell you about a\nAn opportunity that is soon to go way New England public radio is planning another jazz baby holiday bash today's the final day to get a special pre sailed Dale ... [laughter]\n... deal on tickets for our Jazz Age theme parties great party kill says hot six will be coming up from New York City to swing the dance floor and speak easy at the hotel north Hampton will be mixing up some prohibition era cocktails\nThat early bird discount is only available today so if you want to go grab your tickets now\nAt any PR dot net\n[noise] this is New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst and at N. E. P. R. dot net\nMidterm elections are just around the corner there to programs you want to remind you about Jonathan Capehart evenings at eight o'clock will host America on the line a national conversation with voters candidates activists and you Monday through Thursday evening at eight on the any PR news network\nAnd then Saturday afternoon the politics show NPR journalist speaking with voters about the critical issues for the mid term elections so America on the line week nights at age and the politics shows Saturday at noon on NPR News at six forty AM Ninety One nine FM in Hamilton County\nAnd eighty nine three FM in Hampshire county\nThe uh I kind of classic American composer ... ah actually fled the country had to leave the country due to political activity and became\nA resident of Mexico where he lived a the bulk of his adult life and uh where he continue to compose the wonderfully intricate and unusual pieces that are for those who knew his music or admire a great deal I'm most\nSo here's they get any yours offering a special treat sale deal on tickets for our Janice baby all the Tea Party on Saturday December first grab your tickets now it's any PR dot net\nPiano do things that no human could but he wrote for humans as well especially these two pieces which you read for ... often called to penance and you'll get a taste of his ... ideas into his technique as the cannons\nAnd one in the left hand one in the right hand are in different time signatures cross in the middle in separate again the technical\nFeat indeed to perform this music just performed here by canisters so often [noise]\n[noise]\n\nMm [noise]\n\n\n\n\nStreaming of New England public radio is funded by you in June ... architects a forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n[noise] Mm\n[noise]\n\n\n\n\n\n\n\n[noise] [noise] Mm\nMm\n[noise] Mm\n[noise] Mm\n\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n\nMhm Mm\nMhm mhm mhm\n[noise]\n\n\n\n[noise]\n\n\nStreaming New England public radio was funded by un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\nThem\n\n\n\nStreaming of New England public radio was funded by ... June ... are such a forty year legacy of combat but to community design celebrating the next generation of leadership cute red dot com mhm\n\nUh [noise]\n\n\n\n\n\nStreaming of New England public radio is funded by un they pass university graduate schools and that's and applied data science enrolling for October twenty second applications that base paths dot edu\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by ... June ... architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\nBefore the fall of the world\n\n\n\n\nStreaming up New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n... well\n\n\n\n\n\nSo here's we get to any of the earth is offering a special treat sale deal on tickets for our Janice baby oh buddy party joined us for an evening of dancing to help folks taught sex\nSipping some bubbly are aside car in the ... the hotel north happened on Saturday December first few clients with that early bird discount before Wednesday October seventeenth\nGrab your tickets now at any PR net\n[noise]\n\nThat there's a lot of fun it's the Korea graphics reachable as Haiti six day by the American composer Paul Christian\nConcluding with students to ask the Seattle ... restricted by Gerard shorts enjoyed that piece it's scary for me were always discovering things is not a new work written in Nineteen sixty five but still a great deal of fun Paul Christian\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nI Want to remind you to stay tuned classical music this afternoon hosted by Steve ... has got to a great program for you including the second piano trio of Beethoven\nAnd music by bus off my sister and towels and a great deal more he'll be coming in and just a few minutes a starting at one o'clock here on a New England public radio\nIn Amherst in Hartford at eighty eight five and we're also in North Adams at one one one ended any P. R. dot net\nClassical music on any PR is funded by you and the Springfield symphony orchestra exploring themes of love and loss with ... and Natasha ... and her Springfield debut on October twentieth Springfield symphony dot org\nAnd to get from the Richard ... funded the Hartford foundation for public giving\n\nAfternoon on all things considered host Ari Shapiro and Mary Louise Kelly a cover a story about Florida with some of the toughest building codes in the country but certain areas are exempt from rules that would protect against storms like hurricane Michael\nSo it's a look at it to coat on the next all things considered from NPR News today it for here on New England public radio\nI'm drawn so lungs in for John wacky and to want to thank you for listening and I will be back tomorrow and friday we can spend some more musical time together [noise] I'll leave you with music of Mozart some more festive dances hair are his six German dances crush listing five\nZero nine and performed by the Salzburg Mozart teamwork a strict conducted by ... off\n[noise]\nHere's NPR's offering a special treat failed the tickets for our Janice baby oh buddy party going us for an evening advancing thick helpful taught sex\nIt's sipping some bubbly our side car in speaking at the hotel not happen on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets no at any PR", "year": "2018", "show_name": "Classical Music with John Nowacki", "city": "Amherst", "day": "17"}