{"month": "10", "state": "FL", "station": "WJCT", "content": "That\nI\n[laughter]\n[laughter]\n\n[laughter]\n\n\n[noise]\nAnd\nOn and on the nicer\nThan the\nTown and [noise]\n\n\n\n\nFine in my family [laughter]\n[noise]\n[noise] [noise] [noise]\n[noise] [laughter] ...\n[laughter]\n[noise]\n[laughter]\n[noise] [laughter]\n[noise]\n[laughter] [noise]\n\n\n\n\nBut just about a rep for tonight's version of the electorate are allowed to enjoy the music we played Bob Marley Noel is with mix up except I today with waiting in Maine in Buffalo soldier freedom dub\nSome freedom tap I should say all little tribute to Mr Marley there will be back here tomorrow night during the spent till that take care of the sacred ...\n\n\n\n\n\n\n\n\n\nFully a weekly best objects results are in and will be announced in the November seventh issue fully a weekly readers cast over three hundred and forty thousand votes this year in more than five hundred categories details have fully a weekly dot com it's\nA lecture allow just now on Spotify on the road or at home and take us wherever you go just search W. J. C. T. eighty nine point nine and ... where the electrical outages always on\n\nGarde overnight load and the low seventies sunshine Saturday hiking in the mid to upper eighties sunny breezy Sunday hike in the seventies low fifties overnight in eighty nine of the Jaycee teach Jackson down your community your world\nWelcome to that in the city I dollars now it's time for ... feel rates teaching ...\nA at a very good evening to you Jacksonville, Florida it is friday night and it's eleven o'clock here at the studios of eighty nine nine W. J. C. T.\nI'm John makeup or Anaheim hosting the show called string theory that is the very show you were about to hear it's one ... hour of the very best of modern ... Americana music\nAnd in the studio with me tonight to very special gifts David April from the old Spanish trail how're you doing tonight to only very John how are you a fabulous how's it going and there's one more person in the studio with us tonight would you like to say hello\nBeds Katie their little girl and all three of them are going to be with us in Studio tonight to talk about the only the trailer monkeys attraction\nHappening right here in Jacksonville on west ... street will get some more information about\nIn just a little while but right now on that theme let's go ahead and get the show going tonight with rape on a bill this is old cemetery road and you were hearing it's on string theory\n\n\nWhere are you in a bad\nBad about the role ... you know I'm not as\n\n\nAnd ah no no no\nNo no no no\nNo no\nWe need rain when I'm ... I'm a\n\nTo\nThe\nMan said by the kitchen do you watch ... and there's the whole\n... do they know the\nWhole\nGrain and a lot of that green let's go well man in his old dog who\nSold ...\nSo\nDo do do do\nDo you do what do they know\n... the global disease\n[laughter]\n\nDon't know\nI Love\nNot in a\nTo learn\n\nI said I said\nOh I'm doing good I\nAnd I said I see\nAlone that down there than\nOh no no no no no\nEven though you know laughter\nIs that the Internet and I'm not bad now and then\nI Need and they\n\nYou know a band and I haven't seen that\nMade\nThe\nInteract you bet on there then and\n...\nI Know my\nDo rely on you and\n\nKnow I'm\nI'm\n\nTaken in the gym\nDig in rent in bank\n\n\nTo go to Sean\nYou don't shy of John\n...\nHow many subplot to go swimming through that my\nReinforce them put you in the long\nRelax and then she\nWhich roads to chew\nMargot places to be ...\nNew\nYork I live in a moment and solve the little\nOut a lot of other stuff\nAre lot above it\nNo no no\nThe change in the\nDance zone and\nThat\nI'll give it to ... hours\nGoing to roll the number\nI'll take my time\nNa\n\nNa na\nVe doing bio\n\n[noise]\n[noise]\n[noise]\nDo the [noise]\nMusical question to be my honey pie from we beans that it's from the B might real CD here on string theory before that a little something for our listeners up in the Carolinas we're listening to it so W. J. C. pita word gene tonight ... Nelson a and the promise of the Rio in Carolina\nJack johnson in there as well with sub plots AG crow GM from what the other side of blows\nAnd you're listening to string theory my special gift tonight David April from the old Spanish trail today of course is friday the thirteenth you just happened to have something in the kind of goes with that you have a hunted campground from what I understand is that correct we do our\nPart of our our our heart is very large we've got three huge areas that have a bunch of scenes within each area and\nOne of the areas is called the hospital in the woods it's a it's a horrific campground\nI Love it I absolutely love it now your little person here have something on her mind she liked to say Katy ... what's our telephone number on\nNine oh well I Can't see them no no that\nShocked that the number if you want to find out more it'll take a little break and we will be right back\n\nOn a reader concert hall presenting nouveau flamenco guitar as a moral leader and his band lunar ... on Sunday November eleventh tickets for a more labor at the time to read your concert hall on November eleventh are available at ticket master dot com [noise]\nNope this person that says they don't believe he's the only person screens loud [noise]\nStepped on which probably means for national storyteller she could change [noise]\nStuff to do [noise]\nSaturday afternoon it to an eighty nine nine\nHi I'm Tim driskell host of east VPN radio we bring you inside tips tricks and habits for the city's leading artists influences pacemakers an entrepreneur Saturday that eleven PM right here on eighty nine nine W. J. C. T.", "year": "2018", "show_name": "String Theory", "city": "Jacksonville", "day": "20"}