{"month": "10", "state": "FL", "station": "WJCT", "content": "Whole\nIssue of the\n\n\nGet\n\nAnd to\n\n\n\n[noise]\n\n\n\n\nWe leave\n\nThey need a\nMy ... yeah I\n\nMean\nThat can\nCause for concern that's see the\nBut she\nThat men don't you tell me that\nThey see China let's see\n[noise]\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n\nFully a weekly present the best objects readers bowl this year every boat is an intriguing are sweepstakes they're over five hundred categories starting September Nineteen continuing dropped over twelve voting is open for local celebrities attractions in March and more fully a weekly dot com\nHi I'm Tim ... host of ISI pee on radio we bring you inside tips tricks and habits from the city's leading artist influences pacemakers an entrepreneur Saturday that eleven PM right here on eighty nine nine W. J. C. T.\n\nYou're listening to eighty nine nine W. J. C. D. Jacksonville your community your world clear skies overnight a low of sixty one sunny this weekend hike in the mid eighties overnight lows in her sixties\nTo W. she she T a dollar and now it's time for change dealing teaching modern occurred to me\nAnd they're very good evening to you Jacksonville, Florida it is friday night eleven PM here at the studios in eighty nine WG CGI my name's John makeup or you just tell me once again for the Joe ... string theory of one for our very best of modern acoustic and Americana\nIt being that it is October and Halloween season I have three very special guests in the studio with me tonight the old Spanish trail Hi how ya doing tonight Santa\n... how's it going to say I we are third yes but she's a little bit on the shy side so to set that aside for now we'll be talking about some of the cool things happening at the Spanish trail a good place to go to put you in that spirit so to speak\nYour something else will put you in the spirit you do some new music this is from Steve ... magic treat you are listening to it on string theory\n...\nAnd\n... ... ... ... ... ...\nA kid it was a little more\nGo ... gone\n... and all I Know\nFeel\nHe he needs to\n... he seems to\n\n[noise] yeah oh yeah\nMm\nMm\n\n\n\nMm\n\n...\n...\n... well let's see\nThe\nThe credit\nChain\nWe're on us\nI'm not sure I can only do in the\nNew man in a\n... real\nMom has no no\nNo no\nHe said you\n\nKnow ... ... ...\n...\n... ...\nGave a nun named ...\nMay not it made me\nBelieve\nAnd I'm really\nNot I mean ...\n...\n...\nNot know\nI\n...\nMom\n\nTrue I mean\nDon't actually you\nI could rise about my ...\n... to your dress to make sure they're a\nYou can run because I care about you know just like last year when I tried to ...\nThe county and I want to\nHear a lot\nOn the non ... which are a mob and what I Try to brag\nWhat now is why\nWe had known\nA\nI should be a waiter bank a bunch of maker ... how are you at your\nBrain and\nUnder our is that we don't smell like those hours you angry try a job\nWanders out in the black [noise]\nBase it on the lights were [noise]\nBut something what\nDisarming [noise]\nA detox to play star in the\nGuy\n\nDo we\nKnow we ... a\n[noise]\nWell\nString theory the modern acoustic alternative show\nThe way he was ... you know\nI don't know the one speeding\n...\n\nBe\n... ...\nThe ice jerk you\n...\nThe\nNa na na na na\nNa\nNa\nNa\nNa na I mean one little ...\n\nAh say\n[noise]\n[noise]\nCar away from\n\nMom\n\nMan I'm\n\n\nString theory poignant song from Ellen bucks still a woman I had the opportunity to meet and hear perform a couple of times and she is truly wonderful that song use your no better than me [noise]\nNickel creek before that taking us back quite a number of years for that song was called speak also heard some brand new music from Geoffrey ... call that one was called blood brothers and learn more early out there in friends with the devils resting place yes I did that deliberately\nAnd you were listening to string theory or the eighty nine nine WG seat to your public radio station here on the first coast they even April ... old Spanish trail in the studio with me tonight we talking a little bit more about their Eddie will scare fest in just a moment or two but we got to take a break I got to go grab a cup of coffee and I want you to listen to this\nA pilot describes what the controls and the new Boeing Dreamliner jet looked like\nIt looks like the starship enterprise up there is the future when of Australia's busiest actors tells us where she goes for a little time away\nTo me what a straight he really had to operate the nature my favorite place to Tasmania\nAnd pure white Germans love sausages so much we have hard time living without them\nOn the next travel with Rick Steves Saturday morning at seven on eighty nine nine to Jaycee to your community your\n[noise]\nYou think you're in control you think you have the final say but what if you discover that you're just living in someone else's world on the next step such rock real governance who's really in charge step drug store telling them to be [noise]\nSaturday afternoon it to an eighty nine nine W. J. P. T. [noise]", "show_name": "String Theory", "year": "2018", "city": "Jacksonville", "day": "13"}