{"month": "10", "state": "PA", "station": "WESA", "content": "Screaming on W. E. N. right it's appointed by Carnegie Mellon university integrated innovation pertinent details on a master's program\nAt the end you dot edu flash I I I\nToday at noon on Ninety point five ... ... e essay [noise]\nLocal national global this is not the point five W E s that's merged NPR News station with voices in stories from all over the world to Penn right here at home on\nThe air and streaming civil you said\nThis is Ninety five point five ... W E bay ten Ninety point five age the one that very Pittsburgh to NPR News station streaming at that he has said that\nElection day is November six but record numbers of voters have already cast ballots what might that tell us about who could win in the midterms\nFrom W. A. M. U. and NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today we are thrilled to launch a new project one a across America you've helped us change the national conversation taking on big issues from every corner of this country [noise] now we're taking that to a new level telling more of your stories right up to the twenty twenty election\nWill begin with a look at who's voting early and how each party hopes to capitalize then we'll focus on three states\nFor starters Kansas Michigan and Colorado and see what's driving voters to the polls road Michigan roads are [noise]\nThat's just ahead on one at\n\nLive from NPR News in Washington I'm jak sphere President Trump traveled to Pittsburgh today to visit the synagogue that was the site of a deadly shooting over the weekend ... more on the president's trip\nAt the tree of life synagogue President Trump and first lady millennia lick candles for eleven victims who died after a gunman opened fire in the house of worship the president and first lady also laid stones and white roses at a makeshift memorial outside of the synagogue they then traveled to a local hospitals to meet with police officers wounded in the attack\nAnd to greet medical staff treating the injured Trump went ahead with the visit to Pittsburgh despite objections from some local political and religious leaders\nThe city's democratic mayor had asked Trump to delay the trip so families can hold funerals without distraction protestors gathered near the synagogue holding signs and chanting against shop Ayesha Rascoe NPR News\nPresident Trump wants to do away with birthright citizenship for those who are born in the U.S to parents who are in the country illegally but that may be harder than any things beyond\nW. B. okay radio in Lexington, Kentucky house Speaker Paul Ryan says Trump can't just make a change for example will be an executive order\nWhat does it very clear is you can't change this executive at a at the very least it would have to be statutory Congress'\nTop House Republican also noted GOP lawmakers weren't pleased when President Obama tried changing immigration law the executive order some constitutional experts have also questioned Trump's legal authority to limit what is currently a guarantee under the fourteenth amendment without the consent of the Congress\nIn Indonesia the search I'm recovery operation is expanding following the crash of an airliner operated by budget carrier lie in the air divers continue to retrieve passenger remains with debris scattered over four hundred square miles of the job of sea from manila NPR's Julie McCarthy has more\nInvestigators say it's too early to speculate on ...\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News ... the sound of a free press\nSeven max age when bowling's most advanced jets had only been in service to month the flight data recorders that provides information on the final minutes of the flight have yet to be recovered but clue is may lie in what happened the night before passengers\nWho travels from Bali on the same plane described to panic as the aircraft climbed and do it radically\nReuters news agency reports that data from the site flight radar twenty four show both flights experiencing unusual air speed and altitude and the first few minutes the c._e._o. of line air said there was a technical problem but it had been resolved Julie McCarthy NPR News manila\nStocks gained ground as investors were encouraged by some solve their earnings numbers from several big U.S companies including Dow Jones component in jail the Dow was appointed in thirty one points today to twenty four thousand eight Seventy for the NASDAQ up a hundred and eleven points this will be five hundred rose forty one point this is\nNPR\nFacebook has reported a profit but its overall picture for the past three months was mixed Jasmine Garsd reports the company struggles to keep picking up users due to conscience security breaches in privacy scandals\nThe good news for Facebook is it's still making money in the last three months more than Thirteen million dollars for advertising the bad news is Facebook's new user growth has flat line in the U. S. and is declining in Europe\nThat might be due to ongoing privacy scandals just last month the company reported that an attack on its network expose the data up to fifty million users Facebook has been warning investors that strengthening user privacy is a priority that will cost money and slowed down revenue growth\nThe company's stock took a dead after their earnings report the den Hubbard back around two percent by market close Jasmine Garsd NPR News New York\nBands of some major technology firms are warning of proposed digital services tax being put forward by the European Commission could result in slower growth in a decrease in innovation\nIn a letter to you finance ministers the heads of sixteen tech firms ranging from spot to fight a booking dot com so the effect of the proposed will be to undermine the ease stated goal the digital single market\nFirms are on to say such attacks but also her growth in employment in the EU mission unveiled a proposal in March ... member countries should be able to tax forms of make profits on their territory is even if they are not physically present\n... prices were lowered today oil ending the session down eighty six cents a brother one point three percent a close it's sixty six Eighteen a barrel on the New York mercantile exchange\nI'm jak sphere NPR News in Washington\nSupport for NPR comes from the do the investments taking a personalized approach to helping clients grow preserve and manage their wealth learn more at ... dot com slash wealth ... brokered services allows the and Americans for the arts and Americans for the arts dot org [noise]\nI'm rather young to go before the midterm elections and Trump rallies just days and how\nWe get the biggest tax cuts\nIn the history of God's\nPlan isn't too real fast check the pie and the candidates with our political satire [noise]\nMoral afternoon\nAt one Ninety point five W E essay\n[noise]\n\nThis is one day I'm Joshua Johnson\nRead it for free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nJohnson in Washington of course sometimes where somewhere else like a member station that helps us bring these conversations to you being in Washington for the deep well of expertise and access here and getting out of Washington to be closer to you\nWell that's basically what makes one a work and today we're excited to announce a two year reporting project that will help us do that even better blend the conversation in Washington with your stories wherever you are in the country we're calling it won a across America\nIt's a big idea to guide our coverage in conversation right up to the twenty twenty election\nWon a is partnering with six public radio stations around the country to help us keep the debate national and to look beyond the swing states that many news organizations tend to focus on\nWill explain this project more in a moment but first let's talk about what's happening across America right now and that's early voting early voting is surging we're still about a week out from the election and millions of voters have already cast ballots maybe including you we ask you whether you had voted early and why and here's someone what you told us\nMy name is Jan I've lived for forty five years in Glenwood Springs Colorado I completed my ballot today at a ride in the mail and submitted it the following day my name is I I live in Houston, Texas I early vote because of the convenience this is\nMary Anne from Birmingham, Alabama and I went down to the county courthouse Jefferson County courthouse filled out a request for an absentee ballot because we don't have early voting in Alabama and I was able to vote right there\nI have never in my life voted early\nBecause I never left in this state that had early voting my name is Jessica I Am calling from Grand Rapids Michigan\nThis election is and ... and I feel like my voice needed to be heard cell instead of just letting that day come and go wow I Am traveling I decided to test out early\nNow mid term elections tend not to have such high turnout what is it about this mid term it's energizing so many voters so much and getting so many of them to vote early\nJoining us in Studio to discuss it is David Barker the director of American University's Center for congressional and presidential studies American University owns W AMU the public radio station that produces won a David welcome to the program\nAs part of the media innovators speakers series the four part series also include author and New York times magazine writer Nathaniel rich the descriptions available by calling for one two three nine to eight thousand information that Pittsburgh Playhouse dot com presented\nBy the center for media innovation the Pittsburgh Playhouse point park university and Ninety point five W E essay\nInbox addiction is a daily newsletter that starts your daily stories about Pittsburgh from the W E S a museum you can sign up at W. E. S. they died as than flash inbox edition\nToday's program and is supported by the Pittsburgh cultural trust presenting as part of the Pittsburgh international festival first S. pies circus dance magic and music combined a French artist or rarely on Boris visual theater event\nAs space November second answered the August Wilson center tickets at ... dot org\nSupport for NPR comes from the station and from the Annenberg Foundation committed to supporting educating and engaging communities in the United states and globally for more than twenty five years learned more at Annenberg Foundation dot org\n[noise] from the state of Jim be crock was the question serves as an enduring investment in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century\n[noise] and from the John ... Catherine T MacArthur Foundation at Mack foundation dot org\nWhich is one a I'm Joshua Johnson the nature of our political system means that some places get disproportionately more media attention than others one a across America is our effort to change that\nTo understand what's important to you regardless of whether you happen to live in a swing state\nNow we have loved incorporating your stories and your ideas into one a over the last almost two years and that's part of what inspired this over the next two years we'll spend a lot more time hearing from you in person\nOr across America team is headed to use this election season with live events town halls are just conversations at the coffee shop\nIt's a two year project made possible by a generous grant from the corporation for public broadcasting\nDo you feel like you've been ignored by the national media especially getting ignored around the time of big elections you can tell us all about it all the across America page of our website ...\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nOr or you can email us across America at W. H. M. U. dot org again across America at W. A. M. U. dot org today we're looking at a surge in early voting across America with the help of three stations we're partnering with\nZoe Clark is the program director at Michigan Radio in Ann Arbor Michigan she's also the co host of its program it's just politics so we welcome Joshua joining us from K. U. N. C. public radio in Greeley, Colorado north of Denver is reporter Michael ... Michael glad to have you with us\nHi Joshua and joining us from Kate M. U. W. public radio in Wichita, Kansas is report Brian grim it Brian ... glad to have you with us I happened to be here too by the way our other three partner stations for one a across America or W. B. H M public radio in Birmingham, Alabama\nMinnesota Public radio and Houston Public media and we look forward to hearing more from them in the weeks and months to come but let me start with the three of you in Michigan Colorado in Kansas\nWith regards to early voting in your state particularly accounting for absentee ballots mail in ballots and so forth so a court in Michigan let me start with you what's early voting look like in Michigan\nRight so we actually are seeing an increase over the last midterm elections I Want to kind of do apples to apples instead of apples to oranges if I had the ... election just because of turnout is higher here in Michigan as it is across the country during the presidential election so if we are comparing to twenty fourteen\nTwenty four team we had six hundred and eighty nine thousand requests for absentee ballot we are now almost at one point one million as of October twenty seconds for like sixty percent increase here in this day\nMichael do you want to what about in Colorado what's early voting look like they're\nWell it's too early to tell us so far but a big a flood of ballots have already come in about six hundred Nineteen thousand of them\nThat we have male voting here and people can register all the way up until election day on election day and um it's a it's it's too early to tell but there is a strong turnout so far\nUm and it mirrors or what your guest earlier was talking about um the Republicans are tend to be a voting early but I'm over the past week or so I'm the I'm Democrats are starting to um get their ballots in\nAnd Brian grim it what's Kansas look like with early voting\nIs falling out of those those national trends there's a there's there's so many of the counties across the state of reporting a record or a near record turnout especially in some of the more populated areas they are Hispanic and particularly when it comes to early voting you know\nA ... they're saying request in in one of the most populated county Johnson county near Kansas City uh they've had requests for more than forty thousand advanced voting ballots\nLet me speak with you how does early voting works in Kansas to people tend to find it easy accessible or there are a lot of hoops to jump through out of Kansas handle voting early well\nIt depends on the county I think it's it's a county by county the way they decide um\nObviously how many polling places are open where those polling places are uh you can also request a ballot to get in the mail so vote by mail isn't the common way to do it but if you would like to do that you can request steady and you can get it sent out\nUm it's so it's it's kind of reasonably are open to people who'd like to early votes I'm here in the county that I'm In and in Wichita, Kansas uh we've had to early voting now for a week or starting today they've opened a few more locations for early voting so they're trying to make it um\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nPick that option we heard from some of you in Kansas Colorado in Michigan about early voting\nA critical mass tweeted I voted I Am in Colorado we have early voting and mail in ballots mailed to us early it's very easy to research candidate amendment or proposition leisure welcome pleading the ballot Michael would you respond to a critical mass in Colorado house has early voting work\nWill uh basically you get your ballot in the in the mail they mail it to you um you you got to do a lot of research in Colorado is your is a very full ballot and um\nYou go through the subjects one by one it's great because uh you can really sit down with it and um do your homework um you know have a micro brew we love that here in Colorado and\nFill out that ballot and then um get it off in the mail or\nOr some other kind of relaxing recreational time for a cup of tea my whatever you want to ... ...\n... um you know and so uh uh you know a lot of people um like the system in Colorado but not everyone um you know that ... ... ... world is full of procrastinators so um there are people who wait until the last minute and at this point\nI'm you know the secretary of state's office is saying if you haven't mailed in your ballot already um and now you got to think about a delivering it by hand or just going in on election day in voting\nI'm Glad you brought that up Michael that's probably something that everyone who lives in a state with early voting our mail voting should bear in mind that there is a certain cut off by\nWhich your ballot has to be received November six times and I I don't know how it is for your three states\nBut every state I've lived in election day is the day your ballot has to be in not just the David ... has to be in a blue mailbox so that is something I Want to remind whatever state you're in your ballot has to be in an election officials hand on election day not a postal carriers hand on election day\n... tweeted no early voting for us in Michigan we can vote absentee if you're willing to lie about the reason why you're not able to vote in person on election day ... do you have to lie to vote early and Michigan\nFor all practical matters yeah so basically how it works in Michigan is if you want an absentee ballot you have to ah basically say that you are going to possibly be out of town let's say a and there are folks that go and say I'm going to be out of town\nAnd and lie at their office in other ways that you can get absentee ballots here in Michigan one is to be over sixty years old or another is may be due to religious reasons or if you were in jail awaiting arraignment for trial but no it is\nWell known around the state that that folks do just say you know what I'm going to be out of town just take to get an absentee ballot\n... what is being over sixty has to do with voting early\nOr possibly can make it easier right so let's say you're over sixty years old and maybe the idea is that there are long waits let's say for example in the city of Detroit it's gonna be cold and maybe the idea is that if you don't you don't want to Seventy eight year old having to sit\nOutside let's say in a wheelchair for three four hours and ... so that is one a one way that that you can get an absentee ballot\nWe're speaking to silly Clark program director at Michigan Radio based in Ann Arbor Michael ... an investigative reporter was K. U. N. C. public radio in Greeley, Colorado and Brian ... who covers energy and the environment for Kate M. U. W.\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free friends\nBecause I have an hour commute and a twelve hour a day on Tuesdays I liked being able to look up all of the issues and candidates I was more informed and took more time with my ballot voting from home\nCouncil where the news comes together weekday mornings at nine Ninety point five ... we are say\nW E essays and media sponsor for Pittsburgh arts and lectures\nPresenting an evening with mustard gas and Russian and American journalist and author of the future is history how to tell a Terry in ism reclaim Russia November fit the Carnegie Music Hall details that W E S H ... flashy fats\nW. E. S. A. is supported by the Pittsburgh foundation through one hundred percent Pittsburgh Pittsburgh foundation is working to ensure that every member of our community kind of access the benefits of the region's improved economy more information about the Pittsburgh foundation and one hundred percent Pittsburgh Pittsburgh foundation dot org\nSupport\nScreaming on WGN pointed by Carnegie Mellon university integrated innovation in the town on a master's program\nAt the end you dot edu flash I I I\nThrew the arts and arts education supporting a nonprofit arts industry which employed four point six million people nationwide learn more at Americans for the arts dot org\nAnd from the Kauffman Foundation working together with communities in education and entrepreneurship to create uncommon solutions and empower people to shape their life and be more successful more online at Kaufman dot org\nThis one a I'm Joshua Johnson what role does faith play in bringing people together so worthwhile question especially after last weekend's mass shooting in Pittsburgh\nAnd it's a question on the mind of the Reverend Adam Hamilton he's founding pastor of the nation's largest Methodist Church back in Nineteen Ninety he founded the church of the resurrection in Lee would Kansas that suburb of Kansas City the goal was to attract what he calls thinking Christians with little or no engagement in their faith\nToday it has more than twenty thousand members across four campuses it's considered one of the most influential mega churches in the nation\nPastor handles and says that he has observed deep divisions within his congregation that reflect the nation's divides what's his plan to get people of faith thinking differently we discussed it this summer when we were both in Aspen, Colorado for this year's Aspen Ideas festival here's the first part of our conversation\nJosh what's great to be with you today thank you describe\nYour congregation to United Methodist church of the resurrection in leave would Kansas or tell us about your topic I sure\nWill leave it as a suburb of Kansas City we've got four campuses throughout Kansas City of downtown Kansas City Missouri was friends with her in a couple and the Kansas on and it's a very diverse congregation so highly educated largely a highly educated\nWe have um we did a poll that long ago we found out that forty nine point two five percent of our people are Republicans and fifty point seven five percent of our people are divided between independents and Democrats\nThe Republicans are divided between conservatives and ... you know conservatives on social issues and those were moderate progressive on social issues but conservative fiscally\nBut Democrats are largely moderate to a progressive and the independents are divided between Republican leaning independents some democratic leading to put it so we're we're pretty divided congregation and I think we represent the country you know fairly well they're kind of divided within divisions ... exactly that's exactly right and so it's an interesting thing when you come you know you have to as a religious leader\nSpeak about the issues that are happening in the world you know I constantly have not constantly better regularly get emails from folk saying well you know you're being too political and wish you and talking about politics and\nAnd I have to say okay wait a minute I'm not standing endorsing candidates I'm not even talking about the candidates but what you're calling politics I'm calling ethics and morals and values when we're talking about\nJustice issues we're talking about\nPeople who are being hurt we're talking about moral issues we're talking about ... and so if you think about what forms or politics what is it is it just thirty second soundbites on you know in radio spots or TV spots for a campaign or is it a deeper\nSense of spirituality in a deeper sense of the meaning of life and why we're here and and surely you and I pray that\nWhen you're doing your politics\nYou're doing that through the lens of a deeper moral system to value system\nMuch do you as a as a pastor is a minister lean into the political debates\nAnd a religious lens on them as opposed to trying to have times where you may be lean away from them like I imagine there are some weeks where you think let's just do a sermon on you know typing earlier I just do a sermon on the story of the garden to be anything but politics yeah so\nRead it for free to explore we're Ninety forty five ... say Pittsburg NPR News they found a free friends\nFeel like I'm doing all the time but here's the way I Try to look at it is um if I were reacting to the news stories every week and in particular in this than the Trump era there's always some you know big thing that's happened in the last week I Would be rewriting my sermon every ... every Saturday\nBased on what happened in the news that week and then probably Sunday Morning and and again probably sending morning and so what I said is and that's not how I'm going to do this I outlined my sermons a year in advance you know actually I have ideas for two years in advance and yet somewhere in the midst of those is preaching on these teams the things that are happening in the news are going to come into play\nBut my aim isn't that I mean I I think\nPeople are hearing so much news all the time and so much political rhetoric and so much divisiveness that when they come to a church I'm not sure they always need one more\nYear round of what they're already getting every day\nSo what I'm trying to do is is carefully choosing where when are the moments when I Need to say something this is this has to you know something has to be said when there's a school shooting\nAnd even then there are so many school shootings I'd be preaching about school shootings too you know or violence in in our society so like I said we're going to talk about that a couple of times this year but I'm not going to talk about it every Sunday\nI Try to build into the ... into the year at least one sermon series is going to be focused on Christian ethics the entire series we're going to look at one of the issues that were that are dividing us or one of the issues we're facing in our society and then we're going to\nTake a look and see how you know for it to be a sermon and not just a an ethical Leckie electron ethics\nWe're gonna look to see how the scriptures speak into this how does our faith shape our response to these things and when I Try to do the pressure I tried to take us to say okay I Know we are divided about these things I'm I'm gonna try to help you see things through the eyes of the other and so we're going to try to understand what might be the truth and this complex moral issue that this one side has\nWhat does this side of bringing to the tables were having this conversation then I'm going to say now you know with all the humility I can muster\nYou can disagree with me but this is how I see this issue right now I could be wrong but desire to see this issue right now [noise] gun guns is a is a great example of this and uh recently I preach the sermon on gun violence in schools I did a sermon on a on gun control and and gun legislation to a year ago [noise]\nAnd as I did that you know I surveyed the congregation and laid out some basic common sense kind of measures that one could take to um to address the prevalence of guns and how easy access to them and [noise]\nAnd it was interesting how how many people agreed on both the left in the right on some of these basic things now that sounds like potentially risky ground because it begins to get out of spirituality and the actual policy yeah uh it does actually so so here we're talking about what would what would we as people of faith how how might we respond\nTo you know the issues of shootings in school so the shootings in the schools as the presenting or just violence in our communities is presenting issue\nAnd so and obviously there's no guns in the Bible but there are swords and spears so he got plenty of plenty of places where we talk about\nHow do we respond to people who are our enemies we've got Jesus saying love your enemies we've got Paul talking about you know doing good to those that would harm you you know you've got a lot of things you could so so there's a part of that that is going to be about those basic biblical principles but then there's going to be another part that's going to say so are there any solutions and is there any way that we as people of faith\nOn the left in the right can come together to find some solutions and in the end we found that more than two thirds of our people who were gun owners agreed with us or you know we lift it up for five basic things that people said yes that that makes sense\nAnd in the end you know part of what we did as I said you know\nFor those of you know it's easy sometimes in the ... in the ...\nRead it for free to explore we're Ninety forty five ... say Pittsburg NPR News they found a free friend\n[noise] but I I have friends and people who I loved dearly who are in the in our and they love to hunt and they're not gun toting nuts and they grieve every time there's a shooting the school on the other side you know you've got these aren't people who want to take all your guns away\nThese are people who want us to figure out we've got we've got to do something we got it can be and so when you can when you can treat both sides as human beings and you can help them hear each other it opens the door to finding answers\nWhat does your congregation want from its religious experience at our church do they want a place to deal with the social issues\nThat they want a refuge from the politics of the day do they just want you to stick to the scripture or do they want you to be more pathetic on the issues of our ties what is your congregation expressing to you know the answer is yes a lot of it if I if I get emails\nAcross the spectrum I have people who are like you know I it just it makes me so mad when you talk about what's you know what's going on the news I don't want to hear about politics when it comes to church and again politics becomes the catch all phrase for something you said that I don't agree with\nAnd uh but I've got other folks were like so immigration on the border when when the children are being separated or the news broke about that [noise]\nYou know I'm hearing this News I'm out of town I'm hearing this news throughout the week I'm studying and I'm like do I talk about that this Sunday or do I spend another week really trying to see how that's going to resolve 'cause I have a feeling within a week it's going to be it will start to be resolved and sure enough within a week there was an executive order and it's not all resolved but\nAnd I had people who are really mad like why didn't shoot you should've preached on this this weekend and I had other people were like thank you for not preaching on this weekend and the next week and I did I did that was Father's Day weekend I did talk about it but um\nSo I it's all over the map on that are there but here we we also served the Carter who's really find out we're doing a worship survey to find out about music and different things what they what they want but we asked about the sermons which the sermons or do you find most compelling and the number one response was when Adam deals with current issues where he's dealing with what's going on in the world", "year": "2018", "show_name": "1A Plus", "city": "Pittsburgh", "day": "31"}