{"month": "10", "state": "PA", "station": "WESA", "content": "Free to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News the sound of a free press\nVideo and Web collaboration ... engineering at a customer support services declines worldwide from Monroeville headquarters since Nineteen sixty eight information available at ... dot com\nPartly cloudy skies and the forecast for tonight western Pennsylvania low forty one sunshine expected early tomorrow then cloudy in the afternoon wa behind fifty three Thursday mostly sunny high fifty one\nRight now forty eight degrees clear skies in Pittsburgh this is Ninety point five FM W yeah say an W. E. S. A. H. D. one Pittsburgh Pittsburgh to NPR News station one day starts right now it's eight o'clock\nEvidence for climate change of solid but support for that evidence these mixed how do we change the climate of the climate change debates\nFrom WAMC you an NPR in Washington this is one [noise]\nEither I'm Joshua Johnson today on one a how to discuss climate change is one of those topics that make people digging their heels and argue like crazy a big issue wrapped up in deeply held beliefs so of course that means the discussions tend to go nowhere will get tips on debating climate change in a productive way\nThen we shift gears to the British royal family's new baby a light hearted story comes in a heavy time in the u._k. is this just a distraction from breakfast or something more\nAbout the weight of what's proper or going what precedent today about doing what people in love do that's just the head phones one egg [noise]\n\nLive from NPR News in Washington I'm ... beer\nSecretary of state Mike palm peyote travels from Saudi Arabia to turkey short lazy pushes for a full investigation the disappearance of a Saudi journalist tricky says ... was killed when he was went to a Saudi consulate in Istanbul do the Saudis denied any knowledge of that NPR's Michele Kelemen has more\nSecretary Pompeo said he had a candid conversation in Saudi Arabia an end in every one of those meetings that Saudi leadership strongly denied any knowledge of what took place at their consulate in Istanbul\nHis statement says there's a serious commitment to determine all the facts and ensure accountability President Trump spoke by phone with the Saudi crown prince wildlife day over there and came to the same conclusion writing on Twitter that Mohammed bin Salman totally denied he knew what happened\nTrump goes further in an interview with the Associated Press saying he sees this as an attempt to declare the Saudis guilty until proven innocent\nMichele Kelemen NPR News Riyadh\nHealth officials say they are seeing a rise in reported cases of a rare paralyzing illness in children saying it seems to be following in every other year pattern at least sixty two confirmed cases of the disease have been reported in the U.S this year according to the Centers for Disease Control and prevention Dr Nancy ... of the CDC admits doctors are baffled\nDo it's a lot we don't know about at them and I'm frustrated that despite all of our efforts we haven't been able to identify the cause of this illness\nOf similar illnesses reported in two thousand fourteen and sixteen the cause remains a mystery though officials have ruled out some possible suspects like polio in West Nile virus\nOfficials in our centrally doubling the number of people they say died in Florida as a result of hurricane Michael did hit there last week for the state officials updating their death poll today state officials did not provide details of how the victims deaths were related those are the ... apparently according bay county a seaside area which took a direct\nFree to pursue the free to explore we're Ninety point five W E s say Pittsburgh's NPR News ... the sound of a free press\nReports the major indices regained much of the ground they lost in recent weeks both\nAre down ... and the S. and P. five hundred gain more than two percent the NASDAQ shot up nearly three percent\nInvestors were reassured by strong earnings are too big Wall Street banks Goldman Sachs Morgan Stanley stocks and both banks rose sharply tech stocks which were battered in recent sell off also bounced back\nData that reassured investors that the economy remains strong helped fuel the games to the Labor Department reported there are nine hundred thousand more jobs available and the economy then there are workers seeking a job at the highest differential on record John Ydstie NPR News Washington\nTaking a look at the numbers the Dow jumped five hundred and forty seven points that as that goes up two hundred and fourteen points the S. and P. roast fifty nine points this is NPR\nWhite hailing company ... could be poised to launch an initial public offering sometime early next year that's according to a report in the wall Street Journal which has the ideal good value the copy upwards of a hundred and twenty billion dollars or despite the reported valuations from two major investment banks there's also no guarantee social public offering would hit that mark\nThe idea where to go for it at that price though would value ... motives for General Motors and Chrysler combined\nFor the first time a writer from Northern Ireland has one of the ... just men Booker awarding the prize given the works or fiction written in English and published in the u._k. was announced the ceremony this evening in London NPR's Lynn Neary as more\nMen took a prize winner Anna Burns drew on her own experiences during Northern Ireland travels to write her novel milkman\nThe story is told through the eyes of an Eighteen year old girl who's trying to avoid the dangers that tensions paramilitary figure known as the milkman\nInstead she becomes the subject of gossip and rumor\nAnd announcing the winner Kwame Anthony Appiah chair the judging panel said none of us has ever read anything like this before he calls it a story of brutality sexual encroachment and resistance threat it with more than ... humor\nAll of this year's finalists he said take you so far from your comfort zone that you're never entirely return Lynn Neary NPR News Washington\nThe nation's minds factories and utilities we're chugging along in September not withstanding some impact from Hurricane Florence which at the Carolina coast Federal Reserve says Florence cut into output growth but only modestly production was up to tens of a percent last month led by autos and wood products I'm jak spear NPR News in Washington\nSupport for NPR comes from the alliance for a lifetime income a nonprofit composed of financial services organizations working to educate Americans about options for securing protected lifetime income in retirement more at alliance for a lifetime income dot org\nI'm Out in young did you really Robin get short shrift for his ballet because his choreography was shown like can I Am I doing something\nYou know he really was a genius in that field it's just that because he was so good in that field is ballet\nThe wrong sort or not enough\nTime here now [noise]\nAfternoon at one Ninety point five W E essay\n[noise]\n\nThis is one day I'm Joshua Johnson in Washington Leslie stall of sixty minutes is ...\nFree to explore read it for the the Ninety five W yet they Pittsburgh NPR News station the sound of a free press\nRight then you are debating climate change it came up during her latest interview with President Trump\nI Wish you can do to Greenland\nAh watch these huge chunks of ice just falling into the ocean raising the sea level and you don't know whether or not that would have happened with or without man you don't know if you're a scientist your scientist that no I Am an ad and says that disagree with that you know I I was thinking\nWhat if he said now I've seen the hurricane situations I changed my mind\nThat really is climate change and I thought what an impact\nWhat an ... I'm not denying climate change but it could very well go back you know we're talking about all that and the news is they say that we had hurricanes that were far worse than what we just had with Michael ... says that they say when they say that and then but what about ... scientists and say it's worse than ever\nClearly climate change it's tough to discuss despite overwhelming scientific evidence of its existence\nOr maybe because of that evidence I mean think about it if someone tried to hit you over their head with a bunch of facts and figures Supreme Lee confident that they are right and you are wrong\nHow would you feel or if someone flat out refused to hear you out despite the facts being really clear and just dug in their heels to avoid feeling like they lost an argument\nWould that be like\nWe want to elevate this debate to change the way we talk about climate change and we want to hear from you where do you stand on the issue and what is it been like discussing it with people whose views are different from yours what's worked and what has not\nJoining us from K. U. L. W. public radio in Seattle is Sarah ... a research associate at the University of Washington she holds a PHD in ecology from UC Davis she also founded the row in Institute a group that empowers leaders to tackle climate change Sarah welcome to want to say\nThanks for having me joining us from NPR in New York is poll Bledsoe a lecturer at American University's Center for environmental policy American owns W. A. M. U. the station that produces won a\nHe's also a former climate advisor to the Clinton White house and a strategic advisor at the progressive Policy Institute poll welcome\nThank structural Sarah I Wonder if we should just framed a discussion very clearly first of all this is a conversation that's for skeptics and believers alike right this is bigger than just is climate change real do this kind of feels to me like the human aspect\nYou get invaluable insights into how the world works and how you might make it better\nThat's why public radio is so important and your financial support keeps it going so support NPR ... W E s say keep the free press free and available to everyone sign up right now as a sustaining member by giving ten or Fifteen dollars a month at W. E. S. A. dot FM or call\nFor one to six nine seven to nine five five thanks\nW. E. S. A. is supported by community college of Allegheny county presenting mission critical filling tomorrow's jobs on November Fifteen\nPart of the Robert M mill lecture series this discussion focuses on the efforts of business and labor to address the region's anticipated worker shortage details at C. C. A. C. dot edu\nSupport for NPR comes from this station and from the doors do charitable foundation who is critical scientists development awards support promising early career physician scientists and their research efforts to improve human health\nFrom the George ... foundation working to make Cleveland and northeast Ohio more globally competitive livable sustainable and just more information available at gun foundation dot org and from listeners like you who donate to this NPR station\n\nThis is one a I'm Joshua Johnson we're discussing climate change and what we discuss when we discuss climate change with Sarah my re founder of the rolling Institute and Paul Bledsoe a promissory Electra at American University Center for environmental policy\nWherever you are on the spectrum of belief with regards to climate change what kind of conversations are you having with people in your life about climate change have you been able to win anyone over have you had any arguments that just went sideways\nTell us what this conversation spin like for you comments on our Facebook page tweet us at one a or email one at a at W. A. M. U. dot org we know that for quite a few if you're discussing climate change can be difficult\nSo have you been giving us your suggestions for what has worked for you or what might work Melissa writes for my Bible friends I remind them that we are called to be good stewards of the earth nothing the environmentalist or suggesting would cause harm from I ...\nFree to pursue the free to explore we're Ninety forty five W E s say Pittsburgh's NPR News the sound of a free press\nAnd this is the future autonomy more jobs better jobs saving the earth for their grandchildren is way down on the list we also heard from some of you who are dealing with the difficulties of discussing climate change Caitlin left this note in our inbox\nCourtroom crowds are Okrent wrote actually than I Am in a room and I'm very interested in protecting the environment and\nTeaching about climate change\nI Want to know ways in which I can better explain myself to others are just regular people who might not have the education that I had\nThat climate change because from where I'm standing at plainly ... what's going on and it just seems like we really need to come together and actually make a change or there's going to be a really bad and\nCaitlin thanks very much for sharing your thoughts with us Paul I wonder how you respond to Caitlyn particularly because I think sometimes if I may just outdoor comment the terminology often gets us in trouble I mean some people use the phrase climate change some people say extreme weather as some people say global warming and\nJust beginning to get on the same page can be one of the core problems of talking about all this\n... it's a great point we need to recognize that the good news is we have the solutions to address this problem the technical solutions the energy\nSolutions the policy solutions what we lack our political will and consensus around action we know that we have to pee global emissions by twenty twenty and go to zero net carbon by twenty fifty turns out we have the technologies renewable carbon capture\nA electric vehicles and many others to make that happen if we make a real push but it is going to take a huge push likely made during the Cold War I Wish the country would come together over this expression of American leadership\nLeaving the world again to safety I think that's possible but when one party in the United states it's a nice factual information over twenty year period than elect a president who almost campaigned on it it becomes very difficult to engage with that and I think voters\nMay reflect that in this midterm election\nGeorge tweeted as an environmental health scientist I focus on telling people about the immediate and local clean air health benefits that will go to people in locations taking action to address climate change pollution and reducing fossil fuel burning irrespective of opinions on climate\nKatie emailed my family has vacation to Mexico beach in Florida for twenty plus years and we have many friends and loved ones from Panama City who have lost everything meaning in hurricane Michael\nMy father is it this believer of climate change and it's been very upset about losing a place we love so much he won't consider that just maybe there is a greater thing at play here what is it going to take for this to change how do we those who are convinced that is happening change the way we talk about it and rather than shutting down the conversation\nNurture it Sarah how would you respond to Katie\nGosh that's a really really great question and I can feel that the pain that she's in and the last that her family is\nStruggling with to describe and you know this is this is the peace around recognizing how difficult this information is like I got exposed to the science of climate change when I started graduate school and it took me like six years to ...\nFree to pursue the free to explore we're Ninety forty five W E s say Pittsburgh's NPR News ... the sound of a free press\nAnd it it people can get exposed to that the science of climate change and it ... they can be in such a vulnerable place that it's actually potentially dangerous for for students and people who are struggling with mental health issues\nSo the the way that we unpack this I think is through and through relationship and trust and empathy\nOn because as we interact as individuals and we come to terms with the scale of the change and the crisis you can have a lot of really based on emotion and fear anger um [noise]\nI ... all of these pieces that are we all ... away from those very challenging emotions and often when we feel those emotions ... into our part in corners\nWhere we think we know the way the world is and we we become ever more entrenched in our existing worldview and that's why being honest that yeah this is a really difficult conversation and that's exactly why we're having this conversation is one of the ways to start\nShare if I could just doing it a little deeper on that I Wonder if this idea of being empathetic and being a little compassionate might also speak to the conversations with folks who feel very fatalistic I mean\nIt's hard not to read the latest report from the UN's climate change which we discuss last week on this program and not feel like well we're all going to die anyway\nWhy bother run up your credit 'cause they're not going to be radical act you know what I'm saying like it just feels like an intractable problem and I wonder if maybe a little empathy for folks who feel that way would go a long way why one\nEye so yeah I got it and I I Want to remind remind us that as we sit\nWith the privilege of western lifestyles and we look at the science that we've invested public money into you know remembering that we're living in science fiction fantasy right now and we can look to human history and see that there are many other cultures around us and specifically in the U.S\nNative American and indigenous Native American people\nWho have already experienced the kind of cultural eradication that we are looking at down the line on the the consequences from climate change we can look at the stories of human tenacity and how people struggle and survive\nThrough massive massive shift we know these stories and we can inform our strength and our resilience our courage by looking at the stories of for example the water protectors and the people who are standing at the front lines right now saying the earth is precious we only have one planet and we're all going to show up and\nI'm informed that the you know the public's eye of the necessity of staying in this place and and staying vigilant I Would\nJust go go ahead go ahead but oh I Would just add that the fatal\nIsm is a reasonable reaction if you don't know the full range of solutions\nThat there's a lot of good news here\nWe eliminated one of them six main greenhouse gases it will no longer exist on earth Twenty years from now with the could golly agreement to fail HFCs\nTurns out there three or four other super pollutants like methane and black carbon if we can reduce these quickly about three times the current rate\nWe can limit near term warming and prevent run away climate change we need education about the fact that we can take hold of the climate crisis\nRead it for free to explore we're Ninety forty five W E s say Pittsburgh's NPR News the sound of a free press\nExactly to combat that fake lives in which is a serious problem and I I really do feel empathy for people who are overwhelmed by an apologist to dig into a little further what our HFCs\nIt was really worth every dollar that I contribute each month for how much time with\nMy name is Jennifer tomorrow and I live in a minute\nPlease join me as a sustaining member visit W E s they not have them\nOr call for one to fix nine seven to nine five five thank you\nToday's program I supported by the Pittsburgh cultural trust presenting it as part of the Pittsburgh international festival first Mrs Christians party October seventeenth through the twenty first created by the founders of India ink theater company the immersive experience features a party with music dancing and vegetarian adult prepared alive during each performance details at ... dot\nOrg support for NPR\nScreaming on WGN appointed by Carnegie Mellon university integrated innovation [noise] detail on a master's program\nAt ... dot edu slashed I I I\n... and the United states and globally for more than twenty five years learn more at Annenberg Foundation dot org\nFrom American for the arts committed to transforming America's communities through the arts and arts education supporting the nonprofit arts industry which employs four point six million people nationwide learn more at Americans for the arts dot org\nAnd from the any Casey foundation\nBefore we get back to our conversation we would love your help with tomorrow's program about being Native American Massachusetts democratic Senator Elizabeth Warren recently announced that a DNA test has confirmed what she said all along that she is indeed of tribal heritage\nThe test was a ... back to President Trump who mocked her for claiming that heritage and refer to her as Pocahontas\nCritics including some tribal leaders said direct ancestry matters more than DNA testing in this regard\nIt's just one of many issues that may have Native American voters talking head of the midterms\nIf you are Native American what has claiming your heritage meant to you what tribe or are you part of and how does that factor into your life\nLeave us a voice mail eight five five to three six one a one a now if you're not Native American then share what your heritage means to you especially if it's something you learned about a little later in life what did you discover and how did it change you\nTell us your story eight five five to three six one a one a or you can leave us a radio quality audio file through our app won a vox pop will share some of your stories tomorrow on one day\nBack now to our conversation with Sarah ... and Paul blood so let's get in a few more of your questions and comments before we move on Noel tweeted I teach clients to think of anxiety kind of like sugar a little gives you energy to get going and too much shut you down and drains you\nNeed to keep it at that middle area I guess\nLet's get back to Arlene's question on our website and and Paul I wonder if you could respond to her a lean rights\nSo if you change people's minds what then I see a lot of people who believe in climate change to do nothing to try to mitigate it in their own personal lives\nThere still driving around in gas guzzling SUVs owning their ... mentioned houses with a thermostat turned up not recycling not cutting back on meat and dairy basically waiting for someone else to do something it's like someone else's tomorrow not ours\nNo doubt personal action is important not least so that you're not hypocritical when you advocate policy and political action but let's be clear that it will take large policy action to reduce emissions in the United states and globally\nTo make the United states once again a global leader and cutting emissions to solve this problem we have the biggest thing you can do personally\nFor climate change action is to vote out people who won't take it and vote in people who will and I don't mean trust Democrat and Republican because within those parties there are a few Republicans who\nAcknowledge like ah the congressman from some South Florida um but there are many more who deny it on the Democratic side there are some who are not strong enough and do not advocate serious policies\nWe have to recognize this is an imminent threat to people's public safety national security and economic well being as\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News ... the sound of a free press\nOne of the kind of saving grace is there at this point in the conversation is that we we do need to deal with U.S policy issues but\nJust being able to have the conversation in a useful successful way I think that's a form of progress as well you just get people kind of pointed in the direction of being willing to do something so by the way of kind of wrapping up I Want to go through a few common objections to the basic argument around climate change and sort of role play how one might respond to those\nFor example be tweeted I often run into these excuses is warming is happening why do we still have winter and we've been told for decades that bad things would have happened ... years ago but they haven't Sarah how would you respond to that\nWell I mean that things are happening right now so there is evidence that um that that those projections are coming through I mean all of the pieces of projections that we have seen around temperature and carbon\nConcentration I mean we are able to do a very good job at projecting a the impacts of climate change on the ground and and that's the state of the science right now it's it's phenomenal\nI guess the issues not just that we're having winter but we're having like day after tomorrow winter like we're having super winter\nRight and and so like [noise]\nYes and there's so there's complexity and how the regional climate and the season all of the different places are influenced by the day that the on the Arctic weather system basically a\nCollapsing and how and how that changes North American climate and so we do see these complexities and why\nAnd people get confused right because they're like well wait a second this is a massive storm but this is the fundamental distinction between weather and climate\nClimate ... we can measure climate for the last you know ... million years right and the the the climate for earth planet has been awful lesions between glacial in inter glacial state\nAbrupt warming into into glacial followed by slow cooling into glacial state so that pacing of glacial enter glacial warming that cold too warm structure that\nWas fundamentally paste by the changing geometric relationship between the earth and the sun\nSarah backup learned along the changing geometric relationship between glacial into glacial stayed last me it's so cool it's amazing like always confusing like like bring on earth from it\nOkay so in the last ... million years the the planet's climate has been moving between glacial states\nWhere there's an ice on top of North American and you're Asian continent sea level is lower um it's a colder climate on and then in ... states so we are in an inter glacial right now okay and that changed that cold too warm shift\nThis um this piecing this um oscillation is ... it's like a heartbeat of earth's climate and the heartbeat from cold to warm cold too warm that heartbeat with paste\nBy the way goals and ... of the geometric\nIn earth orbit and earth tilt as it moves around the sun\nSo I only make sure following you this yeah heartbeat this earth heartbeat between the whole too warm cold too warm it's almost like the earth is having cardiac arrest the heartbeat as off and the pattern is not what it's been for a million years and we can trace it\nTo us is that what you're saying that's exactly right like perfect ... okay that makes a youthful pattern\nThat's been ... that's been happening for the last ... million years we ... we have fundamentally disturbed that pattern\nI was out there on a super high cholesterol sugar fossil fuel diet has gotten or a blood pressure through the roof\nScreaming on WGN appointed by Carnegie Mellon university integrated innovation detail on a master's program\nAt ... dot edu slashed I I I\nIt's a perfect image that makes perfect sense one more thing I wanted to get to pull out and then we got to let you go shortly but\nFor folks who questioned the provenance of the science food the scientists are that came up during the sixty minutes interview who say I just don't trust the people where this data's coming from how do I know that they don't have a political agenda what would you say to someone with that concern to try to work\nThrough that I I I understand that you can distress individual scientists but there's not a conspiracy of\nTens and hundreds of thousands of scientists around the world to create a problem actually I find it quite the opposite in many cases their understanding the nature of the problem because they don't want to seem alarmist the truth is that the problem is here now in imminent\nAnd that that's just the factual information on the ground we have already warmed\nUp a degree and a half Fahrenheit we're on our way to well past three or even four Fahrenheit and it could spin out of control and that that's just the factual information I I I think we went with very few people actually denied about ten percent Fifteen Percent of the u._s. public actually\nDenied climate science what I think we have to do is galvanized the Seventy five eighty percent who broadly accepted into action\nPublished so former climate advisor for the Clinton White house professorial lecture at American University Center for environmental policy\nAnd a strategic advisor at the progressive Policy Institute Paul thanks very much for talking to us thank you judge them and Sarah ... a research associate at the University of Washington and founder of the ... Institute Sarah thank you you're so welcome\nTo the bathroom and the bar yet so Terry and I neither of us can qualify but you can when you you will automatically qualify with your donation right now for one to six nine seven to nine five five or online W E essay dot at them\nThe confluence of one and all of the program and you hear on W. usa has paid for with member dollars you can give the hosts of money that it takes to keep those programs on the air but we can that's oh public radio works you support W E s say we in turn support\nAll the quality producers and the folks at NPR who produces great programming that makes W E s a an important part of your day joined us no W E s a F ... for one to six nine seven twenty nine fifty five\nAnd today only if you make a donation at Fifteen dollars a month we'll thank you with a W E s a free press pack it includes our sound of a free press stainless steel water bottle that's new this fall are stand with the facts tell bad\nAnd wait wait don't tell me twentieth anniversary digital download believe it or not the folks at wait wait had been doing their fangs thing for Twenty years\nAnd this is a compilation of some of their favorites where to put that in and just for a little extra find the new W E s a stainless steel strides a reusable straw for one to six nine seven to nine five five normally you'd have to get three hundred and sixty dollars to get all of these thank you get that today only Fifteen dollars a month\nFor one to six nine seven to nine five five\nAre coming up with one shortly here on Ninety point five W E s a F ... W E oh say HD one Pittsburgh Pittsburgh is NPR News station or funding Dr has twenty four hours to go we're looking\nFor about a thousand dollars in the next couple of minutes in order to get the special gift so join us now come on line that W E S C I F him or joined us by making a contribution that for one to six nine seven twenty nine fifty five and thank you for support of this\nImportant work\nLive from NPR News in Washington I'm core of a Coleman hurricane Michael's now blamed for at least twenty six deaths authorities\nIn one county in the Florida Panhandle are raising the death toll there the area includes Mexico beach in Panama City where damage to homes and businesses is extensive NPR's Debbie Elliott has more\nOf the storm related deaths are reported in Bay county along the coast where hurricane Michael made landfall searching\nFree to pursue the free to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nReported missing a high number in part because of fracture communication system NPR's Debbie Elliott Michael came ashore in the Florida Panhandle is a strong category for hurricane\nSecretary of state Mike Pompeo is visiting on pro where he talked with Turkey's president and other leaders they're reviewing the case of missing Saudi Arabian journalist Jamal ... Turkish officials have said they believe ... was murdered after he went inside of Saudi conflict and never emerged\nSaudi Arabia denies this Pompeo visited Saturday leaders yesterday and says the Saudi Government is investigating\nPresident Trump is threatening to cut aid to any country that helps hundreds of Honduran migrants now walking toward the U.S southern border Maria Martin talked with the director of a migrant shelter housing the Hondurans who are passing through Guatemala City\nFather mode of upset if they hit ... got somebody could on ... a shelter no housing nearly a thousand migrants from Honduras he says more are expected on Wednesday and describes what he's seen as a serious humanitarian crisis\nYou know that I ... thought your lawyer said\nThe Trump Administration is threatening to cut off aid to any country that helps the so called march of migrants including Guatemala and Honduras\nYou're getting old grandmother ... syndrome that it goes on and I ...\nThis previous to work with migrants for over Twenty years says it's aid had really gone to help the poor these hundreds of people would not be fleeing from violence and poverty for NPR News I'm mighty on Martin\nThe European Union had hoped to approve of bricks that agreement at their summit taking place today in Brussels but as Teri Schultz reports talks are at a standstill with just over five months to go until Britain's departure from the block\nEuropean Council president Donald Tusk says he has no grounds for optimism that the jammed Brexit talks will be resolved at this meeting he\nLeaders asked the British prime minister Theresa May come with new proposals or risk leaving in March with no deal the biggest hurdle is a settlement on held the border between each member Ireland and the u._k. Northern Ireland can remain open for trading in traffic\nThat you would like Northern Ireland to stay in its customs union but May's government says that's not a long term solution there were reports the emu as willing to extend the transition period by a year in exchange for British concessions on the border issue for NPR News I'm Teri Schultz in Brussels\nOn Wall street the Dow was down more than two hundred points [noise] this is NPR\nSupport for NPR comes from NPR's fishers other contributors include Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru a Subaru learn more at ... dot com\nWanted with Joshua Johnson coming up in just a moment this is the W. usa\nFall membership Dr ended ... tomorrow morning at ten am less than twenty four hours to go please help pay for your W E s a listening by making a contribution right now for one to six nine seven twenty nine fifty five and don't forget you can become a member today and when a pair of tickets to see Hamilton\nAlso in rural online to W E s a daughter of film\nOntario Riley in the studio with names you would\nSo many so many people stepping up this morning we were looking out working on a goal at three thousand by ten am still counting that looks like we're about five hundred dollars away from reaching that goal but if you get the process started now you can count towards that goal for one to fix nine seven to nine five five on line W E essay dot FM\nYou gave in the last one drive in it so we thank you\nDreaming on WGN imported by Carnegie Mellon university integrated innovation\nDetails on a master's program\nAt the end you dot edu flash I I I\nKnow and local events every contribution that you make helps bring you the news and so much more so please supportive into today's fund drive so we can do even more help us to do this quality journalism in service of all the western Pennsylvania for one to six nine seven twenty nine fifty five were W E s a F him\nMembership Dr will be done by this time tomorrow that you've been procrastinating waiting for the right opportunity wait no longer for one to six Ninety seven to nine five five on line W. E. S. A. dot at them today and today only get Fifteen dollars a month and we'll give you a very special thank you get\nThat W E s a free press pack it includes our new sounded a free press stainless steel water bottle that stand with a ... bad the wait wait don't tell me twentieth anniversary digital download and one of our reusable straws and normally you'd have to get three hundred and sixty dollars to get all of these thank your guest today you can get it or get to the hundred and eighty dollars or just Fifteen dollars a month\nFor one to six nine seven to nine five five or online W. E. S. A. dot at them\nThis is the time for you to do your parts of makes sense of the world's established quality journalism for western Pennsylvania just a moment or two to go to meet that goal was three thousand dollars joining us now W E S H ... for one to six nine seven twenty nine fifty five [noise]\n\nThis is one a I'm Joshua Johnson in Washington wonder Native American voters thinking about for the midterms much more than what's happening with Senator Elizabeth Warren and President Trump their ongoing feud over Warren claiming to have tribal ancestry the senator has addressed her heritage in the past\nIncluding at this year's National Congress of American Indians\nI get why some people think there's hate to be made here you won't find my family members on any roles and I'm not in the world and I tried and I want to make something clear\nI respect that distinction\nI understand that tribal membership is determined by tried and only by tribes my mother's family was part Native American and my daddy's parents were bitterly opposed to their relationship\nNow in the scheme of things doesn't matter if Senator Warren really is a verifiable tribal heritage\nClearly a does to her especially after the president referred to her as Pocahontas and said he would give a million dollars to the charity of her choice if she could prove or ancestry that apparently led to senator to take a DNA test who's results she says prove that she is charity\nThat drew criticism from tribal leaders like the Cherokee Nation secretary of state Chuck Hoskins junior who spoke on MORNING edition\nUm and then we're now at the point where she's taken a DNA test and this I think muddy the waters for a lot of Americans on a subject that they don't know a great deal about so that's what the concern is is that we're a sovereign nation we have a very specific\nMeans by which you are a turkey citizen that is true of all Indian nations and for a senator in this context of this ongoing back and forth political a fight or to talk about DNA by really undermines tribal interest frankly\nOn top of that the test did nothing to stop the presidents insults he tweeted quote\nPocahontas the bad version sometimes referred to as Elizabeth Warren is getting slammed she took a bogus DNA test and it showed that she may be one one thousand twenty fourth far less than the average American now Cherokee Nation denies her\nFree to proceed to read to explore we're Ninety forty five ... say Pittsburgh's NPR News the sound of a free press\nPhoney and quote what\nIs this story actually mean for Native Americans right now and what else matters to these voters that the rest of America should know about joining us via Skype from Anchorage, Alaska is mark ... the editor of Indian country today he's also a citizen of the show the ... nation mark welcome to the program\nYou can be in the drawing when a pair of front row orchestra seats on the aisle to see the show be the envy of everyone around you you are entered the when when you give to the members should drive right now on line at W. E. S. A. dot fmri colors that for one to six nine seven twenty nine fifty\nFive we would like to raise twenty five hundred dollars between now and a lemon am we are galloping towards the finish line but there is a go inside and your contribution right now will help get ... for one to fix nine seven to nine five five on line that he has said that I found\nTo Emily on the north side new anonymous donor from west Marlboro becoming members of W E essay right now at for one to six nine seven to nine five five were joining us online at W. E. essay\nFree to proceed to read to explore we're Ninety forty five ... say Pittsburgh's NPR News the sound of a free press\nSupport for NPR comes from the station and from St Martin's press publishers of them why we hate each other and how to kill a book from US Senator Ben Sasse about the state of politics and the country teacher available where books are sold\nAnd from home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to major re models homeowners can read reviews of local pros and book appointments online at home adviser dot com\n[noise] this is one a I'm Joshua Johnson we're discussing the impact of Native American voters and candidates in this year's midterm elections\nWith Simon Malia Smith a Chicano writer and reporter CNN contributor and then a glut Lakota citizen mark ... editor of Indian country today and they showed ... citizen and carry levine a senior reporter for the center for Public Integrity\nWe'd love to hear from you to share what you know about the impact of Native Americans at the midterms this time around comments on our Facebook page tweet us at one a or email one a at W. A. M. U. dot org we heard from quite a few of you who shared your stories\nAbout exploring your tribal ancestry about what that means to you in the context of your life here's one voice mail that was left in our inbox\nHi Sheila this is Carol elaborately uh I found out about oh four or five years ago that we had a lot of documentation from my mother to uh that we were part of the ... tribe and Oklahoma we applied to be a member of the ... tribe we were accepted\nAnd it's been a real joy to be a member 'cause we um we can vote now we get all kinds of information from them what they're doing with the tried just amazing\nCarol thanks very much for getting in touch with us ... can you give us a sense of of what the process is for becoming an acknowledged tribal citizen understanding that every tribe has the right to set its own process and they can be be quite different but ... broadly speaking what what does it take\nYou usually a tribe has an enrollment committee of some kind that actually goes through and sets out the process required proving family connections to Simon said are looking for I'm basically I'm a history of involvement with the tribe that goes back um ah through time\nI mean one of the I think really important ideas and this is that I'm a tribal community is one that's been around\nIn many cases for tens of thousands of years and so this idea of a long arc and being part of that is I think really important ... one of the things I Love to think about is shown is was hundred vested on\nHunted massive on\nHow to best it I think about that long arc\nYeah yeah I it's a I Can't imagine Simon the benefit of just kind of knowing\nThat you're part of a community that goes back\nMillennia you talked about appropriation by whites of tribal culture\nAre there other kinds of benefits that you find whether their intrinsic or extra benefits of being an acknowledge member of a tribe that are worth\nProtecting that are worth keeping their proper places I mean Carol talks about being able to vote in the tribe and also just knowing what the tribe is doing what are the kind of benefits are there to being an acknowledge citizen of a truck\nWell I think what you kind of hit it right there with that that word protection I think that's for us it is we are\nFree to pursue the re to explore we're Ninety forty five ... W E s say Pittsburgh's NPR News the sound of a free press\nDecisions are land the\nWater and the problem I see what these people that are doing these DNA test is booming biotechnology business where people want to know if they're native\nYou know they they the problem is some of them take our culture and they can modify it\nThey take our language and they can modify it they take our spirituality and can modify it and they make money\nThey make money off of something that they just either learn they are or it's been a part of the family lore or they speak with them mugging titled meant like they've lived the life of a native\nLike somebody's ever called them an engine or a our word the name of the Washington football team and that's where it becomes problematic and we have to check these allies out the door even if it's Elizabeth Warren\nI should know by the way it was almost exactly a year ago today\nThat we did a discussion about the use DNA testing kits the ones that say find nurture ancestry and learn what your family's from we did a program today's October seventeenth who did it on October Eighteenth of last year called ... where do we come from where we spoke to a geneticist\nNamed Adam Rutherford who's gone into some of the latest research about what DNA can and cannot tell us about ourselves and what you actually need to know if you were going to do one of these home DNA test\nYou'll find that conversation with Adam Rutherford on our website the one a dot org that's the word the the number one the letter a dot org\nBrittany tweeted I Am a county and kick Hanukkah or mohawk and I'm frustrated with people claiming native as a race and doing nothing to help native issues or thinking that they're uninformed opinion on native issues is helpful\nYou a progressive tweeted what we're not talking about now is North Dakota voter disenfranchisement please focused on this\nYou would progressive she must have known why we both Kerry living because we're going there next because over the past few days there's been this story about Senator Warren but Kerry we wanted to invite you on specifically to talk about what you would progress was brought up there's a lot of focus on what's happening in North Dakota what is going on there\nWell North Dakota has a voter identification law that has been stayed by the courts until now last\nWeek the Supreme Court at decided to essentially let it go into effect for the November election so what that means his new voter id requirements are going into force a month before the election\nAs you may know North Dakota is home to a very critical Senate race the race between us and our Heidi Heitkamp who's one of the most endangered Democrats and the Senate and us wrapped Kevin Cramer her Republican challenger\nPolls have Kramer ahead in twenty twelve setting the high camp one her race by fewer than three thousand votes with a very strong support from Native American voters she had a very strong support from three counties in North Dakota that that are majority Native American\nAnd so this voter id law\nCould potentially saw heavily upon Native Americans courts had stayed at because they said that that north Native Americans in North Dakota we're less likely to have the types of ID that were required the types of supplemental documentation that was required to get the idea in the first place\nSo what kinds of ID are we talking about like what does the law requires\nThe central issue here is that the law requires an ID that carries a residential street address that's an issue because on many reservations that most people don't have that they have PO box is that mailing address it and those addresses are no longer suffering\nAt the ... center so call right now for one to six nine seven to nine five five get a chance to uh to go to Hamilton W E essay dot at them\nWe know you Joshua Johnson fans out there aren't going to disappoint us we have Twenty one minute to go Twenty one hundred dollars that needs to come in from listeners like you to reach our goal of twenty five hundred dollars by noon and we know that you will support us and you will get us there for one two three to four one too\nI W E s a dot FM thanks\nToday's program I supported by the Pittsburgh cultural rushed presenting it as part of the Pittsburgh international festival first missiles Christians party October Seventeen through the twenty\nFirst created by the founders of India in theater company immersive experience features a party with music dancing and vegetarian adult prepared alive during your performance details that trust or it's dot org\nSupport for NPR comes from the station and from capital one committed to reimagining banking offering savings and checking accounts that can be open from anywhere capital one what's in your wallet capital one in a\nFrom farmers insurance committed to helping people understand the ins and outs of insurance so they can prepare for life's ups and downs coverage options and more information can be found at farmers dot com\nAnd from the John D and Catherine T MacArthur Foundation at max found dot org\nBefore we get back to our conversation we would love your help with tomorrow's program about the job market America has a record number of job openings right now more than seven million tomorrow will be in New Hampshire to explore why finding the right workers is getting harder\nIf you run a business have you been able to hire to help you need heavy maybe had the sweetened the deal to attract new staff\nLeave us a voice mail eight five five to three six one a one a now maybe you're looking for a new job how do you feel about your options in the labor market right now\nTell us your story eight five five to three six one a one a you can also leave us a radio quality audio file through our app won a vox pop will share some of your stories tomorrow from New Hampshire on one day\nBack now to our conversation was TSA lame in his new memoir is called heavy we'd love to read your questions and thoughts about the author has worked or any of the themes that resonate with you comment on our Facebook page tweet us at one a or email one at a at W. A. M. U. dot org\nLet's read one more eggs or from the book this is about something that happened to you and your mother or when you were younger not real far from here in Maryland\nScreaming on double you quoted by American University integrated innovation [noise] the town I'm a master's program\nOr die flash I\nDump aged he won the part that begins when we were half a mile from home so almost the end of page eighty three which ends with the word flying would you read that first please\nA sure any one of the ... when we were asked of okay\nWhen we were half a mile from home or Maryland police cars stopped us just like when they stopped us in Mississippi you set up in your seat kept ... kept both hands on the wheel and looked straight ahead\nYou took out your University of Maryland id and saw my red black and green African medallion into my public enemy T shirt you told me to sit up keep my hands on the dashboard don't say a word\nOfficer knelt down and lifting your window when I saw your face or close to his gun I wanted to snatch it and watch it melt into black grits evidence police started approaching me more often and Mississippi I wanted to super power to melt every gun in the world and the black grits officer asked why we had in Mississippi license place\nBecause we are residents of Jackson, Mississippi you say I have a post doctoral appointment at the University of Maryland College park have I done anything wrong officer\nWhen officer told you to speak up and claim you changed lanes without signaling you kept your grip on the steering wheel and said I did not change lanes without signaling you spit up behind me so significant change lanes officer tried to laugh in your face if he asked for your license in registration\nIs that your man he asked you he needs to show some identification to\nYour hands came off the steering wheel and you pointed at officers face move away from my car you said that as much as he is Fifteen Years old he does not have identification I mean I have your badge number please I hated how it sounded when you didn't use contractions\nThe officer as both of us to step out of the car we will not get out of this car you said louder this time\nWe have done nothing wrong my fist were bald up and I was edging towards the driver's side window you slapped me across my chest with the back of your hand and told me to be quiet and unconscious surface right as another officer pulled up the first officer who is now laughing walk back to the second officers car\nYou eventually showed a second officer your license and your University of Maryland I D\nD officer looked at the id flipped it over and told us to have a good night\nNever give them a chance to take a shot you finally said after we walked in the apartment and lock the door they will take it they will take it they will take it I wondered why you set it three times and why you never told me to shoot back\nMississippi Marilyn it doesn't matter where the where you are they will shoot Joe Black but out of the sky every chance they get if you have a heart attack dodging bullets they hide their guns and say you killed yourself\nI hear you I told you and try to make you laugh why didn't you just said don't instead of does not or doesn't and they instead of their though\nIf I did not know correct English is more likely that officer might have shot us you said oh you wouldn't I told you that fool that matter because you were speaking correct English you looked at me like you were thinking you might actually be right key but in the long run correct English will save a black man more than it will hurt you\nWill correct English they view though\nI Do not need saving you said I Am not the one who was an endangered species I'm not either I told you I Am an endangered species would a lot of gas in my stomach I'll be right back that cop gave me the bubble goods you laughed and laughed\nFree or low rate of ... the the Ninety five W yet they Pittsburgh NPR News station from other free prompted\nMe to write about what I learned from the experience with the police I wasn't sure what to write because I wasn't sure how to live life in a way that didn't give them a chance to shoot us out of the sky\nIt seem like just driving or walking into a house or doing your job or cut it in a grapefruit was all it took to get shot out of the sky and the biggest problem was police weren't the only people doing the shooting\nThey were just the only people allowed to walk around and threaten us with guns in prison if they didn't like our style of flying\nI loved our style of flying\nOut of their eggs or for heavy psyche essay lame and there is a lot going on to the eggs are but I think one of the census from the last paragraph struck me where you write I wasn't sure how to live life in a way that didn't give them a chance to shoot us out of the sky right is that kind of the crux of it\nYeah I mean that's a crust of a lot of uh the relationship our talk about in his book with my mother um I'm also talking about a situation where we went to had to go to a new school in eighth grade was first time I've gone to school with white kids\nAnd I'm a few my best friends from a previous school were there and one of my best best friends um took out a butter knife before school started and started trying to cut his grapefruit the same way you did every morning when we were at a other school in Jackson and long story short you know the teacher uh eventually told and put the knife away treated a knife as if it was a gun\nOr we both got kicked out of school that day and we got what to buy our mothers and grandmothers\nAnd in that situation I learned that sometimes in off in a mock communities um it was black mothers primarily who had to discipline their children for the failures of their teachers\nAnd so uh my mother would always say you know you have to fly right you know don't give them a chance but I'm saying as a Fifteen year old I said I'm not sure what not giving them a chance to look like\nEating a grapefruit got us in trouble just now you didn't do anything we got in trouble later I Would take a library book out an elaborate without checking it out and that got in trouble so I just wasn't sure about this this a theory my mom had the you know you conduct them you can dodge them if you just anticipate every move\nAnd again anticipation is crucial but what happens to the home life when you spend your entire life outside of the home anticipating white supremacy and white power doing un that's the question I'm trying to ask him infection and also in the entire book\nWhat did happen with your home life particularly with with you and your mom as you were trying to grapple with these things that she was telling you or the way of the world and you were trying to understand and how did that affect your relationship with her\nYou know one one way I think a lot of just traditionally American things happen I started to be resentful that my mother was telling me things some things that were right some things that were wrong\nUm she started to be a a a lot more active in trying to police me as my body group um and I started to have lots and lots of run ins with cops are starting to get kicked out of school more [noise]\nUm but and we could talk about those things sorted we could talk about police we could talk about white people but we we couldn't talk about with things like sexual violence so we couldn't talk about with like domestic abuse she was in an abusive relationship I saw that relationship I reacted to that relationship I tried to fight and protect different relationship\nBut I Would never talk to her about that fight in our protection she saw me and relationships that were like difficult for me where I was being bad to myself when I was mistreated people emotionally we didn't know how to talk about any of it so while we're doing really good sort of at talking about how we survive outside of the house", "year": "2018", "show_name": "1A Plus", "city": "Pittsburgh", "day": "17"}