{"month": "10", "state": "AL", "station": "WAPR", "content": "Show starts at ... pm for information call to five six seven four zero for one for one\nFor these and other events in your neighborhood just go to our website H. P. R. dot O. R.\nG. I'm Pat Duggins thanks for staying too to Alabama public radio\nIn Alabama public radio there because of the University of Alabama W. H. P. R.\nSound that he is he'll be our ...\nW. H. I. L. mobiles W A L F in Tuscaloosa definitely history be the Tuscaloosa\nEvery case that we are we are we are we I we are Alabama public radio [noise]\n\n\n\nFrom Alabama public radio this is getting sentimental overuse the program a big band memory I'm Dave Clark and for the next hour I invite you to reminisce with me as we listen to the music of the big band there are those great Ben decades which spanned the leader Nineteen twenties through the mid Nineteen forties\nFrom time to time we'll also sample other music reminiscent of the Arab but mostly this was our time to Baskin recorded legacy left to us by the undisputed masters of those sweet and swinging years [noise]\nA lot of things have changed since then but if you will come along with me I think we can forget the rest of the world for a while and relive the glory years one more time as getting sentimental over you draws you back into the heyday of the big bad [noise]\n\n\n\n\nI Want to thank all of you for sending in so many requests for are the\nMoonlight serenade [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nIt is the story of a starry night man narrow men's department or Singapore lemon\n... or ... you know the\nUm the or\nThe blue or would you do a ... a\nMan and it seems to me and then\nYou ...\nIt's not yours but\nAnd man\nWho wins ...\nLa ... one\n[noise] oh\nWere you know [noise] be connecting Marlon but\nFor a long\nWay I saw\nWhy bring by ... or ...\nOh no\n[noise]\nBall ball ball [noise]\n\nA recall ... Laurie I'm not that led by a robotics\nMeadow habit that are rich and then the guy that you are a lot of snow in which\nWe remember at all was loving and we're ... we're ...\nWe're not rich the garage your show that they do a\nLot of snow nor place my thing on the moon and stars bell in your\nLate on all the all\nThe world that we will began to grow\nThings unspoken wrap their car parts\nMadly maybe not all of them were maybe ...\nYou know now\nWe turn to say but I haven't done a blessing a show about ... oh\n\n[noise] [noise] mhm mhm mhm\n...\n\n\nWhen James\n\n[noise]\n[noise] [noise]\n\n[noise]\nI remember you [noise]\nYou know what may be true\nA few moments to go [noise]\n\nYou know the wind\nI Do\nThen you know [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nOoh\n\nOoh\n\n\nNo\n\n\n\n[noise]\n\n[noise] Mardi gold ladies and gentleman on a Nineteen sixty three RCA diner groove lp called sounds unlimited ... mastered on on our on our C a magnetic tape\nHi Dave Clark with getting sentimental over you the program of big band memories on Alabama public radio service of the University of Alabama\nAnd I mentioned RCA magnetic tape because this album dares you to quote compare it with sound of any record on any label anywhere and really\nThe sound was pretty good and they touted die in a groove as being controlled by quote highly ingenious computers\nAnd eat or electronic brains that produced notable advantages and virtually every step of the recording science unquote\nAnd of course you know that in Nineteen sixty three a computer would have been the size of dreamland barbecue pit and would have had all the power of a digital calculating wristwatch today [laughter] nevertheless it was good sound but still not as good as ... thirty five millimeters rocketed film recording\nA rocketed magnetic film recording process in mind that so humble opinion [laughter]\nMardi gave us nice arrangements though of Alone Together and when your lover has gone and we started this last set with two more from Roberta sure would and and on identified orchestra they were under a blanket of blue and I remember you\nKnow what I'm going to say next please don't uh construe as being racist because that's one thing I certainly am not but\nHad I not seen Roberta on the album cover I made a mistake in her voice to be that a black female vocalist and that's certainly not criticism that sprays\nLikewise Mildred Bailey was one of the first successful white jazz singers and the Nineteen twenties and listeners frequently missed identified her as being black because all the other great jazz singers work\nI just thought I'd mention is in case you didn't know one way or the other right to me if you care to at a PR band show at Yahoo dot com or in care of Alabama public radio at post office box\n\n\nNa na na\n\n\n[noise]\n[noise]\nI remember um\n\nDa\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n[noise] Mm\n\n\nA oh", "year": "2018", "show_name": "Getting Sentimental Over You", "city": "Selma", "day": "14"}