{"month": "10", "state": "NY", "station": "WABC", "content": "Comes to your aid with decades of expertise and they talk in a team approach for maximum results if you want something from a new one ... points injuring frequent physical discomfort in any real like spine and joint pain muscle ligament or nerve injury pastoral stress Manhattan sports medicine\nUsing your techniques in sports medicine spinal decompression and functional rehabilitation MSN can put you back in control and now MSN offers hyper\nBarracks oxygen therapy the digital recovery and training to a whole new level to set up your free consultation today visit em em wellness dot com bust M. S. M. wellness dot com and start living up paying for your life you deserve\nScience fiction author Arthur C Clark than any sufficiently\nAdvanced technology is indistinguishable from magic remarkable memorable experiences in modern stadiums airport transportation hubs and smart cities transformed public perception intelligent digital signs and smart censor provide the opportunity to impress\nEnemy while serving the public scholar a leading global technology company powers millions of digital signs around the world visit scholar dot com today to start the conversation about bringing digital transformation your modern venue\nHey Bernie how does a brand new superhero sound you sound a fantastic I Love those costs well like the perfect ... what does that are only consider us through by no I got the perfect ... two thousand Nineteen super ... has arrived well tell me a little more said I Love these cars Rabbani superconducting jet stream apple playing or enjoy audio\nCan I listen to a CD R or love AC DC your bet you can be great but it's also not Bernie bought by hotspot now I Love being connected to the wife got something better blind spot ... eyesight driver assist warning if his White House I don't really love that technology\nEdge confidence to every ... really does for at least one for just two hundred and thirty five dollars a month for forty two months and only twenty nine sixty to cash\nFor trade what scientists call a day five five forty one twenty five released details will visit Randy super dot net to see the all new twenty Nineteen forest\nOffers available to qualified buyer subject to primary lender approval for ISIS include all costs to be paid by consumer except for licensing registration is access the cage for one zero six five seven model sailing and thirty one Eighteen\nOn election day millions of Americans will cast their ballots many for the first time it marks the beginning of a new era of an era where we proudly participate and so the\nThe check to check your voter registrations find your polling place or get election information that the headcount ... it's a nonpartisan resource motives of all ages background\nThen marine this teacher is now and the ... in this age he any D. C. U. N. team got ... ...\nThe Russians have elections infrastructure and the government secrets to the United states has master hackers Tim\n... is our CIA cyber ... all notions of the deadliest by looks like invite former intelligence agent ... paints turning new kind of that and the tables are turned him the power cyberwarfare Eric ... new novel from guns on and find\nThe Whitey night now on silent Amazon dot com as a team and then for dot com\nBalance of nature's fruits and veggies in a capsule\nThat that I had a sinus headache for a few days but I had a massive brain ... image of the brain and stroke and I was on my deathbed I was on a respirator in a coma for thirty five days and three months later I came home and the wheelchair and double vision I had to learn to walk again to speak\nAgain why didn't want us to write the alphabet you know if I went out and did a little something might come home I'd be in bed now I'm up by five thirty in the morning and go to the gym I Do shopping I cook I energy all day I mean I feel great\nOverall my whole outlook just feeling about my mental aspect everything everything is better\nFor a limited time used discount code W. A. B. C. and we'll take thirty five percent off your first preferred sets of fruits and veggies and have them shipped to you free goal eight hundred two four six eight seven five one\nThat's one eight hundred two four six eight seven five one or go on line to balance of nature dot com and used discount code W. A. B. C.\nComing to you I\nOnly way they see is home to\nZachary and healthy Seventeen [laughter] New York city's premier against the forces exclusive interviews alive I guess for music and entertainment space SARS ... Seventeen dot com to see past performance is follow Asia and they said seven feet on Facebook Instagram and Twitter join\nConversation I usually say H M A S H Seventeen and then\nIf you plan on selling or buying a home listened to this important message rex real estate is selling homes in New York for two percent total that's right only two percent not be outrageous six percent traditional real estate agents charge saving ... on average twenty five thousand dollars is a\nFully license brokerage rex lists on top of real estate website slugs Zillow truly\nA and street easy rex uses advance digital marketing strategies to find qualified buyers for your home to see if you qualify\nCalled five one six to one seven eight five nine nine\nFive one six to one seven eight five nine nine joined dedicated rex team handles everything from photography an open houses all the way to negotiating offers and closing paperwork\nIf you want to pay just two percent you've got to sell your home with rex to see if you qualify call by one six to one seven eight five nine nine five one six to one seven eight five nine nine which is only like this brokerage must have never wants to what they want to see what's at once I\nHave a shot out the P. Morgan ... been talking about pills foreigners as America's Best bill pulled us for a while now and they are\nA great point or if you have your home or business with natural gas or oil they have a ... type that's just right for you any home ... don't go up apartment building you name it so now it's a perfect time to get that we set up your basement on your own border to replace it with a high efficiency purely spoiler\nLook for the brand new American Made purely spoiler comedy a boiler that delivers the most hot water in the product class and heat your home or apartment\nThe way you expect appeal is boiler to do so don't wait for the cold weather upgrade your border today with a Ninety five percent of ... oldest boy dark comedy\nI start saving on your heating up water bills today folks don't wait until it's too late you have a big leaking medicine and no heat emergency on\nYour hands don't saving money now get that piece out of your basement by going appears porters dot com put in your ZIP Code and funding from the dealer near you and remember purely spoiled or as America's Best spill point or is [noise]\n\n[noise] so the stomach [noise]\nStrike that your guests [laughter]\nYour stories for its really\nUp [noise]\nDocuments to what we need to just make one ... Lopez dominant we bought our more gas more to talk about ticked off three hours away this week in the report\nSponsored by Manhattan sports medicine a wellness group dedicated to helping New Yorkers we basically dynamic live free from pain MSN wellness the leader in sports we haven't\nPhysical therapy is a place to go M. S. M. wellness dot com and London by the way chargers just turned a punt for a bundle all backed by a penalty they've got the football in their own territory leading Tennessee seven three rivers the tight Williams or Seventy five yard touchdown they played about nine minutes in that game\nBiking twenty bucks Alvin cook is out today Vikings against the jets Rob Gronkowski did not travel with the patch to Chicago for the past and bears later on tonight and Josh Allen the rookie will not play quarterback for the bills against the culture that I said veteran Derek Anderson\nWill played for buffalo also had to hold out for the second so we're from Miami do play by us one of our homes against alliance today but do we start picks female\nPlant Norman in the lead when I went to last week but he's doing two tons he got a when he's no one in three guns out who your true picks for this week\nLobby there and just a little bit jets over the blankets baby out they met live with my sports Sunday Mike flags recovered it for you baby let's go with that and they also home\nDog that I Do the right up the wins you don't win that game\nBut it's still makes thing for sure that stuff you need that way and then coats six and a half over the bill\nI like to have picked to be mailed to an all week one owing to last week to get back this week what are you back on this night gave me the fifth rank total defense Detroit Lions giving a half a point to the dolphins and give me Tom tom even without ground given three and a half\nNo problem you made a patriots all over the bears okay I have no clue Mack Mack is right the male excellent job really good to see a by the way on these Sundays you're helping out tremendously gun gee I kept I get a mom dad you're only going much better job than I thought you would ... I'd give you an a plus and\nThere'll be honest when they said we were hiring you always very very nervous very ... very or what your kicking ass Bruce Clayton excellent job I'd say excellent job and don't get don't quote me wasn't quite as much as I Do that anyway we are\nBack tomorrow morning at six am with the grand new party and sit in the morning show me Tony ... and back here for a week eight ... next Sunday until that everybody enjoy your foot on Sunday [noise]\n[noise]\nFor you the greens inorganic choose Clinton's their farm fresh there\nThe hydrated at low temperatures which locks in all of nature's goodness the vitamins and minerals antioxidants it's all there because this is made from real organic produce we're talking\n... first vegetables deep dark Reince blueberry strawberries apples there's green tea carriage cranberries black car it's ... we've done to work\nFor your pet and key this is key we've done it at low temperatures blocking in all the benefits of these all star organic stupid foods you simply add water shake it up in the free shaker couple gonna give you today trinket down to taste delicious and that it goes to work helping you\nKnow Dr speaking of the organic juice ones juicing is sweeping the nation juicing revitalize it energizes it can help you stay fit and shrimp in many ways it helps us put back what's missing in so many of our diets as good as the original formula is why called this new organic juice clans\nPlus formula a major upgrade why\nWell first of all we beef up the scoop size it's thirty seven percent\nBigger ... so now you're getting more of the energy\nBoosting revitalizing cleansing super foods and every scoop we added sixty seven percent more fiber for improved digestion elimination for cleansing the detox define it as the blueberries the strawberries we added broccoli milk fissile to help deliver cleansing detoxify system\nThere's carrots for the eyes green tea for energy metabolism\nCranberries for the urinary tract I added opposite ... hail and I'm just scratched the surface here all of these fruits and vegetables and berries specifically chosen for the incredible benefits that they gave you're going to feel better\nWith O. J. C. you're going to notice it rapidly especially if you don't get enough fruits and vegetables and again everybody in the listening audience today gets a free bottle over kind of ... plus a free shaker cup and help you mix it up into a delicious Korean smoothie\nNow talk to us about some of the advantages of using O. J. C. versus a regular juice or in terms of the carbs the sugar the fiber in why OJ see not only saves time but it also saves you a lot of money\nRight you know I was using a Jewish or for years and you know what bothered me the most part the cleanup down that's not a hassle\nIt take forever you've done it before you know what it's like\nCleaning the produce cleaning the machine after what it is a minimum of twenty minutes and you know what your juicing let's say bananas and grapes that's going to taste good but go start juicing the partially the celery kale the broccoli the spinach it's going to be hard to get that down right about the sheer cost of juice and search you got to go out and spend hundreds on a juice or\nAnd then if you're going to go work at it in a few hundred juice are highly recommend that you know to spend eighty Ninety bucks a week on juicing\nThat's crazy and another problem with that users you end up throwing away all the fiber and you're concentrating the sugar that's not good\nNo no exactly and that's one of the dirty little secrets of juice or as\nYou know the fact that you're throwing away the fiber and so therefore you're concentrating the sugar you know ... I was in the health food store the other day I grabbed a bottle of blueberry juice a hundred and ten calories pack twenty six grams of sugar\nWhile in Milan serving I grabbed a popular pomegranate juice a hundred and fifty calories and thirty one grams of sugar\nPer serving such crazy and that's because they're removing the fiber in the process that they use their concentrating the sugar what we do ... is the ...\nHydrate and the greens at low temperatures for maintaining all the good stuff fiber is there a fighter nutrients the antioxidants\nThe vitamins and minerals the plant and sometimes it's all there one serving a purity is organic ... it was only forty five ... calories and that's because all the fiber is still there remember this is made from real organic produce all we're doing is removing the water at low temperatures\nBlocking and all the good and as you can taste it you can taste the organic fruits and vegetables berries you just add water shake it up in the free shaker cup get it into your system and it goes to work helping you\nBuy what about the science behind these certified organic super fruits and vegetables found in the organic juice ... what does the science say about getting seven nine servings of fruits and greens predict how important is that to consume those on a regular basis and what percentage of us really gives enough\nOr look at my patient base I Would say maybe it's one out of twenty seven to nine maybe I'm wrong maybe it's one out of fifty I rarely see it\nAnd the problem with that is that the science is crystal clear that this study is by the thousands are done and the results are in bottom line if you eat more fruits and vegetables hopefully seven to nine servings a day you're going to support your focus your concentration\nDefinitely your energy your skin will look better helps the eyes the brain digestion elimination it's going to support your liver pat in its job of cleansing the tops of find your system\nAlso fruits and vegetables they're powerfully antioxidant plus they ... the body that's so important world to asset and that causes a legion of calcium from the bone so by our allies in the body you support your bone health listen\nIf you're a fifty plus ... like me and you notice that maybe your energy isn't the same if this sounds a little bit familiar to you and you're not getting\nSeven to nine servings fruits and veggies so they this is one of the main reasons you're feeling this way and that's where O. J. C. comes in and this is your short cut this is the easy way to get those plant vitamins and minerals\nTo fight and nutrients from thirty different super foods into your system every single day\nWe're talking blue berries strawberries kale spinach partially ...\nNo one's getting this stuff right I mean no one's getting this and then when you start to add into your system every day you're flat out feel better it's a different you're going to notice especially if you're one of those people that aren't getting enough fruits and vegetables\nAnd thirties given away this new and improved organic juice cleanse for free today plus you get the free shaker cup for free as well and on top of that you demanded this for the first one thousand callers purity is also giving away free bottled you're awesome B. twelve energy mills now that's a pretty great offer today why you're doing all this\nRight well you know the first thing that my patient said to me when they started using the organic juice Clinton says doc I feel so much better doc I have more energy so when I think about oj see I think about energy and the very next thing that comes to mind when I think about energy is be twelve right I mean\nYou probably have known people that have gone to the doctor for shots to get beat swell but they do it for their energy I just remember my grandfather to the\nAbsolutely it's common so people go to a low energy they go they get that beats wealth they feel better and that's what the beat swelled energy melts are all about so\nIf you're in your sixties seventies eighties you naturally can absorb the beat twelve as well as it used to and if you're low on B. twelve and you suck on these ... twelve energy melts naturally boost your be twelve levels which boosts your energy it's a difference you will feel\nBeat twelve helps make red blood cells they carry oxygen to your tissues and you feel better plus there's bias in in there which supports the hair skin and males to\nThis is a great offer you get your feet swelled energy melts you get your Ghana choose Clinton's you're going to feel way better you know there's one catch that everybody out there it's going to get the are going to choose plans and the shaker cup but\nYou have to be one of the first thousand callers to get to be twelve hundred emails and if you listen to a big station pay attention because these things fly out the door\nAnd pad I'd never seen purity give away three free gifts like this so I don't know how long this is going to go on just pay six Ninety five per shipping get all three today you're going to love the benefits you get with the organic choose Clinton and there'd be twelve energy melts\nMore coming up take great news there is a free bottle offer today on O. J. C. the organic juice clans from purity products\nThis is organic juicing made simple every scoop is bursting with thirty different super fruits and veggies berries enzymes bio nutrients fiber and more here's the deal is part of this special weekend radio promotion you just pay for shipping and handling only six Ninety five\nAnd purity gonna rush you ought to free bottles or new and improved organic juice Clinton's to put to the test even better call now and purity will also toss in for free\nThey're handy dandy shaker up so you can mix up your OJ seat into a delicious Barry greens smoothie every day and wait it gets even better because if you're one of the first thousand callers today purity is also going to include a free bottled up there be twelve energy ... so called al\nDial one eight hundred six to eight Eighteen Ninety One\nThat's one eight hundred six to eight Eighteen Ninety One again one eight hundred six to eight\nEighteen Ninety One quick OJ seat to the test there's nothing to lose by the way you're not fully satisfied purity even refunds to shipping please note this special offer is not available in stores and or online limit one free bottle per customer again this is a triple free\nOffer call now for your free bottle the organic juice cleanse your free shaker ... plus\nThe one of the first thousand callers today and you'll get your free be twelve energy melts call now one eight hundred six to eight Eighteen Ninety One again one eight hundred six to eight Eighteen Ninety One one last time slowly one\nEight hundred six to eight Eighteen Ninety One\nHigh we're back with Dr ... eleven okay we talked earlier about this toxic world in which we let you sent me this list called the dirty does now this is not the list of actors in that war movie from fifty years ago this is a list of the twelve most contaminated fruits and vegetables and let me tell you something unfortunately\nSeveral of these are in my kitchen right now as we speak so what can we do about this [laughter]\nI'm thinking about that old war movie with telly Savalas in Charles Brown fitter and it was kind of a scary movie there but yeah you're right I mean this list is scarier because\nThere is a catch if you want to be twelve energy melts you got to be one of the first thousand callers don't call me up crying if your number twelve hundred you have to be one of the first thousand\nYou pay six Ninety five per se shipping if you don't notice the benefits were talking about today purity will happily give you back your six Ninety five but no one does that everybody loves the benefits they get you're going to love it just be one of the first thousand colds get all three for free today you're going to be thrilled\nGreat information as always let me get to that special offer one more time take good news there is a free bottle offer today on old Jaycee the organic juice cleanse from purity products this is organic juicing made simple\nEvery scoop is bursting with thirty different super fruits and veggies berries enzymes nutrients fiber in much much more here's the deal as part of this special weekend radio promotions\nYou just pay for shipping and handling today six Ninety five ... going to rush out of free bottle of their new and improved organic juice plans to put to the test even better call now and purity will toss in for free they're handy dandy\nShe grew up so you can mix up your own Jaycee into a delicious very green smoothie every day and wait it gets even better because if you're one of the first thousand colors from today's show ... he's also going to include a free bottled there'd be twelve energy melt so called al operators are standing by dial one eight hundred\nSix to eight Eighteen Ninety One that's one eight hundred six to eight Eighteen Ninety One again call now one eight hundred six to eight Eighteen Ninety One put old Jaycee to the test there's nothing to lose by the way if you're not fully satisfied\nDirty will even refund your shipping please note this special offer is not available in stores were on line ... one free bought up our customers again it's a triple free offer call now for your free bottle of the organic juice kinds and you're free shaker tough\nPlush be one of the first thousand colors and get your free be twelve energy melt call now one\nEight hundred six to eight eighty Ninety One again one eight hundred six to eight Eighteen Ninety One one last time slowly here we go one\nEight hundred six to eight Eighteen Ninety One [noise]\nProceeding was appear advertisements by purity products these statements have not been evaluated by the FDA this product is not intended to diagnose and treat your will prevent any disease\nWABC New York\nIs early reflect the views of WABC radio [noise]\nThe following years of data advertisement ... products these statements have not been evaluated by the food and Drug Administration this does not intended to diagnose treat your prevent any disease and\nWelcome to the nutrition edition by purity brought us giving you special insight into the world of health and nutrition now here's your host Martin Lawrence and\nThank you for tuning in a great show had for years so stay tuned but before we begin I like you to put on your thinking cap Brent to name this nutrient no nutrition is love it\nBecause clinical research shows that fight fatigue while promoting muscle strength and endurance by one as we accepted measurement it's six thousand times more powerful than vitamin C. it's eight hundred times stronger than co Q. ten\nIt can improve your depth perception and millions of people in Japan use it everyday to fight wrinkles and fine lines from the inside out so what is it what nutrient are we talking about well Sherry ... to reveal the secret she's a practicing pharmacist an author she's written more than a dozen books on health\nIncluding the Canadian encyclopedia of natural medicine\nWelcome to the program surely joggers good to have you here\nHey there mark thanks so much for having me this secret nutrient that we're going to be talking about it's called ... than than and readers digest they featured it brilliantly in an article called the latest it antioxidant after that then it's a fountain of youth\nAs he mentioned very popular in Japan used mainstream from\nFor promoting beauty from within the capsule but here in North America people just aren't as familiar with that but but listen to this it has to\nFix the human studies validating its advocacy and as a pharmacist there really caught my attention and this trend is not something that you can get enough of an diet it's founded fan and but you really have to eat a lot of than like five pounds\nJust to get a good family shows as much as I said I Love salmon but I'm not doing that for a jury I didn't know that\nThere were sixty plus human clinical studies in this specific natural form of ashes anthem that happens to be and purity asked to ethics formula talked about Japan I'm not ... this is a capsule this particular asked his anthem is all the rage were skin health as they've been finding in Japan very very interesting on so many fronts you're right\nYeah for sure I mean after than than at just ... milligram dose and that's the clinical does that is and purity it's aspects formula it's clinically tested and shown to fight fire lines and make us from the inside and millions in Asia take a daily basis for that and I don't want to get to technical here but but just one\nHuman study that I'd like to mention too hot to back up these benefits they use the exact same dose and the type that does happen that's in purity product and they discovered significant benefits for skin hydration\nSkin texture snooze ness elasticity\nReduction of a skin spots and there was even every action of redness and an improvement in the even if the skin tone so we are talking about big beauty benefits and it works from the inside out which is fabulous men love it when and love it and it's really catching on here in North America\nIt sure is it's a really impressive list of clinical benefits for unifying scams on the inside out no wonder they love their in Japan and now we're learning about it here but ... do you like to see the wrinkle reducing benefits and the skin tone benefits are just part of is that just kind of a jury on the top what do you mean by this\nWell you know I talked to a lot of people in the pharmacy every way cuts I work as a pharmacist and I also get a lot of friends and family and colleagues asking me about their health than many people are you know in their fifties sixties seventies and and they really liked the idea of the supplement that can help to improve the parents of their skin and then we all want beautiful\nUseful skin but for most people have this really isn't that keep benefit what's at the top of the list when you ask people like what like a day most of achieving their health on this they want something that that what\nThey want something that will help to promote muscle strength and they want stamina they want to be able to do the activities they enjoy golf tennis hiking playing with their kids and grandkids and this is actually patented for muscle strength\nYou know people want energy to fight tea they might feel sharp they're also concerned about their vision and they want to keep their eyes healthy\nPeople are concerned about heart healthy circulation and humidity all of these areas I'm really talking about staying healthy from the inside out so you know when you think of it the skin benefits are compelling but to me it's really just the cherry on the top\nYeah sure you were saying that ... helps with endurance and performance against salmon loaded with this does happen they perform these amazing seats of endurance\nAshes anthem is also founded high levels in the eyes of seagulls now that's interesting ... bike faster when they supplement with a specific form of asked his anthem so is there a common denominator in all this these kinds of bits of information\nWell the research here it's really clear after than than it is a molecule that feels\nHealthy performance energy stamina strength that's what we see in nature and that's what we see in humans to it's like if you're getting older and you want an edge for strength for energy for you for skin tight rankles from the inside out but also to promote endurance and healthy dish and\nThis is what you take you take the ... the FX formula with the clinical dose\nOf the right type of ... and you really feel it\nBy one measure of antioxidant activity called thing let oxygen clenching activity after that and if a hundred times stronger than co Q. ten\nAnd this is published in two thousand seven and a journal called ... science another study found that after ... six thousand times stronger than vitamin C. as an antioxidant again and it ... oxygen scavenging capacity so it's incredible\nI Know purity has a free bottle a vast FX just do little liquid capsules a day that's all you need and we're going to give out especially hundred number\nAnd just a moment for our listeners to take advantage of the free bottle offered but before we do the cherry purity uses this natural form of asked his aunts and not that synthetic cheaper form what you find out there on the market this is really important as well correct\nYeah you definitely need to do your homework when choosing supplements and that's what I did ask that fact seizes for milligrams of the world's most clinically researched natural form a faster than than called after real\nJury tour goes pharmacist an author is with us here in the program machinery we learned today that says anthon is six thousand times more powerful by this one measurement of antioxidant activity when compared to vitamin C.\nThis asked FX has so much power purity has something like a hundred plus unsolicited testimonials on their website and I found a couple that I especially enjoy if I could read a couple of those I think this was very they're very interesting it was okay with you\nI think it's great to share feedback from people that are really taking the product\nHere's one from ... in Texas she gives asked the FX five stars and she writes quote after taking asked FX my son was visiting us and said mom you look useful I'm of purity products\nThey were for the last three years of will never go back that's from a but here's one from Nina in Ottawa, Ontario\nAnd she's in the age group a forty five fifty four gives it another five star review she says this quote since taking asked the FX I felt so much better my energy level I Would say has gone from a three to a gym how 'bout that she says so I feel energized whenever taking\nAgain we're talking with pharmacist and health author Sherry Turkle about our free bottle offer for purity products talking about asteroid affects so much ground to cover Sherry I Want to get back to the skin benefits in this issue of wrinkle reduction or not I repeat not as a cream or as a lotion but as a cap so you take it orally this patent\nAlso covers this as you say this ingredient is proven to reduce wrinkles and not just my own little we're talking a dramatic amount what's going on with this\nYeah I Know it's it's fascinating a huge benefit people want to look younger I Know I Do and and I've noticed significant benefit since I've started taking it\nBut it's a science here that really shy and the whole concept of taking oral supplements to improve skin health relatively new concept here in North America but in Japan this is mainstream after that that is already one of 'em if not the most successful ingredients in a new class of products called\nCausing the suit of clothes or supplements\nThat you take or early to enhance the cosmetic of parents of your skin so listen to this in one study they gave for milligrams of asked his aunt than which\nBy the way is the actual amount you get it purity fast that facts and the skin benefits for dramatic within six weeks every single person into treatment group a hundred percent of participants in the study reported that their skin had improved significantly everybody got results\nFine lines hydration elasticity all improved listen to this the participants experienced about fifty percent improvement in dryness moisture\nRoughness elasticity fine lines wrinkles even age spots for significantly diminished and this is literally in line with the best the highest quality and the most expensive\nTopical products the lotions potions that we put on our skin and again after death acts it's exclusive to purity products\nInjuries you could try it for free today that exclusively from purity products this was the good stuff with all the clinical data behind so don't just go out and grab any ... than they are not all created equal\nPurity has these tiny liquid veggie camps easy to swallow make sure you drop down make note of this eight hundred number the toll free number to call in and said call in right now\nSo you don't miss out and get your free bottle for asked the FX the phone number is toll free one eight hundred five hundred twelve Seventy one eight hundred five hundred twelve Seventy one eight hundred five hundred twelve Seventy or free bottle and purity we'll give you a second free gift a bonus\nCall right now they'll tell us in a free bottle of their be twelve energy melts plus by up to him\nOr a natural burst of healthy energy that you can enjoy anytime you needed these free ... be twelve energy males promotes healthy energy unhealthy hair as well you pay only for the shipping that's six dollars Ninety five steps you get your to free bottles nothing to lose a call now\nClaim yours before they run out here's the number one more time one eight hundred five hundred twelve Seventy toll free one\nEight hundred five hundred twelve Seventy this double free bottle offer is not available in stores are online only direct through today special radio off her line\nBy the way limited one free offer per household please a series where people are just tuning in one of the many highlights recovered earlier on today's program is just how revolutionary this special purity asked as Anthony is we're redefining aging skim and ashes anthon works its magic inside the body in areas like in ... stamina energy\nThese are so many of the inside out benefits people will feel it in fact what will they feel when they start taking after effects\nSo they need to get this a try it's because the benefits are real the science is very compelling over sixty clinical studies and pat and I mean the product is impressive and it really works this is a product where you will actually see and feel the benefits after taking it a month or so\nThe cosmetic benefits for your skin and we just mentioned a minute ago really incredible I been taking it myself\nAnd I see a huge difference others have noticed two people are always saying to me what do you use on your skin what are you taking and you know I tell people what you put into your body is just as important if not more so than what you apply to your skin and think about the vision benefits really unmatched\nBy any other nutrient supplement out there it targets tired eyes I trade and it helped improve I focus and depth perception it's great for circulation energy muscle strength endurance you can literally boost your strength as we age that this is crucial and help to enjoy life and stay in the game\nAnd it can even help with\nRecovery after exercise next I says that that has the ability to fight fatigue and support mitochondrial function so that means cellular energy and ATP support\nMachinery didn't you mentioned before the show that asked his anthem has the ability to assist the body burning fat for energy understand or even looking at this as a weight loss in weight management ingredient this was pretty fascinating in itself to talk about what we're seeing him some of these initial studies on dieters\nSure you know research has shown that after that they can actually help promote and enhance fat metabolism that's one of its unique benefits it can actually help yourself burn fat more efficiently researchers did an eight week study where they gave a group of middle aged women ...\nMilligram ... than than they had them do a little exercise and these women experience that reduction in body weight and it was almost all fat which is fantastic now I don't want anybody to misunderstand here it's not a magic weight loss pill by any means but certainly the early research suggests\nThat this can be a useful tool in addition to exercise to help you to burn a little extra weight\nNashiri just a few moments left before we wrap up the program I Want to take a quick step back for a moment I Know we have this great free bottle offered today we're talking as to as a dirty products and we'll get to that offers we wrap up the program free bottle that the effects for all of our listeners\nAgain it promotes healthy vision skin muscle fights wrinkles like no other\nAnd most of us are just never heard about all of this until today so tell our listeners again how asked his abdomen compares to other antioxidants are quite a nutrients that are out there on the market right now because this is truly unique isn't it\nWell you know from an antioxidant perspective the healthy aging perspective after that that it's up to six thousand times more potent than vitamin C. and it ... oxygen clenching capacity\nThat should be enough to get everybody excited there's really you know something in this for everybody with I got back from purity here you get to see the amazing power faster than that for yourself it's that can get a crowd annoyed and very few people are aware of its benefits and I think millions are missing out on it because they just aren't aware of this\nIncredible evidence based nutri pseudo cough\nAnd I know it may sound too good to be true for some people Sherry what do you read any skeptics saying come on doesn't really do all of this\n[laughter] well I'm a pharmacist and in my training as a pharmacist I'm trained to look at the science and to see what the science says and the science on ice than than his\nClaire backed by over fix the clinical static and many of these studies are accessible I have not taken checking out yourself but the key takeaway is that the benefits are real cosmetic an attack the endurance and at that the strength and if that's the vision that\nCirculation cardio the product really work to find the so strong I see the difference in how it makes my skin knocking how I feel like a stronger healthier and I you know encourage folks to get the tri tri bottle offer from Kerry there's nothing in it and and so much to gain\nSuch great information wonderful show and always good to talk with you Sherry thank you so much for joining us today thank you\nJerry charcoal as soon as an author she's a practicing pharmacist or she's written more than a dozen books on health including the Canadian encyclopedia of natural medicine as we wrap up a program here is your final opportunity to take advantage\nOf this very special offer from purity purity products are leading provider of cutting edge nutritional supplements for more than twenty five years here's the deal works just be one of the first thousand callers today you call purity products it's toll free number I'll give you a moment\nOr you pay shipping and handling that's just six dollars Ninety five cents and that's it\nPurity will rush you you're free bottle of asked the FX for you to put to the test why don't because they know once you experienced the benefits of your free bottle of ... you'll want to become a satisfied customer it's that simple so give it a try put it to the test now call this toll free number one eight hundred\nFive hundred twelve Seventy one eight hundred five hundred twelve Seventy one eight hundred five hundred twelve Seventy doing to support your energy or stamina your circulation antioxidant defense I health cardio health joined function and so much more one eight hundred\nFive hundred twelve Seventy and by the way as a second free gift for you call right now and purity we'll toss in a free bottle of there'd be twelve energy melts plus by up to him for a natural burst of healthy energy that you can enjoy any time you need it\nAnd these free ... be twelve energy melts also promote healthy here as well and it's like a twenty dollar value for that in itself so you get that free as part of the special radio opera today from purity products again this double free bottle offer is not available in stores around lined only direct through today special radio offer line\nBy the way limit one free offer per household please just\nCall right now don't miss out one eight hundred\nFive hundred twelve Seventy claim your free bottle of asked the FX plus the beep twelve by up to an energy males\nThere's nothing to lose the call right now for your to free bottles the number to call one eight hundred five hundred twelve Seventy\nOkay so I Do think there is no ... are you there is no easy formula I'm a ... you really have to come in we put your numbers\nOn our software and the software will sort of dictate you know what would be the optimal strategy since we're there twenty thousand\nDollars last year only because I had a a tax credit some a solar insulation that I did two years before\nSchool yeah so you're really um you really in the captured see you're you're going to do real well with this tax plan\nSo buck such great to hear\nSome you know those who who used to the doctor a lot [noise] they're the ones that\nMight get hurt and you know we could certainly help you or any of our listeners\nWith whatever others anybody that question you have out there listening to this right now there would be great for them to learn this little tactics you know I've seen some tax or advantage\nYeah we can certainly help any of our listeners give us a call eight nine eight eight Josh okay thanks for the call next up we're on the phone line and learn about these Trump tax tactics\nNow uh to be clear nothing can be construed as a testimonial a of experience with an investment advisor uh so uh please don't construed that as such so we'd love to me if you go over the Trump tax plan\nA and help you with what ever financial question you have now's the time to call us we're going to go to the phone lines uh our last caller just said is important if you have a marital deduction and very little income otherwise you could convert about twenty four thousand\nFrom traditional IRAs to Ross and very little\nTax consequences so that's a fantastic\nStrategy now with anything we're not giving you tax advice and so you want to check through it with your accountant we will meet with your account and we're also we also have a rare window of opportunity for\nAccountants or accountants\nWho are listening on Wednesday we're offering free C. P. E. for accountants so called us now eight eight nine today Josh you if you want free CPA for accounts were now live on Facebook\nF. B. dot com slash the financial quarterback if you have questions on stocks bonds annuities mutual funds\nOn Iran mosques extreme micro management wasted time and money at\nTesla insiders say so they may be happy that he's stepping down now um\nWhat about a simple IRA simple I raise or one of those things that people are not always involved with simple I raise according to a germ rate T Rodriguez of irate help dot com or popular retirement vehicles for small business owners\nIf you're a small business owner we'd love to help you with tax savings strategies they're relatively cheap to adopt\nAnd they're easy to understand that the minister however that doesn't mean problems do not arise routinely we see issues involving in eligible plans sponsors miss contributions and late deposits all of which by the way you could be fined for\nIf you're thinking about adopting is simple irate if you're a small business\nIs essential that you understand the rules establishing the symbol IRA a simple you execute a written agreement with a custodian such as fidelity that's what we use that can either be a prototype plan\nForm fifty three or four days simple reform fifty three o five simple you could also use it individually designed planned that meets the tax code requirements but that is rare each eligible employees should receive a summary plan description that not only complies with the IRS rules but meets\nThe department of labor standards under\n... which stands for the employee retirement income Security Act now here's the thing we're seeing that a lot of people under the new tax codes who had a simple or looking at profit sharing we're seeing a lot of profit sharing relocate pensions were\nWere being able to give greater tax relief\nUnder this section one Ninety nine\nHey if you know what I'm Talking about great if you don't know what I'm Talking about you need to know what I'm Talking about and it's one of the things that we're going to be talking about at the C. P. E. workshop\nFor accountants where you get free CPB you got a call her office\nAt eight eight eight nine eight eight Josh also Facebook nation if you have a question comment right now and the video if you have a question any question at all we will try\nTo answer it so section one Ninety nine a so you want to design your retirement plan\nTo take advantage of the new rules so we're talking about simple IRAs now but there were going to move to a their retirement plans\nIn order to take advantage of the new tax law section one Ninety nine a of the new law allows taxpayers other than corporations a deduction of twenty percent\nOf cue beyond its qualified business income earned in a qualified trade or business subject to certain limitations qualified business income is the ordinary income from a qualified trade or business\nNet of ordinary deductions passed through from a sole proprietorship\nAn escort or a partnership\nIs it the doctrine is a twenty percent doctrine of your QB I\nOr qualified business income or the greater of fifty percent of Wu to wages with respect to the business\nTwenty five percent\nOf WG wages with respect to the business plus two and a half percent of the ... adjusted basis of all qualified property that if you own real estate qualified business income does not include guaranteed payments to partners\nAnd it does not include reasonable compensation to the taxpayer by any qualified trade or businesses the taxpayer for services rent with respect to the trader business\nNow qualified trade includes all trades and businesses except for those in specified service activities\nSuch as health law accounting financial services trading or dealing in securities commodities over the business\nIs principal asset is the reputation or skill of one or more owners are employees\nThat means celebrities you know it's a little confusing\nNow so if you have to be I qualified business income the QB deduction starts to be phased out for taxpayers with taxable income of greater\nThan three hundred and Fifteen grand if you're married filing jointly but there are ways you may go over that still qualify\nCall a city that eight nine to Josh and we'll show you how to do that how to qualify this provides a massive incentive\nFor you if you're a business owner if you're a doctor a dentist an accountant someone in these specified service businesses\nTo establish a qualified plan with the goal of getting under the income threshold\nSo if you get under three Fifteen it can be over by a dollar you get a twenty percent right off that sixty two thousand in that case to make a ... percent right uh eighty grand is what you're paying tax on then you have the standard deduction which has increased\nSo there are ways with Trump trust as well as the retirement plans to take advantage of the new law cause now call us now\nEight at eight nine ... Josh eight eight eight nine eight eight\nFive six seven for if you have questions on stocks bonds annuities mutual funds or this twenty percent pass through the action\nThirty seven percent plus eight so it's about forty five cents on every dollar so that would be or attack savings of almost Seventy thousand\nDollars\nBy setting up a retirement plan for your business so this is quite powerful so you could set up what's called the deep plan or a D.C point\nYou could set up a four one K. with profit sharing or a cash balanced plan\nMany people did the four o one K with profit sharing and now there are ... their plan designs which allow you to write off a whole lot more for example if you're forty the average four oh one Kay plus profit sharing contributions about fifty five grand\nCash balance you could put in eighty six thousand\nIf you're sixty five\nThe max you could put in a four oh one Kay plus profit sharing a sixty one thousand six you went as a write up that isn't chump change however if you have a defined benefit pension plan you could write up up to two hundred and forty for granted he says and powerful\nOr things that we're going to be talking about on Wednesday for C. P. A. is only who needs C. P. E. credits but if you're a business owner and you want to Cuba the Iowa review\nCall us now medical practices dentists law firms passed through entities looking to qualify for QB I\nIf you desire a greater right off than fifty five grand if you're under fifty sixty one grand if you're older than fifty\nIf you maybe you're an older owner maybe in your fifties or over you're going to be able to to duck a lot more on your taxes so call us now\nEight eight eight nine today Josh aided eight nine at eight\nSix seven four and we'll take your calls now this is Josh Joe Lenski the financial quarterback\nDon't touch that dial\nTax deferred vehicles such as four oh one k.'s and IRAs sound good upfront but did you realize that when you retire you'll have to pay taxes on on your earnings you can legally minimize your taxes when you withdraw retirement funds with tax free IRAs and other tax favorite accounts calls at ... advisory group now at\nEight eight eight nine eight eight Josh that's eight eight eight nine eight eight\nJosh to learn how you could enjoy a higher standard of living with these tax favorite accounts [noise] make sure you don't get blindsided by taxes on your retirement plans called Josh chilling ski the financial quarterback now for complimentary one hour consultation to empower your financial decisions\nLeave your checkbook at home they will not sell anything at this meeting but educated you on your many options in retirement in fact if you call right now for one of the complimentary no the tax fighting reviews they will give you a copy of the book tax free retirement as a free gift\nIf you call within the next three minutes called\nEight eight eight nine eight eight Josh that's eight eight eight nine eight eight Josh\nNow let's get back in the hospital with a financial quarterback [noise]\n... except for I send a judge wedding as being [noise]\nVisit and the laser show quarterback\nAnd we're back taking your calls if you're listening on Facebook at ... dot com slash the financial quarterback now is the time\nTo call us and this week will be another Long Island New York city king of Prussia Pennsylvania Princeton New Jersey I have one slot left in Princeton Monday called me now to date on today Josh also short hills Hackensack\nOr corporate headquarters in Tom's river New Jersey now is the time to time they were talking to be\nI give us a call ... eight eight eight nine eight eight Josh aided eight nine they Josh aided eight nine it eight\nFive six seven for coal is now eight eight nine today Josh with your question or comment so we're back to talking about the simple IRA the simple\nIs just as the names says it's simple\nAnd allow you to put her way up to twelve thousand five hundred\nPer year and get a write off\nWithout creating some of the more onerous tax reporting documentation of other plans\nSo if a four one K. with profit sharing is too much for you if a defined benefit cash balanced plan is do much for you you may want to look into a simple\nIRA so call us now if you need help doing that now there is an interesting article\nOn uh NFL teams in a high tax states risk a talent drain the limits on the federal deduction for state and local\nTaxes could put higher tax states at a ... a negotiation disadvantage with free agents if your favorite an F. L. team doesn't make it to the playoffs president Donald Trump\nMight be in part to blame according to Bloomberg\nTwenty Seventeen law could put teams in states with a high personal income tax rates now it's not the fault of our tax\nA high taxes in certain high tax regime states your favorite NFL team doesn't make it to the playoffs you could blame President Trump\nThe twenty Seventeen law could put teams in states with a high personal income tax rate\nAt a disadvantage when negotiating with free agents thanks to new limits on deductions including for state local taxes according to tax economist Matthias pet to train should make of the Vienna University of economics and business\nMr pet to ... research into team performance over more than two decades\nShows that NFL teams based in a high tax states last more games on average during the regular season compared to teams in low\nOr no tax states that's because of the NFL salary cap for teams according to Mr ... to ... I don't even know they say the guy's name\nThat's because of the NFL salary caps for teams the new tax law is exacerbate my findings and makes it harder for high tax teams to put together a high quality roster\nThe tax law limits the amount you conduct for state local taxes\nTo ten thousand dollars\nA pittance for professional athletes who live in states with a high property taxes but also limited the prize deduction for on reimbursed employee\nBusiness expenses which for football players means the union dues and fees for agents public relations business management or offseason trainers can't be written off\nA player for the Miami Dolphins in Houston Texans were no state income taxes are levied was always going to come out a whole lot better than somebody playing in New York said drone Lichtman a director at accounting firm Friedman who works with professional athletes\nNow it's worse\nStill Mr ... said the priority for many athletes is to go where they think they're going to win taxes may be a consideration they're rarely the deciding factors and some players Jews to set up official residences and lower no tax states so teams high state rate\nMay not be such a deterrent so maybe like a little brown is living in Florida for six months than a day and then for five months and you know he's going to LA that that would apply to NBA players as well as the NFL\nSome players choose to set up a visual residences in the no tax states professional athletes do have to consider so called jock taxes\nWhich are levees that are calculated based on how many days of player provides professional services such as playing a game or training in any other state that ministers and income tax players on the New York Giants' New York jets face the third highest tax rate from Nineteen Ninety four to twenty six team\nSeven point nine four percent players in California teams include the raiders the chargers and the forty niners were the highest average rate of love and point to eight maybe that's why they haven't won in a while\nNow high tax states teams\nOn average one about to fewer games than those in the low or no tax states\nDuring the regular season from Nineteen Ninety four to twenty sixteen so the cowboys jaguars dolphins Texans favor better than the jets raiders chargers forty niners and giants over so many years according to the Vienna University", "show_name": "The Bernie and Sid Show", "year": "2018", "city": "New York", "day": "21"}