{"month": "10", "state": "TX", "station": "KTDH", "content": "A CPR takes the time to inform you on the candidates and the issues H. B. PR brings you information you need to come to your own conclusions news coverage of this intensity takes resources\nDecisions you will take with you to your polling place HP PR takes the time to inform you on the candidates and the issues H. B. PR brings you information you need to come to your own conclusions news coverage of this intensity takes resources your membership contribution has never been more important\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nThe availability of H. P. P. R. as Web stream is due to the long term financial support of individuals' all across the country you can do your part to keep the service going by becoming a new member today at H. P. P. R. dot org\n\nFrom NPR News in Washington DC this weekend\nI'm Scott Simon Saudi Arabia now says your mouth showed that died and they're calling\nParents with more than a dozen shouting age\nWhat has the latest and ask a former U.S ambassador how the u._s. should respond [noise]\nAlso the anniversary of a new way to flop in an Olympic event [noise]\nFairy tale by a scientist can hope people will listen and what was meant he lives in Maryland [noise]\nMy sister in law and beautiful and bright she loves to sustain [noise] since spirited great sense of humor she left her son so much\nShe died at the age of thirty her story this hour\nFirst our newscasters Saturday October twenty two thousand Eighteen [noise]\n\nLive from NPR News in Washington on trial Snyder President Trump says he finds Saudi Arabia's explanation of what happened to the dissident journalist ... G credible after denying any knowledge of what happened Saudi officials now say ... was killed in a fistfight\nNPR's Tamara Keith reports on the president's reaction\nPresident Trump said that Saudi announcement about ... death and the arrest of Eighteenth suspects was a good first step Trump also praised the kingdom for moving faster than he expected\nThey have been our ally we've had great relationships with them this is a horrible of it\nAh it has not gone unnoticed\nAs for what to do about it Trump said he would work with Congress one of his allies in Congress Republican Senator Lindsey Graham sketched out they're shifting narratives offered by Saudi Arabia and said it's hard to find this latest explanation credible camera Keith NPR News\nThe Trump spoke to reporters in Arizona where he held another rally last night returning to immigration is a campaign issue ahead of November's midterm elections he's got another rallies scheduled in El ... Nevada today before returning to the White House\nThe presidents of Guatemala and Honduras are due to meet today to discuss some migrant caravan heading toward the U.S James Frederick reports from Mexico the caravan has not turned back the spy clashes with Mexican police on a bridge that separates Mexico and Guatemala\nTo bridge connecting Guatemala and Mexico is now a makeshift refugee camp\nIs night fell in rain came pouring down most of the thousands of migrants in the caravan stayed on the bridge while some returned to bought a mall in search of water food and medical attention\nNext steps for the caravan are unclear but authorities say they will continue to gradually allow people across the border as long as there requesting asylum in Mexico for NPR News I'm James Frederick intellectual in Mexico\nAfghans heading to the polling stations\nIs there requesting asylum in Mexico for NPR News I'm James Frederick in temperature little Mexico\nAfghans heading to the polling stations today to cast votes in the first parliamentary elections to be held in eight years are voting in defiance of the Taliban and ISIS which of attack candidates and the election rallies and they threatened to violently disrupt today's voting is NPR's to hit the reports from Muslim about\nIt was one of the most brazen Taliban attacks and if he has long conflict\nWhen he got gunned down his boss the police chase the attack a country in a high level meeting in Kandahar it was also attended by the top us commander in Afghanistan\nThe meeting lots to discuss security plans for parliamentary elections expected this Saturday following the attack Afghan officials announced voting would be delayed in Kandahar by one week\nThat delight seen as necessary until security can be showing up in Kandahar it also reflects the uncertainty around these elections which have already been beset by deadly militant attacks and controversy ... date NPR News Islamabad\nFrom Washington this is NPR News billions of people will wake up disappointed the mornings a winning numbers for the mega millions lottery hip and announce and nobody won the jackpot NPRs Amy held has more\nBut I remember the sixty five fifty three twenty three Fifteen Seventeen the goal make about seven that's\nMaking millions lottery host Jon crow announcing the winning number it's which no one picked according to lottery officials\nBut don't check your ticket just yet partial matches are still worth up to a million dollars but with no big winner the prize rolls over once again\nAnd now stands at an estimated one point six billion dollars yes that's billion with a B that would make it the biggest us lottery when ever the drying scheduled for eleven pm eastern on Tuesday so people in the forty four states as well as Washington D. C. and the U.S Virgin Islands where mega millions is played\nHave a few more days to dream Amy held NPR News\nAnd major league baseball the best of seven series for the national league pennant is going to the limit the Milwaukee Brewers forests tonight's decide or with a seven to two victory over the Los Angeles Dodgers last night the winner of tonight's game\nWill move on to the world series against the American league champion Boston Red Sox and unmanned spacecraft has begun to seven year journey to mercury was successfully launched last night from Europe's space for infringing on\nThe mission is a joint one between the European and Japanese space agencies and if successful\nWould only be the third study mercury up close on trial ... and this is NPR News from Washington\nSupport for NPR comes from NPR stations\nOther contributors include CIA CIA is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at CIA dot org\nSupport comes from the ... museum of natural history in haste candid with life size animated dinosaurs and other prehistoric beast that roamed the land long ago more at stern Berg dot F H. S. U. dot\nEdu October\nMarks the beginning of H. P. P. I. this school year end the phone membership campaign you can play your part and keeping that service available in our region by becoming a new member gain knowledge go community gets today at H. P. P. R. dot org\n[noise]\nEDITION from NPR News I'm Scott Simon Saudi Arabia now says your mouth shut\nThis weekend edition from NPR News I'm Scott Simon Saudi Arabia now says ... which killed at the Saudi conflict new stumbling October second that should mission comes after two weeks of denials Saudi agents killed him after some kind of altercation broke out according to the official count\nEighteen people have been arrested in the case then crown prince Mohammed bin ... mom purged two of his advisors or which I had to be linked to the operation\nPresident Trump called the Saudis statement credible a good first step but key members of Congress from both sides of the aisle question the Saudi account which is at odds with the Turkish explanation that says\nThere was a Saturday hit team with a bone saw and a plan to kill ... with us this morning as NPR's Deborah Amos has covered Saudi Arabia for years Debra thanks so much for being with us the money you have seen the shouting statement\nWhat does it tell you about how the kingdom mishandling crush\nWhat we see is that for the first time officially the Saudis say that Jamal ... is dead the account places blame on senior advisors none of them ... ... for a policy that's gone terribly wrong the Saudis now admit that there's a standing order to bring dissidents back to the kingdom by force if necessary but\nThe account leads the blame on the senior security official to went beyond the order they killed ... journalists they covered up the murder why did the Saudi leadership failed to confirm his death earlier\nBad news traveled slowly to the top it's out one Saturday defender put it on Twitter these latest accounts distance the top leadership and especially the powerful crown prince but there are so many questions\nTo be answered\nOne of the biggest right in front of his whereas Mr ...\nIndeed so the Saudi account says that his body was handed over to a local Turk for disposal\nTurkish authorities I have been continuing this investigation and now it's in a forest near the you know the consulate so the official account doesn't explain why uh Fifteen man team what sent Istanbul or why\nA sixty year old Jim ... show gee would start a brawl with this large group most of them were half of his age you know do the names in the ages of the squad has been documented by the New York times and the Washington Post\nAnd the Turks leak those names\nIn the run up to the official account which was made public on Saudi TV early this morning there's been this online army of Saudi social media box\nAfter denying knowledge of what happened Saudi Arabia now says he died at a Fitz fights and the country's conflict in Istanbul but provided no evidence to support it's kind of what happened\nThe president meanwhile has another campaign rally on his schedule ahead of November's midterm elections around like it's being healthy and they'll go Nevada\nAnd the mega millions lottery jackpot climbing again after no winning ticket was sold for last night's drawing the lottery is now expected to reach her record breaking one point six billion dollars for Tuesday's drawing\nOn trial Snyder NPR News from Washington\n\n\nSupport for NPR comes from the station and from Amazon Prime video with the Romanoff a new theories from the creator of Mad Men starring John Slattery Amanda Pete Paul rider and Kathryn ... on a new episode every Friday on prime video\nFrom the three I O T towering enterprise digital transformation with artificial intelligence predictive analytics and diabetes solutions learn more it see three I O T dot AI and from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon the Trump Administration has had a muted response so far to the death of Jamal crucial gee we turn now to even adult or he was US ambassador to NATO under President Obama and now head of the Chicago Council\nOn global affairs his new book co authored with James Lindsey is the empty thrown America's abdication of global leadership is Rebecca thanks so much for being with us to be here based on all of your experience just to show the explanation of how Mr ... died ring true to you\nKnow I think uh this sounds like a damaged limitation exercise rather than the kind of complete thorough and transparent investigation or that or was promised to secretary of state or a ... tale when he visited Riyadh earlier this week and I think one of the questions to be asked is\nThe quick acceptance of the Saturday\nA explanation by the president [noise]\nThink one of the questions to be asked is the quick acceptance of the Saudi\nOr explanation by the president or how much of this damage limiting exercise was directed in Riyadh and how much in Washington because it seems to me like both Washington and we were trying to figure out a way to get out of the situation ah as quickly as possible and resume business as usual\nBut we can't have business as usual with a country that murders its own citizens in uh in foreign countries\nHow the U.S response let let me Ventura possibility cancelled that a hundred and ten billion dollar weapons contract\nWhile at the very least I think it will be a writer for the United states to work with its allies are first of all to get a condemnation of the Saudi behavior in the U.N Security council secondly to work with our allies particularly the Brits and the French who do supply weapons as well to the to the Saudis to\nSuspend arms deliveries or at least for the moment until we have a a a better sense of what's going on I think it's time high time that the United states work together with our allies or to put pressure on the Saudis to end\nThe indiscriminate bombing in Yemen which by the way is being conducted with weapons that we continue to sell to them or so there is a lot of leverage that we have if we work with our friends and allies around the world to pressure to set the Saudis to change behavior\nMain argument of your book is is that the U.S has stepped away from the role of moral leadership in the world but as President Trump just being realistic because a lot of people on the left as well as the right to say that America has created a lot of problems by trying to put our moral grid an forums society's\nWell yes the exports of a democracy to foreign countries on to\nA point of a value and that is not the most effective way to do it but there's many other ways in which you can exercise moral leadership first of all by standing up against countries\nThat are treating their citizens in in ... manners and yet this administration and particularly this president seems to be more inclined to accept the Saudi explanation of how a a journalist is killed in in Turkey that Mr Putin's denial of it now election interference\nIn our own elections are and then then the intelligence community is a judgment on those kinds of issues and one would hope that a president of the leader of the three world\nWill be willing to go out publicly and make clear that how countries behave towards their citizens is one of the most important factors in how we decide we deal with them it is not the only factor we have other interests\nAnd we want to maintain those interests but at the very least in in the rhetoric that we are a um a using in our the Foreign Relations we need to hold up the moral value of human rights of democracy and freedom\nSo thirty seconds we have left a it's not just expressing outrage they're very practical steps that can be taken\nYeah I think there are a used to be that the United states would lead to an international coalition to work\nTogether to put sanctions on on the country or in this case I think suspending arm shipments a that would have real leverage over the Saudis the president keeps on talking about the leverage that the Saudis seem to have over us we're at twenty trillion dollar economy surely we can find ways to put pressure on the Saudis that do not\nHurt our economy and that make clear that the kind of behavior we've seen coffee weeks is unacceptable uber gold or thank you thank you\nSo during for profit is a new you probably remember Hector mercenaries from grade school lessons on America's Revolutionary War that American mercenaries working for foreign powers that something that they were ... been looking into his investigative reporter for buzzfeed news and joins us in our studios\nWorking for foreign powers that something that Arab ... been looking into ... an investigative reporter for buzzfeed news and joins us in our studios thanks so much for being with us thank you wire us retired special forces which is what you're talking about in your investigation and such demand\nFor the last Seventeen years\nSeals special forces and other parts of the U.S government have excelled\nAt this modern style of warfare at uh the sort of counter terrorism specialty they kick indoors they go in and they kill or capture and they've been doing it at a pace that's unprecedented yeah\nYou're right in the article that said the number of us special forces has doubled to nearly Seventy thousand now that reflects show of changing the way a lot of wars conducted around the world doesn't it\nThat's right a military targets are used to be thought of as you know air fields um bridges barracks those have been replaced by just the targets are people and we don't often like to use the word assassination button that is what it is\nMhm but your investigation uncovered people we would have to call mercenaries\nI see no there's not many other names for them at the N. word it definitely works in this case they were former soldiers hired to do military operations combat targeted killings for the military of a foreign power\nYou open your story for buzzfeed or by talking about the war in Yemen the proxy war being fought there what happened in Aden and twenty fifty\nThese special forces or an unsealed veterans Navy SEAL veterans' day deployed on a mission to kill the leader of the aid and branch of al Islam\nAnd all this law is that right is very important political party in Yemen to this llamas party but it's not viewed in the wider world as a terrorist group unless the UAE e as we writes hired this company to kill this local political leader the\nLA and Saudi Arabia are leading the war in in Yemen against rebels in Yemen and they have us support now you you should just in the story that somebody in this group was a member of the active military\nReservists he was a reservist and he was a seal reservist he he was at that level of of command of one of the nation's best most highly trained and he was still you know technically yet is it a top secret clearance sources told us even when he was doing this very strange unique unprecedented mission as far as we know [noise]\nI guess I'm among those Americans who who just assumed that that had to be illegal Jewish citizens couldn't do that there are laws that do governor whether the U.S whether us individuals can service officers can enlist in foreign militaries but it's unclear if there ever enforced and what the penalties really are because of various Supreme Court decisions\nYou've seen how Americans have served in the French ah well I've I've mentioned French foreign legion in the article the Israeli defense forces\nAnd these are numbers on lots of a lot of Americans enlisted in the British Army during world ... sure right yeah\nAnd these are not you wouldn't call them mercenaries but I I don't know that there's a distinction if you if you then join a foreign military just for the money now and and by the way this doesn't apply to people who join ISIS or the Taliban or somebody who fights against the u._s. or or a U.S ally that really is against the law that is ... ... this is a buzzfeed\nStory not an NPR story hasn't been reflected in our reporting we can't vouch for it [noise] um is this an anecdote or a trend\nIs this an anomaly it's the real key I Believe this is a potentially a trend here are the only ones who've done this or the other countries will try it [noise] um are there other Americans have been the ones who enter other Americans you'll leave you've uncovered yet right is this happening in\nAre there other countries who try it [noise] um are there other Americans of new ones and our other Americans believe you've uncovered yet right is this happening in in theaters around the world I'm going to keep on looking at it\nI've had the honor of interviewing several X. special forces over the years who are working a secret service agents or running for office why would they want to continue to risk their lives and do this kind of work\nI'm Christian Bailey host of life from here [noise] you know they say this country has more divided than ever but there's one thing we can all agree on other people just a little bit mentally I Hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together during the Saturday for a live\nBroadcast from a Fitzgerald Theater in Saint Paul Minnesota with an again for saw the war in treaty Mr Gabriel ... Saturday evening at five central [noise]\nThis is Jenny ... music director at high plains public radio thanks do you remember listeners just shouldn't rocks enrolls an swings and it's kind of you keep the music going give now at H. P. P. R. dot org\nThe station rocks and rolls and swings and it's because of you keep the music going give now at H. P. P. R. dot org\nI'm oil Snyder with these headlines\nOfficials in Afghanistan say voting in today's parliamentary election will now be extended until tomorrow for polling stations that have not been able to open borders have been turning out though despite threats for the Taliban and Kandahar voting has been delayed a week following Thursday's killing other provincial police chief\nThe president about a model and Honduras are due to me today to discuss some migrants caravan heading toward the U.S hundreds camped overnight on a bridge separating Guatemala and Mexico yesterday there were clashes with police on the Mexican side of the bridge\nAnd in northern India officials have declared a state of mourning today after yesterday's train accident at least fifty million people are dead dozens injured when the train ran into a crowd gathered on the tracks during a festival\nOn trial Snyder NPR News from Washington [noise]\n\n\nSupport for NPR comes from the station and from logged me in makers have go to meeting a collaboration meeting platform allowing people to connect around the globe to get work done learned more it go to meeting dot com\nFrom transfer wise a service that helps people send money internationally three million people and businesses use transfer wise to send to receive and convert currencies and more than Seventy countries more at transfer wise dot com or from their app\nAnd from listeners like you who donate to this NPR station\nThis weekend edition from NPR News I'm Scott Simon\nWe've learned over the past few years of the opioid crisis that the face of addiction can be just about any face an obituary that appeared in the Vermont weekly seven days touch many readers this week\nIt included a photo of a smiling face of metal Lynch in there with her toddler son aid and it was grunting from his perch on her back\nThat photo showed a good day for money but she suffered from addiction since she was sixteen years old and production ... high school party\nA drug took hold of her life she was in and out of rehab and lost custody of her son\nMetal and limbs to near died on October seventh she which Thirty years of age her sister Kato Neal wrote that obituary and joins us now from Vermont Public radio in Burlington thanks so much for being with us thanks for having me\nFirst we're we're sorry thank you what can you tell us about your sister\nMy sister was beautiful and bright she loved to sing I she wanted to be an actress and starring Broadway musical and she really had\nThe voice and I'm later on when she became addicted to drugs and it was this real seesaw where we would see and be with the Matty we knew in lived and then there was that a Matty who suffer from the disease and who went to really dark places but\nWhen she was clean she was just such a pleasure to be with spirited great sense of humor she left her son so much\nI don't expect the real answer to this but what happened\nWe had a long time to run it through our minds you know I I I think when she was a teenager she was experimenting with drugs is a I think a lot of teenagers do is I did\nShe tried an oxycontin which is a highly addictive opiate painkiller I don't think she knew that when she took it she really loved the way it made her feel and she continued to take opiates on into force\nThey've opiate based painkiller I don't think she knew that when she took it she really love the way it made her feel and she continued to take opiates I'm In pill form and within a couple of years she started using injecting heroine\nShe tried so many times to get sober and when she was clean I think she was full of hope we were always full of hope for Maddie this past summer just a month before she died she was home and we think mostly clean for twelve days and that was just an incredible high we all\nWe're hopeful she was going to go into a program and get some help and you know and then is often the case with addicts it didn't work out and she sort of um disappeared again\nDrove more than one program I gathered yeah she tried many [noise] what made you sure all of this in Europe which were\nYou know it never really occurred to me not to share ... addiction and that part of her life it was so central to who she was as an adult her addiction didn't define her but it did define the way she lift\nAnd certain not include that would not have been an accurate honoring of who she was and we also wanted to\nExtend the hope that we had from ... to people who continue to suffer who are addicted and now I'm we carried out for them and our hope also now lives with\nPolicymakers and politicians and the people who can make the change necessary so that these deaths stop happening the president's daughter treated her obituary so let's put our money where our tweets are you know\nWhat you think or what do you hope would make a difference\nThere are solutions you know medication assisted treatment things like methadone or be pronouncing there's evidence that they work but they're very hard for addicts to get right any doctor in this country can write a prescription for a highly addictive opiate based pain killer\nBut to prescribe some of the medications that help addicts recover they need to go through an eight hour training they need to get a special waiver\nThere aren't very many of them so it's hard for people suffering from addiction to get those medications that have been proven to help and that's just one thing I also think that stigma and shame or a huge barrier\nTo recovery for people in that part of the reason that\nWe wrote about it we didn't expect anyone beyond our community to read it but we wrote about it because we think it needs to be talked about fifty thousand people died last year from opioid related overdoses\nI Want people to know that ... one phase of that but so many people with addiction don't resemble the photo that you talked about Matty with her son and her back in a backpack on her back Matty didn't resemble that photo\nWhen she was in the throes of her youth and so I just want us all to have empathy for people who are suffering from what is a disease\n[noise] understand there's going to be a service for ... some day there is yeah or were you and your family celebrate her life\nThrough song of course there'll be performances and we actually have a [noise] a video of ... singing a Bonnie rate songs is just sitting in the kitchen tables will play share that with people and then you know one of the things that's been so wonderful about this obituaries that people have shared stories about Matty that we didn't know they also shared stories about their own\nAddiction and recovery and family members and that's been a huge source of support and solidarity for our family right now and I think we'll have more of that kind of sharing on Sunday\nAlready for our family right now and I think we'll have more is that kind of sharing on Sunday what Bonnie rich on man [noise] I Can't make you left me\nA indeed fun now a\n... wrote about her sister Maddy Lynch in there and the Vermont with seven days thank you so much for being who you want to thank you so much for having\nMe\nIf you know\nI Know and then uh [noise]\nWhat\nHelen Franklin is post forty or an English exiled who's had a pretty humdrum time for Twenty years or so she's been in the cosmopolitan city of Prague she translate sparkling pros or the instructions for washing machines\nSarah Perry rush in her new novel melanoma Helen has an Arab sadness to shore usher cannot get shot [noise]\nCarol a scholar friend gives Helen a pile of checks histories diaries letters footnotes\nAnd she begins to find them those pages the outlines of a woman reaches across the country from seventeenth century England Germany the Nineteen forties a modern day manila to witness it absorbs the horror of the forgotten men for lord knows\nSarah Perry author of the international best show her the ethics or put towards us now from New York Thanks so much for being with us thank you for having me sketch Mel must enforce could you please\n[noise] so the premise of the novel is that it's very lonely women begin to hear that there is a creature called ... most of the witness\nNot only press visit the mountain states this week along with Jill so viewers\nThis is Natalie ... joined me this week in life performance on mountains\n\n[noise] this is Ninety One point five ... eighty nine point three Katie da da Silva supply planes public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support look under the support jab at H. P. P. R. dot org for details\n\nNPR News in Washington DC this weekend\nScott Simon this hour the latest on your mouth\nTo rabies says he died in fighting the only surrounded by Fifteen Saudi security [noise] and later do Republicans don't sound like Democrats and\nGlenn Close suddenly and the mother of a famous murder of\nDr Harry an average of\nOperation on an infant where she had to wait the risk of disease\nIs getting really convenient I can do today said and we were at the point where you can why would you rather die\nPut it in with HIV per STAR News caster ... over twenty two thousand they change [noise]\n\nLive from NPR News Washington on trial Snyder Turkish media say the investigation into the disappearance of journalists ... at the Saudi conflict is ongoing\nAnd rejects the claim from Riyadh that the case was under Saudi jurisdiction Saudis now acknowledging the death of course she claimed it was accidental as NPR's Peter Kenyon reports\nAn article in the pro government daily so bond newspapers dates that claim by crown prince Mohammed bin Salman of Saudi jurisdiction over the kingdom's consulate in Istanbul is wrong and that under the Vienna Convention of Nineteen sixty three the host country retains jurisdiction\nAfter more than two weeks of denial the Saudis acknowledge ... death thing it occurred after a fight broke out Eighteen people were arrested\nThe new Saudis story drew immediate criticism of social media with critics born into a forensics expert brought into its tumbled the data showed you disappeared as evidence of pre meditation Peter Kenyon NPR News ...\nAfghans casting votes in the first parliamentary elections to be held in eight years are voting in defiance of the Taliban and ISIS which have attacked candidate Sandy election rallies and they threatened to disrupt today's voting as it appears to deep reports from Islam about that\nISIS which have attacked candidate Sandy election rallies and they threatened to disrupt today's voting it impairs the deed reports from Islam about\nThe police chief for the fascinated by his Buddy Guy in a brazen Taliban attack in a ... a high level meeting in Kandahar city it's got security plant a parliamentary elections expected the Saturday\nNow voting will be delayed in Kandahar by one week it tries even more uncertainty around the elections which have already been beset by deadly militant attacks and controversy\nOfficials in Afghanistan said today are voting in the parliamentary election will now be extended until tomorrow for polling stations that have not been able to open in Kandahar voting has been delayed a week following Thursday's killing of the provincial police chief\nThe organization of American states has held a special session to discuss Nicaragua's six month long political crisis as Maria Martin reports\nThe Oh yes permanent council working group on the guy that was issued their second report to the hemisphere body friday\nThe group formed in August and made up of twelve member states condemn what they called continuing repressive actions by the government of the ... they got\nAnd its efforts to ban group members from traveling to the country meanwhile in its report Amnesty International condemned abuses by the government citing the use of paramilitary groups\nAnd military weapons to suppress protesters and even possible extrajudicial killings and the crisis which human rights groups they had said to over three hundred death\nFor NPR News I'm ... and\nPresident Trump is returning to immigration is a campaign issue admitted standoff between Mexican police in a caravan of about three thousand Central American migrants trying to reach the U.S Trump brought up the issue during a campaign rally in Arizona last night Scott another rallies scheduled for today and they'll go Nevada\nAnd you're listening to NPR News\nProtesters are packing the streets of central London today calling for a second vote on whether to leave the European Union organizers say they expect today's demonstration to be the biggest of its guy and the British public voted to leave the ... by a narrow margin in twenty sixteen the prime minister Theresa May\nIs ruled out holding another public vote\nAustralia's ruling coalition has been forced into a minority government after the liberal party lost its one seat majority today in a bi election to fill the seat of the former prime minister Malcolm Turnbull\nThe BBC's Phil Mercer reports the loss was not unexpected\nThe defeat of the governing liberal party candidate is an active retribution by Sidney votes is furious at the way that former MP Malcolm temple was ousted as prime minister\nFor the first time ever that seat of went was isn't taking conservative hands it will be represented by Karen Phelps a local don't to an prominent gay rights campaign or\nA victory strips the center right government of its narrow parliamentary majority it will probably survive and now with the support of independence and pays botch with an election June ... may it's long term prospects appear grim the\nBBC's film Mercer reporting there from Sydney on Australian politics the mega millions lottery jackpot climbing again after no winning ticket was sold for last night's drawing the lottery says it's now expected to reach a record breaking one point six billion dollars for Tuesday's drawing on trial Snyder\nNPR News\nFor NPR comes from NPR's fashions other contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of pilots\nOthers include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future available where books are sold\nSupport comes from Keller Leopold insurance and independent agency providing coverage for home auto crop in business with offices throughout western Kansas Keller Leopold dot com\nH. P. P. R. is a community resource that delivers media that matters and is made possible by listener contributions from HP PR you gain knowledge and grow community so please kids today at age ...\n[noise]\nThe weekend EDITION from NPR News I'm Scott Simon and get them ... G the aftermath of a devastating hurricane charges over alleged Russian interference in mid term elections so many urgent issues but President Trump's priorities often reflect his interest is senior editor and correspondent\nNPR's Ron Elving can tell us Ron thanks so much for being with us\nGood to be with you Scott let's begin of course with the president's reaction to the Saudi explanation as it stands now it's been in several different places for the past couple of weeks for the death of ... or the president calls it credible lobster and Congress don't\nThe Saudis say he was killed in a fist fight with Fifteen men\nAny child in any school yard in the world could see through that story Scott but it wasn't concocted to be believed any more than the earlier versions of the story the Saudis have now abandoned\nIts intended simply to be told and accepted as a pretext for continuing business as usual\nAnd that's less about oil these days and it's about billions of dollars in arms sales\nPresident Trump made that clear this week I'll even seeded with executives from a number of us arms makers who are selling those weapons to Saudi Arabia the president has made it clear this journalist was not a U.S citizen and that this is not the president's focus right now what is focused\nThe president made that clear this week by spelling out is gender like a shopping list he said this election this fall is about cabinet and the care of and law and order and common sense\nAnd a president of another Republicans have been treating Brett Kavanaugh as a martyr even though he was in fact confirmed and is in fact on the Supreme Court now\nThe caravan is that group of several thousand refugees from Central America who have been stopped at the border of Guatemala and Mexico far from the United states but they wanted to be coming to the United states so the president is using them to symbolize the immigration he wants to stop\nAs for law and order that's the phrase is older states rights and of course we all want the rule of law applied equally to all but the phrase has also been used\nAs code for resistance to social change and common sense is another familiar phrase a recently used as a political casual by the Tea Party\nAs you mentioned round the care of and it's been a feature of the the rallies that President Trump has been addressing but\nHe's also threatened to withhold from foreign aid over it has me\nYes the stopping the caravan and the threat of withheld assistance it substituting right now for the border wall which the president has made the symbol of his immigration policy and much more and which so far he has not been able to build\nPresident Trump is returning to immigration is a campaign issue amid a standoff between Mexican police in a caravan of about three thousand Central American migrants\nPresident Trump brought up the issue during a campaign rally in Arizona last night he's got another rallies scheduled for today and they'll go Nevada and their major league baseball the national league championship will be decided tonight in Milwaukee the brewers have tied the series of three games a peace with a seven to two victory over the Los Angeles Dodgers last night [noise]\nUm ... NPR News from Washington\n\nSupport for NPR comes from the station and from ... the foundation of donor advised funds working to maximize the impact of charitable giving and to create customize philanthropic solution learn more it after Jaycee dot org\nFrom Subaru featuring the all new three row is sent with feeding for up to eight and a choice of second row captain's chairs love it's what makes us Subaru it's super will learn more Subaru dot com and from listeners like you who donate to this NPR station\n\nThis weekend edition from NPR News I'm Scott Simon Saudi Arabia\nIt's NPR station\nThis weekend edition from NPR News I'm Scott Simon\nSaudi Arabia has confirmed that your mouth ... G. God well visiting the Saudi conflict in Turkey on October second\nAfter weeks of denials they say some kind of fight broke out shortly after Mr ... who lived in Virginia and wrote columns for the Washington Post arrived at the embassy that day to complete paperwork for his marriage\nPresident Trump reacted yesterday and called it a very sad thing\nHe did not criticized the Saudis and beer down ... was with the president on the campaign twin out west and joins us now Don thanks for being with us my pleasure and let's begin with the president's first comments or after Saturday's the Saudis announced a confirmed\nThe obvious that Mr ... had died or in their custody he ... at the at the embassy and I stumbled\nThe president was asked about it will turn an air force base\nWell I think it's a good first step is a big step to a lot of people a lot of people involved and I think it's a great first step\n[noise] um a lot of people in Trump's referring to the Eighteen arrested related to uh to the fight that the Saudis say resulted in ... what else did you say on the topic\nWell he he took questions from reporters at a roundtable with defense industry officials at that base he called cause showed used at the unacceptable\nBut also right away scot he pivoted to the contracts the Saudis have with U.S companies like Boeing and General Dynamics and and as Trump spoke seated around the table with him were CEO's from some of those companies the president says there are Saudi contracts for arms and equipment\nWorth a hundred and ten billion dollars he said he'd be working with Congress to see what the US should do in response bought\nBut I Would prefer that we don't use as retribution a cancelling a hundred and ten billion dollars worth of work which means six hundred thousand just\nIt's got just briefly the president uses those numbers often the dollar amount is exaggerated according to fact checks or as the number of jobs and we'll say the real number would be just a small fraction of that\nDid the president doesn't say anything ah really about the Saudi explanation that your mouth shut J died in some kind of fight\nHe was asked if he found that explanation credible he said he did he called Saudi Arabia a great ally all of this is interesting uh give given up quickly in the ... the has leveled very blunt criticism of other us allies are closer allies Canada Germany over trade and the like uh not sell with the Saudi now\nAll of this comes up its president is campaigning for Republicans in a number of Senate races that are considered too close to call in Montana Arizona he'll be in Nevada later today what does the president talk about how does he presented argument at his rallies he\nIs really trying to get the a C is hardest core supporters to make sure they turn out so he's talking about still the battle to confirm justice Brett Kavanaugh you now called Democrats who protested cabinet Kavanaugh an unhinged\nAngry mob and I can tell you the rally crowds love that language or any talks about the that that caravan that large group of refugees mostly from Honduras at currently heading north toward the U.S border\nAnd lots of TV coverage of it and the president clearly sees it as a political gift just before the election this is from his rally in Arizona last night\nDemocratic victory in November would be a bright flashing invitation every trafficker smuggler drug dealer and the illegal alien on the planet come on and come on and ah\nThat's the vibe at these rallies in in Trump's orbit even on a day when the news is about\nThe illegal alien on the planet come on and come on and so that's the vibe at these rallies in in Trump's orbit even on a day when the news is about the confirmation of the death of your mouth\n... and here's John ... thanks very much for being with us thank you Scott [noise]\nWhile President Trump says he wants more information before deciding how to respond to the Saudi explanation of ... death\nSome members of the U.S Congress has called for sanctions on Saudi Arabia the Trump Administration has appeared reluctant to do anything that could jeopardize its close ties with the kingdom NPR's Scott Horsley reports\nIt took the Saudis two and a half weeks to craft their account of ... death and throughout that period the Trump Administration bent over backwards to give the Saudis space this week secretary of state Mike Pompeo paid what was on its face at least a friendly visit to Riyadh for talks with both the king and crown prince\n... reporters on his return to the U. S. the Saudis are too important a partner to dismiss the relationship overnight\nWherever long strategic relationship with the kingdom of Saudi Arabia\n... is right about that for decades us presidents from both parties have felt the need to do business with the salaries but while some did so quietly even at times reluctantly endless stand resident of the Fletcher School says President Trump has been eager to showcase his Saudi ties\nTrump has no artifice about him so he's quite a bit about this sort of transactional relationship in a way that other presidents might have been somewhat more embarrassed or inhibit it to speak about\nAll this week when the president was asked about the show ... case he emphasized Saudi Arabia Israel not only as an ally but as a customer\nWhat I went there they committed to purchase four hundred and fifty million dollars worth of things and a hundred and ten million dollars worth of military [noise] those are the biggest orders in the history of this country\nTrump exaggerate those dollar figures but the Saudis are big spenders especially in the United states the kingdom as pledged forty five billion dollars to help bankroll tech companies like ... and looted motors Saudi money also flows through American universities such as Harvard in Georgetown and foreign policy think tanks here in Washington\nEven before the Saudis acknowledged ... death some recipients were trying to distance themselves from the kingdom's money but it's not easy says Rachel Bronson author of the book sicker than oil America's uneasy partnership with Saudi Arabia\nThey invest in long term goals they invest in real estate they've been lately investing in a lot of our high tech companies they're investing in institutions and art museum they have a lot of money to spread around\nFor decades Bronson says both us and the Saudis encourage those commercials ties as a kind of mutual insurance policy to keep both oil and defense dollars flowing\nDuring the Cold War the two countries teamed up against the Soviet Union and more recently they've partnered to fight terrorism although the Saudi record on that front is mixed former President Obama took a step back from the Saudis as part of his diplomatic overture to Iran but Bronson says Trump has embraced the kingdom more tightly whenever\nThe station has put all of their ... and they have been very very public about that\nTrump has sided with Saudi Arabia and its regional fight with cutter and encourage the very public romance between his son in law Jared Kushner and the Saudi crown prince Mohammed bin selmont as the president said yesterday before the Saudis acknowledged ... death that makes it tough for Trump to crack down now\nSay maybe as many as ... as well this is so\nBronson said Saudi Arabia was already backsliding on it\nThat's why this is so\nSad but Bronson says Saudi Arabia was already backsliding on its pledges of modernization which is part of what made ... so critical\nWhich I'm On the show he represented for many of the flies this belief in managed change in Saudi Arabia which is very slow he can be patient and he he expected to be patient about when he didn't expect with their reversal that he was seeing with the hunted in some on\nTrump says he will listen to congressional calls for sanctions against the Saudis and that he wants to work with lawmakers even as the president stresses he wants to preserve those multi billion dollar arm sales Scott Horsley NPR News Washington\nThe state of Nebraska is becoming a new ad campaign to encourage tourism or at least not disappoint those who do come to visit one ad shows that happy half dozen people floating downstream in an empty livestock tank that's apparently a Nebraska cruise ship with the headline lucky for you there's nothing to do here\nJohn directs the state's tourism director says their ad campaign had to strike a different note because not a lot of people say they think visiting Nebraska he says I call bunk on that\n[noise]\nGrowing on the high plains of the production of high plains public radio it's written and narrated by skipped man the ... and it's produced by Brian bureau to hear more growing on the high plains visit H. P. P. R. dot org [noise]\n\n[noise]\nI'm Bob Davis H. P. P. R. as executive director NPR's all things considered is a great way to hear the news of the day a great way to support H. B. PR is to become a sustaining member joined the mission today at H. P. P. R. dot org I'm joy all Snyder what\nThese headlines police and the Afghan capital of ... say there has been a suicide bombing ... say the bummer targeted a polling station as Afghans voted in today's parliamentary elections the number of casualties is unclear\nProtesters are packing the streets of central London today calling for a second vote on whether to leave the European Union organizers say they expect today's demonstration to be the biggest of its kind\nAnd an unmanned spacecraft has begun a seven year journey to mercury able to successfully launched last night from Europe says speed sports infringe on up the mission is a joint one between European and Japanese space agency incentive successful would only be the third to study mercury up close um trials Snyder\nNPR News from Washington [noise]\n\nSupport for NPR comes from the station and from visit St Petersburg Clearwater along Florida's Gulf Coast offering artistic draws including St Pete's Dali museum that Yahoo collection and the museum of fine arts more at visit saint Pete Clearwater dot com\nFrom the Kennan Ruthie Leming family who appreciate that for three decades NPR it's helped them to better understand a complex nation and world through its in depth coverage of events ideas and cultures\nAnd from Americans for the arts\nDishes weekend edition from NPR News I'm Scott Simon I wait all week to say it's time for sports\n[noise]\nAnd I have in the game growers versus Dodgers after the ... crew beat the sun's out of the LA Dodgers last night's evidence you we are now to Howard Bryant or ESPN dot com\nESPN the magazine Howard thanks so much for being with us [noise]\nYour morning Scott how are you doing I'm fine thanks blue man group grew crew spy on nickname for um how do you like I like that I kind of do they keep coming back all season don't they\nWell they do and Mrs ... last year ... I mean there last year because of your your cubs took them out in a fantastic battle but I can tell you that this is what you're supposed to do when you come close and then you have a chance this year you've got a game seven you haven't been to the world series since Nineteen eighty two\nAnd of course the Dodgers have a chance to go to the world series back to back so this is what is better than winner take all game seven National League championship series\nUm and we want to know that this week course of the world series is set to open on Tuesday the NBA begins their season in Boston\nNational League championship series um and we want an up or this week course of the world series is set to open on Tuesday the NBA begins their season\nIn Boston in Boston that's right and it's good to be a weight exactly yes and a Christian tell her debuted as an assistant coach for the Washington Wizards she's also still playing in the NBA for their mistakes Mickey Hammon of course is already in assistant coach for the San Antonio spurs\nIs the NBA getting closer to hiring head coach who happens to be a woman\nYeah I think it's coming in and I think is overdue when I ... I Can't wait till it does happen so you can take another\nUnnecessary barrier and and and put it away because I think that\nThe and the NBA has been the progressive lead the NBA has been the one that has been better run on protests the NBA's been better in terms of having\nFemale referees the NBA's been better with my colleague doors work on the broadcast and so the next step is to have a female head coach and it's really not\nThat big a deal for the rest of us because if you actually live in society we've all had female bosses at some point but in that we do here I Want to know yes [laughter] I Know and in in that sport it's a big deal in professional sports in the the male dominated game and also let's not forget that that ESPN actually put\nThe you know we have two women on the broadcast now for football you've got Hannah and Hannah Storm and Andrea Kramer\nBoth doing a broadcast as well and so it's it's important and these things have to happen and I'm Glad that that the NBA seems to be the one when it does happen it's um it's it's going to be good\nWomen's tennis association championship start tomorrow in Singapore But there's going to be a rule change at Wimbledon 'cause they don't want any more of those six hour final what do you think of the rules change to go to the er about what what are they going to do it the library I break yeah\nAfter after twelve after twelve twelve and they're going to go to a tie break the way that the way that they do after the U.S open after after the ... I don't like it I hate it I think it's terrible I disagree I understand the reason why people do it why they didn't get to a big deal\nAnd I I get it I don't like it because I think that it imbalances the game to the land of the giants we know that these players are now seven feet tall is six eleven or whatever we know they can serve a hundred and forty five miles an hour\nAnd that they it just becomes a serving contest but you have to play defense and if you can't play defense than the game gets shifted toward the tall guys and so we never had that conversation with with when players were were six feet under so my advice to those guys just break\nServe [laughter] uh Howard thank you you're in San Francisco uh their commemorate in fiftieth anniversary of the Mexico City Olympics and of course that's where John Carlos and Tommie Smith raise their fish on the\nMedal podium a thanks very much for being with us Howard oh it was terrific thank you\nAnd the baby of an HIV positive mother in South Africa was suffering from liver failure\nDoctors were confronted with a heroin choice transplant part of the mothers live or to the infant and risk transferring HIV or let the child grow sicker and most likely die child received part of her mother's liver and so far there has been no sign of HIV\nThe surgery is your first and could significantly changed the pool of organ donors in South Africa are about twenty percent of the population is infected with HIV largest epidemic in the world\nDr Harriet death riches and medical bioethicist at which Donald Gordon medical center that's where the trench flat happened and she was part of a team of doctors will help prepare for the surgery she joins us from Johannesburg thanks so much for being with us\nToday and I had any how's the baby doing and the baby's getting paid very well\nBeing with us thank you very much for having me on your show how's the baby doing\nAnd the baby's doing very very well we are very yeah after the transplant surgery happen now\nAnd to see the child the diving driving under the circumstances with this world for case is always the enormous the gratifying and it really makes us feel good about the decision we made\n[noise] won't help us understand that decision because you had to wear a lot of different factors should mere\n[noise] yeah so we knew that there was a really high possibility that three during the surgery we would give this child HIV but the other thing we had to wait is that the child to being on a waiting list for a living Darnah for three times the average and\nThe child was getting really sick had been admitted to ICU had needed to be ventilated and we were at the point where the question was literally would you rather die or live with HIV\nWhat if the parents children\n[noise] so the parents saying to us why ... nights where well controlled well HIV positive people we take a medication every day\nWhy wouldn't you consider rats so they would say I need that wish from the parents and the mom particularly who was the diner that she could be a Darnah and we had to consider that very casually 'cause we have to make sure that we promotion and ... the autonomy of our patients as far as possible\nSo it was interesting that in this case it was very much motivated by a request from the very brave sets of parents who wanted to save the lives of their child\n[noise] talked refuge juicing vis a vis cage some more people know about it will love contribute something to lifting the stigma they try to be in so many countries around the world\nI Would like to hurt so you know HIV stigma is an extremely complicated thing and it's it's a multifaceted\nSays I've from South Africa although we have this very well integrated national aids treatment program HIV is still very stigmatized\nAnd one of the things we would really hope to show through what we've done hit if that if you're in HIV positive person and you're on your medication you're living in normal life\nThen that should preclude you from being an organ donor it shouldn't stop you for having those options that HIV negative people would have and we hope that by showing that HIV positive people\nCan do this that that would help to reduce the stigma to some extent but this is just one case and it's going to take a lot more than one case to make a serious dent in HIV stigma", "show_name": "Weekend Edition Saturday", "year": "2018", "city": "Dalhart", "day": "20"}