{"month": "10", "state": "GA", "station": "WSB", "content": "The radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and James and brain when it's warm than we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always severe weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading data right now or do you have the radio and download it out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by ... am seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. at the program and continues here at a later our normal that can do that [noise]\n\n\n\n\n... our\nCan hear breaking news weather and traffic you demand on now on your skin\nW. W. F. B. radio waves until the latest WSBIU more traffic on demand\nLive continuing coverage of people you depend on the radio ads downloaded out in the outdoors\nNow when you ask me is broadcasting University of Georgia sports on not buy buy them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on\nMusic ... about them on your radio and\nOn a um seven fifty U. S. B. W. F. B. program and continues here at a later our as normal that can do that [noise]\n\n\n\n\n[noise] [noise] morning workout\nI'm busy I hate it when I this late and Jamie breed and when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now that don't have the radio and download it out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on not by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA exports presentation on the USB radio up north through W. S. B. radio dot com to an end I hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... powerful\nI can hear breaking weather and traffic you demand on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on longer than an\nAllied continuing coverage of new people you depend on\nThe radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss white and Jamie breed when they stormed and we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab pizza all their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah is your station on your tie\nAnd the bad news I heard all day I'm downloading\nOkay do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... pi by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on it and when you ask me radio up north to W. S. B. radio dot\nCom tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nYeah I'm a junkie here on the road a ... hour\nYou know breaking news weather and traffic you've and on now\nDo you do you have the radio I listen to the latest WSBIU more traffic on on demand when\nLive continuing coverage on the news people depend on the radio ads download it out in the outdoors\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA exports presentation on the USB radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nBusy I hate it when I visit late and Jamie the brain when they stormed and we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nNow when you asked me if broadcasting University of Georgia sports on\nTV by by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road on ... hour\nBe breaking news weather and traffic event on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand and\nAlive continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nWhen the guy you know you can listen to W. S. B. anytime anywhere with the ws be real lab he's all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nBut the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\n... power\nThat can be bringing\nWeather and traffic either end on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand way\nLive coverage on the people you depend on the radio I downloaded out the door\nThat what you ask me is broadcasting University of Georgia sports on\n... buy them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMorning workout\nI'm busy I hate it when I this white and Jamie brain when it's warm\nWe lose power would be like a guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocate all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out of the store and they'll play [noise]\nNow when you asked me a broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on music ... about them on your radio and on a um seven fifty U. S. B. W. F. B. program and continues here at a later our\nNormal that can do that [noise]\n\n\n\n\nYou know I'm a junkie from here on the road ... power\nThat can be breaking\nWeather and traffic you've and on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nAlive continuing coverage on the news people you depend on the radio I downloaded out in the outdoors and Google Play [laughter]\nMorning workout\nA busy I hate it when I miss late and Jamie breed when they stormed we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws the relapse piece of all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out on the door and\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game as\nBulldog talk on mute ... him on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our as normal and all that [noise]\n\n\n\n\nI'm a junkie from the on the road ... power\nBe bringing weather and traffic either end on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic on longer than white\nWomen live coverage of people you depend on the radio I downloaded out in the outdoors\nNow what you asked me a broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on AMC seven fifty U. S. B. W. at the program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nI'm busy I hate it when I this white and James brain when storms and we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their latest news in traffic on demand is always severe weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now do you have the radio ads downloaded out in the store and they'll play [noise]\nNow when you asked me a broadcasting University of Georgia board or not he bought by them at a um seven fifty a broadcast restrictions\nWe cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on ms ... by them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal pinned on it [noise]\n\n\n\n\n... power\nBe breaking weather and traffic you've and on now on your\nDoor you know you asked me radio I listen to the latest WSBIU or traffic on on demand when\nLive coverage on the news people you depend on the radio I downloaded out the door\n\nA busy I hate it when I ... and James brain\nWhen they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB relapse he's all their their latest news in traffic on demand is always the beer weather\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and it'll play [noise]\nWhat you asked me a broadcasting University of Georgia ... by ... am seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north drew ws the radio\nCalm tune in and I hard here the game and bulldog talk on ... ... pm on your radio and on AM seven fifty W. S. B. W. F. Lee programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road and ... our\nBreaking news weather and traffic you've ever been on on your\nDoor you had to do when you ask me radio\nWaves until the latest WSBIU more traffic on demand him when\nAlive continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports I'm not by by ... am seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on that when you ask me radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on ms ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nA busy I hate it when I miss white and James brain when a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real happy and all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio I downloaded out in the store and get it or play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on ms ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMy job to bring back the on the road on ... hour\nBe bringing weather and traffic either end on now on your skin\nW. W. F. the radio I listen to the latest ws meaning more traffic on on demand\nLive coverage on the news people you depend on\nThe radio I downloaded out the door\nMorning workout\nI'm busy I hate it when I this white and Jamie brain when it's warm than we leave power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse pizza all their\nTheir latest news in traffic on demand it always severe weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happened right now to do what are you at the radio ads downloaded out in the dark and play [noise]\nThat what you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at\nBulldog talk on ms ... about them on your radio and on a um seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie from here on the road on ... hour\nYou know breaking news weather and traffic you demand on now on your\nW. W. F. B. radio until the latest WSBIU more traffic on demand when\nLive coverage from people you depend on\nThe radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA exports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com CNN and I hard here the game and bulldog talk on music ... them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nBusy I hate it when I this white and Jamie brain when a storm didn't really power one\nGuy you know you can listen to W. S. P. anytime anywhere with the devil USB radiolab teeth all their\nLatest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia board done\nBy by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north rebel USB radio dot com Chilean and I hard here the game at\nBulldog talk on these ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal that can do that [noise]\n\n\n\n\n... power\nThat can be bringing weather and traffic either banned on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nAlive continuing coverage of people you depend on\nThe radio ads downloaded out in the door\nAnd go play [laughter]\nI'm busy I hate it when I this white and Jamie breed\nWhen they stormed and relief power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with the double USB radiolab paid all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time and the bad\nNews I heard all day I'm downloading that happen right now do you have the radio out downloaded out on the app store and play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\n... powerful\nBreaking news weather and traffic either end on on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand and\nLive [noise] continuing coverage of people you depend on the radio ads downloaded out in the outdoors\nNow what you asked me a broadcasting University of Georgia sports on not buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game at bulldog talk on\nThese ... about them on your radio and\nOn AMC seven fifty U. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I miss white and James brain when it's warm than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their\nTheir latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store\n[noise]\nNow when you ask me is broadcasting University of Georgia board or not\nHe bought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the ws me radio up\nNorth through ws be radio dot com and and I hard here the game and bulldog talk on me it's not a pot pie them on your radio and on AM seven fifty U. S. B.\nW. at the program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nAnd ... how\nYou know breaking weather and traffic you've and on now on your skin\nW W F the radio I listen to the latest WSBIU more traffic on on demand when\nAlive continuing coverage on the news people you depend on the radio out downloaded out the door\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and James brain\nWhen a storm didn't release power what he\nCan guy you know you can listen to W. S. P. anytime anywhere with a double USB radiolab he's all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah it's your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and they don't play [noise]\nNow what do you ask me is broadcasting University of Georgia ... buy them at a um\nSeven fifty a broadcast restrictions we cannot offer the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... him on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nBe bringing weather and traffic you know now\nDo you do you have the radio I listen to the latest WSBIU more traffic on on demand and\nLive coverage on the people you depend on the radio I downloaded out in the outdoors\nNow with us being broadcast the University of Georgia sports on TV by by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game and bulldog talk\nIf not he bought by them on your radio and on AM seven fifty W. F. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nBusy I hate it when I miss white and James or brain when storms and release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their their latest news and traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia board ... buy them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north through ws be radio dot com and and I hard here the game and\nBulldog talk on music ... about them on your radio and\nOn a um seven fifty W. S. B. W. at the program and continues here at a later our parents normal depend on it [noise]\n\n\n\n\nHowever\nThat can be breaking\nWeather and traffic either banned on on your\nDoor you ever do you ask the radio I listen to the latest WSBIU more traffic on on demand where\nLive coverage of people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie breed\nAnd when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... by ... am seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nBulldog talk on mute ... about them on your radio and\nOn AMC seven fifty W. S. B. W. at the programming continues here at a later our normal and on it [noise]\n\n\n\n\nI'm a junkie from here on the road ... power\nCan be bringing\nWeather and traffic you demand on now on\nW. W. F. B. radio until the latest WSBIU more traffic on on demand and\nLive coverage on the news people you depend on the radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia board ... pi by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game at bulldog talk on\nMute ... about them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nI'm busy I hate it when I this late and James brain when a storm didn't release power would be\nThe guy you know you can listen to WIP anytime anywhere with the ws be real advocate them all their their latest news and traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and they'll play [noise]\nNow when you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on the USB radio up north readable USB radio dot com and and I hard here the game as bulldog talk on music\n... about them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal pinned on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road a ... hour\nBe breaking weather and traffic either and on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand and when\nAlive [noise] continuing coverage on the people you depend on\nThe radio I downloaded out the door\nRight [laughter] [noise] morning workout\nBusy I hate it when I this white and James brain\nWhen they stormed the Willis Tower\nOne guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ... by ... am seven fifty to the broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as\nBulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nBe breaking news weather and traffic either end on on your skin\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand waiting\nIn line continuing coverage on the news people you depend on the radio I downloaded\nNow what do you ask me is broadcasting University of Georgia sports I'm not a pie by them at a um seven fifty to broadcast restrictions we cannot offer the UGA exports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on AM seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMorning workout\nI'm busy I hate it when I miss white and Jamie the brain when it's warm than we lose power\nWhat the guy you know you can listen to W. S. B. anytime anywhere with a double USB relapse pizza all their their latest news in traffic on demand is always severe weather coverage about when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happened right now to do what are you on the radio ads downloaded out in the store and it'll play [noise]\nThat what you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the ws radio up north through ws be radio dot com and and I hard here the game as\nBulldog talk on me it's not a pot pie them on your radio and on AMC seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road on ... hour\nBe breaking weather and traffic you'd have an on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU or traffic on on demand when\nLive coverage on people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this white and Jamie free money storms and we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio and download it out in the dark and they'll play [noise]\nNow what do you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot allow for the ... presentation on WSBIU radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm a junkie from the on the road ... power\nBe bringing weather and traffic you demand on now on\nW. W. F. B. radio waves until the latest WNBA new more traffic on on demand and wait\nIn line continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia board ...\nBy ... am seven fifty do the broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on\nMe is not a pot pie them on your radio and on AM seven fifty U. S. B. W. at the program and continues here at a later our\nNormal depend on it [noise]\n\n[noise]\n\n\n\nBusy I hate it when I this latest James brain when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P real advocates all their their latest news and traffic on demand is always the beer weather coverage about when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading not happening right now or do you have the radio and download it out in the store and it'll play [noise]\nNow when you asked me a broadcasting University of Georgia board somebody\nBought by them at a um seven fifty broadcast restrictions\nWe cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on these ... about them on your radio and on AM seven fifty W. S. B. W. F. B. program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nBe breaking weather and traffic you depend on now on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand where\nLive coverage on a new people you depend on the radio I downloaded out in the outdoors\nMorning workout\nBusy I hate it when I this late in Jamie breed\nWhen they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab teeth all their\nTheir latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio I downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nThrough W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... him on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nYou're my job to be on the road to ... hours like that can be\nBreaking weather and traffic either end on now on\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand\nLive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nWSBIU broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on AMC seven fifty don't you ask B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nMorning workout\nBusy I hate it when I miss white and James brain when storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P real advocates of all their\nTheir latest news in traffic on demand is always the beer weather coverage about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the dark and they'll play [noise]\nThat what you asked me a broadcasting University of Georgia sports on the part by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com and and I hard here the game and\nBulldog talk on mute ... about them on your radio and on a um seven fifty don't you ask me do when you ask the programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nA ... hour\nCan be bringing weather and traffic you'd have an on on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand when\nAlive [noise] continuing coverage of people you depend on the radio out downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I this late in gym to print\nMoney storms and we leave power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news and traffic on demand is always the beer weather coverage about when something happens breaking news station on\nYour time and the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on music ... him on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n", "show_name": "Erick Erickson", "year": "2018", "city": "Atlanta", "day": "13"}