{"month": "10", "state": "GA", "station": "WSB", "content": "Live coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nA busy I hate it when I this late in Jamie breed\nWhen they stormed and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their\nTheir latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time and the bad\nNews I heard all day I'm downloading that apple right now that don't have the radio and downloaded out in the store and doodles way [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... them on your radio and on AMC seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nCan be bringing weather and traffic you demand on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand an\nAllied continuing coverage of people you depend on the radio out downloaded out in the outdoors\nThat what you ask me is broadcasting University of Georgia sports on\nBy by them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nOr through double USB radio dot com tune in and buy hard here the game as bulldog talk on these ... about them on your radio and on AMC seven fifty don't you ask me do when you add the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nMorning workout\nBusy I hate it when I miss white and Jamie breed when storms and we lose power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time but the\nBad news I heard all day I'm downloading not happening right now do you have the radio I downloaded out in the store and it'll play [noise]\nNow when you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and buy hard here the game at bulldog talk on ms\n... by them on your radio and on AM seven fifty U. S. B.\nW. F. B. program and continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... power\nBe bringing weather and traffic you've and on now on your\nDoor you know you asked me radio waves him to the latest WSBIU more traffic on on demand where\nAlive continuing coverage on the news people you depend on the radio I downloaded out the door\n\nA busy I hate it when I this late in gym to train when they stormed in relief power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news\nYeah it's your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven\nFifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal and on it [noise]\n\n\n\n\n... powerful\nHear breaking weather and traffic you've and\nOn your\nDoor you got to do when you ask me radio I listen to the latest WSBIU more traffic on on demand when\nLive continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nThat what you asked me as broadcasting University of Georgia sports on\nNot buy buy them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. F. B. W. at the programming continues here at a later our\nNormal and all that [noise]\n\n\n\n\nI'm busy I hate it when I this white and James brain when they stormed ... power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio and download it out in the store\n[noise]\nNow when you asked me a broadcasting University of Georgia sports on the part by them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through double USB radio dot com tune in and I hard here the game and bulldog talk on\nThese ... about them on your radio and on AMC seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie for my family on the road a ... hour\nBe breaking news weather and traffic you live and on on your\nDoor you had to do when you ask me radio until the latest WSBIU more traffic on on demand where\nLive continuing coverage on the people you depend on the radio I downloaded out in the outdoors\nBusy I hate it when I this white and James brain\nWhen a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with the ws be real advocates all their\nTheir latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now don't you have the radio ads downloaded out in the store and\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven\nFifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nBringing weather and traffic you've been going\nNow on your skin\nW. W. F. B. radio waves him to the latest WSBIU more traffic on on demand when\nLive continuing coverage on the news people you depend on\nThe radio I downloaded out the door\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on these ... them on your radio and on AMC seven fifty don't you ask the W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMorning workouts\nOn a busy I hate it when I miss white and Jamie brain\nWhen storms and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand it always severe weather coverage what about when something happens breaking news yeah if you were stationed on your time\nAnd the bad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store and go play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody\nBought by them at a um seven fifty new to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through ws be radio dot com tune in and I hard here the game and\nBulldog talk on these ... by them on your radio and on a um seven fifty you ask the W. B. programming\nContinues here at a later our\nNormal and on it [noise]\n\n\n\n\nA ... hour\nYou know breaking news weather and traffic you've and on on your skin\nTone you had to do when you ask the radio I listen to the latest WSBIU or traffic on on demand when\nLive came from the people you\nDepend on the radio out downloaded out in the outdoors\n\nI'm busy I hate it when I miss late and James brain\nWhen a storm didn't release power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia sports on not by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game at bulldog talk on these ... him on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nCan you know breaking news\nWeather and traffic you'd have and on now on your door you had to do you have the radio\nListen to the latest WSBIU more traffic on on demand way\nLive coverage\nPeople you depend on the radio ads download it out and they act\nNoble us be broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. F. B. W. M. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I miss white and Jamie the brain when they stormed than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P relapse piece of all their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that apple right now or do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the ws the radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on\nThese ... them on your radio and on a um seven fifty W. S. B.\nW. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road on ... hour\nCan hear breaking weather and traffic either end on now on your\nW. W. F. B. radio until the latest WSBIU more traffic onto their hands when\nLive coverage of people you\nDepend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter]\nI'm busy I hate it when I miss white and James brain when storms and we lose power when\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and play [noise]\nWhat you ask me is broadcasting University of Georgia sports I'm not by by them at a um seven fifty a broadcast restrictions we cannot operate\nTo be a sports presentation on that when you asked me radio up north through ws the radio dot com tune in and I hard here the game a bulldog talk on music ... him on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road ... ... hours\nCan you know breaking weather and traffic either end on now on your\nDoor you had to do when you ask the radio waves until later WSBIU or traffic on on demand where\nLive coverage from people you\nDepend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia ...\nBy ... am seven fifty do the broadcast restrictions we cannot allow for the UGA sports presentation on the ws me radio up or through W. S. B. radio dot com tune in and I hard here the game and\nBulldog talk on music ... them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I this white and Jamie breed\nWhen a storm didn't release power what\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their latest news in traffic on demand is always severe weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up or through W. S. B. radio dot com field and and I hard here the game and\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to be on the road on ... hour\nBe breaking weather and traffic either banned on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic on on demand when\nLive continuing coverage on the news people\nYou depend on the radio I downloaded out the door\nAnd go play [laughter] morning workout\nBusy I hate it when I miss late and Jamie brain\nStorms and release power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand it always severe weather coverage what about when something happens breaking news station on your time and the\nBad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia ... pi by them at a um\nSeven fifty broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie here on the road a lot of money during the ... hour\nYou know breaking news weather and traffic you have an on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand and\nLive continuing coverage of people you\nDepend on the radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports I'm not by by ... am seven fifty due to broadcast restrictions we cannot allow for the UGA exports presentation on WSBIU radio up through W. S. B. radio dot com tune in and I hard here the game a bulldog talk on\nThese ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] [noise] morning workout\nA busy I hate it when I this white and Jamie breed when they stormed and we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now to do what do you have the radio and download it out on the app store and get into play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on ms ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nMy job to be on the road on ... hour\nBe breaking weather and traffic you've and on now on your\nDoor you had to do when you ask the radio waves until the latest WSBIU or traffic on on demand when\nAlive continuing coverage on the news people depend on the radio ads downloaded out in the outdoors\nAnd Google's play [laughter]\nBusy I hate it when I this white and James brain when storms and Willie power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab he's all their their latest news in traffic on demand is always the beer weather\nWhen something happens breaking news station on your time\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north to W. S. B. radio dot com tune in and I hard\nHere the game and bulldog talk on these ... about them on your radio and\nOn AM seven fifty W. S. B. W. at the programming continues here at a later our normal that can do that [noise]\n\n\n\n\n... power\nBreaking news weather and traffic either end on now on\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand and wait\nIn line continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNow what do you ask me is broadcasting University of Georgia sports I'm\nNot a pie by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on that when you asked me radio up north through ws be radio dot com tune in and I hard here the game as\nBulldog talk on these ... about them on your radio and on AMC seven fifty U. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nBusy I hate it when I miss late and James Gregory Winter storms and we lose power\nWouldn't be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their their latest news in traffic on demand is always severe weather\nWhen something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and play [noise]\nNow when you ask me is broadcasting University of Georgia board\nNot buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com and and I hard here the game as bulldog talk on\n... about them on your radio and on a um seven fifty U. S. B. W. at the program and continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road and ... and we have\nBreaking weather and traffic you know no harm us get\nW W F the radio I listen to the latest WSBIU more traffic on on demand and way\nLive coverage on the news people you depend on\nThe radio I downloaded out the door\n\nA busy I hate it when I this white and Jamie free when they stormed Willie power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab pizza all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and play [noise]\nThat what you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty to broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on AM seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYou're my job to bring back the on the road to ... hours\nBe breaking news weather and traffic you demand on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand and\nLive [noise] continuing coverage of people you depend on\nThe radio out download it now and the outdoors\nNow with us be broadcasting University of Georgia board somebody by by them at a um seven fifty broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through W s\nThe radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on AMC seven fifty don't you ask me do when you add the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nI'm busy I hate it when I miss white and Jamie the brain when storms than we lose power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P real advocates all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now or do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through double USB radio dot com tune in and I hard here the game and\nBulldog talk on these ... about them on your radio and on a um seven fifty U. S. B. W. at the programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic you've been banned on now on your\nDoor you had to do when you ask me radio I listen to the latest WSBIU more traffic on on demand way\nLive coverage on the news people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter]\nBusy I hate it when I this white and Jamie free when it's warm than we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio I downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nBulldog chalk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYou're at my job to bring back the on the road ... hours\nLike breaking news\nWeather and traffic you've and on now on\nW. W. F. B. radio until the latest WSBIU more traffic on on demand and wait\nIn line continuing coverage on the people you depend on the radio I downloaded\nNow what us be broadcasting University of Georgia board somebody bought by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on the ws the radio I\nDrew ws be radio dot com tune in and I hard here the game and bulldog talk on these ... by them on your radio and on AMC seven fifty you asked me W F the programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\nBusy I hate it when I miss white and Jamie brain when storms than we lose our\nWhat the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia board\nNot buy buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through ws be radio dot com tune in and I hard here the game and bulldog talk on me\nIt's not a pot pie them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal depend on it [noise]\n\n\n\n\n... how\nThat can be breaking weather and traffic you've been going on now on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand where\nAlive and came in coverage on the news people you depend on\nOr do any of the radio I downloaded out in the outdoors\nAnd Google Play [laughter]\nBusy I hate it when I this late in gym to pray when it's warm than we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their\nTheir latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia board somebody by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game and bulldog talk on ms ... him on your radio and on AMC seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nPowerPoint\nBreaking weather and traffic you've been banned on on your\nDoor you had to do when you ask the radio I listen to the latest WSBIU more traffic on on demand where\nLive continuing coverage of people you depend\nOn the radio I downloaded out in the outdoors\nNobody us being broadcast the University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA sports presentation on the ws me radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and\nOn a um seven fifty W. F. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie breed stormed than we lose power when\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their latest news in traffic on demand it always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot\nCom tune in and buy hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... power\nBe breaking news weather and traffic you demand on now on your\nDoor you had to do when you ask the radio waves until the latest WSBIU more traffic on demand and\nLive coverage of people you\nDepend on the radio I downloaded\n\nBusy I hate it when I miss late and James brain\nWhen storms and we lose power\nWhen the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece all their their latest news in traffic on demand is always severe weather\nAbout when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio or download it out in the store and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia sports I'm not by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road ... power\nThat can be breaking\nWeather and traffic you've and on on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand and quite\nAlive [noise] continuing coverage of people you depend on the radio ads downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on\nTV by by them at a um seven fifty do the broadcast restrictions we cannot allow for the UGA exports presentation on the ws me radio up or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on\nThese ... them on your radio and on a um seven fifty W. F. B. W. at the programming continues here at a later our as\nNormal and on it [noise]\n[noise]\n\n\n\nA busy I hate it when I miss white and Jamie brain when a storm didn't release power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the weather coverage what about when somebody has a breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on\nBy by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on ms ... by them on your radio and on a um seven fifty W. S. B.\nW. at the programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour\nBe breaking news weather and traffic you've been going on now on your\nDoor you had to do you ask the radio waves until the latest WSBIU more traffic on demand and\nLive came up with people you depend\nOn the radio I downloaded out in the outdoors and Google Play [laughter]\n\nI'm busy I hate it when I miss late and James brain when it's warm than we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and they'll play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... him on your radio and\nOn AM seven fifty W. S. B. W. at the programming continues here at a later our as normal and on it [noise]\n\n\n\n\nYeah my job to be on the road ... storms and we live our\nBe breaking weather and traffic you'd have and on now on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand way\nLive coverage people you depend\nOn the radio I downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA sports presentation on the USB radio opt\nIn or through W. S. B. radio dot com tune in and buy hard here the game as bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n[noise] [noise] morning workout\nA busy I hate it when I miss white and Jamie breed and when they stormed than we lose our ...\nThe guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always severe weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia sports on\nTV by by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and\nBulldog talk on ms ... them on your radio and on a um seven fifty W. S. B. W. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic you demand on now on your\nDoor you had to do when you ask me radio waves until the latest WSBIU more traffic on demand and\nLive coverage on the news people you depend on\nThe radio I downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss late and James brain when they stormed and we leave power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news yeah it's your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark\n[noise]\nThat what you ask me is broadcasting University of Georgia ... by ... am seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up north through W. S. B. radio dot com tune in and I hard here the game at\nBulldog talk on these ... them on your radio and\nOn AM seven fifty W. S. B. W. F. B. programming continues here at a later our normal and on it [noise]", "show_name": "Erick Erickson", "year": "2018", "city": "Atlanta", "day": "27"}