{"month": "10", "state": "TN", "station": "WWTN", "content": "Free lighter dot com slash corner office that's free liner dot com slash corner office free lighter runs smart\nOwner operators we know everyone has been for a few days to make the best move for your business in Mercer transportation help you take advantage of that phrase was no company frogs Mercer is committed to our owner operators says we have fast pace over forty years experience and on for a digital coordinator unhealthy manager at all\nSo you can focus on running your business if you're looking to make a move considered Mercer transportation rock solid owner operator driven for over forty years visit today at Mercer town dot com or\nDid you know the studies have shown that almost two and a half million truck drivers in the U.S have one or more serious health problems such as obesity diabetes heart disease even sleep disorders and our truck drivers lacked the same access to health that other Americans enjoy\nThe unfortunate result of these circumstances is that drivers are off and unable to get treatment and the early stages of disease minor illnesses become severe leading to hospitalization and disability the driver then may lose their CDL and become unable to work\nThis creates a downward spiral that leads to extreme financial hardship and possible unemployment\nGo to truckers fun dot org today and learn more about how you can contribute if you are someone inside the trucking industry may be a need\nTo learn how SDF can help we encourage you to educate yourself and tears on the sink Christopher truckers fun today donate if you can you never know when you may need some help too that's truckers fund dot org let's band together for a better tomorrow\nProfessional drivers your favorite magazines are now on stands and ready for you to read cover to cover truckers connection offers great jobs entertainment industry news each month\nJob opportunities for owner operators is easy to spot with a hot right on the cover and the best career options for truck owners inside find truckers connection and job opportunities free had pets rose traveled centers of America will toes and other truck stops nationwide truckers connection and job opportunities for owner operators we're searching for greener grass\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nIf you're a drowning in debt you can't afford\nTo not let the credit card companies trick you into thinking that you have to pay it all back\nWhat the credit card companies don't want you to know\nIs that there's actually a wait to get debt free\nWithout paying off your entire debt\nIf you have five thousand dollars or more in credit card debt\nNow have the right to let a settled that that for a fraction of what you will\nFor free information called credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nIf you can't afford to pay off all your debt\nNot let the credit card companies trick you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without debt consolidation or bankruptcy\nDepend on your success is offered guaranteed\nFree information cold now one eight hundred nine five seven nine seven four six that's wanting\nIt's nine five seven nine seven four six\nEight hundred nine five seven nine seven four six other\nTraffic and talk we pretty much have all unique super ... double duty as\n[noise]\nThrow that radio he is currently and I'm Jerry McNamara was interesting because you and I were both looking at the same rate our hurricane Michael ... and\nAnd I just I was sitting here looking at at the the radar over the last of looks like maybe four or five hours and ... and I just looked at you and I said error you know we we've seen since we've been on the air that it's gone from a hundred and twenty five miles an hour sustained winds two hundred and forty and I was well into a category for\nA hurricane and we're told could even get stronger right and I just looked at ... can you see over the last five six hours that hurricane you know how the the I ... you know the wall has just solidified completely and just gotten you know you look at it and you're just\nYou can see the hurricane strengthening it it is a scary and\nStartling image when you look at that knowing what's coming for the people in Florida and know what's coming for the people inland even\nA you look at those to staying wins again of a hundred and forty miles an hour right now and they could get even higher up before Michael makes landfall later this afternoon and again you you also look at the timeline\nAnd in the heart of that you know when the bulls sigh of that that path\nThose folks will be in the midst of sustained winds for\nA long long long time\nIt will seem like it's not going to\nEnd and then you start [noise] after that assessing the damage which will be [noise] and there's no doubt catastrophic keep everybody in your ... ... [noise]\n\n\nAs soon as ... radio on Westwood One\nDish a Gigi keeping you connected coast it goes from a comfort of your guests have signed up more disregard drug ... from a drug dog gum\nCobra electronics is rather than for the fight against breast cancer by partnering with bright pink travel centers of America and Petro stopping center to bring you the twenty nine LCD bright pink CB radio this limited edition right did CB\nRadio is helping to save lives from Russian ovarian cancer by empowering women to liberal activists for every radio psalm makes me donation device thinking the fight against cancer and the right to the\nRadio is available for a limited time ... travel centers of America and Petro stopping centers\nIf you or someone you know is struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight\nThat eight hundred three nine zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one call away eight hundred three nine zero nine five to eight make the\nFree call now eight hundred three nine zero nine five to eight ... third party advertiser for various treatment centers in place from networks individual results will bury visit your addiction team dot com forward slash turns for more information\nDrivers apps on your phone and give more stores funny videos but now that I wanted to make life easier on the road as well you got the my pilot from pilots\nFlying J you can sort of odd shower real time parking war starts off right here ... even get savings and rewards of always a touch of 'em are\nYou on it we got it and I was flying J download the Fremont pilot Avon start saving today [noise]\nHey if you're driving right now and you'd like to read the informative an entertaining content found in the current September October issue of rotating magazine or if you'd like to listen that's right I've said listen\nAs a voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of votes your drivers is now available for free as an F. R. E. E. N. N. E. T. H. Petra location nationwide\nAnd if you're not fueling at a TA Petra location today while you're in luck you can simply go to ... king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote cheating on your smartphone will scroll down version is also available at Rhodes ... dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening road teen dot com\nEra currently here for the St Christopher truckers relief fund\nIf you could help a truck driver get back to work make their pile of bills less daunting give them one less worry wouldn't you\nEvery year thousands of truckers lose their jobs homes and more when a medical problem causes financial hardships but with your donation to the St Christopher truckers relief fund you can help get them and their families back on the road donate today at truckers fun dot org that's truck responded dot org gave us today at truckers fund dot\nHenderson bail Nashville\nStudio we're talking about I mean I [noise]\nIt's five o'clock I'm Jen Weaver with your top stories changes are on the way with the rain and\nCooler temperatures bud were happening to keep an eye on hurricane Michael now a category ... storm one hundred forty five miles now away from Panama City Beach Florida\nAt at eight eight am Wednesday morning ah and then it will weaken to a category three they believe this afternoon as it hits land you know when the hurricane starts to interact with the land\nOf that's when things start to come apart buddy category three nothing to sneeze at and again the storm surges the thing that will get you on the right side of the storm is as you head into the Big Bend area it's more it's torn Appalachia cola\nAppalachia cola Franklin County is going to get the worst of this ah with a storm surge of around Thirteen feet so\nEverything that's not at least Thirteen feet above sea level is going to be some merged\nAnd that's a lot of stuff because the land around there's pretty flat um\nThen it moves across Georgia across the Carolinas and a as a tropical storm or I at least a tropical depression as expected to exit the Carolinas back into the Atlantic ocean and lord knows what happens there [noise]\nThis is a bad one um I think most people are decided when it went to a category three even those people who were say well maybe I'll just stick it out\nMaybe I'll just ride this storm out a lot of people want to do that I think it's a bad mistake in this particular case this was a killer storm there will be billions of dollars of damage\nAnd people will die I mean this is that's the kind of storm we're talking about there will be deaths and there will be many many billions of dollars of destruction this is one not to toy around with\nThe sit in your basic category one category to this was before it might get up it might get up around uh five before it's all over because this one has been hard to predict as far as intensity goes remember it was Monday I mean I was there Sunday and I laughed too much that it's not going to be much of a storm somebody\nYou know maybe a category to it's going to go away don't worry about it and I didn't even ... my place down there\nThere's no telling what I'm going to go down to their my places or to the west of it but I mean I'm telling you\nWhen you're talking a hundred and forty mile an hour winds there's no telling so I I Know these people didn't have time to prep a between the time they went serious and they and they call the evacuation\nWasn't much time for people to get ready\nAnd they're now they're closing down the bridges and you can't get in or you can get out and so we're going to continue to keep an eye on hurricane Michael this morning as it heads toward the Gulf Coast of Florida it is um\nIt is a really really serious storm and one that will uh will leave a mark on that area that will not soon be forgotten five twelve now on double duty again\nNow listen to wash on Alexa say Alexa enabled a WPN scale send them play us say Alexa open\nHow are you feeling [noise] helmet\nFedEx delivery patch what we turn their back and laughing\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nText funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nWe will never fully understand what we've asked of our military service members or their family\nAsking them to put themselves in harm's way to endure at all\nBut we do understand that it's our and our duty to keep them secure for the rest of their lines wounded warrior project long term support programs help our most severely ill or\nInjured veterans with independents\nAt no cost for life\nSo that they might stand at ease join us at science WWW dot org\nWestwood One John Kass networks Bobi radio which determine John Melendez bottled Boston\nI Do have a book coming out called easy for you to say right now which is all the behind the scenes of power and all the ... the\nThe J with Jackie to job man Marlene on our down word\nIs not in ours lexicon in ... center in John and Jackie to job man on the radio downloaded free and easy on demand wherever you get your contest from the west was won pod cast network\nThe AC dot com\n[noise] from the genesis diamonds sell you T young traffic center\nFor still working on Iraq on spring street going on to the extremes I twenty four eastbound downtown [noise] other than that and that seemed too much going on sixty five twenty force but before you get the trinity lame looking really clear\nAnd also what I forty eastbound coming out of the west side of town of mount Juliet leading into the forty twenty four split coming in downtown I'm Josh ... like every ten minutes every morning on super talk now\nWith the holidays fast approaching we're gearing up for Nashville rescue missions annual radio with on on Monday November twenty page Brian Wilson inviting you to join us for the one day of the year that we can all give back to this amazing operation that serves the needy here in middle Tennessee\nThey help over eight hundred men and women and children each day so pleased to be a partner of hope this year in support Nashville rescue missions radios on on Monday November nineteenth right here on super talk Ninety nine seven WPN for more information visit Nashville rescue mission dot org\nAnd the music city center the median Capital Management weather\nHere's your forewarn weather forecast mostly cloudy and warm today what's funny rain showers high temperature eighty two more rain likely for a time tonight low fifty seven so much cooler at high tomorrow Seventy with a strong northwest when from the foreign weather center meteorologist and Thomas\nTheir next chance to win a thousand dollars is coming up at eight oh five eight four day right here on super ... Ninety nine seven some tea yeah\n[noise]\nNow there are some bad boys on the run here this morning as we\nUh we look at our bad boy report a crime end or evil and music city um we have a\nAn escape and rather for county I not just one that's right but to authorities are searching for two inmates who escaped by overpowering a guard at the rather for county jail early Wednesday this according to W. K. R. ins are born in this uh they escaped around twelve forty am this morning\nA rather for county sheriff's deputies and Murfreesboro police officers are searching the area near new Salem highway right\nNow with canine officers the Tennessee highway patrol helicopter is in the air the guard was injured in the attack and apparently was treated my paramedics uh\nThe people that they're looking for are forty three road to wane half acre\nAnd Jonathan Baxter twenty eight years old last seen wearing as you might imagine white tee shirts and orange match if you see someone\nIn Murfreesboro rather for county wearing orange pads you know a do not engage call police call nine one one immediately half acre was once\nThis is a bad guy was once on the TV ... most wanted list\nAfter he and accomplish for charging an armed robbery or\nHe was arrested near Chattanooga after a five day manhunt so this guy knows how to a fleet from the police\nIf you see them called the sheriff's office called nine one one immediately do not approach run for your lives a couple of bad guys last seen orange pads white T shirt a couple of bad looking on Braves if you see them or let the police snow\nAgain over power to guard around twelve forty this morning\nA here's one and this comes from the ws envy website and uh they're reporting on a detective with the Herman ... precinct are searching for a suspect accused of killing a fourteen year old on Tuesday evening\nFourteen years old I'm police were called the one hundred block of Nashville greens around six thirty\nA Giovanni Hernandez fourteen transported to Vanderbilt University medical center where he died of his injuries metro police say fourteen year old am Ron Johnson was taken into custody he was charged with criminal homicide is being held at a juvenile detention facility\nSo they have a suspect in case there and he's a he's a team or usually they do not uh they do not released the names of the juveniles who are arrested but in this case apparently he will be charged\nAs an adult I'm guessing and that's why they have released the name\nSo again tragic loss of life a fourteen year olds killing one another my goodness\nUm and then uh we remember we've been talking about these police involved shootings\nAnd the Nashville area a sure Sean Dylan shot dead friday night in a some kind of standoff with police are we learned a little bit of on it to the officers Samuel ... he was hit twice in the leg to other officers who were there at the same then fired on Sean Dylan\nOur veterans who were there for you everyday to ensure our way of life [noise] let them know you can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vet alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much ... V. E. T. to eight whole eight eight eight dodge [noise]\nInformation few opinion driven these these bills news and talk leader super talk Ninety nine [noise]\nI'm ... wheeler with your top stories and the changes in the weather we've been\nTalking about are on the way we've got the timeline during the forecast in traffic in five minutes\nAnd two inmates are on the run after breaking out of the ... adult detention center last night about well actually this morning about twelve thirty several law enforcement agencies with the help of a helicopter in canines are helping to get these guys back into custody\nLooks like Duane half acre and Jonathan Baxter over power to jailer that jailer needed some medical treatment\nA half acre and Baxter able to get over a razor wire fence they were last seen wearing white T shirts in orange pans if you see anyone like that\nCall a ... or our Facebook and Twitter pages or pictures and numbers to call meanwhile here in Nashville\nSome nastiness overnight involving two teenage boys a fourteen year olds under arrest for the murder of another fourteen year old is happening on the street outside one thirty ... greens police say Giovanni Hernandez was gunned down a Mariano Johnson's being charged criminal homicide and is in juvenile detention\nHalf a million people under evacuation orders ahead of the arrival of hurricane Michael expected to make landfall in Florida by seven o'clock tonight at the job of Harry says the storm surge is expected to be twelve feet plus which would push water up to the second floor of homes and businesses and there'll be no power\nHe a power outage concern is going to be a really significant and widespread from Panama City just of east mainly into Tallahassee were plenty of oak trees across this region we expect a lot of that to come down with the women that were expecting in the forecast later on today\nPresident Trump's declared a state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response is speaking of federal response to disasters homeland\nSecurity secretary Kirstjen Nielsen an FBI Director Christopher Wray will be among those who will testify about current an emerging traps including cyber security and packing my international groups Russian interference in the two thousand sixteen elections and in the upcoming make terms also are expected to top the discussion\nLinda Kenyon reporting that's going to be happening in the Senate today more than one hundred children are safe in Michigan\nAfter a one day operation by the U.S Marshals Service the initiative took place September twenty six in Wayne County Michigan where three cases ride in a fight as possible sex trafficking one homeless teenager not eating for three days\nAnd missing child recovery unit there in Michigan says the message to the families of missing children is we will never stop looking for you\nIt actually twenty eight team President Trump on the campaign trail in Iowa last night said Democrats are too extreme and dangerous to govern saying they've gone wacko\nThey've gone so far left that they consider Pocahontas to be a rational\nFirst [noise] [noise] oh I Hope\nThe wrong side of that we can finally get down to the facts as to whether or not she has ...\nSince the president's rally in Johnson City in Tennessee is CBS News poll shows Marsha Blackburn is Thursday points ahead of bill reticent in the U.S Senate race Blackburn Bredesen debate tonight in Knoxville\nThat'll be carried live on news to another next door stations around the state meanwhile report said no punches were don't last night and the debate between gubernatorial ... billion Karl Dean and by that I mean figuratively not literally\nIn Tennessee reports of a true life nightmare at a place designed to scare you\nHappened to Halloween attraction travel five reports or group of friends who went to the event a woman to bully some men are the costume approached and concerning the male friend with the man using ... to\nAsk if he was messing with her she jokingly said you ask the Manhattan or a knife injured stabbed him thinking it was a thick ice you did\nBeen sober blood broke his arm German shall WGN news\nHappening at the Nashville nightmare in Madison and that's the latest used by ... by sending ski sports trafficking whether next time Ken Weaver WTO's\n... from the genesis diamonds sell you T and traffic center\nEarlier this morning we were dealing with Iraq on springs street going on to the edge and trapped by twenty forty found downtown that's been cleared out but we did pick up a new wrecked downtown with ramp restrictions and forty west out of the twenty four forty split leading to Selma Evans bridge\nThat crashes on the right lane of the ramp on my forte West I'm going to twenty four downtown and also still working on that crash and burn old hickory boulevard Firestone parkway\nOther than that I forty west bound coming out of mount Juliet leading the old hickory boulevard looking clear as well as I sixty five north and coming out of Franklin in Brentwood I'm Joshua ... traffic every ten minutes every morning on super talk\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nIncorporated in Capital Management weather here's your forewarn weather forecast mostly cloudy warm and humid today would spotty rain showers high temperature eighty to a few more rain showers\nMayo Clinic pediatrician Dr Robert Jacobson says the war on germs start\nScience else teaching kids outta hand hygiene while they're young water\nDefinitely jackets and asks Harris Elise Hi example to be ... effort for example it's time to get for access\nReady the parents as outlawed I'm not wash my hands with soap and water before\nReaching the refrigerator yet your food [noise] I just came in from take out the trash can for your glass of milk I have to wash my hands first [noise]\nMany illnesses are friends I on last hands and teaching kids how to properly clean their hands on health andme remain healthy children really do need to get a habit\nAbout hand washing and they'll do it when they have examples at home\nFor more information toppling health care provider or visit Mayo Clinic dot org\n... dot com in Capital Management weather's here's your forewarn weather forecast mostly cloudy and warm today would spotty rain showers high temperature eighty two more rain likely for a time tonight low fifty seven so much cooler at high tomorrow Seventy with a strong northwest when\nFrom the foreign weather center a meteorologist and Thomas\nExchange to win a thousand dollars is coming up at eight oh five eight four day right here on super ... Ninety nine seven gee yeah\nI Know this was always the case with my parents when it came time to buy an appliance or a piece of furniture or something for the house you know are we went we always went to Sears and Roebuck a kid did you ever go to Sears when you were a kid your parents ever buy stuff it's ear absolutely\nBecause round about Thanksgiving I'd get that Christmas catalog here yeah yeah yeah yeah\nWell see her in the world of hurt I don't know if you've heard this yeah but there are about to do a bankruptcy filing\nA you know it's been a dwindling company for years they keep closing stores and closing stores\nBut I remember as a kid I mean you didn't buy a washer and dryer from any place else other than Sears right you didn't buy a refrigerator and Larry Joe you went down to Sears and Roebuck and that's what they used to call at Sears and Roebuck then they got rid of the Roebuck and it just became seniors and uh and and\nI mean you went down in downtown Odessa where I grew up you walked in the door and write to the left I remember this is distinctly ... was a popcorn machine\nMe and I and I manage smells good and I get a we'd get a bag of popcorn costs would you you would leave trails of popcorn all over the ...\nUh and and I mean they had vacuum cleaners and furniture and appliances I mean anything in the world did you go tools you know anything that you could imagine you could get it at Sears but I mean Sears is a no more it seems that it has become the victim\nOr after the recession of Walmart and and more recently Amazon\nOr they've just sort of run 'em out of business so I don't know if they're going to survive a this bankruptcy filing they apparently have a\nFive point five billion dollar debt load which is a a significant debt load but you know sort of sad to see the passing of something that was a you know a mainstay of commerce in this country for the better part of a century\nSears and Roebuck and you're right man there was nothing better than getting at Sears and Roebuck catalogue all that and you know about Halloween you started looking and circling the stuff\nOh yeah ... and bring you man that was good I had those I had all those catalogs lined up or let's say they want us to the well a member of the G and why did you and why right\nOr they had a good selection of toys\nI'm not gum rewards gum rewards there's another one of those words walls were man we are really dating ourselves because there's a hung out a gun would who what\nI was sitting here thinking that saying [laughter] I Love boat I Would say that because he looked like in about half our age I figured to myself I'm like I just like power rangers back in uh Ninety L yeah that\nYeah I mean uh you know it was for work for you it's like Amazon right yeah and without ... and ... yeah well I mean you know I've I've done my fair share of shopping over at the tar J\nUh but now I'm telling you it really honestly in my day target yeah what Sears and Roebuck\n... I mean I mean everything and the Sears and Roebuck their catalog ... you know that that there are all across the hall in America there are home ...\nThat were built from Sears yet circled Sears option people used to build their homes out of out of a Sears and Roebuck catalog yeah so I mean it is really part of the fabric of of this country for so many years\nSo that it gives we used to walk through five foot of snow to get to school\nRight now to graduate on time [laughter] I Know I had to walk uphill both ways at fifty five now on WGN [noise]\nOn the next bill that one time show will get into all the hot issues in the day after three on super talked Ninety nine seven [noise]\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nIf you're drowning in debt you can't afford\nTo not let the credit card companies trick you into thinking that you have to pay it all back\nThe credit card companies don't want you to know\nIs that there's actually a way to get debt free\nPaying off your entire debt\nIf you have five thousand dollars or more credit card debt\nNow have the right to let a settled that debt for a fraction of what you will\nFree information coal credit associates now one eight hundred nine five seven nine seven four six will even show you how much money you could save\nIf you can't afford to pay off all your debt\nNot let the credit card companies trick you into thinking that you have to\nCall credit associates now for free information on how to get debt free faster than you ever thought possible without debt consolidation or bankruptcy\nDepend on your success it offer a guaranteed\nFor free information cold now one eight hundred nine five seven nine seven four six that's one eight hundred nine five seven nine seven four six one eight hundred nine five seven nine seven four six\nAre veterans were there for you everyday to ensure our way of life [noise] let them know weekend joining me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vets alone improve the lives of those who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much\n... V. E. T. to hate whole eat he ate a C. dot com\n[noise] from the genesis diamonds value to young traffic center serves\nHe tried to volley pick up on twenty four in the fall forty twenty four junction over on the west side of town I forty eastbound coming by by Lee parkway traffic starting to pick out\nStill working on this crash downtown but the ... is blocked it I forty west out of high twenty four towards filming Evans bridge again I forty west I twenty four so I've been spreads exit two eleven is blocked right now due to a crash\nAnd we're still dealing with a crash and burn older ... boulevard a Firestone parkway I'm Joshua Clay traffic every ten minutes every morning on super talk Ninety nine\nPeople joined ... to raise awareness and find\nThat change the world for everyone affected by multiple around\nWalk him aspirin communities together\nCreated ... ... ... and ... to rally around those we care about\nTogether we can change the world\nFor people with them [noise]\nAt ... dot org\nOr zero eight hundred million Capital Management whether ...\nHere's your forewarn weather forecast mostly cloudy and warm today would spotty rain showers high temperature eighty two more rain likely for time tonight low fifty seven so much cooler at high tomorrow Seventy with a strong northwest win for the for and whether center a meteorologist and Thomas\nNeal knows signed up for the two inmates who escaped the adult detention center in Murfreesboro this morning we'll update you on that and other top stories it's six on super dog ... nine seven WGN\nAll right let's look very quickly at the for the free market trading Dow futures up six there shouldn't be futures on James NASDAQ futures down six and a quarter\nRoger my beacon Capital Management of the more we can see 'em dot com coming up in a moment the swamp update Nikki Haley Milan yeah Kavanaugh all had big\nThings happening yesterday I'll give you the details it's now six o'clock in Nashville, Tennessee [noise]\n\n\nAnd and you're gonna laugh at me or some of you will because you think wow really that doesn't seem right\nIt is not for many people who are if you're good and you're honest and I think she is public services not very profitable [noise] you know you say well she's making a hundred and sixty seven thousand dollars a year\nAs the UN ambassador I got to tell you a ... and ... and I know for many people who are struggling on thirty forty fifty thousand dollars a year you say well hold on a minute hold on a minute that's good money\nIs if you don't have to live in New York City or it is if you don't have to hold onto your house back in South Carolina and in the grand scheme of things you wind up in many times in public service\nUh in debt and buy some accounting she has a million dollars in debt it was explained to me I won't\nI won't go into the whole story I'm told it before but I I won't go into the whole story\nBut I asked somebody that I knew very well in Washington look what an honor to be chosen for this job that you have in government\nI mean you know how ... how wonderful it is to serve at the pleasure of a president to be in the in the car doors of power to walk into the north west gate every day of the White House and go in there and do the people's business and I mean what an honor and how exciting at the pinnacle of power\nBut I also know how much people who work in in these these jobs make\nAnd and by Washington and New York state and not a lot lot of money if you've already had some success in life and you get chosen for one of these jobs you're taking a pay cut\nI mean you are a\n... there was a time when somebody said hey well said would you like to be the press secretary I said no I mean they never never came in the way of a form of life but people are just out of ... would you ever want that job it is and I couldn't\nI couldn't afford to take the pay cut I really couldn't\nAnd so I mean I I look at these John and I would say wow they're not making a lot of money and I asked is this friend of mine who had gotten a very prominent job at the White House I said how are you going to be able to afford it\nAnd it was explained to me that you look at\nA time in public service as an investment in your future and others you you get this experience you get it under your belt and then and when you come out of that job because you have had the experience of working in the White House you understand things that you know other people do not understand because you've been on the inside\nYou have contacts et cetera whatever you wanna call it I'm not talking about lobbying particularly those guys but expertise you argue or in the year the furnace everyday and if you survive it you come out with a great deal of expertise that's valuable and the private ... private enterprise and the private market\nAnd so and the business world and so you get paid back\nAfter you come out and then so you you encourage debt while you're in there with the understanding that when you come out you're going to be more valuable commodity and you'll make more money\nAnd then you'll be able to pay off those debts and you'll you know in the long run you come out ahead I think that's what's going on with Nikki Haley by all accounts she was not very wealthy as the governor of South Carolina a and then you get put into a job where you know really it's pretty easy to run up some debt\nAnd I think she just wants to get out and and talk about our future think about her family's future and get out of debt and I who could blame you for that\nSo that's my theory on it there are others who have looked at it and said that this may be the motivating factory I sometimes it's something very simple and that it could be that you're there you love what you're doing but at the end of the day you just can't continue to take the hit\nAnd and again I understand for people who are struggling to make it how that sounds outrageous but I'm telling you when you when you operate at those levels\nIt it it really is not that outrageous couple of other things happened in the swamp yesterday\nKavanaugh made his first appearance Brett Kavanaugh justice Brett Kavanaugh first day on the bench as a member of the Supreme Court an associate justice of the Supreme Court and he asked a few questions there was something that happened\nSomething that happened to my parents are very collegial little joking going on on the bench there between a Sonia Sotomayor\nAnd Neil Gorsuch at one point and Sonia Sotomayor reached over and\nPinched I'm not making this up pinched Neil Gorsuch\nAnd I thought well right there I mean that disqualifies or that's a that's an unwanted advanced that's that's that's workplace hostility is what that is I mean that that's a that's harassment she can't she can't possibly sit on the high court now\nAnd thirty five years this will be a thing I'm sure six Fifteen now on W. too you\nKnow listening to wash on Alexa say Alexa enabled the double duty and scale sends a play us say Alexa open\nCeiling are writing so I'm squeaking like lord marker\nOffice Lewis at most or we can't stop that noise but we can play it on the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of the smoker\n... eighty they must have talked to someone without noise today\nOn the line with dumped her son job [noise]\nI Love him to term or it was one of my favorite spices\nI'm Dr Sanjay Gupta CNN chief medical correspondent turmeric is a bright yellow sites that you can find in a lot of curry powder and mustard and I grew up with it living in an Indian household\nNot only does it tastes great I think what it's been studied for years and found to help with a wide range of medical\nAilments pointing to the age there are more than Fifteen thousand manuscripts than term with dozens Morgan published every week\nAnd there's good evidence that term work and helping phony teen from arthritis as well as decrease the likelihood of a heart attack after bypass surgery\nI reveal the medicine\nThey yell to use turmeric to help treat breathing problems inflammation team and maybe something that helps prevent certain kinds of cancers even and they want to be clear you can't cure cancer or infertility we're all time has gone back to Sunday group that\nHelping you live a better life\nData rate applied guys\nIsn't Nineteen Seventy keeps your hair and your confidence because bosley\nAmerica's number one Harris to ration expert can give you your real hair back\nCheck 'em out today because they're giving away an absolutely free information kit and a free gift card to everyone who tax easy for four to eight five eight five zero\nYou don't have to look like your dad because this isn't your dad's hair loss treatment\nAll over the country trust bosley because they're ahead of the curve\nUse the latest technology to give you your real hair back\nBosley permanent solution is protected by the bosley guarantee\nLet them show you for free how awesome your hair could look with an absolutely free information kit\nAnd a gift card for two hundred and fifty dollars off\nText easy for four to eight five eight five zero ask about the bosley guarantee\nS. Y. for four to eight five eight five zero\nSon Alex belongs to act and as a lone rant girlfriends long [noise]\nHow can he can only can no amount hunter\nOf the ones that carry with them every game\nBond with their life knowing you can see the new young girls or for the facts on right now he says he come all the time [noise]\nFrom the genesis diamonds sell you T in traffic setter\nDirect downtown has been cleared up and I forty west found that the twenty four forty split toward Sylvan Evans breads all lanes are back open to the ramp\nIs still dealing with a couple of different ... one in la Verne it'll degree boulevard a Firestone parkway and the new crashed with a shoulder blocks that twenty four he's found at the full forty twenty four junction I twenty four going past bell rather than Antioch starting to see some traffic volume pick out\nAnd it's starting to see stop and go traffic on the twenty four forty split leading into downtown due to a wreck from earlier the supporters budget by farmers insurance from a bear messing up a car interior to a deer damaging a pool line or they've covered it talked to farmers insurance we know a thing or two because we've seen a thing or two I'm Josh ... traffic every ten minutes every morning on super talk Ninety nine friday dot com [noise]\nCapital Management weather's here's your forewarn weather forecast\nMostly cloudy and mourn today what spotty rain showers high temperature eighty two more rain likely for a time tonight low fifty seven so much cooler at high tomorrow Seventy with a strong northwest when from the foreign weather center a meteorologist and Thomas\nTheir next chance to win a thousand dollars is coming up at eight oh five eight four day right here on super ... Ninety nine seven some tea [noise]\nVoting News I'm Brian Wilson and a\n... a ... in the news [noise] you know have\nWe ever had a more beautiful first lady and she really just disgraceful and she makes it look so effortless\nWestwood One podcast networks obey radio which donor in John Melendez you know\nAnd you saw somebody will be a sort of [laughter] because Americans over like the new thing is going to be ... [laughter]\n...\nLearned is not in ours lexicon than softball sooner in John and Jackie to job man on the radio downloaded free and easy on demand wherever you get your ... from the west was won pod cast network\nSeven PM\nInformation few up being in the ... is that bill is news and talk leader super taught in Ninety nine [noise]\nI'm Jen Weaver with your time stories and we have the full forecast the timeline on this\nCool off coming up in just five minutes along with the traffic report meanwhile Florida governor Rick Scott just wasted time has run out to evacuate the coast ahead of hurricane Michael\nHe's telling his people first responders are not going to be able to help if you chose to stay and ride out this storm hurricane Michael update coming up and just one minute meanwhile the ... county jail break this morning the sheriff\nSays those two inmates could be armed with homemade weapons\nAnd if you see them call nine one one immediately you can go to our Facebook and Twitter pages for photos of Duane half acre and Jonathan Baxter the sheriff says over Ballard agenda this morning around twelve thirty\nAnd then that climbed over the razor wire fence around the adult detention center there are new Salem highway and Murfreesboro several law enforcement agencies with the help of a helicopter and canines are helping to get these guys back into custody\nHalf acre and Baxter last seen wearing white tee shirts and orange pants\nHere in Nashville a fourteen year old boys under arrest was murdered last night outside one thirty Nashville greens and police say that boy shot another fourteen year old boy Giovanni Hernandez died a Mariano Johnson was taken into custody with criminal homicide charges he's in juvenile detention\nBack to hurricane Michael now high winds heavy rain the storm surge underway among the Florida coast where hurricane Michael's bearing down it's a category ... storm may go to a cat by by the time that make landfall today Chad Myers says there will be more threats after that\nAll of the storms that role on shore here will have some twist to them many of them could come onshore with what we call it a water spout but it turns into for Maydel actually when it hits land probably enough one enough to\nPresident jumped declaring the state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response is\nMeanwhile the federal report says Defense Department weapons programs are vulnerable to cyber attacks and the Pentagon's been slow to protect the systems which they say are increasingly reliant on computer networks and software\nIs report says testers using simple tools and techniques were routinely able to take control of weapons systems under development without being detected\nHomeland security secretary Kirstjen Nielsen and FBI Director Christopher Wray expected to address this issue and others during testimony today in the Senate threats to homeland hearing elsewhere in Washington DC\nSenator Mitch McConnell says it was just Brett Kavanaugh was first day on the job as a Supreme Court justice and those who oppose this confirmation are already trying to get them out\nOne color pressure verbs already tried to circulate ... drug drug discovered all your million pay\nRepublicans continue to denounce those who protested the cabinet or nomination saying they used a mob tactics bullying and intimidation\nMcConnell ads the issue will drive Republican voters to the polls in November but Democrats say their bases energized too and they expect their constituents to turn out in record numbers Lindy Kenny I'm washing\nCannot President Trump on the campaign trail in Iowa last night said Democrats have gone to extreme too dangerous to govern\nDemocrats are the party of crime [noise]\n\nPopulations are the party of safe [noise] we are also the party of jobs jobs jobs\nNow since the president rallied for Marsha Blackburn US Senate run here in Tennessee of CBS News poll shows is she a surge eight points ahead of Phil Bredesen\nBlackburn Bredesen debate tonight in Knoxville there was a warning about the economy this morning from the international Monetary Fund Scott ... is the one hundred eighty nine nation member fund worried another global financial crisis might be brewing\nThe IMF warns but further escalation of trade tensions combined with rising geopolitical risks and uncertain policies and major economies in particular an unstable exit from the ... by Britain could trigger abroad correction\nAsks the latest news ... by farmers insurance trafficking whether next on Ken Weaver W T kind of everything\nFrom the genesis diamonds value to young traffic\nSetter stars these drafted vowing pick up what I sixty five more than going into Thompson's station pass a forty but the real traffic volumes they have a twenty four west ... that backup is from Del Rio de Thompson weighing on my twenty four story you want to crash and Barry ... sixty five south out of the full forty sixty five ...\nAnd also and I twenty forty thousand full forty splash shoulders blocked\nAnd just picked up in Iraq and Madison a gal from black south of nearly bans road I'm ... traffic every ten minutes every morning on super talk Ninety nine\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar cheer on line MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine\nThat's repaired dot com and the median Capital Management weather's okay here's your forewarn weather forecast\nMostly cloudy warm and humid today would spotty rain showers high temperature eighty to\nA few more rain showers this evening the turning much cooler after midnight low fifty seven very fall like tomorrow high temperature in the upper sixties a strong northwest when Senate twenty ... twenty five we'll make it feel even cooler down to forty four friday morning in sixty five friday afternoon for the for the weather center\nYou'll see when our ... we are and more\nYou know if you've done clots um squeaking board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise you were talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to see one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for a fair price real human being human how's that sound\nWell probably like the opposite of the smoker [laughter]\nCalled eight eight eight months to to talk to someone without Louis today [noise]\n\nThirty eight on national morning news or [noise] just to bring up to date very quickly of course we're watching hurricane Michael\nNow that's not the guy that comes in at nine o'clock\nI Know that's that's Michael Dell drawer no\nAh this is a a hurricane that's that's bearing down on the Gulf Coast of Florida category four hundred and thirty hundred and forty all wants ten miles an hour among friends are\nMoving into the area I into the Big Bend area of the Florida Panhandle just to the east of Panama City ah Thirteen foot storm surge many many many many inches of rain\nStarting to interact now with the coast it's supposed to come ashore about one o'clock or the entire area where I was under mandatory evacuation\nBut even as the show or is this storm comes ashore and moves across Georgian over to the Carolinas\nA is expected to still be a category one hurricane\nSo this is one not to play with an one will watch very closely but as they say there's never been in that category for storm in recorded history and the Florida Panhandle this one's going to leave a mark I mean the last time they had a I think I category too they had billions of dollars worth of damage and this was a category four so this is\nBad on break also locally closer to home rather for county Murfreesboro a couple of bad guys couple of baton Braves on the loose the way and a half acre Jonathan Baxter broke out of jail [noise] and I shouldn't be\nOver power to guard sorry about that I climbed over the razor wire and got out of the jail and that is so the police are looking a an intensely through that area for these to escape ease be alert keep your head on swivel\nDon't be focused on your iPhone be focused on what's going on around you okay\nI said earlier that or if you define the language you often defined the debates and no one is better at this than the Democrats they often tell us the words that we cannot say or that we cannot use I mean for example is to talk about the abortion debate\nAt a fifty year low\nI mean and here in middle Tennessee even lower than the national average we are well at full employment in this area the economic engine is grinding away at full speed we have good GDP um we we are we are we have wages that are\nGoing up businesses are optimistic consumers are optimistic because things are good they got jingle in their pocket got money in their pocket going ... that's right they do um we have to conservatives\nThat have now been placed on the Supreme Court guaranteeing a conservative high court for at least the next Twenty years North Korea peace it may be on the horizon yesterday secretary Pompeo said he sees the pathway still a long way to go but we're making progress there\nRight I mean our past presidents just threw up their hands on and on what we can do about North Korea we can't do a darn thing about they're sending all miss when's the last time they fired off a missile I ask you is that not progress um and and you know again I run all boxed them they're not able to do anything\nWe are standing up to China on the world stage which we needed to do for a long long time so all of those things I look I go man if if we're going to have a vote on the Trump presidency there's a record to run off especially the economic record\nYou know the old saying Ronald Reagan saying how you're better off than you were two years ago yeah\nA lot of people are as a result of the policies of this president deregulation of business a sprint taking the chains off of industry so that so that the economic engine of this country could do what it always does the free enterprise system will work if you just let it and Donald Trump knows that\nIt's a lot of stuff going on the very positive are going to have a referendum on this presidency I mean I'm ready to do that however\n[laughter] and here's the big here's the big the mainstream media are not telling that story listen to this according to the media Research Center\nA they have done a study let me see if I got the the statistics are they studied a thousand and seven one thousand and seven evening news stories that's about Nineteen hundred and sixty minutes of air time about the Trump Administration on ABC CBS NBC\nFrom June first of September thirtieth and you know what they found\nNinety two percent of that coverage was negative\nI Want to say that again they they studied a lot of hours of television network television news and Ninety eight percent of it was negative\nThat's right well how can you how can you possibly\nHow could that possibly be fair or ride when there's so much good that you could talk about but you don't talk about it at all all you do is you you continue to talk about investigations by the way that are going nowhere\nOr and and this that and the other and you you ignore the great story is that most Americans are better off\nTwo years ago so I say must have that conversation but let's do it honestly not likely of course we're talking about the mainstream media six fifty three now on WGM [noise]\nOn the next bill that one time show will get into all the hot issues of the day after three on super talk Ninety nine seven [noise]\nLast year the Dow Jones industrial average was up just over twenty five percent everything was so good even the self help experts were giving out investment advice\nBut you also saw a lot of fear fear of missing out in fear of crashing\nBut here's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty teens year that you keep fear out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help this for ... not your financial security and retirement\nGet to financial engine dot com today [noise]\nHi I'm Scott bureau of financial engines here in Nashville and Murfreesboro I'm ready to work with you to help make your financial goals are reality go to financial engines dot com or call six one five seven seven eight three two three two today [noise]\nHello this is Chris moslem with Marlins optical service\nWhere your national optical experts family owned with Ninety years of experience\nOr one and only goes to help you look and see your very best all with the help of are highly trained fashion expert\nWith the speed of our Marlins intel laboratory in large selection of fashion frames\nCan guide you to your best work with quality wins this battle budget is\nWe also replace lenses and frames not even purchase from us\nIs with us today one of our too convenient location screen hills in any would or church street in midtown St Thomas hope to see certain\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nFrom the genesis diamonds WPN traffic center\nSeeing the majority of the volume on twenty four west ... starting from Sam really parkway leading up to the twenty four full forty junction\nWe are still working on Iraq there twenty four and four forty keep in mind the shoulders black hair and I twenty four\nAnd also working on a crash and Barry hill I sixty five south out after the sixty five full forty junction or get on an injury crash right now is older every boulevard Tobar woods dry that's just south by twenty four and a ... story on that racket out the pike south of new lease band wrote I'm Josh ... traffic every ten minutes every morning on super talked Ninety nine\nZero in on running so I'm a squeaky ...\nIt's going off his newest at most or we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they'd mustard to talk to someone without noise today\n... Capital Management whether ...\nYears were forewarned weather forecasting mostly cloudy and warm today what spotty rain showers I temperature eighty two more rain likely for time tonight low fifty seven so much cooler at a high tomorrow Seventy with a strong northwest when from the ... weather center meteorologist and Thomas\nRather county is gave bees from the adult detention center in Murfreesboro may have homemade weapons and time has run out for blow at a residents to leave a head of hurricane Michael these stories and more than seven on super talked Mennonite seven WGN\nAround if you're just getting up and there's never been on a category for hurricane that hit the Florida panels long they've been taking records for\nA hundred and sixty seven years\nSo I'm gonna bring it all up to date on hurricane Michael and we're going to also get the update of course during the news on these are bad ... desperadoes that of escape from the jail and rubber county and are on the lam police are looking is a very busy morning stay right here with Nashville's morning news this morning that you don't want to go anywhere\nRight now it's six fifty nine on WGM [noise]\nOur veterans who were there for you everyday to ensure our way of life [noise] let them know we are joined me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no vet alone improve the lives of\nThose who have served our country\nPlease show your support and text V. E. T. to eight eight eight eight and give back a little to those who give us so much ... V. E. T. to eight whole eat he ate\nDid you know that there's a hidden time bomb and your portfolio it's they're waiting to diminish the value of everything that you worked so hard to saint to leave you with less than you deserve called inflation like\nTermites in your house it quietly erodes the value of your portfolio so over time you barely noticed but over Twenty years you can cut your purchasing power in half\nIf you manage your own investments inflation may not even be on your radar and if you have too much of your money and bonds and cash your portfolio might lacked the growth that you need to combat don't short changed your future\nCoal financial inch our advisors can give you a second opinion or build you a financial plan to help make sure you don't run out of retirement savings put us in your corner in on your side today [noise]\nMir heads but um this one looks like it's gonna it's gonna hit us head on now with a hundred thirty forty forty five maybe a hundred and fifty mile an hour winds so\nI'm hopefully\nThe the majority of the population um you know we're talking about a hundred and um anywhere from a hundred and fifty to a hundred and eighty thousand people spending on how you doing\nDefine our our market here but I'm hopefully the most people have hated the warning and gotten north\nUh your way to Birmingham to Atlanta to New Orleans wherever they have family and friends them because I I think the people that are stay behind especially those anywhere near the beach or that they are really going to regret that this is\nSo now you you said that you read the EOC helping out with the coverage what are they saying there [laughter]\nI I'm at the ... the um the last official\nBriefing we got was at five o'clock central time yesterday and a mark Bowen is the ... the chief and I and there were some county commissioners and or the bay county sheriff Tommy Ford\nSpoke as well as the representative Neal done to hate the Republican who represents district to here and in Congress are all three of them spoke and I've never heard\nLocal officials found so deadly serious in any kind of briefing as as cheap fell and put it this storm surge will kill you the wind will kill you\nPlease get out and and this was as again as a five and talk I'm Tuesday evening he said the time to get out yesterday\nHe said but you still have time to\nUm to get out today and tonight and I again I ... I Hope people heeded that warning because um this really is as a killer storm and and fewer people in its path that better\nNow of course you're you're trying you know you weren't your TV station is trying to stay on the air and it's not far from the water's edge as I recall so how how is that going\nRight at anybody that might be familiar with Panama City beach ah I I I work for W. J. H. G.\nAnd that's the NBC affiliate hair and and Panama City and for this market which includes the you know Walton county and uncle Lucie county Washington County Jackson County to the north of us bake county is is in the Senate were Panama City is\nAnd we have golf and Franklin County to the east than kind of southeast of it's a lot of people know report and Joe and Appalachia cola are\nA Calhoun County as well so we cover um the better part of eight or nine counties and a ... ... ... it's just a a a a lot of people have not been to a ... a major hurricane and and so a lot of people I think have that\nKind of a sense of security that that that's not the\nRight thing to have you been in the last time there was a major hurricane many years ago billions of dollars of damage and I think you'll agree with me\nMan if you've been down to Panama City you've been debate county you've been to Walter in county ... there's been a tremendous amount of growth and it could tremendous amount of ... or there's a lot more people down there them now than there were then\nYes there are and and and you're familiar with south welding county a lot of probably a lot of your listeners are and there's this stretch of road called thirty eight that runs east and West I'm\nA along the along the Gulf of Mexico and along the beach there and and like you said the construction over the last\nTwenty years has been a an exponential so and those places we're all in a mandatory evacuations a ... a B and C here in Bay county which is pretty much everything coastal\nI'm zone C is actually surrounded by zones a and and they and\nThe sheriff's office and the law enforcement an emergency personnel\nI've been telling people like if you're in the even though you may not be flooded your going to be cut off by waters to the east and monitors to the west or waters to the north so we're not going to be able to get to you in fact are among the shares a bake I share spokesman er just did a a little briefing with us live\nAnd and she said there is you know people need to understand there is going to come a point in the next few hours\nWhere it's going to be too dangerous for the first responders to get to you and she said and there's nothing worse than being able to take these nine one one emergency calls and knowing there's nothing we can do for you we are not going to send out that the the EMS we're not going to send out a a kind of share them they county sheriff's officer Panama\nCity beach in college at some point it's a dire situation\nPuts people first responders at risk okay so very quickly once you're playing you're in the EOC to stay\nI mean he has said the operations center which is on kind of a north end up bake county it's on some high and dry land and this is a um a building that was built just in the last five years it's a thorough\nUm concrete block construction and uh so I feel safe and uh you know but uh like you said that you made reference to the folks that at my ... front page road\nLast we heard they were they were making plans to evacuate keep and bear skeleton staff bombs that will probably be broadcasting from the E. S. C.\nAh once this storm or a ... gets here\nAll right Scott Ross when my good friend uh my thoughts and prayers with you and with all the people down there on the Gulf Coast today I'll be saved my friend\nThank you very much\nAnd we and if you don't mind we made chicken with you again because you've been very helpful greatly appreciate\nYour average as as long as long as I have cell phone service out I'll answer your ...\nMan thank you greatly appreciated a that's Scott Ross ... with a W. J. H. G. and on and ah Panama City beach the NBC affiliate he's literally after bunker where those officials are monitoring\nAnd he's got his finger on the pulse of what's going on we we'll check in with Scott again\nAt some point again as we say as long as the cell phones continue to work right now uh I'm I've been checking my piece of property down that way on thirty am I still have power I still got Internet because I can see my security cameras on my on my cell phone so it's so working but I mean we're in for a bad day it's about one o'clock\nOr and it will be you know the the the the strongest expects come onshore just to the east of Panama City a\nHalfway between I'd say Panama City in Appalachia cola if you know the region but when you have a hundred and forty mile an hour wins a huge area is going to be impacted by that seven to Seventeen now on double duty and\nLet me tell you about national got a knife or here in Nashville a it's a place where you can get a knowledgeable help it's a warm friendly place or they're going to help you find the right weapon\nWhether you need one for home defense concealed carry hunting play sports competition whether you want a pistol revolver and rifle are shocked by the way it gets you shut down an order hunting season bright you know you got to get ready for that um whatever you need they've got a gun Smith right on on side who will help you get your gun working in top order just like new\nIt's a fifty seven oh three old Harding pike and bill me open tend to six on weekdays nine to six on Saturdays I listen they're good people and if you need help there is a way to go fifty seven was thrilled Harding pike learned more national gun a knife dot com\nNow to wash on Alexa say Alexa enabled the double duty and scale and the players say Alexa open\nYou'll see when our earnings growing up we earn more [noise]\nYou know if you've done costs um squeaking board marker [noise]\nEasily one of the most annoying office news is there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAnd most are we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job site strenuously one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees in dress those needs with the right solutions no more\nNo less just more people getting to know your business was simple personally solutions for a fair price real human being human how's that sound\nWill probably like the opposite of a smoker [laughter]\nCall eighty eight months to to talk to someone without Louis today\nHi I'm Jackie ... some comfort shoes if you have put pain or discomfort in most cases it's related to inadequate\nAnd southeast is how I twenty four west on Harding place I forty west bottom Wilson county Hartman driveway of Iraq and also west of town with the shoulders box that I forty east out Charlotte pipe\nDowntown I forty west ... street we have an accident with the shoulder box and an injury acts that old hickory boulevard October would drive I'm Joshua Clay traffic every ten minutes every morning on super talked to some other\nBeacon Capital Management weather here's your forewarn weather forecast mostly cloudy and warm today would spotty rain showers high temperature eighty two more rain likely for time tonight low fifty seven so much cooler at high tomorrow Saturday with a strong northwest when from the foreign weather center I mean the\nNCAA has turned Twenty years old and we are so proud to serve middle Tennessee I'm shooters Don prisoners in ca since Nineteen Ninety seven and we have monitored thousands of homes and commercial businesses\nTo celebrate we want to give you a special offer when you call in and set up a new account with NCA Michener license number six four or five and you will receive three months of free monitoring on your account or a free digital cell dollar that is a Ninety nine dollar value\nOur land line monitoring is just not any of the month and our cellular monitoring also known as wireless is only Nineteen Ninety five a month\nSince the opening of our doors NCA has never increased our prices at NCA we can divert your existing system or install a new one and you still get local or monitoring and top customer service for great price NCAA also has no long term contracts just month to month call us today at six one five\nSeven seven seven seven NCA that six one five seven seven seven seven six tutu or go to our website at NCA dot C. C.\nHey it's Pamela for her I'm going to tell you about my friend Kevin at the Amish mattress Sharon he the only one I buy mattress in front of you should do\nAfter you work all day your body really means at good rest\nDon't settle for an okay night's sleep when you buy an Amish mattress rest assured you'll get the deep sleep Ukraine pun intended I forty burns eggs at one eighty two are called for five or six eighty six fifty for next year to mention super talk and get a twenty five percent discount Amish mattress shattering you deserve the raft dot [noise]\nInformation view\nBeing driven the these bills news and talk leader super talking in Ninety nine [noise]\nI'm getting we've uh with your time stories\nWhole forecast traffic updates in five minutes and it looks like hurricane Michael is now just twelve miles per hour we're talking about wins twelve miles per hour away\nOf reaching category five string got a full report coming up in one minute\nNow to the other for the county jail break were two inmates on the run after twelve thirty this morning overpowering a jailer and then climbing over the razor wire fence around the adult detention center there are new say them highway\nThese two inmates to wane half acre and Jonathan Baxter last seen wearing white tee shirts and orange pans may have homemade weapons with him\nSeveral law enforcement agencies with the help of a helicopter and canines or helping to get these guys back into custody we posted photos of numbers to call on her Facebook and Twitter page is\nIf you see them coal authorities immediately\nHere in Nashville a fourteen year old boy is under arrest in juvenile detention John's with criminal homicide\nAfter last night's murder of another fourteen year old boy Giovanni Hernandez was gunned down in the street outside one thirty Nashville greens a Mariano Johnson is in custody\nHurricane Michael an extremely dangerous category ... storm but as I mentioned is only twelve miles per hour away number talking about wins from becoming a category ... storm\nAnd it still headed to the northwest Florida coast here to admire\nThe wind is going to be a big deal a hundred miles per hour or stronger for a very long time and not just for the coast this isn't going to die five miles inland Tallahassee in being tied danger to day as it moves inland\nPresident Trump's declared a state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response is speaking to federal response to disasters\nHomeland security secretary Kirstjen Nielsen an FBI Director Christopher Wray will be among those who will testify about current an emerging trips including cyber security I'm hocking my international groups Russian interference in the two thousand sixteen elections and in the upcoming may terms also are expected to top the discussion\nHas wanted to Kenyon reporting more than one hundred children to have been found safe in Michigan during a one day operation by the U.S Marshals Service the initiative took place September twenty six in Wayne County Michigan were three cases were identified as possible sex trafficking one homeless teenager had not eating for three days\nThe missing child recovery unit says the message to families and missing children as we will never stop looking for you it actually twenty eight team President Trump on the campaign trail in Iowa last night said Democrats are too extreme and dangerous to govern he says they've gone wacko\nThey've gone so far left that they consider Pocahontas to be a rational\nFirst [noise] [noise] [noise] oh I Hope\nTo run off that we can finally get down to the facts as to whether or not she has ...\nNow since the president's rally in Johnson City of CBS News poll shows Marsha Blackburn is their data points ahead of bill reticent and the tendency US Senate race like burning reticent debate tonight in Knoxville elsewhere in Tennessee reports of a true life nightmare at a place designed to scare you in Madison\nThere happened though to Halloween attraction travel five reports a group of friends went to be read a woman to bully some men are the costume approached\nUm concerning the male friend with the man using ... to ask if he was messing with her she jokingly said you ask the Manhattan or a knife injured stabbed him figuring it was a ... knife she did\n... blood broke his arm German shower WGN new\nNow that happening at the Nashville nightmare Halloween attraction and Madison and that's the latest news broad you buy the Tennessee Air National guard trafficking whether next on Ken Wieber W T\nLast year the Dow Jones industrial average was up just over twenty five percent everything was so good even the self help experts were giving out investment advice but you also saw a lot of fear\nFear of missing out in fear of crashing\nBut here's the thing here is an emotion not an investment strategy if you're making your own investment decisions emotion plays a role whether or not you realize\nSo make twenty teens year that you keep fear out of your portfolio make an appointment with a financial engines advisor today and get a solid logical financial plan for your future one that helps take some of the fear out of the equation because self help is for ... not your financial security and retirement\nGets you financial engines dot com today [noise]\nHi I'm Scott your financial engines here in Nashville in Murfreesboro I'm ready to work with you to help make your financial goals are reality go to financial arrangements dot com or call six one five seven seven eight three two three two today\nFrom the genesis diamonds tell you\nIn traffic center I think the five north than seeing a good amount of volume all the way in Franklin from Murfreesboro road leading up to the full forty sixty five junction and very health also and I think it's five south on the sixty five twenty four split leading into downtown\nAs well as I'd like to parkway leaning towards springs drink plenty of volume there twenty four west bound still a bit of a mess from same really parkway all the way to the twenty four full forty junction sing back that traffic and working on several different wrecks on my twenty four one on twenty four west on old for parkway and Murfreesboro the right lane of the ramp is blocked\nAnd also still working on a crash ... twenty four west on a Harding place west of town I forty east of Charlotte pike the shoulders blocked their due to Iraq and also be on the lookout for crash in Wilson county I forty west valley south Hartman drive I'm Joshua Clay traffic every ten minutes every morning on super talk Ninety nine [noise]\n... Capital Management weather's here's your forewarn weather forecast\nMostly cloudy warm and humid today what's funny rain showers high temperature eighty to\nA few more rain showers this evening the turning much cooler after midnight low fifty seven very fall like tomorrow high temperature in the upper sixties a strong northwest when ten to twenty ... twenty five we'll make it feel even cooler down to forty four friday morning in sixty five friday afternoon from the foreign weather center\nNumbers and go to ... when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with aids list male Macs\nA patent pending formula with an agreement that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first thirty day bottle free not ten days not Fifteen days but the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just pay shipping and handling\nFiling a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decrease use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\n[noise]\nSeven warning on Nashville's morning news and a\nI Want to bring him on this rather for county situation early Wednesday morning twelve forty we got a couple of bad guys who broke out of jail\nAnd I don't mean to be rude here and I don't mean to be prying into people's personal business but I mean and when you're when you're a public figure you have to file these filings uh let me know what you're where you are investment wise and where your investment there's this you can find that there isn't any conflict of interest\nAnd what we know about Haley Nikki Haley is that she is she's in debt\nAnd that's not unusual for people\nWho take a public service job and and and for go the opportunity to go out into the free enterprise system into the private market\nAnd and and try to make a living and because I'm gotta tell ya and everybody's gonna I'm no I can hear it now Wilson what are you talking about she makes like more than a hundred and sixty thousand dollars a year that is not a great deal of money if you want to hold onto your house back in\nThe state of South Carolina\nIf you want to live a life in New York City I mean just operating in New York City is incredibly expensive and although I Know there there are benefits to being the the ambassador's view and you still spend a lot of money [noise]\nUh and you really don't make a lot of money and a lot of people I Know have walked away from service jobs and the government ... positions of honor or because they just simply couldn't afford to take the hit and there comes a time when you got to think about you know putting the kids to college and retirement and all of that\nAnd so I think when you she's got a million dollars worth of debt not uncommon\nAnd here's the thing when you do public service like that when you go and you take a job inside the government\nAnd you work at the pleasure of the president is is often understood that you will go into debt because but understanding that when you come out of that position you will be eminently more marketable you are a commodity that would be desired by many people in private enterprise\nAnd so I think she's just decided I've gone as far as I can go I I Love the job and I love I Love this president but quite frankly I've got I've got to start looking out for my own future she's never going to say that publicly honestly\nWhen I talk to people who make these decisions to work inside government positions of real honor and real power they just don't pay very much and the grand scheme of things and I think money is what is driving her to make this decision and that's my guess\nAnd I guess you'll never know for sure but it certainly does seem to add up that way\nSo there's the end of that mystery huh seven fifty three on W T and assisted family care listen the Eighteenth of this month is a date that you need to take note of because after the Eighteenth of this month it will be harder\nTo qualify for certain VA aid and attendance benefits\nThey're going to change the rules so if you think you might want to help out someone who's a veteran wartime service needs a little help now around the house needs somebody to help them with their with their errands or or keeping keeping up with things\nYou need to apply now because as I say on the Eighteenth of this month\nThe rules change and it gets a lot more difficult and who can help you with that assisted family care they have years of experience and cutting through the red tape\nTo help veterans receive benefits when eligible then they connect you with the most responsible compatible helper or the ... with the daily needs you may have\nMaybe you're a parent and you have someone you're taking care of maybe you could use the help caring for loved ones can be very challenging assisted family care can help here is the number six one five eight three three nine seven two five\nThat six one five eight three three nine seven two five learn more at assisted family care doctor [noise]\nOn the next building at one time show will get into all the hot issues of the day after three on super talk Ninety nine seven [noise]\nWeapons and go to ... when did it become OK for men to be lazier softer fatter\nWe need to bring them in this country back to greatness with aids lists male Macs a patent pending formula within agreement that helps boost your total testosterone promoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus and amazing sixty four\nAn increase in nitric oxide which can be handy in the gym and in the bedroom\nTook your manhood to the max dry your first dirty diaper bottle free not tend to not Fifteen days for the full thirty days supply free when you text the word quick to Seventy nine Seventy nine Seventy not just pick shipping and handling\nFiling a formula that boost total testosterone if you'll results with age was ... to invest please decreased use for your free bottle text quick\nTo Seventy nine Seventy nine Seventy not text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nZero in on running a squeaking white board marker\nAssuming office newest at most or we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price has that\nReally sounds like the opposite of this marker\n... eighty they'd most are to talk to someone without noise today\nOr life with Dr ... [noise]\nIf I were to put you on the spot right now would you say is your life's purpose\nI'm Dr Sanjay Gupta scene in St medical correspondent guy is a Japanese term that roughly translates to a reason for being more sense of purpose some say it's part of the reason the Japanese live so long I've heard it described as the intersection of what you love what you care about\nAnd Muslim world me All right I'll let you off the hook if you don't know you guys don't worry it should take time sometimes your whole life to figure it out when you discover it you'll know it because you'll feel it\nSometimes that means cutting back and other things you used to do to make time for your guy but it's worth\nStudies have found people with the guy gets better sleep in their own generally better health\nA good way to think about it if money were no object what would you regret not doing on Dr Sanjay Gupta helping him live a better life\nWe make it happen from the genesis diamonds value to young traffic center\nI've already westbound still see in a good amount of traffic volume over on the east side of town for by the parkway going into the twenty four forty split downtown\nAnd also when I sixty five south that after the sixty five twenty four split leading up to trinity lane still working on a couple of different racks a couple of them forty forty east by the Charlotte pike on the west side of town the shoulders block there and also been the lookout for Iraq in Wilson county I forty west out of South Park and Dr\nStill working on an injury accidental degree boulevard October ... drive\nAnd also be on the lookout for crash a highway one hundred a month gap wrote I'm Josh will clash traffic every ten minutes every morning on super jock Ninety nine ... dot com\nBeacon Capital Management weather's here's your forewarn weather forecast mostly cloudy and mourn today would spotty rain showers high temperature eighty two more rain likely for time tonight low fifty seven so much cooler and high tomorrow Seventy with a strong northwest when\nFrom the foreign weather center meteorologist and Thomas\nAdded the two rather for county is gay bees from the detention center in Murfreesboro to the top ten most wanted list and Florida is bracing for one of the ... say will be the worst storm for Florida in a century these stories and more date on super ... none of nine seven WGN Dow futures down Seventy eight ... will be if you're just download a matter of fact\nYou're down forty two all screens or read at the moment this Roger by beacon Capital Management learn more it becomes the um dot com and update on hurricane Michael in all the other stuff going on and then and the swamp and elsewhere straight ahead right here on WGM niche now seven fifty [noise]\n\nThe west one gas network daily\nWires Shapiro's show here's this here's what FBI investigation duct tape a bunch of witnesses a bunch of questions [noise] those are for post ... under a thrill to you know what else can do that members of the Senate they can get people to buy a majority hell\nBent and she'll be Rochelle downloading subscribe and apple pie cash deeply and the west was won by August ... free from the west would one podcast network\n\n\n\n\nIf your child is sick over and over again it could be ... by a defect in the new system that affects millions early detection can get you a chance to dream Jeffrey ... twenty five years of helping children reach for their dreams\nThis is actually in for for the Idaho or call one eight six six improved for PI\nHenderson bail Nashville\nStudio we're talking about I mean I [noise]\nO'clock guns and we are with your\nTime stories timeline for the cool off coming up during the ... forecast in traffic in five minutes now hurricane Michael's wins or just twelve miles per hour shy of pushing it to a category ... storm got a full report coming up on it in just one minute\nFirst we have to get to the breaking news out her brother for county where the TV I has now added to escape ... from the detention center in Murfreesboro to the top ten most wanted list\nA three point seven percent\nBut ah you know there will be rebuilding that will go on\nA but really the thing I'm concerned about right now is loss of life\nBecause there are hard headed people I had a conversation with one yesterday\nDidn't want to leave a I can ... I'm not afraid of this storm I can ... I'll be able to survive thank goodness at the end of the day uh those people decided to get up and leave in the day they came to their senses but understand this\nStorm comes ashore I looked right now just to the east of animosity between Panama City in Appalachia cola and um\nIt it will continue on inland across Georgia as a category one hurricane what'd you know ... Tallahassee is going to take a big hit today\nParts of Georgia are going to be in a category one hurricane\nI means a lot of power lines are going to go down that's probably the biggest thing\nPower lines are the most vulnerable thing and when power lines go down I don't think most people understand what it's like I mean maybe maybe you ... well I guess you have been through it here I Am from time one time or another but when you're in a hurricane and the power lines are completely blown apart\nIt takes a couple of two or three weeks to put them back together or more you don't realize how difficult life can be you don't realize how tough it can be so here's what I always say to people at times like this\nTake a look at what's going down the coast and ask yourself hey if the power grid went out for two weeks what would I Do\nHow would I survive how could I get along do I have the things that I Need if something that we don't expect were to happen I mean I was down there this weekend and we didn't expect this it happen quick\nThere were a lot not a lot of time for people to prepare before they did the mandatory evacuation and it by the way if you didn't get out you weren't going to have a place to stay so people left quickly sometimes without having to do any getting to do any prep like me\nUh so I you know I understand it but think about it what would you do how would you survive what would you need to\nTo get along without power for two weeks\nI think about it takes water takes electricity to pump water so you're the pipes that come to your house it takes electricity to remove water [laughter]\nIt takes electricity to run the refrigerator it takes electricity to run a microwave it takes electricity for lights it takes electricity to get money out of the out of the ATM\nYou got money what are you going to do credit cards no good if there's no power takes takes takes electricity to run a credit card huge huge I mean unless you've been through this you don't know how difficult it can be so let's just all be sort of a lesson to us here in middle Tennessee\nThat as we look at what they're going through\nWe can send up our thoughts and prayers and hope for the very best for this part of the world that are so special to even people here in in middle Tennessee that they that they survive and they get by and and everybody's okay\nBut let's also take as as an opportunity to look at our own selves in our own lives to find out just how prepared are we should we face that unexpected thing that knocks out our power for a couple of weeks\nIf you study this matter a lot and I'm not a proper I I'm just somebody who likes to be thoughtful\nAnd prepared [laughter] maybe I Am a proper I don't know but but what I'm saying is think about these things most people don't take the time to think about them until it's too late and you know what I Want to be able to fend for myself\nI don't want the government to have to take care of me I don't know when the government's going to get there it's own me it's on you\nSo take them to take a moment now while we're watching what happens and perhaps make a few preparations of our own just in case hey if it ever happens great that's fan that's just gravy man if it did happen you'll be so glad you spend a few moments thinking about\nYour preparations aid fourteen now on WGN the accurate mortgage group has got a big deal coming up October twenty third Tuesday October twenty third from four to six out at Sanders very pizza in Henderson bill\nOr they're going to have a question and answer homebuyer event so have you ever thought well is this the time for me to get a it's a move to re fi all of those kinds of things have you got questions\nOr they got answers and they got by the way smart people there who will help you um listen Akron mortgage group good company people who get it done people who are experts\nYou wouldn't you and you're doing business like this you know when you're working on a mortgage or re fi\nThere are things that are absolutely can go wrong\nThey absolutely can go wrong and and and then they often do and and what matters is what you gotta company does not to pick up the phone and work through the problem with ya there cross that data dumped out either get it across the goal line and that's what you have with the folks that accurate mortgage\nSo why wouldn't you want to do business and by the way this whole mind fires have been October twenty third four to six you'll get a sense of that\nYou'll get real answers from people who know this industry inside and out find more about this a free homebuyers event apply online at accurate M. T. G. dot com that's accurate empty dot com the accurate mortgage grew up with the bishop ... mostly equalizing lender animal is numbers for six six for\nNow listening to us on Alexa say Alexa enabled than WGN scale and the play offs say Alexa open\nMarkets and go to rape me apply when did it become OK for men to be lazier softer fatter\nWe need to bring them into this country back to greatness with aids list male Macs a patent pending formula within a greedy and that helps boost your total testosterone promoting greater increases and muscle size and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first thirty day bottle free not ten days not Fifteen days for the full thirty days supply free when you text the word quick\nTo Seventy nine Seventy nine Seventy not just states shipping and handling\nFinally a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decrease use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine text Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine\nThe holiday is fast approaching we're gearing up for Nashville rescue missions annual radios on on Monday November twenty page Brian Wilson inviting you to join us for the one day of the year that we can all give back to this amazing operation that serves the needy here in middle Tennessee\nThey help over eight hundred men and women and children each day so please me a partner of hope this year in support Nashville rescue missions radios on on Monday November nineteenth right here on super talk Ninety nine seven WPN for more information visit Nashville rescue mission dot org\nLocal cat dealer from the genesis diamonds Sally beauty young traffic center\nRight now saying stop and go traffic when I sixty five south down after the sixty five twenty four junction leading towards the north flu and also over on the east side of town on my forte west bound heading towards the twenty four forty split downtown\nStill have a couple of different ... twenty forties found right at the four forty twenty four junction we have an accident and west of town the shoulders block tonight forty Spanish Harlem pie also be on the lookout for Iraq and I forty west out of south Hartman drive in Wilson county NFL court avenue Ethan twenty eighth avenue here in town I'm Josh Bill Clegg traffic every ten minutes every morning on super talking I mean I\nYou know new homes are more airtight this creates more indoor air pollution harmful\nGases chemicals allergens and other pollutants build up and\nGet trapped inside reaching unsafe levels CPA now ranked indoor air pollution as a top by the environmental danger let precision air test your air to identify the pollutants in your home and offer affordable solutions to clean up your air festival precision they're celebrating twenty five years surveyed middle Tennessee by offering it free air quality test with your springs up covered is a must\nSo called the experts you trust called six foot five eight three four three triple seven online at precision air T. N. dot com your local dyke and comfort pro Russian like on some other\n... Capital Management weather here's your forewarn weather forecast mostly cloudy and mourn today would spotty rain showers high temperature eighty two more rain likely for a time tonight low fifty seven so much cooler at high tomorrow Seventy with a strong northwest when\nFrom the foreign weather center meteorologist damned Thomas [noise]\n\nYou know the president United States yesterday's going out to Iowa then they're gonna make speech out there and on his way to the helicopter marine one ... about honor them at a\nHundred yards from the oval office a cross the lawn there to where they have the helicopters waiting and the engines running in the comes out in the press corps is always there to his press get his pictures he gets a board marine one standard saying well he he decides he's going to talk to the press for about Fifteen minutes\nSo they have the captors engines are still running over their president to answering questions\nBy the way he does that a lot more than Obama ever did I mean it's been reported that there's a lot more access to this president then perhaps the Pashtu ever ah he's had six Q A session of reporters since since October one that is\nAccess which is rare for president\nUm so that was\nDefinitely jackets and asks Harris Elise Hi example to lead them off to their effort for example it's time to get breakfast\nReady the parents' hands out loud I wash my hands with soap and water before\nReaching the refrigerator yet your food [noise] I just came in from take out the trash and four years I have to wash my hands first [noise] many\nIllnesses are spread by on last hands and teaching kids how to properly clean their hands will help them early and healthy children really do need to get a habit\nAbout hand washing and they'll do it when they have examples at home\nFor more information talk about health care provider or visit Mayo Clinic dot org\nInformation view of being driven these these bills news and talk leader super talk Ninety nine [noise]\nI'm Jen Weaver with your top\nStories fair view residents there is a water main break off of highway one hundred and it doesn't look like\nThe issue will be fully fix until about eleven o'clock this morning\nAnd we got the timeline for the big cool off here in middle Tennessee coming up in the ... forecast in traffic updates in five minutes meanwhile Florida governor Rick Scott Twain tweeting that time has run out to evacuate the ghost ahead of hurricane Michael got a hurricane Michael update in one minute but let's get to the rather for county jail break shall we\nHebei eyes had to do rather ... from the detention center in Murfreesboro to the top ten most wanted list\nSchools in the area of been searched overnight there are clear bud schools will be on once known as a code yellow locked down\nThe sheriff's office says that means they'll restrict visitors from entering schools today otherwise it'll be a normal school day to wane half acre and Jonathan Baxter overpowered a gel or at the adult detention center and escape just after twelve thirty this morning even climbed over a razor wire fence\nThey may have homemade weapons on them\nSeveral law enforcement agencies with the help of a helicopter and canines are trying to get these guys back into custody half acre and Baxter will last seen wearing white tee shirts and orange pants there was a twenty five hundred dollar reward for information leading to the capture go to our Facebook and Twitter pages for all the information you need to see the photos as well\nAnd to help authorities bring these guys back into custody but if you see them the way to help is to call authorities don't try to enter act with these guys member there'll be wearing white tee shirts and orange ants\nHere in Nashville a fourteen year old boys under arrest in juvenile detention John's with criminal homicide this after the murder of another fourteen year old boy in the street outside one thirty Nashville greens last night Giovanni Hernandez was gunned down a Mariano Johnson is the one in detention\nHigh winds heavy rain the storm surge underway along the Gulf Coast in Florida where hurricane Michael is bearing down its camp for storm right now but it may go cat by by the time that makes landfall early this afternoon Tracy done is among those who chose to stay put\nWell was voted out [laughter] we've got our water flashlights a mattresses hunger now they can care though people the young people and and\nGovernor Rick Scott says it's too late to evacuate so if you chose to ride out the storm seek shelter immediately there won't be any first responders to help anyone because during the storm is going to be too dangerous to get out\nResident Trump's declared a state of emergency for the entire state of Florida freeing up federal assistance to supplement state and local disaster response as\nA federal report says Defense Department weapons programs are vulnerable to cyber attacks and the Pentagon's been slow to protect the systems which are increasingly reliant on computer networks and software\nThe report says testers using simple tools and techniques were routinely able to take control of weapons systems under development without being detected\nHomeland security secretary gears to Nielsen and FBI Director Christopher Wray expected to address this you and others during testimony this morning of the Senate threats to the homeland hearing elsewhere in D.C\nSenator Mitch McConnell says it was just Brett Kavanaugh his first day on the job as a Supreme Court justice and those who oppose this confirmation are already trying to get 'em out\nOne color pressure bird was already tried to circulate a cushion the drug [noise] drug discovered all through me and the\nRepublicans continue to denounce those who protested the cabinet nominations same a huge mob tactics bullying and intimidation\nMcConnell ads the issue will drive Republican voters to the polls in November and the Democrats say their bases energized too and they expect their constituents to turn out in record numbers Lindy Kenyan washing\nTown that is the latest news broad you by mark Spain real estate trafficking whether next time can we ever WTO guaranteed offer today\nFrom the genesis diamonds WPN traffic center\nTraffic volume has died down on the interstates still seem to back up all night sixty five north found coming out of Franklin towards breath what it'll decorate boulevard as well as I twenty four west bound going towards the twenty four four forty junction still working on a crash my twenty ... twenty four junction and overseas Nashville the shoulders blocked in the park way south out at trinity lay\nBe on the lookout for record Harding pike west would bop boulevard and also in town at the court avenue east of twenty eighth avenue I'm Joshua Clay traffic every ten minutes every morning on super talk\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nTimes the captain in Capital Management\nWeather here's your forewarn weather forecast\nMostly cloudy warm and humid today would spotty rain showers high temperature eighty to\nA few more rain showers this evening the turning much cooler after midnight low fifty seven\nVery fall like tomorrow high temperature in the upper sixties a strong North West wing ten or twenty ... twenty five we'll make it feel even cooler down to forty four friday morning in sixty five friday afternoon for the foreigner weather center I'm damn Thomas\nThirty seven to one\nAnd we have a constantly changing cast of characters on gang afford lately I can kid was gone now he's back and look and we were in the newsroom hello anything on those bad guys are\nJust the latest that the schools have been searched there in Murfreesboro and a rather for county school says that ah that they've been given the all clear but they will be restricting visitors access to schools today until the situation is rectify\nThat's right escape piece from the rather for county jail there'd been a jail breaking rather for county Murfreesboro so below half for guys wearing orange pants yes uh in the control room today can wait what Chris Weber's gone I and we have ... I guess\nWhat's happening in New York City hey Brian I like as I like to call him O T o ... O T O T huh is that the you know ... this was a book in the Bible and you were saying that this was\nSuch a name that as as a meaning to your family\nYeah my name after my father so middle name is love and he love it yeah you know the name id firstborn son and daughter after him so much I can get away with no crime [laughter] so I Do not want to hang out with orange pants [laughter] and what's your what's your sister's name\nOh we have those nine of one of the one named [laughter] rather than five yeah five girls or boys and I have a twin\n... you'd have a twin all so you can send your your twin and here to work some day and we would never do the different\nAh she has she has no\nWell that would give it away what we do a host hill ...\nYeah that seemed like one of those uh those shows where they follow the families around one of those oh yeah\nWell anyway I Know one wants to be the story of the family but me so All right well listen to the veterans welcome to the uh the gang of four and ... and last but not least certainly not least damn man does you know you love them you can't live without him down to three here on super talk Ninety nine seven WGN going down a\n... uh\nWell I'm I was looking moments ago to see if my house is still standing\nEven looking at that thing all day well I'm Sorry\nYou know I mean I have this I I haven't oh I don't own property in Nashville yeah I Know I I rent right the only house that I own\nThe only piece of property down happens to be a block off the beach in South Walton County Florida about twenty miles from where this hurricane is coming ashore yeah ... and so I'm I'm a little distracted yes I'll just attached and don't like him as a first world problem I mean if you are fortunate enough as I've been\nTo be able to purchase a place down there some Fifteen Years ago when prices were a lot lower\nAnd uh and I am able to hold onto it and you know you get to go down there and you you get the joy of living in this wonderful part of paradise whether this is the price you pay\nNow the big question that everybody wants to know is how is the pink flamingo oh we've had so many conversations about those pink flamingos\nYeah because I had a fight with my age away yeah you did and I had to put the pink flamingos on my lawn as an act of defiance", "show_name": "Nashville's Morning News", "year": "2018", "city": "Hendersonville", "day": "10"}