{"month": "10", "state": "TN", "station": "WWTN", "content": "The red eye radio million mile club would not be possible without the support of our great sponsors including Petro stopping centers\nHow's lubricate or the ... the family of companies motel six the sink Christopher fund cats scale and cover electronics we applied the individual truckers athletes who drive with care and keep our highways say Mm\nHigh end in Compton for over Thirty years you know the truckers America's most red wrecking newsman [noise] now every week and watch me and my co host Jessica Rose as we bring you the only weekly news show creative just referring to join us for all the breaking news affecting the trucking industry along with an awesome regularly profile\nThan trucker dot com is the one from the time you're not going to want to have them busy travel down the highway so tune in every week and watch the trucker nice gentle by going to the ...\nThat's ... please not to drive ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning happen Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German in basketball you'll remember what you've learned\nI always thought I was bad at languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently in your new language within a week\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning half in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax vote cab\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use that when we wake up\nThat we've neglected one of the more impulsive products and daily routine that old worn out toothbrush\nI'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is to overall\nHealth I worked with dentist ... ... ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip has sensitive stomach vibrations that a gentle on your gums and built in time at that pulses to guide you around your mouth all packed into a beautifully\nSlim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three shipping backed by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dented association upgrade your ... and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plant sign up now I'd get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W O\nCan get through on the phones sound off on our Facebook page you could even type it in all caps super talk Ninety nine seven WPN\n[noise]\nCan't throw that radio he is there for me and I'm Mary McNamara Eric\nHad to take off early to go to a conference would just be new for the next couple of minutes ah this I found really interesting over the weekend a George Papadopoulos the former foreign policy adviser to Donald Trump's campaign was on Fox News and as you know he was interviewed\nIn private or by the house Judiciary Committee or a few members of the house Judiciary Committee last week here he is on Fox and friends will\nA there was tremendous ah misconduct on the government's behalf on regarding my case and I'm given a certain information I learned yesterday that I can publicly disclose right now I'm I'm actually even considering a withdrawing or my\nI've come to with other government those were under previous lawyers you agreed to\nPlead guilty to lying to the FBI and getting fourteen days in jail and he only served one day right so\nYou just say why what makes you think you want to withdraw that\nUh you know what to have to serve even one day in jail for something that are now it seems that was completely orchestrated and uh I was framed in many ways\nIt's just something in my principal and um by precedent I Would never want another Americans who go through something like I'm going through a gun so if I end up deciding to fight this I wouldn't be doing it more so to assure that this precedent doesn't affect a future American who am I joined the presidential campaign or anyone for that matter\nNow what I found interesting is then yesterday afternoon Papadopoulos tweeted this out or why cannot disclose the information publicly it's a fact that both me and Congress know who the spy within the campaign was\nCongress will likely include it in a report later on eyes were everywhere\nDuring the twenty sixteen election pretty fascinating and I just wonder now this makes me even more inquisitive\nThat the president who did not release a the declassified of Pfizer warrant application nor the emails between members of the FBI and the Justice Department and you we just\nWonder he gave it to the inspector general inspector general looks at corruption instead of released to the public\n[noise] just wonder what in the world isn't there\nShouldn't be number one political story out there and it just isn't [noise]\n\n\n\nAs soon as ... radio on Westwood One\nDish age Gigi keeping you connected coast it goes from a comfort of your guests find out more disregard truck ... from a drug dog gum\nCobra electronics is proud to support the fight against breast cancer by partnering with bright pink travel centers of America and Petro stopping center to bring you the twenty ninth LCD bright pink CB radio is limited edition right did CB\nRadio is helping to save lives from breast and ovarian cancer by empowering women to liberal activists for every radios old man who was making a donation device thinking the fight against answer the right to the\nRadio is available for a limited time ... travel centers of America and Petro stopping centers\nWhat does it mean to the corner office well have a seat behind the wheel of a new free ... and the prestige of the corner office takes on a whole new meaning\nTo sleep designed to be ergonomics dash large LCD display controls at your fingertips hall to create a more comfortable functional workspace that set you up for success to take a virtual tour of your next office space visit free lighter dot com slash\nCorner office that's free lighter dot com slash corner office free lighter\nRuns smart attention owner operators how are you tired of chasing empty promises RSVP is looking for you to join the routine offering a dollar Seventy\nFive per mile for ... drivers for two dollars per mile for teams are asked me Pete he's all miles that hadn't back home or not in their vocabulary they're no treatment rentals needed hidden secret how our I think the today at eight and eight RSVP three six five that's a A R S P three six five for a play\nOn line ... RSVP I on the dot com that's RSVP IMDB dot com\nHave your driving right now and you'd like to read the informative and entertaining content found in the current September October issue of rotating magazine or if you'd like to listen that's right I said listen\nAs a voice easier on the years in mind reads the stories to you well listen up for starters the print edition preferred by Ninety percent of votes your drivers is now available for free as an F. R. E. E. N. N. E. T. H. Petra location nationwide\nAnd if you're not fueling at a TA Petra location today while you're in luck you can simply go to ... king dot com on your tablet or laptop to read a page turning version\nWould you prefer to read wrote cheating on your smartphone will scroll down version is also available at Rhodes king dot com simply click on view digital version or current issue\nTo listen on your smartphone or Bluetooth connected headset or speakers just activate by clicking on the speaker icon for any story and voila just start listening road gene dot com\nEra currently here for the St Christopher truckers relief fund\nIf you could help a truck driver get back to work make their pile of bills less daunting give them one less worry wouldn't you\nEvery year thousands of truckers lose their jobs homes and more when a medical problem causes financial hardships but with your donation to the sink Christopher truckers relief fund you can help get them and their families back on the road donate today of truckers fun dot org ... responded dot org ... today at truckers fund dot\nHenderson veil Nashville\nConditioning studio where dogs I mean I [noise]\nI'm Ken we are with your top stories and we've got the full forecast standard traffic update in five minutes but I can tell you the forecast\nMight make you a little sad well maybe the little one sad for trick or treating because you might want to make those plans early on Wednesday\nDaphnia will be along to tell you why during the full forecast and traffic in five minutes speaking up traffic there is a crime scene investigation that has a portion of highway one hundred in Bellevue close this was near heartbreak river bridge about a half miles west of ends word school\nI Know that's true in South Carolina [noise]\nThe unifying effect that this\nIs overwhelming no Republican has accomplished what the Democrats\nBrett was a Bush guy [noise]\nTrump went very traditional mainstream [noise]\nA pig Brett Kavanaugh who work for us to Bush [noise]\nWhether you're a libertarian vegetarian [noise]\nBush Trump person you're United around the idea that Brett Kavanaugh was poorly treated [noise]\nI've never seen energy on the Republican side like out there today\nSo what's ironic is at a party that are gay so with the self almost all the time\nIt's found something in common [noise]\nWe were poorly treated\nSo they they they have unified the Republican Party [noise] they're designing the Democratic party [noise]\nAnd if you're a red state Democrats [noise]\nThis was a defining moment in your political career [noise]\nAnd if you went with a mob [noise]\nOr they don't pay a price\nWell there you have it Lindsey Graham I think speaking about ah the campaign and talking about Marsha Blackburn and the importance of it as he points out Chuck Schumer does not give Phil Bredesen twelve million dollars with the idea that well you know we're going to lose and\nI don't I'm not really an expected anything in return should he be elected a it's a very good point why would Chuck Schumer give Phil Bredesen twelve million dollars he would do that because he expects that if he becomes the majority leader of the Senate Phil Bredesen is going to follow his lead\nSo hey you know the Democrats any pathway they have a through the uh through ... to ... to claim this the Senate as to go through Tennessee and that's why Lindsey Graham is out there fighting the good fight on behalf of Marsha Blackburn now as I mentioned\nThere were protests yesterday up is a bad\nBlack lives matter whether they're others apparently were there I had a personal interaction with one of them are which I Can't believe even now and I will I'll share all that with you in just a moment right now it is five twelve on WGN [noise]\nFor the next to an end to show the investigation continues into the ... during the later today Columbus that concept for seven\nImagining a better bank starts with looking at the savings rates most banks offering saying\nReally capital one is building something better you can open a capital one savings account with one of the nation's best savings rate from anywhere like here we're here\nOne of the nation's best savings rates opened on line at a capital one location or from anywhere that's banking reimagining what's in your wallet for consumers only offered by capital one and a member of the icy copyright twenty eight and capital one\nDay right make like please not acted dry ever wonder why Europeans seem to speak so many languages maybe it's because they used to handle the number one selling language learning happen Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was bad at languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently new new language within weeks\nHe was in effect I could start having real life conversation right away because it's so fast now speaking Spanish\nNo wonder battle is the number one selling language learning gap in Europe trying for yourself and see my battle is the quick way to get ... in a new language like Spanish French were more you can try battle for free download the app or tax to vote cab\nTo forty eight forty eight forty eight taxi cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nLately it seems like everything we use every day is getting an upgrade\nWhen the bed we sleep in the race that we use that when we wake up that we've neglected one of the more poultry products and daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI was with the dentist the crap that sort of a toothbrush and makes brushing most simple affordable and surprisingly enjoyable quit sensitive suddenly vibrations that a gentle on your gums and built in time that pulses to guide you around your mouth\nAll packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for\nThree shipping attention to the section on clip the time magazine distinction and one of the best intentions of the upgrade your or capped\nAnd stopped brushing better with quit\nQuit start to twenty five dollars and it's guaranteed for life with a refill plant sign up now like get clipped dot com slash W W L and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W. W. O. L.\nDot com do you know if you need a weapon you need to go see the folks at of Asheville got a knife or but\nFirst of all when you go in there going to find a warm and friendly environment a very knowledgeable staff people who will give you great advice and they will look down their nose is if you have questions even you know but get her questions\nSome places that's really not the case so if you're looking for something for home defense or concealed carry or hunting play sports competition or maybe you're looking for a pistol revolver a rifle or a shotgun maybe your look you're looking for a knife well if you needed a good knife a they have the largest selection of lives to be found\nIn all of middle Tennessee fifty seven oh three oh Harding pike and domain open tend to six on weekdays down to six on Saturdays\nOr you're going to be glad that you went there it's it's right behind global motor sports and bill made fifty seven all three old hurting pike learn more by going to their website Nashville got a knife dot com\n[noise] from the genesis diamonds sell you T young traffic setter\nStill dealing with a couple of different things out west of town I forty west Spanish are the pikes door on that crashed there and also keep in mind highway one hundred between temple ... boulevard has closed due to a police investigation\nAgain highway one hundred between temple wrote a note if we boulevard in Bellevue as close to a police investigation from an Internet from earlier this morning other than that I Am saying a disabled VH one on my twenty four west bound as you get to buy the parkway by traffic still flowing along smoothly and also looking at sixty\nFive north that at a Franklin in Brentwood I'm Josh ... traffic every ten minutes every morning on super jock Ninety nine thirty has to offer\nIn Capital Management weather's here's your forewarn weather forecast\nDelightful thanks shining fees low temperatures today med tapper sixty four year high rent free and clear skies stick around tonight allow a forty found enjoying for the fourth one weather center near all get ...\nFor the exchange to win a thousand dollars is coming up at eight oh five eight four day right here on TALK Ninety nine seven several\nGM [noise]\nFive Seventeen nationals morning News I'm talking about this event yesterday or Marsha Blackburn has an event\nWith Lindsey Graham a grand comes out in support of her campaign against Phil Bredesen and it was ... I think I'd ... I'd bury newsworthy events however what what caught the headlines were seven protesters who busted up the place in the early going seven protesters\nA here's here's a the Tennessee and headline\nProtesters interrupt taken out of Marsha Blackburn campaign of that here's a channel five protesters interrupt Marsha Blackburn get out of the vote rally one person or arrested\nUh if if and and then here's another one uh\nThis is even the tennis star leftist protesters kicked screaming punch in Nashville rally well there were other things going on there that I thought were newsworthy this was part of the story it's not the lead in my estimation as part of the story\nUp by the way you look over here it's still reticence coverage Phil Bredesen holds events celebrating Twenty years of titans and predators in Nashville\nThat's nice positive coverage isn't it All right so there there were these protesters here here's why they sounded like when things started getting\nWas it was the black lives matter people and others\nAre and you know at one moment there was a you know as it is just one of those things like you know it was like the Kavanaugh hearings\nIt is one person would make noise and then they would take 'em out and there'd be a big scuffle and then they would try to start to thing again and then the other person would start to protest I mean it was ugly I I Do events I've ever seen where protesters tried to break up an event it was perhaps one of the worst and apparently one person was arrested\nPinned to the ground by police and the whole nine yards a I'm a I'd like to find out more about what happened with that particular case\nUm but at one point Marsha Blackburn\nVery clearly is in the midst of calling for a moment of silence in fact she did call for a moment of silence for the victims of the Pittsburgh synagogue shooting and ... and during the moment of silence somebody began protesting\nAnd if if you want to go to my Twitter feed I'll show you that woman was a her picture is up there at Brian Wilson nine nine seven you can see her and but this happened during the moment of silence unbelievable and Marshall blacks\nAnd had a few things to say about that later\nOf course we know they were yelling impeached tromp among other things they sense taken off to jail ...\nAre being for assaulting officer [noise]\nAh we have that may interrupted moment\nAnd get fired\nInformation few pop pinion drift at least is ... news and talk leader super talking Ninety nine [noise]\nFive thirty I can we are with your Tom\nStories and you might want to have a backup plan for trick or treating this week\nLooks like it could be a soggy one oh four cats trying to pick up dates in five minutes\nMeanwhile the crime scene investigation this morning has a part of highway one hundred in Bellevue close this is near ... river bridge about a half mile west events where the high school well he's got a call about a car that went off the road and firefighters arriving on the scene found a man inside who had been shot\nThat person died there on the scene highways going to be closed for the next few hours due to that crime scene investigation\nMeanwhile will Ripley has the latest on a plane that crashed after taking up in Indonesia with one hundred and eighty nine people on board it\nDoesn't look good at this point the images that we have in the\nFamily members who are waiting at the airport or in a punk called ... where the plane was supposed to land it was supposed to be just about an hour flight to kind of flight that people take all the time think nothing of it uh and obviously never arrived and they've been waiting there for hours and with each passing out there in these new images\nOf debris rising to the surface of the job of seats on thirty four nautical miles off your car to\nNashville will pause to remember the lives lost in the Pittsburgh synagogue attack the Jewish community will hold a vigil tonight at the temple congregation on Harding pike and they say it is open to everyone\nMade while Robert Ballard the man accused of killing eleven people including injuring three police officers at that Pittsburgh synagogue goes before a judge today\nPittsburgh synagogue shooter posted at the ... and the forum site gab he took aim at a Jewish non profit called highest which helps to resettle refugees in the U.S he accused Jews organizing in funding the Central American migrants caravan\nThe Anti Defamation league recently showed a big increase in the amount of anti Semitic contact on social media and it's gone automated\nAfter studying thousands of anti Semitic tweets on Twitter from late August through mid September they found that thirty percent of the post were published by bot accounts Steve cast in New York\nThe Florida Man accused of sending packages containing possible explosive material the prominent Democrats into borders is due to make his first court appearance today and an initial hearing said but this afternoon in Florida federal court for fifty six year old Caesar say on that basis by federal charges\nA migrant caravan update Newsweek says uh twenty six year old Honduran man who had been traveling with to the U.S border would that caravan of Central American asylum seekers\nDied in a clash with authorities yesterday after the group tried to push the Mexican police officials who would not metal gates at the border with Guatemala meanwhile on Fox News Sunday secretary of homeland security gives the noodles and said this caravan is not getting in\nThere is a legal way to enter this country it came to enter illegally will be stopped ... we're working with our partners in Mexico they had taken a precedent in efforts are within their territory I can ensure an orderly flow and that they can have illegal right to be there\nAre in is how we intend to do the same turning to sport\nSell wine cease fire [noise]\nSo Boston is happy today here's Tom bugs me\nIt's a new week on Wall street which stocks coming up one of our worst weeks since the financial crisis the dial down a total of seven hundred and fifty points on worries about rising interest rates slowing global growth and weaker earnings\nIran is added again Facebook pulled eighty two accounts pages in groups all linked to Iran pushing a disinformation campaign ahead of the midterm elections here in the U.S\nThat is the latest news rounds you buy twenty three and made traffic in whether next time Ken Weaver\nDebate dreamy dot com from the genesis diamonds value to young traffic center\nLooks like we have a new incident I twenty four establishment highway Seventy six and ... road and also out west accounts door on attached to the right wing bloc tonight forty west out of Charlotte pike also had a belly would highly whenever between capital wrote an open secret boulevard it's was do we think that the Asian again\nHighway one hundred percent capital road is only three boulevard it's closed at Bellevue I'm Josh why traffic every ten minutes every morning I'm super jock Ninety nine seven WGN\nIn Capital Management weather's here's your forewarn weather forecasting [noise]\nAbsolutely beautiful to start off the week we have the sunshine we have temperatures right where they should be today mid to upper sixties for your high denied it plans to take you out without a highly recommend it\nMainly their size in temperatures dropping down into the middle forties which is why we should be for the town here today very similar just warmer would hide in the upper sat in the form warm weather center\nWith a holiday is fast approaching we're gearing up for Nashville rescue missions annual radio on on Monday November twenty page Brian Wilson inviting you to join us for the one day of the year that we can all give back to this amazing operation that serves the meeting here in middle Tennessee they help over\nEight hundred men and women and children each day so please be a partner of hope this year in support Nashville rescue missions radio gone on Monday November nineteenth right here on super jock Ninety nine seven WTO for more information visit Nashville rescue mission dot org\nWeather dot com [noise]\n\nBoundaries in Nashville morning News I'm Brian Wilson it's time for the three of ... ... and dancing in swing were mostly in the newsroom to the American juniors accused can Weaver your morning\nKen no hatred my stab there is no while you are you are a dancer machine where you're at tiny dancer [laughter] him them control\nRoom it's Chris wherever and I'm here in the studio or which we're all in different rooms are separated by glass but we're good buddies and that's why we call ourselves ... died so I just have to I have to I'm not through 'cause I'm Still angry about this thing ... I went to the Marsha Blackburn\nAnd last minute decision I'm going to go to the Blackburn thing I'm going to watch uh the rally and I you know I always I I really thought that when the the history of of the midterm elections is written that Lindsey Graham is going to be a pivotal figure because I think he\nWas the turning point ... for Republicans in this election ... that's what I wanted to go and there was a little old lady in a wheelchair for goodness sakes ... you know she rolled running sat next to me\nAnd I went across that got her water I brought her\nCookies and then you know before the thing that she rolled off to be in some other part of the of the room and I I lost track of her turns out she was one of the protesters who was busted in the place and then I ... I I I'm leaving I'm driving out I see her standing on the side of the standing on the side of the road\nYou know with waving assign and and and ... still protesting mhm and it it it takes me that I was look or buy a little old lady in a wheelchair\nYou were born swath of sports on on our [laughter]\nBut you know as as being as the press protested though those were pretty rough I mean they they usually people get grab by the elbow and they get ... and that's it right but I mean there's one guy got you know thrown to the floor and was handcuffed and on and and they had to literally pick one person up\nUnder the arms and by the legs and drag 'em out and uh and\nThe woman in the wheelchair was rolled out\nYeah [laughter] and then later scenes stand I saw her standing\nI absolutely sure he was the same woman right 'cause I mean I'd ... I'd brought her cookies I Know her I mean I felt like I I I looked her in the face I had an an interaction with her yeah abroad or water in ... she was like ... which is like a cookie ma'am\nI'll get you a cookie to would you like one or two would you like chocolate chip yeah yeah that'd be great I Love chocolate chip I could eat too okay well I brought her ... and we had to you know as I Know it was this I Want to say Ken nice man\nI Wonder if he's taken a while you're doing all this being nice or anything like buddy\nYou stupid if I Know I felt\nI feel dumb but I mean I'm telling you it was a great grand was great he had a great line and he said I have a ... a lot in common with President Trump I like him and he likes him [laughter]\n\nA fair if you had lied but it was a great event and uh and I think ah you know he was in\nGoing on to Missouri or to do the same thing uh for the opponent of one Claire McCaskill he really wants to\nSee the change uh that are actually asked to stay the same in control of Republicans and that by the way that is looking pretty good will get into that a little bit later\nOtherwise I was out communing with nature this weekend oh yeah oh yeah\nMan you got some great it was odd so the sun ... was that\nSunrise Yvette was sunrise over the line that's Percy Priest out there right you know I see I have an RV camper\nMhm and I just decided I wanted to sort of shake it down there had been used a little while I wanted to shake it down and clean it up and do some minor repairs on it and so you know I I decided I'd go someplace nearby so I'm In a campground over on the Percy Priest lake it's beautiful over there are very nice\nA this Thursday starting at twelve PM enjoy a delicious launches we broadcast live from the palm Nashville thirty three dollars gets you food complimentary parking and\nAnd us and by us I mean me Brian Wilson Michael Dell Gerardo a Dan Mendelson filled Valentine will all be there will talk about the elections that will be only at that point five days away a and if you want more information simply go to our website\nNinety nine seven W. U. T. N. dot com that's Ninety nine seven WGN dot com we're going to be also a mafia ... those are foreign election a broadcast on election night I Want to have a long day at work early\nAnd want to go to the thing that night and get up the next morning work early but you know what it's what I Do and\nAnd and it's for it's it's it's a ... not a more important time in America than this midterm election\nA lot at stake and we always say that but I mean I really do feel like so much is at stake in this coming election was there will be there to give you the blow by blow that night and then the next morning after the electric you can tune in right here to super talk Ninety nine seven WGN and I will give you everything you need to know about how the mid term elections went\nI Will tell you as they say just how the cow ate the cabbage it is now five fifty two on WGN\nLet me tell you if I could about the folks over at a Brossard a they've got a thing that they like to do this time of year and that's helping children in middle Tennessee specifically home uh children who are at the Tennessee Baptist children's home\nNow here's what they've done they have\nFound a way to bring some money to those kids so that they can have their Christmas which granted\nI mean what a lovely ideas that here's how it works though you you have to participate in all this ... if you'd call over there between now in December twentieth and provide the information to get a no obligation insurance comparison and so I mean no obligation just find out if they can do anything to improve your insurance situation\nThen they'll get fifty dollars to the Christmas fun if it turns into some kind of deal where they can help you and I give you some new insurance then they'll they'll donate a hundred\nIf for some reason if it involves a work comp or business policy that's two hundred dollars\nThese are the kinds of people who want to do good in the community and they want to help you by the way they represent all of the top carriers are they're going to be able to get you a good rate and you know really it just it it does make a lot of sense to just kind of stopped now in them and take an assessment of all your insurance and whether or not you're paying too much\nOf the folks have restarted associates can help you six one five five zero four seven nine three want see how they can help you save money and help the children of middle Tennessee at the same time learn more it's your website Abreu agent ... B R O U agent dot com you're going to like doing business with Broussard an associate [noise]\nLater this morning on the Michael Dell joined oh show so much more than just left versus rice so often it's a right versus Ron we make sense of the news on a Nextel journal now the new right here on super dark Ninety nine seven [noise]\nWhich is building a better bank looked like\nIt starts with building capital one cafes warm inviting places that feel nothing like a typical bank\nWhere you can open an account with no fees are minimum in five minutes and you'll always find people ready to help you not sell you welcome the banking reimagining what's in your wallet\nOffered by capital one and a member FDIC copies available in select locations copyright twenty eight and capital one\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWonder if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\n... please not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German and best of all you remember what you've learned\nI always thought I was bad in languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real life conversation right away it was so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight team at ... dot com\nFrom the genesis diamonds that was too young traffic setter west of town still working on Iraq there that forty West I'm Charlotte pike the rice shoulders block and also keep in mind that ... how do you one hundred between ... wrote an old hickory boulevard as close to do with police investigation from an incident earlier this morning again highway one hundred and three temple wrote an old ... boulevard disclosed\nAlso have a wreck in Montgomery County I ... down between highway Seventy six and max erode had also an injury crash of hops in Pica Hamilton church wrote some Joshua quiet traffic every\nTen minutes every morning on super talk Ninety nine for for seven today\nIn Capital Management weather's here's your forewarn weather forecasting\nDelightful sunshiny seasonable temperature today ... sixty four year high range free and those clear skies stick around tonight a low of forty five enjoy for the warm weather center and we're all just ... but in the medium\nRescue official says they don't expect to find any survivors after a plane carrying one hundred eighty nine people took off and then disappeared from radar will tell you about it at six on super talk men nine seven WGN\nEleven people dead have a deadly anti Semitic attack him Pittsburgh I'll give you the ... and why are the media trying to pin this on Donald Trump\nWe'll talk about it's all straight ahead right here on\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up but we've neglected one of the more impulsive products and the daily routine\nThat old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth is to overall health I worked with dentist ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip how sensitive suddenly vibrations that a gentle on your gums and built in time of the pulse who's the guy do around your mouth old typed into a beautifully slim and dies medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping backed by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dented association upgrade your ... and stop brushing better with quit\nQuit start suggests twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get clipped dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nAccurate mortgage group wants to know that being frightened of goblins or goals makes a lot more sense than being scared of the home loan process no matter if you're a first\nTime homebuyer or wondering if that cash out revise right for you when we say we'll walk you through the loan process from start to close that includes being available to you on a nice weekend and spooky holidays too so why wait apply today at accurate MPG dot com accurate mortgage group\nAnd division of a ... El Al see is an equal housing lender and then they'll last number four six six for\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWonder if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nFun to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. peak carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nHangers in vale Nashville\nConditioning you were talking about I mean I [noise]\nThe clock I'm Ken Weaver coming up we've got your top news and of course full forecast in traffic in five minutes I can tell you this\nOf the Washington Post won't exploit to attack President Trump Donald Trump or see that they they they tied both uh this synagogue shooting suspect and the man who was sending bombs through the mail\nOr things that were resembled bombs I don't know that they weren't bombs I don't know what they were they didn't they didn't work\nUm and I don't know if that if it was a that that decided to scare people or whether the bombs real one way or the other uh the most ineffectual bomb bomb or the history of mankind twelve bombs and none of them went off a thank God [noise] uh so here we have the mainstream media\nAnd going crazy trying to tie every event that happens every negative thing that happens in America somehow back to the president and saying well his rhetoric is out of law\nThey [laughter]\nThey ignore the things that are set by some on the left\n... who was it was president Brock Obama who said ah if if uh they bring a knife to a fight we bring a gun it was his quote unquote wing man Eric Holder who recently said you know when they go lower we kick them\nWhen they're down that's right and and and\nAll these other people who have gone out on and said that you know they're in spirit hatred from the left all of that gets ignored\nBut yet they try to take everything that that somehow negative in America that happens and tied to the president\nUh it it is inappropriate it was wrong and again in the case of of this synagogue shooter\nThe man had posted social media I'm saying that he disagreed with the president wasn't a follower of the president he disagreed with the president and suggest that somehow the president's rhetoric lead this man to commit a vile act of anti Semitism is really beyond the pale\nBut\nThat's not all that the mainstream media has done of light or that you will find reprehensible I got a story that dates back to the Capitol mess that\nYou're just not going to believe you're simply not going to believe that NBC sat on information [noise] they had information\nThat would have cleared a Kavanaugh's name in in against one of the allegations that had been leveled against him\nAbsolutely cleared him and they sat on that information during the time that the the hearings were going on I'll give you all those details just a moment right now it is six Thirteen on Nashville's morning news here we go um [noise]\nThe folks at United structural systems\nWant to ask you some questions about your house\nOr your doors and windows sticking or their cracks in your bricks\nOr bowling basement walls maybe just a look at your chimneys is leaning a little bit well that those are all signs that you've got a foundation is you\nKnow when it comes to foundation repair there was nobody who does it better than the folks had United structural systems USS as sort of middle Tennessee since uh since Nineteen Ninety four\nThey've been they've been around for a long time and and they uh they have a reputation for and reputation and an impeccable writing with the ... better Business Bureau there a plus rated\nThey're not a franchise there locally owned it means they will customize a solution for each a homeowner depending on your specific needs they do not have a one size fits all solution\nSo the folks in United structural systems will give you a detailed free estimate before you make a decision and there's always you don't pay a dime until the work is done and and you're happy you can feel good about calling United USS\nCall this number six one five to seven to two seven five ... to to seven to two seven five learn more at USS CNN dot com [noise]\nAnd the next ten men to show the investigation continues into the gamma bomb during the later today Columbus that constant photography and I said [noise]\nFriend is a fan of the disco here say farmers making it easy can give back to the neighborhood of ... dot com to find a way to get back to your neighbor it certainly does it feel fire Jim ...\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload but\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex funded to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nText fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\n... please not acted dry ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning gap in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently you new language within weeks\nI was in effect I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning avenue Europe trying for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax to vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raid that we use when we wake up that we've neglected one of the more impulsive products and the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health I was a dentist to ... that sort of a toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip sensitive stomach vibrations that a gentle on your gums and built in time and that pulses to guide you round your mouth old typed into a beautifully slim and dies I leave many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three\nShipping backed by thousands of dentists quip is one of the first electric toothbrush has accepted by the American dented association upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first rebuilt pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W outlook\nFrom the genesis diamonds cell UPN traffic center\nThough we're gonna crash north of downtown I sixty five South Africa unity lane less lanes blocked and also still dealing with Iraq out west of town I forty west Spanish Harlem pike out of elder you having one hundred between temple wrote an old like we boulevard disclose due to a police investigation still keep that in mind and stole a car crash in Montgomery County like twenty four he's founded Swede highway\nSeventy six and max erode can be on the lookout for an injury crash unfortunately a hops in Pica Hamilton church for a project by lows pros and the no start with was and say\n... percent on eligible purchases everyday maybe at the Lowes business credit account has five percent savings in store and on line subjects credit approval cannot be combined with other credit offers exclusions apply seized over details us only\nI'm Josh for clay traffic every ten minutes every morning on super talked Ninety nine or\n... dot com ... Capital Management weather's here's your forewarn weather forecast\nDelightful sunshine in the Catholic Church today may temper sixty four year high rent free and clear skies stick around tonight a low a forty five and joins for the fourth one weather center and we're all ...\nAll over the exchange to win a thousand dollars is coming up at eight oh five eight four day right here on TALK Ninety nine seven some tea or\nA\nSix Ninety Nashville morning news or I'm Talking about\nThe attempts by the media to\nEnd this horrific acts\nAnd the ... of violence in Pittsburgh on the president went in fact\nThe president immediately condemned it uh and the man who carried out the attack\nActually was not a follower but a critic of the president I don't know how in the world you take the fact of the men didn't like Donald Trump and that somehow led him to carry out this I I don't understand it but but they're always trying to pin this on the president but there's another story out there that I just\nI mean it just sticks in my craw about the the unbelievable bad behavior of mainstream media outlets and this particular case I'm Talking about NBC\nBack when the capital hearings were underway\nA there was of course an allegation leveled by a woman by the name of Julie sweat Nick and she was represented by the uh the porn star attorney Michael ... and and so she had laid out these horrific allegations against Kavanaugh\nI always thought I was the added languages but after using apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning out in Europe tried for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try babble for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight\nGame dot com [noise]\nInformation few up paying for it at least these bills numerous and talk leader super talking not eat I\nWith your stories could be a soggy Halloween ... will be a long and just a moment to tell you about it during the full forecast\nIn traffic and five minutes speaking of traffic highway one hundred did end up Bellevue or is it still shut down this wall metro police have just identified demand shot to death this morning\nAfter chasing people who were breaking into cars in his neighborhood the shooting suspects were in a dark SUV the man who was shot to death identified as forty five year old Eric ... died that his health fitness dime\nAnd police asked that anybody in the trace side subdivision off highway one hundred who's vehicle was tampered with or who has home video of the outside\nAre asked to call police at six one five eight six two eighty six hundred we have that number posted to our Twitter page it's also on the metro police department's Twitter page I weigh one hundred by the way still close there in the seven thousand block\nSo the shootings scene can be processed rescuers searching the waters near Jakarta, Indonesia after a lion air passenger plane crashed into the sea minutes after takeoff will Ripley reports the plane went down quickly\nApparently the captain called shortly after takeoff asked to turn around and go back to the airport did not indicate an emergency but of course after that call was made the flight drop from fifty two hundred feet down to three thousand feet that advantage from radar screens altogether\nYeah the plane was on a short flight debris including life vests a cell phone also an oil slick has been found in the job is see about thirty miles northeast of Jakarta well police are searching the Homer Robert Ballard is accused of carrying out the attack on the Pittsburgh synagogue killing eleven worshipers on Saturday\nPresident Trump has said he plans to visit Pittsburgh sometime this week but a group of progressive Jewish leaders wrote a letter saying he's not welcome here unless he denounces white nationalism\nJessica dean says ... just for President Trump as well as Jews dollar is expected to appear in federal court today\nNashville will balls to remember the lives lost in the Pittsburgh synagogue attacked the Jewish community will hold a vigil tonight at the temple congregation on Harding pike and it is open to every one\nThe man accused of mailing bomb threats to fourteen people including twelve prominent Democrats goes before a judge today Rosa ... says authorities say they tied Caesar say opt to the packages last week the DNA now because\nWe know that this case will be prosecuted out of the southern district of New York sample also need a removal hearing now from what we understand that hearing can be helped today it could be held this week it all depends on what transpires today\nMigrant camera then update Newsweek says uh twenty six year old on different men died in a clash with Mexico border police on Sunday reports say the clash occurred after Mexican police close the gate to the country from Guatemala\nElection twenty eight teams Senator Lindsey Graham campaigning for Marsha Blackburn US Senate run and west Nashville yesterday said the migrant caravan and Brett Kavanaugh's confirmation hearings have backfired on the left\nThe unifying effect of the [noise]\nIs overwhelming no Republican has accomplished what the Democrats were able\nTo bring us together meanwhile [noise]\nAt least one black lives matter protests there had to be forcefully removed from the Blackburn rally after interrupting a moment of silence for the Pittsburgh synagogue victims [noise] turning to support\nYou know but the Dodgers they've lost two consecutive World Series that's the latest used by ... by lows traffic and whether next time can we ever do us all\nFrom the genesis diamonds tell you to young traffic setter\nHave a new record Montgomery County by twenty four west ... Ross you rode it also have another acts that I'd twenty four you stumped with highway Seventy six and ... there's two separate vehicle accidents in that area\nNorth of downtown I sixty votes outside after she can be blamed river back there that's causing for backup and looks like there's a record on the scene for us by the Charlotte pike the shoulders boxer Jews in an accident tops in Pica Hamilton church road with an injury crashed and keep in mind still closed the hiring when her between ... wrote an old degree boulevard with we've investigation\nRoger by indeed dot com indeed used by over three million businesses firing more business owners make are professionals can post job openings was greener questions in short review and communicate with candidates from online dash for were more than ... dot com slash higher I'm Josh we'll play traffic every ten minutes every morning on super jock\nLately it seems like everything we use every day is getting an upgrade when the bad we sleep in to the raise that we use when we wake up that we've neglected one of the more impulsive products and daily routine that old worn out toothbrush I'm Simon ... and I'm a product designer after I learned how important brushing your teeth is overall health\nI worked with a dentist to ... toothbrush that mix brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums and a built in time and the pulse who's the guy do around your mouth\nOld packed into a beautifully slim and dies I leave him design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with free shipping our attention to perfection\nClip the time magazine distinction of one of the best intentions of the upgrade your ...\nAnd start brushing better with quit quit start suggests twenty five dollars and it's guaranteed for life with a refill planned sign up now like get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush\nThat's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W ELL that sort of ... dot com\n... Capital Management weather center here's your forewarn weather forecast [noise]\nAbsolutely beautiful started after we we have the sunshine Leon temperatures right when they hit the today's Nick ... sixty four year high tonight at ... highly recommend it mainly terrified temperatures dropping down in the middle for you this is over ...\nVery similar just warmer would hide in the upper south [noise] fending for one letters center and\nYou'll see when I ... we are and more\nYou know if you've done lots of squeaking white board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a sold out arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know to know what you were talking about all your turn to do is fill rules for your company but instead you're being inundated with reps from job sites trying to see one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for their price real humans being humid how's that sound\nWell probably like the opposite of the smoker [laughter]\nCall eight eight eight months there to talk to someone without Louis today today [laughter]\n\nSix thirty eight Ashville morning news on midterm election update little shocked off I'll Try not to overwhelm you know the numbers but um\nI I think the numbers you have to go through some of them just to get a sense of where things are\nAre you ready for this uh\nAlmost a million people who have voted early\nIn the state of Tennessee [noise] and the actual\nNumber is nine hundred and sixty three thousand eight hundred and forty six knocking on the door of a million people\nWho have gone and er and cast their ballots\nAhead of election day already now that's that's not a record or this and but it it it is closely paralleling what you might have in a regular presidential election year so it seems that voters in Tennessee are turning out in big numbers for a midterm election which is certainly an election\nOr you don't see a great deal as they are not as much interest to put it that way\nSo how many of them are from Davis in county\nWell four hundred and twelve thousand almost a hundred and Thirteen thousand are\nWhat when you you know Davis and counting of course it's largely dominated by Democrats it's considered a blue county\nOr so that is in the case that a lot of Democrats were motivated to go vote but you look around the region run around the Nashville area and you'll see that a lot of the red counties have also gone to the polls in big numbers as well\nWhen they add up it's quite it's quite a bit ah\nHere's a Dixon sixty two hundred Franklin fifty seven hundred\nMurray county uh Thirteen thousand seven hundred and fifty four\nMontgomery County Twenty one thousand nine almost twenty two thousand rather for county forty five thousand three hundred and Ninety three people have cast their ballot or including can waiver\nSort of a judge to win a thousand dollars is coming up at eight oh five eight four day right here on super ... Ninety nine seven shoveled gee yeah\n[noise]\nYou know I have no patience or tolerance for a politician that what's his finger her finger and fix it in the air and just trying to figure out\nYou know which way the wind is blowing they'll tell one group one thing you know tell them the other group something else you know trying to talk to both sides of their mouth I hate that kind of politician\nOr dynamic mayor David Bryant he seems to be playing that game right now when it comes to the idea of maybe we need that many people think we need a an oversight board of our police department I I Do not think we need that oversight board but a lot of people in Davidson county are pushing that idea the mayor has been for the record\nAgainst amendment one that would set up this oversight board he's been on record about it but ... and ... in a recent events he seemed to say that he was actually for more police oversight\nUsing more than one in terms of designing of all of them look you know the history of releasing a driving range and when they use it and\nRead it in a ride and rely on it while you make your decision well driving while black was a study done by a group called ... army back in twenty sixteen and it found that police stopped blank drivers out a disproportional higher rates than white driver so he's he's he's saying that that's the\nProblem in Nashville and therefore we need bullies oversight what seems to be what he's saying and yet he has been officially on the record as being against amendment won so he seems to be telling some groups all you know you should go ahead and do this he's telling other people maybe is officially not foreign\nTalking out of both sides of his mouth fears\nAre dynamic mayor David brightly six fifty two now on double duty out\nLater this morning on the Michael jails your nose show so much more than just left versus right so often it's a right versus wrong we make sense of the news on the Nextel journal neither new right here on super talked Ninety nine seven\nIt's official genesis diamonds with just voted by the people that music city that best jewelry store and the best\nPlace to buy to gauge meant ring not once twice five times but ten times in a row ten straight years again and again genesis wins in both contests this jewelry store and best place to buy an engagement ring\nFrom all of us it genesis we say a heartfelt thank you with nearly fifty thousand customers were humbled and on and this was ... confidence even after ten years of being voted number one we're still growing and we can be even better and that's why we always guarantee the best prices versus any other jewelry store and the strongest guarantees in the industry our mission is to\nAlways think as a box to make your jewelry shopping experience even better than to continue to amaze you on every level of constantly giving back to this amazing city of Nashville\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up\nBut we've neglected one of the more impulsive products in the daily routine that old worn out toothbrush\nI'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall\nHealth I worked with dentist to ... ... ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip has sensitive suddenly vibrations that a gentle on your gums\nAnd a built in time of the pulse as the guy do around your mouth old packed into a beautifully slim and dies at least many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping backed by thousands of dentists quip is one of the first electric toothbrush it's accepted by the American dented association upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nYou'll see one our earnings growing up we are and more\nYou know if you've been caught um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a sold out arena [noise]\nAt monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites tried to show you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for fair price real human being human how's that sound\nWell probably like the opposite of smokers [noise]\nCalled eight eight eight months to to talk to someone without Louis today you have not come\nFrom the genesis diamonds value to young traffic setter\nEllington parkway backed up from Riley parkway leading into spring street downtown and also a nice sixty five south out after the sixty five twenty four split when you get the trinity lane poorly on Iraq downtown and twenty forty Spanish Shelby avenue to lanes or block\nAnd still working on this crash in Montgomery County and I twenty ... highway Seventy six and ... he wrote north of downtown icy facts out benefits from the lane we have a wreck their with slept in central and block and also have a new ... parkway\nAnd Montgomery County have another crash at twenty four west out at Ross you wrote and be on the lookout for crash west of town I forty east bound after memory lane I'm Joshua ... traffic every ten minutes every morning on super talk Ninety nine ... dot com\nBeacon Capital Management whether ... here's your forewarn weather forecast\nDelightful sunshiny seasonable temperatures today they tap or sixty four year high rent free and it was clear skies stick around tonight a low a forty five enjoy for the Fort warm weather center and we're all ...\nMetro police putting out more information on the crime scene and closing down a portion of highway one hundred in Bellevue they say a man was shot and killed while chasing car burglary suspects or date you on this story and more set it on to protect men and nine seven WGN\nAnd coming up and just a moment or Marsha Blackburn had an advantage there were protesters but we're actually going to tell you want more sit there\nAnd what Lindsey Graham had to say on behalf of Marsha Blackburn and they will tell you about the protests and a little old lady who complain but your point of the things she was a protester I actually brought her a cookie I Can't believe I did that six maybe seven now on WGM\nHave you ever been one of those unhappy customers walked away thinking if Iran that business I Know what I Do\nHello I'm Joe quarter of the law firm quote Alan Cordell I felt that way ... years ago after my divorce but I never did discard those ideas and today that fish informs the foundation of the from that you know as ... Cornell and basically that vision was a divorced from dedicated to serving man\nWith a client centered focus on the things that client's value most such as attorney preparation regular client updates and same day return calls\nAnd in turn this result focused operating system would be monitored by client care representative the result a truly interactive link between our performance and your satisfaction\nContact Cordell in Cordell to schedule an appointment with whenever firms Nashville area attorney so partner men can count on online at Cornell Cornell dot com officers in Nashville\nFranklin Murfreesboro and ... core telling Cordell eight ten Christian Center Dr sweet one sixty Franklin, Tennessee three seven zero six seven\nDay reply please not talk to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German and best of all you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently in your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning happen Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote cab\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nYears in vale Nashville\nStudio where dogs I mean I [noise]\nSeven o'clock on Ken we either with your top stories and parents you better have a backup plan for Halloween trick or treating this week will tell you about it when Daphne comes in to\nVisit with is during the fall for gas in traffic and five minutes\nMetro police tweeting out more information on the crime scene investigation that has a portion of highway one hundred closed in Bellevue they say forty five year old Eric helping Stein was shot and killed in his vehicle while chasing people he's all breaking into cars outside his home on metal red circle\nPlease ask anyone in the trade side subdivision his vehicle was tampered with or may have home security cameras to call them\nAnd numbers posted to our Twitter feed\nIt represents things that people can understand [noise]\nI think people in Tennessee were shocked\nAt the way Mr Brett Kavanaugh was traded\nI Know that's true in South Carolina [noise]\nThe unifying affected this [noise]\nIs overwhelming no Republican has accomplished what the Democrats were able to do\nTrump went very traditional mainstream [noise]\nA pig Brett Kavanaugh who work for the [noise]\nWhether you're a libertarian vegetarian [noise]\nBush Trump person you're United around the idea that Brett Kavanaugh was poorly treated [noise]\nI've never seen energy on the Republican\nSide blackout the other day\nSo what's ironic at a party that are gay so self almost all the time\nIs found something in common [noise]\nThat we were poorly treated\nSo they they they have a unified the Republican Party [noise] they're dividing the Democratic party [noise]\nAnd if you're a red state Democrats [noise]\nThis was a defining moment in your political career [noise]\nAnd if you went with a mob [noise]\nI think he's off half\nAnd he went on to say by the way it's it's no coincidence that Chuck Schumer\nHas given Phil Bredesen some twelve million dollars for his campaign he said if you think that you get twelve million dollars to somebody and don't expect something in return then well you know uh so he ... he said we'll find somebody to drive home because you don't need to be on the roads [laughter]\nI thought it was a brilliant performance by Lindsey Graham\nAnd on behalf of Marsha Blackburn\nNow as I mentioned earlier there were some protests at this about\nAnd I'm looking at all of the coverage here and it's all about the protest and nothing about what you just heard a message that that you that I think voters had a right to hear oh I mean do they talk about a little bit based buried deep and the stories but I mean mostly it was all about the fact that there were protests and protesters were arrested\nOh I'm going to tell you about that and including my personal experience with one of them who completely hoodwinked you know I just can't believe I got to where the woman a ... and just a moment you don't want to miss the story it straight ahead right here on Nashville's morning news seven twelve now let me tell you if I could about the folks at zero fixed\nThey will take the irritation out about a repair\nIf you have a European car and by the European I mean a ... an Audi ever said he spends a Porsche Land Rover jaguar or many a BMW or a Volkswagen will go see the folks at a at a you're a fix when you have problems with your car\nI mean they're going to do a couple of things for you first of all you can walk him without an are driving down the point and they'll they'll take care of it\nUm and then they're going to do a Fifteen point visual inspection no charge whatsoever and they'll get some sense of what's wrong with your car to come back and they'll tell you about it now a lot of places just to look under the hood they're going to a charge but not at your affects\nEven if you don't go to Europe fix for the ultimate repair they'll do that for free\nThen once you get your car repaired or is back with a free three year thirty six thousand miles nationwide warranty\nWants to not to love about the folks over at your effect shopping Monday to friday called a for for your fix her visit your fix on line to learn more that's your fix online dot com and tell them that your friend and radio buddy Brian Wilson century [noise]\nOn the next ten men to show the investigation continues into deep gamma bomb it during the later today twelve us that constant photography and I said [noise]\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in the raid that we use when we wake up that we've neglected one of the more poultry products in the daily routine that old worn out toothbrush I'm Simon and the and I'm a product designer after I learned how important brushing the cheapest overall health\nI was at the dentist to ... ... ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quit sensitive suddenly vibrations that a gentle on your gums and a built in climate that pulses to guide you round your mouth all packed into a beautifully slim and dies Eli medium design we also have to live a fresh brush heads on a dentist recommended schedule just five dollars for three\nShipping attention to the section an clip the time magazine distinction\nOne of the best intentions of the upgrade your cat\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill planned sign up now like get quip dot com slash W W L and you'll receive your first refill back free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W well\nHello this is Joe Cordell of Cornell Cornell here a few quick divorced tips we provide our clients sometimes email us the best way to communicate with your wife during their divorce it's efficient it creates a record ended avoids ugly scenes on the other hand because you're on the record your comments must be tactful unreasonable assume your e mails we'll be exhibits at trial\nRemember your co throughout the process is to project in the image of common sense in good faith\nThe judge should understand that your wife is the source of this needless litigation you're the good guy the voice of reason a related point be cooperative where you can show flexibility regarding non essential issues judges noticed this besides save your attorney fees for what's important\nContact Cordell in court held to schedule an appointment with whenever firms Nashville area attorney so partner men can count on on line at Cornell Cornell dot com officers in Nashville Franklin Murfreesboro and ... core telling Cordell eight ten Christian Center Dr sweet one sixty Franklin, Tennessee three seven zero six seven\nWill get kicked out from the genesis diamonds tell you to young traffic center\nThe word on this recognized sixty five southbound just north of downtown after trinity lane at the for an avenue overpass very big accident there the left and center lanes are blocked\nAlso have a wreck and fair but you and I forty east after highway Ninety six and Montgomery County we have a record ... between highway Seventy six ... wrote\nAnd also to be on the lookout for new crash I twenty four west of Fort Riley parkway two lanes or blocks of downtown we have a record ... shall be avenue to write and lanes and block and keep in mind how one hundred between temple wrote an old degree boulevard it's still closed due to the police investigation I'm Josh ... traffic every ten minutes every morning on super talk Ninety nine we shouldn't an estimate\nThe median Capital Management weather's here's your forewarn weather forecast\nDelightful sunshine in the Catholic Church today they tap or sixty four year high rent free and clear skies stick around tonight allow a forest fire enjoy spending for one weather center and we're all ...\nCertain exchange to win a thousand dollars is coming up at eight oh five made for ... a day right here on super talk Ninety nine seven ...\nSeven Seventy and Nashville's warning there's I'm Talking about the surveys yesterday in Nashville out of cabaret a with a Marsha Blackburn and Lindsey Graham in an accident just spent the first\nYou know six or seven minutes of the show telling you are a little bit about what Lindsey Graham had to say I thought it was newsworthy I thought that was the story but I'm looking here this morning after Tennessee at an ... here is the er the headline protesters interrupt and taken out of Marsha Blackburn campaign event\nNo mention of Lindsey Graham and did he get nine graphs end of the story\nHere's New channel five ... protesters interrupt Marsha Blackburn get out the vote rally one person arrested there is no mention and their story at all about what Lindsey Graham added to say or what the event was all about\nEven the Tennessee star leftist protesters kick scream punch in Nashville rally for Marsha Blackburn now do they give they give you some of the sales about Lindsey Graham there but they don't come on folks that's not the news that's not the lead in my mind\nBut was talking about the protests there here's what it sounded like in the middle of the Marsha Blackburn rally a it was sort of like the Kavanaugh hearings one person would start to start to make noise and they would interrupt the fame [noise]\nAnd then they would try to start again and then there would be another vote\nCarried out I could only see her\nFrom across the room got carried out of the room or you know literally picked up on the arms and by her feet and dragged out that come out uh one guy got its I mean I I don't know what he got into with police but police put him down on the floor\nHeld him down handcuffed him dragged him out apparently was struggling with police old time uh I I'm another person I saw that you heard the black lives matter I don't think they were all black lives matter protesters but a good number of them were\nInformation few public opinion driven these these bills news and talk leader super taught in Ninety nine [noise]\nSeven thirty and Ken we are with your top stories better have a plan B if you plan to take your kid's trick or treating this week gap me will be along they tell you why during the ... forecast in traffic in five minutes\nSpeaking of traffic highway one hundred at least a portion of it still close there in Bellevue for a crime scene investigation metro police tweeting out more information\nThey say forty five year old Eric helping Stein was shot and killed in his vehicle wild chasing people he saw breaking into cars outside his home on metal red circle please ask anyone in the traits side subdivision who's vehicle was tampered with or may have home security cameras to call them\nAnd numbers posted on our Twitter and Facebook pages\nElection twenty Eighteen South Carolina US Senator Lindsey Graham campaigning for Marsha Blackburn yesterday said the migrant caravan and Brett Kavanaugh's confirmation protests have backfired on the left\nThere is a division and the Democratic party this real\nThis has been a nightmare for red state Democrats meanwhile\nBlack lives matter protesters interrupted the rally reportedly during a moment of silence for the Pittsburgh synagogue attack\nAt least one of the protesters had to be forcibly removed from the rally by police afterward Marsha Blackburn I have\nHeard people interrupting a moment of silence so they can have a protest I think that's just the\nNews too says the British in campaign responded to the protesters calling it a shame that people disrupted the event but then went on to say time to turn down the partisan rhetoric\nNashville meanwhile will pause to remember the lives lost in the Pittsburgh synagogue attack the Jewish community Waldo vigil tonight at the temple congregation on Harding pike and is open to everyone Robert ... hours the man accused of killing eleven people including injuring three police officers at the synagogue in Pittsburgh goes before a judge today\nPittsburgh synagogues shooter posted anti Semitic rats in the form site gab he took aim at a Jewish non profit called highest which helps to resettle refugees in the U.S he accused Jews organizing in funding the Central American migrants caravan\nThe Anti Defamation league recently showed a big increase in the amount of anti Semitic content on social media and it's gone automated\nAfter studying thousands of anti Semitic tweets on Twitter from ... to August through mid September they found that thirty percent of the post were published by bot accounts Steve cast in New York\nMade while the Florida Man accused of sending packages containing explosive material rather alleged this explosive material the prominent Democrats and supporters is due to make his first court appearance an initial hearing said for this afternoon and Florida federal court for fifty six year old Cesar ...\nThe faces five federal charges say I was arrested friday and Florida after investigators said they identified him through fingerprinting DNA evidence migrant caravan update Newsweek says uh twenty six year old Honduran\nWho had been traveling to the U.S border with that caravan of Central American asylum seekers died in a class with Mexican authorities yesterday happening after Mexican believes close the gate on the Guatemalan border meanwhile on Fox News Sunday secretary of homeland security cures to Nelson said that caravans not getting in\nThere is a legal way to enter this country a case to enter illegally and we'll be stopped ... we're working with our partners in Mexico they had taken a precedent it efforts are within their territory I can ensure an orderly flow and that they had no legal right to be there are removed or we intend to do the same\nThat is the latest news ... buy staples traffic and whether next time Ken Weaver W now at staples\nFrom the genesis diamonds tell you to young projects\nThat are still doing well several different accidents on the interstate one twenty four west ... Riley parkway the right lane has blocked in twenty four west ...\nTwenty forty found downtown Shelby avenue we've Iraq there were two lanes blocked and also in Montgomery County ... between highway Seventy six ... road there's two separate vehicle accidents and that area\nAnd fear of you I forty eastern after highway Ninety six we have a wreck there\nAnd the shoulders Boston I sixty five South Vietnam veterans boulevard a real mess on sixty five south I'm just north of downtown after trinity lane near for an avenue of big wrecked through their the left and center lanes are blocked and also be on the lookout for an accident in Germantown I sixty five south on Rosa Parks boulevard that records onto the ramp to sixty five southbound\nI'm Joshua Clay traffic every ten minutes every morning on super talk now\nDid you know new homes are more airtight this creates more indoor air pollution\nHarmful gases chemicals allergens and other pollutants build up and get trapped inside reaching unsafe levels the EPA now Rick's indoor air pollution as a top five environmental danger let precision air test your air to identify the pollutants in Europe and offer affordable solutions to clean up your air festival precision air celebrating twenty five years surveyed middle\nTennessee by offering it free air quality time with your spring to drop coverage is a must\nSo called the experts you trust called six foot five eight three four three triple seven online at ... dot com your local dyke and comfort pro\nDot com boom in Capital Management weather's here's your forewarn weather forecasts [noise]\nAbsolutely beautiful to start off\nThe week we have the sunshine we have temperatures right where they should be today mid to upper sixties for your high tonight if plans take you out without a highly recommend it mainly there's guys in temperatures dropping down into the middle forties is over should be for the town here today very similar just warmer with high in the\nUpper sat and the fourth one weather center and they\nShow this weekend and county actually an extra two thirty nine\nNine to five Saturday and Sunday\nSo don't you dare miss [noise]\n... ever wonder why European seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German and best of all you remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning out in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try babble for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight\nHey it's seven thirty centered on Nashville's wanting news this is your friend and radio buddy Brian Wilson and I'm here to bring you some information and news things you need to scratch your day [noise] uh and uh you know more important story I think perhaps than what's going on with this um [noise] this caravan of migrants\nWhy is that we're not supposed to call them migrants who could remind me how people who are migrating\nCentral America and trying to get to the U.S border they're migrating\nTherefore would may not be migrants\nI have a hard time understanding why that's a problem but uh they're headed this way slowly surely imperceptibly marching sometimes being driven in trucks\nI'm a ... but the the I think the whole thing is sort of designed for a showdown on the border just before the election that's the way it seems to me I and you know what I at first I thought maybe Democrats were behind this but now I'm sort of of the opinion that this will ... will actually work\nTo the president's benefit letter you know whether that there'd be a showdown let this be the thing that we're talking about as we headed to the uh the\nPolls on election day 'cause I think most Americans still have an issue which is open borders that the Democrats want\nA so there's that all that is going on and against that backdrop the president has said that if he needs to he'll send down\nActive duty forces to the border now there's already national\nGuard down there doing support worked for ah the border patrol the border patrol is the law enforcement organization on the ground that has arrest a powers National Guard gives them air support and all kinds of support 'em but they're there to back up the border patrol\nNow they're talking about sending maybe as many as two thousand two thousand troops down that way I read this and I mean rage of this story comes out of Prague because a secretary Jim Mattis is traveling using Prague jackals of occupy\nThe U.S military has already begun delivering Jersey barriers to the southern border in conjunction with plans to deploy active duty troops there us defense secretary Jim Mattis said Sunday as a caravan of Central Americans slowly heads across Mexico toward the United states\nMatter still reporters traveling with him that details of the department are still being worked out but he should have them and as as possession by last night they include exactly how many forces will be needed\nThe additional troops will provide logistical and other support to the border patrol and will bolster the efforts of the approximately two thousand National Guard forces already there are new forces are expected to provide logistical assistance such as air support and equipment including vehicles and tents this uh account\nConverted to Judaism married to her son to her son in law is a very active or been very faithful Jew\nSo set that aside for a moment\nSet aside the fact that you can't find any evidence that Donald Trump has ever said one bad thing about people of the Jewish faith\nThey immediately tried to say well it's his rhetoric gets this cowed rather well here's a little factoid for you turns out this guy a dozen what Donald Trump it all in fact his social media postings are full of attacks on Donald Trump ... he wouldn't be following the president's rhetoric\nHe would be a someone who disagreed with the president\nYou notice also that that that's in the news media are not trying to hold to account certain democratic members of Congress\nAnd elsewhere are members of the left to support the minister Louis Farrakhan whose views his anti Semitic racism all the time where is is is that tire where are the mainstream media stories\nThat are are are pointing to Democrats who refused to denounce the things that Louis Farrakhan has said about the Jewish people of the Jewish faith where's that you're not going to find it because it doesn't exist\nUm\nThis was a tragedy pure and simple this guy was an anti Semite and an nuts\nAnd or is it is a sad moment in American this may be the deadliest anti Semitic attack in the history of the United states and it is sad but it is also said that the mainstream media can't just covered the event without trying to turn it into something political\nI mean uh [noise]\nSarah Huckabee Sanders was this weekend or had to go out and defend the president and and made a point of pointing out that the Washington Post said this story or they tried to try a tie all this terror to the president\nShe said look is there is there any tragedy the Washington Post won't exploit I think it's a fair question\nA sad moment in American history and it is sad that ah the mainstream media can't just take a moment to mourn the loss of life\nAnd to try to find out what's going on to bring us facts instead of opinion about who was responsible because the facts to back up their point of opinion by the way seven fifty three now on Nashville's morning news\nLater this morning on the Michael ... shows so much more than just left versus right so often it's a right versus Ron we make sense of the news on the Nextel journal neither new right here on silver talk Ninety nine seven\nLately it seems like everything we use every day is getting an upgrade on the bed we sleep in the race that we use when we wake up that we've neglected one of the more important products in the daily routine that old worn out toothbrush I'm Simon and ... and I'm a product designer after I learn how important brushing your teeth is to overall health\nI was at the dentist to ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable\nQuit sensitive suddenly vibrations that a gentle on your gums and a built in time at pulse as the guy do around your mouth\nAll packed into a beautifully slim and dies Eli medium design we also deliver fresh brush heads on a dentist recommended schedule just five dollars for three shifting attention to the section an clip the time magazine distinction one of the best intentions of the upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill plan sign up now like get quip dot com slash W W L and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W A L\nYou make like please not to drive\nEver wonder why Europeans seem to speak so many languages maybe it's because they used battle the number one selling language learning up and Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German and best of all you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real life conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning happen Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for aid for eight\nYou'll see one or earnings growing up we are and more\nYou know if you've been caught um squeaking board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a soda arena [noise]\nAt monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for a fair price real human being humid how's that sound\nWill probably like the opposite of this marker [noise]\nCalled eight eight eight months to to talk to someone without Louis today\nFrom the genesis diamonds value to young traffic center\nJust picked up a new graduate I sixty bucks out by the long haul the pike is still working on several other accidents downtown shoulders walk like twenty four he's found a shall we avenue and I'm twenty four west ... before we get to violate parkway will wreck their shoulder box and I'm like twenty four west ... boulevard I've already West I'm Lin wood wrote in Wilson county we have to separate accidents in that area\nAnd we have a four vehicle accident fair view at forty east out after highway Ninety six I suspect South Vietnam veterans boulevard the left shoulders block\nAnd also the crash of twenty four west bound after new hope road and she'd um county and in Germantown this ramp restrictions on my sixty five south by Rosa Parks boulevard there's an accident going on to the ramp dies sixty five and be on the lookout for crash in Madison ... park way I'm Joshua ... traffic every ten minutes every morning on super talk Ninety nine\n... say two exceeds any expectation or any dream I could've ever had about a hospital I was told we wouldn't get a bill or I didn't quite process that houses possible as far as ... through all the wonderful people who donate I don't know they are aware of what they do\nThey're saving children's lives every day\nSaint Jude children's research hospital finding cures in children learn more at Saint Jude dot org\nZero eight hundred beacon Capital Management weather's here's your forewarn weather forecast\nDelightful sunshiny seasonal temperature today that top or sixty four year high rent free and those clear skies stick around tonight a lower forty five enjoy for the fourth one weather center and we're all ...\nIn North Carolina is on Mont down after one person was shot a suspect is in custody what they do on this and more coming up at age ... nine seven WPN\nDow futures off one fifty nine is it'd be futures are twenty seven mashed futures are fighting to this rocket by ... Capital Management learned more became ... coming up and just a moment ... the chairman of the Tennessee GOP party Scott golden will join us I don't want to tell you two stories where the media are not giving it to use strange\nIt's all straight ahead right here on\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up but we've neglected one of the more impulsive products and the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health I worked with dentist to ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip how sensitive stomach vibrations that a gentle on your gums and built in time and that poses to guide you around your mouth old typed into a beautifully slim and dies I leave him design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with\nFree shipping backed by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dental associations upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack free at G. E. D. U. I. P. dot com slash W W O\nO better life with Dr Sanjay Gupta butter chocolate chip cookies so addictive [noise]\nI'm Dr Sanjay Gupta CNN chief medical correspondent one of my colleagues says it's because they're so delicious and the story but there's really more to it than that then it helps contributor Lisa Dreher spoke with Kathleen king founder of tapes they chop\nWe're working for every vote so that's what we've got to do but you know we'll take whatever information they've got and move on from there\nAll right so I did that sounds good but as you know the the the Blackburn British and race is according to some of the post tight\nI mean there are some that show that is a runaway for Marsha Blackburn with her but also pose let's say that it's very much within the margin of error in fact one poll that shows Bredesen up by one what's your take on where that race stands\nYeah so I mean I don't I don't think it I mean for the for the outliers and then the New York times said Marsha Blackburn a couple of weeks ago ... fourteen points\nAnd then of course the band a real all had set up by one if you look into the into the details of the band above all um it it was done with registered voters I mean that's a very unreliable well\nUh I mean you know obviously in a in this cycle but election you're looking at a likely voter who's going to be heading out that the to the old\nUh you know my my what I generally do is kind of throw out the high throw out below and then you kind of look and you know average it all out so\nUm I I think it's close and of course obviously governor but it's been just sit back into his pocket for another two million bringing his whole investment up to six or seven million dollars of his own money that is put into this\nElection so anytime you have a candidate that willing to buy an election you have to keep working at it\nI I um I I noticed the comments of well Lindsey Graham yesterday to Marsha Blackburn event and he believes that it's it's the Kavanaugh and the caravan managed driving Republican excitement about this election or or passion or maybe just a better word what's your take on\nI I think that er Graham is absolutely correct but I mean there's another element in the sun and you know it just I I mean I Know you and I we're gonna talk before we had the event yesterday but if somebody that was literally on the lectern\nA win this and I and there wasn't a protest by the way it was a fight and let's just call it what it is\nThat uh that there were a couple of people that started screaming and they were partly escorted out but then there were a couple that you know engaged in a physical activity with the police that what was going on while I was on stage watching this I was watching\nFor Blackburn you know a couple of hundred you know people in the audience and and they're getting body slammed up again by protestor that refused to leave that was grabbing the chair I mean it got fairly chaotic there for a little bit again this was in a peaceful protests this was\nIn your face I'm In Europe that I'm not leaving you make me to leave\n'em if you try to make me leave I Will get into a physical altercation with you that the other underlying thing of what's going on I set up on the stage at that if you want to know what this election is about it's about that it is about people that have\nThis resistance movement of you know you are wrong because I Believe that you're wrong I mean there's you know we're not looking for common ground to debate issues ... real wrong and I'm right and that's where the modern progressive soaked with movement is in this state it's unfortunate\nI rent one quick give me your sense of the governor's race\nOr I think a a Billy have run a incredibly smart\nCampaign agree he is a wonderful\nA person have done a great job I mean I you know him going through all ... counties cutting corners of Tennessee he listens to what people have to say though we learning is gonna be a great job and are for the state of Tennessee I'm just looking for a a nine more days\nAnd and both we having globally and Marsha Blackburn lead our ticket a there's a lot of excitement even among\nOr the state house state Senate races or you've got a great one there a couple of great ones there in Nashville so I just encourage everybody to get out go make their voice heard this is you know the elections are I fight all the time they're not about the candidates there are about the people in what type of representation I Want\nOkay Scott we're going to leave it right there I could I could I ask you a favor I Would like you to come back after the like the day after the election I knew it will be a long night but it'd be a long night for a lot of people can get you to come back and talk about what the results are once we have them\nAbsolutely I stay up and be with you or am\nI going to do it that way I look at everybody get out and vote right you're the best\nScientists thank you Scott British in an aide fourteen now on double duty him\nOn the next ten men to show the investigation continues into the demos during the later today each one of us that comes to protecting them and I\nSee on our running so uh the squeaking way toward marker\nAssuming office newest at most or we can't stop that noise but we can play it on the news around and finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified Ken is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they must have talked to someone without noise today\nIt's official genesis diamonds with just voted by the people the music city is the best jewelry store and the best\nPlace to buy an engagement ring not once twice five times but ten times in a room ten straight years again and again genesis wins in both content best jewelry store in this place to buy an engagement ring\nFrom all of us the genesis we say heartfelt thank you with nearly fifty thousand customers who are humbled and on and this was ... confidence leaving after ten years of being voted number one we're still growing and feel we can be even better and that's why we always guarantee the best prices versus any other news stories and the strongest guarantees any industry our mission is to\nAlways think as of August to make your Julie shopping experience even better than to continue to amaze you on every level constantly getting back to this amazing city in Nashville, Tennessee\nAnd engagement rings\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career in case you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W ... carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nPM dot com from the genesis diamonds value to young traffic center\nJust picked up a new crash west of town I Would ease founding reforming lane and still working on this crash and sixty five south on after Vietnam veterans boulevard the right lane has blocked and she'd them county we have an accident like twenty four west bend after new hope road and also still working on this crash in Wilson county to separate accidents that I thought he was found out when when rose\nI twenty four west Donald degree boulevard we have a wreck they're causing the way it's still working on a crash but Leslie in Boston I sixty five south down south of long haul the pike also keep\nIn mind out and Bellevue a highway whenever between temple wrote an older we boulevard is closed due to a police investigation from earlier this morning again having one hundred between temple wrote an old degree boulevard is still closed I'm Josh ... traffic every ten minutes every morning on super jock Ninety nine cent\nRaise me please not talked to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German in basketball you'll remember what you've learned\nI always thought I was bad in languages but after using ... I can tell you I was just taught the wrong way\nUsing mammals ten to Fifteen minute lessons you can be speaking confidently in your new language within weeks\nHe was a nice that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning happen Europe trying for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for aid for eight to ...\nMillion Capital Management weather's here's your forewarn weather forecasting\nDelightful sunshiny season low temperatures today for sixty four year high range free and it was clear skies stick around tonight of low a forty five enjoying the warm weather center and we're all get along [noise]\nBrian Wilson of acetylene listen a couple of quick stories\nHas sent for the record I mean doesn't go on\nThey are very loudly doesn't say very often but I officially when you ask his spokesperson where is the mayor on amendment one this community oversight board that someone is set up on police\nI always thought I was the added languages but after using apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning out in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try babble for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight ... dot com [noise]\nInformation few top ... these these bills numerous and talk leader super tall Ninety nine\nThirty I'm Ken we are with your time\nStory kids might want to go is fish this Halloween looks like rain full forecasts traffic updates coming up in five minutes breaking news about Ninety One miles north east of Nashville reports\nSaid three people were shot on a clay county a highway at least one person lie flooded to the hospital here in Nashville schools that are in Clayton County or on what's called soft lockdown\nReport said that a school bus drove up and then the driver rented aid to the victims who had been shot again at least one of those people shot flown here to Nashville stay with super ... nine seven WGM for continuing coverage\nMeanwhile in North Carolina authorities say a student was shot and wounded by another student at uh North Carolina high school just south of Charlotte\nAnd that one of those uh involved has been taken into custody as soon as had to butler high school about twelve miles south of Charlotte here in Nashville metro police say a man was shot and killed while chasing people eat caught breaking into cars overnight\nThey've identified him as forty five year old Eric helping Stein he was founded as vehicle that are run off highway one hundred about two and a half miles away from his home please ask anyone in the trace side subdivision who's vehicle was tampered with or may have home security cameras to call them\nWe posted those numbers on our Facebook and Twitter feeds election twenty Eighteen Tennessee Republican Party chairs got golden telling WTO's Nashville's morning news early voting turnout continues to be strong\nFor only about Fifteen to Eighteen percent off of wanting thing which of course we know how that went so so you're looking at nine hundred and sixty thousand walk across a million today\nGolden pills at W. tens Brian Wilson the black burned bred to send US Senate race is close he said protesters at the Blackburn rally in West Nashville yesterday we're far from peaceful\n[laughter] the microphones right next to the action there that was Brian Wilson\nSouth Carolina US Senator Lindsey Graham was at the rally in support of black burn and said the left supported the migrant caravan of protests against Brett Kavanaugh have backfired\nThe unifying effect of the\nOverwhelming no Republican has accomplished with the Democrats were able to do\nTo bring us together Nashville will pause to remember the lives lost in the Pittsburgh synagogue attack today the Jewish community to hold a vigil at the temple congregation on Harding pike and they say it is open to everyone meanwhile belief still searching the Homer Robert Bowers the man accused of carrying out that attack in Pittsburgh\nResident Trump has said he plans to visit Pittsburgh sometime this week but a group of progressive Jewish leaders wrote a letter saying he's not welcome here unless he denounces white nationalism\nWell Jessica dean says ... tweeted his distaste for President Trump as well as Jews Bowers expected to appear in federal court today\nMan accused of mailing bomb threats to fourteen people including twelve prominent Democrats last week goes before a judge today rows of Florida says authorities say they tied Caesar say out to the passengers last week the packages that is last week through DNA\nCauses we know that this case will be prosecuted out of the southern district of New York sample also need a removal hearing now from what we understand that hearing can be held today it could be held this week it all depends on what transpires today\nMigrant caravan update Newsweek says uh twenty six year old Honduran men died in a clash with Mexico border police on Sunday report said the clash happened at the Mexican police close the gate to the caravan\nThere right at the Guatemalan border as the latest news by ... by estrogen temporal scanner thermometer trafficking whether next time can we ever ...\nSymptoms from the genesis diamonds WPN traffic center\nTraffic still pretty slow when I sixty five south bound to sixty five twenty four split as you get the trinity lane and also of on the east side of town I forty west bound passing passers wind leaning in twenty four forty split downtown have a couple of ... forty west bound that limb would road in Wilson county to separate accidents in that area and in ... county like twenty four west bound after new hope road we have a wreck their\nI forty eastbound ... Iraq\nAnd up and river gave the right lanes blocked that I sixty five south out after Vietnam veterans boulevard due to Iraq they're\nAlready Nashville still working on this ... south by Cleveland street and in math can be on the lookout for a couple of ... Riley parkway and other ... just north of due west avenue I'm Josh look like traffic every ten minutes every morning on super talk Ninety nine house dot com\nBeacon Capital Management weather's here's your forewarn weather forecasts [noise]\nAbsolutely beautiful it started off\nThe week we have the sunshine we have temperatures right where they should be today mid to upper sixties for your high tonight if plans take you out and about a highly recommend it mainly clear skies and temperatures dropping down into the middle forties this is what we should be for the town here today very similar just warmer with high in the upper seventies\nAnd the fourth one weather center and we\nSee on our learning so a squeaking way toward marker\nAssuming office newest at most or we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price because that's\nReally sounds like the opposite of this marker\n... eighty they'd most are to talk to someone without noise today\nGoodman show this week in the county actually an extra two thirty\nBy Saturday and Sunday\nSo don't you dare missile [noise]\nNashville's morning news that families are music means it's time for the gang of foreign the gang of ...\nAre the bearded wander in the newsroom can't waiver oh all refreshing twenty three hour nap overnight no\nAll right good for you Chris Rock Chris Weber's in the er the student central room controlling things\nChris I'm I'm just trying to figure out I have a thought only three hours oh I'm In mental health [noise] twenty three minutes ... and I was going to say\nI Would like a twenty three hour and I think you know it would go for it and and I stand Mandel oh who's here in the studio with me\nThe gang for the gang of for the gang of four so yesterday I went out to the Blackburn thing you know and given protesters cookies or ... don't get me started about ... yes I gave a protest you're right you're like the police chief it went out and gave all those protests ... no no these are not getting me no she was a\nProtester which she needed she's in a wheelchair this little woman ... up in a wheelchair I'm done I got to tell the story I'm Sorry I ... and as you have done that and she sent rolled up next to me and then a moment later she said you know is there any water\nI said yes I'll get you some water and then you want to cooking a broader a cookie and I gave her and she said turn and drink of water Nader cooking or wheelchair you know what I mentioned she rolled off turns out she's one of the protesters\nYou roll over your foot normally [laughter] I I and and then I later saw her outside she wasn't in the wheelchair anymore yeah she's standing up I think the brightest in headquarters right down the road if you'd like to deliver some breakfast like they're going to do that no huh\nUh [laughter] so I I was ... to buy a protester and I gave her a cookie and I'm In I'm completely disgusted by myself for doing that not seeing through 'cause I'm usually pretty good at spotting yeah I can see them a mile away sure yeah man away by the way while I was there\nA there next to the stage outcomes ray Stevens\nBecause this was a cabaret ride with with the new ... no no he's wearing a leave of like you\nKnow that he was not doing the street kinda ladies do but he didn't come out and and I said I'd see came out of the race Stevens hello I'm Brian Wilson I last time I saw ray Stevens it was at a distance ... he was at the at the pie wagon having lunch and I didn't I did not engage\n'cause I didn't want to interrupt demands watch what I did say hello and I shook his should have taken him a cookie yeah yeah he looked like he can I used to cook now yeah I well if I if I only saw it but I'd only given away the cooking so too late for that point\nAnd and then I ran into beat reducing\nFrom Fox News Fox News will air he was out there so bad that I think he was trailing a a gram on his tour 'cause the audit Graham was was also making a stop last night I think in Missouri for the Claire McCaskill rich yeah and uh so you so I think he was doing that story and I got to catch up briefly with Peter I was", "year": "2018", "show_name": "Nashville's Morning News", "city": "Hendersonville", "day": "29"}