{"month": "10", "state": "AZ", "station": "KOFA", "content": "We also broadcasts an Arizona community radio network at eighty nine point five that's engaging the age ... Williams Ninety One F. M. K. J. C. P. Prescott Ninety point seven F. M. K. J. C. K. king meant in Ninety One point three offense like staff\nScattered showers and thunder storms in the forecast for king mentioned I was partly cloudy skies lower on fifty for tomorrow Sunday with a high and you're Seventy six and you mentioned I mostly Claudio ... sixty eight tomorrow twenty percent chance of rain was mostly Kurdish guy behind your eighty to\n... percent chance of showers in Prescott this evening a little run forty five tomorrow twenty percent chance of brain was mostly sunny skies on your sixty seven\nThirty percent chance of showers in Flagstaff this evening with the most ... guys and a low rent thirty six small ten percent chance of showers but mostly sunny skies and hike near sixty\n\n\nOh look into the global village on time\nTo send in the global village we celebrate Polanski Memorial Day at the core by President Obama in a twenty Fifteen proclamation a tribute to polish noble men and soldier chasm you're ... you're on the American revolution they've George Washington and is no\nTwenty fifteenth uncle nation a tribute to polish noble men and soldier customer Polanski you're on the American revolution you save ... George Washington and he was known as the mother of the American family\nWe will celebrate with contemporary polish in Polish American music a celebration of the last few Memorial Day this time in the global village\n\n\nDo you do know that they\nThat day\nKnow and then they\nGood no then zoom they\nKnow that you're saying\nKnow that\n\nKnow ... hours\nKnow just a day\nNow but I I have a friend Jim may\n\nEnough of a man may\nKnow just like every\nSaying I\nThey are not that big\n[noise] [noise]\n\n[noise]\n[noise]\nNo man\nI Know that there isn't a day\nEvery now and\nI Know that there is no they\nHave that then they\nNow than there may\nI Know that there is no and\nKnow just right on man\n[noise] [noise]\n\nNo no no no no\nNo no love on a lot of\nWho was\nThe one day they well\n\nThe bad\nGuy on\nDollar a man\nNamed metal on them and then they\nNow\nTaking a little journey on that close to merge caravan there was a ... year ban\nNow known as the best or quartet headed up by a marvelous accordion is by the name of yellow slough best er and they do some really fascinating music dry non traditional polish music on ... on jazz influences and ... fantastic musicianship as well\nFrom the album the warriors city called ... band with more care of and we also heard some music from Maria ... and a group of Senegalese musicians crippled ... day they teamed up for a release Cold War sell the car\nAnd from that we heard in the mail and we started with the Warsaw afro beat orchestra from their album Wendell Lou inspired by afro beat by reggae\nSome other influences that they work into the mix as well a different sounds coming out of Poland and from then we heard no such thing we're highlighting some contemporary sounds from Poland this time here in the global village will take a quick break when we return\nWe'll explore some of the bands that are part of that I think what it is true in a number of different parts of the world to really vibrant folk scene and Neal folk scene that's been emerging and we'll hear some I find folks from the ... ... ... trio that's coming up and just a minute we're back here in the global village\nThinks women's and its border radio searching twenty eight year major but we also broadcast on the other was on a community radio network in Prescott demon black stuff and Williams\nToday's border radio day sponsors the band big daddy D. and the dynamite playing a blend of American roots rock and rhythm and blues burnt up tempo sound to keep the dance floor filled\nBig Betty Dina dynamite performing tomorrow evening from six to nine at the view distillery four hundred north Washington avenue in Prescott learn more on Facebook or\nA brochure first produced by the Arizona highway department in Nineteen twenty five Arizona highways evolved\nInto one of the most respected and rebuild publications in the world\nJoin K. A. W. sea and retired Arizona highways publisher when hold and\nAt the next spirited discussion to learn the story of this remarkable magazine Wednesday November seventh from five thirty to seven at St Paul's cultural center for information visit K. A. W. C. dot org there's been made possible in part by a grant from Arizona humanities\nSt Paul's cultural center for information does it can't AWAC dot org they should have been made possible in part by a grant from Arizona you may\nYou\nBe\n\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\nWell\nWhat about the whole they\nWoke painting on the like\nThe most so much raised\nHer my bed\nYou can have my ... my ... year bond on a new kind of dog even read bring my keys\nYou had that he was gonna be a joke about like the gun you will have that he\n\n\nBang\nBang\n\nJust because you think you're ready though\nBecause you think you are so high\nThat just because you think you got\nThat nobody else had God\nCaused me to ban all my money\nLast call meals banning call\nI'm telling you I'm\n\n\n\n\n\n\n\nJust because you think you're still pretty\nSo just because they you know how\nMuch we call it they knew that some day\nThat no one else has gone\nYou mean just man all my money\nWhen you laugh when he called are you\nNine years I mean I'm\n\nDon't believe anymore on\nDoing three year old may\nRevealed who when you're\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n\nSo do something different I think we're we're doing that this time here in the global village as we explore some sounds from Poland in various forms and there was a band that may poker punky\nAnd popular to a whole new audience brave combo and their classic to do something different we also heard so one of the legends of American poker Frankie ... with one of his kids\nJust because he also had a big hit with a song we heard in front of that so many people who recorded it over the years it's a classic who's still ... and we heard a version of it from Berlin Seventeen hippies\nAnd that from their debut album rock and roll Thirteen also in there so much traditional groups from Poland and some really neat stuff that is coming from these groups and the bands like it to across Poland\nThere we heard a music from taking a walk off from the dancing album ... is a song that we heard from there dancing sets a group from South central Poland from the city of kill so\nAnd then there as well ah family band as we mentioned with a a long history of a musician in the family and even some instruments that has remained in the family over the years they're called\n... and we heard some music from their album is working people you have to and all that began with a really need to I was on full group they are from central Poland as well\nAnd they are headed up by ... trio\nFrom the Missouri album or a really beautiful piece from that said as we again highlight some sounds from Poland this time here in the global village were back in just a minute actually with a polish artist based in America in Chicago who has become quite the popular jazz artists not only in this country but uh as well in Poland which has\nQuite a vibrant jazz scene as well will lead dip into an album from goes you know a goose chick called river and actually will hear her version of\nBucky on this Brazil era and she will be joined by a nursery her do a little bit earlier the marvelous accordion is your ... that's coming up and just a minute when we return here to the global village\nYou try and get bored or radio searching twenty I Am a new mom on your radio catches on line at border radio ABC dot org ... just\nWhen you get ... Thirteen twenty I Am a new mom on your radio catches on line at border way too easy dot org well you ... to ... just search K O F eight\nDecember libraries celebrating the ... with the ... system viewing of a film adaptation it's ongoing now through senator sober Thirteen at the ... library which is located at ten Seventy five no sixth avenue families it'd be like more information you can contact us at night to wait three or four seven six nine zero\nMultiply these guys in Yuma tonight a low rent sixty degrees tomorrow a twenty percent chance of showers is mostly ... eighty to ... scattered showers and thunderstorms partly cloudy skies low rent fifty for tomorrow Sunday with the heightened you're Seventy six", "show_name": "Global Village", "year": "2018", "city": "Yuma", "day": "12"}