{"month": "10", "state": "AZ", "station": "KOFA", "content": "Mine Josh ... for the Latin alternative technical producer is David Michaels for W. E. X. two the Latin alternative is a production of Josh nor an exit Ninety seven seven W. E. X. P. Amsterdam New York I Lived here supported service of W.\nM. K. U. S. they Yuma motor radio ... am and border radio eighty Donald\nYou also broadcast on the other was on a community radio network at eighty nine point by as same cage Jay Z a drink Williams Ninety point one F same cage Jay Z peep Prescott Ninety point seven FM gay Jay Z gate Kingman and Ninety One point three FM\nShowers and possible thunderstorms in human tonight a low around Seventy five mostly cloudy skies tomorrow with the high on your eighty eight sixty percent chance of showers in Kingman tonight sixty percent chance of showers possible thunderstorms cloudy lower I'm sixty four tomorrow Seventy percent chance of showers mostly ... guys uh hind you're Seventy eight\nIn Prescott tonight showers and thunderstorms slow around fifty six tomorrow chosen thunder storms possible heavy rainfall hind you're sixty six in ... hours and thunderstorms slow run fifty two and tomorrow showers and thunderstorms high near sixty to\n\n\nWelcome to the global village ...\n\nIt's of showers mostly ... behind you're Seventy eight in Prescott tonight showers and thunder storms blow around fifty six tomorrow showers and thunder storms possible heavy rainfall hind you're sixty six in flight step tonight showers and thunderstorms slow run fifty two and tomorrow showers and thunderstorms Hi you're sixty to\n\nA\n\nWhole will come to the global village I'm ...\n\nI'm In the global village a special edition of the show is we celebrate the birthday of fuel to indoor one of the joint figures the Senegalese music and joined figures of international world music is well\nWe'll have like the music from throughout his career as a special guest appearances that he may but we'll begin at the beginning or at least the beginning of his international recognition and Nineteen eighty seven when he toured along with Peter Gabriel over a quarter of a century after that tour a live album featuring music from its was released here from that a phone call my daughter\nMusic from you'll soon doors to begin the system and the special birthday celebration here in the global village [noise]\n\n[laughter]\n\n\n\nDe\n\nBit of a man\nMiddle\nOn\n\nYour name\n\nKnow that he\nWill\nWhoa whoa whoa\nTiny tiny\nAny\n\nTimes when you're going back to work\n\n[laughter]\n\n[laughter]\n[laughter] they were\n\n[laughter]\n[noise]\n\n\n\nDon't know I mean for me\nTo be\n[noise]\n\nYeah and then\n\n\n\n\nA\nA [noise] a language learning a lot of anger ah\n[noise] [noise]\n[noise]\n\n[noise] [noise]\nAnd when I was like ah\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\nThey didn't really eat bugs get lonely you um [noise]\n\nSomebody eat them all day and then you look a little a deacon in you know ... ... s\nWin the\nThat\n\nThey didn't you know like my little one you bomb bomb them what you may vitamin ... and yet\nYou don't like the young you know I'm not I'm not only the only guy you know all\nThem are you going to do much but I got on a\nOn a\nRegular\nGuy\nNa\nNa\nNa\nNa\nNa na\nNa na\nNa\nNa na na\nThat little you know they\nNa\nNa na\nNa ve\n\n\nLot of\n\nTo you know\nWe\nBe\nThe\nKnow oh no\nOh\n\n\n\nThe\nAnd\n\nFriend\nMy mom and the guy\n\nDa da da\nDa da\n\nNa na na na man now the\n\n\n\nMom and I wouldn't [noise]\nNo no no no man\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\nWow\n\n\n\n\n[noise]\nMoney will go on line or\n[noise]\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\nSomething a little bit different from you also indoor although now one of the trademarks of his artistry has been his ability to incorporate so many different influences into his music there\nA special guest with Harry Belafonte never called paradise and guts and cooler than actually drew pretty heavily on music of South Africa and the soul brothers known for their arrest soulful Oregon based style part of that particular track as well sweet sister\nAnd in front of that uh a couple of artists from Senegal that's just one door worked with he was the producer for an album that came out from shake low that also was recorded in his studio in the car\nThe album called bump Iglesias from shake lower and the tree was the piece that we heard from that by the way the saxophone and that was from ... to probably best known as one of the ... orange that worked with James Brown\nAnd a special guest as well on the album music or from the Senegalese artist ... D\nGo way is the tune that we heard from that set here in the global villages were celebrating the birthday today of the OSU indoor will take a quick break and when we return\nThe album that one yes to endure a Grammy his release called Egypt that explored the mystical tradition of Islam and also ah brought together the musical world to Senegal in Egypt the album called Egypt will hear music from it in just a minute here in the global village\nYou're tuned into border radio on Thirteen twenty am K O F a a border radio ... dot org we also broadcast on the Arizona community radio network\nBorder radio is supported by ... regional medical center focused on advancing hurt carrying you why our embassies cardiologist and heart surgeon specialize in all aspects of cardiology including preventative intervention in surgical learn more about the many advancements in her care Yuma regional dot org slash heart care\nShowers in human tonight below around Seventy five with some possible thunderstorms mostly cloudy tomorrow behind your eighty eight and sixty percent chance of showers tonight in Kingman sixty percent chance of showers cloudy low around sixty four tomorrow Seventy percent chance of showers mostly cloudy skies hind you're Seventy eight in Prescott tonight showers and thunderstorms all around fifty six tomorrow\nChosen thunderstorms with some possible heavy rainfall and behind you're sixty six in Flagstaff tonight showers and thunderstorms low around fifty two tomorrow chosen thunderstorm time you're sixty two\nUma regional dot org slash park here\nShowers in human tonight below around Seventy five with some possible thunderstorms mostly cloudy tomorrow behind your eighty eight and sixty percent chance of showers tonight in Kingman sixty percent chance of showers cloudy low around sixty four tomorrow Seventy percent chance of showers most of these guys are high and you're Seventy eight\nIn Prescott tonight showers and thunderstorms a low around fifty six tomorrow showers and thunderstorms with some possible heavy rainfall and behind you're sixty six in like step tonight showers and thunderstorms lower around fifty two tomorrow showers and thunderstorms time you're sixty two\n\nAnd give them the money\n\n... million good or not but it's just\nThink I have no government\nThe ... you know many look down\nThe game my mama why do\nHe was just a guy", "year": "2018", "show_name": "Global Village", "city": "Yuma", "day": "02"}