{"month": "10", "state": "GA", "station": "WABE", "content": "You as a time and time again it's your monitor here at the doubts about the economy to come to copy right off the downright markets go up and markets go down other enemies is showcase that time and time again that that ... unwillingness to engage with the fact that if it's going up up up up it's when I go down at some point\nWe talked me for a minute about um ... we're going to get to this later in the program the trade war is still going on the Chinese and the United states still can't agree on on uh what to do about it there is a a ... effect that over time will take some of the air out of this comment\nOh absolutely I mean one hundred percent and we'll start to see it next year\nOr this is big this is a big deal and this is now that the the the terrorists are with China has been vastly expanded and may be vastly expanded again uh this is this is dramatic and um it's actually amazing that it has an impact at the markets until now\nWhere we're going to go back to a favorite of mine that actually it was suggested a budget or views or a Twitter fan of mine this morning he said listen let's do or what history of thinking and five words or less a which used to be of course the popular game shown on his what is Danielle I'm thinking if I were to less so David as you're counting on her fingers go Jay Powell is thinking today what in five words or less\nHow to keep him at bay that'd be six letter sorry X words how to keep him away keep your head or whether we would have say politicking five words or less it was like a haiku them stay the course calmly say let's find those off I'm a\nShe's a writer and I wish it was very late Gallagher a\nFortune Magazine David ... from MSNBC and uh NBC News give me the plug your definition of reality show started\nAm eastern time up would they be their hobby I'm California is a A R will not do that but I'm a big fan anyway ... thanks I\nSupport for WABC eat comes from Comcast Business providing a gig speed network that helps business get done\nComcast Business beyond fast\nLearn more at Comcast Business dot com and from booth western art museum offering more than six the original works by the world's best known American western artist in treasures from the Frederick Remington art museum and beyond through January thirteenth more booth museum dot org\n[noise] in a world where journalists are under fire [noise]\nCivil discussion things like a thing of the past but there are so [noise] like [noise] fighting for insight contests and connection\nGiving what they can month after month [noise]\nAnd now it's your turn to join the fight [noise] coming this fall\nAssisting there\nNow playing on public radio stations everywhere starring\nPay their I'm Joshua Johnson we all have a role in public radio it's time to play your partner [noise] here's how [noise]\n\nSix seven eight five five three Ninety Ninety war with a pledge on line it's a B. E. dot org [noise] it just takes a few minutes and then you will have done your party keep re programming like one day which is relatively new to\nW. E. B. E. great program I'm On the air as well as marketplace I'm Jim Burress along with I use a Hyman or director of individual giving your PVA it's friday evening if it was good\nAnd jazz and you know I gotta stay I Love that little piece that you just played because\nIt reminds me of of of something that the idea that supporters of public radio do something really heroic you know it's selfless you don't have to do it\nYou get to listen you can listen turn it on anytime you want for free and you don't have to give but you do any way\nWhat a heroic thing to do is I Love that little piece thanks for a plan that Jay You're welcome as what I Do and thank you for listening and then becoming an active participant doing that harrowing thing becoming a supporter of W. A. B. E. right now we're counting on hearing\nFrom you at six seven eight\nFive five three Ninety Ninety or you can make that contribution at W. A. B. E. dot org and\nYou may be getting off work and it's friday evening and you're so glad that it is as your head home you're thinking whoa whoa where's marketplace was back in just a moment or we're going to return to the program but what we're doing now during our full membership campaign is\nAsking for you to support the programming like marketplace that you've come to depend on\nSomebody once told me that it doesn't matter what you do as long as you're fighting the good fight and ... and Joshua Johnson there it was tongue in cheek but he was talking about the same thing that there's a we're fighting the good fight and that is in an age where there's a lot of noise and miss information somewhat called them lives\nThere is a mission here uh WABC and there's a mission at NPR and that is to seek truth to report it\nAnd to stick to facts and we can only do that when we have the support of our listeners that means when we have your support six Seventy five five three Ninety Ninety or W. B. B. eat out a word\nAnd midterm elections are right around the corner\nSo having that access to the truth having access to trusted information man I Can't think of another time when that would be more critical more important for us and so we know that you're counting on that from us from W. A. B. E. from NPR's as your source for that trusted information\nSo right now in order for that to to continue for us to to have what we need to go out into the next three weeks and continue to do that reporting we have to make our goal we absolutely have to make our goal six seven eight five five three Ninety Ninety or donate at W. A. B. E. dot org\nWhat does that go well it's seven thousand Seventy listeners who give it any amount of during this entire pledge drive or why Seventy Seventy\nBecause that's how long we've been on the air Seventy years W ... has been a source for Atlanta\nAnd we can only continue on in the future because of loose or support it is imperative not how much you give but just the fact that you do and you can do it so easily it's six seven eight five five three Ninety Ninety or W. B. B. E. dot org\nAnd knocked marketplace here on nine point one\nThis is marketplace I'm cha resolve this was the beginning of the new fall season for a lot of cultural and performing arts organizations around the country and it comes just about a year after the first public allegations against Harvey ones doing in the beginning of me to\nInflict Hollywood in corporate America and journalism or reckoning with revolutions of systemic sexual misconduct another abused should do our cultural non profits but for them the financial implications are perhaps more dire ... though\n[noise] New York city ballet spend hundreds of hours for her some for new season like a team is doing in this run through the check out at a recording here by the Kennedy [noise]\nEverything needs to be perfect in time for the star studded moneymaking followed gala that's attended by major league socialites like Jean Schaffer off a staple on the Gallup circuit\nMy husband and I attended the um the Metropolitan Opera gala we are patrons there at the opera we love the opera we had a fabulous time\nThe chef usually donate about one million a year to various cultural institutions and charities including city ballet\nBut arts organizations are concerned that patrons may think twice this year before giving after widespread allegations of sexual abuse it started when the Metropolitan Opera fired conductor James live on for alleged sexual harassment\nThen last month the New York philharmonic fire to musicians\nBut most shocking is a lawsuit against New York city ballet brought by a former female student edits affiliated school against three male dancers and one of city bally's donors the men allegedly shared nude photos and comments about the dancer again here's Jean Schaffer off\nThat's wrong behavior I was very disappointed to see that\nThe suit comes less than a year after city ballets leader Peter Martin was accused of decades of abuse he retired and the company is still without a permanent replacement\nThis new lawsuit alleges that city ballet has created a culture that permits this kind of sexual abuse\nWith immunity for perpetrators so longest ticket sales stay high the allegations are very serious Brett Egan is president of the ... Institute of arts management at the University of Maryland says with a budget of about eighty nine million a third of that from individual foundation in corporate grants\nCity has an obligation to let patrons no their money isn't being used to exploit anyone\nThe organization says it is responding to the allegations it's fired two of the dancers involved another resigned though all denied the charges\nThe companies also donating the twelve thousand dollars it received from that donor named in the lawsuit to an as yet unnamed organization that supports women city ballet executive director Kathy Brown denies that the company knew about the sexual abuse\nNo one here in this organization knew anything about it no one would have ever condoned it encouraged it supported it\nBrown says all the major contributors continued to back the ballet\nFolks have given us their feedback but I think in the main um there's still a very supportive of the company and\nJean Schaffer off the powerhouse socialite says she'll probably continue to support city ballet but\nIf this continues to go on and on of course and I might consider changing my mind I Would imagine a lot of people are looking at the ballet very carefully right now", "year": "2018", "show_name": "Marketplace", "city": "Atlanta", "day": "12"}