{"month": "10", "state": "GA", "station": "WABE", "content": "She says Saudi Arabia would prefer to keep its economic ties with the U.S but the kingdom could turn elsewhere that relationships hours after all Saudi Arabia's biggest trading partner is China in New York and Justin how for marketplace\nThe bricks that news of the day is that the Brits and you have made a deal on the terms by which Great Britain will leave the European Union next march\nOr maybe they haven't it's complicated there are conflicting reports in any way there's a big summit meeting on Wednesday after which we will no more maybe much of the attention at the moment do is focused on the land border between Ireland which is part of the un staying in it and Northern Ireland which is part of Great Britain and us leaving the EU\nBut that's not the only ... you boarded it's an issue is the common market comes apart just a little bit the tiny self governing British colony of ... population thirty four thousand sits at the southern tip of Spain it's been British for for very long time but the people in the rock voted overwhelmingly to stay in the UN or being dragged out against their wishes\nAnd that could damage Brexit actually could damage the towards very prosperous economy from Gibraltar marketplaces Steven beard reports\nWeek a small group of men dressed like Eighteenth century British soldiers ... chopping down main street in general to [noise]\nBut the red coats and the booms of this historical reconstruction heroes display celebrates Britain's capture of the ... from ... from the beginning of British colonial rule we'd be\n... since Seventy no fool we'd be British for longer than the Americans would be an American\nAnd longer even ... also was Spanish says leading ... Christian heaven and as\nWe have grown up with British traditions so the question of wanting to choose over and I was just too we are\nMuch enthusiasm for British sovereignty loudly own show at triple says national day last month is also due to economic says Travolta born journalist Jonathan Scott\nAnd I think it's largely to do with life being good on the wrong we've got a lot more spending power than a colleagues and friends just kilometers away in Spain that is part of the twins he Eighteen year olds have an identity I'm to Britain's light touch\nRule the rock has made it self rich with a third highest GDP per capita written the wild I may just sent\nA finance online gambling on tourism but recently the relationship with Britain has taken a nasty tan brick saved has cast a shadow over the rocks prosperity\nThe big fear is that the the border might be closed by the Spanish State with the agreement of the European Union\nHad with my question left the ... the chamber of commerce he says Britain's exit from the AAU could embolden Spain to reassess his age and claim and put pressure on the rock by closing all restricting of Boulder that's vital to the territories economy\nMost of all tourists eight or nine million people who come to visit ... across the land frontier from Spain to get in here forty percent of our workforce cross that frontier every day to come to work and then go back across in the evening we import pretty much everything most of that come through the front to [noise]\nOddly enough there's just as much worry about Brexit just across the border here in the frontier Spanish Town of ... linear liberal Juan Jose let's say the orders drinks in a social club set off half a Spanish ... who said represents many of the Thirteen thousand people who live here in Spain\nBut and they're living across the board up he says the impoverished town's economy is obsolete dependent on the rock\nThe boat that is a is asking both on us life itself\nIs Lydia where a table he says two of the legs would be ... if those\nTwo lakes date for that seat or whatever they tell you what do you blame the collapse\nReally major role to we need to keep her older he's had paid for ... to remain British bothered mix the overwhelming majority of Spaniards one to recover the territory\nRock and roll around as much as the at the entrance to bring you\nBack on TALK business is booming at tourist sites and in online gambling in financial services the list could sufferers ... dragged out the you against the wishes but that would make question doesn't believe the rock will solve for not the issue of sovereignty\nWe want to remain British and if that means we have to leave you if that means that we have to take an economic hit then so be it [noise]\nHe controls some come from ... own colony of Barbary apes the only wild monkeys in Europe legend has it but as long as they remain British Rule over the rock will continue the apes\nHave been reading like crazy in ... I'm stays in bed for marketplace [noise]\nAnd you're listening to market place on Ninety point one WABC eaten I'm Jim Burress along with Dennis O'Hare did he mean Dennis\nHi Jim how are you and hello to everybody who listens everyday to market place and all things considered spin a while since I've been on in the afternoon and it's a lot of fun to be back absolutely good habit of well it's and it's always a pleasure to listen to you in the afternoon so\nBut we have some business to do and what better time to do business than during marketplace I mean it's just set up perfectly but what we need to do the business we need to conduct right now is with at least forty one folks why not be one of those forty one\nBecause if you make that gift of support right now at six forty one\nYou will be one of those who help us meet our goal and we are in the last twenty minutes now\nThis special event the last fundraising match during all things considered the way this works if you haven't heard it before\nIs that if you make a gift of support it's matched by members very generous members of WABC up to a total of Fifteen thousand dollars and we're not there yet\nSo we need to hear from you right now at six seven eight five five three Ninety Ninety or you can pledge securely online at W. H. B. E. dot org marketplaces an important part of your afternoon\nNot only catch you catches you up on what's going on in the market today but gives you the perspective you need to understand our complex economy you're rolling your personal finances you get so much from this program every single day\nSo why not support it and your gift rematch if you do it right now in the next Eighteen minutes six seven eight five five three Ninety Ninety or online at W. A. B. E. dot org\nMy name is Howard Austin\nI was invited to a launch years ago with the CEO of NPR and he conveyed to me the importance of news in a democracy I may be the person speaking today but my wife Colleen\nFeels equally strongly about NPR the value of our donation to us is as an investment in America\nThat may sound tried or hack made but if people don't know what's going on if they don't know where truth lies than it may be hard to have our society prosper to us and informed electorate is the only way that democracy will survive\nAnd it's an important job it depends on all of us to make it happen\nThirty nine pledges to go to stay on track in the next Seventeen minutes this is possible but only with your help so ... why not do something that you probably even thinking about doing for a while now support marketplace\nYou get the immediate returns every single day and for the next Seventeen minutes if you make that gift of support\nYour pledge is doubled by the members the generous members who have put up their money to match yours\nBut we have to take the first step six seven eight five five three Ninety Ninety or W. H. B. E. dot org we want to thank the folks who have made this possible Brian placate us and Bonnie break placate as\nDavid Epstein and Stacey hater Epstein Derrick Jackson Dorothy ... Jodie and Billy Andrade Larry Anderson and Marcia bans Lee among others\nAnd you become part of this community and you can say to yourself you know I'm supporting something that I value and that is a great feeling and do we need that on a Monday afternoon six seven eight five five three Ninety Ninety or W. H. B. E. dot org [noise]\nThere are in this trade war we're still having with the Chinese hard quantitative things each side can do terrorists themselves or a good example of those\nTen or maybe twenty five percent import taxes on a whole list of goods shipped by each side to the other\nAlso softer more qualitative things like just not buying certain things the other country cells and for our purposes right now one of those certain things\nAs American oil which China has basically stopped buying Rebecca Elliot covers energy for the wall Street Journal welcome to broker thanks for having this it seems like a substantial drop in Chinese imports of American oil what is going on so as\nThe trade tensions between us and China have escalated in recent months even though has now and has any tariffs on us crude the U.S exports to China actually drop to zero in August after about", "show_name": "Marketplace", "year": "2018", "city": "Atlanta", "day": "15"}