{"month": "10", "state": "GA", "station": "WABE", "content": "But let's review that scenario where they do pay for themselves over ten years\nFirst you cut corporate taxes businesses invest that increases productivity wages go up and boom that magical three percent growth per year we've heard so much about our ... at the American Enterprise Institute says it's too early to know what's working\nI think looking at one is numbers and saying well the tax cuts are not working and the adding to the deficits instead of reducing them I think is is is kind of misleading\nEven if things take time she says time isn't the only issue we\nPaid for these tax cuts with debt\nEven in an ideal world where everybody imagines the tax cuts they find themselves in that Kennedy takes place in a situation where the tax cuts themselves and not deficit finance\nAnother wrinkle companies aren't spending their tax\nSavings the way tax writers planned sand colander is an expert on the federal budget for example he says we've only seen a modest increase in wages also\nCompanies aren't investing they're using it to pay off debt and they're using it to a pay off the stockholders and do a variety of things that don't actually increase economic activity\nAnd they will need to be a huge boost in economic activity if these tax cuts are ever going to pay for themselves in Washington I'm Kimberly Adams for marketplace and you're listening to marketplace\nOn Ninety point one WABC support for WABC comes from public offering public's delivery powered by ... published believes that between work\nTo do list time as valuable public seems to help people regain time by delivering groceries to customers stores public's dot com slash delivery\nAnd from community foundation for greater Atlanta serving our region for almost Seventy years powering your philanthropy with assets like appreciated stock and business interests for taxi fishing giving learned more at sea of greater Atlanta dot org\nHigh amounts that change I think public radio after I had quit being a lawyer I was on a quest to find a job that when you tap into the parts that myself that I liked that\nAnd along came this thing public radio where what matters is your ability to connect with others to be empathetic to be a really good listener what public radio has taught me is that\nEveryone has a story to tell if you just led curiosity guy and I am so grateful that curiosity guided me here to NPR where new voices and different lived experiences\nValued none of this would be possible without listeners like you to invest in careful\nLearning in stories that are ... public radio against all of us so much here's how you can get back [noise]\nAnd it's so easy to do six Seventy five five three Ninety Ninety make a pledge of support right now at W. E. B. E. dot org and we need to hear from Thirteen marketplace listeners marketplace fans\nIn this half hour actually in this break 'em before we go back to the marketplace\nIn just a few minutes I'm Jim Burress alongside Ayesha Hyman and I love hearing also change talking about the passion that she has and what she hears when she listens to NPR the sense of discovery and this appreciation for lifelong learning and we know that listeners\nOf W ab ... value these things too\nAnd that part about listening um is is what we're actually doing right now is we're inviting you to give us feedback we are our ears are always open to you but especially during our pledge drive because your response during our campaigns doing our pledge drive\nThat's what makes informs the decisions that we are going to have to make for the next month through the end of the ... calendar year into the next year\nIn terms of what we can afford to pay for in terms of our programs of the reporting that we can pay for we want to enter this next year really strong and this next season really strong and we really do rely on your support\nIn order to do that six seven eight five five three Ninety Ninety I'm doing the soldier sake again we just got some calls where we're looking for ten more at right now six seven eight five five three Ninety Ninety\nAnd why why should you contributed WABC because you know if you've been listening and you haven't that the programming still comes through your radio every day you tune it or turn it on you get in the car and it's there well that's because look around\nOne in ten cars around you if you're on the roadway right now that is equivalent to the number of WB listeners who support the station that one person is carrying the weight of the other nine around you\nThat would be hard for me to stomach\nI don't know if I Would be okay with that and we know that you listen to the station because you've value\nWhat you hear so it's okay no pledge of amnesty is what we're granting right now and we're just asking that whatever amount works for you that you do make that called six Seventy five five three Ninety Ninety or W. E. B. E. dot org and helped keep Ninety point one strong when\nDoes happen that sometimes we take for granted the things that have been there for us for a long time right you get accustomed to something always being there and you kind of forget\nThat it's it's there because somebody did something in order for it to be there right so uh why not use to be one of those people that do what's necessary to keep W. A. B. E. here and going strong we want to say thank you oh wow we're down to seven thank you so much\nWe're listening we hear you and we appreciate you we want to say thank you to Angela and Atlanta James and dilute oh now we're down to what was that means we're getting some updates okay a list that in Atlanta Robert in Atlanta Tom and Lucy at least here\nIndicator and in the east side where I live\nThey said thank you for consistently high quality quality programming and news reporting in such a challenging time\nWe love your thoughtful and respectful interviews where actual discourse happens instead of constant interruptions so thank you so much for that feedback that is what keeps us going as well as your contributions six seven eight five five three\nNinety Ninety or W. A. B. E. dot org and\nDo it right now and you will be entered to win one of two Edison electric bikes courtesy of Edison bikes which is based right here in Atlanta\nAnd these bikes you can use in different ways there um power only you can use it like a scooter\nOr with pedal assist something in between it will help you get around and its environmental environmentally friendly two thousand dollars per bike and we're giving away too\nSo please get in on this program right now six Seventy five five three Ninety Ninety W. H. B. E. dot org we're chipping away a love this six more marketplace listeners as we go back to programming I'll give that number one more time\nSix seven eight five five three nine zero nine zero or you can make a pledge on line at W. E. B. E. dot org and thank you this is marketplace\nOn Cairo's all this is peak season for the professional sports fans among you the one time of the year when all five men's yes men's professional sports or an action there are games tonight from ... be major league soccer the NBA the NHL and the N. F. L. I saw it called the sports equinox on line today\nFrom funnily enough tonight is the first time that's happened since the Supreme Court decided back and made it sports gambling is legal all over the country\nBook makers are looking at a potential market upwards of Seventy billion dollars a year and sports being a business the various leagues want a slice of that straight up gambling pie but they are going to benefit anyway even if they don't get it\nThat's according to a new report commissioned by trade group for the gambling industry rather the gaming industry marketplaces Mariel Sierra looks at what the payout is likely to be\nAll comes down to this with legal sports betting there's a big old pile of money at stake the gambling industry says legalization it's going to generate more than four billion dollars in additional revenue for the big sports leagues Jeremy do route teaches sports lot American University\nThey will drive more people to watch whether it's buying tickets to the games whether it's watching games and then because somebody on the team they were pulling for because it but for them a scored an important touchdown they go out and buy the jerseys\nDarrow says with more viewers the ... will be able to charge more for ads and Michelle Minton at the Competitive Enterprise Institute says the league's will get another big chunk of money from gambling sponsorships and advertising\nAnd this is an art because throughout the world gambling interests are among the largest sponsors sport so and the U.S they really couldn't engage in that kind of behavior because gambling on sports all the legal\nBut here's the thing this report was commissioned by the American gaming association it's a gambling industry trade group they make legal betting look like a good deal for the leagues so Jeremy do ruin American University says yeah grain of salt\nBut even with a grain of salt you're going to end up getting really substantial increases in revenue\nThe league has a lot more they want a cut of the banning action recently and and I'll be official said a quarter of a percent sounds about right step and ... at the University of Michigan says the bookies say that's unnecessary\nThey're arguing that in fact the uh sports authorities will will gain anyway because of the direct benefits will be derived\nLegal sports betting is already happening in six states and it's on the way in three more ... for marketplace\nRumor and lift already can be an awful lot of ways right ride sharing bike sharing they do use scooters as well and come next year they're going to be competing for investors to both companies are said to be planning initial public offerings early in two thousand Nineteen both companies also", "year": "2018", "show_name": "Marketplace", "city": "Atlanta", "day": "18"}