{"month": "10", "state": "GA", "station": "WABE", "content": "I had a great a colleague in mentor back in a day who used to bring meetings into focus by saying\nLet's control of control so but we control as long as what we do\nWhat we do and and I just told you what we do and we're always going to do that's who we are it's always who we're going to be we're we're going to we're going to do our business in a way that's strictly non political without taking political issues into consideration\nAnd that you know carries out the mandate Congress has given us a we have the tools to do that we have a statute that allows us to do that in in a way that is independent of political considerations\nI'm strongly committed to it and so on my colleagues so where\nDoes this go well there's a mention here that this whole thing we've been talking about the past what five six and a half minutes whatever markets tumbling rates rising the fed doing what it's doing the president doing what he's doing it's all anchored all of it in the knock on effects of one economic reality whose name\nIs inflation the fed as we told you would like to see prices rising by about two percent a year we got some new inflation numbers this morning and marketplaces Kimberly Adams has more on what they may or may not me\nThe consumer price index tracts prices for a basket of goods and services and August it was up a tenth of a percent landing at two point three percent year over year inflation is\nAt a moderate level it's very close to where actually the Federal Reserve would\nLike to see it in LA and teaches economics at Hamilton College I think that it's an\nEndorsement of their current plan to continue to raise interest rates\nIt's very gradually but numbers are funny you could use those same CPI numbers to make a different argument economist or need to death ski at every court ISI sums up the counterpoint\nThe fed has a two percent inflation target these numbers are close to two percent why on earth would we be raising rates\n... says the fed isn't just looking at where inflation is now it's looking at where it's headed plus this isn't all that attached to CPI\nMain piece of data they look out for their inflation target is a different price in later called P. C. E.\nOr personal consumption expenditures which measures inflation a little differently take health care CPI measures how much you spend out of pocket p._c. eat tracks how much your healthcare costs everyone you the insurance company the government\nAnd says today's scheme PC it looks at how people actually spend money\nThat takes into account that if the price of Apple's goes up a household might switch to buying pairs instead\nCentral bankers use both measures just wait them differently presidential complaints about interest rates probably light on the scale in Washington I'm Kimberly Adams for marketplace\nLike comparing apples to pairs and when you listen to the marketplace you would get a reference like that and that's the beauty of marketplace is it breaks down\nComplex financial oftentimes complex financial information and stories in a way that just makes sense like comparing apples and pears I'm Jim Burress glad to have you along on this Thursday evening for marketplace and I'm joined by Ayesha Hyman she's our director of individual giving why are we talking to you right now well\nIt's all about the numbers I Love it when they gave us the numbers on marketplace and we've got some numbers for you right now we are doubling uh your contribution actually we're not doubling it we have some very generous members who've made a contribution ahead of the drive ahead of the pledge drive because they wanted to set us up for success\nThey want it to make it possible for you to stretch your gifts so right now when you make that gift of one hundred dollars or ten dollars on a monthly basis it becomes Twenty one hundred becomes two hundred and so on up to ten thousand dollars we have a match\nMoney ten thousand dollars on the table right now and it goes away if we don't claim it right so right now we're counting on hearing from you make that call six seven eight five five three Ninety Ninety\nAnd we started the our needing to hear from a hundred nine listeners for all things considered and marketplace at last check we were down to eighty four so that is a significant number we want to say thank you to everyone who has made a pledge during this hour during the drive and all of our sustain ers\nWe still have a signature significant lift eighty four is a lot of ground to cover we know we can do it and we know we can do it because you value programs like marketplace you value Ninety point one W maybe we're asking you to put a value to work with a call the six seven eight five five three\nNinety Ninety or make the pledge on line at W. E. B. E. dot org it's so simple that evening could easily get away from you at this point between dinner the kids\nJust living life so don't put it off any longer make that call six seven eight five five three Ninety Ninety or W. E. dot org\nAnd so we're down to eighty three so thank you so much in the last call we just got thank you so much thanks to everyone who called during all things considered this is really an important time block of time for us to raise funds because of the cost we do have to raise a certain amount of money for programs for our content or\nEvery year and so we can only make that budget when we hear from a certain number of our listeners and so it's not not necessarily everyone but we do count on a certain percentage and that means to you and your friend and your neighbor and your mom and your dad and grandma so after you make that contribution to the station we do encourage you to text tweet\nPosted Facebook let everyone know that you've done it encourage them to do that as well and then brag about it we have some thank you gifts bumper stickers we've got a whole new T shirt and we've also got a brand new W. A. B. E. baseball cap you know perfect for this weather so make that gift of ten dollars on a monthly basis and we'll send you a thank you get\nThe big thing to do though is the pay off to you\nEvery time you tune in to Ninety point one W. H. B. E.\nAnd you continue tuning in we're back to the marketplace in just a moment to think about this right now you're listening during a pledge drive and we appreciate that we understand that a lot of folks don't and our sustain ers who give every month and a lot of them think you know well why do I have to listen to this give me back my program in\nWell we do need to hear from New members to keep growing we know people move to Atlanta all the time and maybe or public radio fan in the city where you came from and you've come to appreciate the programming that is so familiar that you find them Ninety point one W. E. E. well we're talking to you right now don't put it off\nBecause of the newest member and support public radio and Ninety point one in this vibrant city we call Atlanta and this metro region six seven eight five five three Ninety Ninety is a way to do it\nW. E. B. E. dot org ... double your pleasure double your fun I think there was a double meant gum well no just a double your pledge with a call because of the general support of our sustain her um and our cornerstone numbers we need to hear from eighty two people to stay on track now you know everybody's\nGot a different reason why they call and support the station we hear great reasons all the time we hear because he wanted the cool new thank you get the whole new T shirt or socks or\nBecause you love a specific show or maybe it's because you want to make a difference you can do that right now simply by making a phone call or visiting our website six seven eight five five three Ninety Ninety or W. A. B. E. dot org [noise]\n\nIf you watch late night TV the Tonight Show in particular you probably know or at least know of the house band the roots and perhaps you would recognize its drummer in front man quest love\nBig guy always where the Pickens afro which might not know though is that he's a DJ two and a producer and an author of foodie also in a pod caster ... love Supreme is the name of it if you want to check it out and\nYou came into the studio today ... coming in\nThank you for having me vector or most of the people who are going to hear this my guess would be and probably most of the people who know you now ... as the guy that you are a no you from from TV and the Tonight Show yeah even though you've had a ... you\nKnow I've had last ran for this one year's meant hey you never know I mean George Foreman a helps your sandwich [laughter] at all for the fire ... no ... I'm a new earlier I was going to be all things to all people\nAt least people were getting spot on now you know\nPreviously I was you're the kind of germs which Jay Z right or yeah or even to this day it's like oh you're Jimmy Kimmel drummer right uh [laughter] uh even worse than we finally get your Jim and Jim ... yeah 'cause\nI think I'm a first there's a little if there was you off a little bit you know people have history like I just didn't pop up\nYou know out of out of nowhere but I'm here and what to\nDo you ever look around and say I'm a kid from Philadelphia and what am I doing it\nMore [noise] more or less a it's how that I get here often when I go back to Philadelphia I'd do something called chasing ghosts\nOr a store my first car and I keep it up I'm Sorry you still have your first car ... and not so ... yeah and I go to my mom's house and I get it and usually I drive around\nWhen I go to Philly all drive from like midnight to three in the morning literally just chase ghosts and the thing I always do is when I go past\nThe place where the roots used to a mosque on um fit than south street yeah I'm always like yo like back in Nineteen Ninety two I thought Nineteen Ninety nine was going to be the future you know let alone\nWhat I still be a thing in two thousand Eighteen I mean I'm not one of those knock on wood people that I don't want to jinx it but as you knock on wood or as I as I did it you know hypothetically but I I just I'm Amazed that no one's kicked me out the pool yet yeah we", "year": "2018", "show_name": "Marketplace", "city": "Atlanta", "day": "11"}