{"month": "10", "state": "AL", "station": "WAPR", "content": "The post you know the ten commandments some say this amendment doesn't really do anything\nThere is a provision in there though that provided there posted in a constitutional man they're in like the real because the amendment does provide anything that's not already law\nYou can hear the story get along with all of our other election coverage at our website eat your dog or\nThis is Alabama public radio in the service of the University of Alabama W. H. P. R. sound WPRI Michael shown\nW. H. I. L. O. B. W. A. L. S. in Tuscaloosa\nDouble you teach history be the Tuscaloosa every ... or I Need so we are we are we are we are we are Alabama public radio\n\nGood anything in my family bluegrass were another Saturday Night Joe Miller here with you\nWhen the next two hours break with music and fine hope you'll stick around for the entire skills got a lot of\nOne from the guys may happen we do this sometimes\nMore brothers but they're also doing a harder family song tonight\nYou may have heard just done by any number of groups has been recorded many times it's just ... storms are only [noise]\n[noise] [noise] [noise]\n[noise]\nI'm going away to leave me alone long ago and we are a lot of the time do you sometimes do a do a ten thousand lines\nJust on the show a Adams nice nice to be this well made ... a real a real close to the\n...\nThe avenue will blow your hand\nOver Wilkins your rosy cheeks plan I mean in a bar and da da da da da da da da da da da da Vinci ... day [noise]\n[noise] [noise] [noise] [noise]\nI have you seen those born abroad\n[noise]\nWell I have used me knows more about those that are from time to buy\nA raw bar there too I'm just the way I'm On my mind\nThat Don meal that showed that happened to me that's ... that's ... ...\n\n... email which I don't know I haven't read the ... that's why I'm a little bit smaller in general I'm In a bowl then they\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\nWe think that nah Kentucky\nBony that'd be good\nTo know what the goal that we're looking\nDo in their ...\nAnd the voting booth\n\nAnd\n\nReading and I knew the buggy\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\n\nNa na na na na ...\nLived in the sun there in\nThe\nLast place for a long known about October\nAnd it's no no no and I'm a river all male reading\nAnd you don't say laying down the river a man will be\nLaughing gas but that that's the second grade on John Candy and nothing in the world goes crazy but yeah that yeah and I'm Barbara ...\nTheir their mother and a member of the way I'm made or they're they're not among the three\n\nMom she those new big just me\nThen I'm I'm In Maryland\nMom well she was living with me but then I'm a river a minimally\nYou add those memorable rain\nAnd I'm a cat that now I'm Alone on John Kerry that nothing in the world go very well that and I'm a member a mammogram [noise]\nThe wind shadow ball many jobs they're going to go\nBack again to the day that you dizzy and an answer to that for\nMe the\nCat in a mob river all male loner you\nMake your own laying down the river ma'am over you know gas but that's not the laundry on John Kerry that nothing in the world do very well be in a mom river a male\nAnd a bomb or a man\nNow when I first man\nIn your mom\nSaying to me you know they get by\nSon\nTo be here oh I'm On the bike the red\nRose\n\nAre in the dark and\nI've been here about oh to do a\nLot of water na na\nNa na na\nSaid oh I agree\nVote for kids to be good\nDo want to know your\nKids a good time\n\nBank the river\nHow can I\n\nBe happy for a\nNew love she'd\nShe'd gone from ... na na\nNa\nNa na\nThat show green bank to cry\n\nLap me this morning\nWhere no one to\nJust be good\n\nNews ... ...\n... ... ...\nYeah John their worst we all know that\nThey did low road to get through to Charles ...\nBe ... Loni donor wrong [noise]\nThe little marine gear went down on what color\nThe little guy or the beer but\nShe said Mr Martin ...\nThey've been here ... mom\nShe missed the bartender tell man\nThey certainly here have you seen my man\nI think it does matter oh did you see where it [noise]\nYou said I ain't going to tell you who knows how to\nJohn Boehner no real go with\nTo lie about the last\nI think you're doing your own little Frank ... the over the transom ... the anthrax surprised so Johnny Depp now on\nTell them what they did not\n\n\nIt's it's not my home I'm just passing\nTraders are laid out some way beyond the ...\nMe from all over\nHere and I'm In this world are you single\nPhone or a no fly zone brand like\nHey man but not ... I'm On my when I\nMe from Evansville [noise]\nHome and those were putting on\nTheir own expected to me that's one thing to do\nA big data weight gain some long\nTerm goal\nDo you think we do I believe can vote and I came here and I'm In the mobile\nOh lord you know like I don't read like you would\nHave to pay it will stand by I'm older than I Do\nFor the ages of ... we ...\nCame from ... I'm In the ...\nStone readers will reveal a lot of people dying day\nAre shouting victory is saying and then\nI hear the lord will still be over and I came home and there's a loan\nAll over the normal Campbell rain but\nTo stop by homeowners\nOn over the no ... temple brain like\nHave been able to buy a whole lot about when I\nMe a bronze medal Jill from\nHome man will do spot in the\n...\n[laughter]\nWants to ... from the way the high ... came out and the the ...\nThen ran the\nGame between the two from the\nWay they read\nDown in\nThe\nSame time saying ... them on\nThe\nThe the damage\nWell and\nI learned a stand on a ... a dollar is\nPlanning me down and and\nThe\nHow ... rejoice\nWhen I hear you playing born\nIn the past\nOur enjoy\nOr when I was born\nIn the same way I Am\nNot in\nAlone in front of all wrong\nSham seeming down\nLow and\nWhen my saying man may na\nVe\nWay man standing na\nNa\nNa na\nNa na na\n\nAA\nMe I\n\nAppear up there to wind up from J. D. crowed Dora Lawson and Paul Williams this world is not my home and when he reached down for me\nWe started a ball just before that rather I should say Paul and Peter walked in June the came to popularity was clearly a few years ago\nIt's a new group a younger group called eco valley they're doing great work and look forward to hearing more of them over the next several weeks much keep on the firing line by the browns ferry for and started there with Reno in Mali doing here Jerusalem more\nSupport for him a bluegrass is provided in part\nBy mobile botanical gardens discover what's in your own backyard on a hundred acres located in the heart of Spring Hill in Mobile Alabama visitors welcome Wednesday through Sunday hours and event info at ... botanical gardens dot org\nAnd by children stay community college providing training and skills and abilities required by Alabama businesses and industries\nOr information at two o five three nine one two for a two or Shelton state dot E. D. U. backslash ready to work\nWe're ready to hear a little more music how bad it let's go to one from the seldom seen very familiar went by there Mrs called old train\n... ...\nOld Trina I can\nReally low and I will be jumping on the game\nBoth dreariness I've been here every where you go and do not know what a lot to be on this big\nC I Do oh\nCry with the ...\nI think I'll stay a\nOld brain each time you last year older than the last minute gene ... running\nYou know when you were a bonus by\nAnd it's been Twenty years the Harry Potter for which readers look literary legacy of the bullets from Washington and around the world Sunday on we can [noise]\n[noise] [noise]\nThis is Alabama public radio in the service of the University of ...\n[noise]\nThis is Alabama public radio a therapist at the University of Alabama\nWNPR so much that will you keep your Muscle Shoals ... about the\nW. A. L. S. than in Tuscaloosa\nW two to three beat the Tuscaloosa Wu to six for the I mean\nWe are Alabama public radio [noise]\n\nHow much longer\nYou throw my I'm\nI long to use on\n...\nYou've wrecked my um my\nYou\nKnow\nThe ...\nWill soon driveway\nAnd Sunday Darla\nOn knowing where it'll burn\nNo I'm a man\nHow much longer\nFor a while I'm ... I'm a\nI'm a huge darn\nNew law\nRon from those cells and\nMy friends oh no me ...\nYou bring Michael ...\nWhen you roll my name is Jay ...\nYoung brain boring to me\nKnow non live man\nHow much longer\nYou know um\nHow long have you done\nYour loan so much\nI lost you know\n\nI think Matt penny\nOf the man\nOh let's do one year my mom always told me she says so whatever you do know what you do you go\nWhen I'm home around there's wind blew\nA long way to\nDo you do that\nWhen I was going down\nNow I'm a little tiny minority\nKnow when my\nWhat is to be will be wanting to be just by\nWhat has to be will be wanting to be just about\nWhat is today why today just not\n\n[noise] [noise]\nDo you see the shape\nShe\n... no\nDone\n\nIt's been since the\nSaid to me you\n\nTo know the name\n\nAround in the ... my daughter's\nStreet\nDon't like the wild\nThe only like the wild but the color\nMom on a really low ball the young lady you're not a cure the ... into\nBombs why you got your big on on their own home like a young man\nHill in like a strange God you're doing by\nIt's on the line from all around the dominant\nOn like shootings Dodgers despise\nBarbie dolls that long lost in the country so\nI knew the answer to\nMe\n...\n... ... ...\n\n... ...\nAnd look\nSunni thing but\nI I'm\nStill liberty [noise]\nHuge here\nBut I'm just not that\nDon't know but who\nSummer sun city\n[noise]\nWhen you said your son the [noise]\nAnd I'm bringing mine says to me he\nBring me to about\n\n... to\n... turn to build\nNew\nEach nah to play in a blue\nBut Adams no man ...\n[noise]\nI Know with regard to know\nHow she\nWent to\nJust be looking for we're\n... ...\nKnows the losing team [noise]\nThat the herds taken hope\n\nI guess I'm just not let alone to\n... say\nAnd out um ... na na\nNa Jones no saint looms\n\nAlbums none than to\n[noise]\n\nBoys have done reach me there once again with the group flashback doing ... not that cold started that set off of what I hate to be just might happen then went to a new cooked from sister said he caught I'm not a candle in the wind\nBe sure sign my\nWith Frans de juror\n... alone\nThe road rules on my\nWhenever you find a\nBetter role to not be a hard lead in any\nThey use on the road by\nWith Fred Dryer\nAnd Breaking Bad you're alone in\nBased on the road my my\nDays on the road not mine\n\nYou know\n\nNo yeah [noise]\n\n...\nThree no man I'm\nI didn't know\nLong do you\nKnow [noise]\nKnow yeah we\n[noise] big moment um\nTo be the [noise]\nSaying you know\n\nI'm a\nNon ... and\nTo do that\nGo in\nSay the wrong track\nIn bringing all man I'm going\nWin the\n\n\nSupport for grandma bluegrass is provided in part by the eastern shore art center ... oak street in prayer exhibits open with the public perception the first friday the info on ours exhibits glasses and outreach programs that he is or centered or by ... grocery and daily\nFor ... hours exhibits art classes and outreach programs at ... years or sooner dot org and by ... grocery and daily just loses locally owned natural food store offering organic groceries in nutritional supplements since Nineteen eighty\nOpen Monday through Saturday nine AM to seven PM serving lunch from a weapon to two thirty daily menu manner grocery oh\nWell we heard the Tennessee blues there Jed to ruin friends it's just sad about what about some things just kind of sad is they're taking a different chapter in their life\nThat is starting families and I'm a little hide from the road so hopefully they'll get together and do some recording and some different one off type things along the way but we wish them well in their life pursuit road wife bought the grad school and hills of Alabama played that from the front porch string band night\nOften boy that clearly version after she left in general I think that would go back to the F is if the if the version there let's see if we can get another one or two three songs and this is Rebecca Frasier or\nNa na na\nI Am gone over him not ... main man\n\nNo\nNo I don't\nHow long were\nI don't\nMaybe rainy\nMaybe may need", "show_name": "Bama Bluegrass", "year": "2018", "city": "Selma", "day": "28"}