{"month": "10", "state": "AL", "station": "WAPR", "content": "We are done work you can listen to Alabama public radio get caught up on news across the state due to bailout bluegrass shorts up at seven o'clock we are Alabama public radio\nThis is Alabama public radio service of the University of Alabama W. H. P. R.\nW. U. P. R. Michael Shelden\nW. H. I. L. O. B. W. A. L. S.\nW. A. T. two three beat the Tuscaloosa\nEvery ... or I may though we are we are we are we I we are Alabama public radio\n\nA bluegrass put this Saturday evening jeopardy I Want to hear your host the next two hours\nWill be with us for the entire time we're going to get started in just a couple of old Tom iTunes\nCharlie Poole an order family\nFirst generation McGrath bothering to Mr\nBill Monroe but let's get started Charlotte who talk about the gypsy girls\n[noise] Mm no\n\nNo no\nOne that was done in the ground but now I'm a rich man with dying on the weight on the body and my dad and a lot in my marriage\nIn my marriage by\nMen who wants to wait on me and my manager right\nLong\n\nMan I Want to know one day down on them I mean I Am I'm young wire was worse than me\nGive you my brain around cheese like now you do well in my view the gal way in my on\nMy body my marching down they they're not in a cigar in my heart failure in\n\nAnd I started the whole the needle and ... out and buy man John many Martin Lamb\nAbout all those fine young lady just the demo last time\nI was if you guys like me All right do they feel\nThey feel by\nI Am the gift you guys on the field right\n\nJobs and the players don't buy stores like Barry Bonds do weight on channel ... mile dome\nAn old one mile darn\nWhich one do way on ban on my mom or\n\nNa na na\nNa na na na na\nNa na na na na na na\nNa na na na na\nFull and knowing that\nAny\nI\nDon't have the time and\nAnd and and then back to the doctor\nI go door\nTo door to door by\nMy mom is failing\nSchools\nRobin Wright and I'm from\nAnd that means that they tend to tend to have you back to the Pentagon and then and then go\nThen and\nMay believe words\nThat's going way back\nMe\nWell maybe not the bad\nAnd Mad Men\nTo move back to\nTo\n\n\nWhere there are\nNo no no\n\nG. E.\nDid you live the\nThe\nYou know the the ...\nUh\nYou know or that\nNow I'm saying\nChance to\nI did a show you\nIf you live\n[noise] [laughter]\nAh no no\nA Jew go\n\nSee a bunch of money\nIt do the\nLong run 'em back\nMe he\nTwo\nMaybe\n\nBringing in charge of new\nNot a mile route were I educate\nAll right well\nRang and my daughter in\nRain that your new\n\nUsually I don't love you like I say I do\nI Will go get within a year or two\nIf they offered me but my point of view ...\nI Know that you would never be\nI mean my mom always said that you do that you know I mean\nBut\n\n\nI Love and more and more with\nAnd more and more with all my heart and when\nYou're the only one out Amarillo\nYou're not the way it snowed on line and you hear\nI'll get you in a year or two\nChanged my mind all the news and now\nYou tell me that you know na na na na thank you\nFrom now they'll be mad\nMen or the other day about ...\nMiddletown and never Jane ... being the main street and the bird loudest brain\nAnd then I knew all the time\nAnd then can never have\nChanged my mind I'll always said that\nThey may not you know what\nWhen a name and entertain mama\n\nJames Bond buying all the amount\nNeed to uh the\nBlood well below my main\nWooden Jane do by\nYou know\nAnd my mom\nMale only they came in on me your name and\nI'm going to change\nView a na\n... main\n\nSupport for bam a bluegrass is provided in part by the forty seven annual ... festival of the art October twenty twenty first from nine AM to five PM featuring\nVisual artist from across the U.S live artist demonstrations music and spoken word performances food\nTrucks in children's activities more akin to dot O. R. G. and by dolphin island in the villages of south ... county where Richard comes naturally more information to visit ... dot com\nWell the second set of the hour Texas up to our gospel set let's hear what we heard going that direction I think what you don't understand the brother started that off their Jimmy Martin came right up behind with there's better times coming usually play Jimmy Jesse's version of that stuff we play Jimmy's tonight\nPathway of teardrop haven't played that one in a while but the odds were brothers and\n... that's a that's about right there folks\nAnd then bring it into Georgia Mayo by Jim and Jesse and I'll never change my mind by the lone pine fiddler and we finished that set up with I wouldn't change you if I could Reno\nSay oh my God I'm to go\nI go into a\nLong time for you to crawl\nMm\nNah\nI had to do now heads\nTruly you can treat new drugs are laying\nOh the ... man Murray's nah agree ...\n... well that's what you're saying for him in the\nI'm Steve on this issue do fall\nI'm only ... na\nGot a knee\nTo around ...\nNa\n\nNa na na na I'm too long\n...\n\nTo ...\nCome a long road to\nStay alive I got my way to go to\nA ...\n... ...\nTo curl Mm\n\n\nWhen God called you\nThey came into the into the going\nBy less of all the way\nNot by the time\nUp town that I'm Barkley a bomb in\n... there are times ... nothing\nThe line\nWe don't be the way of saying\nMoving in\nAll along fine\nCD how these Raymond and the state of shock [noise]\nFor now\nSome of the times they're not saying there are times that I've done nothing\nSpy kids moment\nThat's\nTimes but not from there are times that double glass thought on that\nJust\nSupport for being with bluegrass is provided in part by gold scenes diamond jewelry\nSince Eighteen Seventy nine in Mobile Alabama featuring hearts on fire jewelry located ... road and a gold scenes jewelry dot com hope you enjoy the gospel set tonight is every week we started off Paul and silenced by the Stanley Brothers\nWhere we're ... we're we'll never grow old by the Osborne brothers' ... Blue Ridge\nWide river across about Boston range in was not a new group therapy or the new way called the king James boys\nWe do the gospel said each and every week at the bottom of the first hour and hope that it is\nFirst hour and hope that is a blessing you and yours good time for a little more music here in the first hour let's go to what drugs to followed by drugs any better than by their Old West your brand new what actually off of the\nForthcoming CD let's let's do this and we'll talk but\n\nI use that all they're not in\n[noise] both now things have changed and they either going to remember\n... never you know the damn\nNot I live about ... to get\nMe no there wasn't now you've\nOne never knows and getting it and\nNa shoe and how do we do that you know\nAnd I never learned to love him so\nThen I wouldn't know the old ...\n... what the legal\n\nOh it's about time we're going to pick it up a little bit Yoani here one is kind of gets a ... a little bit one go long journey home\n\nAll my money in dollar bill\nMy money money to build\nDa da\nFind out what's on the net all things considered from NPR News\nJoined us all things considered Saturdays and Sundays at four pm on a PR\n... Alabama public radio service of the University of Alabama W. H. P. R.\nSounding ... P. R. Michael show\nW. H. I. L. W. A. L. S. and goes\nW. cheap to treat beat the Tuscaloosa\n... an age now we are we are we are we are we are Alabama public radio [noise]\nPay the debt\nIs good I\nWhere the\nOwn bubble\nWhere there are no ball\n\nDonald order and make them\nBeginning when bone\nMain\nI don't know how long\nYou done a\nAs well in the game when I thought I heard it too\nThey\nThat cannot\nGunman holding on to bother\nThat was the day then\nMove on to a\n\nAnd\n\n\n\n\nI had 'em learn along the\n...\nWanes ...\nInterviews to teach me a lot to do not apply\nMind when they came home to me it's not\nAnd\nSo I'm saying what do you believe in dance may not\n\nWhat\n[noise] [noise]\n\nWell\nWhen I was young so much young\nWhatever needed in a Benny Hill\nPlease\n\nYou know just how the\n\nDown in Miami\nBut she hadn't been paying\nLeave me in the dream July yeah when I hear you scream manage money room and then\nIn time magazine for al ... my mind around being the key is June June jam\nNow to me is the first\nBe the first one back in\n...\nMm\nThe law they everybody is the\nThey leave the\nEarly\nAnd I will be the\nOutage as long as the\nThinking well what are you\n\nJohn King be\nYou know the\nDark days people\nI'm\nI'm a\n[noise]\n[noise]\nMississippi Delta shot in like a national you know\n\nSaw in the reserves down a highway during the great\n...\nI'm from the great great great demand the I'm going to bring my\nMore than ... families and we are going to\nNine years old and the\nWhen I first player\nBut I'm reason to believe we both went out there in the same way\nShe comes back to them and she said oh\nIf I didn't know that\nIf I didn't know my own the\nBut no no way for and\nThe love is like a window when you're alone every body\nBlown a\nEverybody bleeds when\nBenefits than the um bona Graceland\nThem are ... ... ... families and we are going to Graceland\nTraveling companion do cynical doctor by looking at going to do\nBaby we um I don't believe the same\nGirls in New York City on the golf you know humans rambling\nOn them and I\nDon't mind in one or this is what it means miles every day\nAt the new\nIn a lack of you know the Hummer\nYou know no I\nRage land bridge plan\nI'm going to be saying\nIt's All right and I can not complain that sound tired out money while they're\nMaybe ... actually ... nah never you know maybe they're not allowed to do that\nInto the the you know will be the same time\nA\n... I'm going to buy plans\nTo ...\n\nTo\nLonely hearts string band there with Paul Simon's to Graceland and before that Michael Cleveland with Jimmy Martin to night\nFirst one back in town by the Dilma curry band and junior says ain't nothing wrong with that support for bam a bluegrass promoted in part by spirits wine cellar featuring the large selection of beer fine wines liquor and premium cigars\nLocated in Essex where marketplace McFarland boulevard north board and the shops of like ... on rice mine wrote me see if I can squeeze a couple more tuned in here before we have to say goodnight just to stand Bush\nUm", "show_name": "Bama Bluegrass", "year": "2018", "city": "Selma", "day": "07"}