{"month": "10", "state": "MN", "station": "KZSE", "content": "Saudi on friday with a chance of rain in the morning drizzle in the afternoon and ice in the lower fifties NPR\nEntire state to tell their stories from all that we have reporters in Rochester in my head and they certainly\nSt Paul NPR discovering what matters to\nGood morning one senator calls the legislation or glimmer of hope it would provide billions of dollars to address the opioid epidemic President Trump is expected to sign a day It's MORNING EDITION from\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\n... his environmental policy\nLater how Israelis reacting to the killing of Saudi journalist I'm all for show\nA Japanese journalist is reportedly released three years after being taken in Syria is Wednesday October twenty\nFour started from the bottom now he's here turning thirty three years old happy birthday drag [noise]\n\nLive from NPR News in Washington I'm Dave ... Saudi Arabia's crown prince is expected to make his first public comments today since the death of Saudi journalist ...\nThe Saudis say the Washington Post columnist died at the Saudi consulate in Istanbul three weeks ago after getting into a fight their Mohammad bin ... mind will be speaking at an investment summit in Riyadh\nOfficials in Turkey believe ... death was a planned killing by Fifteen man's Saudi hit squad President Trump continues to be critical of the kingdom secretary of state Mike ... says the U.S has begun to impose penalties on the Saudis we're taking appropriate actions which include revoking basis\nEntering visa look out and other measures Trump told reporters last night could show jeeze death should never have happened\nPresident Trump will be appearing at a Republican rally tonight in Wisconsin already Michaelson with member station Wu WM in Milwaukee says it's the president's latest appearance to promote GOP candidates ahead of the November midterm elections\nGovernor Scott Walker is locked in a tight race with democratic challenger Tony ... and is hoping and appearance with Trump will give his campaign a boost Walker took a swipe at Trump when he bought out at the president's\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nAnd Tammy Baldwin Trump carried Wisconsin in twenty sixteen and did especially well in rural parts the state for NPR News I'm Marti Michaelson in Milwaukee\nThe trial of an Arizona man who's facing charges in connection with last year's deadly shooting at an outdoor music festival in Las Vegas is being pushed back until next march\nSteam as sick with member station kj cesium Phoenix says the man's fingerprints were found on some of the ammunition recovered at the Mandalay Bay resort hotel following the attack\nFifty five year old dentist Haig is facing a federal ammunition manufacturing charge for allegedly making tracer and armor piercing bullets and his home in Phoenix suburb but he's not charged in the shooting along the Las Vegas strip during which gunman Stephen Paddock killed fifty eight people and wounded hundreds\nProsecutor saying address on a box found in politics hotel room led investigators to hate\nHate remains free under federal supervision pending his trial at us district court in Las Vegas\nFor NPR News I'm Deena seed in Phoenix\nWillow is now a tropical storm as it continues dumping heavy rains over west central Mexico it came ashore yesterday as a category three hurricane about fifty miles southeast of miles long this is NPR News from Washington\n\nOne of baseball's World Series goes to the Boston Red Sox they beat the Los Angeles Dodgers eight to four last night at Fenway Park Boston's Eduardo Munoz hit a three run Homer of Dodgers reliever Alex ... and the seventh inning game too is\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nTheory of health and Human Services cited new preliminary data from the Centers for Disease Control and prevention just increased by ten percent from twenty sixteen twenty Seventeen those numbers stole toward the end of twenty Seventeen through the beginning of this year in other words deaths aren't going down but are now at a steady rate\n[noise]\nPresident Trump is expected to sign a bill later today that expands Medicaid opioid treatment programs and support research of non opioid pain relief Emily Sullivan NPR News\nThere's at least one winning tickets from last night's one point six billion dollar mega millions lottery drawing officials in South Carolina so your tickets sold in their state matched all six numbers it's unclear if other winning tickets were sold elsewhere\nA single winning ticket is worth nine hundred for a million dollars immediately or one point six billion paid out over twenty nine\nYears I'm Dave ... NPR News in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting the wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefellers work and food health power jobs and resilient cities at rock found dot org and Americans for the arts\n[noise]\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more [noise]\n\nIt's MORNING EDITION from NPR News I'm David Greene in Culver City California\nAnd I'm Steve Inskeep in Washington DC the killing of a journalist has put Israel at some risk of losing a bet\nA bet on Saudi Arabia for years now Israeli prime minister Benjamin Netanyahu has not so quietly worked in tandem with the Saudis even if the two countries do not have formal diplomatic relations\nThey shared interests and a shared antipathy towards Iran when President Trump was elected he joined in making his first overseas visit to Saudi Arabia and leaning into that relationship when out Saudi Arabia's crown prince Mohammed bin ... suspicion for killing ...\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit why W C. A. M. P. L. S. dot org to learn more\nAnd it's on Yahoo said quote I Know about the ... as much as you do but there is a lot of concern in Israel about this uh because Netanyahu has spoken a lot about\nA changing Middle East where some Arab states which used to be Israel's enemies are starting to be on Israel's side and as you say and it's on Yahoo has taken a bet on Saudi Arabia\nI remember I was in Washington earlier this year covering that's on Yahoo is meeting with Trump and the White House and that's on Yahoo sat with reporters and and he gave a briefing at the end of the briefing\nUm she ended it with this kind of flourished she took out this piece of paper and he said he had been working on this issue for some time and had great importance and he looked at this piece of paper any read out this information which was that Saudi Arabia would be opening up its airspace\nSo commercial flights could fly from India directly over Saudi Arabia to Israel um and it was seen as a big step for Israel being you know and accepted country in the neighborhood and now with this ... killing it's going to be a lot harder for Israel to\nTo take pride in pushing these relations with the Saudis\nUsed the Saudi Israeli relationship is a personalized in some way by which I mean has it become associated with the relatively new crown prince Mohammed bin Salman\n\n\n\nProgramming is supported by YWCA Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR list dot org [noise]\n\nOn the next fresh air Paul ... he played a teen preacher and there will be blood moody teenager who took a vow of silence and Little Miss sunshine and portrayed Brian Wilson in love and mercy dino directed and co wrote the new film adaptation of Richard forwards novel wildlife\nWhich stars Jake Gyllenhaal and Carey Mulligan during [noise]\n\n\nSupport for NPR comes from this station and from the doors do charitable foundation whos clinical scientists development towards support promising early career physician scientists and their research efforts to improve human health\nFrom the state of Joan be crop who's request serves as an enduring investments in the future of public radio and seeks to help NPR be the model for high quality journalism and the twenty first century [noise]\nFrom the public welfare foundation committed to advancing justice and opportunity for people in need more information at public welfare dot org\nAnd from the ... and Hilton foundation working to improve the lives of disadvantaged in vulnerable people throughout the world learned more at Hilton foundation dot org\nMORNING EDITION from NPR News I'm Steve\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot\nOrg to learn more up in a rain forest in a community that has now deeply divided about his rise to power and press Philip Reeves has more [noise]\nThis is the smoke country town in southeast present ... spent his childhood midday drinkers and a bond is a town square remember him well including Francisco Gianni a civil servant is fifty eight years David\n... said one day I'll be president as Shia Shiite nice drinking beer with his brother Luis Antonio who says he used to go fishing with boats and out of\nFear that he's a son with this town since Luis Antonio ... an ultra conservative who stands up for family and religion and fight corruption [noise] look for the fish will say about sixty percent of this community support spoke to NATO\nLuis Antonio's proud that both NATO grew up here\nThis place is cold Eldorado it's not as glamorous as the name suggests this is a shabby towns Fifteen thousand people it makes a living growing bananas and from tourists who come to see nearby caves and waterfalls full that our riches here just a few minutes drive away\nThey say in the town that they live in the middle of the Atlantic rainforest and they're telling the truth because here we are surrounded by forests\nAtlantic rainforest one stretch them much of Brazil's huge coastline before the country was colonized and began building cities most of the forest destroyed but\nChunks remain the junk in this area covers nearly twenty times more land the Manhattan the forest is one of the richest in the world in ... it has tens of\nProgramming and supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAround here is on the Gulf and the protection get both NATO talks loosening Brazil's environmental licensing laws because he thinks they suffocate the economy Brazil's powerful agri business lobby hungry for new land farming and mining is behind it says the better\nIn the forest around Eldorado thereabouts it doesn't kill 'em boat has these are small impoverished Afro Brazilian communities often establish centuries ago by Africans who escaped slavery\nThese days ... says he sees all Brazilian Suzie\nHit in the killing voters people haven't forgotten his past racist remarks about them just taught him about ice who lives in one\nFalcon image fixate those people say he's very prejudiced and that he doesn't like black so we feel really offended\nOfficials say both in I Lived in that out of from the age of five to a team his father was the town dentist who ... ... and and I would also vice principal of a local school says he and vote for NATO hung out with his kids swimming and the rivers playing soccer and hunting birds\nHis mom was a washer woman and the boats to NATO household he says\nBut throws his politically on the left and dreads but also now to becoming president just short is a ... a ... he's president should you not people not to find them like those are not on the [noise] night is creeping across the rainforest in the house\nOr an elder autos big town square at the map and his deputy\nAghast at an award ceremony for locals have completed fashion and bakery causes these two officials belong to a centrist political party and yet they say they don't see both ...\nProgramming is supported by wind up you see a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA end he L. S. dot org\nAnd what are the ones in the forest is elders out is great just treasure says mad about ... and the lungs of the region yet the town's broke it needs income and jobs he says\nSo it should profit from the forest allowing in what he calls non polluting industries and protect it you can do both says jeopardize your cause you to say Oh yes and I believe shy about NATO knows that he says latest battle the Eldorado eco tourists guide disagrees\nNumber ... ...\nDoesn't have any consolation policies says that a\nBill ... could blossom ...\nSo any form of threats to the Atlantic rainforest is terrible he says because once you lose it you'll never get it back ... Reeves NPR News El Dorado\nYears after he vanished in Syria a freelance journalist is reportedly safe he was taken by an extremist group but unlike other reporters who have been killed he has apparently surface in Turkey and here's Anthony Kuhn reports\nChief government spokesman you'll she de su ... told a hastily convened press conference on Tuesday the Tokyo had received information from ... about the journalist forty four year old ... you and you can you do you go to\nConjure informed us that ... has been released and is it an immigration center a turkey sue ... orders that\nWe're currently confirming the man's identity in Turkish territory as he added field I based on the information we believe that the person is highly likely to be a pseudo yesterday I went to Syria three years ago to report on the fate of his colleague Ken gee go\nGo was taken hostage in Syria and twenty fifth\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more had YWCA M. P. L. S. dot org\nAnd you can do to the nature of his ordeal in wherever\nYou are so and we and\nWhen you're sitting in a dorm room suffering pain he said oh there's no one to answer a no win respond you are invisible you do not exist no one cares about cheap\nYahoo that began reporting in the middle east in the early to thousands he was taken hostage in Iraq and two thousand and four and leader fried at the time some Japanese voiced anger at freelance journalists got themselves in trouble and then had to be bailed out by the government\n[noise] Yahoo does family mean while it's been eagerly awaiting news his mother told state broadcaster in each case that has she prayed for her son's release she folded little paper origami cranes at least one a day more than ten thousand you know Anthony Kuhn NPR News Beijing\nAnd this is NPR News\n... campaign and the small how they unified theme\nCare John knows firsthand how important health care's her family\nUnlike camera I'll take on the big drug companies to reduce prices candidates are playing to their voter we are seeing and take on health care more head on in part because the owners are so concerned that health care in the mid term this afternoon on all things considered from NPR News [noise]\n\n\nFlyers at every checkout counter the Asian grocery store in early voting states he says attention to details like that is what's important\nYou know the older you are in the head of faith based approach to the German elections you always afraid of the characters would win but we didn't do much else\nGrad says he thinks Democrats will flipped anywhere from eight to a dozen governors seats this election the popular Republican incumbent in Nevada Brian Sandoval is barred from running because of term limits\nSo it's just like has a chance against his Republican opponent Adam lack salt the current attorney general Irish ... campaign for this story too but no one responded\nNow something is shifting this year with voter turnout was higher than usual during the primaries and in the first days of early voting and the race is really a toss up according to polls\nDon't often is the editor of the Nevada independent and an expert on Nevada politics we needed a coffee shop\nAnd the electric reflects the nation's electric very polarized\nTo lower turnout election so it's tribalism Republicans are going to vote for the Republican the Democrats are going to vote for the Democrats\nLike the country Nevada those mostly Democrat in urban areas and those Republican in rural areas so Elson says whoever can turn out their voters will win the governorship\nThat's how animal actual one four years ago for for attorney general he's the only candidate in modern Nevada history to have lost both the urban areas and still won a statewide race\nAt the grocery store democratic candidates keeps his lack wraps up his visit to people he meets with selective of Las Vegas is transient character summer recent arrivals or visitors who can't vote in Nevada others are conservatives who shakes his lack sand and later\nProgramming is supported by white WC a Minneapolis dedicated to eliminating racism and bringing the community together to move Minnesota Forward with it's time to talk forums on race learned more at YWCA M. P. L. S. dot org\nWhere's that money going how's the how's it going to fix the schools because when I first started my my daughter had to come to work because you know there were into that for the kids\nShould get a person who work crews had three children's education and the fucking NPR News Washington [noise]\nThis is NPR News\n[noise]\n\n\n\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to move Minnesota Forward with it's time to talk forums on race YWCA NPR less dot org [noise]\n[noise]\n[noise]\nYou play ten years in the national football league you retire mostly healthy and very rich but then why sooner retires like something is bigger out there for me I have more in store they just highlights behind me I'm ... resolve life after the game next time a marketplace Mm\n[noise]\nGood morning I'm David Greene with a story about the importance of return customers the BBC is reporting on a group of men who were about to Robert shopping Belgium until the quick thinking owners that have come back in the end of the day I'm going to have more money than\nThe guys left the owner told police to show up later they were skeptical but they\nCame and when the thieves returned in the evening they arrested them maybe the owners should have asked the guys to fill out a customer survey or something you're listening to MORNING EDITION\nSupport for NPR comes from this station and from the ... foundation committed to improving lives through invention in the U.S and in developing countries and working to inspire and enabled the next generation of inventors more information is available at ... dot org\nFrom the John de into Catherine team MacArthur Foundation\nProgramming is supported by YWCA Minneapolis coming together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth visit YWCA M. P. L. S. dot org to learn more\nI'm David Greene and I'm Steve Inskeep good morning we're deep into an election season when a vital question is who shows up Karen Grigsby Bates of NPR's Code switch team met people who want to grab young voters' attention by making them laugh\nA new campaign called call the cops started a few days ago and it's thirty second spots are popping up on the Internet in one a guy with a laptop is sitting on a cafe patio he looks disgusted Lee into his recyclable cup as a stunning young black woman\nPulls up a chair the coffee here sucks you know what else ...\nVoter suppression how did you know mining people voting\nNo why is that the parties will represent me officials broken my right so the woman without her phone and makes a call nine one one reporter writing I have certainly thinks he's going to be the next parents you know\nHe doesn't plan on voting oh I can describe him his wife\nIt's a flip on all the white people the barbecue Becky the pool patrol palsy Starbucks suzy's who is called the police on black people just doing stuff\nGrilling in the park using the condo pool waiting in a coffee shop for business partner\nOnly in this video black people are calling the police on white once they think are being irresponsible citizens\nCarrying the gallon heads acronym the nonprofit agency that commission to for videos that are popping up on your mobile devices she gets it they're taking a risk riffing off whites policing black bodies for this campaign to cheat reverse parity\nThere's nothing funny about that but I think that tying that you put that I can gauge men and using your vote to really make us\nProgramming is supported by YWCA Minneapolis bringing the community together to move Minnesota Forward with it's time to talk forums on race on October twenty fifth you can visit YWCA M. P. L. S. dot org to learn more\nDesigned specifically for voters to may not vote in all election or especially in mid term election\nThe company approach director Malcolm delete it helped write and direct the spots least work includes night school and last year's hit comedy girls trip the idea of a direct pleaded voters appealed to him\nYou know I think it's just important for people to um just be aware and like we're not telling you to vote somebody particularly like hey but you got to vote you got to get involved in the process\nSo we sat down with acronyms creative director Vince Murphy who by the way is black and devised the call the cops series there's a hipster a suburban mom and a worried black man played by the daily show's Roy would junior who's calling the cops on the table\nDeals me and the only place to vote November now\nNumber one I like to report an emergency in ... three white women just taking selfies Trumbull self and progress using silk as the motives same person over and over again playing the drama and they literally have no plans of voting in November that scares me that's not a legal [noise]\nPlease or not I have a copy [noise]\nTearing the gallon says most of the responses they've received had been positive and even if a minority of people are offended she says getting their attention is half the battle\nWe elected an emotional response reading corps during a pretty good job\nMalcolm leave much humor to drawing people who see these spots\nOnce you get people laughing their mouths are open you the truth and\nAndy says the truth is mid term elections count\nThere's not enough people who vote in the midterms and those that do um you know get their Persian and\nCalled the cops videos will run\nProgramming is supported by white WC a Minneapolis creating opportunities to overcome social injustice for over one hundred twenty five years bringing the community together to Minnesota Forward with it's time to talk forums on race why W C. A. M. P. L. S. dot org", "show_name": "Morning Edition (NPR)", "year": "2018", "city": "Rochester", "day": "24"}