{"month": "10", "state": "GA", "station": "WNGH", "content": "American public media\nYou're listening to the BBC Radio and teams based in service of Georgia Public broadcasting thank you so much for to make this evening American route to the next ... BP [noise]\n\nWhen a light tanks in the balance what goes beyond a reasonable doubt really mean\nTroy Anthony Davis John them on my mind the\nGPA be present the radio play beyond reasonable doubt the Troy Davis project by Atlanta play right we know the story follows the death penalty case of Troy Davis\nJoined us at ten am on Sunday October twenty first start gp the radio [noise]\nWas Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. rural part of Georgia Public broadcasting radio network [noise]\nAmerican roots from New Orleans\nTwenty ... twenty Seventeen we lost one of our great here a long maker singer in Vienna man entwined fats domino\nReal Buddha New Orleans music within ... miles helped make rhythm and blues with the Gulf Coast\nFats first recording nearly seven decades ago in Nineteen forty nine binds the arc musical genius\nMan was based on junkies blues talking about street wine dealer\nThat made it about watching Creole girls\nWill hear fats domino in a rare interview from our\nAs an inventor early rock and roll\nDomino set the stage for black artists [noise]\nBreaking into the mainstream\nAs an inventor early rock and roll\nAround them and it was set the stage for black artists breaking into the main thing\nHis book ban Billy Boy aren't\nWe'll be on the march with the man or sold a hundred\n\n\nAre ready or my ... fiber meal to American\nThird\n\n\n\nThis is American roots following how rhythm and blues became rock and roll as black and white audiences desegregated concerts after hearing their favorite artists on records and the radio\nA few shows go we played ... blues popular song in Texas western swing music that lead us back to a delta blues version by Robert Johnson from ... Mississippi here's an artist from Mississippi to ... which is Nineteen fifty five breakout an son records\n... does this moment [noise] I'd I looked in to do I keep a little new counseled\nShe didn't Lulu totally fellas that don't move me get re real goal for change\nIn the news I mean we\nAll know it'd be a little money [noise] [noise] [noise]\nOh I knew God given that much to get a little\nOn the phone hold on\nA mountain and I'm On my middle daughter had a normal woman the woman to run out of ... and he joined a member of your own ears red bow and you're going\nTo be able to earn the most part they don't want to be enjoying this one way or the\nBurden on the on the owner and learn\nBall on a bus and\nWe don't know\nI'm happy to do all the pain of the show on the order you know that all of them alone you know\nAll these men are run by Monday through ah through saying look you know would would you know a little bit better than I Am going to do\nWith the migrants who were noble next to the bottom of the brand new been in power today you know go\nTo the middle of the building burned down on his mind and you're going to be bombing or being in English and\nUp my\nOn\n\nIn the\n\n... ...\n\n\n\nIn\nA row\n\nAre doing a lot but near where the noise they may look like me a little dogs ... and\nThen they lose\nYou know and they may look like me I read all those minor rocketing now\nThen they move\nMore than this modern\n\nLa ... get a dog being\nIn my car going if they don't they don't\nRocket ADA shortage in Memphis son record Nineteen fifty one and distributed by chess records in Chicago the credits the singer sex supplements Jackie Princeton and the delta\nThe sun records Nineteen fifty one and distributed by chess records in Chicago the credit the singer insects building as Jackie Princeton and its delta cats band was actually I turned around piano and his ...\nThe famous ... guitar was from a broken aunt used by Willie Kaiser I call these classic car romance songs auto erotic much love for the latest automobile technology\nThe Oldsmobile eighty before that mystery change a little junior Parker and the blue flames recorded Nineteen fifty three two years before Elvis's version\nTrains in cars are relatively new technology and the human journey\n[noise]\nBut what about old technology in music one string ... both stretched on a board or the side of the house\nMade a screen door wire coat hanger played with the bottom that obese bones slide Moses Williams to either being in Mississippi who gives a sense of blue string origins from West African sources\n\nFrom la la la\nThis is the American roots\nBlues artists Billy Boy Arnold ... Williams Chicago's down dying\nCut his team weighing are Monica locals record keeping up with it\nArnold learned at the Newseum ... Williams Chicago's dying\nCut his team are Monica I'm looking street corner gaming up ... McDaniel also known as ... did\nThey recorded a Nineteen fifty by then I'm a man projector record Billy Boy also recorded original ain't got you and I wish you would\nRemained active in Chicago's minor the city's electric blues\nReally boy Arnold spoke to us backstage at the twenty Seventeen ponderosa's down\nMy name is Billy Boy are no\nI'm from Chicago Illinois\nI really started in music ... about five years old\nI used to listen to the old blues songs\nPart relatives played\nAnd I'm the only kid\nLike blue that made the country\nBy the time I was eleven\nI ah discovered that music is Sonny Boy\nFascinated to found he got on the Monica\nI like to call a\nI'm going to\nGet I go home\nGo home\nNah you're going to do your mother and your son in law that they know\nUp artist I ...\nI found out that he lived in the neighborhood\nAnd he played at the plantation two doors\nDown my uncle butcher shop\nGot his address and went to his house\nTo me and my cousin another friend we were all a twelve year old kid wrong to do bail\nA well dressed man came to the door\nAnd say can I help you out I say we only see Sonny Boy can say this is Sonny Boy I say we want to hear your play harmonica\nYou say come on up I'm proud to have you all\nAnd um I said Sonny Boy how do you make the Monica say wow wow wow\n\nOf those late but you had to have your own Salinger all material\nAnd that's how you started started writing songs when I was about fourteen Fifteen and then I met both did that you\nAnd play on the street corners where there is\nNot what I was a little boy\nKnow I'm I'm buying\nYou know may\nWeakened now a lot of bottles\nI was in both\nName ... ...\nMet him out playing on the street\nThe little short guy strong\nAnd he was the media at the Indiana the forty third and then\nAsked I couldn't stop laughing\nThem I say that they had some record\nWhich do I took him to chess records\nField just came out of their background\nPut to record on their\nSay I'm On my brother and I didn't\nSo he was dead by the by the damn\nYou say I'd rather than it is\nSo he was said by the by the time\nI said why don't you say oh this is David\nKnowledge directed came about what we did like that but we can only take an interest in it I\nWould the beach and held up almost ... Monica\nAnd I said I had a stone called duty duty dumb down say what changed a worry on\nTerms on the road I Wish she would\nYear old and I'm On a budget\nBraving the dang fence my baby when waiting\nTo find in pain won't do no good parents come back baby boy\nYou may not have Mondale ms change but no one will then kids late at night I had a baby in the past\nEric classes in Yonkers\nDavid Bowie economy because a lot of time when you were recalled ball ball label\nThey didn't have to distribute chess records and VJ right because what all over the world\n[noise]\n\n\nWe call the down home boos got stuck if it was back in the day they view and the club and the black cool that they say take me down in the face\nI mean probably something really low down\nQuite a white guy they changed the deal that pose a challenge\nOh say when he was nine years old\nLike that out and get your money or\nHouse\nResponse was\nBeing played internationally all over the world first ever spent down by the\nKing both get about a year later\nAfter months after the deadly Chuck Berry made me moving\nRichard made on top salary goes for a man\nWho did away with segregation white curious heard those guys\nAnd they want to know why they just music comes from\nNow you go to China Russia anywhere to where\nThey want to say no ballot Danny Boyle and all that well he painted black bottom building blown up\nI was about a time\nDonald body devastating\nNot all but one\nThem now along oh\nA listener supported G. P. B. radio and Eighteen station service of Georgia Public\nAmerican roots for directs public radio exchange\nListener supported G. P. B. radio and Eighteen station service of Georgia Public broadcasting another hour of American roots back a minute then in the international Americana radio show on GB\nPollan care to tell you the next edition of the international Americana music show which is going to be deemed edition of the program as I take a break from featuring new songs and I play some of my favorite old songs tracks from as far back in the sixties seventies and eighties in terms of the century as well to join me with the usual time\nShould be classic edition of the international America needs to show\n[noise]\nThis is Ninety seven point seven FM double your G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n[noise]\nList as American roots where we'll listen back to Nineteen fifties rock and roll sound that combined rhythm and blues country music and gospel roots rock was bleeding buried can conscience by Elvis Chuck berry's Carl Perkins the Everly Brothers and vote did leave\nAll of whom will years this hour [noise]\nRock and roll also inspired British artist from the Beatles stones a van Morrison but how\nNow in his mid seventies is viewed among the greatest living rock and roll ... [noise]\nLike many aimless teens reimpose worrying when our found himself deeply plug into American rockers that led to the British musical invasion into\nEl waited on who you ask them for a visa and some of the T. V. shows watching a case as exciting for us then you know is driving the heat and the preschool recordings [noise]\nThis is going to go to guy [noise]\nAlbert lea from working class for it to telecast are master living in Malibu following his late ...\nOn both sides of the bond on American roots [noise]\nUh\nFollowing his lips rock on both sides of the bond on American ...\nDo you need to do that you know\nWay\nAny time now\nBeing a mom and dad\nI don't mean to you again on\nArea of male ...\nAm a hill\nIran or ...\nYou want to\nOn a day or\nI I Love going over ... ...\nAnd they're my man away on the back\nMy life living around ...\n...\nEmail we choose\nYou get\nBut you're gone rogue nation or\nNew owner that may\nHave you on a bad by\nThe way down south but to\nIt ...\nThe whole law\nOrder a rock band\nAny relief to\nMe you got to remember all the time\nI don't care that air over that time\nGoing on and\nAnd then they go\nIn New York Times you know there's\nHe knew a\nYou own I may I may\nWay and I was a baby mama rock band ... brain Iran Iran\nIn ... where there is a lot of coal hero\nI've been rock and roll and our long long dying I understand it all up to rock and roll in Europe\nI've been up into a long time and I ended up the rock and roll\nUsed to have a baby and go to you know what was her name is already know\nThe way they're going to be it but just then shame about the law\nSince ... though it's been a\nRuled by the same\nBeen knocking down the road oh well die on the rock and roll\nOut of my music but\nMind it go\nGod I have not usually\nAnd a jump when going to do both\nWhen Iraq and roll\nAnd get it all\nDie on the ... and ...\nWell that was the name of ...\nWhat do you live in\nYou know what the rock and roll low low oh and there's\nFor a long long time and\nMixed up here\nMe all most of the [noise]\nDo\nThey have done well\nWhat we do a\nShe makes\nIn the ... and they'll go\nMixed dome will make\nWalter the late Chicago blues heart player for mark bill Louisiana crazy mixed up we're\nTalking about how he loves the rock and roll from Nineteen fifty nine before rock and roll was distinct from rhythm and blues you up in other spouse\nBefore that Bob wheels and the Texas Playboy's Nineteen fifty six so let's rock even a western swing ban could do it there with a lead singer Lee raw to this jockey from Long Beach California\nAnd we started with the ultimate crossover guitar anthem Chuck berry's rock 'n' roll music from fall fifty seven the Beatles\nOh this jockey from Long Beach California and we started with the ultimate crossover guitar and some Chuck berry's rock 'n' roll music ... fall fifty seven the Beatles covered rock and roll music in Nineteen sixty four here's the original of another song covered by the Beatles\nAnd Tennessee in Burke in Nineteen fifty honey do on American roots down\nFor Nike forty one [noise] it's good morning blues on American return\nNo no\nNo no\nNO NAME or do you use and you\nI'm doing All right let alone how [noise]\nHow do they know that even though the journey from some of\nOther night that\nI think men have been\nNo no no\nNo talking about being\nThe boon walking around my band\nHow many grams\nThen you've got to walk into the\nThe time all day\nI don't think I don't know what they [noise]\n\nLong haul [noise]\nHey baby you're traveling on American troops from New Orleans\nThat it is a story about the ...\nHe runs down at the New Orleans\nEngine that dot a New Orleans is a big joke\nYou know trained they go through the dog and why they got they demand the money to\nGo see if you got certain things don't bode you okay you don't have to pay him and\nNow we did change you know down the line and wish you the dog ate his job but he got down to the men and he said\nI got ... ... oh God awful and I got ...\nGot ... ...\n... they were your eye boy did you know they don't have to pay me no\nEnd to try and go through and when you go through the toll gay to try and get a little bit steam\nThe ... and we need a job I think if they own outside the house back down the line with the man he did on when\nYou're not tell you well going the way\nDebate in the morning or\nNow I'm not\nHe made in that dumb\nLet me no\nThat may not\nBe\nBut not on the you know look\nAnd they really don't do\nWe're not on my own but not the\nOnly\nA lonely maybe not\nOn the\nWe'll let them make na\nNa na na na na mating or whether\n\nOh no no\n\nHow\nMany\nTheir own may\nFeedback\nFashionable fan more than ... increased barber live in Belfast Nineteen Ninety eight\nLooking back on the ... era of their you with the prison song they heard from Leadbelly midnight special the train it was like my chain the cell of the incarcerated in pre stage their release Lenny done again before that on his own would Lead Belly Rock Island ... and other train sun with a sense of escape\nWe've been hearing guitar singers and styles and blues country Schiphol and rock and roll but influenced British rock guitarist Albert lea or upcoming gas here a few Albert including Scotty more solar with Elvis\nAnd James Burton Ricky Nelson but let's kick it off the buddy Holly and the cricket Nineteen fifty nine re by\n\n[noise]\n\nYou know I I went to a good school but um dog got thrown out the cage Fifteen [laughter]\nAnd I was doing day jokes are Eighteen months or two years but during that period you know I was progressing when my plane I I don't know if I really saw what the hell is going to make a career out of it but I had no qualifications for anything else\nSickening I mean that's the that's an incredible era anywhere but actually I think well\nI'm a which which Cruz's father for four years that was\nOr to clubs in the west end of London it was great for mango twelve which is kind of our um the and jazz bass\nSo I play that we saw low and they were a lot\nGood guitar place down there John McLaughlin down there playing with the band Danny summer's use language and Martin big role when\nWhat did you see when you thought about the U.S will we love the U.S assuming drew from the movies and uh some of the T. V. shows we watching you know I never dreamed I'd end up living there\nThe seat was early in the sixties when I met the after your brothers and their band you know\nIt was just like club there weren't a lot of people in ... uh we finished asset and there were a couple of guys standing by the by the\nListening intently and they came up and said oh yeah we love music and there were American Idol or what you do all thank you yeah and\nDon't know where we hear on two and\nHalf ago or who you're with thing should ... which he actually broke it was because my my jaw drop so you know and uh I guess it was a ... to say that again you know you should come to LA you know we'll watch\nGreat guitar players over there and he said well\nYou try really will you do well that this was Romney sixty two\nI wasn't until Nineteen Seventy ...\n\nVe\nAh the\nGators uh to your\nTwo old friends of mine that I I Know for a while they said well what we're going to do an album or\nI was there as a as a session guy in\nWhat we saw with capital and it was a pretty big deal for\nAll ... states you know\nWhat was the band you know being go head and they treat\n\nOn me about some of your favorites off the\nCoast luxury liner were then Harris was one in particular to introduce me to\nAmerican country not yet\nI said well is this guitar player because everybody's so we James but you know groups but I took over from James in that in that bag you know but that that\nWas a turning point for me because I realized that at that point [noise] I'm now\n\n\n\n\n\n\n\n\n\nHadn't really thought about it before I say you know it's just a it's nice to be appreciated in\nDemand for so long you know I've never really been a big star with ... with a lot of well known people but I always look to myself as a gigging guitar player\nWhat would you like to do now what do you see is the current directions for you know a lot to carry on doing what I'm doing but um earn more money and\nDo less gigs that I said oh well rural aiming for you know", "year": "2018", "show_name": "American Routes", "city": "Chatsworth", "day": "21"}