{"month": "10", "state": "GA", "station": "WNGH", "content": "American public media\n[noise] you're listening to your gp be radio and Eighteen station service of Georgia Public broadcasting thank you so much for tuning in this evening American route to the next ... be be [noise]\nThis fall we're counting on the participation of everyone's you listen to cover the rising cost of the programs we bring you an GB if we didn't hear from you during our fall fund drive there still time to support the programs that make a difference in your life please take a moment now to make an online contribution good a G. P. B. dot org and click donate at the top of the page\nYour contribution at whatever level is right for you well help cover the cost of the programs you log on cheap ...\nThank you so much for your support at Georgia Public broadcasting\n[noise] of Ninety seven point seven FM WG P. B. S. W. A. G. P. H. D. Rome quarter but Georgia Public broadcasting radio network [noise]\n\nPeople from the Spanish Caribbean central and South America\nLong come to the u._s. for a better working lives bringing their music and culture\nThat pledge anew means that the\nTropical jazz heroes of New York city like Wednesday\nShe doing mongers Santa Maria\nAn ... out west UCLA Rob from Los\nWe thought that there was a need for us to bring back some of the culture that total reason why we\nWe didn't get up and the lines and you know we've been with the flash but we felt we could do\nLevel Caesar Rosa and more of the ban in Congress on the on the mood to\nThe bay area is lower than than a mocking bird new creators and the Mexican American cultural scene all coming\nUp almost it's on our crossover dreams Latin music program at the great Texans accordion player lock all human and\nIt's a song written by his brother's Santiago for about a man fed up his girlfriend's running around so he decided to go out and have some fun him still\nI say they hope in San Antonio I'm going to leave you\nFans fed up his girlfriend's running around so he decides to go out and have some fun him so\nI say they hope in San Antonio\nYeah no we had a good man during the\nThey need our daily game Jet Blue ball bearing\nSmoke back yesterday I saw from when\nGet a lot of hand though you have maybe a ...\nI don't have I have five\nI don't need to get it might be ...\nOn channel who has already begun their\nYoung man why but I Know I'm I'm a lawyer ...\nBest athletes you know then\nWill not that many jobs they're somewhat right on\nLabels downloads joined by that name I\nYoung man and when\nTheir own money than they need\nHire more man does get by and then send them on your\nFive hours a day will download joined Vijay ...\nDa da da da da da\n\nJust to create kind of eighties rocks on\nGreat great record so at that point I mean what what is the symbol when you asked that question how\nWas up to that point everything we had done pretty much it was\nSo I'm like let's say\nDeal with our son and I just remembered\nVery clearly my mind that go okay everything changes from your own out that said I was just a stunning song studying moment I just got to give us a new perspective on what we could do you know where we could go in the street from\nCaesar you've continued to both love the rhythm and blues and stole rock and roll but also to keep great may kind of ...\nThese are you've continued to both love the rhythm and blues and soul rock and roll but also to keep great may kind of music floating into the repertoire the group\n...\nKind of blew the vibe and yet up of course the Columbia\nDon't get the last few years I've kind of got into the Columbia have always loved going to be going to be a beep or me has always been a very a dancer will be and I'm not going to like it was only a story on\nWe have fun with it because we don't believe\nUh I like to say that we sort of played in sort of like in the east LA\nArea or even the audiences that have no clue what it could be used to be there so elemental that they jump up every time there was a guaranteed ...\nOn the original recording and can trust you would\nThat sounds like it that's just the classic heartbreaking\nMan and woman Kennesaw and here you are doing another one\nOld lectures these songs that are very much like that you know it\nBetween a man and a woman you know\nBy the way wrote it now just to keep it like that you know for me it it keeps that that old tradition going and I think it's very important\nEverything is there you know that's where we grow up and everything in our lives is really there you know\nIt taught us a lot of things you know east LA the streets and everything we stood by ourselves working garage there's quite a bit I mean that part has changed much we recorded more than a lot and\nYou are you're in a lot of the term you know that everybody says now you know we're keeping it real well over ... keeps us going that's hey they know ... I Believe the\nEars to the teacher asked for the survival of the wolf and truck Bears Ears thank you very much\nAt it don't bother me but\nGuitarist singer Caesar rose up and that meant the Berlin of low low both on the walls are thriving heading into there for decades\nIn a moment we'll hear how the mocking bird do it that's the name of ... band in art center near San Francisco when American roots gets back on the road [noise]\n\n...\nThis is our program crossover dreams devoted to the great migration the transformations of black music and culture across the U.S in a moment we'll be at ... Mexican art center in the bay area\nSong they learn from us being we know they're not they are going hunter banned from northern Mexico on the Texas border they\nMay go American ...\nThe money they call you Mickey na na\nNa na\nNa\nMeal dangle and then they\nHave been like\nMan he does\nNot gotten the gun lobby looked on\nThey did on\nTo be the legal fight and\nA loan on the\nMaking\nThe manning\nDay you'll know\nManning\nHe blonde daddy none\nThose ... all the mocking bird song about the pleasures of being Mexican American with great vocal some fabulous review and Lucy know rigor both are performers and cultural workers with ... Mexican art center them Pablo California\nCenter is an unassuming store front and shopping mall\nBut inside it's not mall culture\nWe arrived just in time for listening to death clash\nOf her body doctors for kids and they\n\n\nAnd [noise]\nOr a\nGuy or a\n\nEast LA but love little Willie gee the midnight or some vocals would look straight jackets the rocking bend your band or they have to pay their way would hang on Snoopy on our crossover dreams program devoted to Latin music and culture in the U.S\nComing up a conversation from our our car with Tito point when American roots returned\nDa da\nAnd listen to\nEr Nextel picked up one day and the corn in New York City Nineteen twenty three his first grade came when he joined my chief those big band as a teenager he formed his own band a few years later and literally brought his instrument symbolic to the foreground\nPeter with various known as LA detained ballot and the king of\nWhen we spoke to him in Nineteen Ninety nine he recalled his childhood date\nAs a young child was a very a customer was banging on things all around the world until the neighbors complain to my parents my mother put down the threat to study some Salt Lake drivers crazy about seven years old studying piano at twenty five cents a lesson\nAnd walk a few miles and all that once a week well my parents are very poor naturally to an open Spanish Harlem that I was like a hundred and ten street around there and uh they build up a lot of a um a street music sound because jazz was involved\nWith does he get less you know these people and we had the great much heat to ban at that time so that's where most of my ... came for jazz and let me in\nI think it was that uh\nI think it was that got you to take the percussion and part of a band and bring it out front\nWhat happened was in the old days older really sectors are always in the back hold up to the boys are in the front sets players and the trumble players and the trumpet player so [noise] my boys look look back towards me to go to ... to go on she says they don't want to my main news Jimmy ... or\nHe was someone who suggested to me to go in the front and it'd be easier for them to get the accused you could go on to the code up to the mobile and they just picked up the tamales and went up to the world by actually it wasn't planned do you know\nAnd that was a ... for over fifty years going out all the banjo than my older rhythm sections are all in the front and actually I'm Glad because that's what people to is the rhythm anyway that'll dancers it's actually there was a ... a little trouble they tested the drum\nCalling the Jones and the ... the bongo whatever has the ... the real basic rhythm of it\nSo I'm Glad I'm On the front [noise]\n\n\nKnow about music and I read the news of the music is not receiving a lot of a recognition around the world there is no bilingual problem any more effective like shower with my friends and then she said on on TV if you want to live in the United states you have to speak Spanish now\nPeter pointed gaseous product come right back on those for such a pleasure to speak with you about your life and your music here on American route\nAmerican roots is produced a two lane University's School of liberal arts unexpected and this is be Iraq's a\nListener supported G. P. B. radio and Eighteen based in service of Georgia\nFor large I'm next pitcher and this is be Iraq's\nListener supported G. P. B. radio and Eighteen stations service of Georgia Public broadcasting another hour of American roots to ...\nMinutes in the international Americana radio show on G. P. B.\nHigh Michael park here to tell me that on the next edition of the international American music she'll only will I be leading us on the musical tape around the world but also when taking us back in time to Eighteen eighty one to find out why and he is Thirteen great song by singers\nJewish trio isn't one coach K through June in at the usual time to another all new edition of the international Americana music shown\n\nWas Ninety seven point seven FM W. A. G. P. B. S. W. A. G. P. H. D. Rome part of Georgia Public broadcasting radio network [noise]\n\nIs as American ... my next watching\nWith crossover dreams migration and changes in Latin music and culture\nOur conversation coming up with the leader of the Spanish Harlem workers from last weekend and the girl from the south Bronx\nSurrounded by New York's greatest land musicians and I started playing professionally at the age of sixteen\nAt that time there was an incredible incredible scene in New York City where they were clubs everywhere we used to literally work seven times a week if sometimes twice and three times on Friday Saturday and Sunday\nWork history leader Oscar Hernandez will also see that on a live studio session in San Antonio was according to ever be borrowing costs Latin sounds with dizzy Gillespie and channel pose a Lydia Mendoza and Freddie fender\nBy most pull 'em will seek a\nTune by Tito point was later play to a world audience by Latin rock musician Santana [noise]\nHere from the Nineteen Seventy one ... be ... or some of us\n\n[noise]\n\n[noise]\n\n\n\n\nSpanish Greece Nineteen sixty five tune from a late afro Cuban Jasmine we both grew up in Spanish Harlem\nAnd translate for his musical mentor Mongols Santa Maria ... played was cedar point today George sharing and couch Jeter before getting out on his own great hero the New York city Latin see willy ...\nThis is American roots where we're headed down the road to Kensington in North Philadelphia the heart of the city's Latino community\nSaw in the bed and I'm like a mogul numbers he got me going what\nFor me to host a weekly show on ... Thirteen ten am Bermuda is a long time musical activists he founded am LA the Societe ... kind of to promote Latin music in Philadelphia he calls his radio show so they do different things out well the idea\nBecause like in America to promote Latin music in Philadelphia he calls his radio show so you do different things\nOut well the idea of the concept of the different found well nobody was playing our local artists [noise] so the difference found that you're going to hear now about [noise] he was a\nI'm Nick Spitzer this is American roots are program crossover dream [noise]\nHarlem orchestra recently captured a Grammy for their two thousand ten albums leave out after the on your sister's leader and pianist Oscar Hernandez tradition\nTo learn to mix flattened tradition with new sound language Ruben Blades ... another great New York's toughest thing\nNeighborhood of the south Bronx where he first got into\nThey make a big thing out of you know the south Bronx being a ghetto but it was full of life was full of energy you know you hear the music\nOf cedar point there's certainly a cruise rape or read oh any primary much cheaper to eat or drink is ready primary yeah to a famous to court lawsuit got bought the he was in the forefront of what was happening in those days\nMy oldest brother was the superintendent of where we live and\nRemember the teacher saying oh this kid's going to be good [noise] but after a year and a half you said you know what may maybe you should switch to piano to ... because that was having trouble with the physical armature the trumpet\nAnd lo and behold it was like God says you will have a piano somebody gave my brother of piano when he put it in one of the rules in the basement and that's where all started\nOn and then ah they smell and made on a tell me a little\nJoy thrown a and then a piecemeal and meet on a tell me a little bit about those early gigs\nStronger was actually my first professional experience I started playing professionally at the age of sixteen and after that I went to about a year and a half later to marry me down to who was the most popular singer of his day they called him a ... pretty boy\nNow\nThe bank bond\nThis was the early seventies I Seventy one Seventy two Seventy three that time there was an incredible\nScene in New York City where they were clubs everywhere we used to literally work seven times a week and sometimes twice and three times on Friday Saturday and Sunday [noise]\nWe'd be alternating with a very far marry the peak out Seventy three rape or read all\nWere all top notch musicians so for me it was a an incredible training ground as a musician and as an upcoming pianist and a sparring ranger\nLet me ask you about a rape or another great a percussionist or you're working with them how did that come about\nI think I was must have been about twenty three years old and his Ganis for whatever reason could make an important concert where he called me and we had a couple of rehearsals and and that was my beginning with\nA rare like Jesse and playing with Art Blakey or Duke Ellington or pacing ray was one of the most knowledgeable people of all styles of music so not only was he an expert in Latin music but he was an expert in ...\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\nReconstruction album seems to be one that was important for the emergence of what people started to call close to [noise]\nNo doubt solve so it was a term that was coined until the seventies and just like it was a ... a lot of the old guard people didn't want to know part of the term because\nTo became a commercial term for the music to the point that I think had some objections to that yeah you object that he says it wasn't sauce will be for all of sudden now they're calling it solves the\nCars in those days they would call it either mumble song why won't go what are chock ruined by that different terms for the different styles of music it all became incompetence by one word there's nothing bad about it but I can see why\nIn the mix this emerging mixing the salsa and all the things you've always cared about getting back to the root of what was going on politically you had\nGroups like obviously on the black side or the black ... within the Latino say you have the young lords and New York city who are\nLatino activist and very much in the forefront of trying to get equal rights for Latinos and as a year or two you know it was very much into trying to be proud of my culture my heritage find my identity within all that was happening around me but I think\nThe person that I became involved with later was very much revolutionary with his ... was a Ruben Blades\nOn it I feel like I don't know why did they\nTo be more like I said I got on it that'll thing though\nOur auto\n... na ...\nHe was making very important statements with his music that\n... I'm On yeah nah ...\nHe was making very important state in the music that Latinos felt hey we need this and this point in time [noise]\nTime next to this is American rich was talking to the greater range or piano a bandleader Spanish Harlem orchestra scar him Mendez you've got\nPlenty of going to solve or I mean when he does called swing and that's the that's your arrangement but what is the plane up\nPlan is one of the most important rhythms and the national resident of\nPuerto Rico my parents are from Puerto Rico and my little way of paying tribute to my culture\n[laughter]\nOf these songs whether it you know you or others have written them seem to really speak to the lights are in the ... one of your band\nMembers the rate that applies to the ground the in your body over big day in the neighborhood where they get to the takeoff on the old Harlem a photograph a great day but it really speaks to sort of celebrating the neighborhood as neighborhood\nWell no doubt about it I I look for somebody could have a positive energy in the\nYou bring out a whole era undeveloped pretty feeling [noise] why do the polar\nIf you're like me do you listen to that bullet on you just go like oh man I mean it's so beautiful that was an incredible part of our rich tradition back in the day man why do we need to forget about that I Choose to make it a point to let people hate us and we'll play that live and people come to meet with\nTears in their eyes I don't need any more validation\nRuns out of money and food to eat the thinking I lay my guitar my legs were shaking\nHe manages to stick to all the money belongs to Rockefeller and Henry\nPrices are high teen thirty two on American roots are girls ...\nDerby bull knows better than it does get a\nBy a\nLaw that those that you know what maybe they need to get a\nThey found out about a\nYang I'm done not done yet again and again on that bill that get a\nAll day long on gay you'll die he a jam packed that on a guy by\n... the\n... that are a lot we didn't they like the new\nLaw though these mass\nMedia about going there though\nWe did things like the\nThough these are not by a\nDown maybe I've done gone then though\nDown there\nGet it right now about a ...\nThe lawn and little Ivanka\nGain on me thought about it in the\nAnd then going by the by you know like most of my name on\nThey know that a lot of money that they bought on Monday and then allow the economy\nThen your legal bone in their mind\nYou get that out when they're\nEast and spent time though the\nMore like a man of the things I'm not either do\nOr not being there not that bad a gang up on me by law during the ... men young men and I\nThat Donald was got 'em all the way I don't do that now more than more\nThan one in that or not yeah may\nWrong like yesterday ball the whole time and then be though\nThey saw the sign that he's been a long\nBut they like\nEarn\nAll that I Know I'm a ... a about a hour and a most\nAnd on a\nLittle\nYeah man\nA\nLoan\nUh\n\nIn\nA long\n\nThat and I'm\nBall ball\nA\nLaw that\nOwned by bottles\n\nA\nUh\n\n[noise]\n\n\n[noise]\n\n\nMaybe\nThe reason they know they need to do yeah\nMaddie man is not I\nMean you\nKnow\nHow young man um\n\nThe\nYard and then um you know you\nA DVD\n\n... by the um\nShe\nWould shield na huh you know it's bad for them\n\n\nTo be done by not ... ...\n...\n... e man needs to feel nice they did on the out oh\n\n[noise]\n\n\n[noise]\n\n\n\nThere are those the duty have us both from the beloved singer recording artist Lydia ... my color the ... the border they're Nineteen fifty one with the big sound a bit to be orchestra\nWhen he Mendoza was born in Nineteen sixteen in Houston to parents from normally on they fled the Mexican revolution come to the U.S\nBefore that Baltimore where the from the Texas border town San beneath two he took the name of an electric guitar as Freddie factor the late great to handle musician with his ... own yet on the like a ...\nTowns ... to he took the name of an electric guitar as pretty fender great to hunter musician with his ... on on the like a wander searching not for work in tough times but for love\nWill end our Journey Through the music of over a century of migration of Latino culture to the U.S back in San Antonio where we began\nIn San Antonio most nice you can find two musicians entertaining it's seen as across the city with the accordion taking center stage usually the player he's the man\nThe best accordion east is in town is a woman ever ...\nShe started young encouraged by her father and mother were both musicians have its first she was so small she needed to stand on the root for it maybe ... there'll be found performing around town and we asked her to play a few tune with\n\n\nUh I'm In San Antonio ... beautiful there thank you thank you\n\n", "year": "2018", "show_name": "American Routes", "city": "Chatsworth", "day": "07"}