{"month": "10", "state": "AZ", "station": "KJZK", "content": "Western college has its border radio Thirteen twenty am kale at the human and border radio ac dot org we also broadcast on the Arizona community radio network at eighty nine point five FM gauging the H ... Williams Ninety One F. M. K. J. C. P. prince get Ninety point seven F. M. K. J. C. K. Kingman in Ninety One point three offense\nLike stuff and you must funny either they're Seventy eight north northeast when ten to Fifteen miles per hour today mostly clear tonight lows around fifty nine England has a chance of showers in sixty you're listening\nTo the Arizona community radio network on kj da ... by Drake K. J. C. P. Ninety put one question and Katie Nikkei Ninety point seven came with\nSupport for ... public radio is provided by the apple pie humane society caring for over three thousand animals large and small each year and inviting you to be involved as a volunteer\nFinancial support or or a doctor it's many programs include a low cost ... neuter clinic thrift store and echoing Center for abandoned abused horses visit the website that you have a pie you may not work\nSupport for the Arizona community radio network is provided by Tim and regional medical center fall means cooler temperatures football and\nThe flu this season get vaccinated out protect yourself and the most vulnerable members of our community after Karen see provider if the flu vaccine is right for U. K. R. M. C.\nBy the public radio programs you enjoy the poor middle aged editor logo to June in radio dot ... at the Arizona humidity radio network that looks at any time on your smartphone oh\nNo oh yeah\nThe internal ...\n[noise]\n[noise]\nNine thirty they're raising Dawn Dawn\nAnd the\nGirl\n[noise]\nMm Mm Mm Mm Mm you\nI you\nHave any shy\nNa na\nDay time\n\n[noise] [noise]\n\n[noise]\n\n[noise] you\nReal tall\nAnd now you\n[noise]\n[noise]\n\n[noise]\nDon't\n\n\n\n[noise]\n[noise]\n\nNa na\n... then maybe somebody else's cars\nWe're already seeing that the same but\nYou know wanted cleaned the ...\nThe thing you learn to be such a damn live\nGreat why'd they have the the\nThe right here is that if you leave the area\nNot allowed\nCome get money\nBack [laughter] you\nKnow in my name\nOut there [laughter] so\nDo we go in the state who\nOut of the things is dating back to you\nJudge that you know the the is on\nI don't\nJump in my\nYard shrimp can't\nJump yeah national\nGuard\nCannot\n[noise] na\nNa na na\nNa\n[laughter]\n\n[noise] so\n... [noise] ...\nYeah the goal is you do [noise]\nGlued to the ...\nGeorgia being green either ...\nBeyond [noise] [noise]\nThat they come to [noise]\n\n[noise]\n\nYeah\n\nNah\n\nDo\nYou\n\n\n\n[noise]\n\n\n[noise] [noise]\nWill not\nLet's see we\nNa na na and\nHampshire up the phone and\nWe ran the and\nWhen when they were by\nDo you know green and ah\nIn July we in my article\nI don't\nNo no\nMachine John ...\nNa\nNa\n\n... dirty projectors that lifestyle\nFrom well pro beetles re mastered I'm only sleeping and it was kind of power\nWell that's for a new album wonder if you just turn its welcome it's under current ... wrecker Willie Nelson on the way it keeps a cold in the wild and videos and right now is remember John true da\nAnd AA and na gung\nMan and green and all that day and all\nAnd the people together and ... and ...\nHe doesn't get out on a chat\nAn old lady said you know\nAnything to me you know and\nI mean I sat and too many rooming with all\nMan and a\nWho's been through everything\nAnd\nThe intensity is the ...\nEverything else you know\nTrying to get a better name\nAmend old lady thing the thing to me in\n...\nIn my addiction you know\nThere might be reading or energizing\nThey may be needed needed\nHer neck\nAnd understand\nBe a thing with me and\nThe imbalance may be wrong to me\nNa na\nNa na na\nWhen I get really easily ... you're going to be designed the pros\nIt's the ... in the back\nInto a share of two branches brown ...\nTime that it probably doesn't get out and brain but when you do\nThe tea is all that he got me and all that he said oh\nLead me be the case may", "show_name": "UnderCurrents", "year": "2018", "city": "Kingman", "day": "16"}