{"month": "10", "state": "AZ", "station": "KJZK", "content": "You're listening to the Arizona community radio network on ... ... I drank K. J. C. P. Ninety putting my question and Katie Nikkei Ninety quaint seven kingly support for ... public radio is provided by the yeah the humane society caring for over three thousand animals large and small each year and inviting you to be involved with the volunteer\nFinancial supporter or a doctor it's many programs including a low cost pain neater clinic thrift store and equity Center for abandoned abused horses visit the website it you have to pay you may not\nSupport for the Arizona community radio network is provided by Cayman regional medical center fall means cooler temperatures football and the flu this flu season get vaccinated help protect yourself and the most vulnerable members of our community\nAsked you Karen see provider if the flu vaccine is right for U. K. R. M. C.\nBy the public radio programs you enjoyed that is for middle aged editor Jane logo due June in radio dot com that church or gay Jay Z eight at the Arizona humidity radio network that listen any time on your smartphone\nAlready to to undercurrents I'm Greek McGregor working quite as you with us from delighted to be in your space the new ones coming up mountain man in your school so liberal I\n\nMom you\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nI don't know\nBut I\nYou\nTo have\nLemon retreat he yeah he was in\nLady who play in the book but\nIt's going to be another ... for\nAnd the number\nDay was not the like he was cooking the day\nIt says is there's a there's a hunch is ...\nTo look forward to this cat is going to get to create new scanner mango is so smooth smoother than the devil may soon go to like jump up to the ... main rebel\nHe is the way he was\nHe's ... years with the ... the\n[noise]\nYeah [noise]\nI told him only don't you're\nGoing to be the same\n... been doing to move\nTo new\nYork Times you'll see the ... you know\nDo we need by\nThe way he\nCan\nDo\nTo\nWin the bid to me by the\n\n\n...\nThe the way ...\nOkay [laughter]\nNot\nIt's highly trained\nYou've never done in the bottle\n... na na\n[laughter]\nNa na go knock on the left or the people you're listening to undercurrents radio alive and direct\nKnees [noise]\n\nYou know\nTell\nI go through ...\nAnd\nA nice generally is\nYou know they\nThat in fact I got in that comment and then they expand\nThis about it that that will guide and I I started to learn\nLevel of and then not the only thing I like when they believed\nThis is so uncalled and you're listening to undercurrent\nThey still need to know the the the um the the only need to be\nJoni the ...\nAnd then the ... when the ... the one thing that you didn't just\nWas a German\nSure\nThink she'll needed because we don't need me oh believe me I\n\nDon't need to call me the ... when the men women and\nWith you man\nI just don't buy\nAnything to\n\nThe\n[noise]\n[noise]\n[noise]\n[noise]\n\nTo\n[noise]\n\n\n... ... ... ...\n... ... ...\nUh [noise]\nBritain would have you with that one back in Nineteen sixty seven Sean called the cue me a little son from uncovered from Columbia to see people that do switch to battle\nThe Beatles from the new expanded edition of that album well known as the white album\nBetween your team actually back in the USSR and it was and we kind of show which is now now where it's undercurrents would just rolling down here of course we're commercial free went on to his radio\nI Swear to be like I Know pretty soon coming up Jimmy grant and poke Kelly ensure we owe it now to this is to fly and\nStay a neat in may\nAnd down the", "year": "2018", "show_name": "UnderCurrents", "city": "Kingman", "day": "09"}