{"month": "10", "state": "AZ", "station": "KJZK", "content": "[noise] [noise]\nYou're listening to the Arizona community radio network on kj da play by Drake cage ACP Ninety One credit and kj Nikkei Ninety quaint seven kingly support for Prescott public radio is provided by the yeah the humane society caring for over three thousand animals large and small each year and inviting you to be involved as a volunteer\nFinancial supporter or a doctor it's many programs include a low cost they need a clinic thrift store and quaint Center for abandoned abused towards this visit the website that you have to pay you may not work\nSupport for the Arizona community radio network is provided by came in regional medical center fall means cooler temperatures football and\nThe flu this flu season get vaccinated help protect yourself and the most vulnerable members of our community after care and see provider if the flu vaccine is right for U. K. R. M. C.\nBy the public radio programs you enjoy that and for middle aged editor day while go to Judy in radio dot com that church ... at the Arizona humidity radio network that looked at any time on your smartphone\nAlright friend it's undercurrents I'm Greg with Ficre glad you're here we've got some terrific music for this hour from the national primo when Mike universal speakers the birds and this is ...\nWhat's\nThey were\nTo [noise]\nWhere you are an hour or an hour on\nTalk of any way the law\nThere have been\nMate in ... in a in a unique on law and order and learn and learn and learn you know\nI mean there and and now\nI live in a while\nNow and\nI Am a\n\n... mile per hour and\nA year in the way it is\nA reporter and editor in order to learn them and you know in my car\nAnd they're doing in a way I Love her and ...\nAnd ... and you're making your head around\nEverywhere and Charlotte\nAction a journal\nAnd hang out with a [laughter] na\nNa na na na na na na na na na na na\nNa na\nNa na\nNa na\nNa na na na na na na na na na na\nNa na na na na na na\nNa hey there you know\n...\n\nThe last day on earth\nThat hanging by a\nGuy in a row\nAnd then when you are\n... ...\n... and ...\nWhen you're an adult and [laughter]\n[laughter] that are are in Maryland now\n[laughter]\nWe're like swimming em er visits on the currents thank you for listening\nThe ... [laughter]\n[laughter]\n[noise] [laughter]\n\n\nNa na\nNa na na\n\nNa na\nNa\nNa na\nNa na na na na na\nNa\nNa na\nNa na na na na\nNa na na na na\n\nNa\nNa na\nNa\nNa na na na na\nNa na\n\n[noise] ...\n... ... ... ...\nRecently when he ... he was doing ... ...\n... ... you'll see another\nA business leader ...\n... do you mean you\nNot a citizen in ... when the ... the\n...\nMissing the slow down the road\n[laughter] [noise] [laughter]\nWe petri always be the giants [noise] all the way that I don't mind me man I had I Lived on the U.S [noise]\nBecause there was a [noise] keep you know when it's on on on the news and by\nThe by home [noise] even to do to on gay na\nNa na na na na un\nUn spy or you are on\n[noise]\nThat have no training I lay out a way I look\nThe same thing and I don't know where I don't mind [noise]\n\nNa na na na\nNa [laughter] [noise]\nYeah I was saying and I\nGo out and all\nYoung man living as na na na na na na na na na na na\nNa na na na na na na na na na na na\nNa you want to go off\n[laughter] [noise]\n[laughter]\n[noise]\n\n[noise]\n\n[noise]\nMm\n\n\n[noise]\n\n\n[noise] [noise]\n... money quiz shuttle bravely and butler creations here on undercurrents I make you feel good to beetles back in the USSR the twenty Eighteen mix\nFrom beetles expanded edition of the national you to screen gloves from the boxer and he was Israeli group Moshe off how good\n\n\n\nI don't get any news [laughter] [laughter]\nAny [laughter] [laughter]\n\nYeah [laughter]\n\n[laughter]\n\n\n\n\n\n\nNa\nNa\nNa na\nNa na na\nNa\nYou know\nThen ... ... ... in the beginning\nThe sun me\nWell in the\n... do you use the money but the man in a\nWhile\n\nMillion on both a\nThey were in the role\nThe\nBus and grow in\nThe\nAnd taking\n\nKnow and there\nA number or\nOr\nAnd then it really you know I mean a", "year": "2018", "show_name": "UnderCurrents", "city": "Kingman", "day": "23"}