{"month": "10", "state": "NH", "station": "WEVN", "content": "And then in August of twenty twelve effective immediately right before the election you have the introduction of DACA\nThe department of homeland security is taking steps to lift the shadow of deportation from these young people\nWhich really was a huge moment of elation for Hispanic voters and for which he knows broadly who cared about immigration reform\nSo how did these dueling strategies Obama's Ann Romney's work out for each of the candidates when it came to the Latino vote\nWell I think to answer that question you really just have to look at the results President Obama won the Hispanic vote by something like Seventy one percent and Mitt Romney took just twenty seven percent one of the all time lows in presidential election history\nAnd what lesson do Republicans take from what looks to be an electoral blowout when it comes to Latino voters\nOr a little bit to mass focused and not focused and people's hearts that we don't relate to I think average Americans more than we should um stuffy old guys\nThey came out in twenty twelve with the now famous autopsy report which really instructed candidates to find ways to communicate with Hispanic voters and with other minority voters to bring them out to the polls to show them that the Republican Party is\nNot just open to them but supports policies that will help them\nThe report recommends the G O P spent ten million dollars toward new minority outreach efforts and even more ON Technology and building it improved voter database\nAnd important piece of contacts that we need to remember is that President George W. Bush\nWas actually fairly popular among Hispanics he pulled in forty percent of the Hispanic vote in ... thousand for just a few elections before that is a huge swing and what it signaled to strategists and twenty twelve was if only they could get the messaging right\nIf only they could show Hispanics that Republican conservative policies were going to help improve their lives than you know in the future they could wear away at the sort of democratic Obama coalition that had caused them to presidential elections already\nSo once Republicans see that there are potential inroads what do they actually do to try to win Latino voters back\nSo after the twenty twelve election after this autopsy report boom boom you have you know Jeb Bush George W Bush's brother of course running for office showcasing has bicultural family\nI'm married to a Mexican American United States citizen I'm immersed in the culture I'm bilingual I feel like I'm bi cultural I'm proud of of the diversity of\nMy own family speaking Spanish and a lot of campaign stops\nLawyer yet in these bottles me who George Bush they didn't do this morning I don't know\nYou have Marco Rubio running on the strength of his support in Florida and on and the fact that he had you know tried to cooperate on a comprehensive immigration reform bill\nAnd when we talked about illegal immigration is not about demanding right it's about appealing to the passion of the nation\nSupport for an HP ours live stream comes from you our members and from the law firm of or in Reno sustained excellent since Nineteen forty six offering sound judgment and a practical approach to New England legal challenges\nFind out how or in Reno can help you online at or dash Reno dot com\nAnd so you really start to see that the Republicans are taking seriously the idea that they need to reach out to Hispanic voters really trying to meet them where they are\nRight in what could be a greater testament to the kind of cultural changes in the party and the fact that two of those candidates you just mentioned crews and Rubio are themselves which you know it goes beyond political\nPandering it's true representation to have Jeb Bush's bicultural family prominently featured on the news to have him bragging about his ability to speak Spanish fluently that sounds really positive signals of inclusive at the\nEnd of support to Hispanic voters and I really think that that can't be overstated\nAnd then came Donald Trump\nWhen Mexico sends its people they're not sending their best they're not sending you they're not sending you they're sending people that have lots of problems that they're bringing those problems with us or\nWhat we see is Trump is um and in particular Trump's controversial immigration related rhetoric slowly creep into the mainstream of the Republican Party during the campaign during that campaign button\nIn twenty Fifteen when he first announced his candidacy I think that Republicans were aghast\nHis remarks and we're trying to figure out how to marginalize him but did not imagine that he would become the nominee for their party and eventually the president you\nKnow I think I'm going to do very well either legally I see the wires that are doing well with Hispanics because I'm going to bring back jobs and they got to get jobs right now they're going to get jobs I think I'm going to do very well with Hispanics\nSo obviously we know how the election turned out in twenty sixteen how exactly did the Latino vote shake out in that election\nWell this is where there was a bit of a shock exit polls at the time showed that around thirty percent of Hispanic voters actually supported President Trump during the twenty sixteen election he actually did a little bit better than Mitt Romney did\nAt the ballot box better than running better than Romney that feels genuinely\nUnexpected [noise] you know when I saw the exit polls yeah my first instinct was surprised I thought that he would get a lot fewer voters than Romney did in twenty twelve mhm but then when I started looking at the numbers as they became available my realization was that it wasn't\nSo surprising that Republican leaning Latino showed up at the same rate that they did in previous campaigns what was surprising to me is that a record number of Latino didn't vote\nFourteen point three million Hispanic voters did not cast ballots in twenty sixteen\nDespite a race that seemed like it would very much animate Latino voters theoretically against Donald Trump\nAnd what that indicated to me than what I think it's been born out in conversations I've had across the country since then is\nThat Trump alone was not enough to motivate a lot of voters immigration policy alone was not enough to motivate some of these voters mhm what I concluded and I think what a lot of other people\nIt the Latino vote is just much more complicated much more nuance than we understood before and they care about a lot more issues than they are being spoken to about\n[noise]\n\nWe'll be right back the daily supported by ... online test prep for the A. C. T. S. A. T. G. R. E. N. G. mat that's designed to improve scores students can get video lessons practiced question an expert support one line\nPrep smart go far and enjoy the ride at ... dot com\nAnd buy T Rowe price offering a strategic investing approach that examines investment opportunities first hand institutions advisors employers added individuals' choose T Rowe price T Rowe price invest with confidence\nThe average lawmaker in New Hampshire it's sixty six years old\nThat's the oldest in the country he's also a man more often than not\nThe New Hampshire we like to say we have a citizen legislature and we do but it's a very select citizen legislature\nThis week on word of mouth who is in the state governments\nAnd who is on the outside trying to break in [noise]\nGot Saturday tired of living here on HBO or [noise]\nGood evening you're listening to the daily on New Hampshire public radio where support comes from you are sustaining numbers and from max apples on mammoth wrote in London during would you pick orchard open and focusing on the couch and apples and wagons full of pumpkin\nBoth at the market and you pick information at Mac's apples dot com and from St Joseph hospital in Nashville I'm a number of covering unhealthy specializing in breast health and experienced in partnering with limited on their health needs more\nYour best U. N. H. dot org [noise]\nGoing to be clouding up tonight with Lowes in the twenties and thirties throughout the state cloudy with rain tomorrow mixing with snow and freezing rain in the morning for the north turning Wendy in the afternoon with high in the upper thirties to low forties and for Sunday mostly cloudy with a chance of rain in the morning I Will be enough for forty below fifty [noise]\nThis is an H. P. R.", "show_name": "The Daily", "year": "2018", "city": "Keene", "day": "26"}