{"month": "10", "state": "NH", "station": "WEVN", "content": "I was a nurse I've worked in labor and delivery I've worked in the president's that stuff\nOr he was not particularly political actually I I never voted prior to the two thousand sixteen election and then Christie answers his life\nI Am a talker I like to put my opinion out there I'm not real shy 'cause I don't want to get stuck with somebody that doesn't have that same passion and driving is going to argue with me not doing it you know\nAs they start dating and their relationship grows and grows they both sort of become more political\n[noise] all of this is happening during the rise of the party the more aggressive whatever you want to call the police in just a lot to do that dominates Washington right now\nThe reaction to the Obama presidency [noise]\nAnd\nAlso a time when a lot of people are getting on to social media for the first time and are spending a lot more time on Facebook not just sharing pictures of their friends and family but they are discussing politics what was the first political posts you can remember making\nOur member often going to liberal sites and trying to comment on our pages and I would probably get banned so up well if I Want to get my voice out there I'm going to have to create my own page\nAnd ah originally it was called conservatives exposing liberalize it starts off kind of clunky my first article it was horrible\nIt was like one paragraph in our block quota the entire Fox News article he was not a professional writer I completely plagiarized he was just kind of going by feel\nYou know when you live and learn oh well we shouldn't take the whole you know saying and what does it look like at that time\nMostly it was rewriting another articles and trying to add my input to them and pretty quickly he figures out that if you just put ads on his website you know the articles I Want to share that means I Would post\nYou'll get paid for every click I'd work my twelve hour job and then come home and then try to do like two articles on my work days and then if I was off on trying to do for\nSo he decides to run an experiment he starts to wonder like can this be more than my side hobby like I took a a week's vacation to try to see how much traffic I could generate the seafood replaced my income and I was successful at doing that\nAnd he makes more in that one week then he would have made a month at his old job\nThat we were really excited thinking you know wow and he realizes he can quit and do this full time [laughter] it's kinda like a U.S\nHey honey but as it turns out the timing for starting a right wing part is news and opinion site in twenty fourteen could not have been better\nTerrorists no control large swaths of Iran second largest city\nThere's the rise of ISIS growing outrage tonight after an unarmed African American teenager was shot and killed by police and the St Louis suburb of Ferguson, Missouri there's police violence the black lives matter is the Hobby Lobby decision\nThe Supreme Court today opponents formed up on either side of America's illogical law\nThen over a period of months to page grew and grew and grew until we had like two hundred thousand followers the\nGets so good what was really shocking is when he then looks at me\nSupport for any ... live stream comes from you our listeners and from Congress regional visiting nurse association\nA home health in hospice agency serving people of all ages and more than forty one communities discover how the conquered regional DNA can help you remain independent in your home and live life to the fullest\nDid it the RV an A. dot\nOrg use them as punching bags what kinds of headlines could get people to click Brock Obama distorts the Bible again is your Facebook use funding abortions seek to make a good story sound like a bad story or have a viral story did you notice any types of stories that didn't particularly well\nYeah highly opinionated stories\nI think that a lot of people aren't really honest about what they like and what they don't like\nAnd they noticed that over and over again\nThey want to hear the the gossip the bad news\nThe most reliable way to get people to click on a story is to make them angry\nAnd Obama's been in the face if Israel Guam you how Islam takes over the world how I Would love nothing but good news all day but that's not what they want\nFamily shot at for Confederate flag and likely like division look at the movies that we watch third drama surf grilling action armed with that knowledge would like it will thrive on it especially on social media they started kind of turning up the volume on the anger in their post Muslim family arrested for keeping white couple as slaves\nEspecially on post about race and immigration and Muslim extremism black\nLives matter movement called for white genocide they took it pretty far and now it's beginning and the more they dialed up the anger the more successful day where\nWe had a month where we made more than a month and we made in the whole year with her previous employment and that was pretty awesome\n[noise] [noise]\nWe'll be right back in\n\nThe daily is supported by home advisor matching homeowners with home improvement professionals for a variety of home projects from minor repairs to a major role models homeowners can read reviews of local pros ad book appointments online at home advisor dot com\nAnd by fracture creating mattered photo decor and gifts by printing photos directly on glass a fracture is an image frame and mount all in one hand made in a carbon neutral Florida factory learn more at ... dot com slash daily\nA gift to an HP are the are they plan is a wonderful legacy to leave for those who need a trusted source for news\nHi I'm Sarah Alger director of major and planned gifts for an HBO has an HP are inspired you to learn more about your state's and your world so to wear your legacy gift inspired future generations email me\nAt ... at an H. B. R. dot org and to learn more about including an H. P. R. and your estate plans or go to an H. B. R. dot gift plans\nOrg this is New Hampshire public radio Peter below and there are a lot of ways to support an HP are\nOne of them may be in your driveway if you have a car motorcycle or boat that you just don't want any more why not donated to an age PR all donations or tax deductible and scheduling and pick up the street you can learn more at an H. P. R. dot org slash car donation\nSupport for an HP are comes from listeners like you and from our em Davis providing investment management trusts services and financial council throughout northern New England with offices in Portland in Portsmouth information at R. M. Davis dot com and from symphony New Hampshire presenting Mendelssohn to tally in symphony on Saturday November third at eight PM in Nashua\n\nMy colleague Kevin Roose has been reporting on the creators of right wing tablets site called mad world news\nSo you're into it Korean Christie were doing really well said sort of refined mad world news in to this sort of well oiled machine\nAt one point we had two couples that works for us and they were making money hand over fist I remember having a story they had was that twenty seven million views\nAnd help me understand like I don't know how much that translates to in terms of ad revenue like I don't know how much people pay per view [noise]\n\nUm do we want to put that on the record\nSo they wouldn't tell us exactly how much money they made but they did tell us that the good months on the site would be around twenty million views they told us they sometimes got paid around six dollars in ad revenue for every thousand views\nYou kind of put those numbers together you come out with about a hundred and twenty thousand dollars a month\nAnd then ladies and gentleman came there twenty sixteen election I Am officially running [noise]\nPresident of the United states [noise]\nAnd again it is very good to be in the business of anger on the Internet [noise]\nEven if I\nTo do what I call it that [noise] that\nWhen we really started to focus more on\nExpert exposes Hillary's mystery illness more politics more politics more politics Hillary Clinton delivers giant FU to America in a lot of ways the election was tailor made\nFor an organization like mad world news they kept growing all throughout the election that was crazy even though people online started accusing them of hate speech for some of their posts\nAnd we were called out and hateful and a few of them even got labeled as fake news by fact checkers like snopes that fake news so that was kind of frustrating\nThen of course Donald Trump when the election\nI've just received a call\nFrom Secretary Clinton [noise] and once", "year": "2018", "show_name": "The Daily", "city": "Keene", "day": "31"}