{"month": "10", "state": "NH", "station": "WEVN", "content": "And of the reforms that he was in ... in which had the dark side as he described it\nThe private companies to be aware involving the corruption but we shouldn't give them the benefit of the doubt that they are hard to record love because all of a mid them quote about those but it's lost survive under the new system under the law to those better system\nHe was increasingly outspoken and when he left the country and how this global platform through the Washington Post is I think his voice was increased enormously and that ... the government in Saudi Arabia [noise]\n\nSo given all that what was the initial suspicion about what had happened to ... when he disappeared last Tuesday inside the constantly\nSo the first new is that he didn't come out at the close of business at full PM [laughter] but the feeling was that he was inside and so the first thing we did was reaches fiance and his friends who are standing outside the consulate until one in the morning that night\nShe went to the ... door and said what happened they didn't come out and they said because there's no one here she than colds a friend of ... miles who's in the government because he told her I if I don't come out coolest mom and she called the\nPolice and so for the police at first it was a a you know disappeared or a missing persons the Saudis came out with this comment that\nOh he left he left you know soon after he arrived in other words you came for his meeting and he'd already left suggesting that just fiance could have missed\nHim to please the Turkish police around for it comes to it\nAnd they have the cameras and they'd already checked the cameras and they were adamant that he had no much from the consulate\nSo I think as you know in those first hours to friends were just going through every scenario but the great question was why would the Saudi consumers to detain him prevent him from leaving especially at the end of the day\n\nSo then Wednesday evening I happen to be talking to some government officials one of whom is a security official and cause I asked them about this case I'm working on it and one of the unsightly\nCasually says to me what are you might be dead and although journalists should ... there is a I I just missed it why Ali 'cause he didn't say it as it was information that he knew he was just throwing it out there as it could be you know\nSo it took a couple more days where everyone was worried about why was he on the was increasing demand to tell them about his whereabouts and it was only by the end of that week friday that we actually go Turkish officials telling us that they said he was dead\nMystery deepens tonight over the fate of Jamal ...\nIt is a ... and just driving story is friends fear the worst too soon to Ron ... says Turkish officials told him how she was killed at the consulate package that these shows have told journalists they only show with mud\nSupport for an HP our live stream comes from you our listeners and from radiation energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\n[noise]\nSo it turns out that two private jet planes\nFrom Saudi Arabia flew in the morning carrying Fifteen Saudi officials crew\nAnd they arrive at different times and they drive the Saudi considered wow\nThat same day Tim ... went in for his meeting [noise]\nAnd so we've had slowly the footage of the cars driving then reveal the number of play but more important the details of the arrival of the jet and ...\nEven more strangers that they left the same day that they brought in the Sistine Saudi Arabia and they all went to consider it fails to check into her town [noise]\nAnd they left the same [noise] so deadly we\nGot more information and it became clear that they came into teams and the Turkish officials started describing them as a hit squad they came with ... book isn't\nIn suitcases they also went to the ... more suitcases on their way and then they went into the considered\nAt some stage in the afternoon they left the country that went to the airport and flew away [noise]\nBut says more that's coming out and one of the details which particularly gory is that among the equipment the Fifteen Saudis brought in with them was a bone saw\nSo the human relation of information is pointing to the series\nPut forward by some Turkish officials that he was killed within a couple of hours just entering the considered and dismembered and taken from the consulate in suitcases do books is that were loaded into the car [noise]\n\n\n\n\nThe daily it's supported by Boston beer company brewing Samuel Adams Boston lager since Nineteen eighty four Sam adams Boston mother uses hops from Germany's those area regions Boston beer company Boston, Massachusetts promoting responsible drinking\nEnded by paying like Random House audio dedicated to producing top quality audio books Christina downstairs box the newly released novel from Fiona Davis the masterpiece\nBeen mcentire she's the spy and the trader are available Morehead try audio books dot com slash book club\nBefore the military in Congress before brown v board of education baseball set the stage for racial integration\n[noise] misplaced sports is just parcel laboratory that it's not just reflecting what's going on in society it's kind of where we were testing these ideas\nThe original testing ground was right here\nThe Nashua Dodgers on word of mouth Saturday at eleven on HBO or\nYou're listening to the daily on and H. P. R. I. Peter be yellow and Joshua Johnson of the popular news program one eight is coming to New Hampshire is going to be hosting one a here in New Hampshire next week\nAnd don't miss your chance to see him in person at the Capitol Center for the arts in Concord on Thursday October Eighteenth you can get tickets for his appearance\nNow at C. C. A. N. H. dot com support for H. P. R. comes from listeners like you and from flying monkey performance center October rocks with Johnny Lang three members of little feet John logical moody blues and jethro tells Martin bar\nBy monkey and H. dot com and from New Hampshire magazine featuring local craft brewers plus survival is to New Hampshire in spooky tales from Fritz whether it be more at an age magazine dot com [noise] this is an H. P. R. [noise]\nOoh\n\n\n[noise]\nSo how long ago all the information that you're describing since ... disappeared inside the consulate\nCame from the Turkish government a government that has long had a rivalry a complicated regional relationship with Saudi Arabia so is there any reason to be skeptical of this account being made for what happened inside the Saudi constantly\nYeah of course we should be skeptical and intelligence officials or security officials and diplomat we know are often careless with the truth\nSo we have two oldest check but one of the most compelling officers to that is where is Jamal quiz show he didn't turn up it didn't come back his feelings say this is what I think makes us think\nAt least listen to the Turkish story and now that they are releasing\nThe details of the Saudis who flew in that day and journalists are already being able to corroborate the movement of these private jets that came in and left again\nSo we're all piecing it together but the fundamental question remains is where is Jamal ... the Saudis don't have an answer to that", "show_name": "The Daily", "year": "2018", "city": "Keene", "day": "11"}