{"month": "10", "state": "NH", "station": "WEVN", "content": "That have been better get to vote and she's completely ... idea of the Democratic party and sacrifice and young president in ... years later after a long career as a nurse\nI thought you know there's no nursing legislature I think I'll I'll Try it June decided to run from Missouri house of representatives and luckily I Want [laughter]\nTo the issue she fought for education programs for the poor labor they were primarily these big democratic ideas\nShe was a main author of the major piece of legislation that forced insurance companies cover contraception that was the first in the state she basically devoted her life to democratic caucus and yet the thing about John Barry is she's also pro life\nThat's how I found myself as a person that might sound unusual today but back when she first started in politics it wasn't it wasn't unusual at all [noise]\nYou a barrier for the phone was\nDoing his phone then at the center of American politics\nIt's the middle of the country at the center of the political scale\nThe roots of unions\nThe buckle of the Bible belt\nWe always knew that the bellwether state\nVoted with the winning candidate in every single presidential elections Nineteen oh for for one\nMisery pretty centrist statesmen\nBy Harry Truman to sell them for pretty\nProminent in our politicians like Harry Truman in ...\nBut I Will execute the office of president of the United states [noise]\n[noise] the vice presidential pick for George McGovern in Nineteen Seventy two\nPhotos fade and every day juries a message to\nAccent [noise] parties John damn for only the figures represented certain type of politics Missouri style not quite blue not play reading\nIt's my pleasure and on and introduce Arkansas Governor Bill Clinton said\nShe mentioned five we built into the president I think happened to fight if Democrats [noise] it was a\nBig debate in Congress over what the anti abortion movement was calling partial birth abortion\nThe term partial birth abortion me an abortion and what's the person performing abortions\nDelivers a living meters deep for killing the fetus and completing a delivery\nCongress was in the middle of passing a ban on this procedure\nThere is only one issue at stake here today it was a huge fight that issue is that it isn't a front to of humanity and to justice to kill a kicking infant with scissors as it emerges from its mother\nHe was really making the jury Democrats squirm as one pro choice member of the house commented it undermined the credibility of the pro choice movement to be defending such an indefensible procedure\nMr Chairman I rise in support of this bill is a pro life Democrats not only concerned as we're talking about the process of birth today but this cycle of life for our nation's children\nSo that was a real moment for Democrats in Missouri had to choose and Missourians were as always dead center it's a local Democrats were asking\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granted staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nAnd it just made me think than the current reward that could not only actually\nSo this bill actually passed the house and the Senate but then President Clinton slapped down\nTherefore I have no choice but to be told a bill or be told that just a few minutes ago before I met with these families\nHe'd waited some women to speak about why I found out when I was seven months pregnant that my daughter was dying\nThe complications that she had severe health risks to carry to term he might die in utero and the resulting toxins could cause the hemorrhaging possibly a hysterectomy I found out my son had nine major anomalies one including nope right this is not about abortion and it's not about choice it's medical issue\nAnd I am so grateful for President Clinton and his ability to hear your story\n[noise] Democrats could no longer be pro life had to pick a side was impossible to be in the middle\nWe're just we're out of one of those talking points were already went up in a particular direction and the rest of your couldn't do that\nSo many Democrats particularly in the rural parts of the state which is actually most of the state started to turn Republican\nOh you're so basically that the party was fairly good ways apart and we didn't think core but we go to a crowded party\nAnd nearly two thousand blue rigs left the Democratic party and he saw his friends do the same\nThat was with throw their shirt I grew up in the corner quick like I couldn't do that anymore\nNow he's running for Missouri fifth district house seat he's the Republican nominee\nMm [noise]\nSince then Democrats have been losing their power in the state and today Missouri is no longer about whether the days of Harry Truman seemed really far away now there's not a single Democrat representing any rural district in the entire state Democrats of\nLost every single statewide office but one including the governor the last democratic Senator Claire McCaskill is a danger of losing her seat really there's hardly any democratic territory left side from a\nFew blue dots along I Seventy of highway that connects Kansas City to St Louis and everything else is read [noise] everything [noise]\n\nWe'll be right back the daily a supporter by fracture creating modern photo decor and gifts by printing photos directly one glass of fracture is an image frame andme out all in one hand made in a carbon neutral Florida factory learn more fractured me dot com slash daily\nAnd by Boston beer company brewing Samuel Adams Boston loggers since Nineteen eighty four Sam adams Boston lager uses hops from Germany's but very a region Boston beer company Boston, Massachusetts promoting responsible drinking\n\nHey there is Joshua Johnson the host of one day on any PR for bringing the show to New Hampshire and you can't wait for you to join the conversation I lead a distinguished panel of gifts to especially discussion about issues that matter to you and to the ground\nIn Concord on Thursday get your tickets right now at the C. A. N. H. dot com see their disadvantage sponsored in part by the New England employee benefits company in the community college system of New Hampshire\nSupport for an H. P. R. comes from listeners like you and from the New Hampshire women's foundation fourteenth annual women building community lunch in October twenty third in Manchester\nWith special guest Tiffany do for an age women's foundation dot org ... from New England investment in retirement group providing you touched much wealth management approach to each declines specific needs more at N. E. I. R. G. dot com [noise]\nListen to the radio on your own schedule within each pianist battery of punch cast checkout civics one on one refresher course in our democracy works roadside in an exploration of the natural world and how we use it fun to complete list of our news and information podcasts at N. H. P. R. dot org\nMm\nMm Mm Mm Mm Mm\nMm\n[noise]\n[noise] [noise]\nIt's eight o'clock in the Fox news can now project that Republican Donald Trump won't win Missouri based on ... halls and also in Mississippi\nWhen Donald Trump sweat the state in two thousand sixteen and shown in her fellow Democrats were shocked they lost everything every single statewide office it was almost like the party disappeared in the state was a total blowout\nAnd not long after their defeat Jones colleagues who ran the Democratic party they got together and just sat there staring at each other they couldn't believe how badly things had gone to hell pretty hopeless\nThey had lost touch with what people wanted they needed to do something anything\nTo hide it or we need to go and talk to people and so that's what we did one\nOf the people there was not in the middle east barks she showed in about a dozen others got in their cars and drove all over the state\nTo hear from people what they thought the misery Democratic Party should be [noise]\nQuite frankly I'm a I'm saddened by the state of affairs in Missouri and quite frankly in our nation right now if you were talking to the bottom ... rural Missouri", "show_name": "The Daily", "year": "2018", "city": "Keene", "day": "16"}