{"month": "10", "state": "NH", "station": "WEVN", "content": "Other than on line and most of what we know about him at this point\nWe know because he had this account on ...\nOn now for our defending the first series where we expose the enemies of the first amendment free expression and free thought\nIf you remember a few years ago they started to be this narrative about censorship by Silicon Valley tech companies\nI mean it Research Center released a devastating report today documenting the censorship of conservative speech by silicon valley's tolerant tech giants\nAnd especially sort of Twitter and Facebook being accused of bias against conservatives\nAnd gab sort of came out of that controversy was started by a conservative programmer in Silicon valley who was sort of set up with what he saw as excessive political correctness so he started this website\nAnd as a result of the fact that it had very few rules there were no rules against hate speech they weren't doing a ton of of censorship is pretty much anything goes\nA lot of the more prominent people who joined where people who had been kicked off of other platforms for being too extreme and all of these people\nFlocked there because gab would allow them to stay pretty much whatever they wanted their other people on gab to obviously they have something like seven hundred thousand members\nBut the most visible stuff on the site was always the kind of shocking racist anti Semitic far right content that was being shoved off of more popular platforms\nAnd what about ... hours what have you been able to learn from his postings on gab well he\nJoined the site in January and we've been able to recover some of his post they'd been taken down but we have an archive of some of them\nAnd going through them it's sort of gives you the impression that he was obsessed with anti Semitism I mean substantially all of the posts that he posted and re posted in we're about Jews were about conspiracy theories about Jews controlling the world he was critical of\nPresident Trump because he thought that President Trump was too accommodating of Jews\nSo this was powers Kevin really making use of gab as it was designed to be used as a far more lenient platform than Twitter then Facebook\nRight before this shooting we had another act of domestic terrorism which was this male bombing bomb sent through the mail to prominent Democrats and news organizations like CNN and the suspect in that case this guy from Florida Caesar say Iraq\nHe also use social media to post sort of extreme and divisive content\nBut he didn't in a different way he was using Facebook and Twitter which are kind of the big mainstream platforms and he was using them to get into fights and attack people and engage people who he disagreed with\nAnd that was sort of the appeal of that service to him was that everyone was there and you can find his enemies and communicate directly with them whereas Robert Bowers seems to have flocked to gab\nFor the opposite reason because that was where the people who agreed with similar and that was where he could find a community of people who shared his views who he could communicate openly with without sort of the watch\nGetting in the way Kevin you and I have talked about the fact that social media sites like Facebook and Twitter\nNeed to be stronger about policing this sort of speech that we're talking about but I Wonder if your concern that what we're seeing here with gab might be a consequence of that that any crackdown at all has pushed people with more extreme views\nOn to a smaller and less public and more fringe e social media sites where inevitably there's less oversight and also more people who hold equally extreme or more extreme perspective and is that a problematic outcome well\nI think one thing that we do know for sure is that when people get kicked off of Twitter and Facebook and other large social media platforms they don't just stop posting they don't go away they find some place else that will tolerate them more turn a blind died\nAnd I think we have to get comfortable with the reality that one of the trade offs of having ... our biggest and most influential social platforms be healthier and less toxic is that a lot of the worst stuff\nIs going to get pushed into these smaller more private enclaves and there might not be any way to avoid that even if it shuts down even if something else takes its place\nKevin what have you been thinking as you've been reporting on all this over the weekend because it feels like for many months we've been talking about the divisions on social media\nMostly in terms of politics what they meant in twenty sixteen what they might mean for the midterms but it feels like the events of the past week had sort of exploded that idea that the stakes are actually far higher\nWe're talking not about how this divisiveness might affect people's votes but about how it's getting into people's psyche is and is doing unbelievable\nWe'll we'll damage\nYeah I think for the last several months I've been covering\nSocial media with a focus on what affect all of this behavior happening on social media would have on one set of elections\nAnd when I'm realizing is that it's far far bigger than that because what we're really seeing is the kind of breakdown of the dividing line between\nOnline bad behavior and real world violence for awhile lots of people thought that because\nThreats or abusive language were happening on the Internet and it was somehow less real name was less threatening to receive a death threats on Twitter than it would be to receive it over the phone or in person right\nAnd I think now we know that that's just not true that often this stuff is one in the same that the threats and the conflict and the polarization that erupts online and in the media\nCan bleed over into real world violence and are doing it pretty frequently and in ways that are horrifying the consequences of all of this of this stirring up of anger and hatred and polarization I think we're going to be with us for a long time\nYou know\nUm\nBearable terrible thing what's going on\nIn our country frankly it all over the world [noise]\nSomething has to be done something has to be done [noise]\nOnce the synagogue shooting in Pittsburgh even as the death row by questions about what signals he has sent intentionally or not to extremist\nAcross the country have you ever asked him to please not use that type of language when referring to other people for the ... the case of civil discourse in this\nCountry everyone has their own style and frankly people on both sides of the aisle use strong language about our political differences\nBut those around the president including vice president Mike Pence rejected any linkage between Trump's language and the acts of isolated extreme in but\nI just don't think you can connect to the threats are acts of violence on and I don't think the American people connect to the American people believe that those who are responsible [noise] are are the people that actually conduct these threads\n\nWe'll be right back\nThe daily supported by babble at language at that teaches real life conversations in a new language like Spanish French German battles ten to Fifteen minute lessons are available in the app store or online at babble B a B B. E. L. dot\nCom ended by ... by when you shop bank stream video one line that dopamine for Twenty years after my has been dedicated to helping the world's top brand deliver faster reliable and secure digital experience to their customers on all devices I come I ate K. A. M. A. I. dot com\nOh the midterm elections are coming soon the results could influence the nation for the next decade the stakes are high end NPR and all things considered are covering national trends strongly that gun control or prevent without health care is an emotional issue it taps into people's fears\nWhich contracts with ice house immigration detainees won't just tell you who wins will tell you why it matters\nListen to all things considered to hear the bigger picture every afternoon from NPR News [noise]\nAll things considered every weekday afternoon from four to six here on an H. P. R.\nYou're listening to the daily on an H. P. R. Peter be yellow and there are lots of ways to support an H. P. R. and one of them might be parked in your driveway if you have a car motorcycle or boat as outlast state why not donated ... and H PR\nAll donations or tax deductible and scheduling a pick up his free learn more at N. H. P. R. dot org slash car donation support for an HP are\nComes from listeners like you Anne from Concord regional visiting nurse association providing a range of wellness programs on topics such as aging", "year": "2018", "show_name": "The Daily", "city": "Keene", "day": "29"}