{"month": "10", "state": "TN", "station": "WWTN", "content": "No wonder babble is the number one selling language learning half in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app\nOr tax vote job to forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for aid for aid for eight engagement rings\nFrom the genesis diamonds UPN traffic center\nIn Lebanon with picked up a racket eight forty eastbound between Central Park and I'm forty and also still working on this crash in Wilson county I forty ... Lin wood road there's two separate accidents there\nAnd she'd um county like twenty four west on after new hope roadway of Iraq in among them re county three separate accidents and twenty four west mount a woman Rudolph boulevard west of town still working on this crash forty east by me and my ...\nAnd up and good luck ville still working on this crash with the right wing lock it I sixty five stop after Vietnam veterans boulevard into Bernice Nashville Ellington parkway south down in Cleveland St ... by the actors in temporal scanner thermometer not knowing the difference between a cold in the flu can be frightening by using next in temporal scanner thermometer this Halloween you won't be tricked by any spooky symptoms\nI'm Josh we'll play traffic every ten minutes every morning on super talk Ninety nine\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in to the raise that we use when we wake up\nThat we've neglected one of the more impulsive products and daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is to overall\nHealth I worked with dentist ... ... ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quit a sensitive stomach vibrations that a gentle on your gums and built in time that pulses to guide you around your mouth all packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars with free shipping\nBacked by thousands of dentists quip is one of the first electric toothbrush is accepted by the American dented association upgrade your ... and stop brushing better with quit\nQuit start to twenty five dollars and it's guaranteed for life with a refill plan sign up now I'd get clipped dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W O\nWhich is building a better bank looked like\nIt starts with building capital one cafes warm inviting places that feel nothing like a typical bank\nWhere you can open an account with no fees are minimum in five minutes and you'll always find people ready to help you not sell you welcome the banking reimagining what's in your wallet\nFor consumers only offered by capital one and a member FDIC copies available in select locations copyright twenty Eighteen capital one\nYou'll see one our earnings growing up we are and more\nYou know if you've been caught um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a soda arena [noise]\nAt monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business with simple personalized solutions for a fair price real human being human how's that sound\nWell probably like the opposite of this marker [laughter]\nCalled eight eight eight months to to talk to someone without Louis today [laughter]\nFrom the genesis diamonds value to young traffic setter\nTraffic volume still pretty busy on Lincoln parkway leading into spring street downtown and also an eye sixty five south on at the sixty five twenty four\nWe need the north loop order on a couple of direct still in Montgomery County we have three separate accidents like twenty four west founded Wilma Rudolph boulevard\nAnd west of town and we have a crash in my forties pouring rain over in east Nashville still working on this crash of going even parkway south of Cleveland streets and in Lebanon we have a record eight forty eastbound between central pike and forty spot you buy the extradition temporal scanner thermometer ready for a bad cold and flu season knowing when it's the flu can make a big difference of knowing when to call your doctor\nThe best way to tell us that flew brings a fever so be prepared with a thermometer you can trust\nThe accident temporal scanners to mom and her back by more than Seventy clinical studies I'm Josh will clay traffic every ten minutes every morning on super jock Ninety nine seven WPN\nIf you have neck back pain spinal painting or we can just in your arms and legs you know what you may have a pension nerve caused by a slip bulging herniated spinal disks\nAnd or spinal ... now there's no magic wand that will fit your condition but there is a revolutionary spinal advancement used by my doctor Dr Kevin Mitchell over at the wellness Institute of Asheville\nNow it's called non surgical spinal decompression I've had it on my back I'm telling you did wonders for me I've talked to people after a wellness Institute of Nashville who have gone through the same procedure and they tell me about it has really changed their lives they weren't paying now they're not in pain\nThey didn't have any mobility they couldn't turn their edge now they can do those kinds of things\nUh look when I worked for you there's one way to find out go see my doctor Dr Kevin Mitchell make an appointment at six one five to four six\nFive zero zero not an amazing special your first treatment of spinal decompression and anti gravity therapeutic technology Nineteen Ninety nine that's twenty bucks you got that on you don't get a stitch called Dr Mitch search won five to four six five zero zero nine that six four and five to four six five zero zero nine\nOnline I paint upside for license to do\nIn Capital Management weather's here's your forewarn weather forecasting\nDelightful sunshiny seasonable temperatures today ... sixty four year high rent free and those clear skies stick around tonight a low a forty five enjoy for the fourth one weather center and we're all ...\nOne hundred in Bellevue has reopened where metro police say a forty five year old man was shot to death while chasing people breaking into cars in his neighborhood\nThis story and more nine on super dogmatic nine seven WGN\nWell we'll do the markets rebound after losing a lot of money in the month of October or they're trying this morning and with the market's open just to about twenty some odd minutes\nUh the Dow Jones industrial average is up two hundred and Seventeen ... up thirty five but I urge that gives up almost Ninety this Roger you buy a beacon Capital Management learn more at becomes the um dot com\nThat's it for me I Am I'm like dinner and uh that nice Michael Dell journalism [noise]\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\n... ever wonder why Europeans seem to speak so many languages maybe it's because they use babble the number one selling language learning up in Europe battles award winning technology gives you speaking right away whether you're learning Spanish French or German and best of all you'll remember what you've learned\nI always thought I was the added languages but after using apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently in your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder battle is the number one selling language learning happen Europe tried for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight\nYears in vale Nashville\nStudio we're talking about I mean I [noise]\nWith your top stories and we've got rain on the way just in time for trick or treating\nApnea will be along to tell us about it during the full forecast in\nTraffic in five minutes officials confirmed that at least one child was shot in clay county this morning about Ninety One miles north east of Nashville injured child got on a school bus to school bus driver rendered aid\nThat child and one other person according to reports have been airlifted to Nashville that clay county schools director says that school bus it pulled up on the shootings seen during a routine bus stop\nAnd that uh one of the victims came out of the home and that's when the bus driver jumped into action stay with super taught Ninety nine seven WGN for continuing coverage updates on that and this is a high school twelve miles south of Charlotte North Carolina\nI think we all have this false notion\nThat in eternal struggle that you join in progress\n\nIs solved the minute you walk down an altar if only it were that way now there are two simultaneous things that are happening this is just how I Choose to explain it\nIn heaven the work is finished it is perfect and it is complete and it's set forever your journey on earth you in the moment in this eternal timeline have just gotten\nA lifelong struggle between your sinful nature and God's nature and the nature intended you to be for eternity and they're real struggles\n\nI mean Adam was hiding in shame\nEating oh I've been there I've looked for rocks to hide on ... you're probably thinking oh Michael tell me those stories when you were younger before Kraft that's after\nChrist last decade last year couple we figure out\n... and to me\nAnd I I guess I always come back to Jesus just sitting and an alleyway you know you just throw it in the sand who knows that he was thinking oh I Can't wait to get out of this stuff [laughter] I don't care what they do it I mean I Can't wait to get out of here and here come the St Pius Jews\nReady to stone this woman you know I I told ya I'm threatened to write the book Sims or like farts everyone else's are so always offensive hours not only are they not offensive sometimes we kind of enjoy this now\nSo here's a bunch of people filled with Sen filled with sinful nature but they don't have this and that she had or they didn't get caught with her at the time with this and she adds they're ready to stoner Jesus looking at all these losers\nAnd it it seems so profound ... when you think of it from price perspective are you kidding me they all deserve to be stoned none of them had any worth\nNone of them had any victory over send whatsoever if they're going to stone this one for her son\nAnd an perfect wording well he's perfect totally God I got a deal for you you without sin you throw the first stone and\nOf course the two lessons which I Hope you're I'd have to take anything for granted anymore but I Would hope you're pastors have taught you they all drop their stones and left\nThere was not among them without sin none\nAnd the only one who didn't ... didn't throw it and you could have and he simply said go and sin no more\n\nWho are we that we have created this atmosphere\n\nThat when you're a sinner oh love your testimony tell us more tell us more but God Forbid you have a testimony after\nYou accept Christ the savior then we turned our back on you then there is no grace there is no mercy I've got news for you\nAll of my real sends me big sins the kind that would make a preschool you need to talk to somebody higher up all happened after I was saved\n\nWhen did we create this economy that people have to come to Christ and then be perfect the rest of their life or will discard them it will all while we're busy setting different since maybe\n\nBut that isn't even the lesson the lesson really is with rust half\nHe's living the same battle we're all living but he's got to do it in front of all on an altar in a Christian to be even further shamed and further rejected and further sift it by the enemy I might add\n\nBut where you should find the most encouragement today\nIs not in seeing judgmental Christians for what they are handy work then for the devil\nIs that while rushed task for decades struggling a bloody fight\nWith sinful nature his God was perfect his message was perfect his gift was perfect\nAnd thank God uses all of us in spite of ourselves sets the encouraging message\nEnough of the ... um but you know I think we can't get enough of these kinds of reminders and so having said that uh we're very excited that I'm Ross is going to be on the show today\nTo talk to us about it I still believe the documentary I have a list of the of the theaters I'll share with you later\nOn um I Know mine is one of them um and Franklin\nBut we'll go over where you can see this all the information you could possibly need\nAs that uh fathom events and um I Would have been posted it just in case people don't\nKnow I'll put it on my Facebook wall that's how I always say my Facebook wall and Dan always says the dam and his Facebook page and Mandy show face but well I just don't feel any to keep saying my name but obviously it's Michael Dell journal WGN and don't try to friend me in front of the doubt\nAnd don't blame me for that either that's a Facebook thing although I guess I could do a public one my problem is I just want to work that hard yeah one is plenty I had to list the theaters now of course now that I'm here\nAnyway um I\nAlways say that the making of a messenger is as important as the message itself or we're gonna spend a full hours rush tap on the on the painful making of this messenger and I think you're going to find a lot you can relate to a and in spite of all that six Grammys Eighteen devil wars and still one of the most incredible male vote vocals\nI've ever heard in my life or it's going to be an honor to have or us in Studio for an hour and ending an honor for really three hours to Ken in Studio from time to time when he's not working on some ... [noise] um\nI Would like to address this for my own sake um\nI have nothing to do with Tennessee volunteer football nothing\nWasn't born here I was raised here I went to LSU I mean I have nothing to do with your woes\nFor some reason people like to blame me every time they lose as if I'm the athletic director is if I'm the head coach is if I'm In charge of recruitment I have nothing to do\nWith how bad you are so Cory goes great all I said friday was oh South Carolina you you could maybe one this one\nThat was certainly you could maybe when this one is particularly when which is dusting thing them and doing that [laughter] so I get the nastiest taxed\nFrom Korea the yard boy really nasty\nBlaming me and I'm like I Can't help your team stinks [laughter] [noise] but then the more we dusted it out he finally in frustration goes I Know I'm Sorry brother\nIs just we haven't had a good team ... tooth has since two thousand and six and that's what I Want to wait a minute when did I moved here [laughter] am I really thought they had that one this weekend [noise] but now\nThey're engaged and then the John victory and stole defeat South Carolina twenty seven twenty four I Charlotte\nCharlotte his next week certainly devolve can be Charlotte right [laughter]\nSandra belt they must have had a heck of a second half forty five thirty one over Arkansas they have Missouri ... that would be a tough one next week a middle Tennessee fifty one Seventeen over Old Dominion yes that's supposed to happen a\nTemp temp or several western Kentucky\nYou know what my dream is yes some they have that football team took the field barefoot [noise] I mean I think they ... should come out they ought to have like like cut off genes yet with pads under him barefoot\nNo overall overall good you play an overall yeah you could hear him not have tempers from Kentucky would not be funny if they were the only college football team to play barefoot and all the band plays or federal Austin P. forty one ten over tendency tax there now I think foreign for even did a five hundred in your gums eastern Kentucky who\nAre next week predators last five to three to the ... ... uh they play again tonight against the Golden Knights of philosophy rules\nGood and um how do we say it you have the audio Joe Buck we do this every year I don't get it they don't\nGive us any Jill by ... are you serious yeah so I get I get as this Red Sox a radio announcer Google job blocked\n\nFinal play World Series Red Sox when it was a very very disappointing call if we can't find it out I'll just give it to you know the well it's kind of like can I tell you a quick story\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nInformation few public opinion driven these these bills numerous and talk leader super taught Ninety nine\nAnd we are with your time stories got the full forecast standard traffic update in two minutes TB I sending agents from Nashville to clay county not Ninety One miles north east of Nashville where reports say a school bus driver pulled off to a shooting scene this morning\nA child who was shot actually got on the bus driver render day and reports say that child and another person of been airlifted to Nashville and authorities are searching for a white man who was last seen wearing camouflage there in the area of the shooting scene which is that a home\nThere in clay county there was a shooting under investigation south of Charlotte North Carolina at a high school this is the message students parents receive\nMore going on down one on one morning and then the harm that's\nButler high school about twelve miles south of Charlotte metro police hoping someone's home security camera captured evidence that it will lead to the arrest of a fatal shooting that posed a portion of highway one hundred in Bellevue overnight\nThey say forty five year old ... health and Stein was shot and killed and his vehicle while chasing people Esau breaking into cars outside of his home on metal rigid circle please ask anyone in the trade side subdivision who's vehicle was tampered with or may have home security cameras to call them\nAnd he likes to twenty Eighteen South Carolina US Senator Lindsey Graham campaigning for Marsha Blackburn yesterday said the migrant camera ban and Brett Kavanaugh's confirmation protests have backfired on the left\nThere is a division and the Democratic party this real\nThis has been a nightmare for red state Democrats that is\nThe latest news ... by usa elders and I have breaking news\nOkay Hillary Clinton is in the news yeah and it is official all signs are pointing to Hillary running for president twenty twenty really er during a friday evening to win a\nShe was asked um we're going to talk about twenty twenty in a minute do you want to run again said Kara Swisher [noise] know responding\nCoy lead triggering groans you know they did a number you can buy\nNew [noise]\nWell I um I like to be president that everybody lives look I think hopefully when we have a Democrat in the oval office in January of Twenty one there's going to be so much work to get done but here's the key a friend of\nMine on Facebook had a very close friend that was in Buffalo and bumped into Bill Clinton\nAnd it's funny because he was wearing a Trump make America great again [laughter] but you know you got a president as a president yeah I you know I say that but I've I've had past presidents and I didn't bother to walk up I mean that\nI Would walk right by I don't I don't know I don't know if Jimmy Carter was in the next room was your goes ... what he was after all the president or the United states yes um but I mean I had my favorite presidents and then I have presidents that I just I'd walk right by I just\nYou know yeah uh but this guy want to you know Bill Clinton will take a picture with it was president ... ... judging by the guys' age everybody has that first president a\nRonald Reagan was mine you know when you're usually it's you know from your teen years mhm it's her first real president especially if it's a two term or suffer this guy Bill Clinton was like a signature president I mean I remember I kind of remember Lyndon Johnson to be honest with you I definitely remember Richard Nixon\nAnd uh and Gerry Ford and Jimmy Carter but Ronald Reagan was the first president I actually loved\nBut anyway um so the guy you know probably genuine take a picture with him was mocking them including was a great sport did matter what happened was on and who knows what was said but the funny\nPart what they do the selfie picture there's Clint with a big smile here's this guy was a big smile to make America great had 'em\nAnd if you look closely at Bill Clinton's shirt and this was just taken Saturday there's the Hillary for president pin on his ... on his chest now I guess it's likely that the president has a wash that shirt since the campaign run\n[laughter] but I doubt it he's grabbed it on the way I think it is the proof and it'd be\nPerfect ... Clinton style right for Hillary to act like she's being drawn to run in a sea of candidates or to come to the rescue so I Would like to make the announcement right now and again you know I I Am very very spoiled and all of my flaws\nWhen I pray for things they happen and I have been ... Juan Hillary again bag I begged her to run again I pray for her to run again and based on Bill Clinton's lapel pin I think it's coming on ... [noise]\nCold compress boys for cubes\nCan't hold her fainting any longer I Can't hold [laughter] yeah right about that before I wake up and spit it right there beside [noise]\n[laughter] oh this footage had to be\nOn this twenty nine so what is what the price point in time for Halloween [noise]\n[laughter]\n\nYou son Chris [laughter]\nAll right to do away with Iraq [laughter]\nNever [laughter]\nI don't just put the bucket backwards\nRemember this time I lost consciousness choking yes that was a scary time yeah that was all just saying\nMark my words at nine thirty seven on this October twenty nine twenty Eighteen I'm announcing Hillary Clinton's running for president twenty\nEighteen and knowing that party and know how they rig things I bet she gets a WTO Newsday nine thirty seven this new news was brought to you by usa a wife and\nYou'll see one or earnings growing up we are and more\nYou know if you've done\nI'm squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a sold out arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees and address those needs with the right solutions\nNo more no less just smart people getting to know your business was simple personalized solutions for fair price real human being human how's that sound well probably like the opposite of this marker [laughter]\nCall eight eight eight months to to talk to someone without Louis today San Antonio Texas\n... Capital Management weather's here's your forewarn weather forecast [noise]\nAbsolutely beautiful that started after we we have the sunshine we have temperatures right where they should be today mid to upper sixties for your high tonight it plans to take you out and about highly recommend it\nMainly their size in temperatures dropping down into the middle forties this is where we should be for the time here today very similar just warmer with high in the upper seven and a four one weather center and we're all just that it off\n[laughter] but it's just like I have no plans today Daphne or are you offering [laughter]\n... you're a\nWho went in to fame in ... yeah\n[laughter] [noise] a\nHighly recommend getting out and about oh I have a van a mole he ever go to John events have a robot watch a little bit of the football game [laughter]\n[noise] [noise] [noise]\nIt's fifty right now is not China the buffet buffet and ... fifty to the north of hunters and build downtown on music grow the statues are naked IM clone does forty nine degrees\n[noise] started go can talk really as my doctor I'm One of the best doctors I have a chiropractors I've been to in my lifetime and probably the best that diagnosis and when you think about it everything really begins with a diagnosis do you think that's an obvious statement right but it's not most people in pain don't do anything oh\nMaybe it'll go away or maybe it's getting worse\n\nIt could be any number of things usual culprits bulging herniated disc pinched nerve spinal ... knows what I have to generate to generate have just as easy for me to say\n[noise] pain stinks is\nIf it let's just sleep through the night it's waiting for you in the morning\nAnd Rob's with us from doing the things that we love everything begins with a diagnosis now my doctors treated twenty five thousand patients twenty seven years not just me and he is your best chance at a no pill no surgery solution but start with your diagnosis called seven nine four zero eight hundred\nFor thirty nine dollars is a new patient that's going to cover your extensive exam any and all X rays you're accurate diagnosis and your first treatment of choice because you have choices regenerative therapies have been breakthrough spinal decompression therapy of which he was a pioneer in Tennessee a breakthrough we get separation without a scalpel\nThe\nMaxine Waters charges find them in restaurants taught them are so this notion that what the president does at rallies is inciting this stuff is nonsense if anybody's inciting it it's a biased mainstream and cable media network for the left or its\nCandidates\nBut this is nothing what does this have to do with well if it is Trump\nYou have a fake Trump supporter I mean nobody's buying that van nobody's buying those stickers nope nobody's buying this lifelong liberal suddenly registers Republican and twenty six team\nIs the right trying to hurt innocent people especially when he sent bombs that couldn't detonate all the people who have never opened them\nAll the talking about now if he was trying to send a message some of them don't seem very fresh he was on to something with about it\nBut if that's true well then you've got fake crazy Trump zero people harmed you know one hating Trump not an eleven death in the synagogue\nI Do think the more I studied this individual and I'll see if I'm wrong about that my top top cat the inner city or in a moment we're going to visit with like or do some more from pre claiming justice to the nation's um this is anti Semitism is a guy with a deep seated hatred for all Jewish people and certainly for his real\nAnd are probably a president because he stands by Israel and moved to the embassy but we'll delve into that story the day is somebody tried to pull the shooting down since at a McDonald's in Alabama and a ran into a citizen whether they carry permit who took him out he's dead no one else is that's the moral of that story\nGabby enters my top top of the latest on the shooting at the synagogue in Pittsburgh what other takeaways what was the motive or do we go from here\nAnd what the teachable moments when we come back on super chalk Ninety nine seven double duty and ah I wouldn't support Winkler because that was blindly trust in huge of a mutual fund company in my case it was fidelity what does that mean\nIt means I was putting large portions of money and they can be as good right prioritizing saving Fifteen Percent towards retirement oh I was doing it max and got my four oh one K. but then I go on line and I would guess\nWell I think I'll retire and twenty thirty so all my money was going into fidelity twenty thirty plant is blind trust and guessing\nI sat down with Paul Winkle research showing me the same companies and all the different phones I wasn't even diversified\nThat he showed me the results I got the percentage return I got versus what the market provided for the same period of time\nAnd it was broke and I was going to be broke now he fixed it for free\nBut then he wouldn't let me blindly trust him either and that's what the mentoring and the education began and the real result\nBegan to take shape\nToday I'm as good at getting money to work for me is I Am going to work and earning money and you have to be I Know what I'm doing why I'm doing it what to expect to all the hidden fees all the market driven forces the role of Social Security how to do so security smart\nYou will to become the confident educated investor the you tomorrow need you to be today we have ten offices in one phone number eight five one Nineteen fifty for Paul Winkler rank eight five one Nineteen fifty you'll find that number and great teachable material online and Paul Winkler dot com [noise]\nAnd the next day a man to show the investigation continues into the\nDemos during the later today Trump effect on super talking and I think\nYou'll see one earnings growing up we earn more [noise]\nYou know if you've been caught um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a soda arena [noise]\nAt monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the knows we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to say you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business was simple personalized solutions for a fair price real humans\nBeing humid how's that sound will probably like the opposite of a smoker [noise]\nCalled eight eight eight months to to talk to someone without Louis today\nShow this weekend and county actually an extra two thirty\nNine to five Saturday and Sunday\nSo don't you dare miss [noise]\n[noise] it's official genesis diamonds was just voted by the people that music city that best jewelry store and the best\nPlace to buy to gauge meant ring not once twice five times but ten times in a row ten straight years again and again genesis wins in both contests best jewelry store and best place to buy an engagement ring\nFrom all of us the genesis we say a heartfelt thank you with nearly fifty thousand customers were humbled by just resigning confident but even after ten years of being voted number one we're still growing and feel we can be even better and that's why we always guarantee the best prices versus any other news stories and the strongest guarantees any industry our mission is to\nAlways say kind of the box to make your Jewish shopping experience even better to continue to amaze you on every level of constantly giving back to this amazing city of Nashville, Tennessee\nAnd engagement rings\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\n... ever wonder why Europeans seem to speak so many languages maybe it's because they use babble the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French or German and basketball you'll remember what you've learned\nI always thought I was the added languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently in your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning out in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language like Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for eight for aid for eight\nLately it seems like everything we use every day is getting an upgrade on the bed we sleep in to the raise that we use when we wake up but we've neglected one of the more impulsive products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is to overall health I worked with a dentist to ... ... ... toothbrush that makes brushing most simple affordable\nAnd surprisingly enjoyable quip has sensitive stomach vibrations that a gentle on your gums and built in time of the pulse who's the guy do around your mouth all packed into a beautifully slim and dies out of the medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for\nThree shipping backed by thousands of dentists quip is one of the first electric toothbrush has accepted by the American dented association upgrade your cat\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first repeal packed free at G. E. T. Q. U. I. P. dot com slash W W out what\nYou want to running so a squeaking way toward marker\nIt's going off his newest at monster we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price\nBecause that's really sounds like the opposite of this marker\n... eighty they must have talked to someone without noise today\nHenderson bail Nashville\nStudio where dogs I mean I [noise]\nTen o'clock I'm Ken we are with your top stories drivers heads up got some debris blocking the lap lanes of forty ease founded just south west of downtown this'll be a mile marker two oh five\nMichael Jordan show super talk Ninety nine [noise]\nI was saying I have a nice weekend\nWell what can you say um [noise]\nIf if you saw would [noise]\nFake terrorism looks like [noise]\nIn the Trump bomber\nYou solve real terrorism with real\nLooks like what real violence looks like in a synagogue in Pittsburgh suspect Robert ... hours forty six open fire on the\nTree of life congregation synagogue around ten am on Saturday\nThe suspect killed carpets on the main level who gathered to observe the Sabbath and went downstairs and in the basement a second congregation was gathered he started shooting and then put the third floor of the time I go to the third floor he was met by two police officers who were wounded and to swat officers he was eventually injured and surrendered to the police\nAnd I'm now faces a\nCapital punishment powers posted on social network gab\nIs where we learn the most about um what you find as a blind hatred for two things Jews in Israel and the president of the United states ... years is joining us our top drop from daily roll call dot com Twenty years in law enforcement of New York came to Tennessee to retire early to get her toughest cases\nAnd uh she presides over daily roll call dot com and joins us every Monday Ari what do we know about this forty six year I'm just calling the shooter\nForty eight year old shooter yeah\nWell the other than what you just said that we know that he live fairly close to the synagogue about twenty five minutes away we have him as being a truck delivery driver for a bakery I'm people said that he just kept to himself he was very quiet and not really any criminal a record that we can locate\nA he had one traffic infraction back in twenty Fifteen at some civil in ... years ago\nUm that when you talk about gab and what's interesting is he was known as one dingo\nAnd before his um\nSocial media count was taken down which we're finding they they immediately go to Facebook and Twitter uh luckily this one remained up for a little bit but what's interesting is his account page\nUh his banner was an image of a ballistic chronic Graff\nUh which is used for measuring the velocity of bullets leaving barrels um he also had several pictures of handguns he called him and his ... family uh so he really did appreciate his guns\nAnd then what was interesting too is he blames the caravan on the Jews and he talked about a group called the Hebrew immigrant aid society highest\nAnd this was the last thing two hours before he went to the Senate God\nHe said quote highest likes to bring invaders in that kill our people I Can't sit by and watch my people get slaughtered\nScrew your optics ongoing in somebody reported that to law enforcement and then they knew that somewhere a there was going to be a problem so there are you telling very anti Semitic um but what's interesting is the media spinning him as a white supremacist\nAnd he basically um you know referred they refer to him as a nationalist [laughter] you know when President Trump just called himself an adult you either there or is it well you know\nI'm ... I'm I'm trying to say if you know the lesson number one is that whether it's this particular shooter or whether it's terrorists\nUm the dilemma we have what was the jihad is terrorists are we don't know a good Muslim a peace loving um how would I say most act really mecca acknowledging Mohammed and\nA from a mutt named a trilogy of text Koran or deeds\nAnd life of Mohammed she hottest\nWe don't know the difference between a peace loving Muslim and one that seeks to kill you until they act and that's too late\nSame thing can be said for the shooter right as a delivery truck driver he certainly left ... certainly hate Jews certainly hates Israel but and everything but a traffic ticket and then suddenly snapped the care of it I mean the Caribbean and you'd be stretching you'd be Glenn Beck at the chalk board\nBut if you were I mean yeah I could probably find some umbrella funding from George Soros but primarily Catholic charities and other immigrant organizations and then probably what you would find most accurately or communist elements of Honduras doing this on purpose\nSo uh you know but again we can't expect a madman to get his current events right\n\n[laughter] you know and I mean he just there were so many things wrong with this gap which is gab says there are they believe in freedom of speech they don't censor so a lot of people are switching to that but of course they're labeling it the alt right you know Nazi type I ah people that are going to this\nA social media but another thing that he had to say I mean as he got was a daily ...\n... is going to say we've got to delay on the sky but let me just before you get to the poster took a couple of days ago\nOne of the things we have is this crackdown now I think if you look at who they fund and their ideology and how they treat people that don't share their world view at Facebook dust they're quitting major executives there is no question that these tech social media companies are very left leaning\nSo they want to stop all this kind of insightful hate speech\nThey tend to be much more strict to the right than to the left that's a whole other separate subject\nBut the real reality is they want to censor all this stuff thinking that's going to keep people from getting hurt\nThe problem is what it's actually going to do is make it harder to keep people from getting hurt because you're going to have gas for the alt right who knows what you're going to have the all these are all going to merge because these other sites are failing and by the way the censorship along with time is going to be the depth of Facebook and Twitter young people simply aren't using them\nUm but as a law enforcement officer because I can tell you the radio host we get a knot goes on a shooting spree I go straight to their Facebook wall eye of the whole story\nLong before the first news conference and they're not gonna tell you for six news conferences this is going to get more and more difficult so is this all gets fragmented out to the gab does the word so I said one of the key storylines here is going to be the emergence of gab and other new umbrella social media places because of what Twitter and Facebook are trying to do to help\n\nOh absolutely and and it's amazing because when you find something like gab and you continue down rabbit holes you end up finding\nReally really a crazy type site social media sites that people are allowed to have a ... and to post on and and it's just it's it's unbelievable but then you start looking you look at some of the sites on like\nOff of gab but some some other crazy sites and they link back to Facebook pages and one of them that was very interesting with something called F the police\nSo and and there is a current Facebook page about them um so it's really kind of you know I Would imagine it's very difficult a law enforcement has their hands full trying to figure out which sites or you know very disturbing and there certainly are hundreds of them out there which just lead you down rabbit hole so\nGab is cooperating uh they say with law enforcement they have been taken down a which you know a lot of people are looking at that is you know censorship censorship because they took them down after this guy's postings the majority of things that are put Saddam gab are weird but I wouldn't call them necessarily dangerous\nOr it's just different and and so they you know they like to label things immediately on because it appears that there's a lot of pro right I'm even some pro All right things on gab um but you know they've been taken down for the time being so is is censorship you know a lot of people are saying it is\nUm but one of the things that I thought was interesting was a couple of days ago he posted a daily reminder that quote diversity means chasing down the last white person\nSo he really he really had a problem with a lot of different things he didn't like moslem see certainly didn't like Jews\nUm but he blames you know he blamed Trump for a lot of these things he said that Trump didn't or ... Trump liked the Jews too much for him so that therefore he wasn't a Trump supporter but just kinda all over the spectrum I'm I I Would say certainly a person that had some issues\nI'm very antisocial and I I think over the coming days obviously we'll learn more about him but this gives a really good picture um you know with this new\nWay to look at things so that was a really find anything I under one thing do\nWhat was it was one dingo\nOne thing that was his name that he is on social media a he had an email he had a Web page or\nIs there anything down I was thinking about Russian is there is significant other things\nOkay you know it it it didn't\nGo it alone you know dog out and you know federal type dog so maybe that's what he considered himself a certainly antisocial I'm so that could have ... what you know why he said one dingo\nAre getting into joining us our top cop viscerally as aggravating by the way I'd rather be on the phone but I digress but sue quid pro quo if we can even with the delay number one why did he do this to me the motive is clear a he's probably mentally unstable and he certainly has a hatred for Jews\nAnd Israel that seems to be the primary motive of what I see you\nAre absolutely and upon entering into the synagogue when he started shooting he did say all Jews or will die and again he reinforced that statement when swat up put 'em down and arrested him he just was saying that he believed that all Jewish die so certainly a hatred for Jews\nWhy would you shop anywhere else highest quality best selection on match service in the same guaranteed lowest pricing and the heart of coal springs down the strange part of town and\nIf you go to our website hardwood bargains dot com keep typing Ford or backwards flash Mike M. I. K. E. and then we got a ten percent off coupons just for you my listeners now you're ten percent below the guaranteed lowest price sick so shopper I shop change change that home forever\nHardwood bargains and cool spring seaboard lane Mallory station wrote on minded hardwood began dot com\nInformation view\nOpinion driven these these bills news and talk leader super talk Ninety nine [noise]\nAnd then we are with your stories full\nForecast coming up in two minutes and reports say one of the people shot this morning on that school bus round in clay county has died\nHe be I sending agents from Nashville to investigate this about Ninety One miles north east of Nashville bloody start to the day a button or high school just twelve miles south of Charlotte North Carolina where Dr Clayton Wilcox is the superintendent\nWere incredibly sad and by the fact that we had a loss of life on one of our campuses today a what makes it double a difficult it is it was one of our students who was the shooter\nBack here in Nashville metro police hoping someone's home security camera has evidence leading to an arrest and the shooting death of forty five year old Eric helping Stein he diagnosed vehicle after getting shot while chasing the police all breaking into cars outside his home on metal rigid circle\nAnother bomb threat in the mail authorities say one was intercepted at the post office in Atlanta address to CNN offices in Atlanta Evan ... says this comes three days after the arrest of Cesar ... Florida for bailing out fourteen bomb threats to Democrats than others last\nWeek we were told by law enforcement that there might still be additional packages out there which is why this one is being treated with a abundance of caution that it is but at this point again there are still investigating the term in what the nature of this is a whether or not this is related to it\nSay our cats a court appearance scheduled today the man accused of killing eleven worshippers at the tree of life synagogue in Pittsburgh on Saturday Robert Bowers goes before a judge today here ... it could\nBe a very short of parents with extremely important\nBecause it is a constitutional nature that charges wealthy read he will be asked if he understands the charges he has he represented and then the case will do on from there\nThat is the latest news it is brought to you by lows weather is next hind can Weaver W\nAccurate mortgage wants to know that being frightened of goblins or goals makes a lot more sense than being scared of the home loan process no matter if you're a first\nTime homebuyer or wondering if that cash out revise right for you when we say we'll walk you through the loan process from start to close that includes being available to you and nice weekend and spooky holidays too so why wait apply today at accurate MPG dot com accurate mortgage group\nAnd division of a ... El Al ... is an equal housing lender and in the last number four six six four tells us all\nOf a median Capital Management weather here's your forewarn weather forecasts [noise]\nAbsolutely beautiful to start off the we we have the sunshine we have temperatures right where they should be today mid to upper sixties for your high tonight if plans take you out and about highly recommend it mainly players died in temperatures dropping down into the middle for\nYou this is what we should be for the town here today very similar just warmer with high in the upper seventies\nAnd the warm weather center\nAt Cornell Cornell we focus on representing men and domestic relations cases attorney CPA joke or do we recognize that our clients are going through perhaps the toughest time they will ever go through we understand that everything that's important to them is on the table\nTheir assets the rolling their children's lives that sentimental responsibility that our clients and trust us with\nAnd we take that very seriously we've been trained to do that we've helped thousands of clients before and it's our hope that you will choose to and trust us with what's most important to you\nThe attorney said Cordell in Cordell worked at home and maximize their role in their children's lives contact the domestic political action from of Cordell in court held to schedule an appointment with one of our firms Nashville area attorney so partner men can count on\nSix one five four or five seven eighty seven hundred on line at Cornell Cornell dot com that's Cornell Cornell dot com officers in Nashville Franklin Murfreesboro and ... core telling Cordell eight ten Christian Center Dr swayed one sixty Franklin, Tennessee three seven zero six seven\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nOr anything so I'm squeaking way toward marker\nAssuming office newest at most or we can't stop that noise but we can call it all the noise around finding the right talent the noise of reps from job sites with one size fits all products you don't need in the unqualified kid is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they must have talked to someone without noise today\nToday right to make like please not acted dry ever wonder why Europeans seem to speak so many languages maybe it's because they used battle the number one\nSelling language learning up in Europe battles award winning technology gives you speaking right away whether you're learning Spanish French were German and best of all you remember what you've learned\nI always thought I was the added languages but after using apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently new new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning up in Europe trying for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax vote job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for aid for aid for eight\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in to the raise that we use when we wake up but we've neglected one of the more impulsive products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health I was sentenced to ... toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums\nAnd a built in time and the pulse who's the guy do around your mouth old packed into a beautifully slim and dies I leave him design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three\nShipping knocked my thousands of dentists quip is one of the ... century toothbrushes accepted by the American dented association upgrade your ... and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life where the regional plan sign up now I'd get quip dot com slash W W O and you'll receive your first rebuilt pack free with a quip electric toothbrush that to her first refill pack free at G. E. T. H. O. U. I. P. dot com slash W W out one\nThing I Am I gonna do journal I Am a patient as well as a spokesperson for P. A. I. medical in Brentwood I sat down with Michael ramps us PA I met this is who does all the stars when it comes to her loss\nAnd I originally sat down thinking of old technology old results now if surgery is necessary we have to find a search is with the latest technology and results the only artist robotic transplant procedure in the entire region\nWhere the best and that's why we do the stars we have many many non surgical solutions and after I sat down for my free consultation with Michael Ramsey he didn't recommend surgery recommend a laser therapy regeneration sleeping hair follicles at the molecular level they thicken up grow out FDA approved non surgical relaxing and it works\nP. R. P. is huge nutrient rich plasma extracted from your blood and concentrated reintroduced to the scalp I've seen amazing results with the RPG a woman who was nearly bald and now has to cut up here\nNow what's best for you surgery non surgery I don't know you need to sit down with Michael Ramsey for yourself and find your surgical non surgical results were the stars find to be a medical in Brentwood with affordable payment plans for everyday people like you and me\nWe've been doing this for twenty five years in Nashville we don't get into liposuction or hormone therapy all we do his hair and we're the best so what are you seeing what are your curious about worse what are you self conscious about\nFind your results with the stars find it ... ... a medical and Brent would call three seven six sixty ten and set up your no obligation absolutely free consultation with Michael Ramsey three seven six sixty tent or on line and we grow hair dot com\n[noise] information driven super John Ninety nine seven double duty and I am Michael Dell drawn half legendary Christian\nSex fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar cheer on line MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\n... please not take the dry ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gives you speaking right away whether you're learning Spanish French or German and best of all you remember what you've learned\nI always thought I was saddened languages but after using the apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently new new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning up in Europe trying for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or text book job\nTo forty eight forty eight forty eight text book cab to forty eight forty eight forty eight to try battled for free that the O. C. A. B. to for aid for aid for eight\nYou on are running so I'm squeaking way toward mockery\nAssuming office newest at most or we can't stop that noise but we can call it all the news or on finding the right talent the noise of reps from job sites with one size fits all products you don't need and the unqualified Ken is filling up your inbox monsters just smart people getting to know your business and giving you a simple personalized solutions for a fair price how's that sound\nReally sounds like the opposite of this marker\n... eighty they'd most are to talk to someone without noise today\nOn the ... [noise]\nOne of the people shot on the school bus around north east of Nashville has died will not date you on this another top stories at eleven on super ... nine seven WGN\nIn town for the next hour but first of all things Elvis with\nTom Brown I'm not allowed to bring up on the air how I listen to serious 'cause I'm a boat to Tom is all things Graceland and is the host of\nGay to Graceland and is the co producer of Nashville Elvis festival which is in Franklin every year and we're excited announce Elvis for the holidays Christmas with the king a tribute to Elvis it'll be Saturday December eat the seven PM\nAt the Nashville palace hosted by Tom Brown who's joining us in Studio good morning you know everybody always probably plays blue blue Christmas had to be as most played\nChristmas all yeah barely a baby was my favorite one of their songs will be future you know\nThat's just one of the reasons we wanted to come up with a with a concert of life is a show like this is just so many songs in Elvis's catalog 'cause it never gets played contests and festivals\nThat's all the Christmas music right and so it really the greatest hits you know Santa bring my baby back to me which ah is there is a great rock and song white Christmas which Elvis a recorded and that uh you know Bing Crosby are uh when it came out just lambasted that that was you know he was recording white Christmas the way he did with you know sexual connotation\nAnd so just a lot of great Christmas songs like that blue Christmas of course especially merry Christmas baby that blue song that he recorded about four o'clock in the morning and RCA studio being not far from here and\nNorbert putting them in the bass player was falling asleep and in the middle of a song you're Elvis say wake up but [laughter] and uh Norbert says now you know he gave when you get named checked by Elvis your your your value goes through the roof so I don't think\nYou could say about Elvis valued family he valued home he valued his relationship with God or do flawed evaluated and I'm In love gospel music Christmas was a special time of Graceland and it's hard to bring that back to life and the most difficult part is of course\nWho sings a song the I can do ... I mean I you know who wants to be all of us a wish of a world champion that's going to be one of the people\nYeah Cody Dana ... a a world champion for images of king he's also a competed in the uh the triple a festival the the the natural festival\nAnd he's just a great performer he loves people um he's from Florida not far away from where they shot follow that dream so he's got this natural Elvis love and his family all these guys uh that especially that come to the national festival that we choose and all the champions to go to Memphis these are guys who three or four years old style of us and the change their life and they're\nThey're not impersonators you know it's a it's a term that's always used kind of an diversion of Elvis and and to me the impersonators the fat guy at the office party at Christmas you know dressing up like all of us are at Halloween\nWell actually there is a fat Elvis used to be at the Barbary Coast in Las Vegas I don't know where he sings now I I Know you're talking about the uh ... hey yeah he is the ... the best I have ever seen he's ah he's now at Harrah's is he at Harry's that heritage is you're out in Las Vegas and in fact I went back stage of my dad he sits in his chair with all these ads on yeah\nI'm vocally the most accurate of accurate I have ever found out all agree my that my dad and I had a theory and I do believe Elvis has gone but if Elvis is not dead I'm telling you that Sam [laughter]\nTelling vocally you might be yeah yeah yeah it is unbelievable yeah but there is a difference\nBetween an impersonator at a party and people that\nCan yeah and this and you know also too with the ESPN which is the band that Graceland uses a competition the band that we use it the natural festival and the band that will have on December ... the national palace for Christmas with the cane\nSo there's that interplay that happens with the audience and and what so amazing to me because a lot of times I get to like Charlie Hodge I get to be on stage and and put the scarves around\nThere was a you know then there's the host what are you out to be you'll be telling the story telling stories\nAnd and talking about Elvis and talking about these songs and kind of really setting the mood and uh and being on stage with Cody though I look out and I see the audience made up of of men and women of all ages and they are all sixteen years old when they're when they're in a show like this they get to go back\nAnd I always talk about that if you never got to see Elvis for a few seconds at a show every now and then you you just get that feeling that this is what it was like and if you did get to see Elvis you get that feeling again that you had when you saw a lot of fun and especially the Christmas show it's for the for the whole family I mean it was really an ... I mean\nHe made a great date night uh Saturday December eight seven o'clock number ... probably by phone or if you're back in town yes or to the event but you all of that it's Saturday December eight seven o'clock at the national palace for all the tickets and information go to Christmas with the king dot com but you have a special offer for our listeners\nBecause we're such fantasies of yours in from the very beginning you have been the biggest\nA space of your ... your festivals nothing without me and my two ideas a year and I got you a week ... Martin live sitting in that chair right there were a sport coat today\nA as a what an what an event by special offer for your for your listeners are when you go on the website Christmas with the king use the code all caps super talk and\nThey will get five dollars off of every chicken fights our listeners because of what they've done or a super talk is a code\nThat is for me I'll be on there are I think this can be an awesome night uh it is Christmas with the king a tribute to Elvis we've got the best band the best music and the best host and we will see you all at the national palace get your tickets at Christmas with the king dot com and don't forget in all caps\nA super talk in a promo code for five dollars off and I will see you on the eighth probably talk to you before then you've got to appreciate marriage Christmas to you know he met\nAll rides a staffer the full hour in Studio it's an amazing autobiographical documentary and it's called I still believe had he does and we'll talk about his amazing Journey Through life next\nLately it seems like everything we use every day is getting an upgrade from the bed we sleep in the raise that we use when we wake up but we've neglected one of the more important products in the daily routine\nThat old worn out toothbrush I'm Simon and ... and I'm a product designer after I learned how important brushing your teeth is overall health I worked with dentist to ... that sort of a toothbrush and makes brushing most simple affordable\nAnd surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums\nAnd a built in time at pulse as the guy do around your mouth old packed into a beautifully slim and dies out of the many um design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three\nShipping backed by thousands of dentists quip is one of the first electric toothbrush it's accepted by the American dented association upgrade your cat and stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill bland sign up now I'd get quip dot com slash W W O and you'll receive your first revealed pack free with a quip electric toothbrush that's your first refill pack three at G. E. T. Q. U. I. P. dot com slash W W out what\nYou know shopping for gun should be a pleasant experience no one wants to deal with gun store commandos or someone who's got experience is based on playing video games and their mother's basement thankfully there is Nashville goodnight where you'll find friendly\nKnowledgeable people that will help a bind she asked what you're looking for whether you're looking for guns knives animal or give you won't have to worry about Mr commando prepping for the common ...\nBy trade in Nashville night or shop in Nashville and nine dot com\nDid you know those are more airtight this creates more indoor air pollution carpal\nGases chemicals allergens and other pollutants build up and get trapped inside reaching unsafe levels the EPA now ranks indoor air pollution as a top by the environmental danger let precision air test your air to identify the pollutants in your health and offer affordable solutions to clean up your air festival precision airs celebrating twenty five years surveyed middle Tennessee\nCapture that re rage and beat that with your fist or anything you could grab in order to get justice was taught\nAnd quite frankly affirmed\nAnd then I walked in an altered Thirteen Years old and I accept Jesus Christ as my lord and savior because it was finished at the cross because it's about him and not me because an eternity and in heaven and Christ\nEverything is perfect as it's going to be in an instant when I see him but the journey and the battle and clawing through our sinful\nNature to become what happened in an instant in heaven on earth is lifelong and sometimes we never get victory I'd been smoking forty one years I might carry that weakness all the way to the cross now\nCan you receive from me\nAnd I and I learned to instantly instantly\nOh my gosh all this stuff I saw growing up and send me an F on dealt with I'm trapped you know what I learned that stuff's Ross Ross guess that's where I learned that where's that\nI was Eighteen years old I had a scholarship to Louisiana State university I was certain to be a professional baseball player\nAnd in that rage and in that moment I took my psychology teacher in front of my entire school as Mr Bible boy right and I beat the living crap out of here and I got ... six eighty at the time is law headed for all state headed for Louisiana State university and I barely graduated and I never played baseball again\nBut that in my car weeping in shape I heard this song\nAnd that's when I learned about the past and the walls and the only way to break them down it takes a lifetime of these were\nDo all of a good movie\nReligion during Christmas artist for us to have joining us for the full hours studio his autobiographical a documentary I still believe opens in theaters or in Nashville will be at the regal Hollywood twenty seven Rico green hills regal Opry meals where I'm going to be the AMC thoroughbred\nTwenty and Franklin AMC and Murfreesboro\nYour stories the same as all of our story a\nSame story as Adam writing Adam where are you same stories the prodigal\nSon uh where was the father halfway up the road to meet him absolutely do you think this is the toughest question but it's going to ask you do you think you could have wrote those songs without your childhood oh lord\nNo no you know uh but\nThrough ... most of my career I'm I've written honestly and um\nI remember back during the late eighties when PTO and everybody was singing you're blessed you're blessed you're blessed you are blessed I was crying out for help because I was dying and uh I remember songs like a\nYou know down in the lowlands and I still believe in those things and I remember when we got that record it was right after metals I'm\nA\nI'm tourists and do you want to be dishonest because you're going to be singled out if you're not going you know we're blessed we are blessed we are blessed you know and I'm I'm getting kicked out of me and I don't know if I'm going to survive a but it started this long search of\nOf a meat tearing down that\nWall and they're still a ways to go and all I Know we all are dealing with some in but the the the the tragedy would be if we just stopped\nWhere we are in a live that way\nBecause you do realize that first verse ... and ... says eighty seven and eight\nA eighty one ... ... ... I think it came at we wrote that in a eighty or eighty one\nAnd it was on my first so\nI Know it was because it was yeah Wallace Walter glass yes what I was listening to um I could read those lyrics to you and there's nothing in this documentary that you didn't get you knew that your whole life you just that that first verse of that song was my life to don't get me wrong but not sure that your life\nIf I just you know what I'm Talking about this Mr are the minute you accepted Christ it's perfect in heaven but ain't perfect on our oh no and the journey continues and I'm fifty four and it hasn't ended in your well I'm sixty four it at a\nUm what is it about you know one of the takeaways I have I'm going to say the negative things that you don't have to\nI don't know why we do this if you were Whitney Houston re route and for you right shouldn't matter what you did oh that's my sister all she's got to get but because you represent Christ because you're in gospel music to Christian dumb has this feeling like we're all perfect what did show grow a mess\nI mean these same people that you know you were a shameful Lynn and worried about do you drink and they're all at home watching porn or cheating on their why ah why do we do that why are we so rough on our own\nI think a lot of times ah and I saw it as a kid with with my dad you know Senegal preacher and then uh it would be in there for like seven eight months in disappear for a month or three weeks and just drink himself into a blessing oblivion day after day after day but\nI Know for me I watch uh folks just turned on daddy you know and there were times that he was needing help real bad but the judge them and threw him out\nAnd he was the guy that you know a visited them in the hospital and uh you know a minister did them for for a you know periods\nOf ... scary prophetic view of your own life that was going to be absolute as he had a church of what twenty five eight small you're about to have a church millions yep disciples now that are in the highest places on earth\nThey're leading because of your eyesight bullshit I mean God's work through you know you weren't perfect no was perfect you know he was perfect and he used your gift\nAnd to me that's the whole story of the gospel area you know anytime we start lock exalted ourselves look at me look at me look at me a\n... you know and it takes a ... of the center of our lives and that is him that has helped us in his walking with this daily and helping us to deal with our defects and uh\nBut I I Love what you just said about you know I've been smoking for forty one years we can't hide from each other no I don't and I say and great\nHow does your guys in ... you know I I Do it if nothing else to disarm everyone absolutely but we all should be doing the absolute ... why don't we all put on our masks right we all play the game on Sunday and were all freaking mess\nBut if we came and we knew that our brothers would be the first person we should be able to tell our sister she'll be the first big and then we would overcome these things together and said we all keep our secrets and we're growing a no way and by the way we've ceased being light and we cease being salt in the world is suffering right along the body of Christ is certainly not ready for what abs absolutely\nAnd we we uh uh\nWhen we began to isolate and I I Know for me I I you know growing up such shame and this negative messages of the uh constantly me and my brothers is if you're not worth ... us and not worth the cells that goes on your bread and you'll never not anything\nAnd when I left home at seven G A that was dad's parting gift to me is that you'll never make it you'll never amount to anything and\nYou know he drove off and it's like thinks that but those negative messages that I grew up with constantly\nYour dad had to be aware of what he didn't die until the no ... no ... but he was he what was his reaction to your stardom he was jealous yeah\n... you know we had to be the center of attention always he was ... says uh but he preached to kinda gospel that nobody could live up to uh\nSince the opening of our doors NCAA has never increased our prices at NCA we can divert your existing system or install a new one and you still get local or monitoring and top customer service for great price and see it also has no long term contracts just month to month call us today at six one five\nSeven seven seven seven NCA that six one five seven seven seven seven six two two or go to our website at NCA dot C. C.\nYou don't have to live with anxiety Raquel center has the solutions are biblical counseling process for both a clear path from anxiety to piece listen to this testimony\nI came to Iraq caffeine or because of overwhelming anxiety I received a freedom for ... that I desperately needed plus so much more accounting at rock ... piece in every area of my life and enabled me to become the woman God created me to be I'm Janet and I now work at rock singer I Will be the first person you talk to you when you call\nFreedom from anxiety as readily available through the biblical counseling process at Rock Center I'm John Murphy founder Rocco center where we hear testimony is like Janet everyday let us take you from anxiety the peace\nLearn more at Rock Center dot com you don't just have amazing client testimonies we also measure our effectiveness and publish our results on the rock center website results matter because you need to know that our process can work for you take the first step down the proven pass away from anxiety to peace visit rock house center dot com\nInformation few opinion that these these bills numerous and talk leader super taught Ninety nine [noise]\nI'm Ken we are with your top stories full forecast in two minutes and reports say one person is now in custody\nRelated to that shooting on a school bus route north east of Nashville and clay county three people were shot according to reports two of those people airlifted to hospitals in Nashville TV Eyes preparing to give a news conference any moment now say was to protect Mennonite seven WGN for continuing coverage on air and online\nOr download an app for live streaming one person's dead after a shooting a bus or high school south of Charlotte North Carolina here's police captain state's entire el\nThe shooter was taken into custody of Matthew apartments and his family as aware as well\nYeah the shooting reported to be student on student Dan still no arrest after a deadly shooting in Bellevue this morning metro police say forty five year old Eric helping Stein was found inside his car after running off highway one hundred never ends worth high school authorities say helping Stein was shot while chasing people he caught breaking into cars outside his home\nNashville will pasta remember the lives lost in the Pittsburgh synagogue attack on Saturday the Jewish community holding a vigil tonight at the temple congregation on Harding pike is open to everyone starts at six PM meanwhile Robert Ballard is the man accused in that attack in Pittsburgh goes before a judge today Jean 'cause our as reports he faces several charges\nThey're also firearm charges for having a firearm using a firearm and his charging that fire on those are enhanced think charges that lead to more penalties and finally [noise]\nThis is the death penalty case if it is designated by the attorney general if murder can be proven\nActual killing using malice for thought\nThese are say aka the bomb threat suspect it gives the mailing fourteen suspicious packages to prominent Democrats and others last week goes before a judge today he may be blamed for fifteenth package one that has been intercepted in Atlanta address to CNN studios there this morning as the latest news ... by lows whether next time can we ever WFSU Sri\nLankan Capital Management weather's here's your forewarn weather forecast\nDelightful sunshine in season of temperatures today get outside enjoy he can be in the upper sixty four year high tonight clear skies around a low forty five\nMuch the same on Tuesday just a little bit warmer back to the upper seventies we get through Wednesday a decent chance for showers and storms timing could be better because it is Halloween for the warm weather center meteorologists on\nCurrently at eleven thirty four we have sunshine they could statues on music row in fifty nine ... degrees that's super jock Ninety nine seven double duty and I'm like a journal for being an automotive why do you still drive around and see so many cars and trucks on the road regardless if it's Buick GMC Toyota sign up for like a dodge price of jeep brand new or anything we sold certified\nFree owned and we have the largest right in the state why because nothing has changed in Nineteen forty five dead relies more vehicles around the law the better it was for customers selection\nBut then the more profound realization was wait a minute the more I sell a month or less I have to make each sale well\nThat's the definition of volume sales great first selection and even greater for your savings that still true today and it's still the secret to our success\nNobody else has twenty four million dollars of new car inventory are the largest selection of certified ... or whatever you're looking for its somewhere on our laws you won't find it more affordable anywhere else and you won't be treated like family any better anywhere else whether you buy newer pre owns you could be mature twenty four hour roadside assistance\n... and the car run out of gas were on the way\nWe have an award winning service department of parts empire that we've amassed over the generations for do it yourself or ... and are no risk brio and guarantee look around\nThe reason you see so many beam and cars and trucks on the road today is the same as it's always been you see so many because you save so much sprawled out downtown on Broadway off Broadway in extending the borough at the beginning barrier search right online anytime it ... off\nToday right to make like please not talk to Dr ever wonder why Europeans seem to speak so many languages maybe it's because they use battle the number one selling language learning up in Europe battles award winning technology gets you speaking right away whether you're learning Spanish French for German and basketball you'll remember what you've learned\nI always thought I was the added languages but after using apple I can tell you I was just taught the wrong way\nUsing battles ten to Fifteen minute lessons you can be speaking confidently your new language within weeks\nI was amazed that I could start having real nice conversation right away because it's so fast now I'm speaking Spanish\nNo wonder babble is the number one selling language learning gap in Europe to try it for yourself and see my battle is the quick way to get conversational in a new language my Spanish French were more you can try battle for free download the app or tax vote cab\nTo forty eight forty eight forty eight tax vote cab to forty eight forty eight forty eight to try battle for free that the O. C. A. B. to for eight for aid for eight\nYou'll see one our earnings growing up we are and more\nYou know if you've been caught um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who capture Penn like she's doing a drum solo at a soda arena [noise]\nAt monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated\nThe reps from job sites trying to sell you one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise we work with you to really understand your needs and address those needs with the right solutions no more\nNo less just smart people getting to know your business with simple personalized solutions for a fair price real humans being humid how's that sound\nWill probably like the opposite of the smoker [noise]\nCalled eight eight eight months to to talk to someone without Louis today\nLately it seems like everything we use every day is getting an upgrade when the bed we sleep in the race we use when we wake up that we've neglected one of the more poultry products in the daily routine that old worn out toothbrush I'm Simon and other and I'm a product designer after I learned how important brushing your teeth is to overall health\nI was at the dentist to ... toothbrush and makes brushing most simple affordable and surprisingly enjoyable quip sensitive suddenly vibrations that a gentle on your gums\nAnd a built in time and the pulse who's the guy do around your mouth\nAll packed into a beautifully slim and dies Eli medium design we also to live a fresh brush heads on a dentist recommended schedule just five dollars for three\nShipping our attention to the section an clip the time magazine distinction of one of the best intentions of the upgrade your cat\nAnd stop brushing better with quit\nQuit start to just twenty five dollars and it's guaranteed for life with a refill planned sign up now I'd get quip dot com slash W W O and you'll receive your first refill pack free with a quip electric toothbrush that's your first refill pack free at G. E. T. Q. U. I. P. dot com slash W W outlived\nIts official genesis diamonds with just voted by the people that music city is the best jewelry store and the best\nPlace to buy to gauge measuring not once twice five times but ten times in a row ten straight years again and again genesis wins in both contests best jewelry store and best place to buy an engagement ring\nFrom all of us the genesis we say a heartfelt thank you with nearly fifty thousand customers were humbled and on and this was the only voter confidence even after ten years of being voted number one we're still growing and\nFeeling we can be even better and that's why we always guarantee the best prices versus any other news story and the strongest guarantees any industry our mission is to always think as of August to make your jewelry shopping experience even better than to continue to amaze you on every level constantly getting back to this amazing city of Nashville, Tennessee\nAnd engagement rings\nBackers Russia tapping studio the documentary I still believe premieres throughout theaters in the Nashville area tomorrow night here's one of my favorites crisis of", "year": "2018", "show_name": "Michael DelGiorno", "city": "Hendersonville", "day": "29"}