{"month": "10", "state": "NH", "station": "WEVN", "content": "W E v J Jackson Ninety nine point five\nW ... called brook maybe point three and W. E. V. cute little him like the one point nine\nAnd on line at H. P. R. dot org\nFrom New Hampshire Public radio I'm Laura ... and this is the exchange\nThe former planet Pluto gets a promotion uh businessmen invites artists on his upcoming moon voyage and the search for water in our solar system extends to Jupiter these and other headlines hit the world of astronomy this fall and we'll cover them this hour also will observe an anniversary some of you might remember\nOn October fourth Nineteen fifty seven the Soviet Union launched its Sputnik satellites\nAnd a face competition that continues to this day the exchange this guy who joined us this hour and we love your questions and comments\nAre email exchange it and HBO ... again exchange at any PR dot org respond on Facebook or Twitter\nAt an HBO exchange or call in one eight hundred eight nine to six or seven seven one eight hundred\nNine to ... and H PR\nAnd our guests are now Cameron's former astronomy and space educator at the college shepherd discovery center and Malika ... degree you're also with us John gene forty cofounder\nOf the Astronomical Society of northern New England and astronomy instructor for granted state college an UNH and John welcome back thanks for being here my pleasure Laura and also with us Nicole Gucci assistant professor of physics and astronomy at San some college\nAnd know up to ... to get to see you so to start with you how do you explain to your students this button Nick anniversary on this day and I think they do seven\nWhat a big deal this was to younger people appreciate how jaw dropping this was that's a great question um and it's it's a little hard for me since I grew up being a giant space geek um so I was always into this\nThat you know the space shuttle had always been around a in my memory and people have been living and working in space for my entire life\nI'm so it's it's interesting for us to step back and think of a time when there were no satellites there was nothing up their people didn't even imagine a you know what would it be like to have something up there can they see us uh you know I'd I Know it's it's like a lot of um a lot of fears around that\nUm but the thing that they were exploring a whole new territory uh is is really fascinating and all the things that we take for granted that rely on satellites just didn't exist Clinton exist today I'm sure\nThose satellites help us do I want to think about how many they got the whole hour but let's play a little CBS News clip from that day October fourth Nineteen sixty seven as I said the Soviet Union celebrated its ... Nick launch and uh the U. S. wondered what it should do in response and we'll talk about that but first let's just hear a little bit from CBS [noise]\nBut some would never even heard of a\nSudden it becomes much a part of part of your country lawyer for the word of your book [noise]\nIt's a record for miles farther from the radio signal transmitted by the Soviet [noise] the first amendment like the New Yorkers are\nA whole new frontier Mao camera I mean it gives you a sense kind of what Nicole said this was a very big deal you remember about this now were you into space science even way back then\nWell back in those days I was in high school and uh I remember hearing how hard it sounded very odd to me that you could actually do that put something up and have a go around the earth and I remember trying to go out and find and I don't think I ever saw it\nBut I'm just knowing it was there was\nKind of wonder is but also kind of spooky because you weren't quite sure what this meant\nMore they spying on us yeah right I mean the Cold War era so\nYou know exactly and of course you extrapolate from that and say well if they can do that with a rocket where else can they point they rocket\nAnd all that and so we wondered what what sport nuke actually meant we thought it meant something like look out here I come back for a while our here I Am looking at you or whatever all it did was just send out that would be to say I'm here\nBut uh I found out that Sputnik word actually means fellow traveler only hey I didn't know that yeah and that's because a A R remember reading about uh one of our ambassadors to Russia one time so that uh Nikita Khrushchev refused to color his ...\nWho knows what it meant\nWell and you will you hear this sort of gravity and that announcers voice you know a whole new era for for mankind and so forth and John what do you think is important for people to consider 'em on this day whether they actually remember it or not\nWell there's there's quite a few people that remember it I I was alive but I don't remember it because I was too young but it means it it is literally the beginning of a new era and and it it it's a it was a place we had never been before a lot of people weren't sure could be done\nAnd it did create a lot of a lot of fear and it it did motivate people in the administration in our country to kind of get off the couch and say hey we the space stuff we better be started taking it seriously\nAnd it really began a new era for the United states and it's a science program ah took to eventually forge its way into space so it it it it really was the beginning of a new era in in the world was never the same after that event in fifty seven what's so interesting because\nMeteor showers in August I was out of my back deck trying to catch a couple of meteor showers and you see these satellites you know all the time but back then and it wasn't that long ago that as mouth that this was a big big deal I'm lead to right John the creation of NASA or Nineteen fifty seven Sputnik goes up\nAnd Nineteen fifty eight correct me if I'm wrong the U.S says okay we got to get into this game and let's create NASA and\nThat kind of a fever pitch right because they were worried about it and I should point out though that splitting it was a very small satellite\nSo when you looked up you didn't see the satellite it was only a little bit bigger than maybe twice the size of a basketball [noise] so what you saw what people actually saw was the booster rocket that was much bigger and that reflected enough like back to see you didn't actually see the satellite itself\nYou saw the rocket that made it possible for it to enter into orbit above the earth so it was a little bit you know when when you saw this little faint light moving across the sky that wasn't the satellite but it was the vehicle that got the satellite there gotcha so\nAnd I just want to let everybody know that John has his NASA tie on today and we're going put pictures as we always do arrest guy grew on Instagram so check 'em out but I always wear space themed gear when they come in it's an age PR exchange you can join us now with your questions and comments especially if you remember this\nSputnik anniversary although now I feel like I should say split Nick but [laughter] set that aside for now our number one eight hundred eight nine to fix for seven seven send us an email exchange it N. H. P. R. dot org\nWe're going to cover a lot of topics from the world of astronomy today on the exchange and we'd love your reflections on any of them but right now we're talking about this\nButton again ever surgery so you can give us a call one eight hundred eight nine to six or seven seven so as an asset you know gets into gear sixty years ago it's celebrating its sixtieth anniversary um this year because of this\nYou know some people will say folks that it hasn't been worth it in terms of human sacrifices people have died um and we know that too well here in New Hampshire\nAnd also that it's been very expensive um and Nicole to first I think but I Want to hear from everybody how you feel when people say sixty years if not worth it\nYeah so there's a lot of ways that it's been financially where the\nUm the technologies that have come from the space program that wouldn't have been developed any other way and this this is for the space program and this goes for a lot of\nBasic science to um we can't even calculate the uh we can't easily calculate the economic benefits um but beyond the economic benefits um there's something\nPrimal for us about sending humans into space\nUm and this this comes up in the debate between you know a robotic space probes and humans and you know human missions um robotic space probes which we'll talk about what do a lot of the amazing things but sending people into space even to low earth orbit\nUm is something that sparks people's imagination\nA and sparks people's desire to in many cases enter into a feat us a science field there was you know a huge growth in the sciences at sciences scientists and engineers um thanks to the Apollo program\nI'm just making that so visible so many people wanted to join a scientific\nEfforts so you're saying investing in NASA in space exploration spawns more interest in science in general and we're always being told that we don't have enough you know them graduates and so forth in this country science technology engineering and math Jon I Know you think about this a lot and we've dealt with this question\n... you could go down all it's almost like you have a list of things from New Zealand in Australia in front of you are living in John versus lore exactly\nSo many things to choose but of course what you're really choosing as an HBO you love the program so you're supporting it and then you get entered to win this great trap it's a huge prize we want you to be entered so call now one eight eight eight eight zero five six four seven seven it's veteran might or lord of the rings or something like that you can also go to an HBO or data or\nThat was right the the the drawing for this of Australia New Zealand trips to triple the lifetime would be an awesome and also in cherry on the top of your Sunday this week\nBut you also any gift you make would go right to the kind of programming a local reporting that you rely on for an age PR that really distinguishes and H. P. R.\nI'm from so many other media offerings out there the exchange as I said is a great example of it is hosted by lurk annoy for over two decades now is the state's only live locally produced statewide call in talk show or it's increasingly rare on the dial\nA but it it's that kind of programming but it's something that you obviously rely on if you're listening now you tune in five days a week and get caught up in what is interesting and important and crucial to your life here in New Hampshire\nBottom line is new hit the exchange is important to you while you're listening but now you can uh can support it you can help pay for it take a stand right now support the show becomes sustain her online at an H. P.\nR. dot org and it's possible that you've never contributed to an HP are before which is totally understandable that's where everybody starts you know you listen you start to listen more and more at some point you think\nGosh you know I hear these pledge drives I guess they're talking to me um if you haven't thought about this before I Want to I Want to tell you your gift really matters because at its heart and each ... grass roots organization we do get somebody from the federal government and you will hear the names of businesses that support an HBO or you hear them as ...\nSupport for an HBO ... live stream comes from you our listeners and from community minded Fenton family dealerships serving keen swans and all of Chester county giving back to the community for over Thirty years ... dealerships\nDot com so much more powerful when you all come together because this is the single biggest source of income here at an age PR so please do make that first time gift right now at an H. P. R. dot org\nAnd we're we've got lots of ways to say thank you during this phone drove thank you for your support one really cool way I think is if you become a sustain or at the twenty dollar a month level or if you increase your current ... sustaining gift to twenty dollars a month\nWe love to think you would the yearlong New York times digital subscription\nAs well as the initial pure T shirt so let's start with this New York times subscription\nIf you listen and he's gr chancellor you you love a good reporting a valuable reporting insightful reporting that's what you get through this New York times digital subscription and you can check it out on your smartphone or tablet while wearing this and he's pure a T shirt it's brand new it's got a nice soft\nFabric lovely design and it'll tell the world that you love and H. P. R. you can pick that up twenty dollars a month thinking all the things you probably spend twenty dollars a month on 'em this would be a great addition to it you can make that give now at an age PR dot\nOrg and don't forget when you do you're going to be entered to win a trip for two to either New Zealand or Australia it's up to you\nOr includes roundtrip airfare from Boston and a combination for eight nights that sounds amazing but you've got to be entered to win an HBO data work to make your gift or one eight eight eight eight zero five six four seven seven and things [noise]\nAt nine twenty three you're listening to New Hampshire public radio good morning support for an HP are comes from you our listeners and from the palace theatre in Manchester presenting ... backed by popular demand on his house has a restaurant or friday October twelve\nTickets at ... dot org and some tests health freedom plan and northeast delta dental a partnership created for better or all an overall health right here in New Hampshire learned more at pizza toes dot com\nAnd from New Hampshire magazine featuring local craft brewers plus survivalists New Hampshire and spooky tales from fits whether it be more at an age magazine dot com\nAnd the forecast and mix them crowds and sun today a chance of afternoon showers temperatures in the sixties and seventies tomorrow any signs that they were ties in the mid sixties\nThis says listen I supported and H. P. R. and\nThis is the exchange I'm Laura ... this hour it's the latest from the world of astronomy member covering a lot of topics including renewed debate over we admitting Pluto into the planetary club we've also talked about the anniversary of Sputnik launched on this day in Nineteen fifty seven\nAnd a little bit later we'll talk about it on mosques space X company announcing its booked its first private passenger for a trip to the moon I shouldn't really say to the moon they're going to go look at the moon actually not going to have boots on the ground there we will find out more we'd love to hear from you to the exchange numbers one eight hundred\nEight nine to fix for seven seven send us an email exchange it an H. P. R. dot org again exchange and H. P. R. dot org\nI'm number one eight hundred eight nine to six four seven seven so as these headlines of come out about you know should Pluto the planet again shouldn't it and this is a debate that's gone back and forth for twelve years there's another possible planet in Pluto's neighborhood Nicole this one called\nThe goblet now what a great nickname first of all who's the goblin and how far away is he or she spooky time this is a discovery of aids\nThat wouldn't fit the traditional planet definition it's twenty Fifteen T. G. three eighty seven and T E G I think is what gave them the GOP lend a being that it was I think ah discovered in October\nActually over funny Fifteen um there is a dwarf planet with an extreme orbits so it's kind of ... extremely elliptical orbit comes close in to the rest of the solar system the ... and then goes far far out\nThis was discovered on the way towards looking for an actual planets out there which has tentatively been called planet nine yeah the planet nine yeah photo was demoted twelve years ago yeah so so it might be at night I'm so they're still searching for it and this involves some of the astronomers that ah\nAh have brought some of the evidence forward thinking that hey maybe this exists thanks to so weird or bits of these objects are out in the solar system that indicate hey there may be uh something ten times the mass of earth out there\nSo while looking for a planet which they haven't seen 'em they did see this a dwarf planets which we are calling the goblet and um and\nI Love it when NASA gives queen nickname see a lot more interesting than the usual name which is like you know\nMU sixty nine KB oh you know whatever it\nIs to mail on on this idea that the ... I Hope I'm pronouncing it right um these objects that have been found out there ... Pluto promoting series how do you explain this sort of busy place called the Kuiper belt to you know kids who might come by that the Christa McAuliffe center aren't\n[noise] aren't related to the best way to think about it in my mind is to think of the asteroid belt\nSlower than raising close soon a which is a bunch of rocks that are orbiting I'm In the area between Mars and Jupiter\nAh if you take that concept of by the way that there's not a lot of rocks there it's not like when you hear in Star Wars\nOr you see them flying in and out of all you're doing is saying\nI'm for that one no one there are two objects that have been visited recently the two largest objects um or one called ... and of course series which I'm Nicole mentioned earlier is the one that was discovered in Eighteen or one or one it was discovered is that oh we found a new planets\nThis isn't the asteroids that was pretty close to our solar neighborhood\nLater they discovered all these other objects there and said no no no it's just part of the asteroid belt if you carry that concept out beyond Neptune\nThere are a bunch of objects out there we are discovering more and more of them and that's an area that was predicted to be filled with stuff that was was\nUm actually\nCalled the ... belt because it's named after a loser Gerard ... ... it's K. U. R. P. E. R. I've heard it pronounced a hyper and I've heard it pronounced ... to ... take your pick because otherwise you can't get around the room to tell us who otherwise\nBut ah yeah and that's the same idea and Pluto\nWe now looked at as a a under current definition as being a dwarf planet it's round and it is in orbit around the sun\nAnd who it was discovered in Nineteen thirty and we said okay this is a nice planted and back then we didn't have the technology to really realize how big or small or an object was if we just moving out there\nAnd I'm the more we got the technology over the years the smaller this object became and so maybe it isn't a planet well are they also discovered some other objects out there to a ... belt they feel is the same idea except the uh\nAre much bigger and most of them can be round\nBut um that's where the ... comes from South beyond the orbit of Neptune\nAnd again put a got demoted because they couldn't you know sweep its neighborhoods clear it's neighborhood what about some of the other objects out there I'm John Will turn to you you know um there's other objects now that are drawing attention out in the ... did they get planetary status\nI think that's such a huge thing at twenty five to sort of make that turn to be like hey I've been listening now for so long it's time to give so if that sounds like you or if you've been giving for years and maybe it's time to think about increasing your contribution I\nReally encourage you to do that right now at an H. P. R. dot org [noise]\nHey there I'm Mark hosted the exchange I talk a lot from my job asking\nQuestions pushing for answers but more importantly I'm listening just like you together we listen to people who've fallen to share their experiences we listen to experts who help unpack complicated issue\nGas from all walks of life will help us understand why these stories matter to them to their communities and when we listen we listen deeply\nThat means hearing more than just a statement someone is making its about hearing themes contest and a broader perspective\nEvery time you listen to public radio you learn and you feel to feel compassion and a connection to other people and places\nThat's time well spent so please do you can just ... listening and learning here in New Hampshire\nBecome an N. H. P. R. sustain her today\nPork ah Laura ... is truly one of the uh I consider a treasure here in New Hampshire she's been on the air\nFor so long doing her job at the peak I'm up in the newsroom ice it just right next to the the producer and hurt her team of producers that put on the exchange every day and it's true they take such attention in putting together a show that's interesting that's newsworthy\nThat as probing questions that matter to your life and they've been responsible probably if you're a regular listener with so many important\nMoments in your uh just in your in your life or think about all the all the other intriguing interviews you've heard on MORNING edition or all things considered\nI'm Crazy audio stories like you rely on that you hear on radio lab\nA all those kinds of moments have hooked you as a public radio listener and I was your turn to give back to support that kind of\nListening that that enriches your life and informs you you can become a member at a a level um whatever level works for you um you can become a regular sustaining lister by giving at five or ten dollars a month but do you report go on line become a member support an edge PR at our website and H. P. R. dot org\nCases argue wake up every morning listening to an HP are maybe listening to the exchange having a cup of coffee will just think you give a Fifteen dollars a month you can sit and have that cup of coffee out of his brand new\nVery handsome and H. B. R. muggy that I'm holding in my hands right now this thing you know sometimes we talk about how much it holds and I I don't really think about at fourteen ounces this is too often shy of applying this is a big coffee mugs this is the kind of money that you need\nOn a Wednesday or Thursday morning when you're feeling a little sleepy and waking up to the news Fifteen dollars a month this can be yours like I said it's a very handsome so check it out at an H. P. R. dot org you can also give at one eight eight eight\nEight zero five six four seven seven\nYou need another reason other than a new model to become a sustain or think about all the great local reporting that you really on every day uh here at any gr whether it's coming out of state house are coming out of the small towns\nThat really make New Hampshire special and each PR is they're covering the news wherever it's happening in this state supported now become a member at an H. P. R. dot org and thank you [noise]\nAt nine forty three you're listening to New Hampshire public radio support for an HP are comes from you our listeners and from Massachusetts General hospital using research to develop treatments for complex conditions all the help their patients get back to their lives Mass General revolutionizing care\nAnd from the law firm of journalism providing legal counsel to the county city and town officials and administrators who make level of government work on line at the W. M. law dot com\nAnd from the Hopkins Center for the arts welcoming distinct virtual ... chamber orchestra program celebrating composers that fought for unity amongst conflict October night hop dot dot net dot edu [noise]\nIn the forecast the Knicks have clouds and send today let the chance of afternoon showers temperatures will be in the sixties and seventies dishes listener supported and H. P. R. [noise]\n\nIs the exchange on N. H. P. R. I'm nor can only today it's the latest from the world of astronomy including as we are discussing developments in private spaceflight also look at NASA's plans for a moon orbiting station to support further missions\nAnd a little bit later we'll catch up on the search for solar system water extending to Jupiter which is a place\nI never imagined would have water but we'll find out more and of course you can join us with your questions and comments one eight hundred eight nine to six four seven seven send us an email exchange at an H. P. R. dot org and up John gene forty so when we talk about private entrepreneur um you know ...\nCall them the attention always goes to eat on mosque and space acts and he is doing a lot but just days also Amazon fame and fortune is also interested in space I just learned about this recently um how long has Mr base has been interested in going to space ... according to him and and I'm\nNot an expert in space entrepreneur is\nAnd I'm not that interested in about how they made their billions which both have done [noise] but but I I've done a little bit of reading about a Jeff Bezos and he has always been um since childhood interested in space and he his\nGoal has always been a personal goal of his has always been to help get people into space now see I didn't know that I thought the way that the you know a lot of media spinning his interest is he's just trying to compete with the lawn but you're saying it goes back ... maybe\nI mean it's obviously an ego contest to a certain extent right when\nBut but but and and I don't know him personally neither one of them but from what I've read 'em ... is interested in space I Do worry about entrepreneurs ... interest in space because they often conflict\nWith scientific pursuits\nAnd and I worry about safety and things of that nature but but I I Would say that at least these individuals and it's not just blew origins and Jeff Bezos in space sex and yuan mosque doing this but\nThey are getting people talking about space and not just people going into space is talking about exploring space exploring the moon understanding where it is we live understanding more about our neighborhood\nYou it's always good practice to learn more about your neighborhood because it can help you live a happier save her life\nGets to what Nicole said earlier in the show which is you know people sometimes say God sixty years of NASA is it worth it a lot of people have died you know spaceships have crumbled probes haven't worked out but Nicole said you get people interested in these projects and its bonds a broader interest in science and engineering and so forth\nRight you just talked about the solar probe and that's going to study a star the sun and and certainly that can affect our daily lives in many ways that are unseen by most people All right\nLet's go back to our listeners and again the number here in the exchange for you to join our astronomy crew as we catch up on all the headlines in the world is space science recently is one eight hundred eight nine to six four seven seven send us an email if you'd like exchange at an H. P. R. dot org and Wayne calling from Dover Hi Wayne thanks for being with us go ahead\nHi I wanted to ask your panel of astronomers what they felt about unmanned space probes versus manned missions into space where do they say\nI'm I'll leave they think the investment should be split on maybe should public money going on man space probes to learn more about space and leave that private enterprise to the um travel to the manned space flight or just what their thoughts are on\nOh Wayne thank you for giving us an idea to do a whole hour on down their eyes because that's an awesome topic what's your take\nUm I I think that crude I I I prefer to use the term croup spaceflight um to talk of and gender neutral turns um crude spaceflight I'm\nStill has friend cures that have to be a scientific and engineering challenges to have to be dealt with so I like to see 'em\nYou know government organizations like NASA which do also work through private contractors oh ... they couldn't do it on their own yeah I'm Still have to tackle those the ... those big unknown questions though I\nYeah I'm that way I don't think there's you know a whole lot of private funding for robots in space unfortunately\nUm where the excitement is about courage states like so he'll missions I still think there's a place for that big agencies to push boundaries going to Mars is a huge technical issue well enough is desperate to send people to Mars asked yes I'm an end to the company's picking up\nSome of the low earth orbit work um crude or on crude I think is is great you know he doesn't need to be an either or that what you're saying yeah I Want to I like to see all the things in space [laughter] yeah I think that there's there's room for partnerships rebels what do you think John I\nI agree with that I I I think there needs to be both nothing inspires people more than if there is a mission with people on it exploring another place\nAnd that that's very exciting for for almost everybody I've never really met a person that's not excited by that on the other hand robotic space probes do it more efficiently especially when we're going to the outer reaches of the solar system where we can't send\nW. E. V. H. Hanover Ninety One point than any\nW. E. V. in Keene Ninety point seven WABC Durham one o seven point one W. E. B. J. Jackson Ninety nine point five W.\nE. V. S. ... point three\nAnd W. E. B. Q. Littleton Ninety One point nine and online at an H. P. R. dot org\nFrom New Hampshire Public radio I'm Laura ... and this is the exchange\nThe former planet Pluto gets a promotion businessmen invites artist on his upcoming moon voyage\nExtend to Jupiter these and other headlines hit the world of astronomy this fall and we'll cover them this hour also will observe an anniversary some of you might remember\nOn October fourth Nineteen fifty seven the Soviet Union launched its button next satellites\nAnd a face competition that continues to this day the exchange this guy who joined us this hour and we love your questions and comments email exchange it and HBO ... out of work again exchange at any PR dot org respond on Facebook or Twitter\nAt an HBO exchange or call in one eight hundred eight nine to six or seven\nSeven one eight hundred eight nine to ... and H PR and our guests are now Cameron's former astronomy and space educator at the college shepherd discovery center and Malik about good to see you going to be you're also with us John gene forty cofounder\nOf the Astronomical Society of northern New England and astronomy instructor for granted state college and UNH on John welcome back thanks for being here my pleasure Laura and also with us Nicole ... assistant professor of physics and astronomy at San some college and know up to ...\nTo get to see you so to start with you how do you explain to your students this button ec anniversary on this day and Nineteen fifty seven what a big deal this was to younger people appreciate how jaw dropping this was\nThat's a great question um and it's it's a little hard for me since I grew up being a giant space geek um so I was always into that stuff um but I can relate to my students and that\nYou know the space shuttle had always been around a in my memory and people have been living and working in space for my entire life\nI'm so it's it's interesting for us to step back and think of a time when there were no satellites and there was nothing up their people didn't even imagine a you know what would it be like to have something up there can they see us uh you know and I know it's it's bark a lot of um a lot of fears around that\nUm but just think that they were exploring a whole new territory is is really fascinating and all the things that we take for granted that rely on satellites just didn't exist\nClinton exist today I'm sure those satellites help us do I want to think about how many they got the whole hour but let's play a little CBS News clip from that day October fourth Nineteen sixty seven as I said the Soviet Union celebrated its ... Nick launch\nAnd uh the u._s. wondered what it should do in response and we'll talk about that but first let's just hear a little bit from CBS [noise]\nSome would never even heard\nSo much for the part of your country lawyers were your\nRecords in mind for those radios certainly going to be the first amendment is\nA whole new frontier mouth camera I mean it gives you a sense kind of what Nicole said this was a very big deal you remember about this now were you into space science even way back then\nWell back in those days I was in high school and uh I remember hearing how hard it sounded very odd to me that you could actually do that put something up and go around the earth\nAnd a member trying to go out and find and I don't think I ever saw it but uh just knowing it was there was\nKind of wonder but also kind of spooky because you weren't quite sure what this meant\nWhere they spying on us yeah right I mean the Cold War era so\nExactly and of course you extrapolate from who say well if I can do that with a rocket where else can they point to rocket and all that and so we wondered what what sport moved actually meant we thought it meant something like look out here I come back for a\nWhile or here I Am looking at you or whatever all it did was just send out the ... are here\nWhat the word actually means fellow traveler\nOkay I didn't know that yeah\nAnd that's because a A R remember reading about uh one of our ambassadors to Russia one time so that uh Nikita Khrushchev refused to a caller who ...\nWho knows what it meant\nWell and you will you hear that sort of gravity and that announcers voice you know a whole new era for\nFor mankind and so forth and John what do you think is important for people to consider 'em on this day whether they actually remember it or not\nWell there's there's quite a few people that remember it I I was alive but I don't remember it because I was too young but it means it it is literally\nThe beginning of a new era and and it it it's a it was a place we had never been before a lot of people weren't sure could be done\nAnd it did create a lot of a lot of fear and it it did motivate people in the administration in our country to kind of get off the couch\nAnd say hey we the space stuff we better be started taking it seriously\nAnd it really began a new era for the United states and it's a science program ah took to eventually forge its way into space so it it it it really was the beginning of a new era in in the world was never the same after\nThat event in fifty seven what's so interesting 'cause um during the I think it was the proceed meteor showers in August\nI was out of my back deck trying to catch a couple of meteor showers and you see these satellites you know all the time but back then and it wasn't that long ago that as mouth that this was a big big deal I'm lead to right John the creation of NASA of Nineteen fifty seven Sputnik goes up\nAnd Nineteen fifty eight correct me if I'm wrong the U.S said okay we got to get into this game and let's create NASA ... at at\nThat kind of a fever pitch right because they were worried about it and I should point out though that Sputnik was a very small satellite\nSo when you looked up you didn't see the satellite it was only a little bit bigger than maybe twice the size of the basketball so what you saw what people actually saw was the booster rocket that was much bigger and that reflected enough light back to see you didn't actually see the satellite itself\nYou saw the rocket that made it possible for it to enter into orbit about the euro so it was a little bit you know when when you saw this little faint light moving across the sky that wasn't the satellite but it was the vehicle that got the satellite\nThere gotcha so and I just want to let everybody know that John has his NASA tie on today and we're gonna put pictures as we always do arrest guy grew on Instagram so check them out they always where space themed gear when they come in it's an age PR exchange you can join us now with your questions and comments especially if you remember this\nSputnik anniversary although now I feel like I should say Sputnik but [laughter] set that aside for now our number one eight hundred eight nine too sick for seven seven send us an email exchange it N. H. P. R. dot org\nWe're going to cover a lot of topics from the world of astronomy today on the exchange and we'd love your reflections on any of them but right now we're talking about this\nSputnik anniversary so you can give us a call one eight hundred eight nine to six or seven seven so as an asset you know gets into gear sixty years ago it's celebrating its sixtieth anniversary um this year because of this\nYou know some people will say folks that it hasn't been worth it in terms of human sacrifices people have died um and we know that too well here in New Hampshire and also that it's been very expensive um and and the culture first I think but I Wonder if everybody how you feel when people say sixty years it's not worth it\nThat it's been financially where the um the technologies that have come from the space program that wouldn't have been developed any other way and this this is for the space program and ask us for a lot of\nBasic science to um we can't even calculate the uh we can't easily calculate the economic benefits but beyond the economic benefits um there's something\nPrimal for us about sending humans into space\nUm and this this comes up in the debate between you know a robotic space probes and humans and you know human missions um robotic space probes which we'll talk about what do a lot of the amazing things but sending people into space even to low earth orbit\nUm it's something that sparks people's imagination a and sparks people's desire to in many cases enter into a feat us at science fields there was you know a huge growth in the sciences at sciences scientists and engineers\nUm thanks to the Apollo program I'm just making that so visible so many people wanted to join a scientific\nEfforts so you're saying investing in NASA in space exploration spawns more interest in science in general and we're always being told that we don't have enough you know them graduates and so forth in this country science technology engineering and math Jon I Know you think about this\nTo have enough gravity to pull itself into a nearly spherical shape\nIt has to orbit the sun and it has to clear it's neighborhood that's the cats right right now now they said Pluto doesn't have enough mass to clean\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOn dog UNH dot edu this is the exchange I'm or can only this hour it's the latest from the world of astronomy man we're covering a lot of topics including renewed debate over we admitting to them into the planetary club we've also talked about the anniversary of Sputnik launched on this day in Nineteen fifty seven\nAnd a little bit later we'll talk about on mosques space X company announcing its book that first private passenger for a trip to the moon I shouldn't really say to the moon they're going to go look at the moon actually not going to have boots on the ground there and we will find out more we'd love to hear from you to the exchange numbers one eight hundred\nEight nine to six four seven seven send us an email exchange it an H. P. R. dot org again exchange it an H. P. R. dot org our number one eight hundred\nEight nine to six four seven seven so as these headlines have come out about you know should Pluto the planet again shouldn't it and this is a debate that's gone back and forth for twelve years there's another possible planet in Pluto's neighborhood Nicole this one called\nThe goblet now what a great nickname first of all who is the goblin and how far away as he or she spooky\nTime [laughter] this is a discovery of a dwarf planet so another one that wouldn't fit the traditional planet definition it's twenty Fifteen T. G. three eighty seven and T. G. I think is what gave them the GOP lend\nA being that it was I think ah discovered in October I told her funny fifteenth\nI'm there is a dwarf planet with an extreme orbits so it's kind of ... extremely elliptical orbit comes close in to the rest of the solar system the ... and then goes far far out\nThis was discovered on the way towards looking for an actual planets out there which is tentatively been called planet nine yeah the planet nine yeah auto was demoted twelve years ago yeah so so there might be a planet nine I'm so they're still searching for it and this involves some the astronomers that ah\nAh have brought some of the evidence forward thinking that hey maybe this exists thanks to the weird or bits of these objects are out in the solar system that indicate hey there may be uh something ten times the mass of earth out there\nSo while looking for a planet and which they haven't seen 'em they did see this a dwarf planets which we are calling the goblet and um and\nI Love it when NASA gives Clinton nicknamed the a lot more interesting than the usual name which is like you know\nMU sixty nine KB oh you know whatever it\nIs to mail on on this idea that the ... I Hope I'm pronouncing it right um these objects that have been found out their demoted Pluto promoting series how do you explain this sort of busy place called the Kuiper belt to you know kids who might come by the the Christa McAuliffe center\nAren't [noise] aren't are related to the best way to think about it in my mind is the third week of the asteroid belt\nWilliam Cohen range from close soon a which is a bunch of rocks that are orbiting I'm ... the area between Mars and Jupiter\nAh if you take the concept of by the way that there's not a lot of rocks that are it's not like when you hear in Star Wars\nOr you see them flying in and out of your Hassan ... a drug for that one no one there are two objects that have been visited recently the two largest objects um or one called ... and of course series\nWhich I'm Nicole mentioned earlier is a wonder was discovered in Eighteen or one or one it was discovered is that oh we found a new planets\nThis was in the asteroid belt is pretty close to our solar neighborhood\nLater they discovered all these other objects that are ... just part of the asteroid belt or if you carry that concept or beyond\nThere are a bunch of objects out there we are discovering more and more of them and um that's an area that was predicted to be filled with stuff that was was um actually\nCalled the ... because it's named after I lose the Gerard yeah ... ... it's K. U. I. P. E. R. I've heard it pronounced a hyper and I've heard it pronounced ...\nRight and you know they did so take your pick because otherwise you can't get around these hot in the\nRoom to tell us who lost but\nUm yeah and that's the same idea and Pluto we now look at as a a under current definition as being a dwarf planet it's round and it is in orbit around the sun\nAnd who it was discovered in Nineteen thirty and we said okay this is a ninth planet and back then we didn't have the technology to really realize how big or small of an object was if we were just moving out there and I'm the more we got that technology over the years the smaller this object\nBecame and so maybe it isn't a planet well are they also discovered some other objects out there to a ... belt they feel is the same idea except they are not just a asteroids they are much bigger and most of them can be round\nBut um that's where the ... belt comes from and south beyond the orbit of Neptune and again political demoted because they couldn't\nYou know sweep its neighborhoods clear it's neighborhood what about some of the other objects out there I'm John Will turn to you you know um there's other objects now that are drawing attention out in the hyper belt did they get planetary status\nUh how are these things being run so I I'm a little bit torn you know I have I have issues with you on mosques sometimes his views about science and other scientists and sometimes his\nViews about business and so trusting all of that to one very charismatic person is a little traveling interesting space billionaires space I'm guessing\nThat will be a topic for a future astronomy round up because it's out there and it's growing so and it's just interesting to see what these gentlemen will do and now they want to just completely jumped to another quick story that caught our attention\nA completely on the other end of the solar system we talked about Pluto and its neighborhood earlier to the sun itself NASA launched something in mid August called the parkers solar pro but I thought\nWow that sounds hot I'm Glad I'm not all that\nWell that was a good will and grace you should host a radio show about it the park\nOr solar probe yes um it's going to do something pretty extraordinary because ah it's designed for the first time to actually fly into the corona\nWhich is all that energy and heat coming off the sun um there's a mechanism going on there that scientists don't quite understand\nIf you go to the surface of the sun we know the surface what we would call the surface a is roughly ten thousand degrees Fahrenheit temperature wise\nBut as soon as you move away and into space\nWhere are you are away from the sun the news you if you think about like backing away from a campfire for example things get cooler and cooler\nBut that's not true you get out into a ... million miles or within that range somewhere and you're going to run into ... degree temperatures really the way you go further away you go wow this area we call the corona we don't see the corona everyday\nA scientist can cause them to block out the sun and given to um make believe eclipse if you will share and then they can see it\nUh last year I saw the corona because I went to see the solar eclipse of the last year in August and um you could easily you know take your fears special glasses new stare added to see this black dot with all these lines coming out of it\nBut the solar power was going to actually go into that area in its orbits it's kind of freaky to do but hopefully it'll teach us some things about what the mechanism is in um how this happens\nWell and help us understand those solar wind and solar flares which do have the possibility of you know knocking stuff out here on earth so Iraq way more after a short break stay with us this is the exchange on HBO [noise]\nOkay there is Joshua Johnson the host of one a on an H PR and as a fan of the show I wanted to let you know but we are coming to New Hampshire and you can be part of the conversation\nJoined me for an evening a fantastic discussion about issues that matter to you answer the Granite State joined us on Thursday October Eighteenth at the Capitol Center for the arts in hunger you can get your tickets right now at the ... and H\nSport or an age PR comes from you our listeners and Dana Farber Cancer Institute bringing Dana Farber expertise closer to you Dana Farber dot org slash locations\nFrom New Hampshire iPhone repair offering repairs buybacks and device sales were locations in Bedford Portsmouth and Salem and age iPhone repair dot com and from the museum of science exploring the science art and wonder of music has recently opened exhibition making music the science of musical instruments on shark dot org [noise]\nThis is an HBO are\nThis is the exchange on N. H. P. R. I. more can only today it's the latest from the world of astronomy including as we are discussing developments in private spaceflight also look at NASA's plans for a moon orbiting station to support further missions\nAnd a little bit later we'll catch up on the search for solar system water extending to Jupiter which is a place\nI never imagined would have water but we'll find out more and of course you can join us with your questions and comments one eight hundred eight nine to six four seven seven send us an email exchange\nAt an H. P. R. dot org and up John gene forty so when we talk about private entrepreneur um you know billionaire space boys sometimes some people call them\nThe attention always goes to eat on mosque and space acts and he is doing a lot but Jeff Bezos of Amazon fame and fortune it's also interested in space I just learned about this recently um how long has Mr base that's been interested in going to space ...\nAccording to him and and I'm not an expert in space entrepreneur is\nAnd I'm not that interested in about how they made their billions which both have done but but I I've done a little bit of reading about a Jeff Bezos and he has always been um since childhood interested in space and he\nHis goal has always been a personal goal of his has always been to help get people into space now see I didn't know that I saw the way that the you know a lot of media spinning his interest is he's trying to compete with Ilan but you're saying it goes back ... maybe\nI mean it's obviously an eagle contest to a certain extent right when but but but and and I don't know him personally meet neither one of them but from what I've read\n'em ... is interested in space I Do worry about entrepreneurs ... interest in space because they often conflict with scientific pursuits\nAnd and I worry about safety and things of that nature but but I Would say that\nAt least these individuals and it's not just blew origins and Jeff Bezos in space sex and the ... mosque\nDoing this but they are getting people talking about space and not just people going into space ... they're talking about exploring space exploring the moon understanding where it is we live understanding more about our neighborhood\nYou're it's always good practice to learn more about your neighborhood because it can help you live a happier save her life\nLook as to what Nicole said earlier in the show which is you know people sometimes say God sixty years of NASA is it worth it a lot of people have died you know spaceships have crumbled probes haven't worked out but Nicole said you get people interested in these projects and its bonds abroad are interested in science and engineering and so\nForth right you just talked about the solar probe and that's going to study star the sun and and certainly that can affect our daily lives in many ways that are unseen by most people All right let's go back to our listeners and again the number here in exchange for you to join our astronomy crew as we catch up on all the headlines\nIn the world is space science recently as one eight hundred eight nine to six four seven\nWhich at an H. P. R. dot org and Wayne's calling from Dover Hi Wayne thanks for being with us go ahead\nHi I wanted to ask your panel of astronomers what they\nFelt about unmanned space probes versus manned missions into space where do they see\n'em I'll leave they think the investment should be split on maybe should public money go into unmanned space probes to learn more about space and leave that private enterprise to the um travel to the manned space flight or just what their thoughts are on\nOh Wayne thank you for giving us an idea to do a whole hour on down there because that's an awesome topic what's your take\nUm I I think that\nCrude I I I prefer to use the term croup spaceflight um to talk of and gender neutral turns um crude space flight I'm Still has frontiers that have to be a scientific and engineering challenges to have to be dealt with so I like to see 'em\nYou know government organizations like NASA which do also work through private contractors oh ... they couldn't do it on their own yeah I'm\nStill have to tackle those the ... those big unknown questions so I like to see robotic space probes being done ... yeah I'm that way I don't think there's you know a whole lot of private funding for robots in space unfortunately\nUm whereas the excitement is about courage states like so human missions I still think there's a place for the big agencies to push boundaries going to Mars is a huge technical issue well enough is desperate to send people\nTo ask yes um but an end to the company's picking up some\nOf the low earth orbit work um crude or an food I think is is great you know he doesn't need to be an either or that what you're saying yeah I Want to say I like to see all the things in space [laughter] yeah I think that there's there's room for partnerships rebels what do you think John I\nI agree with that I I I think there needs to be both nothing inspires people more than if there is a mission with people on it exploring another place\nAnd that that's very exciting for for almost everybody I've never really met a person that's not excited by that on the other hand robotic space probes do it more efficiently especially when we're going to the outer reaches of the solar system where we can't send", "year": "2018", "show_name": "The Exchange (NHPR)", "city": "Keene", "day": "04"}