{"month": "10", "state": "NH", "station": "WEVN", "content": "These are the stations of New Hampshire public radio W ... conquered eighty nine point one\nW. E. V. S. Nashua eighty eight point three W. E. D. H. Hanover Ninety One point three of you e v and keen Ninety point seven\nW. E. B. C. Gore him one of those seven point one\nW. E. B. J. Jackson Ninety nine point five W E s coal Brooke Ninety point three and W. E. V. cute little ten Ninety One point nine and online at N. H. P. R. dot org\nThe Cuban missile crisis might be briefly touched upon and your average us history class these days but the but for those who lived through it it was terrifying as Americans seriously contemplated dying in a nuclear war the crisis emerged in the fall in Nineteen sixty two\nWhen us spy planes photograph Soviet nuclear missiles being assembled in nearby Cuba here's President Kennedy speaking to the nation on October twenty seconds Nineteen sixty two\nWithin the past week\nUnmistakable evidence has established the fact that a series of offensive missiles site is now in preparation\nOn that in prison to Ireland [noise]\nThe purpose of the bases\nCan be none other than to provide a nuclear strike capability against the western hemisphere\nNow a new book by two New England author is describes just how close we came to nuclear Armageddon\nAnd the men who prevented that outcome it's called above and beyond John F. Kennedy and America's most dangerous Cold War spy mission author Michael to diocese here his coauthor is Casey Sherman and Michael welcome it's really nice to meet you thinks making\nTime thank you for having me well before we get into all the different characters young JFK the pilots all the others who are involved including on the Russian side which is really interesting just to remind us please Michael how terrifying this was once the president went on TV and we'll be all that information\nPeople actually went up to the back yard so he started digging bomb shelters or it was that scary and ah even though Kennedy delivered\nTone or people knew what he was talking about in terms of how close we were so even in the book one of you to spy plane pilots whose ... air force veteran but in combat he thought I got down on my knees after listening to Kennedy and started praying because he ... he didn't know just how close are was\nWas there a bunch of stories in the book about how the country's leaders responded the plans they were making just give us a couple of those Michael like you know take the kids and drive to Missouri I think was the instructions for one now\nPearl is one and then a Jackie Kennedy was told we're going to take you to mount weather where there's this underground cave just outside of DC and um she reviews you said we're going to stay right here if we all go where to go as a family um but they were starting to evacuate from people\nRobert Kennedy junior told you a story about how it his school kids were told like little kids and ... year old or something we're told to consider the ethics of who gets into the bomb shelter and who doesn't [laughter] I Can't imagine that that\nAre coming you know so close to what's happening but the you know people ... and we all knew there weren't enough bomb shelters for everybody anyway so people were glued to their TV sets in their radios going what next\nWell and you were born in Nineteen fifty five I looked up um [laughter] so you're seven when this is happening Michael what memories do you have at this time\nJust very vague ah the the assassination of JFK ... was a much stronger memory for me maybe 'cause I was a year older some minor vague but I remember talking to my parents later and saying yeah we were we had that TV set going nonstop\nWell I Want to remind our listeners that we'd love to hear from you especially if you do have memories of this time we'd love to share a to hear you share them with us and if you don't have personal recollections about this what questions do you have about the Cuban missile crisis what gaps in your understanding do you have about this time\nAgain you can join us our email is exchange at an H. P. R. dot org exchange at N. H. P. R. dot org you can give us a call one eight hundred eight nine to fix for seven seven one eight hundred eight nine to an HP are we looking at a new book called above and beyond\nThe co-op and Michael two guy asked is with us it's about the Cuban missile crisis and the men involved\nIn helping prevent nuclear Armageddon again you can join us with your memories thoughts questions one eight hundred eight nine to fix for seven seven so as you were saying Michael you know this was real for people they really some of them are just going and building bomb shelters\nGoing out and praying that the worst would not happen I Want to play a little bit more of that speech from JFK again October twenty second Nineteen sixty two this is considered one of the most alarming speeches from the Cold War\nReally just raising the possibility of the world's two superpowers lobbying nuclear missiles I'm at each other let's hear a little bit more\nTo be the policy of this nation [noise]\nRegarding nuclear missile\nLaunch from against any nation in the western hemisphere\nBy the Soviet Union on the United states [noise]\nRequiring a for joining response former\nOn chairman fu show\nThe cap and eliminate\nThis plan just on regular for ... threat to world peace\nAnd a stable relations between two nations [noise]\nBy coal according to abandon this course of world domination\nAnd if you're in a store to\nSwim to Paris\nAnd across from the history of man\nOkay so they haven't Michael requiring a full retaliatory response\nOh it it gives me goose bumps even though I've heard this before I just still gives me goose bumps\nYeah I had a he laid everything out on the table and uh actually phrased it in such a way that are\nAlmost headed the whole western hemisphere because he said you know any missile coming from Cuba against any country here well\nThere were only going to shoot at us there were no other countries they were aiming at but he phrased it in such a way it'll call for the full retaliatory strike\nA back against the Soviets and it seems amazing to hear him even present that possibility that's for sure and the and then on the other hand he also present the possibility that discussions can lead to something much bigger\nAnd better uh between the two countries so you know in that one little clip we heard there's a lot there are going on\nWell how would you describe these times Michael um to someone who wasn't familiar with it maybe somebody born you know in the mid Nineteen nineties [noise] um [noise] the Cold War that provides the context for this story of the Cuban missile crisis\nWill most people are familiar with the uh shoot down of Gary Powers in ... to spy plane over Russia and all that followed because the Soviets were able to capture him and the plane and uh put eyes on our on the defense of\nA but it it it shows just how tense it was between ... you know these two different worlds if you will than Kennedy comes into office and there's already a plan to invade Cuba at the bay of pigs\nAnd Kennedy makes the mistake of not asking enough questions not getting enough advisors and kind of goes along with this preconceived planned under the Eisenhower administration Kennedy starting to get cold feet as it's nearing and he he pulls back some air support\nAnd needless to say the whole invasion has a disaster it's over before barely began and I'm In a way I think that was a good thing because it forces Kennedy to handle the Cuban missile crisis very differently that he did the bay of pigs\nWell in most people listening to think oh bay of pigs right JFK kind of disaster but that plan started with the Eisenhower administration to topple Castro\nYes we've been trying to topple Castro since almost day one that he came into power or even the Kennedy administration had plans to assassinate him and uh you know but the ... the bay of pigs showed how inexperienced Kennedy was but he learned from it and thank God he did\nIt do you think that it's a partly that bay of pigs fiasco a word often associated with it was part of the reason why the Soviet Union and put these offensive missiles right in our back door step they thought well this guy Kennedy you know he's he's a\nYeah I Do is not very impressive yeah I Do I ... I think they thought Kennedy might be a pushover part of that comes from a summit meeting at the two leaders had in Vienna\nI think that they thought once we get these missiles in Cuba there's no way to us was going to invade the island and it'll level the playing field the U.S has missiles very close to our border us being the\nThe Soviets and across just said ah let's see how they feel our missiles on their doorstep\nSo these are the missiles that the U.S had in Turkey they already are Italy yeah yes and the u._k. so they just thought you got missiles pointing at us we'll have missiles pointing at you exactly\nAnd and closer so they could reach Washington DC in something like twelve minutes\nSo why was that scene by American leaders as different did anybody in this country say yeah the kind of point they're athletes Stevenson did\nBy Gibson's bookstore and conquered downtown meeting place for\nBooks greeting cards games toys and coffee ... book signings and events at Gibson's bookstore dot com at Massachusetts General hospital using research to develop treatments for complex conditions all to help their patients get back to their lives Mass General revolutionizing care\nOr the exchange I New Hampshire public radio [noise]\nThis is the exchange I'm working away today above and beyond it's a new book about the Cuban missile crisis\nAnd the EU to spy missions that provided the photographic evidence at the heart of this story but talking to one of the books coauthors Michael to guy asked if you have memories at that time we'd love for you to share them with us and if you don't have personal recollections about this what questions do you have what\nGaps in your understanding about this time period [noise]\nHave you always sort of had a again you can give us a call one eight hundred eight nine to six or seven seven send us email exchange and H. P. R.\nDot org respond on Facebook or Twitter at an age PR exchange again the number one eight hundred eight nine to\nFix for seven seven and a Michael let's go back to our listeners bill is calling from Franklin Hi Bill you on the air thanks for being with us from ... sure go ahead bill\nI just want to share a story a I'm an older man and I can remember way back when\nI was a boy and during the Cuban missile crisis uh my parents sent me down our local supermarket or knowledge of John Yoo showed my shoes called on from buck them over there on edge we're miles from the tree met for the mall to\nAn end up ... believe it or not they actually had [noise]\nAn actual fallout shelter though\nAnd you could go in there and you could see how you get in and could she does too on top of it and it showed her how to fill the drawer and clean air filter out\nRadioactive fallout and he had all this room for for ... for your family and places to store water and you could purchase this thing\nBarriers in your backyard and not ... the stuff you're going to run out the back yard with a family climbed down into it and I survived that way why now so they actually had\nA yeah I remember it and I don't think anyone ever bought one dad\n[laughter] well so go to the store bell and pick up milk bread eggs and and the fallout shelter thank you so much for calling this is amazing\nMy I had I never knew about that that's incredible did you have a fallout shelter or no you were told to go down in the basement or no I don't remember that and um you know Ninety nine point nine percent of people did not have the necessary\nFallout shelter or equipment or anything else so you know we were we were exposed\nWell here's an email from Doug in Mason he says that was during my first year of college each floor the dorm had a central room with a TV everyone gathered around for President Kennedy's address I'm Doug says he went through with his explanation then came the line I hereby declare a state of\nAnd there was a collective gasp and we expected him to say war and then he said embargo on Cuba and I'm you know [laughter] yeah everyone so\nI guess that's to me we're getting a little ahead of ourselves but I'm In the end Kennedy decided not to go straight to war um thank goodness he decide to do this embargo on Cuba what was that um what was the goal that what was that about well he had assembled\nHis closest team of advisors called the ... the executive committee and most advisers and Kennedy himself on the first day of deliberations work for us going in with a massive airstrike\nTaking out the missiles taking out the surface to air missiles that protected the nuclear missiles but but he didn't give the okay because he knew he had a little more time and then over the next two sections he's starting to\nThink oh my God this millions of people could die if we do this they're going to respond\nAnd Curtis what may the air force general is that one of the meetings\nAnd Kennedy goes so if we do this what do you think the Russians will do and what may goes absolutely nothing more stronger and Kennedy goes you don't think they'll go and take West Berlin immediately and respond and what may goes no we've got to go and now all we have the element of surprise\nAnd thank God Kennedy\nLet him speak did the dismissal of may but didn't succumb to the pressure\nFrom may and all the joint chiefs are and all the heads of the different uh military branches they were all for hey we've got a moving fast to get them by surprise every day we wait there I had more defensive position to protect these missiles so\nDay by day I'm the pressure increases because me by day these missiles are becoming more operational as offensive missiles ... one of the early ideas than was to go in and take these things out before they became often says\nMichael take 'em out and uh and then watch a full scale invasion on the scale of of D Day to take take over the island we'd want it to take over there for a long time and here is our chance but Kennedy ... you know having been in war himself to see\nSupport for an HP our live stream comes from you our listeners and from revision energy a local employee owned company helping thousands of granite staters go solar\nRevision energy is currently growing their team of electricians and plumbers learn more at revision energy dot com slash careers\nMe if it doesn't work so he calls for this um quarantine he didn't want to use the word blockade because it's illegal to do a blockade on the high seas so he calls it a quarantine\nAnd or many of advisors go that'll never work and Kennedy I'm paraphrasing says something to the fact that may be but that's just our first we we've got more we can do obviously after that\nAnd this will give the Russians time to think as well\nAt first they were going to have that quarantine line at eight hundred miles out that he moved to five hundred saying let's give them a little more time to approach to think about it\nHe's under a lot of pressure though from this X. calm some members of the ... it's just going for it\nYeah in night and day meetings on this and he's so young forty three years old a but handles it so smoothly he's secretly taped recorded every meeting of this group they didn't even know they're being tape but he had a little switch under the cabinet room desk and uh\nHe caught it all on tape so you could listen you can hear some of it on line we took the more interesting parts and put it in above and beyond so you see that pushback that he's getting from the military advisors and from the secretary of defense\nWell and the impression that you can't have candy from this book is as you said just the the calmness they studying is um despite all the challenges you say in the book a lesser person surely would've cracked under the strain nuclear war might have followed\nUm you can't do that this but I'd like to ask you Michael where did that mental discipline that calm under pressure that ability not to freak out where did that come from I think part of it\nCame from the less than other bay of pigs that I Am not going to be rushed into anything 'cause he kept asking are they operational yet and you do is we're still flying sitting ducks are with no weapons on board just their cameras\nAnd he knew that the warheads we're not on the missiles and some of them were not on the the launch pad so we knew we had a little time\nTo play with and he was communicating with Khrushchev daily uh through cables back and forth and the tone was interesting there are always respectful from about respect for both sides giving their point of view and at least they had this dialogue going\nThere's a whole chapter in the book about that PT boat experience and more and more into that JFK had um I never read a detailed account of it I knew he was sort of in World War two hero but I wasn't really sure why\nHit by the Japanese somewhere in the south Pacific I lost count Michael how many miles JFK had to swim from Ireland Ireland unbelievable it's unbelievable you say he put his body and mind to an ordeal that would have broken most men\nAmazing you know do those men survived largely because of of Kennedy himself or both physically and mentally getting through that ordeal\nGetting that having that experience in war yes made him more cautious than perhaps someone who had not been to war and seen you know people die\nRight scene right seeing friends then that worked under him die you know two of those bitty one oh nine a crew members died so he'd seen war up closer to sought some faraway distant thing and he says I'm One of the meetings it's very interesting world\nAnd immediate strike but he said as soon as the bug starts flowing people are going to start to think differently\nAnother aspect of Kennedy's calmness um ... it's even more noteworthy Michael because you tell us that he was in constant back pain and again the firemen spot and I I sort of knew he had back problems and he had a lot of illnesses but this pain was excruciating at times how manager at\nA whiskey and wine ... sad wind now open for pm to ten pm Monday through Saturday additional menu cocktail and beer selections one forty eight north main street in Concord [noise]\nYou're listening to the exchange and this is New Hampshire public radio [noise]\nThis is the exchange I'm Laura ... this hour untold stories about the Cuban missile crisis with author Michael to diet and his new book above and beyond J. F. Kennedy John F. Kennedy and America's most dangerous Cold War spy mission coauthored with Casey Sherman\nLet's hear from you we've been getting some great stories questions comments reflections of that time join us one eight hundred eight nine to six four seven seven send us an email exchange at an H. P. R. dot org\nAnd Michael we talked earlier about how both Khrushchev and Kennedy worried that you know one little mistake from someone lower down on the food chain could really exploded into World War three you talked about the generals on Cuba that shut down um you two pilot\nRudy Anderson there's another guy I Love this story about the early ...\nWho if somebody in this book told you help save the world know who this guy\nYou really dead there was Russian sub B. fifty nine that um [noise] we were dropping practice ... charges that was supposed to be the signal hey we found her position you have to come to the surface you're near the quarantine line\nThis is so this is near the blockade on the island of Cuba not just on ships but sub so this is how you tell us up come on up we see him\nRight okay we dropped days and I'm now did he know they were practice we don't know he might have thought they were real we're told the Russians we dropped three or four we dropped over twenty on this sub\nSo that the commander of the sub thanks war has broken out this is at World War three is breaking out there trying to to drop me to the bottom of the seat because he's being rattled like in their words in a barrel they described it\nSo he says ready the special torpedo each sub had one nuclear torpedo and he has it's a loaded into launched to number three\nAnd thank God this other commanders on board he was the flotilla commander he wasn't command of this particular sub so he was a of equal rank\nAnd um he says my God what are you doing we don't know if war is broken out we're down here just being rattled around and uh they get in an argument and thank God for Siegel he wins the argument and says we should\nCome up ah we don't know we don't have authorization to fire the missile talk about communist and presence of mind yes so he and many respects he did save the world if he wasn't there this commander would've fired as nuclear torpedoed taken out the aircraft carrier and all help or would have broke loose\nSo who's going to play him in the movie now [laughter] you know bad snakes that rising well one more sort of hear of this story and there are lots of them that we should talk about um Chuck ... my ... and I yeah\nYes Chuck was a YouTube pilot as well I actually was a a fighter pilot before that that they captured by the Chinese spin a horrific POW experience but gets back in the air force then joined the EU to spy plane program and\nHe's a up in Alaska and he's supposed to do a mission over the north pole just to collect radioactive samples\nTo monitor what the Soviets are doing so this is it's not a routine mission but this had been something on going but his is going to be a long and all the way to the north pole\nAnd when they leave land bases believe it or not they're flying by celestial navigation so because there are no radio beacons below no land masses to look at your just over this ice shield\nAt what happens the Aurora boreal us appears the northern lights so it temporarily blind them from being able to see the stars to get his fixes\nSo on his way back he he gets lost he's he's off course he's supposed to come back the same way went up the ice in air force base any strays over Russia and airspace the Russians see I'm coming on their radar and they're like what's this that the vanguard of a U.S attack\nSo they send up mix to intercept whatever this aircraft is coming in law to be his first clue that he's lost in a serious way as Russian music\nRadio on their little sneaky too they fit I say hey you identify yourself and he's not sure if it's Americans trying to save him and then he hears\nRussian music yes right someone to come on the radio and said without any clear by the way right and and with the you know no Russian accents or was a linguist and he's not sure who this is is this friend or foe so we'd gives the code\nAnd it doesn't come and he knows it's the Russians trying to coax them in further so they can shoot him down then he notices oh my God I'm almost out of fuel\nSo he takes the high risk maneuver of shutting down the aircraft to glide which means you lose cabin pressure you would\nNormally you die if you were just up there in this plane Thirteen miles up you would die your your blood boil but he's got the pressure to Don yeah they had special suits ... elements\nAnd he's he's tried to coast back towards Alaska we know he's in trouble by now\nWe watch for fighter jets and they have nuclear tipped missiles on them and they're all coming together uh to me you out to him gliding out you had the Russians coming up and you have are for fighter jets\nComing I don't want to give away the whole book [laughter] ... how close we came over the the bearing see two nuclear war and another case just like the sub\nWell and when I was reading that chapter and you're right we don't wanna get the whole thing away although we all know that that nuclear did not break out um but when I was starting to read that chapter I thought okay this is interesting but why do I care about this guy getting lost over Alaska but it's because everything was so heightened any misperception could've blown things and\nAnd that was on the very day on the very our that made major Rudy Anderson is being shot down over Cuba so that that day is forever known as black Saturday because it's the darkest day in the history of the world it\nIt appears that within the next twelve hours there'll be Armageddon\nTake another call this is will in Auburn Hi well thanks for waiting on the air welcome\nYes thank you I can remember vividly October of Ninety sixty two because I was Nineteen and are on board the USS Okinawa which was a helicopter carrier\nAnd we were on station or as part of the and I know ah it was mentioned it wasn't called the blockade which the corn teamed up but we knew it was a block\nAnd and when we were told\nThat we're going to ... Florida after we had been part of the blockade for maybe about seven days we didn't know exactly what we're going to and we found out very quickly the crew a unloaded are loaded ammunition\nAnd food and approximately two thousand Marines and at that point a you know being Nineteen we thought and many of us who are young thought this is that we're going to invade Cuba if we don't have this and then later of course I found out about the incident with the Soviet sub\nAnd the man who save the world that silly a cop\nAnd that made it while because we were a large ship as well I think it was the ... was it not that was targeted had the uh uh Eric hop agreed to launch a with the other two officers that that uh fourteen I think too much on a torpedo missile\nWill you were really you know you had some serious work in front of you so maybe you didn't have time to sort of think or feel but do you remember about how you found to mean\nYeah I I felt the many of us I I was Nineteen I didn't think I live to see my twentieth birthday ... that's how it was\nA and we knew how to answer was and uh you know we uh well we thank goodness for Kennedy and crew chef or and thank God for the man who save the world I I think a good friend of mine was going to name was first born first born a silly\n[laughter] during the ...\nAt the center will fantastic to hear from you thank you so much for that call 'em and amazing\nWells comment that he may not have seen his twentieth birthday is correct because had we done the invasion and he just confirmed that he was loading\nHis ship with Marines uh they would have been met by tactical nuclear weapons on the ground in Cuba but we didn't know\nThat the Soviets would also delivered battlefield nuclear weapons but they had cruise missiles they had the all the battlefield nuclear weapons so it would not have been this easy invasion at all we would have lost\nA lot of men lots more reflections from our listeners Denison conquered emailed to say\nI was an active duty marine Nineteen fifty eight to sixty to serve the last two years in Hawaii\nA upon arrival to my parents' home in Brooklyn I literally sat on my see bag watching President Kennedy on TV I thought for sure that I was going to be called back in I started to receive postcards from all over the Caribbean from others I had just left behind in Hawaii as it turns out they had been put on ships and sent through the Panama Canal\nW. E. V. in Keene Ninety point seven you'll be ABC Gore won over seven point one\nWu BJ Jackson Ninety nine point five W. E. V. S. cobra Ninety point three and W. E. the cue Littleton Ninety One point nine and on line and H. P. R.\nDot org from New Hampshire Public radio I'm Mark annoy and this is the exchange\nThe Cuban missile crisis might be briefly touched upon and your average us history class these days but the but for those who lived through it it was terrifying as Americans seriously contemplated dying in a nuclear war the crisis emerged in the fall in Nineteen sixty two\nWhen us spy planes photograph Soviet nuclear missiles being assembled in nearby Cuba\nHere's President Kennedy speaking to the nation on October twenty second Nineteen sixty two\nWithin the past week\nUnmistakable evidence has established the fact that a series of offensive missiles site is now in preparation\nOn that in prison Ireland [noise]\nThe purpose of these bases\nCan be none other than to provide a nuclear strike capability against the western hemisphere\nNow a new book by two New England author is describes just how close we came to nuclear Armageddon\nAnd the men who prevented that outcome it's called above and beyond John F. Kennedy and America's most dangerous Cold War spy missions author Michael to diocese here his coauthor is Casey Sherman and Michael welcome to this really nice to meet you thinks making\nTime thank you for having me well before we get into all the different characters young JFK the pilots all the others who are involved including on the Russian side which is really interesting just to remind us please Michael how terrifying this was once the president went on TV and we'll be all that information\nSome people actually went up to the back yard so he started digging bomb shelters or it was that scary and uh even though Kennedy delivered that message with a calm but from tone or people knew what he was talking about in terms of how close we were so\nEven in the book one of you to spy plane pilots whose ... air force veteran but in combat he thought I got down on my knees after listening to Kennedy and start a brain because he ... he didn't know just how close was\nWell they're a bunch of stories in the book about how the country's leaders responded the plans they were making just give us a couple of those my little like you know take the kids and drive to Missouri I think was the instructions for one ...\nOne and then a Jackie Kennedy was told we're going to take you to mount weather where there's this underground cave just outside of DC and um she reviews you said we're going to stay right here if we all go where to go as a family um but they were starting to evacuate some people\nRobert Kennedy junior told you a story about how his school [noise]\nAnd your old or something we're told to consider the ethics of who gets into the bomb shelter and who doesn't [laughter]\nI Can't imagine that that are coming you know so close to what's happening but the you know people and we all knew there weren't enough bomb shelters for everybody anyway so people were glued to their TV sets in their radios going what next\nWell and you were born in Nineteen fifty five I look up um [laughter] so you're seven when this is happening Michael what memories do you have at this time\nJust very vague ah the the assassination of JFK ... was a much stronger memory for me maybe 'cause I was a year old or some minor vague but I remember talking to my parents later and saying yeah we were we had that TV set going nonstop\nWell I Want to remind our listeners that we'd love to hear from you especially if you do have memories of this time\nWe'd love to share a to hear you share them with us and if you don't have personal recollections about this what questions do you have about the Cuban missile crisis what gaps in your understanding\nDo you have about this time again you can join us our email is exchange at an H. P. R. dot org exchange at an H. P. R. dot org you can give us a call one eight hundred eight nine to fix for seven seven one eight hundred eight nine to an HP are we looking at a new book called above and beyond\nThe co-op and Michael to diet is with us it's about the Cuban missile crisis and the men involved\nIn helping prevent nuclear Armageddon again you can join us with your memory starts questions one eight hundred eight nine to fix for seven seven so as you were saying Michael you know this was real for people they really some of them were just going and building bomb shelters\nGoing out and praying that the worst would not happen I Want to play a little bit more of that speech from JFK again October twenty second Nineteen sixty two this is considered one of the most alarming speeches from the Cold War\nReally just raising the possibility of the world's two superpowers lobbying nuclear missiles I'm at each other let's say a little bit more\nShall be the policy of this nation\nTo regard any nuclear missile\nLaunch from against any nation in the western hemisphere\nBy the Soviet Union on the United states [noise]\nRequiring a retaliatory response former\nI caught up on chairman crucial\nTo cast and eliminate\nThis plan to Stein reckless and provided a threat to world peace\nAnd a stable relations between two nations [noise]\nMichael according to abandon this course of world domination\nAnd if you're in a store to\nSwim to Paris\nAnd to transform the history of man\nOkay so they haven't Michael requiring a full retaliatory response he's not you know messing around\nWhile it gives me goose bumps even though I've heard this before or just still gives me goose bumps\nYeah I had a he laid everything out on the table and uh actually phrased it in such a way that are\nAlmost headed the whole western hemisphere because he said you know any missile coming from Cuba against any country here well they're only going to shoot at us there were no other countries they were aiming at but he phrased it in such a way it'll call for the full retaliatory strike a back against the Soviets\nAnd it seems amazing to hear him even present that possibility\nThat's for sure and the and then on the other hand you also present the possibility that discussions can lead to something much bigger and better uh between the two countries so you know in that one little clip we heard there's a lot there are\nOn well how would you describe these times Michael um to someone who\nNineteen nineties um the Cold War that provides the context for this story of the Cuban missile crisis\nWell most people are familiar with the uh shoot down of Gary Powers you to spy plane over Russia and all that followed because the Soviets were able to capture him and the plane and uh put ice on our on the defensive\nUp but it it it shows just how tense it was between ... you know these two different worlds if you will than Kennedy comes into office and there's already a plan to invade Cuba at the bay of pigs\nAnd Kennedy makes the mistake of not asking enough questions not getting enough advisers and kind of goes along with this preconceived planned under the Eisenhower administration Kennedy starting to get cold feet as it's nearing and he he pulls back some air support\nAnd needless to say the whole invasion has a disaster it's over before barely began and I'm In a way\nI think that was a good thing because it forced Kennedy to handle the Cuban missile crisis very differently than he did the bay of pigs\nWell and most people listening to think oh bay of pigs right JFK kind of a disaster but that plan started with the Eisenhower administration to topple Castro\nYes we've been trying to topple Castro spends almost day one that he came into power or even the Kennedy administration had plans to assassinate him and uh you know but the ... the bay of pigs showed how inexperienced Kennedy was but he learned from it and thank God he did\nDo you think that it's a partly that bay of pigs fiasco a word often associated with it was part of the reason why the Soviet Union and put these offensive missiles right in our back door step they thought well this guy Kennedy you know he's he's a\nYeah I Do is not very impressive yeah I Do I said in bold in them\nI think they thought Kennedy might be a pushover part of that comes from a summit meeting at the two leaders had in Vienna\nI think that they thought once we get these missiles in Cuba there's no way to us was going to invade the island and it'll level the playing field the U.S has missiles very close to our border us being the\nThe Soviets and across just said ah let's see how they feel our missiles on their doorstep\nSo these are the missiles that the U.S had in Turkey they already are Italy yeah yes and the u._k. so they just thought you got missile pointing at us we'll have missiles pointing at you\nExactly and and closer so they could reach Washington DC and something like twelve minutes\nSo why was that scene by American leaders as different get anybody in this country say yeah they kind of point they're athletes Stevenson did he was the first and he was UN ambassador you and about ... democratic ... actually\nLike vineyard brands importers wolf trap a red wine blend from South Africa's cables good hope\nAvailable in New Hampshire and on the Web at vineyard brands dot com slash wolf trap [noise]\nSeven twenty back to the exchange on New Hampshire public radio\nThis is the exchange I'm or canoeing today above and beyond it's a new book about the Cuban missile crisis\nAnd the EU to spy missions that provided the photographic evidence at the heart of this story we're talking one of the books coauthors Michael to guy is if you have memories at that time we'd love for you to share them with us and if you don't have personal recollections about this what questions do you have what gaps in your understanding about this time period\nHave you always sort of had again you can give us a call one eight hundred eight nine to six or seven seven send us email exchange it and H. P. R.\nDot org respond on Facebook or Twitter at an age PR exchange again the number one eight hundred eight nine to six or seven seven and Michael let's go back to our listeners bill is calling from Franklin Hi Bill you're on the air thanks for being with us\n... sure go ahead bill\nWell I just want to share a story a I'm an older man and I can remember way back when\nI was a boy and during the Cuban missile crisis uh my parents sent me down or local supermarket or knowledge of drawing you showed my shoes called on from bug them\nOver there in ... between ... for the mall to an end up ... believe it or not\nThey actually had\nA model of an actual fallout shelter though\nAnd you could go in there and you could see how you get in and could she does too long talk show that and it showed how to filter to draw and clean air filter out\nRadioactive fallout and he had all this room for for ... for your family and and places to store water and you could purchase this\nThing barriers and your back yard and then on the ... the stuff you're going to run out the back yard with a family climbed down into it and I survived outweigh wow so they actually had a yeah I remember\nIt and I don't think anyone ever bought one but that\n[laughter] well so go to the store bell and pick up milk bread eggs and and the fallout shelter thank you so much for calling this is amazing I had I never knew about that that's incredible did you\nSupport for HP eyes live stream comes from you our listeners and from castle in the clouds Milton burl experienced\nThe beauty of autumn in New Hampshire from high up on the castle on hike the states what a trails or taking colorful views while dining on the terrorists open deli through October twenty first castle in the clouds dot org each floor\nThe dorm had a central room with a TV everyone gathered around for President Kennedy's address I'm Doug says he went through with this explanation then came the line I hereby declare a state of\nAnd there was a collective gasp and we expected him to say war and then he said embargo on Cuba and I'm you know [laughter] yeah everyone so\nThey've given us too I mean we're getting a little ahead of ourselves and but I'm In the end Kennedy decided not to go straight to war um thank goodness he decide to do this embargo on Cuba what was that um what was the goal that what was that about\nWell he had assembled his closest team of advisors called the ... the executive committee and most advisers and Kennedy himself on the first day of deliberations work for us going in with a massive airstrike\nTaking out the missiles taking out the surface to air missiles that protected the nuclear missiles [noise] but but he didn't give the okay because he knew he had a little more time and then over the next two sections he's starting to\nThink oh my God this millions of people could die if we do this they're going to respond and Curtis love may the air force general is that one of the meetings\nAnd Kennedy goes so if we do this what do you think the Russians will do and what may goes absolutely nothing more stronger and Kennedy goes you don't think they'll go and take West Berlin immediately and respond and what may goes no we've got to go and now all we have the element of surprise\nAnd thank God Kennedy\nLet him speak the dismissal of may but didn't succumb to the pressure\nFrom what may and all the joint chiefs are and all the heads of the different uh military branches they were all for hey we've got a moving fast to get them by surprise every day we wait there I had more defensive position to protect these missiles\nSo day by day I'm the pressure increases because they by day these missiles are becoming more operational as offensive missiles ... one of the early ideas than was to go in and take these things out before they became often says Michael\nTake 'em out and uh and then watch a full scale invasion on the scale of of D Day to take take over the island we wanted to take over there for a long time and here was our chance\nBut Kennedy ... you know having been in war himself seen blood and had two of his people died during the P. T. one oh nine that we write about in above and beyond 'cause we want to show that the reader the sky Kennedy had been there in war he's pausing and he's thinking\nIf I go to that step that's it that there are no steps after that that's war why don't I Try something\nWhere I have some options still in front of me if it doesn't work so he calls for this um quarantine you didn't want to use the word blockade because it's illegal to do a blockade on the high seas so he calls it a quarantine\nAnd or many of advisors go that'll never work and Kennedy I'm paraphrasing says something to the effect\nThat may be but that's just our first we we've got more we can do obviously after that and this will give the Russians time to think as well at first they were going to have that quarantine line at eight hundred miles out that he moved to five hundred saying\nApproach to think about it he's under a lot of pressure though from this X. calm some members of the ... that it's just going for it\nYeah night and day meetings on this and he's so young forty three years old a but handles it so smoothly he's secretly tape recorded every meeting of the screw they didn't even know they're being taped but he had a little switch under the cabinet room desk and uh\nHe caught it all on tape so you could listen you can hear some of it on line we took the more interesting parts and put it in above and beyond so you see that push back that he's getting from the military advisors and from the secretary of defense\nWell and the impression that you get candy from this book is as you said just the the calmness they are studying is um despite all the challenges you say in the book a lesser person surely would've cracked under the strain nuclear war might have followed\nUm you hinted at this but I'd like to ask you Michael where did that mental discipline that calm under pressure that ability not to freak out where did that come from I think part of it\nCame from the lesson of the bay of pigs that I Am not going to be rushed into anything 'cause he kept asking are they operational yet I mean you do is we're still flying sitting ducks with no weapons on board just their cameras\nAnd he knew that the warheads we're not on the missiles and some of them were not on the launch pad so we knew we had a little time\nTo play with and he was communicating with Khrushchev daily or through cables back and forth and ah the tone was interesting there were always respectful from but respectful both sides giving their point of view and at least they had this dialogue going\nThere's a whole chapter in the book about that Peter ... experience in ... to that JFK had um I never read a detailed account of it I knew it was sort of in World War two hero but I wasn't really sure why\nHit by the Japanese somewhere in the south Pacific I lost count Michael how many miles JFK had to swim from Ireland Ireland unbelievable it's unbelievable you say he put his body and mind doing or deal that would have broken most men\nJust amazing you know do those men survived largely because of of Kennedy himself a both physically and mentally getting him through that ordeal\nGetting that having that experience in war yes made him more cautious than perhaps someone who had not been to war and seen you know people die\nRight clean right seeing friends then that worked under him die or two of those bitty one oh nine a crew members died so he'd seen more up close and it's not some faraway distant thing and he says in one of the meetings it's very interesting\nWe're all talking about this you know harsh a reaction and immediate strike but he said as soon as the bug starts flowing people are going to start to think differently\nAnother aspect of Kennedy's calmness um ... it's even more noteworthy Michael because you tell us that he was in constant back pain and again if I read this book I sort of knew he had back problems and he had a lot of illnesses but this was excruciating at times how manager at\nBy Mac's apples on mammoth wrote in London dairy farm stand and you pick orchards now open at picking Honeycrisp McCowan at other prime varieties\nInformation Mac's apples dot com [noise]\nIt's the exchange I New Hampshire public radio [noise]\nThis is the exchange I'm or canoe like this hour untold stories about the Cuban missile crisis with author Michael to diets and his new book above and beyond J. F. Kennedy John F. Kennedy and America's most dangerous Cold War spy mission collided with Casey Sherman\nLet's hear from you we've been getting some great stories questions comments reflections\nOf that time join us one eight hundred eight nine to fix for seven seven send us an email exchange at an H. P. R. dot org\nAnd Michael we talked earlier about how both Khrushchev and Kennedy worried that you know one little mistake from someone lower down in the food chain could really exploded into World War three you talked about the generals on Cuba that shut down um you two pilot\nRudy Anderson there's another guy I Love this story but Philly ... paws from Russian sub commander\nWho as somebody in this book told you\nHelp save the world know who this guy\nHe really did there was Russia's sub B. fifty nine that um we were dropping practice ... charges that was supposed to be the signal hey we found her position you have to come to the surface you're near the quarantine\nLine this is so this is near the blockade of the island of Cuba not just on ships but sub so this is how you tell us up come on up we see\nYou right okay we dropped days and I'm now did he know they were practice we don't know he might have thought they were real we're told the Russians we dropped three or four weeks drops to over twenty on this sub\nSo that the commander the sub thanks war has broken out this is a World War three is breaking out there trying to to drop me to the bottom of the seat because he's being rattled like in their words in a barrel they described it\nSo he says ready the special torpedo each subject\nHe has it's a loaded into launch to number three\nAnd thank God this other commanders on board he was the flotilla commander he was in command of this particular sub so he was a of equal rank\nAnd um he says my God what are you doing we don't know if war is broken out we're down here just being rattled around and uh they get in an argument and thank God for Siegel he wins the argument and says we should\nCome up ah we don't know we don't have authorization to fire the missile talk about communist and presence of mind yes so he and many respects he did save the world if he wasn't there this commander would've fired as nuclear torpedoed taking out the aircraft carrier and all help or would it broke loose\nSo who's going to play him in the movie that [laughter] you know a ... that rising well\nOne more sort of hear of this story and there are lots of them that we should talk about um\nChuck most of my ... and I yeah yes Chuck was a a YouTube pilot as well I actually was a fighter pilot before that that they captured by the Chinese spin a horrific POW experience but gets back in the air force and joined the EU to spy plane program and\nHe's a up in Alaska and he's supposed to do a mission over the north pole just to collect radioactive samples\nTo monitor what the Soviets are doing so this is it's not a routine mission but this had been something on going but his is going to be a long and all the way to the north pole\nAnd when they leave land bases believe it or not they're flying by celestial navigation so because there are do radio beacons below no land masses to look at your just over this ice shield\nAt what happens the Aurora boreal us appears the northern lights so it temporarily blind them from being able to see the stars to get his fixes\nSo on his way back he he gets lost he's he's off course he's supposed to come back the same way went up the ice in air force base any strays over Russian airspace the Russians see him coming on their radar and they're like what's this that the vanguard of a U.S attack\nSo they send up mix to intercept whatever this aircraft is coming in lots be his first clue that he's a lost in a serious way as Russian music\nOn the radio on their little sneaky to they say hey identify yourself and he's not sure if it's Americans trying to save him\nAnd then he hears Russian music yes right someone to come on the radio and said we're not clear by the way right and and with the you know Russian accents always a linguist and he's not sure who this is is this friend or foe so it gives the code word waiting for the code word response\nAnd it doesn't come and he knows it's the Russians trying to coax them in further so they can shoot him down then he notices oh my God I'm almost out of fuel so he takes the high risk maneuver\nOf shutting down the aircraft to collide which means you lose cabin pressure you would\nNormally you die if you were just up there and this plane Thirteen miles up you would die your your blood boil but he's got the pressure to Don yeah they had special suits ... helmets\nAnd he's he's tried kept coast back towards Alaska we know he's in trouble by now\nWe watch for fighter jets and they have nuclear tipped missiles on them and they're all coming together a tomato you out to him gliding out you have the Russians coming up and you have are for fighter jets\nCalming I don't want to give away the whole book [laughter] ... how close we came\nNuclear war in another case just like the sub\nWell and when I was reading that chapter and you're right we don't wanna get the whole thing away although we all know that that nuclear did not break out um but when I was starting to read that chapter I thought okay this is interesting but why do I care about this guy getting lost over Alaska but it's because everything was so heightened any misperception could've blowing things up and\nAnd that was on the very day on the very our the major major Rudy Anderson is being shot down over Cuba's so that that day is forever known as black Saturday because it's the darkest day in the history of the world it it appears that within the next twelve hours there'll be Armageddon\nTake another call this is will in Auburn Hi well thanks for waiting on the air welcome\nYes thank you I can remember vividly October of Ninety sixty two because I was Nineteen\nAnd are on board the USS Okinawa which was a helicopter carrier\nAnd we were on station or as part of the and I know ah it was mentioned it wasn't called the blockade was a corn teamed up but we knew it was a bucket\nAnd and when we were told\nThat we're going to may ... Florida after we had been part of the blockade for oh maybe about seven days we didn't know exactly what we're going to and we found out very quickly the crew a unloaded are loaded ammunition and food\nAnd approximately two thousand Marines and at that point ah you know being Nineteen we thought and many of us who are young thought this is that we're going to invade Cuba if we don't have this and then later of course I found out about the incident with the Soviet sub\nAnd the man who save the world that silly ...\nAnd that made it while because we were a large ship as well I think it was the ... was it not that was targeted had the uh uh Eric hop agreed to launch a with the other two officers that that uh fourteen I think too much on a torpedo missile\nWill you were really you know you had some serious work in front of you so maybe you didn't have time to sort of think or feel but do you remember anything about how you found to mean\nYeah I I thought maybe it was a I I was Nineteen I didn't think I live to see my twentieth birthday is that's how it was\nA and we knew how to answer was and you know we uh well ... thank goodness for Kennedy and crew chef a and thank God for the man who save the world I I think a good friend of mine was going to name was first born first born or the silly\n[laughter] during the Cold War I don't know how that would have gone over but at the center will have a fantastic to hear from you thank you so much for that call 'em in the main thing\nWill comment that he may not have seen his twentieth birthday is correct because had we done the invasion and he just confirmed that he was loading\nHis ship with Marines uh they would have been met by tactical nuclear weapons on the ground in Cuba we didn't know\nThat the Soviets that also delivered battlefield nuclear weapons but they had cruise missiles they had the all the battlefield nuclear weapons so it would not have been this easy in Beijing at all we would have lost a lot\nOf men nuts more lessons from our listeners Denison conquered emailed to say I was an active duty marine Nineteen fifty eight to sixty to serve the last two years in Hawaii\nA upon arrival to my parents' home in Brooklyn I literally sat on my the bag watching President Kennedy on TV I thought for sure that I was going to be called back in I started to receive post", "show_name": "The Exchange (NHPR)", "year": "2018", "city": "Keene", "day": "08"}