{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n\n\n\n\nThe simple symphony by Benjamin Britten\nMembers of the things virtual she gave that concert at St Paul's by to see if his ... church in Jacksonville Beach Florida a performance presented by the beach is fine arts series\nThis thing's virtue well see that's a group of top alumni from the annual ... competition in Detroit's an event for young black and Latino strength players\nAre the things that are now accepting applications for there to thousands Seventeen competition coming up in Detroit in February the application deadline is November seventh black and Latino strength flares up to age thirty are eligible look up sinks music for details\nI was glad to hear your thoughts about anything you hear on our show and there are lots of ways to get in touch you can write to us by clicking the contact\nBut not on the PTA home page at your classical dot org or call the PG listen to a lot of good old fashioned phone message eight six six nine four three forty four fifty that's eight six six nine for three four four five zero\nI'm Fred Child this is performance today from eight PM American public media\n\nDid stole drive time on in the sink radio your financial support helps keep and be be programs on the air and\nIt helps support local pet shelters across the state why would you become a mirror because you're supporting stations to provide in depth coverage throughout the day\nAlso we produce local programs that focus on topics relevant to Mississippians call eight eight page three Seventy to give up or go on line ... online dot\nThe stations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W there's two occasions to dance in the hour ahead\nOne is an adaptation of an old story about Russian prince ... guy yeah I Believe I said that right but probably not this put concerns prince ego or a key um [noise]\nAnd the effort to drive the turkey people's planes ... didn't actually finished the work but thankfully he did complete the philosophy and dances that's intended [noise]\nAnd then later on in the hour you'll hear what ... considered like music starts off with a little bit of jazz at least what justice ... jazz was [noise]\nAnd then the rest taken from his ballet down the street [noise]\n\nThis is one of the colonel Nielsen from his when queen tap the second movements with the Bergen when quintet\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise]\nAnd\nUh we're in\n\n\n[noise]\n\n\n\n... that's ... ... conducting so familiar orchestra\n[noise]\n", "year": "2018", "show_name": "Marketplace", "city": "Jackson", "day": "25"}