{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n[noise]\n\n\nThe simple symphony five Benjamin Britten\nMembers of the things virtual she gave that concert at St Paul's by the sea Episcopal Church in Jacksonville Beach Florida a performance presented by the beach is fine arts series\nThis thinks virtue well see that's a group of top alumni from the end of all things competition and Detroit's an event for young black and Latino strength players are the things that are now accepting applications for there to thousands Seventeen competition coming up in Detroit in February\nThe application deadline is November seventh black and Latino strength flares up to age thirty are eligible look up things music for details\nI was glad to hear your thoughts about anything you hear on our show and there are lots of ways to get in touch you can write to us by clicking the contact\nButton on the ... home page at your classical dot org or call the PG listener line leave us a good old fashioned phone message eight six six nine four three forty four fifty that's eight six six nine for three four four five zero\nI'm Fred Child this is performance today from eight PM American public media\nA great orchestrating full flight is the most amazing thing and simply can't let you experienced that thrill every week Hi this is Brian new house we touchdown and terrific corpus for towns Boston to San Francisco and get the best of Europe and Asia all captured my encounter sympathy\nFrom American public media Sunday Morning at ten on MTV music radio\nStations have been P. B. music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. U. Butte there'll be incredibly easy to be distracted these days isn't it [noise]\nWhen your cell phone buzzing with text alerts your computer with an endless stream of email notifications even someone in the house needing you were right when your hands are full do you ever stop and ask yourself how am I supposed to get anything done [noise]\nMakes you wonder if that's one of the ...\nMy friend Schubert left behind so many unfinished composition distraction in the midst of the busy life\nStay with me for an unfinished string quartet by Schubert it's coming up\n\nIn addition to that music by French ... there's also some music by John Williams a head and a famous mature by two Seventy Seventy but next it's my favorite deal leads to a court of appeals with Norman del mar in the ... [noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\nNo\n\nNo\n[noise] [noise]\n[noise]\n\nThe Academy of St Martin in the fields that's Murray pariah conducting from the piano keyboard concerto number three by Johann Sebastian Bach\nSo where were you on ... may twenty first Nineteen eighty that's the day the much anticipated empire strikes back released in theaters\nI was in line with my brother waiting for some tickets that we were never able to get for that night but better luck was had the score the next day's matinee along with a whole packed theater as fans that got goose bumps right from the Bruce notes up this march [noise]\n", "show_name": "Marketplace", "year": "2018", "city": "Jackson", "day": "04"}