{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n\n\n\n\n\n\nThe simple symphony five Benjamin Britten\nMembers of the things virtual she gave that concert at St Paul's by the sea Episcopal Church in Jacksonville Beach Florida a performance presented by the beach is fine arts series\nThis thinks virtue well see that's a group of top alumni from the end of all things competition in Detroit's an event for young black and Latino strength players are the things that are now accepting applications for there to thousands Seventeen competition coming up in Detroit in February\nThe application deadline is November seventh black and Latino strength flares up to age thirty are eligible look up things music for details [noise]\nI was glad to hear your thoughts about anything you hear on our show and there are lots of ways to get in touch you can write to us by clicking the contact\nBut not on the PTA home page at your classical dot org or call the PG listener line leave us a good old fashioned phone message eight six six nine four three forty four fifty that's eight six six nine for three four four five\nZero I'm Fred Child this is performance today from eight PM American public media\nA great orchestra in full flight is the most amazing thing and simply can't let you experienced that thrill every week Hi this is Brian new house we touchdown and terrific corpus for towns from Boston to San Francisco and get the best of Europe and Asia\nAll captured my encounter sympathy from American public media Sunday Morning at ten on MTV music radio\nStations have been Bebe music radio R. W. M. A. H. Biloxi WMA boondoggle W. M. A. you\nWith everything that you have to do throughout the course of the day it can be tough to find a spare moment for yourself [noise]\nAnd Lars Erik Larson certainly understood that issue he had an incredibly busy life between composition education and\nYou might be familiar with the old saying he has his fingers in a lot of different pots but also a Rolling Stone gathers no moss because even when it came\nTo just one portion of his life like composing Larson never stayed with one style of music for very long and easily transition from one style to another great example of his skills coming up in about a half hour it's hours of the day [noise]\n\nThis hour starts with ... trumpet sonata for seven Mrs still harmonious orchestra John Wallace playing the trumpet\n[noise]\n[noise]\n[noise]\n\nThe ... march from cigarette your so far that's by a bird Greek with Eugene Normandy conducting the Philadelphia Orchestra\n\n\n[noise]\n\nAre you busy finding that there aren't enough hours of the day Lars Erik Larson has a possible remedy for ... hours a day with the mountainous symphony orchestra it's about three minutes away right after reverse number eight I'm traditional music with the Danish string quartet\n\n[laughter] [noise]\n\n\n", "year": "2018", "show_name": "Marketplace", "city": "Jackson", "day": "18"}