{"month": "10", "state": "MS", "station": "WMPN", "content": "An anticipating the next betrayal and worrying about whether my poor middle aged body which is the Syrian scars will turn you on again I cannot stand feeling sorry for myself I cannot stand feeling like a victim I Can't\nStand hoping against hope I can't say I'm sitting here with all this rage\nTurning to her and then two years and I can't stand not talking\nI looked at the pie sitting right there in front of me and suddenly began to drop [noise] they were talking about the state department now\nIf I throw this pie at him I thought to myself he\nWill never love me\nAnd it hit me with shimmering clarity that he doesn't love me [laughter] [noise]\nThat's all there was too it it it didn't matter if he was crazy it didn't matter if I was innocent or guilty nothing mattered except that she\nDidn't love me if I throw this pie at him he will never\nLove me but he doesn't love me anyway so I can throw the pie if I Want to I picked up the pie thank God for the linoleum floor [noise]\nAnd threw it\nIt landed mostly on the right side of marks face but that was good enough\nThe cream in the line feeling clung to his beard and his nose in his eyelashes and pieces of crust dropped onto his blazer\nI started to laugh at the market started to laugh too [noise] I must say he handled it really well\nHe laugh as if all those were part of a running joke that we'd forgotten to lead Betty and Dimitri on\n[noise] he wiped himself off stood up so did I he said\nI think it's time for us to go home I turned to Betty Who was staring why died at the two of us by the way I said I'm not coming to the dance and we went home [noise]\n\nThat was Joan Allen is dead too writes reading an excerpt from Nora Ephron heartburn\nI'm Robert Sean Leonard\nHaven't you always wanted to throw a pie\nThanks for joining me for selected shorts\nMm Mm [noise] [noise]\nSelected shorts has produced by Jennifer Brennan our radio producer is Sarah ... Matthew love bizarre literary consulted the readings are recorded by miles be Smith [noise]\nOur programs presented at the Getty centered in Los Angeles or recorded by Phil Richards\nOur hosts are recorded Argo studios in New York City are mixed engineer is Debra do treat her the music is David Peterson's that's the deal performed by the ... Peterson group selected shorts supported by the ... foundation sponsor of the re award for the short story\nAnd hurting Mifflin hardcore publisher of the best American short stories edited in two thousand Eighteen by rocks on gay\nSupport has also provided by the Schubert foundation the ... foundation the William H ... foundation the seedlings foundation the fan Fox and Leslie are Samuels foundation\nThe Henry mia ... foundation\nThe Sherman foundation the X. how and foundation and the Joseph in June Komen Foundation for the arts select insurance to knowledge and the general support of Jonathan Peter English\nSelected shorts has also made possible by the national endowment for the arts and with public funds from the New York state council on the arts with a supportive governor Andrew Cuomo and the New York state legislature\nThe bars dot com is a proud sponsor selected shorts Jay bars dot com delivers New York original toasting bagels golfing smoked salmon vodka and more throughout the fifty states Puerto Rico and the Virgin Islands visit them on the Web at ... dot com slash shorts\nAdditional support for this program comes from the station and public radio international stations nationwide [noise]\nSelected shorts is produced by symphonies space and distributed by NPR I look radio international [noise]\n[noise]\n[noise]\nAn evening in Jazz Can be just went the doctor ordered take the great Ella culturing Dinah miles and miles [noise]\nNicknamed the contemporary giant flight ensure\nBreed more crime Malone and then send joined me married Michelle but don't you Jay as he evening than seven to ten we\nOnly NPT me music radio on the [noise]\nThe stations have been ... music radio R. W. M. A. H. Biloxi W. M A boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen online at ... be online dot O. R. G.\n[noise]\nMost of them do after your host mark ... Monday troop was true renaissance man at the twentieth century singer and actor a jazz pianist a skilled songwriter and and all around kind gentleman this week on the program in honor of troops in ...\nI look back on the musical side of his career and songs he wrote\nIncluding route sixty six baby baby on the time and just the way I Am [noise] linger them performed by troop himself is equally famous wife Julie London and other well known singers like Tony Bennett and Nat King Cole and get your kicks like Bobby true coming up next on after glow [noise]\n\n\nListen while I tell you about a gal named daisy when\nThey called her lazy days in\nHer Ayman life specifically was if there are bills too so [noise]\nDon't ever change the rules\nDo do do do share out of them are still arguments and largest strong though she has to sing this song aid daddy and\nI Want to die in the\nYou want to get the best for me\nWore ... alone who's with\nUs labels daddy\nWalk in the bathroom they\nUse them Mason revelations with\nStimulation [noise]\nI'd be strange sensation are being you'll know inspiration daddy's in\nA new car sham\nIf you will not get the best for me [noise]\n\nMile per se you bought a shocking you sell my Christmas stocking ... next\nHe's the chairman of mourning gloomy down\nI Want a brand new car champagne caviar\nGallup new Meg the coup Flagstaff, Arizona don't forget when all that it's being when a lot of land Bernardino while you\nGet him to the pound leads him when you lead the fat cat last trip again as you keep those\nUnder ... of these these things\nBut\n\n\n[noise]\n[noise]\n\nOh gee ... go to these time leadership that when you may or may not have the last minute she\nSays you can't go on these things but then again in June key posts on these things\nBegin to kids on the sink\n\n\n\n\n\n\nOnce I had again a sweetie she'd be once I had a game and she was right to me\nHow this hand in hand I Am so\nSoft in ... that you couldn't have put care when she looked at it you know she called me baby\nAmy Tan [noise]\nShe said Bain care to see my baby to stay in\nBaby over me why she ate\nMy head but I\nWas too we wouldn't let me\nPush too far away the\nNIH wishing I could hear had called me they\n\nMaybe one of the tank and\n[noise]\n\n\n\n\n\nIt's so lonely through that they learned it\nMay\nLower ... that and I have to pay\nFor lord I pray that you would listen to my please\nKeep close to you so she will come back to me and call me they\nThe baby on the ...\n\n... maybe\nA ... I'm\n\n\n\nNat King Cole and the king called trio in Nineteen forty six performing too early songs by Bobby troop baby baby all the time and the now classic get your kicks on route sixty six [noise]\nRoot sixty six became Bobby troops meal ticket and throughout the rest of the Nineteen forties fifties and sixties you continue to write songs both as a primary songwriter and the leadership\nAround this time troop also made a name for himself not just as a songwriter but also a jazz pianist and senior his easy going style was modeled after Nat King Cole style but troop was nowhere near as talented or successful as the king called trio\nNevertheless he had a minor career in the Nineteen fifties performing jazz standards and songs that he himself wrote let's hear a few Bobby troop originals performed by the man himself first here's Bobby troop with his original song to greet me [noise]\nDo ... you'll find out unfortunately I don't blame the the ... on your\nYour own\nHad a gambling I ...\nI had a gallon but I have no domain\nSo she said they find the nearest trees is\nThe richest French as I can\nPockets stuffed just full of do they make\nIt she's saying baby please come\n... lately you'll find now unfortunately I don't blame me all respects\nJacksonville mainly do lately even own land journals and see\nYou'll find out on ... hundred dollar bills are certified ... me\nHomeland you only see one side was broken I could find\nThen once I was ... I could find for\nKnow but it can't just film on my\nNow the tables turned the other way\nNow than I got the cash with which the same\nI find that at least a thousand friends\nDo raise the dome lately\nFortunate leverage does rain means that all respect for the dollar bills are certified checks though they may do\n\n\nMm\n\nThe gal by the name of hiding who was just as lazy as she can be\n... kale longest line no friday is so doggone crazy is the main\nGot I saw drew the as Trump was girl I\nMy female\nBody ...\nBy St Bernard\nThis physician sweet land [noise]\nCocker spaniel is give her the officer\nWho stops traffic on the bowling ball ...\nMom said Bernanke\nLand so right\nOn man best friends most girls you meet Thursday night\nGone by friday\nBut not hot\nHer paws are much too big for those\nWas my first little Scotland Yard ...\nMoscow St Bernard ... [noise]\n\n", "year": "2018", "show_name": "Marketplace", "city": "Jackson", "day": "09"}