{"month": "10", "state": "FL", "station": "WJCT", "content": "...\n\nA a\nA\n[noise]\n\n[noise]\nAnd now it's time to take a look at a community court for based forty to present and the street artist Elena on that or give it open timber twenty seven and run November Eighteen Alina lander illustrator Peter\nCurrently working in Jacksonville, Florida she painter BFA photography she doesn't fourteen demeanor work National Gallery NBC or her focus illustration that explore devotee\nGeneration space individuality and\nPop culture the Japanese contact\nThe more information W. W. W. dot based forty to forty two spelled out at the\nWords dot com slash event trash Alina dash old after a Norman studious jumped on the euro the present day film festival\nJak supposed a rich history the motion picture industry come join Sunday October stepping up two pm to fight with Norman Studios down the museum present applying it black and white film an all African American cat\n... session with enormous studio to follow the show ... veteran World War one by the ... the church of a war hero immunity against his former job they're railroad company to attack the first case coverage still with satchel they'll do twenty five thousand dollars can be a role locating missing employee and capture again\nNo real but the event again will be on Sunday October seventh two pm to buy PM jak markets base thrill three north Lawrence you're on Saturday October stick at Sunday October step in\nYou seem a science and history of on the name of science history present the spectacle like nothing Jacksonville and never see joined us from New York based trio rushing to special guest Jamie staffed\nPerforming live and Brian good in planetary\nCondition to the audio concert jak slow paced artist agreeable to William as junior and Joseph adventure\nWill create custom graphics animation utilizing ... hundred and sixty degree don't projector Saturday's event starts at eight pm Sunday five PM tickets we found\nIn China for tax dot com L O L jak film festival present L O L jak zombie film festival event takes place friday October nineteenth seven pm to ten pm Anheuser Busch tickets can be found at the corner brewery dot com opening October nineteenth and burning through October thirty\nFirst the vault and Nineteen thirty welcome locally and nationally recognized artists in Jacksonville resident princess Simpson machine to present her newest exhibit odyssey obstruction printed Simpson\nMachine there'll be a show opening cocktail reception on friday I covered Ninety\nFive thirty seven thirty the\nPublic are invited into requested she emailed them at ... at\nThe vault at that age the kind of symbol Nineteen thirty dot com on Thursday October twenty seven PM and friday October twenty six\nAnd seven pm why not theater in the Matheson history museum present Halloween moon rising and original new play by\nKelly said this immersive experience includes food and drink and takes place in different historic buildings at the math and history museum complex tickets are limited unavailable then bright dot com\nOh\nOh\nNo shit\nMan [noise] [noise] so do you\nDo go\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] ...\nThat you all for joining me this evening we'll talk to you next time it'll be like to reach out to his directly you can find us on Facebook and Twitter at\nCentral culture pod cast now [noise]\n[noise] Hi I'm Damian Lara joined me for taste test and tantalize your musical fences with the newest elections in urban pop culture have a taste every Sunday night a tent right here on eighty nine\n[noise]\nYou're listening to eighty nine nine ... Jackson town definitely Jaycee he got word for information on our program are scheduled pan news from [noise]\nFrom now until by they the stations have W. J. C. T. will conduct however ... eighty nine Ninety I\nFound the WTC T digital channels and the antenna broadcast and W. J. C. T. channel seven will be off the air but cable broadcast of TV should not be affected thank you for your patients W. J. C. T. Jackson\n[noise]\n[noise] [noise] when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that\nSome of which have been collected in a new book on the next fresh air we talk with his son Adam Cohen who wrote the introduction and I'm also produced you want it darker the album his father recorded shortly before his death joined\nWeekdays at noon on eighty nine nine W. J. C. P. your community your world\nNews and information all day music at night and intelligent funds for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life\n\nI never knew\nWould you change in my way\nDown and look at that\n\n[noise]\n\nDa\n\nNa na na na na na na na na na ... near I'm like yo la la la la la land on the tree don't quenches your plane\nLove la la la la la de said to\nI hear you fine little log in line\n\nThough lemon trees my love ...\nWrenches smile Don rose and then\nWe passed started some a lot of them\nKnow Latin on training\nThe music Garber law\nDid not go the wrong way\nShe let me read more about the\nA ... lot wiser now I sing leaves were to give you\nI'm dreaming\n\nOr [noise]\n\n[noise]\n\n\n\n\n\nCheese model all over\n\nOh no\n...\nO\nEarners man from all\nK O\n\nOh no no\nNo no no no\nYou know well I Will man man\nWhoa whoa whoa\nI don't know I'm a no\nWin no mom I'm Still\nAh the\nAnd in a\nWhile though those are\nAll\nA lot about oh ... well I don't know about about a\nLittle dog ... a ... well\nYou saw a man I knew\nOh man do local man do you\nWell the dog oh\nSo ... you\nMy dog was Bob ... a big\nNow about uh oh well but the right now when I got\nA sister in law ... ... ... ... a man\nOh man to\nDrew on well\nWhile there's no doubt there oh\n\n\nNa\nNa na\nNa\n\n\nNa na\nNa na\n\nWritten\n\nVery oh ...\nJoe ...\nGod and I\nWere to do a thorough\n\nA\nLong term [noise]\nI didn't really know\nWhoa whoa God God\nI don't know how to\n\n\nThe music of your life you're listening to relax radio on the on eighty nine\nThan W. J. P. T. your community your world\n...\n\nI Wonder what\n[noise]\n\nThe young love\nAnd marriage\nIt's and it's the ... you can just\nDay drinking tend they when they said I'm not\nTrying to try\nAnd you know when you come\nTo this conclusion love\n\nTo rain fan and\nDo this conclusion love\nAnd marriage just love\nMarriage is do\nWithout the\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\nOh\n\n\n\n\nUm [noise]\nUh oh oh oh\n\n[noise]\nOh oh oh\nOh\nOh oh\n\n\n\n[noise]\nYou're listening to relax radio and eighty nine nine ... W. J. C. T. H. T. three Jacksonville, Florida\nMORNING EDITION is awake around the clock to bring you the latest news it's two ten in the morning to justify that was the host we usually hear around three thirty four and it's about the Boko Haram ISIS news over the weekend for Iran to five when the show starts hated open\nUp every morning goes up all night to bring you all you need to know Lincoln every weekday weekday mornings starting at five one eighty nine nine\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nKnow\n\n\n[noise]\nThe ...\nTo call in and day\nThey first your ...\n\nIt's high to wind\n...\nJobs may ... my ...\nPie ...\nThe pay\nThe ...\nWas let go and\nYou can stand dream through the\nIt seemed to be right ... ... jobs being with him\n... up\nAll the dreams\nJay ... make a\nA ...\n...\n...\nIt's time to call it a day\n\n\n... ... oh\nDream was my then\n... ... make a\nLot is ... oh\nA ...\n... ...\n[noise]\n[noise]\n\nWell\nMy eyes but a long long term\nIs Spanish all alone no\n\nOut but he used to\n\nBall you know that's just I Am saying\nTeenager\nA way down here [noise]\nWe\nPlay a game do\nI feel my\nBaby Jane\nThe\n\n\n\nI wanted to do around in ... for some ... who\nGood may may be true\nOr you make me being\nOr a big lead in\nKnow the sting\nMy ... or ... bars but they wouldn't do\nWell nobody\nWhether you're bomb\nTo be you wonderful\nIt has to be you\n\n\n\n\n\nThey they won't give me a\nCall ...\nCar you know\nYou know you're being a burden that\nA rabbit and they are known to\nMan they weren't\n\nThey ask you to\nTo your God\nHuh ... like\nThey want to see 'em\nCalling on when\nI mean a lot of\nThey were um\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise] [noise] [laughter]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\nYou're listening to relax radio W. J. C. T. eighty nine nine each three Jacksonville we play the music of your life twenty four hours a day to support your music station please call three five three Ninety five to eight\n\n... for me [noise]\nThey know about a a good job\nOf right now\nLearned my lesson\nWhy is it do\n... ... a ringing a bell\nYou gotta play guarding guarding\nBeing a wish you a lot of love\nPlease everybody was\nAll right down\n... ... ... well\n[noise]\n\nThe the man who\nWill not\nNon on one mom in a man\nA man in the garden\nAll\nYear long lead\nBe\nThe only a G\n... bulldozer ...\nYoung man when they when a dream a\nKing\nYou know\nI'm\n\nStill a oh\nMan Mm\nI mean the the movies\nToo\nAnd\nI was on and on the plane name a\nHe's a jungle one name and what went wrong and\nYoung man in your own a gang\nLonely too early\nTo me oh\nOh\nOh\n\n\n\n\nOh the oh won it in one when my\nYoung man in the ... you know\n\nThe\n\n\nYou're listening to relax radio in eighty nine nine ... W. J. C. T. H. D. tree Jacksonville, Florida\n[noise] first coach connects brings you voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and you want to president John Delaney\nThis is just a terrific program that's really ... make sure what you do and what what station does\nI'm militia rod it probably did with first coast connect every weekday morning at nine and a rebroadcast here every night at eight pm on eighty nine nine Chevy Chase the the\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us than playing the music of your life\nHave much my music after the news from NPR's\n\nI forget to do\n... oh\nThat every one on to do\nLonging he is\nI see your say\nYour overall I\n\n[noise]\n\nDo the\nLonging he is\nThe moment so go\nTo I'm new to you\nSee your cheese\nYour ...\nIt's just those are the ...\n...\n\n\nWhat else do you do but it\nGet the genes that\nStarts with um you know do I read the ...\n... ... they\n\nThe job and you\nBall ...\nMold when\nYou look at your breakfast rum look dude it was a little\nJ. when you go down but laugh\nBanks joke in the article\nBeaches to devise call\nRely on local\nJones all your young black in your trunk\nLaw about their book\nSuch a\nThe beaches there buys Raul fluids\nThe\nJoe ... Joe ...\nBall no new ... the\n... the last you can see all the\nVenue go to the late ... oh you guys\nBut when you wake up\nYour job\n[noise]\n[noise]\nDay but I miss my mom\nNow did they try and do\n\nRelaxing music twenty four hours a day on W. J. C. T. eighty nine nine ... an HD three Jacksonville to support this service called three five three nine five to eight or visit W. J. C. T. dot org and click support\n\n\nThink my\n[noise] to\nAnd you can\nTo be\nOn the\n[noise]\n\nThe ... ... no she means [noise]\nBe the uh\n[noise]\n\n[noise]\nBe the [noise]\nPie [noise]\n\nI Wonder\n[noise]\nNo I'm leaving\nHe\nYeah\n\nNo\nNo\n\nYeah no no\n\nSleet or you\nKnow bring\nMe\nDa da\nMm\n\nMm\nMm\n\nMm Mm\nDe la\n\nRoom and they do\n\nKnow spring\n\nThen\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\nLow and all that oh\nBelieve that there are ... by\n\nWe\n[laughter]\nMhm mhm mhm\nPutting another day now and then I got me saying okay\nWhat they were saying he's not sure they know\nA day and then the call borrowed my dream may\nSurrounded by friends and um you know\nLike me then that he will never know [noise]\nIn where we began our\nThe\nAnti man can see that our time can\nLove can be managed to each way and a girl and you know\nToning down about you don't know what I'm saying\nYou know trying to get you know I'm gang\nMany law they run\nNext thing you got me\nBecause I only\nSee maybe you\nThe little\nMain\n\n[noise]\n\n\n\n\n\nYou're listening to relax radio I'm eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida oh\nEvery day NPR's all things considered include new that keeps you a head of the curve if this issue is not important enough for us to draw a line of the than what issue is what the unexpected\nWinning the skin and that the hard you making chicken meatballs and cooking the knee cartilage\nAll things considered from NPR News\nWeekday afternoon for forty six and eighty nine nine W. J. C. to your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\n[noise]\n\nYeah\nAs a\nOh oh\nMy ... oh\n\nWhoa whoa\nWhoa whoa whoa whoa\nMay have\nOh my\n\nOh\nWell\n\n\n\nOh you need\n\nA barrel grounds\nBig airline my idol Bob ... hang it up into the ring around the\nMe to\nAnd the world to know what\nIf we can talk about what I Want to see\nMan that taught me you know\nWe\nCome back to\nMe\n\nHe\n\n\n\n[noise]\n... three months you know\nI mean you have to\nMan\n\nO\nO O you\n[noise] do you say hey\n\nThe show\nMan\nA\n\nO\nAh ah\nA\n\nRelaxing music twenty four hours a day I'm W. J. C. T. eighty nine Ninety ... three to support this music service call three five three nine five to eight or visit to the Jaycee T that'll work\n\nDefine come\n\nKnow the\nYour name than you were you know we\nVary in mind maybe you don't find\nThe new you become\n[laughter]\nMhm\nShe she\nHe\nDoes\nHe\nThe gym\nPlanet the issue of that one you only each night than they\n\n[noise]\nAnd a\nCat in the name is Janine\nJanine Janine and\nMean the men and I see you\nYou have\nMoney advantage even really that David\nOr not you know what was that they do\nMean and see how\nDi da da da\nNa\nDuring the last\n\n\n\nSeries\n\n\nPlaying the music of your life you're listening to relax radio on the on eighty nine nine of\nYour community your world\nRelax and kick your shoes\nOff ... ... s\nWho we owe real what is\nIt the ...\n... for good we're no no hold them or let loose\nJoe ... is a dumb holding on water and\n\n... from coal to stop or\nVery\nWhile\nTo know\nWas a low minimum laws\nDo you go largely\nGoes north coast ...\nI'm going to bring home all\nIn a lot of work for\nOr ... or reading learning\nDo frogs\n... ...\n\n\nOh yeah and we're going to be in good shape good or bad we are [laughter] rock band [laughter]\nAll right so far no\nI'm saying that in France when they thrilled to match\nIt means that it's going\nTo have\nYou\nPeople who do we make our own so\nEvery word every time every\nDay a man who\nOnly one\nThat is\nDoes nothing else can we just your slightly above and if you only well uh\nMy own for the rest of my day I Will respond\nWith this uh ...\nUh\nSay the bone [noise]\nWay and they already knew who I Am [noise]\nIt means that it's\nNo good\nAnswer the phone\nPeople\nBig guys but they do every\nEvery since\nReally\nDo one on\nLA or how they\nDo [noise]\nLove then out can read my\nJob a lot and then bring if you are\n\nNot\n\nMy daughter thanks to both\nOf 'em [noise]\nChange people don't talk to you know pop to who we are cool you got a very feeble and see ...\nReading forgive me I can I Love this faction for\nYou dream about the world out from behind bars the stadium\nAnd no one seems to understand about the Harding the man to you\nBoth plans there\nBut nobody seems to care [noise]\nDon't same rights you know\nIt just don't ...\nNo no no no no no no not read the news or Tom are\nYou still don't really\n\n\n\n[noise]\n[noise]\n...\nAnd ...\n\n\nYeah ...\n...\n...\n... [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\nYou're listening to relax radio at eighty nine nine ... W. J. C. T. H. T. three Jacksonville, Florida\nEvery day on MORNING edition it's ... It's MORNING we'd been looking at what's happening\nOr conservatism libertarianism in environmental as my religion\nWere not props were just everyday people look out the joy this is a start [noise]\nListened to the next MORNING EDITION from NPR News\nWeekday mornings beginning at five or eighty nine died W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent fun for your weekend this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\n... you're listening to relax radio on eighty nine nine\nPlaying the music of your life\nWill have much my music after the news from NPR's\nMm sue ...\nOh\nOh\n\n\n\n\nOh\nOh oh I'm\n... I'm\nMan hero a\nFamily you know\nI'm\n\n\n...\nWhoa whoa whoa\nWhoa whoa I'm a grandma\nOh man oh man I married um\nOh\nOh\n...\nMan oh\nYou're\nOh ...\n[noise]\nA long\nA\nA ... a\nI'm In a\nVery good with their way\nWell um\nNa\nI'm\nReally not the\nUh uh and\nUh uh uh\nUh no I'm\nA\nA I'm a ... oh my ...\n[laughter]\nYou know\nMuch about the man is\nRaised\nBy a car that's fine\nThe ball by\nTo let this issue [laughter]\nYes well that's what\nIt's just been you know [noise]\n\n\nLot of us who do that [laughter]\nYes what do\nBombed by a\n\n[noise]\n\nHe was\nWas just something dollars but now she has\nThe main\nWell\nI just\nHe\n\n[noise]\n\nGod does fail in the early man to Paul in Brandon\nI'm not into that [laughter] and that's\nWhy I won't say\nWhy should I\nAsk how could I I don't miss the book\nI Know that near the lead the way they need to know my\nFellow man who do you in [noise]\nWhen you hear him\nWhat you do the ... and then we'll\nDie than I Am a guy in\n\n[noise]\n[noise]\n[noise]\nUm ...\n... ... ...\n\n...\n\n\nAt all\n\n\n\nA\nA lot\n[noise]\nJust thing\nWould it go read the\nThe some in my home\nThe snow make\n... with\nUm my name is\nThe screen\nCash thing and\n\nYou know make climate change them every one\nNames come on with that\n\nThing but our\nMain with ah the screen\nAnd I'm just saying I'm\nSaying\n\n\nMy", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "07"}