{"month": "10", "state": "FL", "station": "WJCT", "content": "\nYou've been listening to on radio and W. J. C. P. eighty nine nine so I've been your host Keith mark or engineer with fingers like for Michael guitars ... or your every Sunday\nEvening bringing new godfather fried show was allowed to buy and sell about showing ... areas\nOne voter in a poor kids hockey county says she is doing well under President Trump wants you to those still in poverty should force their way out\nOf time people are just hung up on the heels just 'cause I Do work training for\nVote in November could help determine control of the house of use the term for three quarters of the Kentucky districts above the next MORNING EDITION tomorrow starting at five eighty nine nine W Jaycee your community your world\nElectrical outages now wants modify on the road or at home just wherever you go just search W. J. C. T. eighty nine point nine that's sponsored by the electoral law which is always\n\n\n\n\n\n\n\nEating at the chief Jackson down your community your clear alone six seven or friday sunny a high near eighty five weekend sunshine I mean\nI'm a writer and your art\nMuseum of art is movies including for me though and hairspray\nI always like the ... I Love to stop the welfare lots of where where or when all my movies released there is no such thing as perfect the origin there we're\nJoined now on the\n\nNews and information all day music at night and intelligence funds for your weekend this is easy nine nine WG CTX them Jacksonville your community your world listen anywhere W. J. C. T. news dot org\nYou're listening to relax rainy on nine\nAnd music and the airline\nCry\nIt must be you\n\n\n\n\nCan be\nAnd\n\n\n\n\nAnd and and\n\n\nAnd and and and\n\n\n\n\n\n\n\n\nMe\n\n\n\n\n[noise] [noise]\n\nThat's the job well come on me and asked\nThat it changed only again anyway challenging yet come on you and happy and\nThey bought a judgment day\nHis way to take your hands\nAnd say come on yet\nYou know\nOn any\nJob will come on get heavy\nChange all your kids away John Allen Louis oh come on yet have\nSaid\nThe all the juggling day\nThe way it would take your hand they\nWay yeah\n\nThe ball yard now come on get in a way to come on the judgment day\nYour\nOnly\nWay\nThat\n\n\n\n\n... ... ...\n\nTo\n\nWho\nWho\nTo\n\n[noise]\n\n[noise]\n\nOh I Hope\n\n[noise]\n[noise]\nUm\nWhat\nI remember I remember [noise]\nThat's\nThe job and she was she\nAnd I'm I'm a no I'm In\nA\n\n\n\nThe truth\nHave any\n\n\nMaybe\nMaybe\n\nRelax radio is your overnight music service brought to you by W. J. T. T. eighty nine nine cents your community your world\nIn terms of the\nAll all\n\nAll\n\n[noise]\n\n\n\nMedia traveling\nCountry\nWell in\n\nRemain calm I mean\nI Do want to sit down\nShe was one\nA true news of the nine\nPeople we\nUrge to engage a\nAll do to reduce\nThe bore me\nSaying and I'm\n... I remember\n...\nNo I'm\nNot really\nThe the ball me Eugene ...\nTo me when\nThis huge threat\nBut\nMan oh\nOn the\nAs well\nKnow\n[noise]\nReally when you\n\nReally need\nShe was\nToo low oh that\n\n\nWas\n\n\n[noise] Mm\nMm Mm\n\nOut how you can lead to relax radio twenty four hours a day that W. J. T. dot org slash relax [noise] there's a lifetime of music awaiting you can relax radio tuned in to the music of your life\nMORNING EDITION is awake around the clock to bring you the latest news it's two ten in the morning so to five hours left to host you usually hear around three thirty four and it's about the Boko Haram ISIS news over the weekend show for Iran to five when the show starts to open\nUp every morning it'll show up all night to bring you all you need to know Lincoln every weekday weekday mornings starting at five or eighty nine nine\nBroadcasting from Florida palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nI got 'em man or a more\nFor\nFor\n\n[noise]\n[noise]\nOh\nNo\nNo\n\n\n\nOh no\nMy thing should should keep\nKnow\n\n[noise] and\nI\nMean\nMy thing should should keep on\nNo\nNo and\nKnow\nThat [noise]\n\n[noise] yeah\nWell it's long serving in this zone town every dawn that in order to me that I'm a ... dog in ... I'm going back to their\nThe whole then and all the shoe\nWalk through the\nSaw doll um\nYesterday\nWhen ... when we go back to the news\nKnow any man I'm ...\nA well gosh we\nOr ... years ...\n\nGoing back to the Irish\nAnd buy a good thing here is ...\n... ...\n... ... I'm afraid we're out in yes we're all here in Moore known by the\nYour own back ...\nRelax radio is your overnight music service brought to you by W. J. T. T. cleaning nine nine now than your community your world [noise]\n...\n...\n...\nOr the dog days are\nMy son anyone\nKnows when she\nGot a one of those ...\n\nAll the gun shy\nA\nIs gone\nNo\nA ...\n... Mm\n...\nMm\nMm\n\nMm [noise]\n\nOn the news comes now and then getting\nStranger during name do you think you're going to go to\nTo ...\n\n\n\nOregon to get rocking chair gotcha ... bomb us or\nYou're carrying by is God it's really not gyms\nNo James Bond and I'm going to try and you know we got a dad and my I\nI yeah believe it or [noise] what do you have a job in a while though\nI don't know where\nYou way going nowhere\nTo go with me here rabbit\nRabbit flies around the rockets yeah rock and Jim now\nMy new Madden hair is\nI Am carriers\nLong in the European and it'd be\nEveryone should be above the law and that sweet Jerry\nJerry or at the end of the road I\n... to ... get the rocking chair Bob in judgment day is New Jersey you would then yeah and I'm Jane and Jane ... and Jay\n\n\n\nThe [noise]\n\nWhen he no\nNo\n\n\n\n\nI mean he\nSay\nWe\nHave an ... and ...\nAnd he's low ... yeah\nWhen he saw then miles so generally\nThat word cannot act\nMy la la la la land on me\nLo o\nLo o lay lo o lay\n\nLo\nFor me [laughter] they're really not being more I can\nA national then later on\nThrilled that we're not\nA lot\nOf the law known as\nOh nothing\nReally ... the ... it\nThe low to me a\nThere is nothing more I can\nThere was nothing more I guess it is there\nThe bees [laughter]\n\n\n[noise]\n\n\n\nOh God I got a\nA a a\nGood morning a shy and\nKnow\nGood morning\nI'm not\nSaying a\nStaying in song\n\nAbout oh\n\nMe I I'm not getting\nA good morning ah\nI\nLive in Florida and\nI\nLive in a bank\n\nMe why\nOut I'm not saying Saddam [noise]\n\n[noise]\n\nJohn Donne bang\nBang a\n\nThe only thing you know\n\n\n\n\n\n\nKnow\n\nA\nRelax radio it here overnight music survey brought to you like ... ...\nFirst co connect spring view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and you and if president John Delaney this was just a terrific program that's really rejects no banks make sure what you do and what what station does I'm Alicia\nRod it probably did with first hooked connect every weekday morning at nine and we broadcast here every night at eight pm on eighty nine nine ...\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us than playing the music of your life will have much my music after the news from NPR's\nKnow I\nIs\nMan it is to\nAnd\nIn ... [noise]\n\n[noise]\nBob\n\n\n[noise]\n[noise]\n\nKid you\n\nOne and\n\nA\nOne in the\n...\n[noise]\n\nThat we\n\nSchool\nIn a way\n...\nTo\n\nIs\nLittle\nGood ah\nAh\nA a\nWeek\n[noise]\nI mean the ... law\nSimply because your ...\nFunny but when your ...\nI made the move ...\nIn your ... I knew right at the stars where um\nOh is it in a long\nLong the move\nOr why\nI don't know whether I don't know\nOr\nLike a\n... law are\n[noise]\n\nRemoved removing dreamer dream ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNa\n\n\n\n[noise]\n\n[noise] and [noise]\nDo you mainly\nIn Michigan where no\nMagic why then do wish him well\nWhy don't show\nYour heart from some\nDo you much dumb\nDumber one job die down you\nHe made an eye\nI run a boy in church email\nA lot I\nHad was the one that is how I'm\n\n\n\nUh keep an eye on very\nRound a knock on wagons you're\nKnow I was the one oh yeah I'm\n\n\nRelax radio it's your overnight music service brought to you by W. J. T. T. eighty nine nine\n... ... ... ... ...\nI'm the king then do you ever saw one and for some\nThe nation from Joe in\nNo interest me into it now\nClose your eyes engine please\nAll weekend one during the show\nDrink\n[noise] from\n\nNo no no we have to rely on and he\nFound out\nMe by now I don't know\nThis song found they found out they don't know they lay down down\nDown down\nWriter as for\nShe knows Joes\nCheese or\nI'm ...\n...\nLot of a person\nA ... of course you\nYou're on the phone\nMy ...\nHa ha ha ha\n\n\n[noise]\n\n\n\n[noise]\nMhm\nMhm mhm mhm\nMhm mhm [noise]\n\nRadio is your overnight music service rocky W. J. P. T. eighty nine nine us and your community your world [noise]\nEvery day NPR's all things considered includes news that keeps you a head of the curve if this issue is not poor enough for us to draw a line of the ... what issue is plus the unexpected\nWing the skin the neck the heart you're making chicken meatballs cooking the knee cartilage\nAll things considered from NPR News\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\n\n\n\n[noise]\n\n\nMan\nSaying you\nKnow right\n\n\n\n\nUm\nYou know\nYou know and\nAlong that\n\n\nDon't gym no\nRide on a day a new\nHousing I'm fine I'm Glenda damn John\nAny I'm Marlene name\nAnd then um\nYou know the man the\n\nDon and no I didn't\nOn the train like on the day a new\nHobby Don five hundred a lemon and John\nNew Orleans\nChanging jobs in\nIn a new Ronan no\nIt into bed\nDoing a an a and\nI\nDon't know me and you say\nOn a train like on a day yeah no I mean\nI'll be gone on when the day John\n\nOh oh oh oh\n\nYou got a ...\nWhen the New Yorker charge a new\nIn Baltimore law or do\nYou mean\nImagine a\nBeer or oh\nThe\nNo no\n\n\n...\nThe\nBill me along the although they do the job I\nKnow people say\nOn the border to Jay Jay\nAnd you're not\nAnd you're going\nDa de\nDe\n...\n\n\nI met Jim\nI oh\nI\n\n\nAway you know\nAnd\n\nUp in\nChange yeah he\nWell\nAnd then the o\nBetting me oh\nI'm In ...\nMan who would say oh\n\n\n\n\n\nLa\n\n\n\n\nNo you see real\nThey use in the Arctic\nWoman who we run in\n\nWho is no no\nI'm\nMuch too soon you\nMy bread\n\nNo\nA\n\n\nThe room\n\nJob the\nAh the name\nOf a cat and make\nWe have\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\nThey have [noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n[noise] relax radio is your overnight music service brought to you by Debbie Jaycee T eighty nine nine us\nAnd your community your world\nEvery day on MORNING edition it's the news you can't be ... It's MORNING we've been looking at what's happening or conservatism libertarianism environmental Islam religion were not props were just everyday people in the crowd visually this is a star [noise]\nListen to the next MORNING EDITION from NPR News\nWeekday mornings beginning at five one eighty nine dollars W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent fun for your weekend this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life\nWill have much my music after the new NPR\nOh okay so you know and I'm\nMm oh\nDr ...\n\n\nNah nah\nClose your ah the\nOf your head on my shoulder and sleep\nWell my goals are right\nThe one who is your uh and I\nDo um\nAnd\nBe a God who is your ah\nBuy a French\nNa\nNa na\nNa\nNa [noise]\n[laughter]\n[noise] I'm\nBig\nMan has\nSaying I\nThe touch a God oh\nWas your role in the new ... saw my\nLawn you close your right\nAh [laughter]\n[noise]\nYou know what ... ... ... who is the hard he can read\nOh was it was nice to you\nKnow how the lady and no oh no no\n\n\n\nI'm\nNot even\nOh\n\nNo I'm\n\nOn ...\n\nYeah that\n\n\n[noise]\nOh my yeah yeah oh\n...\nOh\n[noise]\nTrying to let them know and I mean do you think you have to meet you [noise]\nAsked people how can you do\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nDa da\n\nDa\nDa to you by W. J. T. T. eighty nine nine other than your community your world\n\n[noise]\n\n\nCool [noise]\n\n[noise]", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "12"}