{"month": "10", "state": "FL", "station": "WJCT", "content": "I'm thing holding\nMan and go do I keep\nTell me what\nAre good uh\nTry and find all day long but I mean reading um nah\nNah I'm\nMommy no we have no\nTalk about you know and\nThen running\nJew while\nYou're on a navy in\nNobody wants to be\nDoing you\nJust say good bye\nTrying to find out what are we waiting on na\nNa\nBought it go\nYou know\nTalk about I don't know\n\n\n\n\n\nAbout\nI'm thinking\nYou\n...\n[noise]\n\n[noise]\n[noise]\nTo do ...\n... is a little song Iowa you might wanna losing is ... good to\nBe happy and boom boom\nBoom boom boom\nNever live we have some ... to ... when you wherever you may get a little dog or whatever is going\nTo be happy in Boulder where it may have\nGoing nowhere really hadn't been\nMe\nDo where\nThey have them in the last leg of your hand in ... in your bag to go to a [noise]\n... [noise] rely\nOn the land the land to he may\nTo ... to ... going anywhere and go do\nAnd then we have a ... I mean I met\n\nDon't worry 'cause\nGive you my phone number when you're worried about me I Need to have\nPower where red\nIn the middle\nAnd got no cash ain't got no style\nThen got 'em all gather to make you smile ... reading\nThe book the B movie Bruce and\nThat and we'll bring everybody down so dominant whether it\nBe had and they know all the way they have been willing\nDog wherever they have a\nNew\nDog whereas\nDogs who are already happened\nYou know they're using the song I read I robot you learn the language of the children go to ...\nTo be happy to what I\nDid read your life\n... ... when you were meant job I'm going to have you been been be\n\n\nDog was already happening before the end of our show this week\nWas my favorite songs from the eighties none of it and Mr Bobby McFerrin with don't worry be happy\nA seal a song that applies today definitely a time to travel I really enjoy the show to sleep\nIf you're looking for tonight set list\nYou can find it on Twitter a taste test radio or W. J. C. T. dot org and this is a Myanmar until next week mayor weekly tasty and you're nice to be going to bring every\nDog wearing\nMuslim pattern whatever\n[noise]\n\nFootball is a big part of Texas culture and players protesting police brutality during the national anthem that's caused a big debate\nThe issue with the kneeling years that it's disrespectful to the men and women X or I have an\nIssue with him taken him in the knee is submissive he should stand with his fifth in their\nNational debate comes home to Texas or the next MORNING EDITION from NPR News tomorrow morning starting at five or eighty nine nine W. J. C. T. your community your world\nW ... creative innovative sessions for her teach conference on Saturday march second presenters have the opportunity to connect with educators from across the first ... proposals accepted until January fourth go to W. J. C. T. dot org slash teach\n\n... miles through Thursday high from the upper seventies to the mid eighties rain and thunderstorms friday high in the upper seventies 'cause he's ... the Jaycee Jacksonville your community your world\nFall is a big part of Texas culture and players protesting police brutality during the national anthem has caused a big debate\nThe issue with the kneeling yes that is disrespectful to the men and women and so I have an\nIssue with them and take her name the knee is submissive\nHe should stand with his fifth in there\nA national debate comes home to Texas or the next MORNING EDITION from NPR News tomorrow morning starting at five or eighty nine nine W. J. C. T. your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us\nPlaying the music of your life will have much my music ... the news from NPR's", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "31"}