{"month": "10", "state": "FL", "station": "WJCT", "content": "And damage and why not go play in the\nBody to China and they don't want to go out\nAnd\nBack on their own and get him talking to follow you you see\nKnow why\n\nOutlined upon me along\nThe gang up on the average time when I go\nActually got body on China and they\nBeen\n... mhm group stuff\nThey keep saying to him then you just heard dangerous by the divine produced by Jay dash when we return from the break you heard rain biased WB\nThan a classic I Want you to get to our jam by Marvin Gaye and we have reached the end of our show this week but before we go I Want to thank you for listening a week after week if you like what your be sure to let us know by emailing us at music at W. J. N. E. T. dot org\nUp so many things she's about what king's against on the taste of black box peer ... interview and download your copy is exclusive mix head over to taste test adopt live\nIf you like more ... says you can also hear an encore of one of our past shows right here on the beach Jaycee every Tuesday night at eleven PM where here also on Sunday night at ten o'clock if you're looking for tonight's at least you can find it on Twitter\nTwitter at taste has radio or W. J. C. T. dot org and to wrap things up for us tonight here is a very sensual sexual song here is to adoption by a shirt right here [noise] and\nThen\nGot me\nSure that you mine it and then in ... when we made I can imagine changes not end in ... in this book than we do to get her done then now we're up to you know we can do one\nUp those games to hug 'em when they do\nYou know [noise]\nTo get out the\nCan't do the and I get stopped me gave me saying\nKnow I\n\nTo get by and she's\nGoing to be watching me get the business so they know that I got really came when you're talking about\nBe my wife she don't know maybe\nCan email me\nKnow that\n\nYou know [noise]\n\n\nThink the you know [noise]\n\nFor\nWhat Brecht said on the rise in a three hundred year old British territory is caught between a rock and a hard place we want to remain British\nAnd does that means we have to leave the EU if that means that we have to take an economic hit then so be it\nI'm ... resolve the rock of Gibraltar for breakfast next time a marketplace week nights at six or eighty nine nine W. J. C. T. [noise]\nFrom ... to acoustic music listen to after hours Monday through friday nine PM only an eighty nine nine up in your community your world your music [noise]\n\n[noise] you're listening to eighty nine nine devil Eugene T. V. at them Jacksons how is it W. J. T. he got word for information on our program are scheduled pan news from the first you can do [noise]\nMORNING EDITION is awake around the clock to bring you the latest it's two ten in the morning so to five hours left the host you usually\nHear around three thirty ... for ... and it's about the Boko Haram ISIS news over the weekend shopping for Iran to five when the show starts to open\nUp every morning it goes up all night to bring you all you need to know Lincoln every weekday weekday mornings starting at\nFive or eighty nine nine\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\nMeaning\nWe\n\nIn general\n\n\n[noise]\nGoing to take\n[noise]\n[noise]\nRead all the\nLeaving my heart however is a\nWow [noise]\nWell\nWell no\nNo\nNo no\nThey're saying well\nNo well\nKnow it's wrong\nI Know\nThey don't want to say\n...\n\nBelow ...\nI mean I'm\nI'm only I'm not you know ...\nOh no new\nLine or\nWrong you\nThe man oh\nMan I Know a\nFood already agreed\nTo\nBring\n'em in a ...\nKnow ...\n... ... a\nRight to make you the\nBlow of\n\nPlaying the music of your life you're listening to relax radio on the on eighty nine nine Afghans\nW. J. P. T. your community your world\nDoo doo doo doo\nDoo doo [noise]\n\n\n[laughter]\nThen on the plane you know just the blaze away\nLynn gums about their\n...\nOh I take more than\n... you and\nI'm no good\nI Want\n...\nUh never lose them\n\nHow can I\nGet ... ... ...\n... well\nSo I [noise]\n\nI'm not\n\nUse ... and\nI'm I'm not\nWill be ...\n\nSaying\nAnd [noise]\n\n\nPeople to buy\nLot into the lead to a broad blow a\nShe rode a ball [laughter]\nNo but you know [noise]\nThree bottles [noise]\nOh well there\nAre ... and I'm already bought ... or do you call me\nAs I Am at best show the [noise]\n... by through\nYour road above that I'm\nTime I don't think so I Would have\nKnow\nDon't know about [noise]\n\nYou're listening to relax radio W. J. C. T. eighty nine nine eighty three Jacksonville we play the music of your life twenty four hours a day to support your music station please call three five three nine five to eight\nKeys those\n\nIn Maine signed a man\nBending down to he's neither bang boom\nMe guys that last show that\nYeah\nAlone I care or or or\nOr\nLittle row\nYeah\n... oh\nYeah\n\nWeddings and to me a\n\nLot of ...\n\nOh\n\nOh\n\n\nYear yeah he he's\n\nWhiz will\nDie oh\n\n\nIn the ... ... [noise]\nUh I'm I'm In the [noise]\nI don't I don't know ...\nAnd ... [noise]\n[noise]\n[noise] [noise]\n[noise]\n\nMhm mhm mhm mhm\n[noise] mhm [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\nUh\n...\n\nOh\n\nOh oh\nOh\nOh\nOoh\nYou're listening to relax radio in eighty nine nine ... W. J. C. T. H. D. tree Jacksonville, Florida\n\nFirst coast connect spring view voiced says from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and you and ask president John Delaney\nThis is just a terrific program that's really project single thanks actually what you do and what what station does\nI'm only survives plug in for his connect every weekday morning at nine and a rebroadcast scares every night at eight pm on eighty nine nine of each ATC\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine is\nWill have much my music after the news from NPR's [noise]\nKnow how else\n\n[noise]\n\nUm [noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nOh\nDo that blue chip to\nOh really is true ... oh\nJust say exactly what you say in\nOh that's true I mean\nBall to\n\nAh man\nDid that play on what you do\nOh it is true\nA do\nOh\n\nYou know show me how to do exactly what you do know I Know I Know when you lose your data have said hey exactly what you say in\nVery special\nMe to exactly\n\n\n\n[noise]\n\n... ... na\n\nNa na na na\nNa na na\n[noise]\n\nMan [noise] he [noise]\nGod\nGod\n\nUh\n[noise]\n\n\n\n\nOh oh\n\nOh no no no no we're\n\nNot really\nMan he\nWas\nLike\nOh ... oh\n\n\n\n\n\nI [noise]\n\n\nThe the ages\nThis train them don't\nHe's the he's a senior in\nThe\nThe fungi huge fan\n[noise]\n\n[laughter]\n\n\nI\n\n\n\nYou may\nYou know\n\nMuch\nMy\n\nMy\n\nThat huge did\n\nRadio is your overnight music service brought to you by W. J. T. T. eighty nine nine as than your community your world [noise]\n[noise] [noise]\nGirl or a woman\nOur\nShare of oh I don't know\n[laughter]\nWell no because there's no movement in\nThe valley done a\nFew oh I'm a\nOr a\nA little bit in the old I\nThink we could live today\nWe'd love\nDay I\n\nOn the phone and\nI'm a\nHuge well I'm I'm a\n\nNamed job in a bed\nDown man much\nI'm\nNot\n... a\nUm God God\nGod\nBy ah the\n\n\n... ... ...\nThey didn't they do not go onto candidate they live in Kansas City you know\nThey got the\nMan when he ran up on me wanting to be\nWell are you going\nTo be said on the door on the bottom [laughter]\nWell my and the way you may not maybe the one [laughter]\nI'm going to get uranium I'm going to leave me what you found well I'm going\nSame point in the in the\nRain man he gives me one\nOn but you know yeah\n[noise]\n\n\n\n\nSunday was that I Know I\nGot a friend will be their lives on the line Jerry Kenney\nMade on the train women ran on the on the one\nBlame it on the new one [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nRadio here overnight music service to you by W. J. D. P. eighty nine nine is\nYour community your world\n\nEveryday NPR's all things considered including news that keeps you a head of the car if this issue is not poor enough for us to draw a line of the ... what issue in the unexpected\nWing the skin the neck the hard you making chicken meatballs and cooking the knee cartilage\nAll things considered from NPR News weekday afternoon for forty six eighty nine nine W Jaycee to your community your world\nNews and information all day music at night\nAnd intelligent funds for your weekend this is a the nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\n\nExcuse me [laughter] so\nRight time\n\n\n\n[noise]\n\nUh those ... those are two and a and I don't know if the\nSaudi or abroad\nBecause I only have a\n\nThe moon may be a but I can see a thing as a\nCause I only have a [noise]\nI don't\nKnow if we're in a God\nOoh\nBall in a crowded uh the new\nOr\nA law maybe millions of\nPeople go by\nHave\nA um\n\n\nWell I don't know if we're in a God [noise]\nOh not crowded a new\n\nLaw maybe millions of people go by\nA man or a\nNo no they have\nA\nBall a\n\nRule\n\n\n[noise]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nI'm young and healthy I'm you've gotten it would really be a single not to have your ... I'm young and healthy ...\nWhen the moon is in this guy tell me what am I knew\nIf I could have to hide cheaper way [noise] but that ain't my name's Jeremy I'm full of vitamin C. I remember the health thing\n... in a year or two or three maybe we will be will\n[noise] [noise] [noise] not\nThat that that did you have to do they do they do do do Bowling Alone will miss\nDi di di di di di di di di di di di di di di di di di di di do do that and I didn't didn't need to di di di di di di di di di di di di di ...\n[noise] [noise] no\nNeed to do di di di di di di di di di di di di di di di di di di di di di di di ...\n\nNo no\n\nIt's like hey I gave away but that ain't my nature looks like I'm full of that vitamin a voter\nSaying oh let's do it three maybe we'd be in trouble\n[noise]\n\n\nBut it\nMay be I live on long ...\nI\n\n[noise] [noise]\n\n[noise]\n[noise] they can\nBe in some way\nYou know I'm not\nEven any young man in the\nAnd\nThey know that they get out\nEarly\n\nThe near\nSide saying\n\nThey get all the men\nAnd I know you're not even\n\nWhat this is my third time\nIn\nNearly there are\n\n\n\n\nYears did you know\n\n\nThey asked me to\nBut you can't\nStay inside and the\nNa na na na\nNa na na na\nNa na\nNa na na na\nNa na\nNa\nHey man to be\n[noise]\nTo\nOn there that opportunity and and\nNot so much less than ... how\nYou owe out the door or\nA black man and one\nOf them are\nWell just stay and grow\nAnd knowing I I I don't\nKnow what I Am\n\nIn some way\nAnd\nAllowed to [noise] now I have about\nChina but I have I mean\n\nBy God oh my mom do you live\nReally not what they were my ... and\nOut of a black man or\n\n\nOh\nRow\nWell that's about\nSaw me\nAnd a a\nMan oh let's\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n... ... ...\n...\n... ... ...\n... ... ... ... ... ... ... ...\n... ... ... ... ...\n...\n... ... ...\n\n\nMm\nMm [noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\nShe's one of\nMatter how much I mean I\nRadio here overnight music service ... by W. J. P. T. eighty nine nine\nEvery day on MORNING edition canoes you can't really It's MORNING we've been looking at what's happening or conservatism libertarianism in environmentalism religion were not props were just everyday people look out the joy the sense of who start [noise]\nListened to the next MORNING EDITION from NPR News\nWeekday mornings beginning it's five or eighty nine died W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\n[noise] you're listening to relax rainy out an eighty nine nine\nThat much money is that after the news from NPR's\n\n\n\n\nAnd I thought about you\nFast the shuttle anyway\nAnd I thought about [noise]\nCars parked on the other star\nLeads bean\nSame own dreams\n\nA lot about ...\nAnd\n\n\nThree car market onto the star\nWind industry is\nName oh dream na\n\nI thought about you\n\nYeah when you marry\n...\nEat from [noise]\nYou know I don't\nThink many trees on\nMy oh\nTo Robin Robin as you say\n\n\nYour eyes nice guy name again\nI Do again in the evening\n\nI guess I always will\nWill never\n[noise]\nOh\nYeah when you smile and he ... he called me\nFrom [noise]\nIs\nHerd of\n[noise] name mommy love him\nHe read you\nRead the moms and\nNever [noise] [noise]\nOh [noise]\n\nIn the land that would I\nPoll ways he is\nWhen you die now\nWay to meet the limit\nI Am on\n\n\n\n\n\n\nThey say some the ball\nGo\nLooking for a different to\nOne that they could include\nAs though the they got\nRid of them so\nThey started way and\nKnow just what to you\nBut this is a\nBig yeah\nIt is though the booze big\n... good\nBig in\nName of that\nYet but it's not a\nTheir cable way\nDown\nOn it\nNever\n\nA long way\nI Am\nSaying\nWas well\nDo you well know\nBob and\n... a\nBird\nYou\nAbout you\nWas too low\nLaw\nDo do you\n\nWrite\nAbout when\n\nNo\n... you know\nNeed no\nOh\nMaybe\nMaybe\n\n\nOh\nSee that\nKey ball\nKnow\n\n\n\nUm\n\nOh\nMm\n\n\n\nThe more I mean you know I Want to\nKnow how that should be\nJumping roads and grow\nWith that raised in la ... I'd be more ... about you\nMore lost without you\n... ...\nThen you go to a gym\nYears go by\nKnow the only one for me\n... ... ...\n\n\nMe\nYou bring\n\n\n\n\nI got\nAt the same old same\nGreat\n\n\n\n\n\nIn law\n\nLeave your journey and then just they\nLive and learn your\n...\nOr ...\n\nWas a good ...\n... ... ... your\nAll that rule\nTo go oh\nWell oh you're a\nYoung man who man it'll be beat down\nIs good ... and do you read and read read Sam\n...\nI'm a big job man\nYou learn to\nLot more you\nKnow no no no\n... ... ... ... oh\n\n\nNo no no\n\n\nOh oh\nOh oh\nRelax radio is here overnight music survey brought to you by Debbie a JC T eighty nine nine us and your community your world [noise]\n\nOne minute after five in the morning the president of the world bank is calling one minute after new New York city authorities are investigating a second deadly crank collapse one minute after five in the evening the commander of the joint African Union has one minute after eleven at night at least one tornado is reported to have touched down to\nWhat's happening what's known what's next one minute after the hour every hour every day from NPR News the\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax the radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\n[noise]\nMan\n\n[noise]\nWell yeah\n[noise]\n[noise]\n[noise]\nWhen you're\n\n[noise]\nYeah then they all they need\nTo know\n\nIn that [noise]\n\n[noise] [noise] [noise]\n[noise]\nYou see\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nGod\nOh\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\nPretty easy to\nWe lead lonely\nMoney then\n\n...\nUp my\n... for rather\nAh then\nTheir way\nNo man the the\nReally be ...\nDo ...\nCome to me it\nLet me\nLet me give my\nI'm\nWe see blue\nDo you feel a lot\n\n[noise] [noise] [noise] [noise]\n... who looks fine way a coal mine name [noise] [noise] that seems to lead the trouble in the hall and [noise] and it by being down and do a troubled by\nSome foolish game [noise] she always seems to make me change my my ...\nAnd ... and any time she's around me now she is around now almost all the time and if ... well you can tell she's been with me now\nShe been with me now required a long long time and not being\n... [noise] [noise]\nEvery now and then the things are being on the news and meaning\nAdam ... though the renaming into basis where or should not let me\nGo or no [noise]\nHe has the power to go where no one else can find me and the sign in the ... now that have been done good John ...\nWho\nJust got to know them it isn't and what she's got they how she bangs or where she's been do need to do was done by the way this um [noise] I like them best that way it doesn't\nMatter what they mean ... she says them mostly just sit down and I feel\nFine any time machines around me now G around me now most all the time and the ... well you can now she's been with me not she's been with me now I don't\nKnow uh\nNo not being held by [noise] [noise]\n\n[noise] [noise]\nI'm On the clock\nI think you\nShe goes\nTo the news a gym club ching she\nShe is very\nGave a little while I'm\nShe breaks\nI'm On and then the machine is borrowing\nWaiting to see a one\nThey say no\nNo no no just drove up the chain\nKnow a\nLong way\nI Know\n\nRelax radio is your overnight music service brought to you by W. J. T. T. eighty nine nine hours than your community your world [noise]\n\nThat they in\nAnd\nStandard and\n\n[noise]\n\n\n\n[laughter] [noise]\nWell\n[noise]\nWell\nWell\n\n\n[laughter] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\nRelax radio here overnight music service back to you by Debbie Jaycee T eighty nine nine\n[noise] one voter in a poor Kentucky County says she is doing well under President Trump and she did those still in poverty should work their way out\nThere and people that are just have a live either kills me just because I Do work for everything I have her\nVote in November could help determine control of the house of view of the midterms from three quarters of the Kentucky district that's on the next MORNING EDITION tomorrow morning starting at five or eighty nine nine W. J. C. T. your\nCommunity your world broadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine is\nPlaying the music of your life\nHave much my music after the news from NPR\n\n\n\n\n\n\n\nWhen they do both law statutes do\nMe a whole new vocal a joke like man\nYou can bet as sure as you lay\nShelters guy that gives you gotta give some guys\n... ... ...\n... am wackos boulevard substance my\nNo say no because I in\nSome ... some some one daughter to\nShow on God\nKnows what the banks have in store\nI'm a ... there is God\nA dry hole you know do the lips now I don't know\nHow long can and he was\nBy by by by this with all\nAnd says there are some have been the star spangled\nAs sure as we'll\n\n\nYou'd better than nothing I\nMay mainly mom\nBut what can\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nOh wow [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\nCalled spring when I was writing\nYours and my\nMom would\nSay as we said that live on the table and\nMay ... I\nKnow man\nIn in\nIt's you know why\nMy ... dancing\n... you see\nMy role\nKnown dates I Know what I'm\nThat he\nMy knees\nMay be you\nKnow funny\n\nShe\n\n\n\nTold\nMe that in a band if you\nMade a big deal but to me ...\nI Do all the best\nBe so good to me see\nI have a man\nWhole banning I mean so\nTo me is that Jay Jay Jay ...\nMay be good\nThe same exact about and I saw well\nThey'll go through may be\nA A N K\n'em all alone and that's right that I thought it was\nOh\nMe do that too many jak judge\n\nHannah\n\n\n\n[noise]\n\nUh I'm a\nAll about it and then they go to one day I just don't at all I'm a fan of the woods\nMe being so good\nIt's all\nDay\nRelax Radio Welcome your comments\nSend your comment to relax radio at W. J. T. T. dot org\nA ... ... ... ... ... ... ... ...\n... ... ... ... ... ... ... ...\n... ... ... ... no no no no no no\nYou're ... see the", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "15"}