{"month": "10", "state": "FL", "station": "WJCT", "content": "\n\n\n\nOh\n\n\n\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n[laughter]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nThank you for joining us tonight you can find a set list at news dot W. J. C. D. dot org I'm Andrew it but for blues arriving I'm sure to join us every Monday Wednesday not living right here on eighty nine and your candidate\nKnow boom [noise]\n[noise]\nRe question is a great question and that's a great question wow that's another great question\nThat's a that's a great question [laughter] that's a great question that is a great question really great question\nOn fresh air you'll hear unexpected questions and unexpected answering weekdays at noon on eighty nine nine W Jaycee your community your world [noise]\n\nFrom ... to acoustic music listen to after hours Monday through friday nine PM only an eighty nine nine up in your community your world your music [noise]\n\nThese guys overnight load in the mid sixties for Tuesday cloudy with scattered showers high in the mid to upper seventies partly sunny Wednesday disease eighty nine nine of the J. C. D. Jacksonville your community your world\nEvery day on MORNING edition it's the news you can't do it this morning we've been looking at what's happening\nOr conservatism libertarianism environmentalism religion\nWere not props were just everyday people look out the joy the sense of who start [noise]\nListen to the next MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine by W. J. C. T. community supported\nPublic radio broadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us\nPlaying the music of your life\nHave much my music after the news from NPR\nNo no\nThink ...\n\n\n... do you fit into one of I mean\nIt'd be nice you don't want to buy now\nEntered into you sit in on the right\nHere don't avenues somehow\nMy new rooster crews that debris\nCan\nLook out your window and avid gum\nYou the reason I Am a drab and you know\nAdults playing try so right\n\n\nI Am today no use an attorney you know you're like me\nThat I\nEnergy into using ... and you're like me\nI'm On the dark side of the road\nBut I Wish there was something you would\nMeet Jean reminding should be\nKnow now do you do much television anyway\nBut don't they try All right\n\nCall in and out mundane yeah\nLackey never done before\nAnd then you know using calling out mundane yeah\nI Can't hear you anymore\nI'm thinking and I'm Wondering walking down the road\nI Want love the woman\nA child I Am too\nI give him my heart but she wanted to\n[noise]\n\nOh hey be\nJust the way\nSing treated me\nYou could have done better but\nYou just can't always been right\n\n\n\n\n[noise]\n\n[noise]\nLonely [noise]\nOoh to\nMe like the ...\n\n\nSee may get your does well\nDon't you know that you're the you're either they're married again and\nAre there any\nDjango out in Atlanta and they\nThat the [noise]\n\nYeah my ... you\nHe's in jail right through the\nToo young my great\nOh my clothes to green\nI just go to peace\nWhat I like the ...\nKnow\nNothing seems to lead\nMm\nAll the\nWay in my\nThat he just nothing you\nWhen I Lived you know\nI can do\nWell\nI\nWas on a bus or a really we're not ...\nCould hear the right\nThing to say\nYou have one hell\nNo don't go\nLow we know none\nAre they grow a\nLot better and\nWe knew the voices ...\n... ah yeah yeah\nYou\nLot of those um oh why oh\nWe were\nUm\nWe could hear the censoring\nThey seem to say\nDo you have done\nSo uh how do we\nWe we\nWe saw\nA\n\n[noise]\n\n[noise]\n[noise]\n\n\nRadio is your overnight music serve and brought to you by W. J. T. T. eighty nine nine as than your community your world\nOh\nOkay\n\nMan\n[noise] and so\nWhy did in ...\n...\n[noise] [noise] [noise] [noise] [noise] [noise]\nHe he he\n\nHe he he he he he\n[noise]\n\nHe he\nHe [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nRadio is your overnight music service ... by Debbie Jaycee team eighty nine nine of\nOne minute after five in the morning the president of the world bank is calling one minute afternoon in New York City authorities are investigating a second deadly crank collapse one minute after five in the evening the commander of the joint African Union has one minute after eleven at night\nAt least one tornadoes reportage left touch down\nWhat's happening what's known what's next one minute after the hour every hour every day from NPR News the\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\n[noise] [noise]\n\n... you know\nI mean I Know oh\nNot a breeze is he do with the\nIn this big ...\nInjury little\nDream you\nKnow\nRenee ...\nAnd ... he\nTried to me I didn't really you know\nAnd blue ...\nJury Mahmoud\n... cheese no\nBut I Do on day here\nIn\nLonger you\nKnow you do\nOn the line do you\nRead your that really low where we draw the line you\nIs your dream or whatever they may and\n... cheese knees\n\n[noise] [noise]\n\n\nOh oh\nNo kidding\n\nYeah\n\n\nIs one you\nSo he dreams that revolve\nWord in the eye you\nAnd your dreams or what is the the cheese a\nLittle um\n[noise] [noise]\n\n[noise]\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter]\n[laughter]\n\n\n[noise]\n\n[laughter]\n[noise]\n\n\n[laughter]\n\n[noise]\n\n\n\n\nMm misunderstand the day\nI heard they found it to flow\nCould make it out and you\nI Do ... ...\nAbout a visit to\nGod as far as the ...\nThe you know they knew about her new book\nI no ... no\nWell ...\nIn my mind moody\nBut no the the ... through\nA while to ... read a man and buy it into the\nSchool to go but was ball\nAlternative than with\nUm you know\nI don't care that much any more\nWell ...\nMy mind movie you\nKnow the the ...\nThe rubber ... read a man and buy it on they were\nGood are gone but one phone\n[noise]\n\n[noise] God\n\nThe Sandra man ... ...\nYeah my ha\nMay have a good\nGod ...\nBandage done\nThen to show beige no\nOh no ...\nNo\nWell I\nOh my\nGood beach so you need to know\nWhy did they do ...\n... and ... than than men do during the\n\n\nIn ... to be you\nDid have to be\nOne\nLiner lip buddy who\n\nCouldn't may or may be true [noise]\nN E than be glad\nThinking\nSome other is a ...\nMy ...\nMy number they could well\nDo people but they wouldn't do\nNobody\nKnow\nWho won and uh for you\n... my ...\nTry to be\nThey wouldn't\nKnow who\nGave me a really\nIn the state yeah\nIt hangs in the new\nTend to be you know\n\nRadio is your overnight music service brought to you by W. J. T. T. eighty nine nine\nYour community your world\n\n[noise]\n\n[noise]\n[noise] [noise]\n\nWell or at least ... the whole\n... dollar a total\nOf ...\nYear old and they usually do such a bad I Can't compete\nWith your high\n...\nIs our meal\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\nGood or bad [noise]\nDa da\nDa\nDa da da da da\n\n\n\n\n\nRadio is your overnight music survey brought to you by W. J. T. T. eighty nine nine us and your community your world [noise]\n\n[noise] health care is a problem that people in the district face every single day in New Jersey with fewer than three\nWeeks until the midterms repealing Obamacare is a major issue in a hotly contested congressional race and the issue is leaving many voters on the fence to I\nI I don't know I'm a I'm a little bit on the\nThat's on the next MORNING EDITION\nTomorrow morning starting at five or eighty nine nine W. J. C. T.\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us\nPlaying the music of your life\nWill have much my music after the news from NPR\n\n\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise]\nDo\nGo though [noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\nMm\n[noise]\n\n[noise]\n[noise]\nWell\n\nAbout those\nChanging as the days go di di\nTo be do you ever been to\n\nYou'd think later you're not choosing\nAnd you know\n[noise] [noise]\nIn the I think they\nTo you again stranger and your father John\nBroken down\n\nJohn\nNo\nNo\nMm Mm\nMm\nMm\n\n\n\n[noise]\n\nOn the news comes now it is I Do think getting\nOn spring break during name do you think you're going to\nOh\nLong\nCan still remember how that music I'm\nThat I could make those people and then maybe they be happy\nMay me shiver\nRead about yeah we don't pride\nSo ah ...\nMust share the do the same city but the levee was dry\nFor a drinking whiskey and right\nBe the day that I\nDid you ride\nDo you\n\n\nNo\nNo\n\n\n[noise]\n\n\n\n\n[noise]\n\nIn\nThe ... and the\nGuy from the\nVery end\nUp being a judge to ...\nWas I have no man [noise] oh man you know how I Know\nI had to\nReduce homey\n[noise] countries the owner na [noise]\nDo you know\n[noise] ...\n[noise]\n\nBelieve in jobs with have been the\nSame money would you know\nBring to\nBring that man of great [laughter]\n\n\n[noise] na na\nNa [noise]\n\n\n\n\n\nMm\n[noise] [noise] [noise] ... ... ...\n...\n... ... ...\nAnd knees\nMovie the\nBusy by a\nIn\nI have\nI'm\n[noise]\n[noise]\nYeah\n[noise]\n\n\n\n\n\nRelax radio is your overnight music service ... W. J. C. T. eighty nine nine\nOn all things considered story starts with the new women set to become the first female Army Rangers ever\nThat day when you wanted to follow it with Congress station from a woman was in the military or just email everybody down to one to get her on the snow and\nWelcome to the program started markets thank you very much I Want to start just with your reaction there's more to every story on all things considered every afternoon\nWith the afternoons for forty six eighty nine nine to ... to your community your world\nNews and information all day music at night and intelligent funds for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after that news\n[noise]\n[noise] [noise]\n\nYeah they're um he ... yeah the me too you\nKnow\nThe\n... the\nTopic will be then then that's what I did if\nYou want my ...\nThen again why\nDo I do remember or right\n[noise]\n[noise]\nYou've got to\nYou in the ah the this is my ...\nMy ... go to\nAnd I usually don't mess\nWith Mr Mann be yeah\nTo the Mac\n... flew\nTheir Monet lie about who do well no no the\nStray remark in no way I don't know what ...\nKnow\nYour late ... he\nOn duty upper lip don't mess with Mitt nerve in between\n\n\n[noise]\n\n\n\nAnd they said we bear that\nYou go to the movie\nYou're about to do better witness serve\n\nMm [noise]\n... brain more\nSweet the rain new\n[noise]\nMy name is the so\nFor\n\nNa na na\n\n\nOh\n[noise]\n\nDo you plan on the line before he left\nThe needs to do the\n... ... how do\nYou want to be the\nTo be able\nDo anything\nRobot in an opportune time I'm going to you but now that you would think\n\nOut in the west Texas town of El Paso I fell in love with the Mexican glue\nNight time went fine made inroads this Ken ... who\nBlack who's been nine ... shows but\nYou then you lose ... [noise]\nMy little boy's name for this Mexican in Maine I was in love but in vain good tales\nOne ... came in wild as though I think the way\nI\nSee that in that I mean during the last show the what we get leaner\nThe girl that I Know\nSo it I was\nChild it's gives rise to the voters laying\nDown what you're saying about the guns that he will\nYoung strain too late then\nOut to the back ... ran out where the harbor where\nUh\nI caught a good while they do not like it could\nWay I did wrong I\nThat that is actually from\n\n\n\nLast is\nTwo\n\n\nWe don't we're not the the\n\nIt's looking for trouble\nCame directly\nLooking for trouble\nLiberate them up\nI was ...\nTalking but my dad and he was all agree\nAnd I\nKnow a\nLittle much ...\nAnother look for trouble\nAdult taking orders\nOnly made out\n... blood and bowl ... if you\nGo let's do a little dog\n\n\nMan whoa whoa\nWhoa don't know you must love we [noise]\nKnow Missouri though\n[noise]\n\n\n\nRadio here overnight music survey brought to you by W. J. T. T. eighty nine nine ... than\nWherever you spend your morning NPR's MORNING EDITION of beer with you wherever the story takes place NPR's MORNING EDITION can mix it with\n... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado\nWashington you will on your boarding wherever you are when you choose to spend tomorrow MORNING EDITION from NPR News\nWeekday mornings beginning of five one eighty nine dollars W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. chip in Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us\nPlaying the music of your life will have much my music after the news from NPR\n\n\n[noise]\nMhm [noise]\n\n\n\n[noise]\n\n[noise]\nWhat are you\nStill have ... [noise]\nNo it's been ...\nOnly one ...\nThat she's been with the [noise]\nThe seasons and\n[noise]\nReasons and the\nAll began in in\nSee Santa brand ah say\nNo no\nNo no no ah saying wait us man and\nLet me be the one\nThose two rules we\n... the\nMan you are or\nLittle weekend ... [noise]\nOn\nMy ah\nThe\nWinter spring and fall\nIn love\n\nUh I don't recall\nCheese ... Mm\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[laughter]\n\n\n\n\n...\n\nDo they\nA\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\nDa da da da\nDa da da\nDa da\nDa da da da da da da da da\nDa\nDa da da da da\n\n\nDa da da da\nNa na\nNa\nNa\nFew na\nNa\nNah\nNah\nNah nah nah\n\nNah\nNah nah\n", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "23"}