{"month": "10", "state": "FL", "station": "WJCT", "content": "Pretty lucky 'cause it seems like the musicians I work in a way I feel like I always\nGet what I Want and more so I feel like I have it luckily ethic without some work on what I just feel like I I've had a really great experience says at an ad in each piece that I Do I just try to push further as a composer\nNice and and working with Jack Nicholson funny as I've been a harmonious process\nYes I'm very excited about ... about the fact that I could work overtime with the conduct according to Louis so that's a really unique um situation normally you know you get to\nBe part of the ... with a conductor but the fact that I can talk about my concepts with Courtney and and he can like give me suggestions along the way I was I have a draft of the peace I'll get to share it with him and he'll get feedback so that whole back and forth process is going to be a first for me\nAnd that sort of situation um to have that much a collaboration with a conductor so that's a really special thing in Jacksonville Symphony is just a really wonderful symphony so I just know that like whatever\nWhatever I'm hearing whatever I Want to write I Know it's going to sound the way you know if I Know it's going to be great a performance and so it's just a really great experience for me\nI Love it [noise] well we had Courtney Brian on the show she is the ... symphonies inaugural ... a composer and residents are gonna think Moe Rick's er my partner and the radio show my sound engineer things could happen without him here so a tune in every Thursday evening of on radio\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\nA\n[noise] [noise] [noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\nW. J. C. G. readers are here for years with the Florida Times union complete with news op eds and they\nAre readers will bring the paper to live to serve those with blindness and other physical challenges need our service go online to W. J. C. P. dot org slash radio reading list on there and register as a listener or will send us special Radio Free\nCall us at nine of four three five eight\nSix three oh wait because radio reading we give voice to the printed word\n... Elizabeth Warren got in trouble for saying she had native ancestry unless you've gotten more trouble when she said she took a DNA test to prove that the lesson to never say anything join us for the news coverage from NPR\n\nNews he's eighty nine nine companies Jaycee Peter Jackson films rain it's possible overnight look for those in a low seventies most cloudy within north east wind and forty percent chance of rain friday high of eighty two lowest can fix\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION connects with\nSally ... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will own your morning wherever you are when you choose to spend tomorrow with MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine dollars W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\n[noise] you're listening to relax radio on eighty nine nine out than playing the music of your life will have much my music after the news from NPR [noise]\n\n\nThe day\nAnd the ones that go on you know it's good though like new lives to to come by new boy\nA day to day\nMain ... no no I\nTo do there are no laws ladies do you live along ...\nThey didn't go to bill in ... goes to like you're in the ... ... a day to day [noise]\n\n\nDo you live a long ball during\nDidn't\nDo it but then I really\nLike to live through the gum bird ...\nWe lived there as well to cover\n... [noise]\n\n[noise]\nNo they will no no\nNo they it's so nice\nTo have you back when you know\nYou look in ...\n... to ... dollars used\nTo call once used to grow in you're still\nGoing strong love the little room when you know what to look ... one of your own\nSongs from way back when and I'm\nLast\nWe're going to allow them\nA\nAnd I don't know have you back where your real oh\nWhy you know\nBeen hearing\nGet a\nA job she\nShot or dominated by\n\n[noise]\nAnd\n... [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[laughter] well\n...\n... ...\n...\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\nDa\nDa da da da da\n\nI'm On\n\n\nAh\n\nNa na\nNa na na na\n[noise]\n\nHello I'm young love\nYou oh\nTroubles are\nOh my God we're ...\nOr ... well your\nH O\nYou know a\nA neuro lowered\nI'm into a\nHere that's\nA\n\nKnow that's a\nKnow\nWhy\nDo\n\nOh all five of them\nAre a on\nA title\nOf my own\nUh\nI don't know uh\n[noise]\nUh oh no no\nNo\n\nUh it's a a a\n...\nA a a a to\nA a a shadowy\nNa da da da du\nDream a by John this is a show why things G\nA\nShining a a\nA way of ease the\nAverage job that we know a side of a Jew a\nMind when I was down there is\nNot every area about who\nTrue that a lot of that that's a\nAnd what did I Do\nA it's a there's a huge [noise]\n\nNa na I\nDo a\nA it's a\n... um\n\n[noise] [noise]\nRadio here overnight music service ... by Debbie J. P. T. eighty nine nine us send your community your world\n\nAll things considered goes where you are and takes you places you never thought to go\nRight now the wildfire threat in the Pacific northwest in this month marketing ten years since Katrina ...\nBrown in Ferguson Eric Garner in New York mirror rice in Cleveland\nIn Kentucky today how county clerk who refused to issue marriage licenses\nThere's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community\nYour world news and information all day music at night and intelligent fun for your weekend this is easy nine nine W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after that news\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\nOh she's been raining do a little she's a great uh no no no no way she said that\n\nShe can and do you um [noise]\nCouple things\nMaybe ran ran ran\nAnd won you know [noise]\nAnd then they would not\nChange that came in\nAnd\nNamed Lon grade nine\nY'all can by someone\nLine of bad about the\nBig and then\nMaybe ... na\nNa\nMan now\nNa the\nYour house you\nGet two boys and\nOn man\nKnow I\n\nWe can do that\nOh\nTeams\nTake\nIt\n\nMe there and you say he\nWould do nothing\n\nSay the\nThe ...\nThe two girls in both fall through the um we're girls all all the girls\nTo the longer we're\nA\n\nMarried and to be a\nWe've been talking about in Jackson\nOf a well\nYeah I'm lord Jackson\n\n\nKnow how big\nBe a lone jaguar\nThe\nRoad on three and then you know the\nNo I'm at all\nIn\nAnd then he found\nMe you know\nKnow packing them\nWay man can economic\nBehind my tape am I Am\nWhere you go on the\nRiver and [noise]\nAnd\nThen I'm I'm I'm\nAnd her\n\nCan reach you know I mean no no no no\nThen I Will tell women want\nJust run down and they\nHow many kids as\nMean Larry\nThe state so\nThey eat the chat\nDarren Day\nYo Ma\nShe\nCan make\nThank Saturday Night and they didn't have any\n\n\nMan\n[noise]\nMan\nI did\nAnd\n\nDon't know [noise]\n[noise]\n[noise]\nAlone by Broadway and not\nTheir own sound my\nBabies don't tell your\nI'm ... dumb\nNo\nNo no\nHe\nHe not da da da da\nBy Broadway\nWell by Broadway\nI have to do this I Am one those great I\nYou\nIs they get paid the hydrogen minute this and that you hear that he may be and then he goes no Jew or black to sleep all day\nNo\nNo no\nThat\nA you\n\n\n[laughter]\n[laughter]\n[laughter] [laughter] [laughter]\n... [laughter] ... ... ... [laughter]\n... [laughter] ... will be no\n[noise] [laughter] well [laughter]\n...\nYeah\n\n\n\n\n\n[noise]\nWell\nFor a no ooh [noise]\nMm\nRelax radio is your overnight music service rocky W. J. T. T. eighty nine nine us and\nYour community your world [noise]\nThe new film beautiful boy is based on the memoir by David Sheff\nHis son Nick addiction\nTo read from being just one of the most sort of light filled extraordinary people I knew and he became coast\nOn the next fresh air we hear from David and Nick ... David also wrote the book clean about addiction research joining\nWeekdays at noon on eighty nine nine W. J. C team your community your world\nBroadcasting from Florida palm coast to Georgia's golden ... this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine FM playing the music of your life\nHave much my music at the news from NPR [noise]\nTo lead\n\n\nWell\nHe\n\nHe he\n\n[noise] ...\n...\n[noise] [noise]\n\n\nRadio at your overnight music survey brought to you and I got the J. T. T. eighty nine nine cents your community your world [noise]\n[noise]\n\n\n\n\nThe\nYou\nNot\nSaying\nA\nStop\nYou\n\n\n[noise] oh\n\n\n\nMm\n\nMm Mm Mm\n\n\n\n\nNa\n\nNa\nNa na\n... ...\nNo\n\n\n\n... ... ...\n\nMm\n\n[noise]\n\n\n...\nNa\nNa\n\n\n[noise] [noise]\n[noise]\n[noise]\n...\n\n... ...\nL L\nMm\n\n\n[noise]\n\n\n\nA mentor that to me a long ...\n... one thing and this man\nWell cry every time ... better than\nOne or a dime\nAnd let the boys saying that one one more time\nIn Catalonia than than to live on in the\nNew made me more than men do we know I Need your Golden Gate and\nLike I'm all in in or\nJust like to bowl and uh and\nAim ensure that the ball on June ...\nMissing middle man no\nWell right every time\nMet just live man one more nine\nEleven the boys saying that one one time I'm\nA manager can you hear the Mad Men die a bar\nI'm I'm a little\nMen ... means in Florida and um\nOr on the lower\n... they can\nLet the springtime and let them all a common man or\nA nun\nAnd um\nAnd I've done a ban on some ... you know\nA Mr that ball you\nThing in the band so\nMm well I'll Try every time and a man man one Laura Dunn\nAdolescent boys damage that was one more time or\nThe ban me they don't or you know\nNow over\n\nWe\n...\nHow to do with the others you know like I couldn't do it and you know\n\nIn\nOrder in one room\nInjury\nIn\nBlack and claw and we\n...\nCar care word then\n[noise]\n[noise] [noise]\nThere was no way you\n\n\nRadio is your overnight music service he brought to you by W. J. P. T. eighty nine nine hour than\nYour community your world [noise] so\nMORNING EDITION is awake around the clock to bring you the latest news it's to tune in the morning so still five hours listening to host or\nUsually hear around three thirty ... for her and it's about the Boko Haram ISIS news over the weekend for him to live with the ship stores open\nUp every morning it'll show up all night to bring you all you need to know lifted every weekday weekday mornings starting at\nFive or eighty nine\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n[laughter] [noise] [laughter]\n[noise] [noise]\n\n\nAnd\nThey get the name the hot and then I found that the guy right at the ...\nAnd that's not\nBad now that the gang related gang that does that mean men on the\nMan's name [noise] I\n... the day the top of the state\nI mean as my lower than they care that the rabbit mom and my gay as a matter like hire the guy\nThat tiger John good to go down as the lemon stubborn as a new job bad the rangers you know the bottom and that means men do time in ...\nI'm ... and the ... the quick end up by lowering the ... make better hang in there that the ...\nThe ...\nGood as an angel who have been up to Maine bar ... I'm In love\n[noise]\nAnd\nI make in the name the man that will be\nGreen as a GOP bars why is it the\nRole as an author swung again\nMy cigarettes here again right\nBy and one thing but the but all it is a stone wall and Henri as a good\nGuy and they have been up that means men's ... brother ... partners where Iran's\n[noise]\n\nMm [noise]\n[noise]\n\n\n[noise] well [noise]\n\nMan who\nOr offer all on\nBeing given by the way\n\n\nLay there\nYou Eric\nMe um\n\n[noise]\nAh no\n\n...\n...\nOh ooh\nOoh\n\nNumber one a top joining the weight on the mind thing first\nWell sort of doing that tells us how to live and learn seems to be learning to live and spot number one nature boy\nBoy\nWell various ... boy\nThey stay here wander ... o ... o\n\nA little show and stuff out of a\nA\nLiterary oh\nA good one the\nMagic day he came my way\n\nWhile we're ... man then\nGreatest thing\nYou ever ...\nYou are\n... and ...\n\nAnd then one day\nA magic day he passed away [noise]\nWhile we spoke of man\nHe then then the ... the\n\n...\n\n\n...\nIt's changes Josh\nRing man here all\nYour hard drive and all\n\n\nHe [noise]\nYou know I'm\nWas a man [noise]\n\nBad it is a\nIt's a and that all back\nOh\n... or I Know\nBank yo yo ma ma\n\n\nNa\nNa\nNa na na\nNa na\n\nA a\n\n\nHolding hands at midnight ... sky where\nAnd you can get it if you\nStrolling with one girl\nShying shot up a lot\nWork and you can do that and you can guarantee if you try to\nSome one waiting at the cockpit door\nGood eyes or anything\nTaking that wow\nNice work and get it I didn't you know\n\n\nWhen I Swear if you can do this\nYou can get it if you\nWhere you can get it and you can get it it\nNice work you can get it and if you get in\nI mean\nToo nice word\n[noise]\nRadio is your overnight music service brought to you by W. J. C. T. eighty nine nine\n[noise]\nThe news in the [noise]\nChanges\nYeah well get a\nYou get the hot during\nThing is not yet do you mean we don't\nThe nuts and to\nWhat can I say\nLove movies\nI\nThey spent but you know\nThe ... one was good I was raised\nBugs and he\nWas being so\nNa\nNa na\nNa\nNa [noise]\n\n[noise] [noise]\n\n\n\n\nRadio is here overnight music service back to you like your Jaycee T eighty nine nine is sent your community your world [noise]\n[noise] first coast connect spring view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and you and that president John Delaney this is just a terrific program that's really projects no thanks thanks for what you do with what the station does I'm only survive yet again but first says connect every\nWeekday morning at nine and it will be broadcast scares every night at eight pm on eighty nine Chevy Chase the\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio an eighty nine nine us\nPlaying the music of your life\nHave much my music after the news from NPR\n\n\n\n\n\n\n\n\n\nFriendship and they don't do that in\nLatest parish by\nI'm the one with\n\n\nAgree you know there are those ... those\n...\n...\n\nYou do not I don't know all the\nYou know\nYou belong to know about\nOn one issue\nBomb bomb and one thing she\nDon't know\nWhat are the\n\n\n\n[laughter] well\nNot the the the the you know when the Joan ...\n\nLed the de dum de ... club the\nOn skin will lead the drip drip\n...\n[noise]\n[noise]\n\n... role\n[laughter]\nYou'll oh\nA\nStudied na na\nYo\nDa\n\nMm\n\n\n\n\n[noise]\nWhen ... my mother said to me ... either and they ...\nDon't go to you I\nLove my boy my mother but to me like my hobby I Love the\nJury ... to me the\n\nBy the rules the boy lemon and then a ... to the\nThey the the the lemon tree\n... love and died in ...\nA girl those as we did when she smiled us to talk of Israel was in the ...\nAnd the law but they need the lemon jury music\nNo ...\n...\nWe bought the ... the lord I'm using a symbol\nAh have already the\nWhile I sleep a lot of the ... museum ball with both really\nNo one day she loves\nWith all the ...\nAnd in the door she loved to be high and I knew what she had\nShe let me borrow and all the ... column in about ...\nAbout why there are no such thing as you want to\nDo we really were written ...\n\nTree already do that and ...\nYou know the more local news\nAnd ... ...\n...\n\n\nRelax radio is your overnight music service brought to you by W. J. C. T. eighty nine nine us and your community your world\n... was born in ...", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "19"}