{"month": "10", "state": "FL", "station": "WJCT", "content": "Leave many named bill ...\nHey I'll do that with all that\nAge the ... ban on all the money I ...\nThe Russian Utah\nAnd share my baby a ... day means watch the news and you don't mean maybe\nThey should they\nAge to use ...\nDay she a honey maybe longer to cheat\nShe don't come she\nOr she loves you\nDon't let you in July and\nShe'll take you\nI she is liar and a girl on the wires\nChange the flour and the ...\nAnd she addresses\nUm money I guess\nRead me\nA\nMe me\nAnd I just turned twenty two\nI was wondering\nThe closer they do I\nPatti Ryan my\nIs Iran\nSaw his job calm\nRaise my rifle ma I\nEver saw\n... me from the powder\nThing to me yeah\nThe snow\nWas so much that I'm a\nRemember me them no\nWhile but not for music oh Neil Young here on string theory on\nAre all star special that song was powder finger also heard from Don McLean before that the man who gave us American Pie among other great classics and each year honey [noise]\nWhite stripes and there are two would take take take bill and Sebastian if you happen to work for an airline ... to the song was I'll be a pilot\nAnd thank you so much once again for allowing me to be your pilot tonight to bring you string theory appreciate you listening you know it's always in the police contact us it music at W. J. C. T. dot ORG that's music at W. J. C. T.\nDot org ... drop by our website and find out all kinds of great stuff about station and how you can support it to appreciate that a lot [noise] this is John ... have yourself a terrific weekend and we will see you again next friday peace\nBe with you every Sunday night at eight on eighty nine nine W. J. C. G. and I do I provide them with me Glen Fisher the king of the new operas joined a sunny day in eighty nine not\nClear overnight low around Seventy three sunshine Saturday hides in the upper eighties isolated showers and thunderstorms Sunday is he's eighty nine nine W. J. C. T. Jacksonville your community your world\nFrom now until by they the stations have W. J. C. T. will conduct tower repairs eighty nine Ninety I\nFound the WTC D digital channels at the antenna broadcast W. J. C. T. channel seven will be off the air but cable broadcast of TV should not be a fact thank you for your patients W. J. C. T. Jackson\n[laughter]\nMORNING EDITION is everywhere all ... euro and tell you one compound babies like reporting from bunkers streets alleys jungles and deserts but most importantly\n[noise] were wherever you are\nStart your day with a trip around the world and wake up with MORNING EDITION from NPR News\nTomorrow morning from five to nine on eighty nine nine dealt with your Jaycee to your community your world\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us than playing the music of your life will have much my music ... the news from NPR's\nDid our foreign\nOh\n[noise] back\nDown it gets batch\n\n\n\n[noise]\nOh\n\n\n[noise]\n\n\n\nOh\n\nUh\n\n\n\n\n\n\n\n... you can do in in\nOne little moon nice ... yeah\nYour blood yeah\nRun in the movie lions ... names and\nBoy and you have kids\nLike in\n... and\n\nUs just same as they\nOne in a movie like can you\n\nTell a\nUm\n[noise]\n\n\n\n\nDriving\nCNN way you buy much drag\nCNN do\nDay you know just a ... is\nOn the other\nWay by money back\nMy gosh new baby\n\nKnow\nOh\nTry\n\n... ... ... ... ... ... you\n\n\n\n\nKnow I draw\nThe line ... ... ... oh my God\n\n\n\nThe\n\n\n\nOh\n\n...\n... ...\nAnd when they\nGo\nOh\nThe jury\nKnow\nOh my\n\n[noise] [noise]\n\nOh\n...\nNew ...\n\n\nBrand\n[noise]\n[noise]\n\nYeah\n\nTo hold\nGreat\n[noise]\nYeah\n\nYeah\nShe\n\n\nI\n\n\nMe\nThey know this is true\nThe\nMan\n\n\nFees and\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\nYeah\n\n\n\nOh\n\n\n[noise]\nOh\nYou're listening to relax radio I'm eighty nine ... W. J. C. G. H. D. tree Jacksonville, Florida\nOn all things considered story starts with new who when is set to become the first female Army Rangers ever\nThat day when he wanted to follow it conversation from a one anyway\nThe military uh we just female everybody down to one to get her on the snow and\nWelcome to the program started market thank you very much I Want to start just with your reaction\nThere's more to every story on all things considered every afternoon\nWith the afternoons for forty six eighty nine nine WTC to your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\nEric clear\nWould love to stay\nLast ...\nBut for Heather and Dave [noise]\nTheir radio\nThe movie is Daphne no\nMay just be passing fans they\nBut oh my\nI'm not here to stay\nGo when long long way after\nJohn ...\nBrawl Jimmy jumbo\nDarryl only made of clay\nOr stay\n\n\n[noise] [noise]\nVery fine I'll\nDeal a by a\nA\nTend to\n...\nYou know a lot a\nUh\nA\nTall a\nBomb on my\nUh my name's Steve ...\nOh my oh my\nA yo yo\nMa ma\nI caught it on a on\nNo no no no\nI'm a\nA\nTall oh I'm\nA [noise]\n\nAnd I wonder why\n\nWhere did I wearing\nMy city\nI Know they used to\nMe na\nJunior\nMine mine have and I don't\nAs I Know my ... the black man you know\nLove and so on why\nYeah but even in bars and ...\nJust below the\nMan in New York they\nYou know the ah\nWish all the baby on my mom a\nPlace though the strain training\nBowman I'm my\nMoved out oh man\n\nK. but I don't care ... was\nMan on a new\nBaby and I\n[noise]\nIt's cool to Reno ... no one in the early ... you mean\nBy a\nMan of love you\nGot a little cooler and you know\nWe get\nKnow when\nJust me again well\nMay be the one\nOh borrow no\nHe was not that\n\nMuch she\nScene and so\nThey made\nLike three man\nOh\nWhy\n\nOh why\nOh why\nOh\nMy\nGod\nThat's seen to\nSay I mean let me see\nOh oh\n\nOh no no no no\n\nNot really the real\nMan he\nWas\nMaking thing\nOh ... oh\n\n\nLot of things it's just been\nWhy do almost like being bussed in la [noise]\nBad it was long at all my beliefs\nThe race why it's almost like being\nI'm from the way\nWill not well thought\nWas when I was on the way I\n\nMy\nI'm from the\nNot what\nI Would say I was\nI thought oh laws like the law oh\nYeah\nNa na\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] he\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\nI don't really know how\nHave I have\nA train man then oh\n\nThat I'm\nIn a town hall on duty and I mean can be paying\nThem\nThat um how na\nNa na na na na na na na na na\nNa na na\nNa na na na na\nNa\nNa na na na na na na na na na na na na na na na\nNa\n\nNa na\nI'm\n[noise]\nI've been in my mind\nAnd along\nNa na na na na na na na na na na na\nNa na na na na na na\nNa na na na\nNa na na na na na na na got\nHim\nWhen parents than any other thing\nWant to always been men in black guy\nNa\n\nNa na\nNa na na na na na na\nNa na\nNa na na na\nNa\nNa na\nNa na first\n\nMan\nA man\nA man well\nA\nMan\nMan\nMan with a\nOh I'm\n\n\n\nI Want my\n\nShe did\nMan\nTreated\nWith ah\nThe\nAh being a\nMan\n[noise]\n[noise]\n\n[noise] and\n\nI'm getting\nYou\n\n\nHe\nFeels really\nPlease\nKnow again\nYou know\n\nKnow that no\nYou know he\n\nI'm going to\n\n\n\nBe\n\n\n\n\nYou're listening to relax radio in eighty nine nine ... W. J. C. G. H. D. tree Jacksonville, Florida oh\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION connection with\n... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will on your boarding wherever you are when you choose to spend tomorrow MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine by W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life\n[noise]\n\nBeep beep beep\nAnd I\n\nSeeing young man\nWhen the ... name Yung the link in the way you know when you only being\nGet out of bed and\nThe Lincoln did\nLead da dum la\nLa young man named them\nLand ring the bells mainly known as the mayor real\nName my thing is low but he let them know believe\nI'm not a\n[noise] Mm\n\n\nA star is born\n... as a gift or to\nDo the ...\nTo make your ...\nA dollar\nOf a oh\nNo no no\nShow a a\nIs a\nBut the oh\nJeez\nLike oh\n\n\n[noise] [noise]\n[noise] ... ... ... ... ...\nHe sees it and you can\nThings for you and why\nLame and\nTeach ...\nAnd Lauren\nMe when\nA key role\nIt's just nice\nAnd only\nLong Island the\nAll the\nMain main the main\nOf your knees\n\nMeals a day\n[noise] now I live in\nChina but I have I mean\nMan\nMy God oh my God do you live\nIt really is not about the day in my office [noise]\nOh out of a black and\n\n[noise] [noise] [noise]\n[noise]\nThey they\nHuge the two\nNa was uh\nOh\nUh no\n[noise]\n\nDo\n\nAh nah\nAnd he\n\n[noise]\n\nNo he is good\n\nOh oh oh oh oh oh well\n\n\n[noise]\n\n[noise]\n[noise] [noise]\nThe music of your life you're listening to relax radio on the on eighty nine nine\nW. J. P. T. your community your\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[laughter]\n\n\nNah nah\n\n\nNah nah nah nah nah\n[laughter]\n[noise]\n\n\n\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [laughter]\nYou're listening to relax radio at eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida\nAll things considered goes where you are and takes you places you never thought to go\nRight now the wildfire thread in the Pacific northwest it's just not my ten years since Katrina bore\nBrown in Ferguson Eric Garner in New York to me or rice in Cleveland\nIn Kentucky today county clerk who refused to issue marriage licenses\nThere's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine WG your community\nYour world broadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax the radio W. J. C. T. eighty nine nine each the three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nThen and now\nThey make one more minute and a great big where\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\nAh the the donors\nThe yarn in bringing the we use\nIn the ... issue where it is\nA you run your heart is the movie is where the ball to Rick I'm new to you know it's been wrong\nThere is to use it in a new way to use the ...\nThe new me mom I Know no no no not\n\n... ... ... ... ...\nAnd a new law and a ...\nOn and and you know ...\nI don't know but ah been\nDead or dying from nine\nLot I just my move\nDown ... do\nChange a I'm a mind\nAnd uh and I knew all gone down by the by the\nNews he wrote me a\nBus so that the\nThe ban on\nMen in a dam\nAnd a blue ball around and you know\nI'm being ...\nAh\nI'm On a cash in my hay\nAnd pick up on a piece of land\nAnd build myself the cabin back in the ... you\nKnow in their ... and making\nA deal that gun and then\nWhen they do we're not the change in tone\nNow re and I'm not and\nIt's all around and on and\nOn a dynamic going on for a long and\nJohn and Loren\nThat any down a little embarrassed at all and bomb\nBond up and and not only\nAnd spam\nAnd up to or a\nDo John and John no one to do\nMaine in Maine in pain and\n... do bone\nBegan on up and then they go\nAll out ban on his lap band ... you know\n\nDo the ... not ... not\n... laws shine\nYou know somewhere in\nThey\nDo better\n\n[noise]\n\nKnow for some\nNeeds some track\nOh\nI'm I'm pretty\n\nNa\nI'm\nSee that\nKey ball\nKnow may know\nMe\n\n\n\n\n\n\nMm\nBurger\nNo no no no no no\nAnd you\n\nKnow and\nAgain and\nIn New haven\n\nBorrow exploited right on the shelf when\nThey've got a lot of\nShell but the fact that I\nTo watch her show I paid\nLegalize supply\nAnd feel badly\nAbout that and she told me\nBack as a green was with our\nOh I see\n\n\nOh man\n\n[laughter]\n[laughter]\n\nOh [noise]\n[laughter] [noise]\n[laughter]\n[noise]\n[laughter] nah\nNah nah nah nah man\n[noise]\n[laughter] [noise]\nI\n\n[laughter] [noise]\n\n[noise]\n\n\nOh\nOh ooh\n[noise]\n\nOoh ow\nOw\nOw\nOw\nOw\n\nOh\n[noise]\nBronx borough [noise]\nYou're listening to relax radio I'm eighty nine nine ... W. J. C. G. H. D. tree Jacksonville, Florida\nShoe deal [noise] does when Leonard Cohen died in twenty sixteen he left behind many unpublished poems and lyrics that some of which have been collected in a new book\nOn the next year we talk with his son Adam Cohen who wrote the introduction Adam also produced you want it darker the album his father recorded shortly before his death joined\nWeekdays at noon on eighty nine nine W. J. C. T. your community your world\nNews and information all day music at night and intelligent fund for your weekend this is it'd be nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine ...\nPlaying the music of your life will have much my music after the news from NPR\nWho's in the men\nHe does really or\nIn ... the woman who did\n... dam\nMimi em I'm pleased with the way he wins meal\nMe the animals are easy way out of the\nNation I Am amazed we now know much\nRight near well\nMaybe I Am amazed and blue yeah really you\n\nLeading the\nUnderstand\nBaby in the ...\nThe main the main oh\nMaybe maybe we need the\n...\n\n\n[noise]\nOh\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise] I Wanna be around [noise]\nSomebody breaks\n... twice a small\nSomebody's\nWell as well to be ...\nWho leaves you do\nAnd it's really funny [noise]\nWait and see\nI'm not going to be [noise]\nWe\nWhen I'm going to do\nJust weeks\nLong\n\n\n\nOh\nWell that must be rolling bay um about the role oh no we do\nYes I'm a big role or know main um bono role in all we can\n\nI'm All right yeah jak you also with sweet rock and roll acute you follow her rather do man ...\nWell I'm a female makes a a shirt and earn up but in some\nYes I met met couldn't follow your main mature and burn in some ...\n... ...\nA demolition derby\nDue to my\nCome to me\n\nLet me\nLet me give\n\nThe blue\nUsed to love my\nAh\nMay be the one\nMy ... this jumping\nSoon after all that stuff there\nI'm up in heaven\nWhen I'm In your ... their brains\nI don't show\nI just fell in love with your friend and they may be [noise]\nHave a call me baby\nThat's yeah that's right\nMy big nose was broken\nMy girl Marshall joke if\nThe rail line brand name brand [noise]\nDecember adults well mine are just trying to big time when they called me for me it'd be nice\nI'm up in heaven\nNo ... van brains [noise]\nI didn't need a show\nJohn Madden low\nWhen you're three baby face\nFred and Fred and Fred it may\nVery [noise]\n[noise]\nIt might be too late\nIt because I got up to date a date with a pack you know the good things that come with long or you don't have I mean I won't wait don't I [noise] but if you should ask me why are these the line I have\nBeen out with my baby they can't go wrong\nSimon right yeah well what's your not what may be got 'em all breath I haven't I have been out\nWith my man can be bad if he's so good man never been\nQuite a bit on me and I keep\nOn non cable bill beach\nSailing goes on for him in ... one\nBright shining on my human land on my man over\nThe world have been I don't know what my baby can't go wrong because I Am an right\nAt me when will they be big they may be nice\nWhere they stand around designed it right now I think that that\nAvon not and that may or may not threatened in my day went up by China might should ban on my day I\nMy bank they design and that's why\nTo day and night they did not\nHave been out with my baby can't go wrong\n'cause I'm In right in your not what may be got 'em all ... I haven't I have been\nWith my my man has to be bad because he's so good but now it's been quite a bit by me\nAnd I keep on non cable will they'll be smooth sailing goes on for him in line\nWith us Brian Sharp on my on my man\nHave been a woman with my baby can't go wrong 'cause I'm In right at me when will they be big they may be too high [noise]\n\nYou're listening to relax radio W. J. C. T. eighty nine Ninety three Jacksonville did support this music service and W. J. C. T.\nPlease call three five three Ninety five to eight or ... J. C. T. downward\n[noise] well", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "06"}