{"month": "10", "state": "FL", "station": "WJCT", "content": "Novel uses\n\nTo you again\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nOh ...\nReunion ease the my\nI Know\nMaybe not like bizarro\n\nNa na ...\nOld a ...\nAnd all\nI'm like nah\nAstronomy in\n\nLot more than ...\n\nWater boy oh\nLast job long\n\n\nN O o not throw\nGood and burn a hole through about ...\nAnd\nPresident Trump celebrates a new free trade deal with Mexico and Canada we don't take it as a privilege is a privilege for them to do business with us [noise] and I'm not talking about Mexico guy I'm joking about everybody\nEverybody but what does that mean trade wars continue our trade may be changing\nOr the next MORNING EDITION from NPR News tomorrow morning starting at five or eighty nine nine W. J. C. to your community your world\nFrom ... to acoustic music listened to after hours Monday through friday nine PM only an eighty nine nine up in your community your world your music [noise]\n\nYou're listening to eighty nine nine W. J. C. D. Jacksonville your community your world bring continues overnight look for a lower Seventy five partly cloudy Tuesday were scattered showers and thunderstorms hides in the mid to upper eighties\nOr could connect spring view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and your that President John Delaney\nThis is just a terrific program that's really rejects no thanks thanks for what you do and what what station does\nOn militarized yes I did with first her connection every weekday morning at nine and a rebroadcast here every night at eight pm on eighty nine nine Getty Jay peak the\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listen anywhere it W. J. C. T. news\nDot org you're listening to relax radio W. J. C. T. eighty nine nine HD street Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\nA new um\nOr would you rather be a fish\nA fish won't do anything but then\nHe ... his name or read a book [noise]\nThe bullet there's only saw\nThough he's slippery they'll get caught but then if that sort of\nYou may grow up to be a fish\n[noise]\n\nAnd new kinds of jumped up separates those yeah then I Know ...\nYou made but it you\nKnow ... years old to\nThe ... the new oh\nYou're good to be swinging on a ...\nWho knew\n\n... to\nTo me [noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise] [noise] oh yeah and\nAh\n... that ran the fix up that writes in a judge were reading is being no\nDid a dream points out the window and wearing a jacket and yeah I'm trying to go down the government can\nDon ... why do you know what to do so in that no one really yeah but no one can feel good then would gain donning ms ... nine when there's\nNo money\nBring any guide and there\nMake and\nDi\n\n\n[noise]\n\n\n\n\n\n\n[laughter]\n\n[noise] [noise]\n\n[noise]\n\n...\n... ... ...\n...\n\n\n\n[noise]\n[noise]\nAnd\nShe\n\nWhen we go\nMom look thanks to stick\nYou're\nGoing to see you\nCan just\nWant to be some\nShaking the shack\nDon't know\nCould show can only chance\nSonia whisky\nSong on\n\n\nThe show\n'cause you're\nFish [noise]\n\n\n[noise]\n\n[noise]\nNa\nNa\n[noise]\n\nWell\n\n\n\nRussia have they go ...\nBecause you're a\nBeach so they go on a\nSo late go by\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\nMm mhm mhm\nMm\n\n[noise]\nRadio is your overnight music service brought to you like W. J. P. T. eighty nine nine us\nYour community your world [noise]\nEvery day NPR's all things considered including news that keeps you a head of the ...\nIf there was not important enough for us to draw a line of the sad what issue is plus the unexpected\nWinning the skin and neck the hard you making chicken meatballs and cooking the knee cartilage\nAll things considered from NPR News weekday afternoon for forty six and eighty nine nine WG CGI in your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\n... you're listening to relax radio on eighty nine nine\nPlaying the music of your life\nThat much my music after the news from NPR's\nHave oh\nSee who\nKnow jeers no [laughter] [noise]\n\nYou know\nHour oh those little dreams\nYou\n\nKnow oh\n\n\n\n\nMy gosh that love was over\nAny ... any me reassure intended to\nBut we just couldn't couldn't say good bye\nData rope right down in grabbing\nAre too high and we just did it and say good right\nI mean that was striking\nWho is ... how did you sing to say and\nBlue gone I miss you if you go so I ...\nThat we just didn't I didn't\nOne minute they can work on the back together again\nChoose what how did you uh [laughter] but I'm not a bum\nThat's what I was trying to get through the floor\nWe're going to miss you if you go so I went back ...\nBecause last week on\nThat right\n\n[noise] [noise]\nGeorge ... cheese and so\nIt's it's hard he can rent\nOh was it\nWas nice to you\nKnow how the lady and no oh no no\n\n\n\nI'm\nNot even\n... oh\n\nI'm\nLot\nOn his ... Mm\n\n\nSees\n\n\n\n[noise]\nOh my yeah oh\n...\nOh\n\nFor me to really get the million man maybe\nEven\nIn the Senate\nNa na na na na na na na na na\n[noise] [noise]\n\n\n\n\n\n[noise]\n[noise] and and and so\nLady I was paying ... known\nNow again we\nYou\nI Am a\n\n\n\nLady\nIn\n\nHand you\nAnd I had\nA yeah na\nNa\nNa\nNa na\nNa hey\nHey hey hey hey hey\nWhy\nNot you know\nI actually\n\nSaw a guy\n\n\n[laughter] Bye bye Bye bye Bye bye Bye bye\nYou know they do in the end of that\nAnd don't let the start getting your I Know about\nThe new man in a new manning nah I can do manage a\nMatty a through moves or change your mom\nJane you're buying it by\nBy and then through the ...\nThe day the new Matty day and\nThey do they not be low\nMad and I thought oh please keep your hard\nOr you don't do well you know oh\n[noise]\nSo bad the trip you\nAbout around\n\nA new\n[noise]\n\n[noise]\nUm [noise] um [noise]\n\n...\n\nMy\n\n\n\nYear old\nBlack ... this may\nI think goes up and I'm\nThe ...\nBut on the inside [noise]\nThen a ... ... it's raw [noise]\nSure [noise]\nBut what John I\nHear your on\nAnd\nYour Bernie Sanders are\nYou you are a lover\nFor a\nMan\nA man\nVery very dumb\n\n\n[noise]\n\n\nYou\nBorrow a lover a way for\n[noise]\nMagic goals\nLast June Colo [noise]\nThat like\nCoal Luo\n\n\n\nFind out how you can lead to relax radio twenty four hours a day that the W. J. C. T. dot\nOrg slash relax a lifetime of music waiting you relax radio tuned in to the music of your life\nEvery day on MORNING edition it's the news you can't do it It's MORNING we've been looking at what's happening\nOr conservatism libertarianism in environmentalism religion\nWere not props were just everyday people in the crowd visually since the start [noise]\nListen to the next MORNING EDITION from NPR News\nWeekday mornings beginning at five one eighty nine dollars W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent funds for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\n\n... ...\n\n\n... ... ... ...\nA no you don't know\nDo it don't matter\n[noise] a nuclear\n[noise] did you ever any no no but I don't know\nLonger do when I'm On a ... oh I oh ... well ... I don't think it was All right\nUp there they know you know ...\nWell a ...\n... do you I\n... ...\nDry ...\nI remember in ... and I\nDon't think so\nThey know you're going oh\nLove learn all you have a ... too far off\nA minority you call a mom\nOr a A R K and animal or\nA bomb or a ...\nHow long a A R U M O o ... o a fair I don't\n... ...\n[noise]\n\nOh\nWe'll be oh\nWell we do\nAs a\nHandle ended up you\n\nI\n\n\nI Know\n... oh\n...\nOh\nWell we have ah you\nKnow\nWay\nWay man ah\nOh\nUm\nUm a\nMan [noise]\n\n[noise] what\nKnow I dont know while the\nThe the spread of the man I Love me and I just\nGot a chance that they want it never knowing that it came\nI just leave my friend is see\nHe stopped and raise decides to my\nHis eyes were not ... I Know we're not around me\nAnd I'm like oh my\nGoodness I never know\nBecause it gives\nWas a long long I Want to do next you know ...\nI met my birds railroad my mom was\nSean and write it\nKid or giving you\nI Know my name as my\nHas never been to get the\nMob yeah na na na na na\nVe make is that is to say to you\nAngel\n\nUrbina now the kids in a male\nAnd uh the Bronx and uh you know there's so many\nAnd honesty and the reason for making\n...\nShe was a lot of raw who grew up the answers why it's really killing\nThat he's willing to me were the\nBig down whether it's\nClean the same thing again ...\nHe's watching their share then they cook he should he\nDoes but don't forget that's what you get sold for making the [noise]\n[noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\nOh man what did you get to spend and she feels neglected and eat the fact that I'm making\nUp the\nShip so low low barrier you know he doesn't he doesn't he\nSaid these big Lee but she said is he he's making over because\nHe didn't get to\nSee the same as you do that now\nThat the judge was really liberal you\nKeep thinking it's cheaper than making\n\nUs better keep I Know it's cheaper than me\n[laughter]\n\n[noise]\n[noise] your just\nFall into a code word\nGolf [noise]\nOh\nA row and I may or may dress on well\nYou're much too\nHappy to do show no\nYour mom\n\n[noise]\nNew\nMan Webster's Dictionary and so\nOn borrowers along\n[noise]\n... ...\n... well\n\n[noise]\n\n\n\n\n[noise]\n[noise]\nIs it [noise]\nShoe bomber\nWell I'm a\n\n\n\n\n\nHe\nYou know what\nI'll Try it yeah [noise]\n\n\nOh [noise]\nYou were in\nA I'm\nA\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nFind out how you can listen to relax radio twenty four hours a day that W. J. C. T.\nDot org slash relax there's a lifetime of music awaiting you on relax radio tune in\nTo the music of your life [noise]\nOne minute after five in the morning the president of the world bank is calling one minute afternoon\nNew York city authorities are investigating a second deadly crane collapse\nOne minute after five in the evening the commander of the joint African Union has one minute after eleven at night\nAt least one tornadoes reportage us touched down\nWhat's happening what's known what's next one minute after the hour every hour every day from NPR News\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life will have much my music after the news from NPR's [noise]\n[noise]\n... league in a hurry and saw the\n...\nThe men are strong\nMinded I Need them now\nGood job\nMend na terrain [noise]\nNot trained\nThen saying any\nThree judge library\nThe lead me to give me how many\nThere now and then he ...\n... years showing you the same man\nAnd the league that many friends on\n... yeah\nSay I am\nLead me to give me ... panning\nThere now and then he ran not\n\n[noise]\nOh\n... ... ... [noise]\n\n[noise]\n\nHey that job you know\nSwing and down the street so bad they breathe nobody or maybe do that yeah that's the low maintenance than I Do pay then charging um\nMe you're just do the job then that's all\nAnd\nYou know I\nThose don't do that then then\nHey na charge you know\nThere's another job G. T. inside\nDo a lot of change that he\nLoves the job\nDrill that some one you\nThe reality t._v. you can always\nAway or you\nKnow changing ranging your fellow\nFrom there\nHad any bad John gig\nThe John Jay Z inside they caught on and on July\nAlive J. D.\n\nJohn\n\n\n[laughter]\n\n[noise] [laughter]\n[noise]\n[noise] [noise]\n\nOkay\n\n\nShane Shane okay\n\nNo no\nWell loved them from going into a ... no\nNo ... or the new\nBeen ...\nRonan Navajo little leave the big John too good to\nDo read a little bit\nBut it didn't you\n...\nRole and I know who would have been drawn and did very\nTo be a\nTo do\nJust I Do read you the being\n...\n...\nNo no literally they John good it\nReally my head due to the polls\nNot on the\nWorld and no they they made John too good to you\nKnow read you\nPaying\nMinimum between\nAre they didn't ... yang\nWell just well even those low\nWell it was a new role plays a\nModel a what a lot you know ...\n... was mine too good to you\n\nAre you know watching the ... I Wish I knew them and find new how you're doing ...\nAre you know I mean I\nWish I knew how you doing to me but I have\nRight now mainly again my I'm\nIt's not you know my mom\nMe I knew\nAre you know I may have by all means you have to call me like I Know\nA\nUsing your mom\nMe out a way\nHow are you know I didn't know what I mean by all means you don't have that perhaps you follow\nMe and I got out\nBed and went out and\n\n[noise]\nI\nIf ... was\nIt a little road trip\nWe're the super\nBowl or two or\nThree in me\n...\nA de\nOh man yeah\nHe really\nIs a good thing it all\nIn your new\nA donor really\nOld man named bill on the\nOther\nA a\nReally\nHad a\nA low\n[noise]\nRelax radio is your overnight music service brought to you by W. J. T. T. eighty nine nine ... your community your world [noise]\nWell below a boom boom boom\n\n\n[noise]\n\nOw ow\n\nDa da da\n\n\n\nDa\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nFind out how you can listen to relax radio twenty four hours a day that that type of your J. P. T. dot org slash or lack\nThere is a lifetime of evacuating you and relax radio tuned in\n[noise] President Trump's celebrates a new free trade deal with Mexico and Canada we don't take it as a privilege is a privilege for them to do business with us [noise] and I'm not talking about Mexico I'm Talking about everybody everybody but what does that me as trade wars continue how trade may be changing\nOr the next MORNING EDITION from NPR News tomorrow morning starting at five or eighty nine nine W. J. C. T. your community your world\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nSmile to attempt to ... these are\nAll ... way\nToo hard or ... oh\nMany dreams\nYour job because\nThe uh the\n...\n... is a\nGrow lonely\nLovely ... a\nIs a\nWall e slow\n\n\n\nI'm saying\nMaybe next\n\nYou sent me greet\n\nMean\n\n\nMe some\nMe a hundred\nAnd you said the brainy\nE [noise]\n\n\nNah throughs onto a fair and you know the other three were like oh\nWe could hear the\n... see to see\nYou have to learn how\nDo go\nLow though we know\nThey are they grow a lot\nBetter\nWay to do those voices ...\nSee Bruce na\n\nNa those where it's a non why\nWe wish you know\nI'm not\nWe could he the ring\nThey seem to say\nYou have stolen\nA no\nOoh do we\nYou know\n\nSunshine\nSunshine\nOr shine\nMan a\nThe sun is shining down\nA shy\nA ...\nOr shy\nBreathing machine deterring\nA shy [noise]\nA shot\nA ... a\nShy\nOr shy and\nGod son\n[noise] [noise]\n\n[noise]\n\nThe thing is All right thanks\nThousand\nDollars somebody from\nThat's all\n\n\n", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "02"}