{"month": "10", "state": "FL", "station": "WJCT", "content": "\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nWe reached the end of our show but\nIf you want more taste test you can hear an encore\nOf one of our past shows right\nW. J. C. T. eighty nine nine\n\n\nNext time on the world doing a few stretches because it's a hard karma remembered thing Hod this tourist is warming up to ... ... you might know it as Australia's errors rock\nA landmark is sacred to aboriginal people and they're about to ban climbers from Iraq out of respect or to get that but I respect that the rock is older than them to\nWhat ... means in Australia it's on the world weekday afternoons at three on eighty nine nine W. J. C. T.\nI. M. major wicklund host of blues arise in the best in classic modern blues is now on twice a week blues arrives on Monday and Wednesday nights right here on eighty nine nine W. J. C. to your community your world your music\n\n... you're listening to eighty nine ... jak from town definitely J. T. T. dot org brain permission on our program are scheduled pan news from the news\nEvery day NPR's all things considered includes news that keeps you head of the curve if it was not important enough for us to draw a line in the sand what issue is what the unexpected\nWinning the skin the neck the heart you're making chicken meatballs cooking the knee cartilage\nAll things considered from NPR News weekday afternoon for forty six on eighty nine nine W. J. C. T. your community your world\nBroadcasting from Florida palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax the radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after that news\n\nWhen I'm lying to me sounds like\nOh\n\nKnow\n\nMe I'm like\nOh no\nI\nDon't know what I was on\n\nMom's side\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\nNah\nNah nah\nNah\n\nNah\n\n[noise]\n\n[noise]\n\nOh\nSo they knew they\nWere there this\nOh I Know there was no no no well when I was a way\nTo do\nIs uh so what are you\nKnow well there's\nA new\nDog and I wish I knew what to\nNow and again one day\nIs the name so\nThose are the words maybe we're living in it the God you know\nI don't know\nDoes it\nI don't know do their jobs you know otherwise may be wrong\n\nBut you know they\nThey don't know if it were they did\nWell what about what we'll do the job\nThey wouldn't let it will be bought off by maybe Bobby maybe you'll love it\nI thought oh you know we\nMay may boating\nMaybe they\nDo\nThey do do do they know well they they know how do they how do you really do maybe maybe maybe maybe maybe maybe we need\nTo David\n\nDavid ... is that what they do they do they know about\n\n\nWhat do we know about how\nThey do they do they do it I didn't you do do do do do\n\nDo that by law blah blah blah but I don't know what maybe well we\n\n\n\nThat my\nMy\nUsing and I come from a\nReally good I\nThere are\nThey\nHate I screamed la\nLa\nLoan she said\nI\nSee very many\n\nUsually do\n\n\n\nUm\n[noise]\n\nGolf\n\nBall you\n\nI don't know I\n\nYeah\n[noise]\nI don't know [noise]\nBut [noise]\n\n\nNa\nNa na\nNo\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\nYou're listening to relax radio W. J. C. T. eighty nine nine each day three Jacksonville we play the music of your life twenty four hours a day to support your music station please call three five three Ninety five to eight\n\nMaybe you were\nBut that was yesterday\nRush to my mom just going outside\n'cause that was yesterday\nA lot of Julius\n\nA\nAh [noise]\nKnow what I Know\nSaying it shows\nLong\nDo you\n\n[noise]\n[noise]\n\n[noise]\nMan\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\nWow [noise]\n\n[noise]\n\n\n\nOh\nOh\n\n\n\nWow [noise]\nYou're listening to relax radio at eighty nine nine ... W. J. C. T. H. T. three Jacksonville, Florida\n\nEvery day on MORNING edition it's the news you can't really It's MORNING we've been looking at what's happening\nOr conservatism libertarianism in environmentalism religion\nWere not props were just everyday people the college is really this is to start [noise]\nListen to the next MORNING EDITION from NPR News\nWeekday mornings beginning at five or eighty nine died W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax rainy out an eighty nine nine is\nPlaying the music of your life\nHave much my music ... the news from NPR\nNo I\n\n[noise]\n[noise]\n\n\n\nIt's just another scene\nFrom the word\n\nYeah than not lie\nAt some law\nI'm not saying\n\nBut again\nIn the\nVoyage again more of an\nMe\nAnd it's a game ding\nYou can do that in ...\nThe guy that hey I'm\nWinning in\nThat ah ah the\nMan is not a game and then um\nBible they knew when I'm going to\nDo just shed into Barney\n\nI Love you know I\nReally\nMade\nA lot of the better than around\nKnow there you go to\nThere you go your guy\nAnd ah\nBut then do they call a\nNon ...\nAs well as you get for ...\n\nDid you get caught up in\nThe\nRight thing and in a gang\nDing\nThe\n\nNa\nNa\nNa\n\nNa\nNa\nNa\n\n\n[noise]\n[noise]\n\n\n\n\nA ...\nGave me a\nNo\nNo no ...\n\n...\nKnow that much\nOne yo\nYo Ma I with all\n... is um\nYou\nMan\n\nGod no kidding I'm\nOh\nThe\n\n\nLa\nLa\nDay\nMad\n\n\n\nIn\nLa [laughter]\nGod\n[laughter]\nTo be and\n\n\n\nAbout what adopt Jonah but we bombed the mind works\nWell sort of doing that tells us how to live and learn seems to be learning to live in spot number one nature boy\nBoy\nWell ... ... or\n... o ... o\nA little show and stuff out of all about\n... or\nA bird won the\nMagic ... my ...\n...\n... then ...\nGrade as\nYou ...\nYou know a\n\n... and ...\n\nBad one\nMuch your day he was\n...\nDuring the\nGreat is\nThat your ...\nYour ... or\n... you know\n\nRadio Welcome your comments\nSend your common to relax radio at W. J. T. T. dot org\n\nU turn the tables on may have no\nAnd now I'm ...\nA ones do I ... I can go ... laid me I'm a\nGrimaldo ... or ...\nDying lab someone I Know\n... na na\nOut at night\n...\n...\n[noise]\n\n\n\n[noise] [noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\nMm\n[noise]\n[noise]\n[noise]\nRelax radio is your overnight music service brought to you by W. J. C. T. eighty nine nine is\nOne minute after five in the morning the president of the world bank is calling one minute afternoon New York city authorities are investigating a second deadly crank collapse one minute after five in the evening the commander of the joint African Union has one minute after eleven at night at least one tornado is reported to us touched down\nWhat's happening what's known what's next one minute after the hour every hour every day from NPR News\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\nI guess\nI Know that I'll\nBe ... you\nKnow when you think maybe I\nOnce in a while\n[noise]\nNo not at all [noise]\n[noise]\n[noise]\nThis is\nThing\nHe\n\nA you know\nAny good news\n\n\nSon\nBut um [noise]\nMy\n\nSay not\nI Know that every chance she gets you give a break the promising young broke loose because I'm not so young and not so promising but could not saying one whether or not oh please I owe folks\nNot is thinking it over he's looking down at the keyboard\nI mean I get the same with the famous can't go to you\n\nI Know why wait at a low a I've been blown up praying each night or someone\nLike they like you know why should we spend money on the show that you know that's that is taking a new one does really love scene lag rely do you make me feel so ground\nI Want to handle well do you\nYou seem to understand each game I'm scheme in a dream my dream is not know why my mom uh she taught me to be true or not he may leave some one is that they like you\n\n\n\nKnow I Know why my mom oh\nShame job maybe to bitch about she made me some one new\nIs that they like you\nKnow [noise]\n\n\n\nNeat starry sky where\nAnd you can get it if you\nStrolling with one girl\nLying sign up to a\nWork and you can do that but and you can get it if you try\nSome want now waiting at the cockpit door\nWhere too hard to come one\nCould I add anything more\nNice where you can get it\nA\nNice work you can get it and you can get it if\nNice what can you can get it and you can get it it\nI work you can get it and if you get in\nFor me\nNice work\n\nRadio is your overnight music survey brought to you by W. J. C. T. eighty nine nine us and your community your world\n\n[noise]\nOh\nWhile the ...\n... ah you know\nA\nA ...\nI I mean it's so\nBring this up\nI'm sure there's a\nLike a real\nUm oh\n\n\n\n[noise]\n\n[laughter]\nMy the the the the you know when the young\n... like do they need then again it was\nLike the drip drip rain drug but when there's no no no I Swear than\nMe keeps sweep the the ... you you know then\nNo no you need to\nOn the uh\nWeathered me to me you know\nIt's no matter where\nYou are I\nAnd day\nDay you know\nThat it is a long game boy you know\nIn ...\nIn a one line lonely\nNa na\nUnder the I\nEven know\nAnd it's\nMan I Love making love\n\nRadio overnight music survey brought to you by W. J. T. T. eighty nine nine ... than your community your world [noise]\n\nThen\nCan a bowl o da da da da\n\n\n\nDe\n\n\nIt's quarter to three [noise]\nThere's no one in the play except you and me and\nSo she set 'em up until I got a little story\nYou know when\nWe're drinking mine for 'em to the ... or ...\n... [noise]\nNaked one for my baby in ... was over\nA ...\nSitting so drop another ... Nicole [noise] in the machine\nI'm not feeling so bad that we should make the ... pretty good this is a\nGood job there were a lot [noise]\nBrought you got to be true to Rio ...\nSome might get one for my venue in one more for the ...\nNever know it but they are what kind of before [noise] and I got a lot\nTo say\nAnd the ... and I'm going to be sampling God on medicine to win too but it's all ...\nWell that's our new in your ...\nYour ... birthday access to clone\nThanks for this too [noise]\nI Hope you do in my mind then your you know [noise]\nA lot about\nMy ... my next book\nTo make it one for my baby in one\n...\n... ... [noise]\n[noise]\n\n[noise] [noise]\n\n\nMm\nMm\nMm\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nRadio is here overnight music survey by the by getting a JPEG eighty nine nine\nSend your community your well\nMORNING EDITION is everywhere else and yeah it's it's not as a result bureau NPR wondering how babies like reporting from bunkers these streets alleys jungles and deserts but most importantly\n[noise] were wherever you are\nStart your day with the trip around the world and wake up with MORNING EDITION from NPR News\nTomorrow morning from five to nine eighty nine nine W. J. C. to your community your world\nNews and information all day music at night and intelligent funds for your weekend this is easy nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\n[noise] you're listening to relax radio on eighty nine nine ...\nPlaying the music of your life\nWill have much my music after the news from NPR [noise]\n\n\n\n\n\nAnd then\n\nIn\nAnd [noise] and and\nThe weather is right now that's funder and like many things to be have their way\nNot as much as I Know\nIt's a lovely ... de ...\nThe German and the weather Willkie button to gather no I can honestly say\n\nGoodness\nIt's a lovely day and every thing no\n...\nIs that the lovely day to be called an ...\nYou were going on your way and now you got to\nKnew were leaving the scene\nClouds\nNo a lot of great bar ...\nAbout it really doesn't matter if\nAlong as I can be with you it's a lovely\nI don't see the sun um high though were called ...\nAbout it really doesn't matter if\nLong as I can be with you it's a lovely\n\nOh [noise]\nKnow\n\n[noise]\n\n\n\n\n\n[noise] ...\nWhen I was in ... my mother said\nTo me to come here and they go Lebanon\nBelow the eleven three maybe but you don't what do you buy\nLow level and my mother but to\nMe like very old and my mother loving dog lover and then you\nKnow I'm ...\n\nMiller\nKnow through the boy lemon Limbaugh double duty\nThe knees the lender ... eleven died in la\nA guerrilla tacos is we did when she smiled at the time I was rose in God\nWe had done this on the law and the low\n... maybe the lemon ... music\n... my father my\n\nJury that I really do yeah I Know them and allow alright sweet but those who do the lord I'm Jim Bob Michel\nDream parading the\n... pie sweet crude oh lord I haven't really thought it was really\nNo one day she loves to do\nWith all the ... to ...\nAnd in the door she left behind in you know she had\nShe left me for a no no no it's a common you know about ...\nAbout why there are no I mean the one to\nDo we really were written in\nThe road you know the more lead knew\n\nTree already do that and well we\nKnow the world news\nIn a really\nReally\nThe ... ...\n\nRadio is your overnight music service brought to you by Debbie J. P. T. eighty nine nine now send your community your world\nAge and every day\nSee them leading\nDun\nBig laugh and then\nA goat cheese\nIs saying is\nAnd yo\n\n\n\n\n\n\n\n\n\n[noise]\n\n... they we either and I say I never used a neither I say neither either either\nNeither neither labs\nGolf ball ...\nYou say what they do I say what\nUse they told me oh I was very Creole domain\nLet go low\n\nThen we love ball\nWe have all\nIt all\nEyes or ears the use they ours\nGonna be the the ... you say oh I\nWas let go above\nLaw [noise]\n[noise] [noise]\nThan we thought\nThat was\nSo I stay with them or\nYears they've been traveling\nShoved or what the problem\nOh we know we need each other so we call the ... ball [noise]\n[noise]\nGo go oh\n\n\nRelax radio is your overnight music service ... W. J. C. T. eighty nine nine I sent\nYour community or your world [noise]\n\nYou are just so young\nI I'm ...\nI'm ... movies\nToo\n...\n...\n\nThe only ...\n\n...\n...\nNo\nNew\nYork for a real small\n...\nLaurel I agree too\nOh oh\nI don't know what I mean I'm\nNa\nNa na na na\nNa na na na\n[noise]\n\nNo I'm\nNa\nNa na\nDuring a mom\n\nThe [noise]\n\nNa na\nNa na\nNa\nNa\nNa\nNa na\nNa\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[laughter]\n[noise]\n\n\n\n\n\n\n\n\n\nOh [noise]\n[noise]\n[noise] [laughter]\n[noise] [noise]\n\n[noise]\n\nMm [noise]\n\nNo\n\n\n\n\n\nRelax radio is your overnight music service brought to you by W. J. T. T. eighty nine nine other than your community your world\n\nOn all things considered story starts with the new to him is set to become the first female Army Rangers ever that day when you wanted to follow it with the conversation from a woman who was in the military we just email everybody down to one to get her on the snow and\nWelcome to the program started to market thank you very much I Want to start just with your reaction there's more to every story on all things considered every afternoon\nWeekday afternoon for forty six eighty nine nine WTC to your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org you're\nListening to relax radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\n\n\n\n\n\nOh\nThey just keep a late ...\nEarly in the family\nNa na na\nNa na na na na\n\nNa na na na\n\nNa na\nNa na\nNa na na na\n\n\nNa ve\nDanny Dunn luxury\nAgo you need I find that that\nKnow what he\nSaid no no no\n[noise]\n[noise] [noise]\n\n[noise]\nI'm not sure oh what\nDid he not\nDid I Know that are that are\n\nThe the the\n\nHe\n\n...\n...\nI'm In ah\n... who\nLittle bit needle size\nBut I like to\nMuch no ...\nI ...\nGo ...\nGo ...\nInto her ... or\n...\n\nThe way you on the like\nI ... it is\n\nOh lord\n...\n\nWe\nLike to\nGo\n... or ... or a\n... balls God\nWhere are you\nSuffered a\nOoh Mm\n\n\nThere may be true but why are they like music and love that\nLet's face it means that\nThey bought the land the plane\nWith a they got\nTo pay the bail\nWhy we still have the\nSpace Needle\nDo we'll\nBe without the ... coming at\nYou know and then there may be kids to share those\nDo while there's new life and music and the low then road man\nLet's face the music in day\n\n... ...\nNo no\n\nAll on the\nLine on the ball with\nOkay and I know the what are\nMine on\nHey my ...\nName of a crime\nKnow that\nOh you\nUsed to ah dot\nBust my ...\nSo why are they oh the\nWhy are they owe me\nThey my list style that\nOh\nHe\nOh jeeze\n\n[noise]\n... oh no grow\nUm [noise]\nA three and a new one\nOh man na\nNa na na na\nNa na\nUh\n\n\nOh\nUm\n[noise]\n\nGood you got me\nOh they love\n\nHe was a a\nWow\nYou\nReally na na na\n\n[laughter] wow\nA I'm a\n\n\n\n[noise]\n\nWhen I was a young man\nIf I may reach me with second\nWhy why why are we here\nIn Los Angeles I\nMaine several of\nThey grow\nWhen they all come when\nThe civil civil\n\nDoing those dumb\n\nKnow I\n\nA\n\nA\nAnd the red shoes for\nThe push is\nA A N o\nO\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\nRadio is your overnight music star to try to you and I got J. T. T. eighty nine nine us and your community your world [noise]\n\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION can mix it with\n... to peak at Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will on your morning wherever you are when you choose to spend tomorrow with MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine by W. J. C. T. community supported public radio\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life will have much my music after the news from NPR\n\n\n\n[noise]\n\n\nMean you\nKnow they\nDon't ship\n\nSitting\n\n\nAnd you\n\n\nWe\n\n\n\nPaying\nDi\n\nDi\nDi di\nDi\n\nAnd you know other than their\n\n\n\n\n\n\n\n\n\n\nYou John [laughter]\n\n\n[noise]\n\n\nNo ... do you prove\nHe's law ...\nAngels blah blah blah blah blah\nWhy all your movies ...\nUh you know at all to\nOh oh my gosh no civil law\nLaw barred go no\nA little ...\nOnto\nThe son of\nSure by him don't you grow a law but not\nSo much for\nWhile you sleep what do they um well do you\nA a dog ...\nOr ...\nOr you're a\nSnow ball player la la la\nIs a bar but no\nI uh by a car bomb\nTo the clubs that's not a\nSnowball my darling eating\nToo\n\n... no no no\nGod what have you but do you ...\nOr late\nIn ...\nIn the way\nKnow why\nNo that's a really dumb bombs have you\nLevel do ... ah do you know\n... ... ... ah not\nSo get the lead\n\nNa na na na na\nNa na na\nNa na\nNa\nNa na\nOh oh\nOh oh oh oh oh oh oh\nOh oh oh\n... maybe we can have a lot of fun and a lot of guys you\nYou are the cutest one more year does he\nLoves history [noise] bad day\nYou are the cutest well and so\nAll that a lot of people\nThey can see\nOr do you own a bang bang bang maybe\nWe can have a lot of fun in a lot of guys ...\nYou are the kids well\n[noise] [noise]\n\nA ball ball\nBall ball ball ball ball ball ball ball ball ball ball ball ball ball ball ball\nBall ball\nBall ball ball ball ball ball ball ball ball ball and so\nYou know why and I love\nYour baby to see\nYou on that song made ... we\nHave a lot of fun yeah a lot of guys you\nYou are the cute as well\nSo you are related you are the U.S the need is you are the cutest ... you are the cute as well\n\n\n\n[noise]\n\nI uh do do do\n\nDo you do I\nNeed you know ... ... ... ... you know\nHe told\n\n\nMe to the new leader May Day [noise]\nUm [noise]\n\nYork they do not do it they would say about that and they can do [noise]\n\n\nYou know I mean and it was a tiny [noise] need thanks\nManage behind me and I mean you know\nNot not only in the mid ... you can only imagine game [noise]\nUm [noise]\nWell hi Joan\n...\nAll right then and then\n\nSlowly the\nSo\nEasy you know [noise]\nThe ... the ...\nWould be fun you know the no\nThe ...\n\n\n\nReally don't pay us then thereby free agency or was scare the\nHell out of the\n\n... ... you're very they again\n\nThey\nLove it oh\nOh\n... okay and what well\n\n... ... ...\n...\n\n... oh\n... ...\nWell\nUm oh\nOh oh\nNo no\nI'm\nNot a ... ... oh\n\n\nNo\nA\nNon o\n\nO\n\n\nTo find out how you can listen to relax radio twenty four hours a day that W. J. C. T. dot org slash relax there is a lifetime of music awaiting you on relax radio tuned in\nTo the music of your life\n\n[noise]\nAnd\n\n\nUm she", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "08"}