{"month": "10", "state": "FL", "station": "WJCT", "content": "Nah nah\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[laughter] [noise]\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\n[noise]\n\n\n\n[laughter]\n[noise] [laughter] [noise]\n\n[noise]\n[laughter]\n\nReports tonight will be back Wednesday night at eleven right here on eighty nine nine doing JC moves horizon every Monday Wednesday nine eleven when I was part of doing JC team after hours doing JC any non non your community your world your music thanks for joining in mind [noise]\nHurricane Michael is a massive storm that could bring total devastation parts of our state\nOfficials along the Gulf Coast are preparing for a life threatening storm\nWe want to make sure that people are prepared if things go on certain numbers are coming here and we need to make sure that they have enough time to properly evacuated needed and protect themselves inspector property\nThe latest on hurricane Michael that's on the next MORNING EDITION from NPR News tomorrow morning starting at five on eighty nine nine W. J. C. to ... ... ... ...\nCrazy things happen when you translate crazy tax\nWe get lost in translation\nSunday at noon on eighty nine nine W. J. C team\n\nYou're listening to eighty nine nine W. J. C. D. Jacksonville cloudy and windy overnight there's a chance of rain and thunderstorms below around eighty one Thursday's going to start off cloudy buddy showed and mostly sunny and when they look for hype Ninety One\nOr can Michael is a massive storm that could bring total devastation parts of our state\nOfficials along the Gulf Coast are preparing for a life threatening storm\nWe want to make sure that people are prepared if these ... numbers are coming here and we need to make sure that they have enough time to properly evacuated me to protect themselves inspector property\nThe latest on hurricane Michael that's on the next MORNING EDITION from NPR News tomorrow morning starting at five on eighty nine nine W. J. C. T.\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org [noise]\nYou're listening to relax radio on eighty nine nine\nPlaying the music of your life will have much my music apt to the news from NPR's\nNo I Am all that I don't know [noise]\nBut I'd rather be on\nThe movies made so much\nBattle although I Am and\nYou know again\nIn ... oh\nI\nWent down the window\nAny ... me we sure intended to\nBut we ... and say good bye\nThey never oak right down in grabbing\nAre too high and we just do good and today the right\nYeah that was striking\nWith all this has been interesting to say in\nBlue gone I miss you if you go so I ...\nThat we just isn't the\nOne minute they the new back together again\nIn my opinion is moving in\nNews would have sent you a ba da da da da\n\n\nDa da da da da da\nIt's very easy to say\nYou were gone I miss you\nIf you go to school I went back\nBecause last week from\nThe I\n\n[noise]\n\n\n... I think she\nKnow a\n...\nNa\nNa na\nNah\n\n\n\nOh I'm I'm a I'm a\nMember no no no\nTo me I'm\nA\nIn\n\n\nBusiness Spanish and na na na hey hey\nRather hard to gauge na\nNa na na na\nNa na na na na\nNa na\nNa\n\n\nNa na na\nNa\n\nNa na na\nNa na na na\nNa na na\nNa na na\nNa na na\nNa\nNa na na na\nNa\nNa na na\nNa\nNa na na na\nNa na na\nNa\nNa na na na na na na na\nNa na na\nDa da\n\n\nLove that [noise]\n\nNeed we need to\nMove the\nOn me [noise]\n\n\n[noise]\nI mean we need we\n[noise] the people [noise] I mean to me\n\nNew\nNew [noise]\n\n[noise]\nRadio is your overnight music service brought to you by W. J. T. T. eighty nine nine is in your community your world [noise]\n\nI\nTo eat a\nSnowball\nOld standby\nIt's a wonderful\n\nTend to a dollar a day care and try\nChange\nIn Manhattan saying\nA mansion in\n\nTo see 'em\n... father some\n... for a few\nTimes I'm\nOn a dime a strong\nAnd human you know\nIn this poll for\nMonths from\nIn a time and I'm\nI'm On a lot about Scott I'm In\nAnd you learn a\nThe phone on the show\n[laughter]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\nRadio overnight music survey rocky you buy W. J. T. T. eighty nine nine ... than your community your world\n\n... on all things considered story starts with new women is set to become the first female Army Rangers ever that day wind ... conversation from a woman who\nThe military and we just email everybody down to one to get her on the line\nWill come to the program started market thank you very much I Want to start just with your reaction there's more to every story on all things considered every afternoon\nWeekday afternoon for forty six eighty nine nine WTC to your community your world\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. D. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\nOh\nOh\n[noise]\nI\n\n\n\n...\n\nThey've added ...\nThey can you tell me well\nYou know I'm a\nRead a lot of sleep\nIs seen as a young\n...\nCan you show me very young\nThe the young\nMan\nOr a bad\nYou show new or the no no\nDid a\n\nMan by\nYou know you are\nNo no no you know\n\nBe due\nBy the see the sun is going down and\nBy the changing\nIn the city and um the low\nLight and really the\nDo\nAnd then they live in\n[noise] then\n\n\n[noise]\nRelax radio here overnight music service rocky by W. J. P. T. eighty nine nine\nThan your community your world\nWhoa whoa whoa\nOh\nNo no I Am a I'm a drop on\nYou're much too\nDo show no\nYour mom a lot\n\n[laughter] [noise] uh\nBeing a new\nThan I Am the Webster's Dictionary\nI borrow a lot\nNa\nNa na na\nNa\nNa\nNa na stance on turned tail but I don't like that and na na\nNa na na na na na na na na\nNa na na na\nNa [laughter] time Lola\nGoing in that particular\nTo do it you know\nI mean I came on [noise] dying [laughter] kinda na na na na na na na na na\n[laughter]\n\n... now and I asked my head [laughter] dynamic than na na na na na na na na na na na na na\nNa na na I don't\nOn in the\nThing they\nI mean ... you know like\nI Can't comment on [laughter] I don't even know na na na na na [laughter]\nA [noise] na\nNa\nNa na na\nNa na na na na thank\nThe lord for a\nTime and all\nHave the kind of thing I did actually [laughter] no\nNot [noise] man [laughter]\n\n[laughter]\n\n\n[noise] ooh [noise]\n\n\nOoh\n\n\n\n\n\nRelax radio is your overnight music service brought to you by W. J. T. T. eighty nine nine I sent your community your world\nJust you know who\nI\nWell I\nA\nI'm ...\n\nI'm ...\nA ... right\n\nAnd\nI'm ... I\n\nI'm\n\n... who um [noise]\nMy mom lived a July ... see you got\n\nTo where\nThey go\nDon't mess with Mr between\nUm I'm\n\nTo fall in line\nThis and so I'm\nIn the nasal to\nI'm the I'm I'm trying\nWho's not shy\nMe like she will\nAround me I'm\nAnd I'm Glad\nTo the low lying\nA machine that\n'em\nTo see that you tell me I go\nOf a young man\nA\nYou told me I\nDown the um\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nRadio is your overnight music service brought to you by Debbie J. P. T. eighty nine nine us send your community your world\n\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION connects with\n... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will own your morning wherever you are when you choose to spend tomorrow with MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine dollars W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine\nPlaying the music of the airline\nOh yeah [noise]\nMean you know no no\nMe baby you\nBig game leaner rolling down the\nMain issue in line and\nView trying to\nMoney and then on the line in\nKnow and the young\nThe\n\n[laughter] [noise] [laughter]\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\nDay and they need me you\nKnow they made me your\nName your\n... the\nBall loudly and again and they want good the God I\nAnd what not\nThat I'm a man\nWhy one day and all\nThat well then you\nKnow a man on the the the\nThat run the rat they well Joe\nYou know\nThat I'm lucky guy\nSure they get you buy\nA\n\n\nFor ... ... it's been member\nShow to know much about the ... the some of\nYou\nThat I'm not ashamed to say the wild\nThat that was [noise]\nYou're just talking with the same color shirt that applied\nShocked skins jacket [laughter] you know the\nNot goes is that I'm In the house and Senate\nWay the the reason\nIs playing\nThe book and you can get\nThe baby learns the ball\nBut not enough I only have to say\nA man he jumps in the mountains so\nKnow but on a late night\nRight on man my rent surveys show for\n\n\nA\nNumber\nWay to better\nOf the\n\nNo no\nNo ... no\nNo we don't even have a new\nLove and try to do in the\n... the big John too good to\nWell ...\n... and you\nLove ...\nThe John Kerry\nToo piecemeal\nTo let them know that I'm\nJust had to read you the beans\n... been\n... D\nRealm I Know who would have been drawn the good news\nReally my head didn't do it all the\nD\n... made John too good to\nTo read you know the na\nMeans\nMany between\nThey didn't really know me\nWell you're well he knows a low\nLittle late in the middle way into\nMali what about you know\nI read a lot of times are good too you\n\nThe lead on hold okay\nThe man in jail or your hair and they would\nIn your home and then I'm\n... ... have you know\nOh I Know rap and they got a little while we're row on don't give me your ... and a while\nKnow I Am a\nKnow I Love you so I'm afraid\nA bad\nI Love it on a\n\nUnderstand why my I was a\n\nYou see\n\n... ... ... he he [noise] he he\nHe he he he he he\nHeld on them they will come on your phone calls he never known then okay mom in in ...\nHe doesn't\nKnow what I really don't want you to be\n\nYou know nine days later the punch\nIn\n\nWhich he does not like the one\nPlace where they were both like to\nGo very well she was like the reality was you\n\nKnow\nI don't know if you go to the street as a much\nDe la\n[noise]\nTo go to the gym looking out well no\nI mean I don't know [noise]\nUm I think you see all the things you might be\nUm [noise]\n\nThat might be tough to say that the bond [noise]\nIf I\nTell me\nA man in the fall and I ... know\nIn my uh\nI'm On the show I'm not really a\nOh no no\n'cause I Know and\nYou know I\nDon't know how ... no\nDon't have my by na\nNa\nThe\nTo see\nMine she says we are to\nAnd ah it\nBe bad and ah you\nOh good\n\nA\nMine the ones we have to\nAbide by a man or would you\n[noise]\n\n\nOh\nOh\n[noise]\nOoh ooh\nMm Mm [noise]\n\nOh\n\n[noise]\n\nOh\n\n[noise]\n\nRelax radio here overnight music service back to you by Debbie J. T. T. eighty nine nine ... than\nYour community your world [noise]\nAll things considered goes where you are and takes you places you never thought\nTo go right now the wildfire thread in the Pacific northwest in this month marketing ten years since Katrina bore Brown in Ferguson Eric Garner in New York to mirror rice in Cleveland in Kentucky today how county clerk who refused to issue marriage licenses\nThere's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community\nYour world news and information all day music at night and intelligent fun for your weekend this is easy nine nine W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax the radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nMan I mean I don't know I I mean uh that's about it and then um and na\nVe by\nA thing in in in a in a high\nSang in any event\nI hang\nOn hang on a on a na na na na na na na na 'em and\nNah [laughter]\nMy\nGod I'm a\nI mean I got\nA job [noise] hey I'm the same ah my name's na\nNa na na na na na na\nNa na na na I think about it then and then uh my name's nah they drive\nBad things about young I mean about event into\nA finance\nNa\n\n... [noise] [noise]\nIt's see it's the talk like this\nWe looked at each other\nIn this way\nBut I ...\n... when\nLook for what was your wearing the ...\nThe smile you are ...\nYou were smiling and\nBut I Can't remember\nWhere or when\n\nSome things that happen\nWhat was the first uh\n[noise]\n... to ... happened\nBut yeah\nI'm sure which means\nThat we're much just [noise]\nUm ...\n\n... ...\n...\n[noise]\n[noise]\n[noise]\n\nOr\n\nSome thing was the ...\nOr the first uh\nSeen to the happened like\nUm what was\nThat ... minutes before\nA live which is\nA ...\n\n... ... or ...\nWho ... ...\nWell\n\nKnows drainage design your head\n... ...\n[noise]\nThey began to try to try to\nAt goes ...\n\n\nThey seize\nThe energy and\n\n[noise]\n\n\nOh\n\nAll they're the ones who seems so no\nOn a map\nHow it all came\nLater no there's no\n... a\n\n\n\n\nI'm Jane\nNeeds to be\nYou\nThe case\n\n\n\nMe some of\nMe the case\nThat'd be really\nReally oh\n\nOh\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\nNah\n\n\n\n\n\nOh\nMm\n\nRadio is your overnight music service brought to you by W. J. T. T. eighty nine nine is\nYour community your world\n\n[noise]\n\nThe thing is All right\n\nThing\n\n\n[noise]\n\nThat's a sad time [noise]\n\n\n\n\n\n\n\nUnder much yeah yeah\n\nA nurse\n\n[noise]\n\n\nOoh\n\n\n[noise]\n[noise] [noise]\nIn ... where\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nSchools and they all knew in in ... when they\nAh\n\n\n\n... Mm\nRadio is your overnight music Saturday he brought to you by W. J. P. T. eighty nine nine us and\nYour community your world in\nThe Kavanaugh hearings and confirmation raised the question again how do we decide who to believe when a woman says she was sexually assaulted by someone she knows behind closed door and the men denies that\nThat's an issue universities have been dealing with and the next fresh air we talk with Vanessa ... author of blurred lines sex power and consent on campus joined on weekdays at noon on eighty nine nine that Jacey your community\nYour world broadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on any nine nine is\nPlaying the music of your life will have much my music after the news from NPR\nOh\n[noise]\nShow oh\n...\nKnow\n\n\nA\nIs today\nAll my trouble staying saw a ...\n... ...\n...\nYou really\nTo be ease\nHanging oh ...\nOh yes ... ...\n...\nWhy she had\nGo out on the low ... ...\n\n... no I long for yes\nYes ... who was such\nAn ease the game to play\nNow I Need a place is so high ... y ...\nYesterday in New\nI saw a\nLong\n... or\n...\nYesterday ... ...\n... Mm\nMm\n\nNo ...\n...\n... ...\n\n\nYou around\nThen how\n... na\nNa na\nNa na na\nNa\nNa na\nNa\nNa na na\nNa\nNa\nNa na\n\n[noise]\n\n[noise]\nNa\nNa na na na\nNa\n[noise]\nOh\nLa la la la la\nLa la la la\n[noise]\nThe only real man\nKnow\nI got\n\n\n[noise]\n\nLow\nOh\nOh\nNo I'm\nMom\nBald bald oh\nO\n... o\nGo about um yo\nWhile so [noise]\n\nI don't know how long do you know I Know my no ... no no and\nThey have a dream movie\nFrom ... to do\nAnd so on thank God\nI yeah I got my love and that\nBe about ...\nWhose job I ever did did you ... did the yet I\nAnd\n\n\nBomb my love and\n\nNa na\n\nNa\nRadio is your overnight music service brought to you by W. J. P. T. eighty nine nine\n[noise] [noise]\n\nAnd\nBe going down memory low in\nEvery way", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "11"}