{"month": "10", "state": "FL", "station": "WJCT", "content": "Yeah\nThe great big\nI Do know\n\nDo the young to wed your love conquers in the one\nYou in the\nShow\nWe'll go to any\nMaloney on over\nThere and then throw a are we know\nI'm first it's we know\nSo there's so\nIn the ... they\nWill make the\nNo\nThe city's glamour\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nYou're listening to relax radio in eighty nine\nW. J. C. T. H. T. three Jacksonville, Florida\n\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION connects with\nStumbling to peak at Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will on your morning wherever you are when you choose to spend tomorrow with MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine by W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax the radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\n...\nOne law we when we ...\nWe made it can't be meant we give living\n... or ... or\n\nA letter and gain\n\nAnd a gun then\nNeed to have\n\n\nReally do not do\n\n\n... design your\nNo\nNo\nThey they don't like to\nStill longing echoes says we're in\nAm I saying\n\nThey see\nThe ...\n\nSaid no\n\nNo no no\nNo\n\n... New York to charge a new\nOr law are moving\nTo me\n...\nHair or oh are you in\nI Know not\nBeer or oh oh\nI Do know\nGenerally try\n... uh do\n\n\nRelax radio is your overnight music service he brought to you by W. J. T. T. eighty nine nine ... than\nYour community your world\n[noise]\n[noise]\n\n[noise]\nIt's getting really\nAway\nSame that he had\nTo say the\nSeen\nWell\nWay\nReally\nReally nice meeting\nYou see the movie\nTo me the\n\nTo do the men are really\nShe may be\nSurely the mhm\n\n[noise]\nNa na na na na\nNa na na na\nNa\nNa\n\nNa na na it's\nA\nA slow\n\nNa na na\n\nYou change really\nIt's seen as in the Arctic\nHim in two weeks brand\nNew ...\nWe know who\nI'm\nI can see you have to\nAdmit it gets a chance [noise]\nAnd my grandma\nNo\n\nTo find out how you can listen to relax radio twenty four hours a day visit W. J. C. T. dot org glass relax there is a lifetime of music awaiting you on relax radio tuned in to the music of your life\nThat\nKnow you go around\nOn that and we don't know\nOr the long term yeah\nThey really don't know\nI Love la la la la\nTo ...\nThe only one you know and ...\nWay\nThe little time yeah\nBe on on um [noise]\nI really do I need to me to\nNew Jersey to\nWhat you mean to\nMe\nUntil I Do 'em all you know\nOut bond you a loan Joe oh why don't you\n... ah do you do you are\nAnd I will say the ... was a you know that you\n... ... ... ... ...\n\n[laughter] [laughter]\n\n[noise]\n\nBeen\n[noise]\n[noise]\n[noise]\n[noise]\nI\nDo change\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRelax radio here overnight music serving brought to you by Debbie J. P. T. eighty nine nine us than your community your world\nAll things considered goes where you are and takes you places you never thought\nTo go right now the wildfire threat in the Pacific northwest is this month mark ten years since Katrina bore Brown in Ferguson Eric Garner in New York ... rice in Cleveland in Kentucky today how county clerk who refuse to issue marriage licenses down\nThere's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community\nYour world news and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax rainy out on a nine nine us\nPlaying the music of your life will have much my music after the news from NPR\n\n\n\n\nOh\n\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\nYou\n\nNo no no no\n\n[noise]\n[noise]\nAny\nThose\n\nAlong and\n\n[noise]\nKnow that I\n\n\nA\nAnd [noise]\n\n\nThe one year round\n... no\n\n\nMy day\nDay\nGuy named ...\nNa one way\nEvery\nMan\nYou\n\n\n\nNo\n\n\nNo no\nAnd they\n\n\nWant them to you know and I mean he didn't get to you [noise]\nCalled me and you\nRight thing for you and\nOh just tell you and\nOh\nOh [noise]\nLittle\nThe\n\n\n\n\nI\n\n\n...\n\n[noise]\n\n\n\n\nFor a\n\nDa\n\n\nDa di ... how you can lead to relax radio twenty four hours a day but the W. J. T. dot org slash or lack there is a lifetime of decorating you can relax radio tune in\n[noise] [noise]\n[noise]\n[noise] [noise]\nDo\nThey do not somebody stole my\nSomebody might do no way she didn't she said that the kids you know oh you know I Know\nAnd I know that ... you know what to me and he did the\nWind we don't do\nMom oh\nI'm On my knees me\nMan I Know no Obama\nMay be a\n...\nI ... I'm\nNew and Diane\nThe ...\nThe name you\nRight\nWhere are you grow\nAnd grow your way\n\nG O\nShane\nVery ...\nAnd the\n\nOh\n\n\n\n\n[noise]\n[noise] relax radio is your overnight music service rocky you buy W. J. T. T. eighty nine nine\nYour community your world\nA\nAnd the next fresh air\nThe journalistic challenges of investigating Russian interference in the election and connections between the Trump campaign and Russia we talk with Washington Post's reporting Greg Miller\nWho's broken several related stories and shared a Pulitzer Prize this year now he has a new book called The Apprentice Trump Russia and the ... version of American democracy joiner weekdays at noon on eighty nine nine W. J. C. T. your community your world\nBroadcasting from Florida palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news\nDot org you're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida\nPlaying the music of your life twenty four hours a day will have much more music right after the news\n... you know\nI mean you\nKnow a\n\n\n[noise]\nNo I'm not\nIn the [noise]\n\nDeed into yeah they do yeah\nToday [noise]\nI Know and\nThen I\nGuess [noise]\n\n[noise]\n\n\n\n\n[noise]\nThing is ...\nBe the main witness\nI we were\n... [noise]\n\nSee and you have to be seeing that it's been such a\nI thought scene and you\nKnow he can do I\nDon't know\n\n[noise]\nDon't know\nI\nWriting from and they may some day man some\nMan whoa\nMay names on\nLittle bit yeah I'm\n\nYour neighbors\nTo find out how you can listen to relax radio twenty four hours a day that the W. J. C. T. dot org slash relax there is a lifetime of music awaiting you on relax radio tune in to the music of your life oh\n[noise] [noise]\n[noise]\n\nMm\n[laughter] like\nOh no the only three\nInto the green\nOh\nMove in oh\nOh that was really\nMe reading\nOh\nOh\nUm well then how long\nRent a car\nGuy I'm\nGuy that I'm\nSorry I don't I Will say well I'm\nYou brought up the road\nOh\n\nA\nRam ta\nNa na ... I'm On my man the\nI don't mind me I'll probably end up in\nUm [noise]\nYou know when a bad\nI read\nGod\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\nThis is the love that I was given to you\nIt let's say [noise]\nWill be in your ...\nWe ...\nI'd say\nTo the\nSo my life will be in\n\n... oh what a man\nKnow I live my show\n\nBut the\nBut\n[noise]\n\n\nMm\nRadio is your overnight music service brought to you by W. J. T. T. eighty\nAnd your community\nYour world [noise]\nIt's\nMORNING EDITION is awake around the clock to bring you the latest news it's two ten in the morning to justify that was the host we usually hear around three thirty ... before and it's about the Boko Haram ISIS news over the weekend ... until ... when the show starts dating open\nUp the evergreen morning it'll show up all night to bringing all you need to know Lincoln every weekday weekday mornings starting at\nFive one eighty nine nine\nNews and information all day music at night and intelligent funds for your weekend this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\n[noise] you're listening to relax rainy out an eighty nine nine us\nPlaying the music of your life\nWill have much my music after the news from NPR's [noise]\n\nOh\nOh [noise]\n\nNo [noise]\n\nThey\nCurrent na na\nNa\n\n\nRight\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\nOn and tell me\nWhen I was in the day\nMy mama Joe knees\nI'm ...\nWhen we know in a\nBomb man is that they\nSaying all the\nTime the\nTall and to me\nAnd I'm ... no he\nHe\nThem with a\n\nDo we know we're\nBig big black then it goes back to me\nAnd I know I\nMean I don't know\nThat you\nKnew what they did oh\nMan\nYou\n\nNo\nLooking\nThose oh\nIndeed a no\nNo no oh\n\nSaying\nHearing ya know\nThey leave it\n\n\n\n\n\n\n[noise] [noise] ...\n\n\n\n\nV E day in the street\n... that is low\n\nAnd you know\n\nNah\nKind of you know\nHe knew they no\n\nMan\n[noise]\n[laughter]\nMy ... oh\nOh\n\nOh\nOh oh\n\nOh oh\n\nOh\nOh\n\nOh\nOh\nOh\nMy oh\nOh\nOh\nOh oh oh [noise]\n[noise]\nWhen I reach you know I mean no no no\nAnd I will tell women want\nJust fell down and they\nMen can I\nMean yeah ...\nMeaning they owe\nChat\n\nMany years\nDoris Day\n[noise]\nYoung man\n\nAround making\nLook I think that and they and they have you\nNo\nKnew what he said no\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nYou must have Maine is not the object ... lay down in LA now you might not man that is not a game of many would nominate Ben didn't in the army now the monkey will give you the money they made him do that would be able to buy is\nNot the same it mainly down because they burden James Dean do understand the nickname the cat went out and\nThen now there's not many young Lenny my family is about the money then the Bob ... many beans I Do I Do I Do do that then they didn't\nEven know what I think it was um [noise] you make the running against them but not many people\nDo you do by a company\n[noise] he lived in the end of the ... glad you made since the late ... she probably\nDid did they do that by\nYou know\n... not many people do not\nJust leave the buggy every way some of the same way in the early right there because they know laying down I gave them the money or do you mean by by money [noise]\n\nAnd not be we'll give you the money [noise]\n[noise]\n\n\n\n\nRelax Radio Welcome your comments [noise]\nSend your comment to relax radio at W. J. P. T. doubt or\nFirst coast connect spring view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and you want to president John Delaney this is just a terrific program that's really rejects no thanks thanks for what you do and what what station does I'm Melissa rod that probably did with for his connection\nEvery weekday morning at nine and a rebroadcast there every night at eight pm on eighty nine nine Chevy Chase the\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. D. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\nThe boys and girls\nYou know\nBut I use in the air is by email and\nMusic be\nMad Men is and to\nThing\nJohn may\nAbout some uh\nI have I have right now I'm not try\nAnd lie down you\nKnow the law I'm moving around\nOr turn the girl she goes oh you do well you know\nWhat I fear and gear and by the\nMusic and then to la la la la la\nLa ...\n\n\n\nAnd ... I don't look at it that way\nI'm getting at all much to let it spread and reading my roommate is\nThis the first thing that really did well did you oh\n\nYour\nI Love\nYour la la la la la la high\n\n\n[noise]\n\n\n[noise]\nIn in in in in the in the the\nThe [noise]\nThe the\n[noise]\nAnd\nThe [noise]\nAnd in\nTogether\n\nDi di di\nDo we\n\n\n[laughter] [noise]\n\nOh\nSo\n\n...\n\nNo\n\nNo no\n\n\n\n\nAbout I\nKnow I\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\nOh\nOh I Know\nOne of\nThe union man\nOn\nThe [noise] no\nNot when the land of the\nMind body when all gung ho about my\nProblem you know now that back la la\n[noise] [noise]\n[noise]\nBut\nUm I I don't know\nBut I think that that's what\n[noise] [noise]\n\n[noise]\n\n\n\n[noise]\n... [noise]", "year": "2018", "show_name": "Relax Radio", "city": "Jacksonville", "day": "01"}