{"month": "10", "state": "FL", "station": "WJCT", "content": "I mean\nAnd now it's time to take a look at the community court for space forty to present endless street artist Alina a lender the exhibit is up in one junior member each missile lenders focus he's an illustration that explores identity gender issues speech individuality in pop culture\nThe Japanese context for more information visit W. W. W. dot space forty to forty two spelled out dot com slash about\nBurning through October three first of all the Nineteen thirties locally and nationally recognized already in Jackson Hole read\nPrinces Simpson machine to present her newest exhibit odyssey obstruction\nMore information visit to bolt in Nineteen thirty dot com Thursday October twenty fifth seventh year\nAnd friday October twenty six and seven pm why not beat her in the math as in history museum present Halloween moon rising and original new play by ... tickets are limited unavailable on their break dot com players by the seat proudly presents ... in the studio Peter stage\nWritten by ... by the end of the show Kelly said in this play the perfect psychological thriller in Halloween experience and not just on the reports of people developing a\nDream speech pattern it can be horrendous acts of violence in small town ... Florida radio DJ ... that crap inside of radio station desperately tried to warn listeners but the virus as unlikely mode of transportation she'll run October twenty six through November there\nTo get to be found at players by the sea dot org slash boxing dash office\nFrom the rights of Dial M for murder\nAnd all the Jews experimental Peter present wait until\nThe master be constructed thriller\nMoved from one moment it's just been ... or the ... final scene\n... between seventh\nDeliberate second third and fourth November ninth dependent on friday and Saturday shows will be ... pm Sunday shows will be two PM more information tickets can be found when I started by the organizers are they run the film festival\nComes the first ... scare fast from November first due to church come see what the role the independent film\nHas to offer the wages scares drills and the otherwise macabre the festival take place at AMC orange parking tickets purchased onsite without any movie ticketing act\n\n\n\n\n\n\n\n\nOh\nOh\nThank you all for joining me this evening we'll talk to you next time if you'd like to reach out to ... you can find us on Facebook and Twitter at the central culture podcast network\n[noise]\nOkay [noise] [noise]\n\nOh oh oh oh oh okay\n[noise]\n[noise]\nI'm Christopher gamble for milk street radio this week I chat with running low on the about Appalachia including pickle baloney in Chile buttons from the Dixie poor also in this week's show mark ... traces the history of milk\nFrom ... to ice cream machine we also learn a new way to make pesto\nComing up this week a ministry radio from here on Sunday Morning at seven on eighty nine nine W. J. C. T.\nTo be with you every Sunday night at eight on eighty nine nine W. J. C. G. and I knew I provide them with me one patient the king of the new operas joined me sunny day in eighty nine nine\n[noise]\nListening to eighty nine nine ... Jacksonville definitely ... he got word\nFor information on our program are scheduled pan news from the first you can do\nThe immigration authorities are rating more and more American businesses\nIt looked like something that you typically with the to the movies not something you ever plan on moving out in real life\nThe Trump Administration is going after employers who hire undocumented workers\nThis country will not sure but we don't straighten\nThe way they can come over here in war\nImmigrant labor on the next MORNING EDITION from NPR News tomorrow morning starting at five on eighty nine nine W. J. C. T.\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine out than playing the music of your life will have much my music after the news from NPR's\n\n\n\n\n... I I'm a member I\nI remember the the\n[noise]\nDay [noise]\nA\n\nNa na\nShots\nBaby\nA\nYou\nBaby\n\n... ... ... ... [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\n\n\n\n\n\nNo\nYou\nBe\n\nDoes\n\n\nAll rug into gardening or rock and you've got your ... bomb us or\nYou can buy is I mean that Jim ...\nNo James ... I'm going to end your hot now we've got a job in my\nEye and leave it good [noise] what do you have a job and while I go no\nAnd you weigh going nowhere\nIt may have rabbit\nRabbit ... round rock and rock yeah Jim how much\nDo man have as\nI Am carriers long in the here and be [noise]\nEveryone should be more loyal and that's we Jerry\nAnd Jerry or at the end of the road I\n... year\nOld rock and your your mom and judgment day is near Jersey when then yeah man I'm Jane\nAnd Jane ... ... ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\nYeah\nIt was a kid as soon\nAny kids\n\nThe\n\n[noise] [noise] [noise]\n\n\n...\nKnow\n... ...\nNo\nNo\n\n\n\n\n\n\nYou're listening to relax radio in eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida\nOn all things considered story starts with the new to him is set to become the first female Army Rangers ever\nThat day ... conversation from a woman who\nThe military uh we just email everybody down to one to get around the spelling will\nCome to the program such a market thank you very my county I Want to start just with your reaction there's more to every story on all things considered every afternoon\nWeekday afternoon for forty six eighty nine nine WTC to your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\nI'll stop\nBank you may be a well on the top\nDi di\n\nDi di\nKnow a day\nA di\n\nBe a tough one\n[noise] thank you\nThree and\nA guy\nI Am\nA fine you\n\n\n... ...\n... no you go\nDo than a plan they may voter and Jimmy\nWalked out this morning\nAnd I wrote down the law\nYou can't remember who the sand and to\nDean ... in the rain\nAgain not any day that I thought well now the man\nNamed only times when I could not find a brand\nBut I always thought that I see you\nDown on me geez\nYou're gotta help me make more than\nJust got a nice\nMy body and they can in my time\nOur own ... any of the way\n...\nI've seen the\nSame day that I'm wrong but never ran\nBut I always thought that on the opinion [noise]\nThere and do all the um\nCold when is it OK your ...\nOn the telephone I\nThe brains and buying is\nGreen is on the ground\nBra down the drain\nThe sunny days that I wouldn't know about Iran\nThat I made the\nOne most nine months in\nLong time and\n[noise]\nA lot of the day here\nSay I'm a stay at home with a [noise]\nA ...\nIn a while I [noise]\nI don't see much of a\nI'm a ... a day I saw\nAnd and [noise]\nAnd\nSo I'm\nDon't you know I\n[noise] I Know I'm not saying by\n\nName and\n[noise]\n\n\n[noise]\n\nDream of dreamer man dream dream\n\n\n\n\n[noise]\n\nThe yeah\nThe the G\n...\nLet me know knew\nYou\nLive in a movie\nWe do we\nYou know you\nThe\nRent\n\n\nYou can do\n\nYou only have so\n[noise]\n\nMoney do you\nBuild\n\nTo relax radio W. J. C. T. eighty nine nine eighty three Jacksonville we play the music of your life twenty four hours a day to support your music station please call three five three Ninety five to eight\nOr ... ...\n... ... ... ... the\n\n[noise]\n\n\n\nMm\n[noise]\nEverybody\nThey can you tell me well you know uh\nHe read a lot\nUs have a young\nA man\nJohn you show me young\nRead\nThe na na\nNa\nNa na\nYou know Neal a na na na\nNa\n\n\nMan bought a\nNo no no no no\n\nAre really of a jury\nUm on or\nBall\nGirl and\nLow or when\nHow old were you know\nWe're all well above me\nRelieve your low\n\n\n\n\n\nKnowles\nThe game he\nSees\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\nYou're listening to relax radio I'm eighty nine nine of them W. J. C. P. H. D. tree Jacksonville, Florida\nWherever you spend your morning NPR's MORNING EDITION of beer or with you wherever the story takes place NPR's MORNING EDITION can mix it with\n... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado\nWashington you will own you're born or wherever you are when you choose to spin tomorrow MORNING EDITION from NPR News\nWeekday mornings beginning of five or eighty nine ... W J C ... community supported public radio\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine ...\nPlaying the music of your life\nLow low [noise]\nThey say that time\n\nWe're in\n\nA mom I\nThem in man oh\nA\nHuge lives just saying\nGo out my ah\n\nRow row\n\nRow\nMan or\nA\nBad I'll read mama\nA\nHuge lists just saying\nKnow a new mom\nUm dreams I'm\nI Know\n\nCrazy was a big\n\n\n... the\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nAh\n\nOn July ... to ... the the ...\nMinute the negative and laugh at Johns\nMovie your burger motive known as\nDo rivers during\nNo way they are\nMan that bad I\nAbout it no man's\nAnd\n[noise]\nMm\n[noise]\nNa\nNa na\nNa ve some ground walking down the\nDo mean along you know what do they do the job [noise]\nDon't people saying\nThe water to drink [noise]\nCan always turning into a new\nAnd you know\nYou're\nReasons why you\nAnd\n\n\n\n\n[noise]\n\n[noise]\nNa na na\nNa na\nHey\n\n\n\n\n[noise]\n\nNa\nNa na na na\nNa\n\n\n\n\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n... ... ...\nWhoa\n\n\n\n\nYou're listening to relax radio at eighty nine nine at Penn W. J. C. T. H. D. tree Jacksonville, Florida\nAll things considered goes where you are and takes you places you never thought\nTo go right now the wildfire threat in the Pacific northwest in this month marketing ten years since Katrina Blanco Brown in Ferguson Eric Garner in New York near rice in Cleveland in Kentucky today how county clerk who refused to issue marriage licenses down\nThere's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community\nYour world broadcasting from Florida palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax to radio W. J. C. T. eighty nine nine each T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after that news\nHi cheese\nHe's done\nBy a tall [noise]\nHe\nSees\n\nNow lane\n\n\nYou know\nDay and\n[noise]\nI uh I I\nA guy in\nA\nIn a mall in San Diego na na na na na\nFor all a bit\nOf a new ...\nDry na na na hey\nI have\nA I mean we\nHave music na\n\n\nMall so low there's oh whoa whoa whoa whoa whoa ... years old\nMaybe we can\nHere the hearts and minds man hard\nOh\n\nWe can say\n\n\nOh\n\n[laughter]\n[laughter] [laughter] [laughter]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[laughter] [noise]\n\n[noise] [noise] [noise] [noise] yeah\n\n[noise]\n\n\n[noise]\n\nTo\nYoung Lee I\n\nMade\n\n[noise]\n\n\n\nI mean the times\n\n\n\nMe [noise]\n\n\n\n[noise] [laughter] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[laughter]\n[noise]\n\n\n\nAnd\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n\nYou know\nCan\nThe talking to\nTom\n... ...\n... no\nNo no do you know\n\nKnow\nOne\nYou\n\n\n\nTo\n[noise] oh\n\nI don't know where\nGrow\nNa ve things I can\n[noise]\nMe talking to you I'm\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] he\n\nWe\nHaven't must send him my day\n\nAnd\nHe\nWhen he now then Milo\nThrilled that words cannot act\nMy lifetime I'm loving haunting me\nStarting\nPlease\n\nSay\nHe's low\nTo me they're really not being more I can\nA national then ... you're listening to relax radio on eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida\nAnd the next fresh air Melissa McCarthy\nMyself in a rather [noise]\nMcCarthy stars in the new film can you ever forgive me\nAs a biographer turned literary for germ we'll talk about the film growing up on a farm or early comedy act her role and bridesmaids and playing Sean Spicer on Saturday Night live joined on weekdays at noon on eighty nine nine W. J. C. T. [noise] your community your world\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine is\nPlaying the music of your life will have much my music after the news from NPR\nYeah there is this a\nDo\n\n\nI\n\nLike to\nLast\n\nOn on a\n\n\n\n\n\n\n\n... ... ... ... ... ... ... ... ... ...\nThe E E N E N E\nL though they'll come on your phone calls me up in the east coast\nGee I don't know\nEvery time she said you know you can't go to the\nOld man rather yo yo la la la la la\n... interest rate as much\nIn\nThe\nWest Bank does by the by the pieces like most of the day he was\nTo love the way that I like to do is go to a new day a day\nUntil she was real reality was you\nKnow a\nLittle they struggled oh uh no\nYou know like you said as much\nMoney\n[noise]\nThat she got the kind of the kids are coming out\nOh no no no no no no no no no no I Love it oh no I\nGo there every single day all the kinds you might be\nA\nLa la la\nHe needs to be\nWhat do you\nThe ... the\nBeep me me me me me me me beep beep beep be happy\nAny need to be even\n\n... ... ...\nHave\n\nThe way\nI used to\nThe audience by yeah\nWas like no no I'm\nLong time\n...\nMe saying they\nShow are real well well a\n...\n...\n\n... ... ... ... ... ... ... and\n\nYour age tree\n\n\nSure\n[noise]\n[noise] sure\nNa\nNa\n\nNa\nDo\nMy down time\n[noise] oh\nMan\n[noise]\nShe\nMan you know\nMan [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\nUm [noise]\n[noise] [noise]\nWhoa whoa whoa whoa whoa whoa", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "21"}