{"month": "10", "state": "FL", "station": "WJCT", "content": "\n\nOh [noise]\n\nAh\nYou\nI\nAnd\n\nUpon\n[noise]\nNah nah nah nah nah nah nah nah\n\n\nWell ... ... ...\n[noise]\n[noise] [noise] [noise] well I'm\n\n\n\nLot\nGo there someday there and he wants me\nThe draft you know there's been\nThanks for the balls to be a\nTo be with us where you live\nDid this on the Atkins ha ha\nIn\nSee me the name ...\n\n\n\n\nI think you're listening to taste test on\nThat was\nChild that Michel ...\nBefore the break we played down here and held by manhunt followed by Michelle ... Taiwan on\nMaggie Rogers Alaska on a tree and drink brought us just another day\n... and crayon with blue window and ... ... ... with ... or\nBe sure to join us next week for some damage as during an interview from my favorite ... is Wanda she'll be joining us next week to discuss her record\nAnd to talk about her performance during last year's jak double shift as [noise]\nI mean times titled either on Facebook Twitter and Instagram\nAt taste tests radio sweet I draw the line with Japan [noise] we'll we'll put up a trek\nSong every week\n\n\n\nThis is Ira Glass of this American Life then I'm coming to Jacksonville even talk that costs seven things I've learned that you basically just an excuse to tell a bunch of stories like ... videos talked about how we make our radio show and talk about stuff we have not put on the air and never will put in the air\nAnd just play stuff that you might go be fun to play for a crowd Saturday November temp acquired a theater budget by community first credit union\nTickets at ... dot com\nMarta theater Don I'm\nHi I'm Andrew wicklund host of blues arise in the best in classic a modern blues is now on twice a week blues arise on Monday and Wednesday nights right here on eighty nine nine W. J. C. to your community your world your music [noise]\n\nNotices eighty nine nine W. J. C. T. FM Jacksonville providing news information music ... Florida's palm coast to Georgia's golden aisles what's on your computer or mobile device that W. J. C. C. dot on\nOn all things considered story starts with the new who when is set to become the first female Army Rangers ever that day wind ... conversation from a one anyway in the military uh we just email everybody down to one to get her on the phone\nWill come to the program started my cat thank you very much I Want to start just with your reaction there's more to every story on all things considered every afternoon\nWeekday afternoon for forty six eighty nine nine W. J. C. to your community your world\nNews and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\nKnow [noise]\n\n\nAnd then\nOh\nOh\n\n\n\n[noise]\n\n[noise]\n\nWatch the smoke ...\n...\nNa\nNa ... Mm\n\nNa\n... Mm\n\n[noise]\nTo say it is so\nWith me they know\nNa na na na na na na na na\nBad health but the view\nI di di di di\nWe had how\nReally\nNo\nTom on my\nMind I talk about when I kind of a man I Can't help but\nThe ...\nThan\nI Am very weighing down though\nWide that John and I\nTry and find that high salary\nIt's oh\nJail and um I mean they\nJust on well then\nYou're much too\nDo show no\nYour mom a lot\n\n[noise]\nDay and the Webster's Dictionary act so\nI thought oh I Love\n\nAll the [noise]\n... oh\nOkay and I know the what are\nMine are\nHey my lists are\nKnow that I\nKnow oh you [noise]\nYou took a snack\nBar my ...\nSo ... and they know the [noise]\nWhy are they owe me\nThe my list style that\nOh\nSee I\nSee oh jeez\n\n[noise]\nOoh\nOne who\nThe ...\nYou hear ...\nO may shoe thing\n... to\n...\nOh\nLike ... ...\n\n\nAm so\nOh\nOh\n\nHe sees\nThis mayor\n... ...\n...\n\nYou're listening to relax radio W. J. C. T. eighty nine die each day three Jacksonville we play the music of your life twenty four hours a day to support your music station please call three five three Ninety five to eight she has no\nOh\nWell I'm\nOh\n\nA say a way\nKnow\n\n\n\n\n\n\n\nMm Mm Mm\nMm Mm Mm Mm\nMm oh\n\n\n[noise]\n\nOw ooh\n\nYou're listening to relax radio at eighty nine nine ... W. J. C. T. H. T. three Jacksonville, Florida\n\nWherever you spend your morning NPR's MORNING EDITION is there with you wherever the story takes place NPR's MORNING EDITION connects with the\n... Montana Cleveland San Francisco Denver Philadelphia Minneapolis Miami Colorado Washington\nYou will on your morning wherever you are when you choose to spend tomorrow with MORNING EDITION from NPR News\nWeekday mornings beginning at five on eighty nine died W. J. C. T. community supported public radio\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us than playing the music of your life as well as much my music after the news from NPR\nWhy like why are we here [noise]\nIn lower lose\nAnd I pay more run\nThe ... [noise]\nDays ago\nWhen they all come whether\nShe'll be\n\n\nKnow\n\nOh\n\n\nAnd then the Russians\nUm [noise]\nPrecious saying oh you\n\nOh wow [noise]\n\nI I mean ride up a a view\nNah hey\nBreathe this team to where\nI Love the [noise]\nBirds singing in the Big M or tree [noise] sorry mom little dream on [noise]\nIt ... and he is ...\n... to me tonight then do you miss [noise]\nWhy are you know now again the\nJury mom little dream he loved the\nLaw training but I mean go on\nA ... grave and you know how you write\nI don't mean\nTo do their own the\nKids where he has\nDone in mind you\nWe dream that where\nUp in your dreams every day\nEvery little dream he loved me a lot\nBy Bob Bob's buzz buzz about you\nKnow when I go on how\nMuch do ... you know they do they do but\nThen I'm Alone in June and good deal down\nHere I was reading a book about three man\nHe dreams\nBut dreams what you've got to me to\nMe\n[noise] [noise]\n\n\n\n\n\n\nAnd\nAre both love and ... you know\n... or ...\nOr ...\n... or ... to\nWell ...\n... ... you're\nLoves ...\nAnd I know they they try and carry\nDid the\nFellow\nJust I had to reach you very angry\n...\n\n... they're trying to get it to\nEarlier in my head didn't do very little\nThey\nGrow to know where they're trying to get\nRead\nAgain\nMany betraying you know\nThey didn't really hang\nWell just well even those low\nWell it it will remain role playing\nMolly looked like he was not able\nTo read a lot of times are good too\n\n[noise]\n[noise]\n\n[noise] [noise] [noise]\n\nHi\nDid you know with the you know\nHe does\n\nNot\nNeed to be the next day [noise]\nUm [noise]\n\nI don't think it would mean that they didn't [noise]\n\nAm a man tiny [noise] it was a tiny [noise] need that hands\n[noise] I [noise]\nNot only in the mid ... you know they may gain [noise]\nUm [noise]\nWell how does\nThat\nThen and then\nNot\nOnly with the [noise] I\nKnow\nThe the the [noise]\nThe ... ... ... ... ...\nHow do you know you see no\nThe [noise]\n\n[noise] and that song [noise]\nAn end to a buck the melody named ahead on\nYou and the song [noise]\nA guy on\nDay lingers ahah\nWell that night [noise]\nThen ... [noise]\nThey mean by my [noise]\nAway and\nCake happen is [noise]\nWhy you may\nThey need\nNo no no\nWe\nOwe it to\nThem [noise]\nThese men and I found\nThe break up ...\nYou\nAnd the song that had gone off\nThe melody lingered ahah\n\nI\n\nWhich the brakes ... on\nOff\n\n\n\n\nRadio here overnight music service brought to you by W. J. T. T. eighty nine nine\nYour community your world [noise]\nWell blah blah blah blah but I'm going\nAre moving along but I don't know\nEach year on June ... she's a girl and I\n\nNo no no no no no\n\n\nHe's in\n\nIs on\n[noise]\n\n\nLeno they eat\nKnow what she\n\nSaid he did\n\n\nYou\n\n\nWe\n\n[noise] [laughter]\nOh\n\n[laughter]\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\nAnd relax radio here overnight music service to you by W. J. C. T. eighty nine nine us and\nIn your community your world [noise]\nAll things considered goes where you are and takes you places you never thought\nTo go right now the wildfire threat in the Pacific northwest in this month marketing ten years since Katrina black and Brown in Ferguson Eric Garner in New York mirror rice in Cleveland in Kentucky today a county clerk who refused to issue marriage licenses\nDown there's more to every story listen tomorrow afternoon\nWeekday afternoon for forty six eighty nine nine W Jaycee to your community\nYour world news and information all day music at night and intelligent funds for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nName\n[noise]\n\n\n[noise] [noise]\n\nHe died I pray for bad no one will just be a hobby way [noise] I Can't wait on them to live that lucky day we met recently re and then\n\nWhen they is dolls\nThe ... what do I do\nAnd while there's some\nLaundry\nWe die and\nLove me I'm boggling with you\nNo no no no no blah\nWell barrage landmine\nOr wrong dream\nI mean when you know me\nAnd they all bought a lot of you when the ball you log chain you will will not rule slower you owe\nMe and let me make my dorm room or a ...\nRe doing when you\nKnow\n\nMom oh\nOh\n\nCome\nOn\n\nAnd green\nThan during oh what a lot when\nThe law obscene you about your new law will not rule oh\nWell you know we live and let me make my real dream for\nA while I'll do a rather dodge ram\nThing I'm doing well you know\n\nThe street you\nBegins to ...\n...\nIt all on the street\nAll down the street to\n\n[noise]\n\n[noise] oh man it's crowded\nLittle ... to\n\n\n\n\n\n[noise]\nAnd\n...\nMe the most\nAbout that they breathe\n... oh\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n\n\n\nUh\nMesh\nBenign\nI didn't know how the\nLa la la\nLower\nGood only\nAnd there was no\nAnd fallen and low\nAnd and\n\nRadio is your overnight music service brought to you by W. J. C. P. eighty nine nine other\nYour community your world\n...\n[laughter]\n\nThe thing is All right hang\nDa\nThing\nIs when they go\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nUh no ... on er [noise]\nYou know Mexico\n... do you\nBroke\nSome about is hard [noise]\nWithout thinking why\nWe looked the\nMy goodness reasonable\n[noise]\n[noise]\n\n\n\nWhen\nRadio is your overnight music and brought to you by W. J. C. T. eighty nine nine ... than\nYour community your world [noise]\nOn the next ... Jonah Hill co stars super bad money ball and the wolf of Wall Street he wrote and directed the new film mid nineties about a group of skate boarders in the mid nineties that's the period when Jonah Hill was skateboarding but he was never great\nBecause to be great skateboarding you have to be willing to slam on your face down ten stairs on concrete over and over and over and join us\nWeekdays at noon on eighty nine nine W. J. C. T. your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us than playing the music of your life will have much my music after the news from NPR [noise]\nAnd down and over an hour\nTo that I\n\nAnd then I bought\nMy\nGod\n\n\nNa na na na na na na na na na na na na na na na na na\nBig car\n\nNa\nNa na na\n\nIn the\nThere yet today um\nThanks so the young man that she will most\n...\nYou see every\nTime a day every day\nAnd the\nShe takes some [noise] and all the\nHe did the pay is\nThey dream you\nThe and every\nBall and he\nUm he may be out\nHe was\n\nThe day [noise]\n\n[noise]\n\nI'm a I'm a\n... you are\nOr who\nAre ... are\nOh my\nGod we're we're\nOr ... well\n\nA\nMan oh\nI Know for\nI'm into a\nAnd you know it's\nA\n\nI I Know that's a\nMan ... no ...\nBy ...\n...\n\nO O my memories\nAre a man on\nA ...\n\n\nUh\nI don't know I'm a uh\n\nUh\nNo no\n\n[noise]\n\nHey I was a rainbow around last show\nAnd a guy on well above and\nHow the sun shines bright do or what was All right ... a ... man although\nAround my show\nA glove from\nA letter blown let ... be a long shot a man\nOf love hallelujah how the ...\nWell they\nThey see the novel that say that my little showed up believing\nIn God Knows where a\nMan\nOr a rainbow around ...\nPanda guy brewing\nAnd I'm ...\nOr will know that a\nEr\nNah\n\n\n[noise]\nWhen they see that and I am now they're saying\nEarly ... na ... arena\nWant\n[noise]\nI don't\n[laughter]\n[noise]\nBut you know what you're saying if you\nManage to some lady she ... she got\nHer when she she she she died when he was you\n[noise]\nUm\nThe job I got\nI Know what I'm\nSaying [laughter] yeah [laughter]\n\nYeah I Know um\n[noise] maybe [noise] you know when you\nGo where you know when the manager when he met yeah\n[noise]\n[noise] Mm\nUm [noise]\nI'm\nJan Jan again [laughter] [noise]\nShe\nGot she got mad and\nShe got\nManager and she\nGot she got [noise]\n\n\nMm\nMm Mm\nOh that'd be\n\nYeah\n[laughter]\n\n\n\n[noise]\n\nMm Mm\nNo way you wear your ...\n... New York the Loma real long\nWell today it's like\nNo we're from me well what are your smile John ...\nWhere are you saying oh yeah\nWell where are you on my ...\nNo no thank God I Know we're probably we may not know me well\nMama bomb grand road pro\n... well well well mom oh go where you\nOwe your ...\nA ... a long way you train my long no no thank God thank God oh we're from me\nI'm like oh\n\n\n\nRadio is your overnight music service brought to you by W. J. P. T. eighty nine nine\n[noise]\n\nEver\nI'm hoping that we know\nEvery time we\n\n\nIt's\nWith the whole real\nRegard the whole thing will work out [noise]\nIt's so\nBeen man now\nThe\nHere's how\nHe gets to bowl and then\nOn than\nIs\n\nWe go to\nBall\n[noise]\n\n[noise] Hi\nI'm Lee Bailey easy but you have a window Coughlin low low world is Colin I Will say let's blow which are screaming oh let's have a job for way less than ...\nFar from home\nBut your la la la la la\nLa la ... ...\n...\n... you are Ken Rudin as alone ... car\nI'm a ... about ...\n... no ... just my darling oh but\nYou are low speed you know you have a ...\nHour by car or\nChop ...\nBoston Boston [noise]\n\n[noise]\n[noise]\nOh\n[noise] [noise] [noise]\nHow would we use that as a general belief that you\nKnow [noise]\nAnd that's the way we are not [noise]\n\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\nOh [noise]\n\n\nOh [noise]\n\nOh [noise]\n\n[noise]\n[noise]\nOh oh\nOh\nOh\nOh [noise]\nAn an an\nAn\nHour oh\nRelax radio here overnight music ... ... you got your Jaycee T eighty nine nine us than your community your world [noise]\nMORNING EDITION is awake around the clock to bring you the latest news\nIt's two ten in the morning so to five hours left to host usually around three thirty four and it's about the bill go around ISIS news over the weekend ... until five when she'll start opening\nUp every morning it goes up all night to bring you all you need to know Lincoln every weekday weekday mornings starting at\nFive on eighty nine nine\nNews and information all day music at night and intelligent funds for your weekend this is a the nine nine W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine HD three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\nAround the time you read the new ...\nNew Dan real attack\nAnd when he don't say he he he he\nWas you\nKnow yeah\nAnd then one oh well\nMine do maybe la\nLa la la\n\nYeah it is at all\n[noise]\n\nOh my\nI Know\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\nOh well well\nWell ... ... ... ... ... ...\n... ... ... when ...\n... ... no\n... no\n... [laughter] yeah well [noise] well\n[noise] ...\nYeah\n... do\nYou do hear\n\n\nA A N\nO L L [noise]\nWell well\nYeah for a no [noise]\nOh\nWell\nYes I should start this thing than a minute or any day\nNo no no no it yes\n... it's\n\nThe low um ages have done this a burning into ...\nAnd it seems to\nBe you know the half empty is ...\nUh\nAnd it come\nLonger line be them on\nGang up than love\nBe the\nBig you\nI Love being a\nIn the new world we live in\n\n\nEveryone I mean I'm\nOh\nAnd I'm\nA ... mile\nThey all do we'll pay\n\n\nA bill no you know God\nThe crowd is\n\nWill be\nWell we\n\n\n\nThe da da\nDa da da\n\n\n\n\n\nRight well let me use the law the glamour\nMaybe it was the ...\nOr maybe it was raining\nReally do [noise]\n...\n... well\nThe world was Mars\nOne large lawyer\nAssigned Adrian ... ...\n\n...\n... ... ...\nOver to\nThe auto my\nGame they that\nBob real rural my\n... that's right they were\n\nAs long as like\nYour your mom\n\nTwo\n[laughter]\n[noise]\n\n\n\n\nMm [noise]\n\n[noise]\n\n[noise] [noise]\n\nFind out how you can lead to relax radio twenty four hours a day that that'd be a JC T. dot org slash rely there's a lifetime of music are waiting you and relax radio tune in to the music of your life\nOh first catch connect spring view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor annual that President John Delaney\nThis is just a terrific program that's really rejects no thanks thanks for what you do and what what station does\nI'm Melissa rod yes I did but first his connection every weekday morning at nine and a rebroadcast shares every night at eight pm on eighty nine I get each ACC\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine us\nPlaying the music of your life\nHave much my music after the news from NPR\n[noise]\n[noise]\n\nAnd aging me\n\n\n\n\nYou will get\nSick and then what's your name\nKids will\nOh\n\n\n\nAnd that is the\n\nMan\n\nWhen I'm walking side or\nPeople tell me um the the\nNow about a\nWhen I'm with the er um how they\nJust know that she loves me\nDon't know the dying\nRight now\n\nA myth do that to me a call ...\nI'm gone with saying this man so\nWell cry every time that just ban\nOne more done\nAnd let the boys thing was that one one more time\nJohn ... on your back then to the board and the\nBlue in the name on to it than to me now I Need your vote in the day\nLike I'm all in and\nJust live or all in a in\nA I'm a\nA mentor that me a bomb and ...\nOne missing in this day and I'm\nWell cry every time\nThat you live man one more none\nLend the boys saying that that one one time\nA minister can you hear the bad I'm mad guy a ball\nI'm I'm a\nMen led by the way I'm reading the ...\nAround the lower\nThey can\nLet the springtime and let the ball a common man\nI've done wasted\nToday and um\nAnd I've done band the loan some you know [noise]\nHey Mr that see a bomb that you buy\nThing in the bad no\nMm well I'll Try every time and you're a ban ban one more time\nAnd let the boys thing was that one one more time\n\nThe ban me they don't you\nKnow ...\nWell\nThan I can talk\nTo just do the looting [noise]\nKatie\nGuy\nOne\nAfter the second and another first was the comeback but\nOne no no\nAnd ...\n\n\n[noise]\n[noise]\nA Bush fan ...\nLike ...\n\nWhat do some ...\nSprings to\nKnow the ...\nOr ...\n\nYou know ...\n\nWhat we'll\nDo we\nDo ...\n... ... ...\nNo not ... not a whole has been\nWere lax radio is your overnight music service back to you by W. J. T. T. eighty nine nine\n\n", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "29"}