{"month": "10", "state": "FL", "station": "WJCT", "content": "Ve to turn\nA way\nLaying low player landed on\n\n\nLa la la ... miles away\n\nMind can\nI can say ten tanker changing thank you I Want to pay\nEthnic things differently I think we can\n\nThing again\nTeam and change the men\nReal common\nCan be your claim in Maine on\nGay men\n\nIntensely well tell me that to be paid\nChange you\n\nKnow\nFrom\nAnd there is a good song for this time of the year but it will be forty eight and a free ... before that Steve Martin and the the canyon rangers Canadian girl also heard from Joe Smith than the spicy pickles and moon glow a song or very associated with Benny Goodman I Believe that was his first breakthrough single\nTyler child there is in there as well lady may and Nikki bloom and the ramblers out in the ... with Romeo ... to ... you weren't listening to string theory my special gift tonight had been David April from me as old Spanish trail and more time with a ... who are white women wear\nAll right we are located on west ... street just three miles west of changing [noise]\nI'm In his a half mile terrorizing path through the woods when you go through the camp grounds we have the cemetery and of course the legendary apocalypse alley where you'll have to pass through the zombie hoard and you will end at the mademoiselle Z bordello seeing\nThat sounds like fun Katie you got something you want to say\nI Need to pull ... highly char\nOh I'd like to thank you to both for being on the show tonight thank you and\nThank you very much for listening this evening please contact us it music at W. J. C. T. dot ORG that's music at W. J. C. T.\nDot ORG and don't forget about our Halloween special coming up on the twenty seventh in the meantime though this is John ... and I'll be seeing you in a week these\n\nPotter concert hall presenting new both political guitarist ... more leader and his band lunar ... on Sunday November eleventh tickets for a more labor at the time to read your concert hall on November eleventh are available at ticket master dot com\nI'm Christie early host of life from here you know they say this country has more divided than ever but there's one thing we can all agree on the people just\nI Hope you'll join us for a glorious evening a musical comedy that just might bring us a little closer together during the Saturday for a live broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the game for ... the war in treaty Mr Gabriel ...\nSaturday evening it's sex on eighty nine nine W. J. C. T. garde overnight Logan the low seventies sunshine Saturday hike in the mid to upper eighties sunny breezy Sunday hiking the low seventies low fifties overnight it eighty nine nine of the Jaycee T Jackson down your community your\nFirst cut connect springs view voices from across the northeast Florida\nHow much our listeners appreciate it one of them is former mayor and your that President John Delaney this is just a terrific program that's really rejects no thanks thanks for what you do and what what station does\nI'm only survives it probably did with for his cat every weekday morning at nine and it will be broadcast here every night at eight pm on eighty nine nine heavy chase the\nNews and information all day music at night and intelligent fun for your weekend this is a benign W. J. C. T. FM Jacksonville your community your world listened anywhere it W. J. C. T. news dot org\n[noise] you're listening to relax radio on eighty nine nine\nWill have much my music after the news from NPR's [noise]\nHow many times do man or a\nB Boy you can see that God and\nHow many in the one that had\nMe boy and he is a\n\nUm many and paying daily you know\nToo many main\nUh uh uh\nLaw you know when\nWe a new low and you know ...\nThe um the lower ...\nI'm\nStayed\n\n\n\nAbout a\nA\nI didn't know what I Would buy and then\nAnd ... maybe the another nine of mine\n\nYou do I want to Denver\nTime we meet again where I\n\nI and\nI be when I'm with you I Want to see that\nIn my new one on the way and\nKnow I Am a man\n\n\n[noise]\n\n[noise] [noise]\n[noise] the\n[noise]\n[noise]\n[noise] your your\nLaw who was\nLike oh\nOh\nKnow and I'm I'm a I'm a\nDress on as well then\nYou're much\nTo do show no\nYour mom\n\n[laughter] [noise]\nBe new\nStaying in Webster's Dictionary\nOn oh I Love\n\nThe\nCage and\nThey are\n\n\nTea\n\nSay All right [noise]\n[noise] you just said\nIt's you don't do it right\nFall right [noise]\nI'm not\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nBomb but we\nTo show my daughter and I know\nWhere you\nBall where\nOh\n[noise]\n\nOh I'm\nBaltimore where\nDa di\n'em right\nI'm All right\nA rise\nOn her watch modern\nLike oh why\nWhy oh why\nBall rise\nOr a\nAll right\nBall right\nIt's All right\nI'm All right\nOh All right\nOr I\nKnow I'm All right\nA right\n\n\nNo\nHanging on you know\nMaybe I\nThink you know in\nYou're listening to relax radio in eighty nine nine ... W. J. C. T. H. D. tree Jacksonville, Florida\nEvery day NPR's all things considered includes news that keeps you head of the curve if this was not important enough for us to draw a line in the sand what issue it plus the unexpected\nWing the skinned and neck the hard you making chicken meatballs cooking the knee cartilage\nAll things considered from NPR News weekday afternoon for forty six eighty nine nine W. J. C. T. in your community your world\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is eighty nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. D. three Jacksonville, Florida playing the music of your life twenty four hours a day will have much more music right after the news\n\nNo no no shining\nNoticed during this man\nWhen you're alone\nBy how they do a\n... [noise]\nGuy smiling\nDo I see [noise]\nThing and I saw\nAll live alone [noise]\nNever saw the sun is shining though\nNever saw things\nGoing so right [noise]\n... they buy\nGrand urine alone my how their fly\nAll of them ...\nYou know [noise]\n\n\nNever saw a shot of low\nEnd by when you're low law held a lot of that\nThey all\nI'm\n\nA\nOr a a\nLong hair a or a guy\nMe\nAnd my main na\nNa\n\nNa na\n\nNa\n\nNa\n\nNa\n\n\n\nNa\nNa na na na na na na\n\n\nNa na\n\nNa na\n\n\n\nNa\n\nNa\n[laughter]\n\n[noise]\n\n\nMm\n\n[noise]\n\n\n\n\n\nWe ...\nI thought my heart with ...\nI knew that you saw\n... ...\n\nOr a good ... ... ...\n[noise]\n\nOr ... or ...\n...\n... who you are\nSo I had to call\nSeize ...\n\n... le ...\nUh\nNo\n\nNo no\nBam boa ... no\nNo we don't run by the way to\nA ... day in\nRow and then all of them are a little way say they try to ... to\nWell you know they are ...\n... ... ...\n... ...\n... no one will do it the drawing in bed sharing\nDid the mail\nNa na na na oh\nI had to read you the\n... or ...\n... D\nJon Benet good ...\nWell in my head ... to ...\nNot on the\n... the John ... good do you\nNa na na\nAny\nMinute between\nThey ... meaning\nJust well he knows a little ...\nWell it it was a teen in ... plays a\nOld on low me yes indeed well we don't know what was your door\n\n[noise]\nI got rid of them [noise]\nWell and it's nice\nGot stay\nI got my my\nI agree\nWell and it's\nYeah well yeah well\nNa\nNa all back home\nI've gotten my mom\n[noise]\n\nMinor [noise]\n[noise]\n\n\n\n\n\n\n\nMm [noise]\nBlack cats ... across my I'm ... I'm almost no\nI'm must to Rob\nThe devils run because all my lawn\nIs a\nA good book\nCan bet your life\nI tried or give\nI guess I'll go to ...\nJust ... missed and\nEvery thing\nI've had them ...\nIn\n...\nI guess some justice\n[noise] before you\nRead this June ...\nWritten two and ...\nI log oh Mike Castle ... in the\n[noise]\nA trailer\n[noise]\nYour ... [noise]\nAnd there was ... moves to [noise]\nI fell in love you're listening to relax radio and eighty nine nine ... W. J. C. T. H. D. three Jacksonville, Florida\nEvery day on MORNING edition it's the news you can't be ... It's MORNING we've been looking at what's happening or conservatism libertarianism environmentalism religion and we're not props were just everyday people in the crowd to join the sense of who start [noise]\nListen to the next MORNING EDITION from NPR News weekday mornings beginning it's by one eighty nine died W. J. C. T. community supported\nPublic radio news and information all day music at night and intelligent fund for your weekend this is a benign W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\n[noise] you're listening to relax radio on eighty nine nine is\nWow [noise]\n[noise]\n\n\n\n\n\nNah nah nah [noise]\nReally known na na\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nOh\nWow\n[noise]\nMaybe we don't\nIn ...\n\nYou to\nShadow ... to ...\nGo\nThe gym is\nStructured to go\n...\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\nSo you come on late Sunday loaning the\nCan down to that\nFound pictures we take it and now I'm awake Canada and sleeps Mayan\nTo do with that but just you\nKnow to me than to\nDo they what oh\nMeans my\nSome teams keep them\nFreeze in a melting the cold in the oh I feel\nLike I'm trial and there's no no no no I'm just\nDoes that play that train a punishing the dumb enough guy\nHe beat them then they won't be in\nDon't really know\nThe ... job\nThe dog days right oh I\nHe's a\n\n... Lynn\n...\n\nMhm\nJohnny keeps saying that ... your words always make so much money and do that and friendships got no defense I Know that\nI'm reaching the and so let's keep\nFlying around me is\nIt really is\nTone he knows that I'm not me not me either\nWay he [noise]\nI really don't\nAs long as he does\nTry\nThe dog stays why all I Know\nMeans\n\n\n\nI'm Jane\nMaybe that makes the\nI thought I'm Jamie in\n\nChange\nThe law\nMe some\nMe the change\nOut to be\nReally neat oh\n\n\nWell that's\nOne of those ... those grey bull's name one of those about\nThe knowledge then rain just well\nOne of those ... I\nJob to the mood on got the ... who\nWas the last thing in a\nLot of bad by the end of it and why do we know that they didn't even know where to by the way\nNot you know do good by\nA man who is\nWith me now they know\nOn the\n\n\nPhone\n\n\nNumber\n...\n...\n[laughter]\nYeah with all the ...\nWell\nThe thing that\n\nNot too cool jobs\nDo good by day\nI Am right\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nNever know how much\nMean I get up on that\nKnow I\nThink they\nAbout my ...\n\nYou get to the speed on one you'll all\nThem\nRead what\nOh [noise]\n[noise]\n[noise]\n[noise]\n\nThe day [noise]\n\n[noise] [noise]\n\n\n\n\nMm [noise]\nI don't mind that do when no last\nAgain in the day\n[noise]\nYoung mind you\n\n\n[noise]\n\n\nYou're listening to relax radio in eighty nine nine up and W. J. C. T. H. D. three Jacksonville, Florida oh\nOne minute after five in the morning the president of the world bank is calling one minute afternoon in\nNew York city authorities are investigating a second deadly crank collapse\nOne minute after five in the evening the commander of the joint African Union has one minute after eleven at night\nAt least one tornado is reported to have touched down\nWhat's happening what's known what's next one minute after the hour every hour every day from NPR News\nBroadcasting from Florida's palm coast to Georgia's golden aisles this is a benign W. J. C. T. F. M. Jacksonville your community your world listened anywhere from your computer or mobile device at W. J. C. T. news dot org\nYou're listening to relax radio W. J. C. T. eighty nine nine H. T. three Jacksonville, Florida playing the music of your life twenty four hours a day more music is on the way after this news\nA man\n\nA man\nOr\n\nOr\n\n\nOh\nAh\n[noise] na\n\n... ... a man that do well in the training\nWe came into a\nAnd ... sixty but\nWere hungry\nAnd ah then\nRichmond then no it below the\nOld though was na\n\nNa na\nNa na na\nNa na\nNa na na\n... na na na na na na na na na na na na na na\nWhat happened to the one thing she said in the main\nCalling the ...\nThe Roberts Lee\nNa na na and shopping\nMind is no good just to me when you didn't read\nBut they should know\nAgain the very\nAh their home\n\n\nNa\nNa na na\nNa na na na na na\nBefore me\nWorking man\nThat made me\nAnd well he was the right thing but I think the man may\nBlood below the knee UK and rain came back\nAnd then he\nAh saying\nThey are oh\nNa na na na na\nNa na na na na na\n\n[noise] [noise] [noise]\nAnd the bad\nThe show\nTo me [noise]\nTo\nIt's got the same way that I can choose these rain\n\n\n\n\n[laughter] [noise]\nAnd I was actually a very very na\nNa na na na na na na\nNa na na\n\n\nNa\n\n\n\nNa na\n\n\nA low a rose in the spring time\nStand up for\nI Love the road\nRoad room oh my\nOr most\nThe uh [noise]\nA loan\nFor a moment\nHome or you know the\nNobody's really\n\n[noise]\nCindy hill low\nBit I\n\nGuys\nYou\n\nKnow\n\n\n\n\n\n\n\n\n\nOakland the poor\nShe\n...\nOh Ben\n\nDay\nA [noise] I\nI bet [noise] I\nKnow I\nDon't\nKnow I Know\n\nSaw me Mm\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise] the red tape for\n\nMe [noise] [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\nThat's\nRight yeah\nOh\nOkay\nOh\nOkay\n\nI'm sure I have\nWay down\nWay to\nSaying\n\n\nA\nGuy\nA\n\n\nGuy that you\n\n\nYou're listening to relax radio I'm eighty nine nine up and W. J. C. G. H. D. tree Jacksonville, Florida oh\nImmigration authorities are rating more and more American businesses\nIt looked like something that you typically with the to the movies not something you ever plan on living out in real life\nThe Trump Administration is going after employers who hire undocumented workers\nDid go through will look too but we don't enjoy\nThe way they can do when we were\nThe immigrant labor on the next MORNING EDITION from NPR News tomorrow morning starting at five or eighty nine nine W. J. P. T.\nNews and information all day music at night and intelligent fun for your weekend this is it'd be nine nine W. J. C. T. F. M. Jacksonville your community your world listen anywhere it W. J. C. T. news dot org\nYou're listening to relax radio on eighty nine nine out than playing the music of your life\nHave much my music ... the news from NPR's\n\n[noise]\n\n\nOh\n\nNa\n\nI'm a\nA\nI\nAnd\nOh\nNa na na\n\nNa na\n[laughter] God\nNa\n[noise]\n[noise] well\nMe and let me play 'em long died last\nOne rink in like a thin and\nAre\nLot\nAnd I love what\n\n[noise]\n[noise]\n[noise] and saying\nWell I'm\nA I'm\nA\n\n\n\n[noise] [noise]\n\nThen we're\nHere in Georgia oh ...\nOr let them know where\nDirect their\n\nJob\nThe spin\n[noise]\n\nWay to tell you\nHe\nVariety [noise]\nWhere you live in a\nVe let the um the the\n\n\nOnly one of the stuff\nYou know I don't you give up\nWe're all over the whole notion of rules and get 'em\n... church a live show good\nDoes one thing Julie little or no\nWell when my law I\n\n\nLow\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\nNah ... ... ...\n\n... ...\n...\n... ... ...\nMm\n\nYou are listening to relax radio W. J. C. T. eighty nine nine H. D. three Jacksonville to support this music service and W. J. C. T. please call three five three Ninety five to eight or visit ... Jaycee T data work\n[noise]\nWho's never fail and well\nIt seems that I\nHaven't been thinking\nIn\nShallow\nAnd am the ...\nThe ease that why were they every cheese", "show_name": "Relax Radio", "year": "2018", "city": "Jacksonville", "day": "20"}