{"month": "10", "state": "GA", "station": "WSBB", "content": "\n\n\n\n... how\nBreaking news weather and traffic either end on now on your\nW. W. F. B. radio I listen to the latest WSBIU more traffic on on demand when\nLive coverage on the news people you depend on the radio ads download it out and they act on it\nMorning workout\nA busy I hate it when I miss white and Jamie brain when he's swarmed ... power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a W sb ... piece of all their their latest news in traffic on demand is always the weather\nWhat about when something happens breaking news station on your time and the\nBad news I heard all day I'm downloading data right now do you have the radio ads downloaded out in the store\n[noise]\nThat what you ask me is broadcasting University of Georgia ... by ... am seven fifty broadcast restrictions we cannot\nTo be a sports presentation on and then when you ask me radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on mute ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nI'm a junkie here on the road a ... hour\nCan you know breaking weather and traffic you've ever been on on your\nDoor you had to do what you ask the radio waves until the latest WSBIU or traffic on on demand and wait\nIn line continuing coverage from people you depend on the radio I downloaded out and they act\nThat when you ask me is broadcasting University of Georgia sports I'm not by by them at a um seven fifty deliberate kept restrictions we cannot operate the UGA sports presentation on WSBIU radio up\nOr through W. S. B. radio dot com tune in and I hard here the game a bulldog talk on music ... them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this white and Jamie breed when they stormed and we lose power would\nBe the guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab piece of all their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now don't you have the radio ads downloaded out in the store and get a little play [noise]\nNow what do you ask me is broadcasting University of Georgia sports on TV by by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up or through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on\nMs ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nYeah my job to prevent the on the road on ... hour\nBe breaking weather and traffic either end on on your\nW. W. F. B. radio until later WSBIU more traffic on on demand\nLive coverage on the people you depend on the radio ads downloaded out in the outdoors\nAnd Google Play [laughter] morning workout\nI'm busy I hate it when I miss white and Jamie brain\nStorms and relief power\nWould be the guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand it always severe weather coverage about when something happens breaking news yeah is your station on your time\nAnd the bad news I heard all day I'm downloading not happening right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nBroadcasting University of Georgia sports I'm not a pie by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentations and then when you asked me radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... them on your radio\nMatt bulldog talk on these ... about them on your radio and on AM seven fifty W. S. B. W. at the program and continues here at a later our as normal that can do that [noise]\n\n\n\n\n... hour\nCan hear breaking news weather and traffic you demand on now on\nW. W. F. B. radio until the latest WSBIU more traffic on demand and\nLive continuing coverage of people you depend on the radio I downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on not buy buy them at a um seven fifty do the broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... by them on your radio and on a um seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal and all that [noise]\n\n\n\n\n[noise] [noise] morning workout\nBusy I hate it when I this white and James debris when storms and we lose power when\nThe guy you know you can listen to W. S. P. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store and they'll play [noise]\nThat what you ask me is broadcasting University of Georgia ...\nBuy them at a um seven fifty due to broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up north rebel USB radio dot com tune in and I hard here the game as\nBulldog talk on music ... them on your radio and on AM seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n... power\nBe bringing weather and traffic you demand on now on your\nDoor you know you asked me radio waves until the latest WSBIU more traffic on on demand and\nAlive continuing coverage of people you depend\nOn the radio I downloaded\nAnd Google Play [laughter]\nA busy I hate it when I this white and Jamie breed\nWhen they stormed the Willis Tower one\nGuy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab piece of all their\nLatest news in traffic on demand is always the beer weather\nWhat about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and little play [noise]\nThat what you ask me is broadcasting University of Georgia ... buy them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n[noise]\n\n\n\n... hour\nHear breaking news weather and traffic either end on now on your door you had to do you ask the radio\nUntil the latest WSBIU more traffic on demand and\nLive coverage of the people you depend on the radio I downloaded out in the outdoors\nWSBIU broadcasting University of Georgia board somebody bought by them at a um seven fifty broadcast restrictions we cannot allow for the UGA sports presentation on WSBIU radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game and bulldog talk on music ... them on your radio and on AM seven fifty U. S. B. W. F. B. program and continues here at a later our as\nNormal and all that [noise]\n\n\n\n\nI'm busy I hate it when I this white and Jamie the brain when stormed his power\nOne guy you know you can listen to W. S. B. anytime anywhere with the devil USB radiolab pizza all their their latest news in traffic on demand is always the beer weather coverage what about when something happens breaking news station on your tie\nAnd the bad news I heard all day I'm downloading that happen right now that don't have the radio and download it out in the store\n[noise]\nNow what do you ask me is broadcasting University of Georgia sports on not by by them at a um seven fifty due to broadcast restrictions we cannot operate the UGA exports presentation on WSBIU radio up or through W. S. B. radio dot com to man and I hard here the game a\nBulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n... how\nBe breaking news weather and traffic either end on now on your\nW. W. F. B. radio\nWomen to the latest WSBIU more traffic on on demand and wait\nA live game coverage on the people you depend on the radio out downloaded out the door and Google Play [laughter]\n[noise]\nA busy I hate it when I miss late and Jamie breed\nSwarmed ... power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab piece of all their\nTheir latest news in traffic on demand is always the weather\nWhat about what Trump would happen breaking news station on your time and the\nBad news I heard all day I'm downloading at apple right now the W. B. radio ads downloaded out in the store and it'll play [noise]\nThat what you asked me a broadcasting University of Georgia board not buy buy them at a um seven fifty a broadcast restrictions we cannot offer the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game at bulldog talk on mute ... about them on your radio and\nOn a um seven fifty W. S. B. W. at the program and continues here at a later our as normal depend on it [noise]\n\n\n[noise]\n\n\nYeah my job to be on the road of ... power\nHear breaking news weather and traffic either end on now on your\nW. W. F. B. radio waves until the latest WSBIU more traffic on demand and when\nDoesn't live coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNobody us be broadcasting University of Georgia board somebody bought by them at a um seven fifty deliberate kept restrictions we cannot allow for the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on AM seven fifty U. S. B. W. F. B. programming continues here at a later our as\nNormal that can do that [noise]\n\n\n\n\nBusy I hate it when I this late and Jamie the brain when they stormed the Willis Tower one\nGuy you know you can listen to W. S. P. anytime anywhere with the devil USB radiolab teeth all their their latest news in traffic on demand is always the beer weather\nAbout when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the store and go play [noise]\nThat what you ask me is broadcasting University of Georgia ... pi by them at a um seven fifty new to broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north through W. S. B. radio dot com Chilean and by hard here the game as\nBulldog talk amused by ... by them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our normal that can do that [noise]\n\n\n\nYou know breaking news weather and traffic you demand on now on your\nDoor you had to do when you ask me radio with until later WSBIU more traffic on on demand and\nLive coverage on the people you depend on the radio I downloaded out in the outdoors\nAnd Google Play [laughter]\nI'm busy I hate it when I this late and Jamie free and when they stormed and we lose power\nWould be like a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab paid all their their latest news in traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the dark and play [noise]\nUs be broadcasting University of Georgia board somebody bought by them at a um seven fifty a broadcast restrictions we cannot allow for the UGA sports presentation on the USB radio up\nNorth through W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... by them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\n... hour\nBe breaking weather and traffic either end on now on your skin\nWeather and traffic you've been banned on now on your\nDoor you know you asked me radio I listen to the latest WSBIU more traffic on on demand and\nLive coverage from people you depend\nOn the radio out downloaded out in the outdoors\nNobody us be broadcasting University of Georgia sports on TV by by them at a um seven fifty due to broadcast restrictions we cannot allow for the UGA exports presentation on the ws me radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on these ... them on your radio and on a um seven fifty W. S. B. W. F. B. programming continues here at a later our as\nNormal and on it [noise]\n\n\n\n\nA busy I hate it when I miss white and Jamie brain when it's warm than we lose power would be\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P radiolab pizza all their their latest news in traffic on demand is always the weather coverage what about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that apple right now do you have the radio ads downloaded out in the store and it'll play [noise]\nNow what do you ask me is broadcasting University of Georgia board somebody bought by them at a um seven fifty to broadcast restrictions we cannot operate the UGA sports presentation on the ws radio up\nOr through W. S. B. radio dot com tune in and buy hard here the game and bulldog talk on ms ... by them on your radio and on a um seven fifty W. S. B. W. at the programming continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie briefing on the road on ... hour\nYou know breaking weather and traffic you demand on now on your\nDoor you have do you ask the radio I listen to the latest WSBIU more traffic on demand and\nAlive continuing coverage on the people you depend on\nThe radio ads download it out and the outdoors\nAnd Google Play [laughter] morning workout\nBusy I hate it when I miss white and James brain\nWhen a storm didn't release power what\nThe guy you know you can listen to W. S. B. anytime anywhere with a W S P real apathy is all their their latest news and traffic on demand is always the beer weather\nAbout when something happens breaking news yeah your station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio ads downloaded out in the dark and it'll play [noise]\nThat what you ask me is broadcasting University of Georgia board not by by them at a um\nSeven fifty a broadcast restrictions we cannot operate the UGA sports presentation on WSBIU radio up north to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on music ... them on your radio and\nOn a um seven fifty W. S. B. W. F. B. programming continues here at a later our as normal that can do that [noise]\n\n\n\n\nI'm a junkie for my family on the road a ... hour\nYou know breaking weather and traffic you've been banned on now on your\nDoor you had to do when you ask the radio\nListen to the latest WSBIU or traffic on on demand\nW s he knew more traffic on on demand and\nLive continuing coverage of people you depend on\nThe radio I downloaded out in the outdoors\nNow what you ask me is broadcasting University of Georgia sports on\nBy by them at a um seven fifty a broadcast restrictions we cannot operate the UGA sports presentation on the USB radio up\nNorth to W. S. B. radio dot com tune in and I hard here the game as bulldog talk on these ... about them on your radio and on AMC seven fifty U. S. B. W. at the programming continues here at a later our\nNormal depend on it [noise]\n\n\n\n\nI'm busy I hate it when I miss late and James debris and winning storms and we lose power what\nLike a guy you know you can listen to W. S. B. anytime anywhere with a double USB radiolab pizza all their\nTheir latest news and traffic on demand is always the beer weather coverage about when something happens breaking news station on your time\nAnd the bad news I heard all day I'm downloading that happen right now do you have the radio and download it out in the store\n[noise]\nNow when you ask me is broadcasting University of Georgia board or not he bought by them at a um seven fifty a broadcast restrictions\nWe cannot operate the UGA sports presentation on the menu at the radio up north to W. S. B. radio dot com and and I hard here the game as bulldog talk on music ... by them on your radio and on AM seven fifty U. S. B. W. at the program and continues here at a later our\nNormal and on it [noise]\n\n\n\n\nYeah I'm a junkie here on the road ... power\nBe breaking weather and traffic you've and on now", "year": "2018", "show_name": "Erick Erickson", "city": "Doraville", "day": "27"}