{"month": "10", "state": "NH", "station": "WEVN", "content": "Five W. E. B. S. cobra Ninety point three\nAnd W. E. B. Q. Littleton Ninety One point nine and online at an H. P. R. dot org from NPR I'm\nSam Sanders it's been a minute\nThis week we're taking a break from the news of the week with a special episode\nAnd all this hour we're talking about coming out this past Thursday October eleventh it was a thirty of annual national coming out day so exploring in Des how coming out his change and where it came from in the first [noise]\nYour immediate family\nOr your your your people you\nWill hear coming out story she listeners gas the mom has been a time when you felt attracted to another woman and she [noise]\nRound and thought about and she said no and I said well neither have I.\nAnd later the best things that happen to our listeners all week\nFirst business\nLive from Culver City California I'm Janine hurts President Trump met with Andrew Brunson in the White House today the American pastor is back in the U.S after being held for nearly two years in Turkey was accused of participating in a failed coup attempt in twenty sixteen a charge he denies\n[noise]\nI well I'm a pastor brunch [noise]\nTrump speaking there to campaign rally in Richmond, Kentucky today stumping for Republican candidates in that state it's the latest campaign rally he's held around the country ahead of the mid term elections next month\nAt the rally he also praised Senate majority leader Mitch McConnell who is from Kentucky for helping to get a cabin up onto the Supreme Court relief supplies lifesaving equipment and personnel are all heading into areas of Florida's panhandle rabbits by hurricane Michael\nHampering trucks from getting into the most heavily damaged areas at least fourteen deaths are being blamed on the storm but officials expect that number to rise and bears David Schaper reports the commercials supply chain is also disrupted as well which could drive up consumer prices\nWith some highways still impassable and relief in response vehicles taking priority experts or logistic say it may take some time for commercial goods materials are products to get through Florida Randy ... with Tampa Bay blew grades logistics you're waiting\nOn a product that may be coming through the port of Miami it's not going to be able to get up through the panhandle right now and get up into into the mid west and to Chicago and then the then be distributed so you will see delays\nOver here said there was already a shortage of drivers and some will now be diverted to hurricane relief so his customers are seeing a fifty percent spike in shipping costs that could make orange juice grapefruit and other Florida produce more expensive in the weeks to come David Schaper NPR News\nThe Taliban confirmed that their representatives in cutter held talks with the U.S delegation including in ... new U.S on going to the region and glass reports from Kabul the peace efforts are aimed at ending the Seventeen year war\nThe meeting between the Taliban and U.S officials is the second time the two groups have met face to face was at first was only ... the new U.S special representative he declined to give details the Taliban and say the two sides talked about finding a peaceful resolution to the Afghan conflict\nThey also said that the presence of foreign forces remains the greatest obstacle to peace but that both sides agree to continue to me about Fifteen thousand us troops remain in the country\nLives not briefed the Afghan president on his first trip in the region which included a previous stop here Pakistan Saudi Arabia and Qatar\nUs Taliban meetings represent a shift for years the United states refused Taliban request to me directly seeing any peace process should be Afghan lead for NPR News I'm Jennifer glass in Kabul\nYou're listening to NPR News from Culver City California\nPope Francis today de ... to ... priests accused of sexually abusing minors and in an apparent effort to show greater transparency he publicly examined why they were removed and here's Philip Reeves reports Francis made the announcement after he met with chilies president\nThe tuba ships with religious clerics to fold in a scandal that's engulfed the Catholic Church and today the Vatican says Francisco Jose ... Marco Antonio Dennis Fernandez was stripped of the priesthood for overt acts of abuse the scandals so far that to the resignation of a handful of bishops a prominent priest was the ... last month\nAnd prosecutors say they're investigating over one hundred cases of alleged clerical abuse going back to Nineteen sixty\nThe Vatican's long been accused by victims of covering up the issue and then being slow to respond when the pope eventually sent a team to relate to investigate it identified the culture of abuse concealment for a brief abuse\nFuneral services were held today for some of the victims of the party bus crash in upstate New York last week that left ... people dead\nIn Amsterdam New York hundreds of mourners packed the saints fan of lost Roman Catholic church for the funerals of four sisters killed in the crash along with three of the women's husbands and the brother of one of the husbands the NTSB is investigating but so far no cause has been determined\nThe driver of that party event also died and authorities say he barrel down a street hitting an empty parked vehicle before coming to rest intervene the limo company has been banned from operating until the NTSB investigation is complete I'm Janine Herb's NPR News Culver City California\nSupport for NPR comes from NPR stations other contributors include vital projects on supporting them\nCharles White retro Specter is on view more info and tickets at a moment data work and the listeners who support this NPR station\nUh-huh\nSupport for an HBO comes from you our listeners and from Littleton regional healthcare announcing the new North Country comprehensive pain center to help individuals with chronic pain management Littleton healthcare dot com and the SP shows presenting singer songwriter Gordon Lightfoot legend lives on tour at the colonial theater in Keene\nThursday October twenty fifth tickets at the colonial dot org [noise]\nSam Hi, Bob hello how are you I'm fine so I was I was just like Brett I'm not sure that the odds are that I'm Out to the audience I mean I Am right I mean because I have been for like Thirty years but um but but\n[laughter] [noise] from NPR I'm Sam Sanders it in a minute [noise] today on the show we're taking a break from the news to focus on just one day from this past week in October eleven that was national coming out day\nThis year is the thirtieth anniversary of that day and a thing I always think every year around this time is it never just one day [noise] coming out happens differently for everyone on the more than once and for some of us it seems that process never really ends\nCase in point my friend Bob Mondello film critic for NPR's all things considered how old are you Bob I turned Seventy next year shut up no really so okay what year did you come on\nThat's a hard question to answer do you mean to myself do you mean to my folks do you mean to my friends do you mean I I ... it depends what you're talking okay well\nYou see what I'm saying I today on the show we're going to explore the history of coming out and coming out day I was how it came to be how it's changed over time\nAnd what it means for the ... community to them back when Bob grew up in the sixties you could get locked up for even going to a gay bar it was a very different times so Bob's first coming out actually wasn't until Nineteen Seventy four after he just had his first same sex experience\nBob told his best friend who he thought might also be gay\nI was in his apartment and it took me forever to work up to it I I was\nSitting there and [noise]\nI just take a deep breath and I was trembling [noise] um but what I said was I'm gay\nI acted him to say so am I fall into my arms and what he actually said was\nTwice in one week\n[laughter] well that was going to\nReact and how they're somebody else beat me to this [laughter] um but at an event you know when I was coming out we didn't have a models in public discourse there were no models for gay people on the generous hadn't come out of a TV [noise] and ah the will and grace was far in the future and\nSo um I think it's a different world than I I hear about people coming out at the age of twelve and I think could lord I was never that brave I mean you never in the world and I don't really know what it would be like today to do that\nI don't know either I mean I remember my process and it literally Bob it took me years just to look at myself in the mirror and say the words I Am gay\nTook me years to do that okay now if I can turn this interview on its head why\nIt was a hard time to be gay and a hard time to come out but not quite ten years later America would witness maybe the biggest coming out story it is seen yet\n[noise]\nWhen you're [noise]\n\nComing out in Nineteen Ninety seven ... James and then plus more with professor Marci Gallo or break I'm Sam Sanders\nYou're listening to it's been a minute from NPR it's nine twenty on an H. P. R. [noise]\nAnd stay tuned to an HBO or next week as the candidates for New Hampshire second congressional district come into square off Democrat and mclane Custer and Republican Steve McGraw will be an HBO ... the exchange live at nine am on Tuesday to tune in then and of course you can track all our election coverage at an H. P. R. dot org [noise]\nAnd support for an HBO or comes from you our listeners in from B. C. M. environmental and land law solutions for northern New England lawyers representing developers farmers nonprofits and individuals online at ... dot com\nCapital Center for the arts presenting Canadian singer songwriter Alan ... oil and special guest artist Whitney Rose Sunday November eleventh\nDetails at C. C. A. N. H. dot com and New Hampshire Business Review presenting it's powered by women event on October Eighteenth of storytelling event featuring five female business leaders tickets at N. H. B. R. dot com\nSupport for NPR comes from this station and from the NPR One club every wind comes with a story including NPR inspired bottles like weekend edition cabernet available to adults\nSupport for an HBO ... comes from you our members on from Dartmouth Hitchcock imagine nationally ranks healthcare in your community was convenient location throughout northern New England world class providers are closer than you think is a Dartmouth Hitchcock dot org to learn more\nStarting with Hitchcock is here\nWe are back you're listening to it's been a minute for NPR I'm Sam Sanders\n[noise] this week we're talking about national coming out of this past Thursday October eleventh we're looking at some big moment in coming out history and here in the coming out stories from listeners I've been talking to Marcy Gallo she's a professor at University of Nevada Las\nVegas just talk me through the history of coming out and you can't really talk about that history without talking about this one big moment\nYeah it was a big deal uh she took a big big big risk and we'll her a lot\nThat's Marcy discussing Ellen in Nineteen Ninety seven on ABC sitcoms [noise]\n[noise]\n[noise]\n\n[noise]\nI remember this year I was like\nThirteen ... and I remember I think my parents told me not to watch but I knew that I shouldn't watch wow that makes them ... and I and I probably thought later is not just to see it but I remember how big of a deal it was for this woman to come out\nOn her prime time TV show to her therapist who was at that time played by Oprah\n[laughter] oh God I had never\nReally and it's not like I'm looking for perfection you know I just I just want somebody special somebody you know that I I click with and obviously you didn't click with Richard\nHas there ever been anyone who sells you click with\nAnd what was his name citizens [noise]\nThey both for younger overseas like [laughter]\nI don't know I as I thought if I just ignored it you know just go away and I can just let a normal life\nAnd what is a normal life Ellen no normal\nI mean just the same thing everybody wants to my house is taking fancy Noah donned the cat Sunday barbecues ... someone who loves me when I can build a life with and\nI just want to be happy and you think you can't have these things with a woman well\nSociety has a pretty big problem with it you know there are a lot of people out there who think people like me are sick\nSo I mean coming out has been a thing at this point for a few decades and one of the backlash that she face was pretty at the last show all these conservative groups urged companies to not buy ads on the show ABC actually\nPut an adult content warning on episodes of Alan that showed a woman kissing a woman [noise]\nThere was even coverage that if you listen back to you from NPR that I find it hard to imagine airing um snow in April in Nineteen Ninety seven\nThe afternoon before that episode aired of Alan a Robert Knight who was then the head of the family Research Council he talked to NPR about this and you just got to hear it\nYou see there is an agenda here to normalize homosexuality all the good characters are update you know free spirits wonderful people and of course a lot of gay people are like that but not all of them and and yet it it seems to me that they are doing their best present homosexuality or something desirable normal something you ought to try kids\nOr you don't have to worry about any morality since we've decided there is no right and wrong in this issue\nIt normalize it and anyone who says otherwise was a terrible biggest wow wow [noise]\nIt's so funny she says there's an agenda to normalize homosexuality it's like\nYeah yeah yeah there was a point on the whole he hate kids it's okay you can try to uh it was fascinating to hear because of course what they were terrified about that it would get normalize that there would be acceptance um [noise]\nAnd I frankly I think we're still fighting that fight quite honestly and can I jump up and I know we're going decade by decade I'll do it go ahead but you know I ... for today I was looking at a Washington Post opinion piece you might have already seen it\nI'm like academic I'm Matt Brickell wrote this really interesting piece in the Washington Post last October eleventh\nIs when it appeared um and he sets off a brain blow flag waving firestorm really of protest when he says\nDon't come out you say people write queer people stopped coming out\nIn the ... gone from Nineteen Ninety seven Ellen coming out and it's a big deal to twenty Seventeen Twenty years later I'm or we don't do it academic thing don't do it what is the rationale behind [laughter] okay\nSo for one and this is debatable\nAmerica this is a quote America's a safer place than twenty Seventeen people secondly though and even more kind of convincing in some ways he's arguing that are having to come out reinforces the view that heterosexuality still is the norm\nI'm paraphrasing he's you know we have to proclaim my sexuality right and we need a national holiday to do it but they don't wear as bright heterosexuality is normal and expected and he says everyone should come out for no one should\nMaybe heterosexual people should come out on October eleventh and say I'm straight and but he is arguing that our sexuality is no way to organize our judgments about people\nAnd that no particular sexuality should be the expected default\nSpeaking of the ways that things have just become more fluid I'm thinking of the ways that celebrities come out now you know ... ... R. and B. singer Frank Ocean and she came out but he never use the word gay right you know do you think about Jodie Foster Amos the kind of came out\nThe globe's we actually have paper that\nYou know I'm just getting it right out there right loud so underneath your support on\n\nYes I think\nI already did my company out about a thousand years ago back in the\nAnd [noise]\nOpen up the trust of friends and family co workers and then gradually probably to everyone who knew her everyone's actually\nBut now I'm told that every celebrity is expected to honor the details of their private life without press conference or fragrance enterprise I\nHave a point in my mind go should have a point should we be forced to anybody be forced to like do the coming out in the way that people say you're supposed to be coming out\nYeah and see this is where we go back to it being both a personal any political choice\nI think the personal has to come first and I think that you don't you and I know the the list of celebrities who we all sort of wink wink you know about\nAnd you really want to come out and who flirt with it much like first it did um and then for whatever reasons whether it's familiar you'll\nUm whether it's just\nThey decide not to or they don't yet or they wait or whatever and I think I think there's got to be room for that too I Do I care more about whether people get in the way of social change or\nEight at somebody is down with the struggle if they are helping the movement however they want to do it whether it's overt or covert I think the choice of whether they command is up to them [noise] [noise]\nThis event is sponsored in part by New England employee benefits company and McLean Middleton\nAnd support for an HBO or comes from you our listeners and from the musicals intimately or series of a historic theater presenting upper soprano Renee Fleming on October twenty first at four pm\nTickets at the music called out or and Mac's apples on mammoth wrote in London dairy farm standing you pick orchards now open for Apple's plus pumpkins of all sizes by the wagon full information that Mac's apples dot com\nAnd the New Hampshire women's foundations fourteenth Daniel women building community lunch in October twenty thirty Manchester with special guest Tiffany do food and they ... foundation dot org\nSupport for NPR comes from this station and from life lock life luck with Norton works to help protect identities and the information on devices from cyber criminals learn more at life ... dot com\nFrom the corporation for public broadcasting and the state of Joan crock who's ... serves as an enduring investment in the future of public radio\nAnd from American Jewish World Service working together for more than Thirty years to build more just an equitable world learn more at age eight W. S. dot ORG\nListening to it's been a minute from NPR's Sam Sanders dispatch Thursday\nKnow coming out day [noise] mark that day we are exploring coming out I Would never just one day and how it's\nDifferent for different people born in in this next segment you'll hear a gay slur I've been talking with e Patrick Johnson the head of the African American studies department at Northwestern university and he told me how coming out can change when you're from a marginalized background\nI'm Talking about black people brown people and there's people whoever where you live a gay life\nBut you don't talk about it and maybe there isn't a coming out day where you tell everyone [laughter] folks know and and and like other folks don't [laughter] this feels to me to be a thing but it's much more of a thing for gay people who are not white and my rights and\nYes yeah and yeah and if you are already hailed\nAs and you fill in the blank in terms of your rights or a black person I'd like to next person Asian person and that brings with it a whole set of\nTo who you are as a person and so you in some ways don't have\nAny choice but to\nLive with that because you you can hide it and I especially feel that way I'm for African Americans in particular because of the connection to the church mhm you couldn't go to any black church in the United states\nAnd not find a game in a ... a whole ... of them yes um and it's a complicated place because I grew up in the church and the church is actually where I feel I came into my own at\nWork I mean like I felt safe there like as a young black boy in the church was the one place I knew I wasn't going to be made fun of correct but it was also the one place where I knew that I might hear the word faggot over the pulpit mhm it was just weird dichotomy but I always felt in this weird way safe there\nYeah I mean the church is where I was encouraged to um express myself which I was a big a clean love them and in the choir stand a singing soprano the only way over the Sopranos\nSection and I'm sure they ended up I'm sure they loved it they should be in that yet at the same time the pastor was talking about gay folks going to hell and God gave you age because you're saying yeah well\nNot in my church that I thought okay that [laughter] but many charges were doing but many are absolute and still do and ... and so yeah it's a really a\nConcert [laughter] life yeah no but that that's part of the other thing but also you know we also had the whole down low yeah phenomena and also we should stop to define what the down low is for those who might not know\nYes so men who are on the down low are men who sleep with men but who do not attend a fight as gay and they're usually black and only ... for men other than black man\nYes I'm even though that's not true [laughter]\nWell I mean like we have these euphemisms for like white man they yeah but they were living in a life you know the lead a double life yeah what does it say about\nWhat coming out has become where you move from Harvey Milk in the seventies to coming out day in the eighties to acceptance for folks like Alan by the nineties yet at the same time this subset of the community black men they're still being labeled with this term deal\nSo at the same time that\nYes there was a part of the community that we're not being open there was another part that was actually being very open in the seventies in particular\nOf a black in Latin next lesbians were open and pushing things forward in ... and it was that weaned are pushing back against the second wave feminist movement was white straight middle class\nWomen and these black can lead to next lesbians like hello I'm we're here as well and so people like Audrey lord a serene erotica Gloria and so do uh I could go on and on and none of these black lesbians yeah and like lesbians\nSo it's a complicated history is not just that black folk sort of disavow coming out of being open about their sexuality or in total some make that decision but then there was a whole other set who made another choice\nThat's always can be very challenging for all kinds of marginalized people take on ... riots there another listener who share to coming out story with us\nOn a as twenty five from Minnesota on his parents are Catholic immigrants from Mexico two and a half years ago and he came out to family and friends as clear\nTheir parents reacted okay not great but okay but on the has the second coming out story about coming out to themselves as transgender\nI was in college and I in one of my classes um my professor had brought in a trench shoot a trans woman who is just like kind of sharing her story guys like raised to be only strong and like you know soft nest and\nUm and I always felt like something was wrong but like compensated by eating like in the military and I got a wife and kids and like all this stuff and and I never gave myself face to really like ask myself centrally like\nThink about who I Am\nI was like back in my chair and I always did in class and um I was just kind of thing that ever another like giving yourself the space\nYourself [noise] never done that before interesting and said I pushed myself that question I was like okay well I Am I a woman and I like almost fell out of my chair [laughter] because I was like the answer was no\n\nOn a recently wrote a letter to their mom and dad to explain this saying they were considering top surgery a double mastectomy on his parents got really hung up on that\nSame kind of got stuck on the idea that like oh this is a a\nCosmetic issue and or like an aesthetic issue and it's like I just something you don't like about your body and I don't like about my body and everybody like things about their body reached out to like\nMake our way through life and we just have to learn to love ourselves and it was like well there's a difference between that and and feeling like I mean dissociative with your with like a body part and like\nI don't know like something feels like genuinely wrong\nAnd so I kind of made it clear that like\nIt doesn't matter if you understand or not but like it does matter if you kind of respect and honor my autonomy on that and that was something they said\nYeah the other day and age we like Saturday Night and then as the going after that and my dad called out after me and say like well again tonight and thanks for being yourself\nI mean maybe not never really under stand in that but\nI'm Still their cat and um yeah and we still love each other\nThat was on the rise and limit Minnesota their story highlights how coming out today can be much more complex than what Elon did Twenty one years ago professor ... Patrick Johnson told me it's more complex now for celebrities to like Janelle Monet a is an example\nBecause she didn't come out as gay or it was something much more fluid and I think we're in a moment of trans news\nAnd gender non conforming aid that is really influencing how people announced their sexuality and so it's much more ... than a I'm coming out because I like the same sex it's more like well I'm not heterosexual\n[laughter] yeah well and like she said that she opened me was I think pan sexual and this guy sometimes in the girl dance and people that are not going for me um times and also thinking the same vein of someone like Frank Ocean who kind of came out but in actuality never ever used the word gay", "year": "2018", "show_name": "It's Been a Minute", "city": "Keene", "day": "14"}