{"month": "10", "state": "MA", "station": "WFCR", "content": "\nSo you're on any to Europe was sick of the right to sing the blues generic hill so their own shuttered with Scott Robin ... great coat on base and met you know the stereotype to tour\nThat's in the group called the your regulars led by trumpeter generic hill so ... six we'll be back with us this year for the ... holiday party on Saturday December first hotel north Hampton\nEver heard Houston Person around quarter to please do dream Houston Person is back is sort of his tomorrow night with the north had the chance workshop\nThis is New England public radio WFCR in Amherst Springfield Hartford support the full ... if you'd any pure support jazz in classical\nStreaming ... public radio was funded by ... rental architects a forty year legacy of combat but to community had designed celebrating the next generation of leadership at ... dot com\nSix three million eat eat five zero on this ... any your debt yeah classical music is next\nPeter ... with a bunch of Latin American inspire pieces were going to begin with three pieces were be slipped and guitar by Joseph ... ... but these are some buttons and they're formed by the composer and Andrew ...\n[noise]\n\n\nAnd Judy when she's tickets to Hamilton from S P R you could win ... seats at the Boston opera house and dinner afterwards that eastern standard entered Alex any P. R. dot net\n\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\n[noise] usually composed in Nineteen Seventy six by guitarist composure Joseph ... and he indeed played the guitar there with Andrew ... playing not just the food but the base flipped interesting that's called three pieces but it is in fact\nA collection of three some buttons and it opens a whole series of\nA Latin American inspired music by American composers hope you'll stay with me\n\nI beat her ... we have a work by Morgan Gould right now and then by George Gershwin both having to do with Latin America Maurice Robin ... leads the Utah Symphony as we listen to this Latin American sinful Matt Bai working go there's four movements run by water cha tango and Congo\n[noise]\n\n\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts do now would rolling for fall Gees easy yes dot org [noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\n[noise]\n\nNo no\n[noise] [noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by you and cute little architects of the year legacy of combat but to community design celebrating the next generation of leadership vacuum read all dot com\n[noise]\n\n\n[noise]\n\nStreaming up the what what public radio it was funded by you Greenfield commonwealth virtual school public ... school per se lodging education for Massachusetts do not what role for fall gene C. V. S. dot org [noise]\n[noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vents basis for a board room to ballroom with a B equipment and the house catering hotel Northampton dot com [noise]\n\nUtah Symphony more recent Robin ... at the podium and the Latin American simple nets by Morgan Gould run by the ... the tango and finding the Congo\nAnd a run by a diverse moving back was the original title\nOf the worker next going to hear by another American composer was originally called rumble for orchestra then re titled the Cuban over your average by George Bush what this is unreal credit to conduct the London symphony orchestra [noise]\n\nStreaming of New England public radio is funded by you and they have university graduate schools and asset applied laboratory science that operation that rolling now for August twenty seven applications that they pass dot edu [noise]\nAnd the butter ... perform that music by ... ...\n\nActually abuses by men who was famous as an organist and almost exclusively for his Oregon playing in compositions and yet we have to work for ... by the Smith whose name is Sean Connery V. door\nWhat was he doing writing for the flu which he did not play well it was written for a friend and colleague of his famous Nineteen century French flu just pull the tough I Know this is Sean already be doors sweet ... played by ... and the cat is banned Brooklyn\n[laughter]\nAnd you're doing two tickets to Hamilton from and BP are you could win ... seats at the Boston opera housing dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[laughter] [noise]\n\n[noise]\n\n\n[noise]\n[noise]\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ball rolled with Avi equipment and getting house catering hotel north Hampton dot com\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[laughter]\n\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu [noise]\n\n\n[noise]\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\nOr\n[noise]\nUh\nBush's of sentient with Dennis King conducting not\nPrepare our father the Lord's Prayer by Julie say\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and that N. E. P. R. dot net\n\nThe form of the ... most famously embodied in the compositions of American composer pianist Scott Joplin who live from Eighteen sixty eight to Nineteen Seventeen he wrote in many many rags we're going to hear a one which is lesser known\nAnd is leading to a piece by ... which is inspired by the rags of Scott Joplin somebody called ragtime uh this is though the searchlight wreck by Scott Joplin and the pianist is William Albrecht\nMm\n[noise]\nStreaming New England public radio was funded by ... riddle architect of forty year legacy of combat but to community design celebrating the next generation of leadership at ... riddle dot com\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\nThe tools sentimentality of the rags if Scott Joplin\nThat's one of his many such pieces immediately recognizable I think that those who know what to the entertainer and maple leaf rag two of the best known that one is a very little no one and it's a strange title I wish I could tell you what it means the liner notes don't specify it's called the search liked wreck by Joplin\nAnd the pianist was William operate\n\nJust a few minutes we're going to listen to the piano quartet number one by your son is Brahms in the ... or constriction and right now\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ...\nInspired piece of the strip and she said the discovery of American jazz was very important event in my life and this came about as a result of that it is called ragtime for eleven instruments members of the London sinful yet conducted by is a pack a cell phone\n\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology hey I see ...\n\n\n[noise]\n\n\n[noise]\n\nStreaming of New England public radio was funded by ... riddle architect oh forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n[noise]\nInterviewing two tickets to handle in from an e P R you could win to greet the that the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\n\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\nNa\n\n\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\nMm\n[noise]\nInterviewing two tickets to handle in from an e P R you could win two great see that the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\n\n\n\nStreaming of New England public radio was funded by ... cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership acute red dot com [noise]\n[noise]\n\n\n[noise]\nInterviewing two tickets to Hamilton from an e P R you could win two great seat at the Boston upper health and\nDinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n... conducting dared the b._b._c. uh singers in some music by Arnold Schoenberg\nOr from the recordings of all of ... on the company coral works ... do most you should not but you must you should not make yourself an image for an image limits reduces grasped that which should remain unlimited\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended in E. P. R. dot net\n[noise] I'm Peter Van to grasp for going to feature the trombone and a couple of pieces here and let's begin with ... and Carlin bonded piano this is the bride and the waves by Herbert el ... [noise]\n\n[noise]\nStreaming of New England public radio is funded by un they pass university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\n\nLinda\nI'm\nMatter\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a ice sheet ...\n\n\n\nAll that [laughter]\nNo no no\nNo\n\nA show piece by Herbert al Clark written for the coordinate originally but perform there on the course of the trombone by Larry junk and with a Carlin bond that the piano and that's called the ... the wage we have more trombone use a couple of pieces including\nSeventy six trombone from the music banned by merit just Wilson\n\nFor me on the beach trombone here's Donald now with the red woods at the piano dishes an arrangement of one of the songs of all we felt were by ... by blowing ... to blue eyes\n\n... ...\nStreaming is New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nNa\nNa na\n\nNa\n\nNa\nNa na\nNa ...\n\n\nA\nNa na na\nNa\nNa na\nNa na\nNa na\nNa no\nAnd to to link to keep to handle team from ... are you could win ... seats at the Boston opera housing dinner afterwards that eastern standard and you're now in any P. R. dot net\n\nStreaming of New England public radio is funded by un they passed university graduate schools MS and applied data science enrolling for October twenty second applications that base paths dot edu [noise]\n\nUh\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the basis for a board room to room with a the equipment and the house catering hotel north south on dot com\nOr [noise]\n[noise] [noise]\nNo\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nAnd you're now in any P. R. dot net\n\nWell\nWell\n[noise]\n\n\n\nNo\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community does not celebrating the next generation of leadership a cute little dot com\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n\nNah nah\nStreaming of New England public radio was funded by you and said that university graduate schools MS in higher education minister racial rolling for October twenty second applications that they know dot edu\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise] oh\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu [noise]\n\n\n\n\n\n\n\n\nEllen Feinberg performing that little uh about a two to study based on fascinating rhythm from the musical lead to be good bye\nStreaming of New England public radio is funded by you and valleys solar a local photovoltaic designed at installation company serving people and planet to live carbon free and the far one three valleys solar dot solar\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR cameras Springfield in Hartford in partnership with the UMass Amherst end at N. E. P. R. dot net\nThese are two ... two pianos by Benjamin Britten recorded by Ronan do Harris and Steven off\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nInterviewing two tickets to Hamilton from an e P R you could win ... seats at the Boston opera housing\nDinner afterwards that eastern standard\nAnd you're now in any P. R. dot net\n\n\n\n\n\n\n\n[laughter]\n\n[laughter]\n\n\n[laughter]\n\nI'm\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [laughter]\n[noise]\n\n[noise]\nAnd\nAunt and\nMy\nServer [noise]\nAbout [noise]\n\n\nRonan O'Hara and Steven perform that music from Nineteen thirty six by Benjamin Britten he called that two ... two pianos\nBenjamin Britten humorous conductor with the English chamber orchestra and the ... ... concerto by boss [noise]\nStreaming up the ... public radio was funded by you add Greenfield commonwealth virtual school public online eight to twelve school personalizing education for Massachusetts students now would rolling for fall gene CVS dot org\nNa\nStreaming of New England public radio was funded by you and valleys solar a local company install like Ruth ground amounts and do all access trackers helping households lip carbon free and the poor one three valleys solar dot solar na\nStreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education administration enrolling for October twenty second applications that they pass dot EDU\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nThe six the Brandenburg and turtles by Johann Sebastian Bach that's the one that uh oddly enough has no violins involved in it\nThat recording was made in the late Nineteen sixty is with the English chamber orchestra conductor was none other than Benjamin Britten great British composer I thought we'd fold that with since that was a string based Brenda ...\nWork by Britain which drew upon music you can pose as a child and he called it the simple symphony\nAnd it's worth reading the names of the movements that you gave the first is the boisterous Blu ray then the playful ... sentimental Sarah bombed and finally the frolic some finale he was Britain's simple symphony what the ... chamber orchestra [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org [noise]\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org [laughter]\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seven applications at bay past dot edu [laughter]\n\nBenjamin Britten was a child prodigy and in writing the piece we just heard he drew on some melodies he composed well just a child and he called that piece the simple symphony for strings boisterous re playful bits of Cato sentimental Sarah Bond and frolic some an elderly\nAt our performance was by the conductor lists or peace chamber orchestra\n\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org\nInfo and he is by Carl Phillip ... boss the second son of Johann Sebastian Bach and just a moment but\nWe've heard a performance conducted by Benjamin Britten at the box six brand debris concerto we heard a composition of his there's another aspect to his art that is not often heard really it's his many folk song arrangements and there are a lot of them this is one which is called Oliver Cromwell\nOliver Cromwell lake buried in dead there grew in old apple tree over his head the apples were ripe and ready to fall there came a woman to gather them all Oliver rows and gave her a drop which made the old woman go Kitty Hawk settled and bright they lie on the shelf if you want to be more you can get yourself\nThis is a performance by Britain terrible a bass baritone and Malcolm Markey no cattle Oliver Cromwell arranged by Benjamin Britten [noise]\n[noise]\nYeah before I came [noise]\nAudio tape which made you'll go but you didn't even [noise]\nI I understand he didn't want any more you can see just how [noise]\n\nOne of the many folk song arrangements made by Benjamin Britten anonymous text there Oliver Cromwell the title and Britain ... was the bass baritone with knock him marching do at the ... from there don't you grab a phone disk of English songs called silent noon\nWe heard that symphony for strings by Benjamin Britten here's a symphony for strings with a\n... record as well by Carl Philippe ... who wrote a lot of such pieces of course the second set of Johann Sebastian Bach here is a symphony in a major and it's recorded by his namesake orchestra and the conductor here is heart much tension\nStreaming of New England public radio was funded by un cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n\n\n[noise]\n[noise]\nStreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nMusic written exactly two hundred years after the Carl Philip amenable boxing funny that we heard and it is a country dance by German composer ... act performed by the mines went down ...\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended\nStreaming of New England public radio was funded by ... June ... architects oh forty year legacy of combat but to community design celebrating the next generation of leadership cute red dot com\nJoin me for some ... music and Peter ... to ... to ... we have a symphony by ... ... ... ... and ... run into some\nColor inspired using one does by Michael ... bright blue ... another just work what would you be she called ... ... ... in black and white [noise]\nFirst despite Giovanni got breed ... specifically a decent run to this is who is still not Yani ... or the end well for for by Trump Buddhist from several of the great orchestras oh ... ...\n\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis for a board room to ballroom with Avi equipment and in house catering hotel north Hampton dot com [noise]\n[noise]\n\n\n[noise]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall genes CVS dot org [noise]\nSome six team that trombone is coming from the Academy of St Martin fields BBC symphony English chamber orchestra London sinful you got to\nA London symphony orchestra oil opera house called the garden orchestra filler Modi orchestra all conducted by Jeffrey Simon in the music by ... it's called so now the county ... the soft and allowed so not\n\nThere is one of the symphonies by the Italian composer of Mozart's and a heightened just days Luigi ... would listen to a symphony in she made sure it's the third of a collection of six recorded here by the new film where Modi orchestra conducted by Raymond part\nInterviewing two tickets to handle in from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard enter now in any P. R. dot net\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n[noise]\nStreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org [noise]\n\nInterviewing two tickets to Hamilton from an e P R you could win two great seats at the Boston opera house and dinner afterwards the eastern standard\nEnter now in any P. R. dot net\nAnd you're doing to kick it to handle it came from and BP are you could win ... seats at the Boston opera housing dinner afterwards that eastern standard and you're now in any P. R. dot net\n\n\n\n[noise]\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n[noise]\n\n\n\n\n\nUsually from Nineteen eighty five by the American composer Michael turkey called that bright blue music and the recording was made by the Baltimore Symphony conducted by David ... [noise]\nWell this is all supposed to do with colors of assorted maybe the absence of colors a black and ... in black and white ... did you see three pieces\nFor two ... two pianos and to ... which are each of them are dedicated to various figures of ... the first movement is actually inspired by ... you know and it takes\nA a line from going to agree knows Romeo and Juliet for its inspiration to second movement is dedicated to a friend of the composer WC shock shark goal\nWas killed in World War one and then the third section is dedicated to quote my friend ... by to BC ... in black and white played by Ursula ...\n\nStreaming of New England public radio was funded by un valley solar local TV design at the installation helping household secure state or federal incentives and live carbon free and the far one three valleys solar dot solar [noise]\n\n[noise]\n\n\n\n\n\n\nNo [noise]\n[noise]\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu\n[noise] [noise] [noise]\n\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\n\n\n\n\n\nStreaming of New England public radio is funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org\n\n\n\n\n\nOne of the many songs by the French composer ... Honda text by ... that's called ... ton autumn and it was sung by Susan Graham with Roger big nose Seattle\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst stand at N. E. P. R. dot net\n\nPeter ... Graff your selecting music for you I Hope you'll be able to hear it and enjoyed along with me I've selected a number of pieces which have to do with the emperor's including a couple of very famous works the emperor quartet by use of heightened the emperor waltzes or Johann Strauss junior\nWe're going to begin here with quite a sentimental composition that comes from an upper Retta called the ... each by a\n... and it is ... ... you should be the the emperor of my soul it's signed by most ...\n\n\n[noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences at psychology hey I see dot edu [noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\nDo\n\n\nStreaming of New England public radio is funded by ... architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nYou should be the emperor of my heart from operated by Robert Stoltz called the secret one most right ... ...\n\nJust a few minutes we're going to listen to the famous emperor quartet about using heightened that would be I think of how much music heightened roped it's almost unimaginable I and\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nFrom which the emperor quartet gets subtitled\nWord should God save from the emperor from the Kaiser he considered that morality is greatest double speak for it anyway\nAnd what is your first of all before the Supreme Court and arrangement of back to the arrange are used for Chrysler who was Austrian himself\nEarrings is worth ... that's interesting because it sounds as though it were being performed at times by two maybe even three violence instead of one but here's the Austrian imperial him composed by heightened originally with Oscar some ski by all the\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay past dot edu\n\n\n\nStreaming of New England public radio was funded by ... riddle architect or forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com yeah\n\n\n\n\n\nOh\n\nStreaming of New England public radio is fun to go you know the hotel herself to offering strict reading on the bench bassist Ron board room to room with the equipment that house catering hotel north helping dot com [noise]\n\nDreaming of New England public radio was funded by un cute little architect or forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional and education business health sciences psychology hey I see ... D you know\n\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nNa na\nNa na\nNa na na na na na na\nNa\nInterviewing two tickets to handle in from an e P R you could win two great seats at the Boston opera house and dinner afterwards that eastern standard and you're now in any P. R. dot net\nNa\n\nNa na\nNa na\nI'm um\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy S. dot org [noise]\n\n\nThe traditional New Year's day concert with the philharmonic ... conducting way back in Nineteen sixty one January first the emperor waltz by Johann Strauss junior and hearing emperor inspired music and we have one more such piece this was an overture\nTo a romantic opera from Eighteen forty five by heightened reach marshner marshner\nHad a brief dizziness do his career as a one of the prominent followers of Bieber leading the way in German nationalistic opera\nAnd this one's called Kaiser idols for nutshell emperor Adolf of nutshell has to do with a man who is declares himself emperor but find some self pitted against one Gary Hart an ambitious general and also a rifle in love\nIt do it was not a great success but here's the overture\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seven applications at bay past dot edu [noise]\n\n\n", "show_name": "Beethoven Satellite Network", "year": "2018", "city": "Amherst", "day": "02"}