{"month": "10", "state": "MA", "station": "WFCR", "content": "With the great Jazz Messengers ... piano and should be married on base our album feature in the evenings jazz on ... ... ... marine will come shine\nBird David hazel time playing smoke gets in your eyes he sold tons of ... the great standard budget ruined current that suffer brand new release some smoke sessions it's called the time is now el foster their own Jones Ron Carter on base David ... you know\nIt'd be for smoking a change of Roseburg Roberta ... singing lover comeback to me that suffer album from ... records called easy to love with a general Clinton at the piano and Roberta ... lover comeback to me\nRoberta ... will be accompanied by New Orleans ... have been fought or when she makes an appearance at the Berkshires ... music academy in ...\nStreaming of New England public radio is funded by un cue and read all architects a forty year legacy of commitment to community and design celebrating the next generation of leadership at ... riddle dot com\nYeah it'll be details or a ... Churchill's dot org slash ...\nThis was New England public radio WFCR in Amherst Springfield Hartford your partnership with the most ... than in ... or ... until ... will be back with you tomorrow night with the great Illinois your kid stay tuned for classical music you run any PR\n[noise] my name is Peter ... here's your host thanks for taking the time to drop in and listen to some music along with me hope you'll stay tuned for lots of baroque music as I thought we focus on a particular brutal form which was so important at that time and it is the sweet\nA suite of dancers were going to hear sweets from various parts of Europe from the baroque as we have one in just a few minutes by gear exceeded ... for two horns in orchestra\nAnd then we have one which features the field of the gumbo by a French Baroque composer met ram memory we have a sweet to arrange for music of personal ... and also one of the French sweet spot Johann Sebastian Bach first\nThis from the early German baroque ... the composer this is called the battle sweet to end it just we have three dances with that kind of a sound to it or the third piece being the gal yard ... this is the American brass quintet\n\n[noise]\n\n\nString of New England public radio is funded by un clinical and support options providing the ... year old health programs to families and individuals throughout western Massachusetts C. S. O. N. dot org\n\n\n[laughter] not na\n\nNa\nNa na na na\nNa na na na na\n\nNa\nNa na na na na na\n[noise] hey prefer more content from New England Public radio just go to NPR dot net\nSubscribe for music news and great storytelling at our\nWherever you get your podcasts [noise]\n\nThe American brass quintet performs what is called here at the battle sweets by early German baroque composer ...\n\n... baroque sweets for you to enjoy\nI suppose a lot of ... bills or wrote sweets into baroque because ah well they had to crank out a lot of music and it was a a handy way of giving a exact framework to what they were writing\nSweets included the series of dancers usually opening with over ... there were dancers such as a sort of bonded in the ... and the Blu ray\nAnd the she gets federal Kelly yard sometimes here is a sweet for two horns and strings in half by ... which consists of an overture for dancers Herman Belmont Timothy brown the horn soul was with the Academy of St Martin in the fields conducted by I own a brown\n\nStreaming of New England public radio was funded by the un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AS Easter defined technicians Massachusetts state inspections seek he's garage dot com\n\n[noise] that was her ... Belmont and playing the principal horn parts Timothy brown the secondary hard part and a sweet an F ... if you tell them up with the Academy of St Martin in the field and I own a brown now\nAnother sweet know as I mentioned before a sweet with such an important form in the baroque suite of dances really and this sweet is for a chamber on sample\nOf a ... violin the older the gum by and looped it's by a man who was himself a ... named ... around that re the group is mostly ... and this is a sweet indie miner\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do now with rolling fall gee C. V. S. dot org [noise]\n\n\n[noise]\n\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs and you ask each certify technicians Massachusetts state inspections she keeps garage dot com\n\n\nI\n\n\n\n\n\n\nString of New England public radio is funded by the un clinical support options providing behavioral health programs to families that individuals throughout western Massachusetts C. S. O. N. dot org [noise]\n\n\n\n\n... called ... performing that music by French\nStreaming of New England public radio is funded by you and they passed university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nA collection of ten sweets for cheaper on simple [noise]\n\nString the New England public radio was funded by un clinical support option flooding the ... year old health programs to families that did vigils throughout western Massachusetts C. S. O. N. dot org\n\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional and education business health sciences psychology hey I see ... [noise]\n\n[noise]\n\n\n\nNope you read instrument performance there the highly orchestras are John Barr Brawley conducting his own arrangement of a sweet drawn from using bike and re personal\nNo fourth our final Brooks week this was the fourth of the French switch French dancers for keyboard by on Sebastian Bach performed above ... Bradley Brooks are\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\nString of New England public radio was funded by un clinical support option is providing behavioral health programs to families ... vigils throughout western Massachusetts C. S. O. N. dot org na\nNa na na\n[noise] hold from our content from New England Public radio has got to the NPR gotten\nGrad for music and one great storytelling to our\nWherever you get your python [noise]\n[noise] [noise]\nOh\n[noise]\nOh\n[noise]\n\n[noise] and there's music of Phoenix Mendel so one of his six him as as recorded by\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that N. E. P. R. dot net\n\n[noise] my pleasure to be with you Peter Van to grasp speaking and our musical journey brings us some music of Nico do pot getting any right now with music by another great nineteenth century uh\nArtist a performer who was also a composer John Field will be listening to one of his piano concerto\nPlugging the of course great violinist but he also play the guitar at a very high level and wrote a lot of music for that instrument were sort of combining the two instruments right now with what was originally composed as a solo violin ... one of the most famous solo pieces ever written but\nIt's been transcribed here for guitar appropriately it is the twenty fourth in last of the solo violin ... you know the tune it's been used so many times as the basis for variations it is in itself a set of variations on June the transcribers\nAlso the performer here Nicole the hall with ... twenty fourth so low ...\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that would roll lick for fall gee C. V. S. dot org\n\nStreaming of New England public radio is funded by ... rental architects a forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com [noise]\n[noise]\n[noise] [noise]\n\n[noise]\n\nOriginally music for sold the violin like Nico pa guinea the twenty fourth last of the ... and the transcribers there was also the performer Nicole the whole guitar\n\nVictoria ... is our violinist or we're going to listen to a set of variations by ...\nStreaming of New England public radio was funded by un June ... architects a forty year legacy of commitment to community I design celebrating the next generation of leadership vacuum riddle dot com\nYou stole the violin Caprice piece by Giovanni ... home from his opera pneumonia not uh the tunas no quarter ... and especially ... violent [noise]\n\n\n[laughter]\n[noise]\n[noise]\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene CVS dot org [noise]\nVictoria ... played the violin music is by the great violinist or the nineteenth century Nicole Panini his variations on a theme by ... called ... known me sing to\nYour mortality music Antoni of of all the wrote this flute can shirt or what has a subtitle attached to it because of its fiery ... character it's known as locked him pet study ... seat Patrick ... with the ... chamber orchestra [noise]\nWe had so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north up and get your glad rag Jonah get your tickets today at any time you're done\n[noise]\n\nStreaming of New England public radio was funded value added American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ...\n[noise]\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nIt was pretty gentle it storms go but that is called the storm at sea locked him passed on the body by Antoni up of all the Patrick ... play the flute with the ... chamber orchestra\n\nMore storm music here this is called ... pleasure on a stormy night music of rubber ... son by ... all her\nAnd [noise] [noise]\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n\nMm\n[noise] I mean when you turn on the\nLine [noise]\n\nStreaming of New England public radio is funded by you advocate that university graduate schools MS in higher education administration enrolling for October twenty second applications at bay pass dot edu [noise]\nOne of the settings of text of used to you know ... or by Robert Sean from Eighteen forty last ... pleasure on a stormy night and that was I'm Sophie fallen off her singing and banked force Barry playing the cattle\n\nAnother storm inspired piece this was a inspired just by storms but also by a concerto by composer pianist named Daniel ... of the nineteenth century who wrote a very popular concerto at the time it's rarely her do\nCalled the storm and uh he had such a great success with that that his friend and competitor had a friendly competition going on John Steele decided to write his own that storm concerto he called this last Sunday ... or the conflagration caused by lightening from the storm\n\n\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling fall Gees easy yes dot org\n\n\n[noise]\n[noise]\n\nNo no\nNo\n\n\n\n\nNo no\n\nStreaming of New England public radio was funded by you in June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com oh\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nWe had so much about last year with doing it again and then we can public radio second annual ... just be Nineteen twenties holiday party Saturday December first at the hotel north to get you ready to get your tickets today at ... dot\nCom or\nYou can now\n\n\n\n[noise]\nOh\nUm [noise]\n\n\n[noise]\n\nMm [noise]\n\n\n\n[noise] hey for more content from New England Public radio ... NPR dot net\nGrant from music yeah great storytelling to our\nWherever you get your podcasts\nAnd\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\n\nAnd they were getting cut as John O'Connor at that time with music by Beethoven from his recordings of all of the package tells our ... from the opus won Nineteen set\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst stand at N. E. P. R. dot net\nHope you'll stay with me on Peter Randy Graf and we're going to listen to some musical box orchestrated by a composer orchestrated was one of the greatest music history he learned from the best as well he's studied with Nicole I rent ski course took off his name is ... ... we also have music by ... himself but\nHere's ... orchestrate shutting off the corrupt previewed based on the famous ... oh sleepers awake by boss and this is the Seattle Symphony conducted by Gerard Schwartz [noise]\n\nWe had so much about last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel Northampton you're glad rags on get your tickets today at any T. R. dot net\n\nWe had so much about last year we're doing it again New England public radio second annual jazz be Nineteen twenties holiday party on Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at any T. R. dot net\n\nOne of several ... of the music of box made by auto will be no risk ... we're going to get to another one in just a few minutes that of course is based on the boss at out sleepers awake\nAnd the performance was by the Seattle Symphony conducted by Gerard shorts\n\nAmong the works we'll be hearing ahead Beethoven's very first Seattle suddenly and right now this music by auto Reno ... which isn't really work appeals he originally compose this for trouble when cattle but he was such a great orchestrate or not we're going to hear it in ... it's called a ...\nAnd a recording by the fill harmonious orchestra conductor here is Jeffrey Simon Alexander ...\n[noise] hey for more content from New England Public radio just go to NPR dot net\nGrab for music news and great storytelling at our\nWherever you get your podcasts\n[noise]\n\n\n\n\nMm na\n\n\n\n\nHate her more content from New England Public radio go to NPR dot net slash paquette ripe for music yeah a great story on our website or wherever you get your clock yeah\n\nThe cellist was Alexander Bailey with the shelter ammonia orchestra conducted by Jeffrey Simon music by a young all told me no risky that's called the ... variation\n[noise] we're in for a treat right now music ... boss\nI think one of his greatest compositions fantasy and few in C minor are bigger pardon ... if you can see by gr as orchestrated by ... who was one of the truly great orchestrate your music history this is the Seattle Symphony conducted by Gerard shorts uh\nStreaming up the waitlist public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now we're rolling fall gee C. V. S. dot org\n\n\n\nDreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and what not to live carbon free or one three valleys solar dot solar\n\n\nStreaming of New England public radio was funded by you and they set university graduate schools and that's in higher education that dentist ration rolling for October twenty second applications that they so dot edu yeah\nWhoa whoa\nWhoa whoa\n\n[noise] hey prefer more content from New England Public radio just go to NPR dot net\nTo grab for music news and great storytelling at our\nWherever you get your podcasts\n[noise]\n[noise]\n\n\nNa\nNa\n\n\nNa na na na\n\nNa\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic under Paris AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\nBoom boom\n\n\nNa na\n\n\nNa na na\nNa\nNa na\n\n\n\nNa\nHate for more content from New England Public radio go to any E. R. dot net slashed puck catch grab for music use a great story on our website or wherever you get your podcasts\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\nHe wrote more content from New England Public radio don't you NPR dot net slashed catch grab for music used in great story telling our website or wherever you get your podcasts\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n\n\nScreening of New England public radio was funded by you and they passed university graduate schools MS in higher education minister ration enrolling for October twenty second applications that they pass dot edu [noise]\n\n[noise]\n\n\n\n[noise] [laughter]\n[noise]\n\n[laughter]\n\n[noise]\n[noise]\n\n\nWe had so much about last year we're doing it again New England public radio second and you'll just be be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on to get your tickets today at NPR dot net\nJealousy and it was performed by the ensemble blown temple\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended in E. P. R. dot net\n[noise] my name's Peter Randy Graf and our use it comes from the opera Carmen by George beach day or first going to hear the famous album Iraq which is sung by regime crushed by joined by the Swedes for among orchestra conductor is a ... bar\n\n\nI don't want that one\n[noise] [noise] oh\n\nOh\n\n\n\n\nStreaming of New England public radio was funded by un clinical support options providing behavioral health programs to families and individuals throughout western Massachusetts C. S. O. N. dot org\n\n\nYeah\nNo no\n\n\nNo\nNo oh\n\nWhoa\n\nWhoa whoa\nWhoa\n\nWhoa whoa\n\n\nWhoa\n\nWe had so much bought last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north happen gig you're glad rag Jonah get your tickets today at any P. R. dot net\nYou know\n\n\n\n\nNo\n\n\n\nNo no [laughter]\n\nYou know the best of melodies and all of the opera world the open air up from bee Jay's comment on that a ... he's going to crop up in our next a excerpt from comment as well that was a regime crushed by the conductor was allowed to do a bar with us from an orchestra and chorus\n\nBut we're all going to listen to some of film score music by some great composers of traditional classical music but right now we have this week number two from these days Carmen with the Montreal symphony and showed you'd walk\n\n\n[noise]\nStreaming of New England public radio is funded by un they that university graduate schools and bass and applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you and they got the university graduate schools and asked applied laboratory science that operation rolling no for August twenty seven applications that they passed dot edu [noise]\n\n\n\n\n\n\nStreaming of New England public radio is made possible by you know by the keys garage in Williamsburg offering foreign and domestic under pairs yes these are defined technicians Massachusetts state inspections she keeps garage dot com\n[noise]\n\n\n\n\n\n[noise]\nHe wrote more content from New England Public radio go to any E. R. dot net last cat ripe for music yeah it's a great story on our website or wherever you get your capital\n\n\n\n\nString of New England public radio is funded by un clinical and support options providing behavioral health programs to families and individuals throughout western Massachusetts C. S. O. N. dot org [noise]\n\n\nNa\nNa\nNa na\nNa na\nNa\n[noise]\nReached we'd have excerpts from the Nineteen forty by Alfred Hitchcock film called Spellbound or which ... Roche I wrote the music that was Cincinnati pops conducted by Eric ...\nHere's another prominent composer in the classical world writing a film score\nAnd this was Malcolm Arnold no Nineteen sixty one will be called were sold down the whim story three children living on a remote blanket your farm\nFind a stranger in the barn and they think is Jesus but it was really good criminal on the run from the police there was a sweet from were sold down the win for my team sixty ... London symphony conducted\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting on the bench basis from board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by us Cuban riddle architects of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dog call\n\n[noise] [noise] [laughter]\n\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students that were rolling fall gee C. V. S. dot org\n\n\n\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with Avi equipment and again house catering hotel north Hampton dot com [noise]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\nEvery ... gold about Thirteen Years old when he wrote that song I've been to lunch ... evening landscape ... was the baritone cops on the pianist\n\nStreaming up New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S.\nDot or the public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\n... extra one is great film scores for just a few minutes hearing a couple of items from the get fly with the Korean broadcasting system symphony orchestra ... on your ... is the conductor\nUh\n[noise]\n[noise]\nUh uh\n\n\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com oh\n\n\nA\nA\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with Avi equipment and inhouse catering hotel Northampton dot com [noise]\n\n\nNineteen fifty five music by Dmitri shocked to cobra true throughout his career road a lot of still music that's from one of his greatest scores called the gab fly the key BS symphony led by Boston your Donnie ... and a couple of extra ...\n\nWe should be you know by composer whose name sounds very French is George ... he was actually born in Moscow\nTo parents of French descent who was born in Eighteen sixty one encouraged by Tchaikovsky and tonight yeah if you studied with ...\nAnd we're going to listen to a Nineteen oh six composition by George ... which is his violin Saddam had number two which sometimes ... ... ... it's not a traditional ... said one through composed movement almost or more of a fantasy up\nHere are heavy chalk violin and burnt chalk two brothers and parents plays the piano [noise]\n\nUh\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot E. D. U.\nS.\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org [noise]\n\n\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by you and they have university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n[noise]\n\nStreaming of New England public radio was funded by June ... architect or to your legacy of combat but to community does not celebrating the next generation of leadership vacuum riddle dot com [noise]\n\n\n\n\n\n\n[noise] hey for more content from New England Public radio strategy NPR dot net\nGrab some music news and great storytelling to our\nWherever you get your podcasts\n\n\n\n\n\n\n\nConsidering the year of composition of that work it's a very forward looking composition Nineteen oh six\n... bar sounds good French composer but actually a Russian composer of French ... wrote that violin so not a number to something called the poem and heavy and parents talk two brothers performed\nCut you are a a contemporary of our next composer just four years older than Alexander guns would often when you're a little seven eight for workers strip like lots of what the Romanian state orchestra directed by forty ... school\n\nStreaming of New England public radio is funded by un they that university graduate schools and asks and applied data science enrolling for October twenty second applications that they pass dot E. D. [noise]\n\nString of New England public radio was funded by un clinical support option providing the federal health programs to families that individuals throughout western Massachusetts C. S. O. N. dot org [noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench bassist Ron board room to room with a the equipment and the good house catering hotel north Hampton dot com [noise]\n\n\n\n\nStreaming of New England public radio was funded by June ... architects forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com [noise]\nWe had so much fun last year we're doing it again in the window and public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood rags zone to get your tickets today any tiara done\n\nStreaming of New England public radio was funded by you advocate that university graduate schools and asked in higher education administration enrolling for October twenty second applications that they pass dot edu\n[noise]\n[noise]\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended in E. P. R. dot net\nUniversity graduate like to introduce you to some chick composers you may not have heard these men's music before\nYeah we'll listen to something like ... you'll see me leave a check something right now by a people of divorce shock named ... and we will hear his boss traced oil different pool philharmonic conducted by ... ...\nString of New England public radio is funded by un clinical and support options providing behavioral health programs to families and individuals throughout western Massachusetts C. S. O. N. dot org [noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\nThe false traced this had walked by check composure primarily lighter music all scar ... ball and the people of divorce shock where Liverpool philharmonic they're conducted by ... ...\n[noise]\nI've usually by some chicken posters I think are very worst hearing we're getting to know the main work is going to be a quintet by sitting next to the beach we\nHave first this piece from Mozart's tying so my\nHate or more content New England public radio go to any E. R. dot net last cat rapper music yeah a great story telling our website or wherever you get your money I\nMean both ... in his day this is the ... chamber orchestra without conductor and a ... in the bike mislead the check\n\n\n\n[noise]\nScreaming of New England public radio was funded by you and they sat university graduate schools MS and higher education administration enrolling for October twenty second applications that they pass dot edu\n\nBrutal performing music by ... Marcia and I'm Dante for class are Monica\n\nAnother check composers that you might not be familiar with but I think is right we're getting to know\nA nice round dates to ... to the beach is his name he was born in Eighteen fifty died in Nineteen hundred so contemporary oh but I'm Janine divorce shocked but unlike divorce shock and smashed enough for that matter CBP mostly look towards Germany as opposed to nationalism for his inspiration [noise]\nThis is a quintet for an unusual a combination of instruments by Phoebe violin clarinet horn cello and piano\nAnd we listened to the ensemble did not ...\n[noise]\n[noise]\n\nStreaming up New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and wind up to live carbon free or one three valleys solar dot solar\nMm\nMm\n\nMm [noise]\nMm [noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\nStreaming up the waitlist public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\nMm\n[noise]\n\n\n\n\n\n[noise]\n\n\nKnow [noise]\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied science enrolling for October twenty second applications that they pass dot E. D.\n\n\n...\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n\nMm\n[noise]\n\n\n\nMm [noise]\n[noise]\nScreaming at the ... public radio was funded by cute little architect of the year legacy of combat community does not celebrating the next generation of leadership cute red dot com\n\n\n[noise]\n\n[noise]\nWe had so much about last year we're doing it again New England public radio second annual Janice Bebe Nineteen twenties holiday party Saturday December first at the hotel Northampton you're glad rags on and get your tickets today at any T. R. dot net\n\n\n\nBang bang but a\n\n\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications at bay paths dot edu\n[noise]\n\nAnd\nAre a different\nUh\n\n\n\nUh\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications that they pass dot edu\n[noise] [noise]\n\nMm\n\n\n\n\nDo them in a\nMm\nA\n\nStreaming of New England public radio is funded by un they pass university graduate schools and bass and applied data science enrolling for October twenty second applications that base paths dot edu\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n[noise]", "year": "2018", "show_name": "Beethoven Satellite Network", "city": "Amherst", "day": "31"}