{"month": "10", "state": "MA", "station": "WFCR", "content": "As the pace of news quickens MORNING EDITION move faster service in the Senate will conclude at the end of march her in early jazz a story gets more complex we step back and be break it down the grand jury indictment accuses them of working on bass and when you need a break we take a breath dog stars\nIn a new version of the joke was wild calibrated to be ready for your day wake up to MORNING EDITION tomorrow\nListening to MORNING EDITION from five to nine weekdays a New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ... N. E. P. R. dot net\n\n... ... more than eleven hundred lenders joined the NPR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\n...\n\n... and the thing Mr ... by Sean review door\n[noise]\n[laughter]\n\n[noise]\nNa\nNa\n\nNa\nNa\nNa\n\n\n\n\nScreening of New England public radio was funded by you and said that university graduate schools and asked in higher education administration rolling for October twenty second applications that they know dot edu Mm\n\n\n\n\n\n\n[noise]\n\n\nMm\nMm Mm\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts student now enrolling for fall genes CVS dot org [noise]\n\n\n\n\n\n\n\n\n\n\n\n\nEat our big playing the organ at St George's church in New York City that music comes from the fifth Oregon Symphony by Sean already be door including took caught up\nWith Peter Van Dyk rough year were some music by ball and then ... and we have something from a ballet called law she just feed them\nThe boss which we are now is eight to call her and few in the minor going to hear what you end up reforms conducted by Leah ... who made this transcription of what was originally an organ work that'd be the check so harmonic\n[noise]\n\n\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\n\n\n\n[noise]\n\nNa\nStreaming of New England public radio was funded by ... architects oh forty year legacy of combat but to community design celebrating the next generation of leadership cute little dog call\nMm\nNah\n\nNah\n\n[noise]\nRefer\n\n\n\n\nMm\n\nA\n\n... ... more than ... eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website at NPR dot net ... thank you very much\n\nNa na\n\n\nNa\nNa\nNa\nNa\nMore than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\nMm [noise]\n\n\nThe grill or quartet performed at like music like Mozart she was a dog Joe and fuel in C minor case five forty six\nWe heard the Dakota in ... prior to that now we're going to combine the two cultures as for some\nA house based music making Mozart arranged some ... future boss will temper clip your book too when he was one of the few ... has performed by Santa has\nMm\n\n\nMhm mhm\n\nStreaming of New England public radio is funded by un bay paths university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n\nArrange for string quartet originally by Mozart and that was a first of all a few from box will temper clip your book too we heard to a few ... flat played there on by ... by fantastic\n\nFor our next music we'd go to early nineteenth century Denmark and listen to some music by a composer named Herman roofing shown\nA he was actually born in Norway live from Eighteen Fifteen to Eighteen Seventy\nNot well known but this is really the peace for which he is known and it is a known in Denmark first and foremost we're going to listen to all of that to a ballet called ... feet to not to be confused by the way with the ... range from ... to ... to feed them\nWhat is a shoe feed while it is a a a according to the the uh\nThe argument here the synopsis of the plot a female creature a tired in every robes with transparent wings music by driven shoulders performed by the Danish radio ... and ... ... is the conductor\n[noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online eight to twelve school personalizing education for Massachusetts student now would rolling for fall gene C. V. S. dot org\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\n[noise] mhm\nMhm mhm\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene CVS dot org [noise]\n\n\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench basis from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com [noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with Avi equipment and inhouse catering hotel north Hampton dot com\n\nVillage wedding from the ballet ... by ... marked in West directed to San Francisco ballet orchestra\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst end at N. E. P. R. dot net\n\nJust being around a graph would you not only were ... and ... good friends they were roommates for a time as well\nAnd before we get to ... arrangements of the night on bald mountain bike ... music by ... himself one of his best known pieces although it's actually just an excerpt from a larger composition risky course called spent much of his career writing\nOperas and I have to say some of the greatest Russian operas ever written elder rarely performed outside of Russia this is the famous procession of the nobles from the opera nonstop and the ... is conducted here ...\n[noise]\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and the house catering hotel Northampton dot com\n\n\n\n\nAnd the original version of back there was a chorus singing along it's a real tree kind of hooked up extra from an opera called ... by Nikolai ... famous procession of the nobles fill our money on ... angel on real CIA\n\nWe get to the ... first violin concerto here's a very famous piece by ... called a night on bald mountain\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall genes CVS dot org\nCalled here that we had this is the most often heard range but there is an original version which is quite a bit different from that but uh this is a performance by Ken ... and the Montreal symphony orchestra\n[noise]\n\n[noise]\n\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\n... new book when you put up a little boy\nWell\nYou know we need for me\nTo scramble around Los\nAngeles we use what's called for me a little bit of a\nMan\nNamed\n...\n... ... to ... or\n... years for the rest of the world for me to look a little bit\n\nOf a\nVehicle [noise]\nThis is the last one\nThis\nIs\nThe um [noise]\nOh they say about you know for the tenor outer started consent to needy the pianist that's a song by ... from the song cycle in spring cooling free grant is like Garland\n\nNow which came out in twenty Seventeen with French\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy S. dot org\n... we're going to listen to music by ... written at the very high to his career Eighteen Seventeen Eighteen Eighteen it's interesting and telling that he never published this piece I don't think he wanted the competition of other great violinist of the day performing but it was and remains one of his best loved compositions violin concerto number one\nBy ... ...\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and the house catering hotel north Hampton dot com\nStreaming of New England public radio is funded by you and they passed the university graduate schools and asset applied laboratory science at operations enrolling now for August twenty seven applications that they passed dot edu [noise]\n\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\nMm\n\n\nMm\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu Mm\n\n\n\n\n\n\nStreaming of New England public radio was funded by you and they passed the university graduate schools MS and applied laboratory science at operations on rolling now for August twenty seven applications that they passed dot edu\n[noise]\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see ... [noise]\n\n[noise]\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gene C. V. S. dot org\n[noise]\n\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com [noise]\n[noise]\nThe sixteenth shoulder violin ... arranged by ...\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that and E. P. R. dot net\nIt's just been trying to grab your companion and host and we're going to listen in just a few minutes to a a suite of symphonic poems by auto Reno ... called the ... or church windows\nThat we get in the mood for that by hearing some music for the church and it's by a man who's been called the greatest composer of the renaissance one of the great composers of all time high certain to concur with that his name is ... D pray\nAnd we listened to a little piece of his called Avi Christie he'll Christ sacrificed on the altar of the cross victim for our salvation grant us to be redeemed by your bitter death performance by voices of ascension under the direction of Dennis keen [laughter]\n\n\n\n[noise]\n\n[noise]\nOh [noise]\n\n[noise]\n[noise]\nMore than ... eleven hundred listeners joined the NPR family last week thank you so very much if you can get a chance to step up you can join any time by making a contribution at our website any P. R. dot net thank you very much\n[noise]\n[noise]\n\n[noise]\nOh\nYou're\nA\n\n\n\n\n\n\n\nMan or a\n...\n\nA a oh\nJeez\n[noise]\n\n[noise] Mm [noise]\nMore than ... eleven hundred listeners joined the any PR family last week thank you so very much if you can get a chance to step up you can join any time by making a contribution at our website any P. R. dot net thank you very much\n[noise]\nUh ... [noise]\n\n\nWhere they are\nUh\n\n\n[noise] oh\nNo [noise] no no no no [noise]\n\nUh uh uh uh uh\nOr or [noise]\n[noise]\n[noise] [noise]\nThey acquire called voices of ascension conducted by Dennis keen and music by just got the prey of the Flemish renaissance his anthem or mode tapped I'll be Christie tail Christ\n\nHow into early music was October ... well he and his wife on their honeymoon to research into ... and this is a guardian transpired piece by a lot to Reno speaking it's called church windows and there's four different\nWindows depicted your music like the flight into Egypt saint Michel the ... the ... of St Clair in St Gregory the great excuse was topic ... embassies\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n\nMm\n\nStreaming of New England public radio was funded by you and they got the university graduate schools and asked and applied laboratory science that operation that rolling now for August twenty seven applications that they pass dot edu\n\n\n\n\n\n\nStreaming of New England public radio was funded by un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n\n\n\n\n\n[noise]\nStreaming of New England public radio is made possible by you know my seat keys garage in Williamsburg offering foreign and domestic under Paris and he asked each certifying technicians and Massachusetts state inspections see keys garage dot com\n\n\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot E. D. na\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n[noise]\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net ... thank you very much\n\nStreaming of New England public radio is funded by you know the hotel Northampton offering six meeting at the vet spaces for a board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\n\nYou wants to Boston Boston pose that as a violin sonata in a minor for just ... ... ... ... took that music and arranged for full string orchestras and violin as we heard there you'll get told he played the ...\nStreaming of New England public radio is funded by un day path university graduate schools and I say in creative non fiction writer enrolling now for August twenty seventh applications that they pass dot edu [noise]\nThere was a great violinist Johan ... piece in del was employed mostly in the area of Dresden who came by to visit box at one point the two became friends and peace and bills playing which was the highest level are reportedly greatly influenced the music of box from that point forward including his solo\nViolin or Saddam isn't partied us well peace and bill went down to Venice to study with the faulty and diversity was greatly impressed by piecing del as well and wrote some music for him to play including\nThis so not that we're going to hear right now in fact it's subtitled\nWritten for Mr peas and they'll listen to a performance of his music by a few members of a group called ... with special recognition given to the violinist here Adrian Chandler\n\nNa na na na na\nNa na\nNa\n[laughter]\n\nMore than ... eleven hundred listeners joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\nFew from will temper cliff your book one of ... recorded by Ken is Keith Jarrett\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst ended in E. P. R. dot net\nGood to have your company Peter Van to graph here with music by a couple of great violinist who were also composers in fact the first person\nWrote a collection of six ... studies reviled in which were dedicated to other great violinist and the nineteenth century this man's name is ... ville helm parents\nAnd before we listen to a work dedicated to own review tall and the concerto by your tone with your life it's by the way we have this study which is a performed by rude general reaching music of arched [noise]\n\nStreaming of New England public radio was founded by you add American International college offering low residency graduate programs for the working professional in education business health sciences now psychology hey I see ...\n\n\n\n... ... more than ... eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n[noise]\n\n\n\n\n\n[noise]\n[noise] ... and ... the composer of that ... study for the Maya Lin which he dedicated to Nineteen century a violinist composer fair to mount nope Elly Yu be\n\nReviewed taught one of the greatest violinist all the nineteenth century wrote a fair amount of music for his instrument including a number of ... which are his most highly regarded compositions\nAnd we have this Nineteen thirty five recording right now with the national Heifetz wild in London philharmonic Sir John Barbara lead the conductor this is the violin concerto number four by the Belgian violinist composer on ... view tall\n[laughter]\n\nStreaming of New England public radio is funded by you had the hotel north now offering six meeting at the ... board room to room with a the equipment that house catering hotel north south on dot com\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise] and\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nOr\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nScreaming of New England public radio was funded by you advocate that university graduate schools MS and higher education administration enrolling for October twenty second applications that they pass dot edu\n\nAnd I'm\nI'm\nNa na\nNa na na na na na na [laughter]\nAnd\nI'm Linda [noise]\nUm [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\nStreaming of New England public radio is funded by un they path university graduate schools MS and applied data science enrolling for October twenty second applications at bay path dot E. D.\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website an E. P. R. dot net ... thank you very much\n[noise] [noise]\n\nStreaming of New England public radio was funded by ... ... ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com\n[noise] ooh\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu [noise]\n\n\n\nOoh\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do now with rolling for fall gene C. V. S. dot org ...\n\n\nDo you do for\nA\nPerson [noise]\n[noise]\n[noise]\n\n[noise]\n\nWhich is our guest is Charles ... wrote that song setting a gr text injured Thomas temps in an urban ... let me up with the wonder Sunday night\n\n... ... more than ... eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\nWe wouldn't public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that N. E. P. R. dot net\nPeter ready to graduate you before we get too reminiscent says based on themes from the ... which is generally regarded as the master piece of being ... she'll be the first the overture to the opera with the philharmonic orchestra to New York shut off being the conductor\n[noise]\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot E. D.\n\nMore than eleven hundred listeners joined the any PR family last week thank you so very much if you can get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n\n\nPerformance what the filter ammonia orchestra under the direction of to deal shut off gene that's music by the ... the overture to his opera Norma\n\nUsually conspired by themes from ... operas we're going to hear some music from last show numbers out this sleep walk or bike building but to write down these reminiscent says of ...\nAfter ... written in Eighteen forty one and one of the many uh operatic fantasy using paraphrased as the ... the chemistry was Leslie Howard\n\n\n\nStreaming of New England public radio was funded by you and they tell you a ... graduate schools and I say a creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu mhm\n\n... ...\n\n\n[noise] and\nStreaming New England public radio was funded by us cute little are such a ... year legacy of combat to community does not celebrating the next generation of leadership cute little dog call ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu Mm\n\nHero\n\n\nLot of notes Jeanette ... spy fronts lift reminiscent\nOf nor by referring to ... generally regarded to be his masterpiece and one of the many a rapid distances transcription pure freezes fantasies called the different things different types may buy list of Brazil today Leslie Howard was the pianist from his\nSuperhuman a series of recordings of every piano piece written by ... what Ninety eight Ninety nine CDs on the periodic table\nStreaming of New England public radio was funded by ... rental architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nAnd so many fronts Doppler was one of the great ... of his day wrote this paraphrased based on themes from another ... ... last show numbers on the sleep Walker jumpy on Paul and Cody already money you know the two flu this John Steele return the pianist\n[laughter]\n\n\n\n\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional education business health sciences psychology a I. C. dot edu [noise]\n\n\n\n\n\n\n[laughter]\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n... ... more than eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n[noise]\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science at operations enrolling now for August twenty seven applications that they passed dot edu\n\n\nStreaming of New England public radio was funded by ... riddle architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com [noise]\n[noise]\n\n\nStreaming of New England public radio is funded by un they pass university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n[noise]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org [noise]\n\nAbused ... wrote that eight to ... the third of a collection of twelve clay Rudy performed\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\nOr focus will be on Lewis Carroll's Alice his adventures in wonderland and we have a couple of pieces here to begin with the introduction to a sweet for cattle ... the composer Edgar Stillman Kelly coldest she reads a pen to mine pick church\nAfter Alice in wonderland Brian ...\n[noise]\nNo no\n\n\n\nUm\n\n[noise]\n\n\nNah\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nMm\nUh\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at the vet spaces from boardroom to ball rolled with Avi equipment and getting house catering hotel north Hampton dot com and\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\nBut I Do not\n\n\nTo put a music by the American composer Edgar Stillman Kelly that's from his sweet ... candle or as he called it a series of tend to my pictures Alice in wonderland after Lewis Carroll\nThe introduction to the sweet just what we heard with Brian ... we're going to hear more inspired by a Lewis Carroll\n\nIs a true pleasure to be with you particularly because I'm going to share with your piece that I think you'll enjoy it by ... of a man who was famous as a music critic maybe best known as a commentary critic\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one three valleys solar dot seller\nBecause he was the narrator of the original Disney's fantasia and in Nineteen Seventeen he wrote a piece inspired by Lewis Carroll's through the looking glass and what Alex fountains there Alice in wonderland stories\nAnd it's called through the looking glass has five ... dedication the garden of live flowers jab or walking looking glass insects and the white Knight here's the Seattle Symphony conducted by Gerard short\n\n\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic all the repairs and he asked each certified technician Massachusetts state inspections she keeps garage dot com\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the bench basis for a board room to ballroom with Avi equipment and the house catering hotel north Hampton dot com [noise]\n\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] uh\n\n\n\nMore than ... eleven hundred lifters joined the any PR family last week thank you so very much if you didn't get a chance to step up you can join anytime by making a contribution at our website any P. R. dot net thank you very much\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu\n[noise]\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with Avi equipment and the house catering hotel north Hampton dot com [noise]\n\n\n\n\n\nStreaming of New England public radio was funded by un June ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com um\nUh uh uh [noise]\n... Lewis Carroll performance by Greg Smith singers and that's called beautiful soup from Alice in wonderland\n\nLet's go to some box now as we listen to a melatonin Tom and Gerald rank performed the third son ... [noise]\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public on line to twelve school personalizing education for Massachusetts do not want rolling for fall gene CVS dot org [noise]\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for full gene CVS dot org [noise]\n\n\n\n[noise]\n", "year": "2018", "show_name": "Beethoven Satellite Network", "city": "Amherst", "day": "08"}