{"month": "10", "state": "MA", "station": "WFCR", "content": "As the pace of news quickens MORNING EDITION moves faster than my service in the Senate will conclude at the end of march or in early jazz a story gets more complex we step back and we break it down the grand jury indictment accuses them of working on bass and when you need a break we take a\nBreath of stars version of the joke was wild\nCalibrated be ready for your day wake up to MORNING EDITION tomorrow\nListening to MORNING EDITION from five to nine weekdays a New England public radio WFCR in Amherst Springfield Hartford in partnership with UMass Amherst ... N. E. P. R. dot net\nMm Mm\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nThe\nMountains and inspired music we begin with six Norwegian mountain melodies by inviting Greek they buy in our ... very\n[noise]\n[laughter] [laughter]\n\n\n\n\n\n\n\n\n\nNa na na\n\nNa\n...\n[noise]\n\nScreaming at the ... public radio was funded by June ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n[noise]\n\n\n\nMm [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by you add the hotel Northampton offering six meeting at events basis from boardroom to ballroom with Avi equipment and again house catering hotel north Hampton dot com\n[noise]\n[noise]\n[laughter] [laughter]\n\n\n[laughter]\n[laughter]\n\nCollection of six Norwegian mountain melodies by advised greed has recorded by enough ... Barry\n\n... to keep you company we have a couple of symphonies here including votes aren't a gene minor number forty\nBut first we have dish symphony by Alan whole varnish American composer it's called the mysterious mountain symphony ... says I named it for that mysterious feeding the one hand is in the mountains not for any special mountain but for the whole idea of mountain\nSo this could be about any mountain that one block so choose your mountain and enjoy this work the American composers orchestra conducted by Dennis Russell DVDs\n[noise]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\n\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the basis for a board room to ballroom with Avi equipment and the house catering hotel north Hampton dot com [noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n\n\n\nDreaming of New England public radio was funded by you and cute little architect oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n\n\nThat'd be speeding from Nineteen fifty five [noise] and it's by the American Ellen ... he was many many like he wrote a fifty five of them that's known as the ... mountain symphony and Dennis Ross will be be conducted the American composers orchestra\nComposer says not about any particular melted but\nFor the idea of mountains social not about a particular mountains called the mountain mood like Arnold Beck's Eric park and the\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and they asked in higher education that dentist ration at rolling for October twenty second applications that they pass dot edu [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\nSo here's the too many years offering a special treat filled the tickets for our agenda for the call buddy hurting joined us for an evening advancing to ... taught sex\nSipping some bubbly our car in the speech he killed on a Saturday December first few clients what that really very discount before Wednesday October Seventeen\nGrab your tickets no any PR yup [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\nSo here's they get to any New York is offering a special treat failed the tickets for our Janice baby already party on Saturday December first grab your tickets now it's any PR net [noise]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\n[noise]\n\nHere's NPR's offering a special treat filled the origins baby already hurting on Saturday December first grab your tickets now let's see oh no no [noise]\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that were rolling fall gee CVS dot org and\n\nSo here's they get any PR is offering a special treat failed the tickets for our Janice baby oh buddy party joined us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in speaking at the hotel north happened on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets now at any PR\nStreaming New England public radio was funded by you and valleys solar a local company install like roof ground amounts and do all access trackers helping households live carbon free and the four one three valley solar dot solar\n\nThat was Leroy Anderson's music conducted by Frederick Fidel played by the east in Rochester pops orchestra and that of course is the typewriter\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\n\nTchaikovsky is the composer here's lists transcription of the pull the news from Eugene Oregon\n\nStreaming New England public radio was funded by June ... architect of the year legacy of combat but to community that does not celebrating the next generation of leadership vacuum red dot com\n[noise] [laughter]\n[noise] Mm\n\nStreaming New England public radio was funded by us cute little architect of the year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise]\n[noise]\n\n\n\n\nLeslie Howard was at the piano performing that music originally by a chick ... from his upper Eugene ... famous pulled them as but that transcription forget it was made by great yeah that's the ... list\n[noise]\nHave some ... to hear the first one is the ... or ... written an Eighteen eighty\nSo here's they get to any PR is offering a special treat he'll be a long time for our Janice baby already hurting join us for an evening advancing ... taught sex\nSipping some bubbly our side car in speaking at the hotel north happened on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets now at any PR nah\n\n\n[noise]\nMm\n\n\nStreaming of New England public radio was funded by you add American International college offering lower residency graduate programs for the working professional education business health sciences psychology hey I see the [noise]\n\n\n\nSo here's we get to any PR is offering a special treat failed the along tickets for our Janice baby oh buddy party on Saturday December first grab your tickets now at NPR but I Know [noise]\n[noise]\n... conducting the bird than philharmonic there in that famous work by Tchaikovsky called the ... ... ...\nWell let's hear some ... ... ... says no this is one by a composer up the seventeenth century named Francesco quarterback and this and to seek a priest is played by but real carpets Andrew Lawrence king ...\nNo\n\n... no\nStreaming of New England public radio is funded by you when they pass university graduate schools and asset applied data science enrolling for October twenty second applications that base paths dot E. D. ...\n\n\nNa\nStreaming of New England public radio was funded by un June riddle architects of forty year legacy of commitment to community a design celebrating the next generation of leadership at ... riddle dot com\n[noise] in music by Francesco quarterback or of seventeenth century Italy that is the fantasy Caprice in the form of a shock come shock on being a variations form\nIn cripple meter where the baseline repeats over and over and different things are played over that baseline\nHere's another ... very famously Nicole ... composed twenty four ... says let's listen now to the number Nineteen in a recording with James Amish\n[noise]\n[noise]\n[noise]\nStreaming of New England public radio is funded by un bay path university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu [noise]\n\nSo here's the many years offering a special piece failed the origins the whole buddy party on Saturday December first grab your tickets now at any PR no no\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the\n\n\nSo here's a tip any PR is offering a special treat failed the tickets for our Gen is being the whole buddy party join us for an evening advancing helpful taught sex\nAnd sipping some bubbly are aside card in speaking at the hotel not happen on Saturday December first few clients with that early bird discount before Wednesday October seventeenth\nGrab your tickets no at any PR [noise]\n\n\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot E. D. [noise]\n\n[noise]\n\n\nUm\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\n\nTune which was very popular and seventeenth century England called ... we don't know who wrote it that performer there though was Andreas Marty\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst stand at N. E. P. R. dot net\nOne\nRarely gets the opportunity to hear divorce shock symphony number four you're going to have that opportunity in just a few minutes but first the music by\nAnd Elizabethan English composer who specialized in writing for and performing on the luge his name was John Donvan this is played on the guitar and it is a center city\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] Mm\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing and rolling now for August twenty seven applications that they pass dot edu\n\n\n\n[noise]\n\nNa\n\nNa da\nDa\nDa\nDa da\nDa\nDa\nDa da da da da da da\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee C. V. S. dot org [noise]\n\n\n\nI think it's not hard to imagine that performed on those loot but in this transcription each ... play the guitar\nThe music was by a great Elizabethan Luke ... composer John Donvan his name and that is a fantasy\nFirst up a couple of pieces by John Donvan we're going to hear and then we have the opportunity of hearing one of the early symphonies of ... piece which was so little known that for quite a while it was not even one of the number symphonies spiked shock\n\nPerforming on the her now is Andrew Lawrence king and specifically performing on a baroque music which was composed for the mood by John Dowd limits called farewell\n\nSo here's a tip NPR's offering a special treat failed the tickets for our Janice baby oh buddy already joined us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in the hotel dog ... on Saturday December first have a few claims that early bird discount before Wednesday October Seventeen\nGrab your tickets no any PR yeah\nMm\nSo Here's NPR's offering a special treat failed the tickets for our Janice oh buddy already on Saturday December first grab your tickets no it's the oh no no\nGrow\n\n\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling purple Gees easy yes dot org\nWell\nOr\n\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call [noise]\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the [noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu [noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot E. D.\n\n\n\nL.\nAnd\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n[noise] [noise]\n\nWell [noise]\n\n\n\n\n\nSo here's they get any PR is offering a special treat failed the chicken or Janice baby oh buddy party on Saturday December first grab your tickets now at any PR no no\n\nSo here's they get any PR is offering a special piece he'll be a long time for our Janice baby oh buddy party going us run either go dancing to help folks taught sex\nIt's sipping some bubbly our side car in speaking at the hotel not happen on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets no any PR\n[noise]\nNon ... blood on on the phone and\nStreaming ... public radio is funded by you had killed rental architects a forty year legacy of combat but to community had designed celebrating the next generation of leadership at ... dot com\nBrian Reader cook seen that one of the biblical songs by divorce talk with a Scottish national orchestra and the name of ...\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst end at N. E. P. R. dot net\n\n... just a few minutes we'll listen to a heart concerto by Carl deters ... a friend of heightened and Mozart first this for ... by Alan ... played by ... [noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\nStreaming up to ... public radio was funded by you add Greenfield commonwealth virtual school public odd like K. to twelve school personalized education for Massachusetts do that with rolling fall G. E. C. V. S. dot org\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\n\n\n\n\n\n\nMusic by the Armenian American composer Alan ... von is born in Massachusetts but long based in the Pacific northwest that was his knock turn for solo Harpo pest twenty number one you'll ... recorded that part of ... people called sky music\n\nWhich will be secure by a man who was a good friend of heightened and Mozart his name was Carl ... one of the great names and music history\nHe was born seven years after heightened and died in the Seventeen Ninety nine this is probably his best known work at the heart concerto when a major we have a new north ... as the harvest and the ... chamber orchestra [noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\n\n\n\n\n\n\nSo here's they get to any PR is offering a special treat failed the tickets for our Gen is the whole buddy party joined us for an evening advancing thick helpful taught sex\nSipping some bubbly our side car in the speaking at the hotel not happen on Saturday December first few clients with an early bird discount before Wednesday October Seventeen\nGrab your tickets now at any PR man\n\n\n[noise]\n\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\nI'm In a\n\n\n\n\nThe ... was the hardest ... chamber orchestra was conducted by ... and composer was Carl differs from deters door she was ... when a major\n[noise] there's some Schubert straight ahead we have a little piece right now by the ... it is a serenade for chamber on some bull to thirty five such pieces of ... the ... chamber orchestra performs or [laughter]\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\nIn the\nI'm\n\n[noise] [noise]\n[noise]\n\n[noise]\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AES each certifying technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and wound up to live carbon free or one three valleys solar dodge solar Mm\n\nStreaming of New England public radio is funded by us they path university graduate schools and asset applied laboratory science that operation generally know for August twenty seven applications that they passed dot edu\n\n\nMhm\n[laughter]\nScreaming of New England public radio was funded by you and they sat university graduate schools and asset higher education administration enrolling for October twenty second applications that they pass dot edu\n\n[noise]\nMhm\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see the [noise]\n\n[noise]\nOh so they must\nBe what if they [noise]\n[noise]\n[noise] [noise] [noise] [noise] maybe [noise]\n\nMaybe a minute [noise]\nRestless love ... a song by ... ... ... and ... actually car\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling no for August twenty seven applications that they pass dot edu\nHere seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst ended in E. P. R. dot net\nBoy band above ... no not even his first name ... for the play by for work [noise]\nNah\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n[noise] [noise] [noise]\n... ...\nMm Mm\nStreaming of New England public radio was funded by you and cute little architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nNa na\n\n\nNa\nNa\nNa\n...\n\nYoung son both worked performing that music by composer whose last name is pick forced first name not known nor his dates the piece is called ... nobody day\n\nMozart wrote a couple of little cattle Saddam is when he was just a child but you just tell us to know the number one is a really what is best known the keyboard works can you hear that ... what's in the major commercial to Seventy nine and this is Ken is Christoph ...\n\n\n[noise]\n[noise] [noise]\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science and operations enrolling now for August twenty seven applications that they passed dot edu\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\nNot going to turn to a couple of ... which are about the famous story of Cinderella at the ball day evil stepsisters the prince the shoe cetera let's begin with this brief excerpt Cinderella is very\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\nRussian national ... you know the conductor and that is from the ballet Cinderella by surrogate for coffee of extra being there for a complete recording at the ballet from back to be heard Cinderella variations\n\nShe's so natural that say you hunch Trump junior would write ballets they're our bellies based on his music but he only wrote one fully ballet it's called Cinderella\nWrote at the very end of his life Eighteen Ninety eight music in fact we're going to listen to all of act to about ballet right now with the national philharmonic orchestra conducted by Richard Bonnie [laughter]\n\nSo here's they get too many years offering a special treat failed the chicken or our Gen is the whole buddy party going us for an evening of dancing to help folks taught sex\nIt's sipping some bubbly our side car in speaking at the hotel north happened on Saturday December first few clients with that early bird discount before Wednesday October Seventeen\nGrab your tickets no at any PR but I Know\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot edu\n\n\n[noise]\n\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall she sees the S. dot org\n\n\n\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science that operations enrolling now for August twenty seven applications that they passed dot edu [noise]\n\n\n[noise]\n\n\n\n\nDreaming of New England public radio was funded by ... riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n[noise]\nMm\nDreaming of New England public radio was funded by un cute little architect oh forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n[noise]\n\n\n[noise]\n\n\n\n[noise]\nStreaming of New England public radio was funded by un day path university graduate schools MSA in creative non fiction writing enrolling now for August twenty seventh applications at bay past dot edu [noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n[noise]\n\n\n\nSinger was a British told my sister and the ... was ... and that is music by ... from the song cycle ... mortality\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR cameras Springfield in Hartford in partnership with UMass Amherst and that and E. P. R. dot net\nPeter Randy Graf you're known it's remarkable how many operas have been based on the story of our meta and the crusader written all do with whom she falls in love\nAnd on her way to kill him she looks at him and his taken by his hands on this and falls in love with them there's operas on the subject by some eerie and just leave a check and are handled in his written all do\nHeightened real Seaney\nRudy we're going to hear excerpts from a number of these operas let's begin with I'm turning divorce rock and here's an are you from the first active he's our meta something by ... with the checks on their Monica fought stopped going on conductor\n[noise]\n\n\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by un cute little architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by you and valleys solar local ... design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise] ... soprano checks all her Monica and ... the conductor we heard that argument which comes from ... one of an opera by I'm toning divorce shock and the first of several operas from which will be accepting cold army di\n\nOverture to our meta one of the many operas inspired by hustle just telling the story of the crusader written all do who was almost killed by our media but she felt\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\nCurious the academy said mark in the field ... the conductor and does the overture to receive our meta\n[noise]\nUm\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\nThat's the overture to an opera by using heightened called our meta again telling that story of a written all do and a army does love for that crusader\nMany operas written on that subject including one by ... and we're going to now hearing aid ... from ... our meta as arranged for her to court by contemporary of beauty a\nDump the bare just played by Christophe who say\n\nDreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts do not want rolling purple Gees easy yes dot org\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now one rolling for fall gee CVS dot org [noise]\n\nHas played by Crisco who say an arranged by ... ... from the opera on meet the bike shop I teach duty\nOne more example of that extra from an opera called our need or our meta this is from Brooks opera little dance play by the Harvard symphony [noise]\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seventh applications at bay past dot edu\n[noise]\n\n\nThe Harvard symphony conducted by ... Mahler who by the wayside ... cousin that is the music from our need laughter army to operate this one by the book\n\nShortly before he died the British composer William ... was asked which was his most beautiful composition and he said to my heart concerto we're going to hear that part concerto which is actually called the ... or ... song was\nComposer says inspired by my intense love of the seventeenth century English metaphysical poets particularly Giles lecture\nAnd his from his at the polling Christ victory in triumph that this concerto was composed and Fort movements we here Rachel masters hearts city of London symphony or Richard ... conductor the ... by William ...\nStreaming up the ... public radio was funded by you add Greenfield commonwealth virtual school public odd like eight to twelve school personalizing education for Massachusetts do that with rolling fall she sees the S. dot org [noise]\n\n\n\n\n...\n\nStreaming of New England public radio was funded by the ... valley solar a local photovoltaic designed the installation company serving people lined up to live carbon free for one three valleys solar dodge solar [noise]\n\n\n\n\n\n\nStreaming of New England public radio was funded by you and valleys solar local TV designed the installation helping household secures state or federal incentives and live carbon free and the ... valley solar dot solar\n\nMm\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and asks and applied laboratory science that operation enrolling now for August twenty seven applications that they pass dot edu [noise]\n\n\nMhm\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling fall gee CVS dot org [noise]\n\n\n\n\n", "show_name": "Beethoven Satellite Network", "year": "2018", "city": "Amherst", "day": "15"}