{"month": "10", "state": "MA", "station": "WFCR", "content": "\nThat's the discount screw Huron any Europe clean stranger in paradise\nThey with Harold Land on ... children on ... Byrd Harry Allen with dating a can of paying tribute to suit Simms was group yard and we begin that shit was sweet citizen ... Davis in ... he could he is Harriet since one hundred third birth the anniversary this is new ...\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting at the vet spaces from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com\nWhich UMass Amherst than it in E. P. R. dot net next Taylor hosts tomorrow night's ... back with you on friday the two for classical music next year at ...\n... we have a symphonic pull him actually a few ... salt but the one we're going to hear in a minute it's called the Utah we first step the overture to an opera I'll bet titled by Shabaab chiefs Judy\nStreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nNo\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\n[noise] from a complete recording of the opera fight toll Fayette taught by Joe ... D the musicians or the new for performed era and the conductor was mark ...\n\nIt's just ... with a trio of symphonic poems by coming ... all of them quite short all under ten minutes long the first one is called fight 'til the adult who was the son of ...\nA God of the sun and the a ton took the hubris chariots\nOf fire out and uh was crushing to the earth but was safe from the earth was safe from a destruction by juice who struck the aton doubt and that's the story told in the symphonic point ... cells we have the royal philharmonic Christian ... is the conductor\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench basis from board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\n[noise]\n\n\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do now with rolling fall gene sees the S. dot org\nNa\n\n\n\nStreaming of New England public radio was funded by ... rental architects of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n\nFrench radio TV orchestra jumping off do you know the conductor and not just symphonic Cohen bike commute ... salt called no we don't follow it all falls spinning wheel\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic under Paris AES Easter defined technicians Massachusetts state inspections she keeps garage\nDot com one is called the ... it's inspired by point by all because of these telling the story of skeletons coming to life at night in the cemetery here is ... how to lose capital markets right\n\nMhm\nStreaming of New England public radio was funded by ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\nStreaming of New England public radio was made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AES Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n[noise]\n\n\n\nStreaming of New England public radio was funded by you add American International college offering lower residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee C. V. S. dot org [noise]\n\n\n\n\n\n\n\n\n\nNah nah\nNah\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and killing rental architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... dot com [noise]\n\n\n\n\nDo they do both will [noise]\n\nForsaken originally one of the ... ... what range by legal Shawna check and signed by capella Amsterdam\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR cameras Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\n\n... with you an Internet so is usually something that goes between something but it could also mean a short contemplative peace and we have some examples of those kinds of interventions right now beginning with this one from the oldest one Eighteen set\nUp a lead piano pieces by you Hondas bronze this is the six of the collection ... pianist [noise] [noise]\n[noise]\n[noise]\n\nStreaming of New England public radio was funded by you and they pass university graduate schools and I asked in higher education administration at rolling for October twenty second applications that they pass dot edu\n[noise]\n[noise]\n\n[noise]\n\n\n\nScreening of New England public radio was funded by you and they pass university graduate schools and bass and higher education administration at rolling for October twenty second applications that they pass dot edu [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nSome of the black music imposed by your hundred Brahms the Internet so this one Eighteen number six as recorded by ... ...\n\nSome Irish pieces here we're going to listen to some music by an Irish pianist composer who break the influence ... named John C\nStreaming of New England public radio is funded by ... rental architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com for\nClarinet in piano by St Charles billionaires Stanford as we listen to him a jumps and clarinet and milk and Mark Udall piano\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nMm [noise]\n\n[noise] [laughter] [noise] [laughter]\n[noise]\n\n\n\n\n\n[laughter]\n\nScreaming at the ... public radio was funded by ... June ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you had the hotel Northampton offering six meeting on the bench basis from board room to room with a the equipment and again house catering hotel north Hampton dot com\n\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\n[noise]\n\n\n\n\n\n[noise]\nAnd\n[noise]\n\n\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org [noise]\n\n\n\n\nBeethoven wrote and so not as for yes channel with violin a company ... that's what he called that we think it was the other way around usually but here is the fourth of those ten ... sits in a minor Beethoven's hope is twenty three [noise]\nAnd our recording is by very distinguished violinist named your shopping habits this Nineteen fifty two recording with pianist Emmanuel by\n[noise] [noise]\n\n\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com [noise]\n[noise]\n[noise]\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise]\n\n\n[noise]\n\n\nMm\n[noise]\n\n\n... [noise]\n[noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a I. C. dot edu\n\nMm\n\n[noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu [noise]\n\n\n\n\n\n\n\n\n\n\nUh\nStreaming of New England public radio was funded by ... rental architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n... Nicholas muggy given the conductor the music which comes from the belly up Britain ...\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that N. E. P. R. dot net\nWilliam ... does the flu just here we're going to listen to the doctor and end up like ... summed up by the deep gold there [noise]\n\n\n\n\nStreaming of New England public radio was funded by ... rental architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum read all dot com [noise]\n\n\n[noise]\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\n\nWilliam ... with the English chamber orchestra conducted by Stuart Bedford that's music by men was great flew to stem cells the gold bears his name not turn and ...\nBefore we get to Robert ... first piano trio we have this by American composer Walter Piston it's a sweet from ballet\nWhich is set in a sleepy village in the south than just after CBS to a circus suddenly comes to town with a parade and there is an incredible flu just who's among the performers in the circus\nAnd he meets the prettiest daughter of the local merchant had the chance or charges the air with love everyone feels its magic\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee C. V. S. dot org\nIs this week from Walter pistons the incredible flu just and the St Louis symphony has conducted by letter it's like\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org [noise]\n\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts student now would rolling for fall genes CVS dot org\n\n[laughter]\n[noise] [noise]\n\n\n\n\n\n\n[noise]\n\nSweet from the only beltway written by Walter ...\nStreaming of New England public radio is funded by you and killing riddle architects a forty year legacy of commitment to community had designed celebrating the next generation of leadership at ... riddle dot com\nNineteen thirty eight music there as it is called the incredible flu just we heard this week from the ballet with the St Louis symphony orchestra conducted by Leonard slack and\n\nHe was a fluke is named Joseph Mariano performing this miniature by William McCauley it's called ... and it is a performed that'll be by Joseph Mariano also the east in Rochester orchestra conducted by Howard Hansen [noise]\n\n\nCanadian composure William McCauley wrote that the fifth of five menu chores for food and strings each one\nWith a I'm an adjunct titled title to it that's called capricious and Joseph Mariano was joined by the eastern Rochester orchestra strings alone\nBut conducted there was Howard handsome washed up our food pieces\nTo Robert Schumann we'd go at ... his best friend at least according to ...\nStreaming of New England public radio was funded by ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nWon an Eighteenth thirty nine ... considered the greatest trio of our time and it was inspired by the beach to write his own cattle trio number one in the minority here that work right now with ... ... gentle crusty on ... and the Tonya testable trouble\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nStreaming of New England public radio was funded by un valley solar a local photovoltaic designed to the installation company serving people and plan up to live carbon free and the four one three valleys solar dodge solar\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n[noise]\n[noise]\n\n\nStreaming of New England public radio was made possible by new andme ICQ's garage in Williamsburg offering foreign and domestic under Paris AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n[noise]\n\n\n\n\n\n\nMm\n[noise]\n\n\nStreaming of New England public radio was funded by ... rental architects oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu the Grand Junction with that song by Robert Sherman lady bug\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst stand at N. E. P. R. dot net\n\nLike you've uh tuning in Peter ... is my name and we're going to listen to a couple of can sure does from the baroque era we have some ...\nAnd a excerpts from a ballet abused right now a sonata by Domenico ... Italian born but a Spanish based for most of his career and very prolific writing hearts accord that Saddam has he wrote over five hundred of them\nThis is the Kirkpatrick catalog number three hundred eighty in a major and tone cope moment is the ...\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\nOf all the hundreds of Saddam has by when you go Scott ... that has to be counted among the very best known uh Saddam ... N E Kirkpatrick three eighty and a political one performed\n[noise]\nWe're listening to a sweet from a ballet which is inspired by the life of St Francis of ...\nA ... with the need machine produced this valley in Nineteen thirty eight and a ... just come from the great churches son to crochet which has those amazing ... goes with scenes of St Francis and be\nConcocted this valley called ... we're performance by the royal philharmonic orchestra James to priest is the conductor in music by ...\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling no for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\n\n\n\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do now we're rolling fall Gees easy yes dot org [noise]\n\n\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do now with rolling fall Gees easy yes dot org\n\n\n\n\n\nThat music from Nineteen thirty eight by how in the ... weirdest wheat from the ballet ... royal philharmonic conducted by James preached\n\nHe's written just after ... obscene\nStreaming of New England public radio is funded by you and cute little architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nEasy the great Churchill ... in a in Italy and the polls are actually said it's not a ballet it's a dramatic in Korea graphic depiction of the life of St Francis tiny but more by the beach this is a little interviewed from ...\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\nPeter we live in performing under the suit with a group ... directed by Adrian Chandler that a a minor ... concerto by ... faulty\n\nHere's another concerto from the baroque we move now to Germany specifically to Dresden for this concerto by your ...\nHe wrote a lots of ensure does for several solo instrument there's a pair of foreign violin oboe food solo and orchestrate and we have but most of the ... of cologne directed by Reinhardt careful [noise]\n\n\n\n\n\n\nStreaming of New England public radio it was funded by un Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts student now enrolling for fall gee C. V. S. dot org\n\nMm\n\n\n\nMm\n[laughter]\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n\n\n\n\nOh\n[noise]\n\n\nStreaming of New England public radio was funded by ... architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... dot com [laughter]\n\n\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise] the ... with Graham Johnson at the piano newborn a song by John Ireland\nThank you for listening to our house\nStreaming of New England public radio is funded by you and they passed the university graduate schools and asked and applied laboratory science at operations enrolling now for August twenty seven applications at bay paths dot edu\nWFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and that N. E. P. R. dot net\nHope you can stay with the for music ahead it includes a sweet from the golden cocker ... door by Nikolai ... course a couple of get to that in just a few minutes\nI have to say I think one of the great tragedies in the upper world is that risky costs it costs operas outside of Russia are rarely rarely produced\nA I think they are among the greatest a ... and ... sometimes the character's not as maybe fully developed to some of the other great operas but so we're seeing and hearing always a pageant and its experienced [noise]\nWe're going to listen to this from the Koch door right now the golden cocker all it is the famous him to the sun and they'll just transcription has been made by ... Chrysler and Nigel Kennedy is the violinist John ... is the pianist [noise] Mm [noise]\n\n\n\nStreaming of New England public radio is funded by you and they have to go to ... graduate schools and bass and applied laboratory science that operation rolling now for August twenty seven applications at bay paths dot edu\n\n\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio is made possible by you and Boise keys garage in Williamsburg offering foreign and domestic on the repairs are yes these are defined technicians and Massachusetts state inspections see keys garage dot com\n\n\n\n\n\nOoh [noise]\n[noise] from\nLook door by Nikolai ... one of his great melodies among the many he was not only one of the great orchestrate there is also one of the great ... it's an old time in some of the great melodies were found in his operas that was no Joe Kennedy violin John ... it was which Chrysler who made that arrangement\n\nThis is a sweet from the ... the golden cocker all the problems of course the Scottish national orchestra and maybe ...\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench bases from board room to ballroom with a the equipment and again house catering hotel north Hampton dot com [noise]\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology A. I. C. dot edu [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\n\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\n[noise]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org\n[noise]\n\n\n\n[noise]\nStreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education minister ration enrolling for October twenty second applications that they pass dot edu\n\nStreaming of New England public radio is funded by you and bay path university graduate schools an ass and applied laboratory science at operations enrolling now for August twenty seventh applications at bay paths dot edu [noise]\n\nThe introduction and polish dance from what many regard to be the great Russian opera buddy ... by ...\nAnd we heard that in the ... by ... good friend\nAnd they were even roommates for a time ... course they got in fact while they were roommates a moose ... was working on buddy school to nose ... did finish buddies good enough and that version is most often performed risky course ago fought it was quite a rough piece\nAnd he sort of smoothed out the edges with his own version which was performed for many many years but now we're seeing more and more performances of the original version that was your guinea ... with Russia state symphony\n\nDid you know that ... was a poll which he wrote the text to several of his songs including this little one which lasts all about a minute it's called ... ... my bright fell in love me ... as I Am come caress this luckily his fellow\nThis is a performance by buddies Christophe\nA base with Alexander ... and the little song by Will Shortz ski\n[noise]\nReal voice ... ... ... ... I don't know about you\nWhat would make for just over ... you'll you'll never know when I was a lot of oil goes up\nBy ... I don't know it's not good you know\nIt would be ... by their boards you're part of what you what the name of that you got your ... good luck this did\nNot want to quit smoking ...\n... ...\nOr what but it goes all men dog you\nKnow when they're no more too\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org [noise]\nUnusual rhythm so bumped by moose ... five eight time for that little song ... to his own Texas I mentioned before and that was buddies Christophe singing at the piano was Alexander not being ski\n\n... this is one of the flute ... it's just an ... e minor be dirty ten thirty four and a Philippe uh Davies plays flute Maggie cold ... court Alison the guilty McGill every plays the trouble\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\nScreaming of New England public radio was funded by you and they sat university graduate schools and that's in higher education is not a straight shot at rolling for October twenty second applications that they pass dot edu\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with a the equipment and in house catering hotel north Hampton dot com [noise]\n\n\n\nA brief olive Gretel by Luigi ... great cellist from heightened Mozart's time ... and Stephen Israel is the trouble\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that N. E. P. R. dot net\nBefore we hear music by Chopin here's something by close friend of ... what can be often concert ties older used from gum and knocked her\n[noise]\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\n\n\nTo show pen doctrines arranged into one by his friend OBs trunk come on her ... and ... work is performed\n\nChopin doctrines is what we're focusing on right now and we have leader on some music by tell them on what it does or Castro sweet so you'll stay tuned for some great use a computer ... Graff we hope your performance by ... usually\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee CVS daughter or my one in the major\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] Mm [noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise] [noise]\n[noise] [noise]\nStreaming of New England public radio is funded by you and they had to go to ... graduate schools and asked and applied laboratory science that operation rolling now for August twenty seven applications at bay fast dot edu [noise]\n[noise]\n\n[noise]\n\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling fall gee CVS dot org [noise]\n\n\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vents basis for a board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\nDreaming of New England public radio was funded by un cute little architect or to your legacy of commitment to community that does not celebrating the next generation of leadership cute little dog call [laughter]\nNo\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling for fall she sees the S. dot org\n\n\nMother\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org [noise]\n\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vet spaces from board room to room with a the equipment and the house catering hotel north Hampton dot com [noise]\n\nAnd then\nGo\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench bassist Ron board room to room with a the equipment and again house catering hotel north Hampton dot com\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology hey I see dot edu [noise]\n", "show_name": "Beethoven Satellite Network", "year": "2018", "city": "Amherst", "day": "11"}