{"month": "10", "state": "MA", "station": "WFCR", "content": "Were Christian McBride ... news ... ballad early Washington was composed by the Hartford going trucker Johnny ... who's the sex with us markets Strickland drummer no she waits and bassist Christian McBride this is the debut recording for new show and just do it for Mickey have a new records\nA lake ... in Vermont itself a leg risk recent release some steeplechase records looking at the moon\nFor the jets ... points ... they ... and Adam Coker on bass clarinet that some ... of one soon\nIt again within a week or ... ... ... it was ... arrangement of themes ...\nFor the recent release called Peter and the wolf doing vengeance on civil jets Holmes leads his big band with locals joining homes on Monday Night at seven thirty one Twenty one in east since and this is New England public radio W\nStreaming of New England public radio was funded by ... riddle architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\nOr spend an N. E. P. R. dot net ... wishing you a nice weekend I'll be back with you on Monday Night with music both agreed to intersect split it suits Sims Tuesday we'll feature clue could brown and classical music goes next to you Ron any PR\nThis is Peter ... little bit of problems for you then some heightened will be listening to one of the London symphonies the so called clock symphony number one the one\nThe bumps we hear is one of his Hungarian Dances he himself wrote this for piano for happens he orchestrated a few would that not all want to be here right now was orchestrated by one of his very few people how you won't Jay you over and they\nAre going to hear the fourth of the Twenty one Hungarian Dances\nThis is the Berlin ... on march we conductor\n[noise]\nStreaming of New England public radio was funded by you at the American international college offering low residency graduate programs for the working professional ... education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\n\n[noise]\nStreaming of New England public radio is funded by un June riddle architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n\n\n\nThe ... tomorrow so we are the conductor and music there while you're on his problems as we heard the fourth of July Twenty one Hungarian dancers originally for piano for Hans ... orchestrated thereby poll you won't know\n\nOf any concerts in history and there have been many many thousands tens of thousands hundreds of thousands this may be one that I Would most like to go to it happened on the third march Seventeen Ninety four it was in London\nYoung too sick like one of his piano concerto was\nBuilt the one of the great violinist up his dates like one of his own violin concerto was then the singer ... Fisher the base who created the role of old mean in Mozart's abduction from the Raleigh oh sang and then this work was procured heightens symphony number one hundred won the clock symphony\nBecause of the ticking ... second movement but here no this somebody of heightened played by the London classical players on period instruments led by Roger Norton\n\nStreaming of New England public radio is funded by un they pass university graduate schools MS and applied data science enrolling for October twenty second applications that they pass dot edu\n[noise]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gene C. V. S. dot org [noise]\n\n[noise]\n\nStreaming of New England public radio was funded by un valley solar local ... designed the installation helping household secure state or federal incentives and live carbon free and the ... valley solar dot solar [noise]\n\n\n\nNa\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\nDreaming of New England public radio was funded by ... architects oh forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\nStreaming of New England public radio was funded by un June riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\n\n\n... in ... by Johann Sebastian Bach obviously he was very fond of that piece exist in a number of his own arrangements in this case William Smith arrange to modern orchestra Philadelphia Orchestra Eugene Normandy conducting\nAnother great organist composer here she's are from and this was originally an organ work called ... ... a week the heroic peaks orchestrated by Charles O'Connell and the recording the IRS from Nineteen forty one with the San Francisco symphony conducted by caramel\n[noise]\n\nStreaming of New England public radio was funded by you at the American international college offering low residency graduate programs for the working professional ... education this most health sciences psychology a I see the\n\nNa na\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you added American International college offering law residency graduate programs for the working professional education business health sciences psychology hey I see it on the\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you when they got university graduate schools and that's and applied day just signed a rolling ... October twenty second applications that they know dot E. D.\n\nNa\n\nStreaming of New England public radio is funded by un bay path university graduate schools and asked and applied laboratory science at operations enrolling now for August twenty seven applications at bay past dot edu [noise]\nEh [noise]\nPerforming a bachelor Oregon at St Marie a church in ... Germany that was a whole ... playing the corral previewed Duncan dear how useful crushed by ...\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR cameras Springfield in Hartford in partnership with UMass Amherst stand at N. E. P. R. dot net\n\nFor we get to the largest sending ... Williams decision arrangement made by needy binoculars have of meat failed lean 'cause song the luck [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by un bay path university graduate schools and asked and applied laboratory science and operations enrolling now for August twenty seven applications that they pass dot edu Mm\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\nMm\n[noise]\n[noise]\n\n\n... wrote that as a song called the lark and Mimi binoculars transcribe it Alexander ... performed it\n\nHave three daughters my boss coming up on for ... for food one for the older the gum buck although played on the v\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org\nThe mark sending written the Nineteen fourteen ... than a refund Williams had to go into the military service but Nineteen twenty finished it for ... he was Nikola ... with the London philharmonic directed by Andrew lifting\nOh\n\n\n\nStreaming of New England public radio is funded by you and the hotel owners to offering six meeting on the basis for a board room to bowl with a the equipment that can help scattering hotel north Hampton dot com [noise]\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say in creative non fiction writing enrolling no for August twenty seven applications that they passed dot edu [noise]\n\n\nNikola bender he played the show will be able to part with a ... bill harmonic directed by Andrew but that is called the bar tending bar refund William\n\nYour little dance roast we were viola an orchestra by William [noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org [noise]\nFrederick Riddle performing I'm to be over there with one misinformed you have to directed by Norman del mar that's a little dance from a sweet for ... orchestra by ... Williams\n... road a lot of ... for an instrument with parks recorded company but we're going to Europe three of them now each for different instruments let's begin with this one a violin sonata in GW be ten Twenty one with Andrew ... Richard III our hearts are gorgeous [noise]\n\nStreaming of New England public radio was funded by un cute little architects oh forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\n\n\n\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now one rolling for fall gee CVS dot org [noise]\n\n\n\n\n[noise]\n\n\n\n\nStreaming up the waitlist public radio was funded by you had Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts do now with rolling fall gene C. V. S. dot org\n\n\nNa\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot EDU\n\nBy the\nSwitched to not any flood major VW be ten thirty one bite Johann Sebastian Bach marina ... flutes and the Brazil guitar duo think sometimes we forget how truly ground breaking the Saddam has worked by box and all this ... flew to be able to come by prior to this time\nWe had so much about last year we're doing it again New England public radio secondhand you'll just be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on and get your tickets today at NPR dot net\nWith little figures underneath the notes to tell you where the court should be or what which court should be played above it and then the hearts of quarters with improvised boss had none of that he wanted\nTo have the Arctic or does play exactly what he wanted to play so he wrote out the ... which was revolutionary to talk now it's just what is done and what has been done since that time [noise]\nHere's another ... this one for the older the gum by Antarctic or\nHowever it's played on the viola park's record a couple of men Kim ... Jared ... record this is the first ... ... by ...\nNa\nNa [noise]\n[noise]\n[noise]\n[noise]\nAnd\nStreaming of New England public radio was founded while you are American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy ... na\nNa\nNa na\nNa\n\nNa\n\nNa na\nNa\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org [noise]\n... kept us without music funk to be by Carl Philip amenable box a little march from the ... ... ...\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst end at N. E. P. R. dot net\n... if you're a heavier lined up a couple of the Nineteen Hungarian Rhapsody by Franz Liszt we'll go to a late one first and then to one of the very first in fact the best known as well in the ... the number two\nBut first we have the number six team and it's a kennel version all it's all that exist to this particular Hungarian wrapped it the only a few of them were orchestrated\nThis recording is with age fund Eddie\n\n\n\n\nStreaming of New England public radio is funded by you when they pass university graduate schools and asset applied data science enrolling for October twenty second applications that base paths dot edu oh\n\n\n\n\n\n\n[noise]\n[noise]\n\n\nMm Mm\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\n\n\n\nOne of the Nineteen Hungarian Rhapsody is really more gypsy inspired untrue Hungarian by friends list and we are the number sixteen a minor with eighty to ... D pianist when you go to the very best known to the mall in just a moment did you know by the way the list although born hungry never spoke a word of ...\n\nWe're going to listen to a work which has a single movement which is extremely famous the rest of it is completely unknown it'd be very interesting uh Henry ... and his fourth ... listen to and just a bit\nBut we have right now the second of the Nineteen Hungarian Rhapsody spike Franz Liszt units or chemical version on top Dorothy conducts the London symphony\n[noise]\nStreaming of New England public radio is made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AS Easter defined technicians Massachusetts state inspections she keeps garage dot com\n\n\n\n\n\n\n\nWe had so much about last year we're doing it again New England public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel north happen you're glad rags on and get your tickets today at NPR dot net\nAs Peter Donahoe is the pianist and the born with symphony orchestra is conducted by Andrew listening to music from Eighteen fifty one by Henry Charles little and when that second movement comes along chances are you'll recognize it immediately\n\n[noise]\n\nStreaming of New England public radio is funded by un they that university graduate schools and that's been applied data science enrolling for October twenty second applications that they pass dot edu\n\n\n\n\n\nStreaming up New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org [noise]\n\n[noise]\n\n\n[noise] mhm [noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\nWe have so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your ticket today in the yard done\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public on like eight to twelve school personalizing education for Massachusetts students now would rolling fall gee C. V. S. dot org\n\n\n\n[laughter]\n\n\n\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy ...\n\n\n\n\n\n\n\nOh\n[noise]\n\n\n\n\n\n\n\nStreaming up New England public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now we're rolling fall she sees the S. dot org\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the bench bases from board room to room with a the equipment and again house catering hotel Northampton dot com\n\n[noise]\n\n\n\n\n[laughter]\nStreaming of New England public radio is funded by you and they pass university graduate schools and asked and applied laboratory science that operation San rolling now for August twenty seven applications at bay paths dot edu [noise]\n\n\n[noise]\n\n\n\n\n\n\n\nOh uh\n\nStreaming of New England public radio is funded by un bay path university graduate schools and asked and applied laboratory science at operations enrolling now for August twenty seven applications at bay paths dot edu\nFingers directed by pulse Spicer performing music by their ... journal ... life uh writes shuttle it's\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and that N. E. P. R. dot net\nWould occupy your time with some musical legend I'm Peter ... Graff you're hosted the first of all that James is one of the collection for orchestra by ... you're the fourth of the set the how the orchestra answer John Barr Brawley\nWell\n[noise]\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot E. D.\n\n\n\n\nWe have so much fun last year we're doing it again in the window in public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags zone to get your tickets today at NPR done na\nA ...\nA\n\nThe highly orchestra directed by John ... perform one of the legit but on the ... the exist in California's versions and of course our capital\n\nMusical legends here for you Peter Pan to grab speaking Iran should birch third symphony conducted by your man when he was a legend by ... Arnold ... played by John McCain\n[noise] [laughter]\n\n[noise]\n[noise] [noise]\n\nStreaming of New England public radio was funded by you and they passed university graduate schools and I say in creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n...\n\n[noise] Mm\nMm\n\n\n[noise]\nOh wow wow\nWhoa oh\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with Avi equipment and the house catering hotel north Hampton dot com oh\n\nOh\nCome\nOn this will be ... in Vienna Philharmonic dreams will find the conductor diligent by Henrik ...\n[noise] what am I knew that we will be hearing shoe birch third symphony wished for what he meant when conducting\nAnd one more legend first of all this one for uncle and orchestrated by the American composer awful looming ... the conductor hostile philharmonic orchestra Erik Larson is the ... and do things legend\n[noise]\nStreaming up the waitlist public radio was funded by ... Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students that were rolling fall gee CVS dot org [noise]\n\nStreaming up New England public radio was made possible by you know by sea cues garage in Williamsburg offering foreign and domestic on the repairs AES each certify technicians Massachusetts state inspections she keeps garage dot com\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by ... riddle architect of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\n\n\n\n\n\n\n[noise]\nWe have so much about last year with doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north up to get your blood red zone and get your tickets today at NPR dot net\n[noise]\n\n\n\n\n[noise]\n\nWe had so much about last year with doing it again and then we can public radio secondhand you'll just be Nineteen twenties holiday party Saturday December first at the hotel no pets get you're glad to get your tickets today at NPR na\n\n\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that were rolling fall gee CVS dot org\n\nNa\n\nStreaming up New England public radio was made possible by you might see keeps garage in Williamsburg offering foreign and domestic on their parents' yes each certify technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\nOnce again the sort of you who the man to win this time conducting the camaraderie the easy and music by New York CD tell them up\n\nStreaming New England public radio was funded by you and valleys solar a local company installing roof ground amounts and do all access trackers helping households live carbon free and the four one three valley solar dot seller\nSchool music program which you can hear seven nights a week a New England public radio WFCR cameras Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\nMy name's Peter venue grab my role here is to keep you company with music help you give me the opportunity to do so\nComplete for you some coffee at a sweet from his ballet Cinderella we're also going to listen to some music of fronts Schubert fantasy a in see for violin and piano\nFrom the coffee if something by his a bit younger contemporary fellow countrymen Dimitri ... this is a ... Tina little snow\nFor Kendall which was performed by ... mental\n\nFood [noise]\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel north Hampton offering six meeting at the basis for a board room to room with a the equipment and in house catering hotel north Hampton dot com [noise]\n[noise]\n[noise]\n[noise]\nFor some\nFor [noise]\n\n...\nBe there for a for\nTime on the couch\nFor ...\nStuff and\n[noise]\nNot a perfect for\nThe first time\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic under repairs AS Easter defined technicians and Massachusetts state inspections seek he's garage dot com\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise] the performance was by a polish born Candace porn in Nineteen awaits named ... blooming tall\nOr she took a refuge in France and Luxembourg early in World War two and then went to Rio de Janeiro or in Nineteen forty two stayed in South America and had enormously successful career traveling rather than traveled the world\nWe heard her perform some music by the Russian composer to be three company ... his ... Tina was Thirteen number one\n[noise] one of the great belly scores of surrogate for coffee of Fort you'll\nMiss a had the distinction of being the first\nPost war production at the Bolshoi theatre in Moscow at the end of Nineteen forty five was began to Nineteen forty one didn't interrupted of course are by World War two\nThe work is Cinderella and everybody here sweet from the belly upper coffee ... the ... conducting the New York philharmonic [noise]\n\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education that dentist ration enrolling for October twenty second applications that they pass dot edu [noise]\n\n\nUh\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts do now with rolling fall Gees easy yes Don ... or\n\n\nDreaming of New England public radio was funded by June ... architects or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you and the hotel are now offering six meeting to that's based just roared room to room with a the equipment to the un house catering hotel north now the dog oh man\n\n\n\n\n\n\n\n[noise]\n\n\n\nWe had so much bought last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north tend to get your blood red zone and get your tickets today at NPR dot net\n\n\nStreaming up the road with public radio was funded by you and Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts do that with rolling fall Gees easy yes dot org [noise]\n[noise]\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools and I say a creative non fiction writing and rolling now for August twenty seven applications that they pass dot edu [noise]\n\n\n\n\n[noise] nah nah nah\nNah nah nah nah\n\n\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n[noise]\n\n\n\nStreaming of New England public radio was funded by you and they sat university graduate schools and I asked in higher education that dentist ration enrolling for October twenty second applications that they pass dot edu [noise]\n[noise]\n\n[noise] [noise]\n[laughter]\n\n[noise]\n[noise] I\n\n[noise] [laughter]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by ... riddle architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\nStreaming of New England public radio was funded by you and cute little architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n... cello wouldn't run by the piano public health transcription of the beat by the other fronts Schubert\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended in E. P. R. dot net\nRussian music here for you to enjoy from a couple of pieces which have to do with charge and we first go to the opera a life for the char by letting go and listen to publish dance from ... to conducted by your guinea skip on off [noise]\n\nWe have so much fun last year we're doing it again in the window and public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel north happen to get your blood red zone and get your ticket today at NPR are done\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology a icy dot edu [noise]\n\n\n\n\n\nUSSR symphony as was then known accorded in Nineteen Seventy Seventy again you see a lot of what the conductor we're musical Mikhail being from his off for a life for the car that was published down from ... to\n\nWant to stay tuned let me tell you because we have a real rarity a reconstruction of an incomplete work of Mozart a violin and piano concerto with a stellar caster soul as well and some Russian music no yeah\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\nWhich is a great just you're conducting the Bolshoi theatre\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dog call [noise]\nNo no\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\nStreaming up the waitlist public radio was funded by you add Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling fall gee CVS dot org\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\nMm ...\n[noise]\n\nWe have so much one last year we're doing it again in the window and public radio second annual Jim this baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone and get your tickets today at NPR are done na\n\n\n\n\n\n[noise]\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n\nRemoved from um\n[noise] [noise]\n[noise]\n\n\n\n\n\nChemist or a wild playing those run the distances of getting cars opera of life for the char by Mimi ... from the Russian off ... ... this is foreign bumps on some like ... or [noise]\nI don't do what\nThey do\nAnd they know me and\nMe want\nTo be on the ground\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\nThen I'm I'm\nNot one and I\n[noise]\nYou know\nWe're not really\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the bench basis for a board room to room with a the equipment and the good house catering hotel north Hampton dot com [noise]\n\n\n\n\nMm\n[laughter]\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot the\n\n\n\n\nStreaming of New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now we're rolling for fall gee C. V. S. dot org [noise]\n\n\n[noise]\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA creative non fiction writing enrolling now for August twenty seven applications that they pass dot edu\n\n\nStreaming of New England public radio was funded by you at ... university graduate schools MS in higher education administration enrolling for October twenty second applications that they pass dot edu\nDuck to Amsterdam baroque orchestra and the Netherlands boss society or a chorus in the ... series from another incomplete working Mozart incomplete because he died before he could finish it that's the DSD ray from the requiem\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst ended in E. P. R. dot net\n... composed the music not Giovanni not even ... but the unrelated Domenico ... born in sixteen fifty nine and we're ... the soloist\n\n[noise]\n\nWe had so much one last year we're doing it again in the window and public radio second annual jet as baby Nineteen twenties holiday party Saturday December first at the hotel north up and get your glad rags zone to get your tickets today at any time you're done them\n\n\nNo no no no no no no no no\n[noise]\n[noise]\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at events basis from board room to ballroom with a the equipment and in house catering hotel north Hampton dot com [noise]\n\n[noise]\n\n\n\n\n\nAnd we're ... trumpet ended Lucerne festivals strings Rudolph dumb Gardner was the conductor we heard out of control but each some nuts in five brief movements by Domenico Gump really\n\nRandy Graf you're with a real treat for you this is a rare opportunity to hear some music by a man who's famous very famous for his ... she was a contemporary of Mozart to four years older than both start in fact the two were rivals\nHis name is ... Clementi and if you ever play the piano chances are you've played one of his little ... will he wrote some sympathies to the little known but a very very high quality\nMusic which was rediscovered just in Nineteen sixty nine we're going to get a third of his symphonies which makes\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now one rolling for fall gee CVS dot org\nNational Symphony one of those don't tell us why we don't know why uh Clemente used those melodies in this in the speech we're going to listen to the killer Modi orchestra directed by how she mostly [noise]\n\n\n\n\n\n[noise]\n\nDreaming of New England public radio was funded by ... riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com Mm\n\nWhoa\n\n\n\n\nStreaming up the waitlist public radio was funded by you Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts do now with rolling fall Gees easy S. dot org [noise]\n[noise]\n\n\n\n\nWe had so much about last year with doing it again New England public radio second annual jet this baby Nineteen twenties holiday party on Saturday December first at the hotel north tend to get your Glenn rag Jonah get your tickets today at any T. R. dot net\n\n[noise]\n\n[noise]\n\n\n[noise]\nMm\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by us they path university graduate schools and asked applied laboratory science that operation rolling now for August twenty seven application they ... [noise]\n\nWhen when\nMen and women in there\nAnd\nDo it\n[noise]\n[noise]\n\n\n\n[noise]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall gee C. V. S. dot org\nCompany music by Nineteen century American Friends just jumps and that's called the Philadelphia ... what's\n\nYour ... and George Gershwin were close friends and Heifetz\nBugged George Gershwin to writing a piece of music for a long time Gershwin so sadly I got a brain tumor and died because if it was never able to complete that's rather informal commission so I took some self took themes from Gershwin jumper Porgy and Bess entering into a sweet what you're going to hear right now\nPlayed by ... and ... a good cheap kennel\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\nStreaming up New England public radio was funded by you add Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling fall Gees easy yes dot org\n[noise]\n\n\n\nStreaming of New England public radio was funded by June ... architects of the year legacy of combat but to community design celebrating the next generation of leadership vacuum riddle dot com\n\n\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio was funded by you and valleys solar a local company installing roof ground\nAmounts and do all access trackers\nHelping households live carbon free and the four one three valleys solar dot solar [noise]\n\n\nMm\n\n[noise] [noise]\n\n", "year": "2018", "show_name": "Beethoven Satellite Network", "city": "Amherst", "day": "27"}