{"month": "10", "state": "MA", "station": "WFCR", "content": "\nThat sunny problems here on NPR play what a difference but they made from Sonny Rollins plus three the Nineteen thirty five recording the ... the late ... Crenshaw on base and they'll foster on drums there the sexual colossus Sonny Rollins what a difference and they made\n... Benny green playing something a dream last night that featured the vocalist Veronica swift and so if any greens do release called then and now\nShe me he played picture e she's the title track of the Nineteen Seventy five albums that should be made for senator records they were very Harris ... beats Ninety second birthday\nAnd we begin with Dmitri ... pet and playing Jimmy she's the surface to itself the latest release cold we to Dimitri ... will be back is good soldier was within ... workshop on December living there\nStreaming of New England public radio it's been possible one you might see keys garage in Williamsburg offering foreign and domestic on the repairs and you ask each certifying technicians and Massachusetts state inspections she keeps garage dot com\nHammers to Springfield Hartford your partnership with UMass Amherst N. N. E. P. R. dot net I'm Tom ... I'll be back with you tomorrow night's which is on the boat classical music is next\nI Do hope you'll keep listening for music and Peter and the graph would listen to a couple of fantasies\nFor solo instrument an orchestra based on themes from a couple of very famous operates in just a moment we'll be grew knows spouse but first we have this from ... the jewel REO sung by ... with ... shut off gene conducting right\n\n\n\n\n\n[noise]\n[noise]\n\nWe have so much fun last year we're doing it again and then we'd been public radio second annual Janice baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rag Jonah get your ticket today at NPR are done\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org [noise]\n\n\n\n[noise]\n\n\n\n[noise] ... the role model to orchestra Nineteen sixty recording studio shut off gene conducting and that is the jewel are you from ...\n\nTo fantasies for you here based on themes from famous operas number can listen to ... birch unfinished company\nThat sounds good to you ... wrote a concert fantasy I'm teams from who knows vouched for either violin at orchestra or in this case violin and piano ... with the Amish to Jonathan Feldman\n\nScreaming of New England public radio was funded by you said that university graduate schools and I asked in higher education administration rolling for October twenty second applications that they pass dot edu [noise]\n\n\n\n\nStreaming of New England public radio is funded by you when they pass university graduate schools MS and applied data science enrolling for October twenty second applications that base paths dot edu [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\nWe had so much one last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first to the hotel north happen get you're glad rags zone to get your tickets today at any time you're done\n[noise]\n\nStreaming of New England public radio was funded by you when they pass university graduate schools MSA in creative non fiction writing enrolling now for August twenty seven applications at bay past dot edu\n[noise]\n[noise]\n\nThe first of two romantic ... performed by done them a lot of Its Food and Wendy corner Lucas harp\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that and eat P. R. dot net\n\nI'm Peter Van to grab your host we have music by ... to enjoy together and el guards enigma variations coming up later on as well\nHere is the overture to an opera ... called ... and we hear a performance on period instruments by the time the only ... directed by Christophe Ruth say\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you when they got university graduate schools MSA creative non fiction writing and rolling no for August twenty seven applications that they pass dot edu\n\n\n\nDreaming of New England public radio was funded by un cute little architect of forty year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n\nUm\n\n\nOverture to one of the many operas by the French Baroque composer ... ... it's called ... rarely heard one and a performance by the time the only ... under the direction of ... we're going to hear more by rumble in a moment also something by a crosswalk ...\n\nJumping to provoke imposed a number of pieces called ... ... ... ...\nWe're so much about last year we're doing it again New England public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rag Jonah get your tickets today at NPR dot net\nIt's a good price of three pieces the pen to mine the indiscreet one pay special attention to the third one because it's a musical self portrait it's called the rubble and we have the trio set the gym to with this music by jumping from\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cases will school personalizing education for Massachusetts students now would rolling purple Gees easy yes dot org\n\n\n\n\n\n\n\n\n\nMm\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu\n[noise]\n[noise]\n\n\n\n\n\nA self portrait by ... Cooper on it's called not coop around the piece describing cobra and that was ... performing I'm are scored here is a portrait of a friend of Virgil Thompson named George ...\n\n\n\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences and psychology a icy dot edu [noise]\n\n\n\nPortrait of a friend of brutal Thompson named ... in a ... of course brutal Thompson\n\nAll these musical portraits are leading up to a huge and very famous work which is simply a set of variations on a theme each variation\nA musical portrait of a friend or even the composer himself family member these are the enigma variations by sir Edward ... uh the most prominent one to to notice is the very last one because that is the self portrait\nOf sir Edward el garbage many other friends and family members included there in the first variation factors the composers wife\nHere is the city of Birmingham symphony conducted boxer Simon Rattle Elba Garza ... variations\n[noise]\nWe had so much one last year we're doing it again the when the public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rag Jonah get your ticket today in the yard done\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now enrolling for fall gee C. V. S. dot org\nMm\n[noise]\nWe had so much about last year with doing it again New England public radio second annual jet this baby Nineteen twenties holiday party on Saturday December first at the hotel Northampton get your Glenn rags don't get your tickets today at any T. R. dot net [noise]\n\n\nWe have so much one last year we're doing it again New England public radio second annual genders baby Nineteen twenties holiday party Saturday December first to the hotel north helping your blood red zone to get your tickets today the urine done\n[noise]\n\n\n\n\n\n\n\nStreaming of New England public radio was funded by you and cute little architects oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com\n[noise] [noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now rolling for fall gene C. V. S. dot org [noise]\n\n\nStreaming of New England public radio is made possible by you and by the keys garage in Williamsburg offering foreign and domestic on the repairs AS Easter defined technicians and Massachusetts state inspections she keeps garage dot com [noise]\n\nGroup called the ... sort of music by Adele in contemporary named Richard Nicholson that was the Jews dance\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst and that N. E. P. R. dot net\nIn just a moment or two we're going to listen to a performance by Van Cliburn pianist of one of the best loved all piano Saddam has its by Beethoven somehow has acquired the subtitle the moonlight ...\nAnd to lead up to that a piece called moonlight by Franz Schubert ... shine and the performance here by the kings singers and the pianist is Roger big knows there's a solo tenor part too that's by Neal archer\n\nOn a on a on a on\nA ... who are\nNon [noise]\n\nReally uh [noise]\n[noise]\n[noise]\nI'm On a\nUm [noise]\nUm [noise] uh [noise] uh no\nStreaming of New England public radio is funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\nOff last you know I was just me or you know\nI'm On a on the good food on my\nGod I was\nA man on my mind and then do a lot of oil for us to move\nIn a in\nA in a in a way for a\nLong long time for all adults are on drugs [laughter] I have no\nTime to\nTime and I are doing saw on\nThe way to do on\nA long time and I know a a you\n\nKnow I Want to try to earn\nA while I was on a in a\nWay to reach\nA broader right as a on a small on on\nThe right\nTo the games\nFor a walk\nAround a long term\nAnd during a\n... a ...\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy S. dot org\nAnd you\nKnow a a a a\nA\n\nA\nA a\nA [noise]\n\nA a [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nThe kings singers that music by ... cold morning didn't shine or moonlight and quite a beautiful Tex ... the mystical flower of the moon's smiles it's plain to look calls the paradise of love back\nTo this gloomy night on earth conquered by the mighty arm of sleep worry guilt and pain pass away moonlight by Franz Schubert\n\nSomebody not Beethoven himself but somebody gave this piece is titled the moonlight so not because of the very slow first movement which is quite unusual in any sudden author of the period it is Beethoven's piano sonata number fourteen and see sharp minor op is twenty seven number two the recording here by canister Van Cliburn\n[noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the basis for a board room to ballroom with Avi equipment and getting house catering hotel north Hampton dot com\n\n\n\n\n\n...\n\nAnd ...\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n\nStreaming up to like let public radio was funded by you land Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts do now with rolling fall D. C. V. S. dot org\nI'm\n\nNo\nVan Cliburn was the ... recording from the mid Nineteen sixties of music by Beethoven it's one of the ... because of the slow first movement someone posts Beethoven\nGave it to subtitled the moonlight ... so not end up uh fourteen and see sharp minor opus twenty seven number two by Beethoven\nThis is also a piece which has to do with the moon it is ... ... the moon has come complaining before the countenance of the sun what avail heard the heavens since you moved to radiance and light [noise]\nThis is a song by Alexander ... and ... author sings at court garbage is ...\n[noise]\n\n\n\nStreaming of New England public radio is funded by you and valleys solar local ... design at installation helping household secure state or federal incentives and live carbon free and the four one three valleys solar dot solar [noise]\n\n[noise]\n\n\n\n[noise]\nOne of the selection of Tuscany folk melodies arranged by Alexander Tim didn't ski [noise] an Austrian lake romantic ... played to the moon has come as plaintiffs\n\nGonna turn next to a symphony by the English composer ... Arnold who was a very prolific composer in many forms to many his best known as a film score composer in fact the one\nEconomy award for the film score to the bridge over the river Kwai but here is what is often considered not definitively but often considered to be his greatest symphony symphony number three\nBy some rock I'm Arnold and this is a very special recording because the composer himself is the conductor leading here the London philharmonic orchestra\n[noise]\n\n\n\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com\nNa na\nNa na\nNa na na na na\n\n\nNa na\n[laughter]\n[noise]\n\n\n\n\n\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\nWhoa\n\n[noise]\n\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n[noise]\n[noise]\n\n\n\n\n\nWe had so much one last year we're doing it again and then when the public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel no attempt to get your blood red zone to get your ticket today at NPR are done\n[noise]\n\n\n\n\nDreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cages will school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\n\n\nStreaming of New England public radio was made possible by you and by the keys garage in Williamsburg offering foreign and domestic under Paris AES Easter defined technicians Massachusetts state inspections she keeps garage dot com\n\nOr\nMm no no no\n\n\n\n\n\n\nStreaming of New England public radio was funded by you added American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n\n[noise]\n\n\n\n[noise]\n\n\nWe had so much fun last year we're doing it again in the window and public radio second annual jet this baby Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags on to get your tickets today any tiara done\nThe ... very performing ... music by an anonymous composer ...\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week on New England public radio WFCR in Amherst Springfield in Hartford in partnership with the UMass Amherst stand at N. E. P. R. dot net\nWith American music or you were going to begin with two pieces by George Gershwin from a disk called the original manuscripts with Alicia just at the piano and these are two of the so called songs without work it's also known as melodies biker twin\nWill listen to a three notes waltz and romantic from Nineteen twenty seven\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] and\n\n\nScreaming at New England public radio was funded by un June ... architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum red dot com\n\n\n[noise]\n\n\n[noise]\n\nMm [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nStreaming of New England public radio is funded by you and they passed university graduate schools and that's and applied data science enrolling for October twenty second applications at bay paths dot edu\n[noise]\n[noise] [noise]\nYeah [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise] we for some music composed by George Gershwin a couple of little known melodies effect composure and a performance of to just simply called songs about words with a list should just don't care\nWhat we have some music by Leonard Bernstein as we're going to listen to a performance of a ballet appeals which first appeared\nIn Nineteen forty for it if you know the story of on the town this is something up to the same a tale of some ... sailors on shore leave\nOut to be a good time flirting with the girls Deborah ... valleys called fancy free and we hear performance by the born the symphony orchestra conducted by Andrew\nWe have so much one last year we're doing it again in the window in public radio second annual jazz baby Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rag Jonah get your ticket today at NPR are done\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting on the basis for a board room to room with a B equipment to the house catering hotel north Nelson dot com [noise]\n\n[noise]\n\n[noise] I don't\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the vents basis for a board room to ballroom with Avi equipment and in house catering hotel north Hampton dot com\n\nStreaming of New England public radio was funded by you and cute little architect oh forty year legacy of commitment to community design celebrating the next generation of leadership at ... riddle dot com [noise]\nNo no no\nNo no\n[noise]\n\n\n\nNo no\n\n\n\n[noise]\n[noise]\nDreaming of New England public radio is made possible by you know by the keys garage in Williamsburg offering foreign and domestic on the repairs AS Easter defined technicians Massachusetts state inspections she keeps garage dot com [noise]\n[noise]\nMusic by the American ... Roy Anderson performed\nBy the St Louis symphony conducted by large black and it's called the first day of spring and the ... famous spring inspired music by Antoni over all the which opens his four seasons skill shop with the ... chamber orchestra [noise]\nStreaming of New England public radio was funded by ... rental architect of forty year legacy of commitment to community design celebrating the next generation of leadership vacuum riddle dot com [noise]\n\nWe had so much one last year we're doing it again New England public radio second then you'll just be be Nineteen twenties holiday party Saturday December proves to the hotel north happen you're glad reggaeton to get your tickets today the euro done\n\n[noise]\n\n[noise]\n\nWe had so much what last year we're doing it again in the winter public radio second annual jet is pretty be Nineteen twenties holiday party Saturday December ... to ... to do is get your blood red zone to get your ticket today at NPR are done\nAh\n\n\nUh\nWe had so much fun last year we're doing it again New England public radio second annual jazz Bebe Nineteen twenties holiday party Saturday December first at the hotel north happen get you're glad rags zone and get your tickets today that indeed you're done\nThe lines to ... because I find the size\nOf a bus driver or\nA school in ...\nSchool it's a a boy from a\nBlue Cross blue\n\n\nSprings several by John Ireland sun by Christopher molten grant jumps in Seattle\nStreaming of New England public radio is funded by you and they passed university graduate schools MS and applied data science enrolling for October twenty second applications at bay paths dot edu\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that N. E. P. R. dot net\nOr music is by ... ... my name is Peter ... we have some music arranged by Benjamin Britten of some use the ... coming up also heightened string quartet them to a few other things\nJust to the overture to the early ... called ... performed by the ... chamber orchestra\n[noise]\n\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel Northampton offering six meeting at the bench bassist Ron board room to room with a the equipment and the good house catering hotel Northampton dot com\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gee CVS dot org\n\nYoung ... just getting started his career what he wrote that music he was Seventeen or Eighteen years old the overture to the Eighteen ten opera ... comic opera obviously like come beyond a de ...\nAnd a performance by an ensemble that performs without conductor the ... chamber orchestra and that brings us to music which is well sort of by real senior but based on some of his much leader music\n\nBetween Britain took some pieces by a real steamy after he had stopped writing his operas he called them the sins of my old age\nAnd Britain orchestrated them here's one of those except it's called ... music call there's five little pieces by I'm an older ... national philharmonic here and Richard bonding [noise]\nStreaming of New England public radio was funded by ... Greenfield commonwealth virtual school public online cage to twelve school personalizing education for Massachusetts students now would rolling for fall gee CVS dot org [noise]\n\n\n\n\nStreaming of New England public radio is funded by un they that university graduate schools MS and applied data science enrolling for October twenty second applications at bay past dot edu [noise]\n\n\nNational philharmonic orchestra conducted by Richard bonding and music by well to composers actually roast Seaney wrote those tunes as part of his sins of my old age she called them and Benjamin Britten ... cold medicine they usually call\nHere's a composer greatly admired and often arranged by Benjamin Britten Henry personal we're getting a music which personal composed word play called the ... bowl and this is the heart for chamber orchestra conducted by for smaller\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nStreaming of New England public radio is funded by you know the hotel nurse now offering six meeting the vets bases ... board room to room with a the equipment and the house catering hotel north Nelson dot com\n[noise]\n[noise]\n\nAnd\n\n\n\n\n\n\nStreaming up the ... public radio was funded by ... Greenfield commonwealth virtual school public on like eight to twelve school personalizing education for Massachusetts students now would rolling fall Gees easy yes dot org\n\n\nAnd [noise]\n\n\nOh\nNo matter\nAnd their families\nDown\nAnd a\nAnd then after\n\n\nNow\nNa\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu\n[noise]\nYou\n[noise]\n\n[noise]\n[noise]\n\n\nStreaming of New England public radio was funded by un cute little architects of the year legacy of commitment to community design celebrating the next generation of leadership a cute little dot com\n\n\n[noise]\n\n\n\nStreaming of New England public radio was funded by you added American International college offering law residency graduate programs for the working professional education business health sciences psychology hey I see the [noise]\n\n[noise]\n\n[noise]\n[noise]\nStreaming of New England public radio was funded by you add American International college offering low residency graduate programs for the working professional in education business health sciences psychology A. I. C. dot edu [noise]\n\n\n\n\n\n\n\n\n\n[noise]\nDreaming of New England public radio was funded by un cute little architect or forty your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\nWe had so much about last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first at the hotel north happen you're glad rags don't get your tickets today at NPR dot net\n[noise]\n[noise]\nWe had so much about last year we're doing it again New England public radio second and you'll just be be Nineteen twenties holiday party Saturday December first at the hotel Northampton get you're glad rags on to get your tickets today at any T. R. dot net\n\nMm\nEliot fiscal the transcriber and the performer there of that ... variation by American George Rockford\n\nThank you for listening to our overnight classical music program which you can hear seven nights a week a New England public radio WFCR in Amherst Springfield in Hartford in partnership with UMass Amherst and that and E. P. R. dot net\n... this is the overture to enter the upper by George bc called Dr miracle Douglas ... Bohemia chamber philharmonic [noise]\n\n[noise]\nStreaming of New England public radio was funded by you and cute little architects a forty year legacy of commitment to community design celebrating the next generation of leadership at ... dot com [noise]\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall gene C. V. S. dot org [noise]\n[noise]\n\nThat's music by early music that by George B said the overture to as Brenda dumped dorm Iraq let Dr miracle Bohemia chamber philharmonic played by Douglas ...\nThis is Peter Randy Graf and there are two one fantasy is based on themes from BCS opera Carmen and they're both ... and we're going to you both of them let's begin with the ...\nStreaming of New England public radio was funded by ... architects a forty year legacy of combat but to community design celebrating the next generation of leadership at ... riddle dot com Perlman solo share with the New York philharmonic conducted by human may talk\n[laughter]\n\n\n[noise]\n\n\n\n\n\nWe had so much about last year with doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party on Saturday December first at the hotel north happen you're glad rags on and get your tickets today at NPR dot net\n[noise]\n\n\n\nDreaming of New England public radio was funded by un June riddle architect or to your legacy of commitment to community design celebrating the next generation of leadership a cute little dot com Mm\n[noise]\n\n\n\nStreaming of New England public radio was made possible by you and boy she keeps garage in Williamsburg offering foreign and domestic on their parents' yes you certify technicians Massachusetts state inspections she keeps garage dot com [noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\nStreaming up New England public radio was funded by un Greenfield commonwealth virtual school of public online cage to twelve school personalizing education for Massachusetts students now one rolling fall gee C. V. S. dot org\n\n\n[noise]\n\n[noise]\nStreaming of New England public radio was funded by you and Greenfield commonwealth virtual school of public online K. to twelve school personalizing education for Massachusetts students now enrolling for fall Gees easy S. dot org [noise]\n\nMm\nWe have so much one last year we're doing it again New England public radio secondhand you'll just be be Nineteen twenties holiday party Saturday December first to the hotel north up and get your blood red zone to get your tickets today you're done\nMm\n\n\n\n\n\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students now would rolling for fall Gees easy yes dot org na\n\n\n\n\n\nStreaming of New England public radio is funded by you and the hotel doors now offering six meeting on the bench bassist Ron board room to room with a the equipment that house catering hotel north Hampton dot com [noise]\n\n\n\n[noise]\n[noise]\nStreaming of New England public radio was funded by un Greenfield commonwealth virtual school public online K. to twelve school personalizing education for Massachusetts students that were rolling for fall Gees easy yes dot org [noise]\n\n\n[noise]", "show_name": "Beethoven Satellite Network", "year": "2018", "city": "Amherst", "day": "26"}