{"month": "10", "state": "TX", "station": "KTDH", "content": "Based upon the size of our broadcast Syria H. P. P. R. is close to achieving our eighty five thousand dollar operating go for twenty Nineteen\nEach contribution to your community public radio station does matter at H. P. P. R. dot org\n[noise]\nThis is Ninety One point five ... eighty nine point three ... of service of high plains public radio available everywhere at H. P. P. R. dot org\nThe costs of operating H. P. P. R. as a Web stream or underwritten by community sponsors you here recognized on the air we thank them for their support and hope that you will patronize support kind of thing to miss well\nThis this Sunday baroque I'm Suzanne bona\nPeople that they can only think that baroque music is all cheery dances and light hearted story set the music but that is not always true to the U.S stories are high drama tales of red vengeance murder blood and violence and you'll hear a few of those scary stories set to music today just in time for Halloween [noise]\n\nLive from NPR News in Washington I'm neuron the FBI says it appears the gunmen who attacked a synagogue in Pittsburgh yesterday acted alone eleven people were killed and six others were wounded Scott Brady is the U.S attorney for the western district of Pennsylvania\nGod in Pittsburgh yesterday acted alone eleven people were killed and six others were wounded Scott Brady is the U.S attorney for the western district of Pennsylvania He says the suspect is forty six year old Robert Ballard\nDuring the course of his deadly assault on the people the synagogue Bowers made statements regarding genocide and his desire to kill Jewish people after a standoff with police powers eventually surrendered and remains in federal custody today\nHe's scheduled to appear before a federal magistrate judge tomorrow he faces twenty nine charges including some to carry the death penalty\nThat's morning officials released the names of those who died they range in age from fifty four to Ninety seven and included a married couple a Florida Man is also due in federal court tomorrow he's charged with sending pipe bombs to prominent Democrats and CNN\nNPR's David Schaper reports from Fort Lauderdale co workers of the ... they never thought he was dangerous even\nThose days are the same time spewed anti gay anti Semitic and racial slurs while working as a delivery driver at a pizza restaurant demands for ... says never in a million years did she think he could go as far as mailing pipe bombs to a former president and other top Democrat\nSomewhere along the line with us we have a broken as far as a society there's so much hatred going on today somewhere along the line we've got to get back to being compassionate caring loving individuals\nThe country she says has got to get to a better place say I meanwhile make that initial appearance in federal court here Monday to face charges related to the mailing pipe bombs David Schaper NPR News Fort Lauderdale\nVoters in Ireland have reelected president Michel Higgins with a strong majority they also passed a referendum which removes the word blasphemous from the Irish Constitution from Dublin Joseph and reports\nSeventy seven year old Labour party candidate Michael D Higgins one with fifty six percent of the first preference vote is the first city in Irish president to win a contested reelection and more than fifty years it's a largely ceremonial role and dusty is unable to stop the country's homelessness crisis with\nAlmost a two to one margin voters also approved the only other item on the ballot a referendum to remove the constitutional ban on blasphemy well\nNo one has ever been prosecuted under the modern law British actor Stephen Fry was briefly investigated Hussein stupid God an Irish TV for NPR News I'm Joseph earning doubling\nA presidential election is also being held in the former Soviet Republic of Georgia there are twenty five candidates if no one gets more than fifty percent of the vote there'll be a runoff between the top two vote getters that is the last time the Georgians will elect a president by direct ballot the next president will be chosen by a delicate system\nAnd this is NPR News from Washington\nA month long assembly of Catholic bishops that the Vatican has ended with a call for women to have a place at the church's decision making table NPR's Sylvia Poggioli reports\nFinal document recognize the urgency of an inescapable change and called for a greater presence of women in church structures while respecting that the priesthood remains for men only\nThe final document did not maintain the expression el GB T that appeared in the preparatory paper conservative bishops from Africa as well as Philadelphia archbishop shawl ship who objected to its use\nShip who said there's no such thing as an algae beauty Catholic or transgender Catholic as if our sexual appetites defined who we are on sex abuse the bishops call for strong preventive measures to prevent any repeat of clerical sex abuse and call for stricter selection of priesthood candidates\nSo we ... NPR News Rome\nBut any repeat of clerical sex abuse and call for stricter selection of priesthood candidates so we ... NPR News Rome\nPresident Trump is declaring a civil war memorial in Kentucky a national monument camp Nelson will honor African American soldiers who served in the civil war\nThis is the first such a designation for President Trump he criticized national monuments and has reduced protections for to their ears national monument in Utah has been shrunk by about eighty five percent\nGrand staircase Escalante was cut by about half\nIn baseball the Boston Red Sox beat the Los Angeles Dodgers nine to sex and the fourth game of the world series last night Boston now leads the best of seven series three games to one game five of tonight in Los Angeles I'm newer rom NPR News in Washington\nSupport for NPR comes from NPR stations or their contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners who support this NPR station\nI on Chris daily hosted by from here are sometimes rockets sometimes poignant always excellent\nVariety show each week we fill your public radio tote bags tropic full of music and comedy for a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedian Todd ... Diana Gordon and the one the only Jeff Tweedy turn on\nTune in and drop off by Sunday afternoon at one central\nIs it Sunday baroque and like everything you hear on this station it's made possible thanks to generate support some listeners\nLike you have you heard the phrase helicopter parents well these are parents who hover around their children interfering in their lives and narrows mother ... was the original helicopter mother when she heard her husband emperor Claudia died she immediately launched a campaign for her son to replace it and then\nWhen he has returned alive after all she wanted\nTo poison him to prevent him from ruining her plans church Frederick handle used the dramatic story of deceit as the plot of an opera ... music baroque orchestra plays excerpts from handles ... [noise]\n\n\nKeep them on like Taco Bell music ... soprano Katrina go down in some highlights from George Frederick handles ... ... you are listening to Sunday broke\nOctober is your high plains public radio membership not every place you can't please do your part for your plains public radio station give on line and H. P. P. R. dot org\nThis program is\nPlease do your part for your plains public radio station give on line and H. P. P. R. dot org\nThis program is fun to think too generous ongoing support provided by the friends that Sunday baroque who's contributors include Dr Louis Stratford, Connecticut the DEA used her magic powers to help Jason and the arguments in their quest for the golden fleece in which case it'd be trade her\nShe used witchcraft to take revenge seventeenth century French church musician Marc Antoine ... on the street\n... supporting arts ensemble please some sharp on Kate McGee a\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\nMm\nChock full of music in comedy for a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedian Todd Barry guest position Diana Gordon\nAnd the one the only Jeff Tweedy turn on\nTune in and drop out by Sunday afternoon at one central [noise]\nThis is Ninety One point five KTLA ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nWe want to be sure that our Web stream always works and sounds right you can help by serving a signal monitor and reporting any trouble stage Pete PR to volunteer just email us ... H. P. P. R. at H. P. P. R. dot org\nThis is Sunday baroque I'm Suzanne bona [noise]\nIs coming up this week is an ancient times the occasion was up there on the eve of the new year time when the world as a living in the dead overlapped\nTricked in our goody bag what we are handing out into the musical treats such as the death of the few from Christopher looks opera about or for you\nTricked in our goody bag but we are handing out the the musical treats such as the death of the theories are picked up looks opera about or the U.S who ventured into the depths of the inferno to rescue him the love it [noise]\n\n[noise] live from NPR News in Washington I'm Louise gave only a loving people died Saturday in what authorities have declared a hate crime attack on a Pittsburgh synagogue\nThe victims range in age from fifty for two Ninety seven six were injured among them for police officers NPR's Sarah McCammon has more from Pittsburgh\nAuthorities have notified the families of those who were killed well worshipping a tree of life synagogue in Pittsburgh among them were two brothers in their fifties and a married couple in their eighties mayor ... spoke at a press conference where the victims names were released\nWe know that we as a society are better than this we know that hatred will never winnow the phones to try to divide us because of the way that we pray or where our families are from around the world will looms\nAuthorities say they're working to respect the civil and religious law as preparations are made to lay the victims to rest Sarah McCammon NPR News Pittsburgh\nThis aspect forty six year old Robert Ballard faces twenty nine federal counts he's scheduled to make an appearance before a federal magistrate judge in Pittsburgh tomorrow afternoon\nAmong the charges eleven counts of using a firearm to commit murder and multiple counts of hate crimes he could face the death penalty Bowers is in federal custody hospitalized with gunshot wounds from his confrontation with police\nSaudi Arabia is rejecting Turkey's request she's tried to suspects and the killing of Saudi journalist your mouth could show Jake and east temple and a Turkish court NPR's Peter Kenyon has more\nSaudi officials have acknowledged ... died in the Saudi conflict in the temple on October second but insisted crown prince Mohammed bin Salman had not ordered the journalist to be killed or kidnapped the Saudis have arrested Eighteen suspect and foreign minister Adel al Jubeir says his country will try those responsible and hold them to account\nPhotographic and other evidence appears to link several of its aspects to the crown prince and president rigid type aired one proposed trying them in Turkey the Saturday attorney general headed to turkey Sunday for talks with investigators Peter Kenyon NPR News Istanbul\nPresident Trump is declaring a civil war memorial in Kentucky at national monument for such designation is press that NPR's Nathan Rott reports that the president previously had used authority to scale back protections for some areas and the west\nTrump has been a frequent critic of national monuments during his tenure moving to shrink too that were stabbed by democratic predecessors\nBears Ears national monument the devil by President Obama in ... Utah was shrunk by about eighty five percent under Trump grand staircase Escalante created by President Clinton was cut by about half\nThe new national monument in Kentucky camp ... will honor African American soldiers in the civil war interior secretary Ryan Zinke you celebrated the move in a statement adding in a tweet that it's a site that can unite the American people may have been rod NPR News this is NPR\nBrazilians are catching their ballots today and a contentious presidential race\nNPR News this is NPR\nBrazilians are catching their ballots today in a contentious presidential race\nAt the yards Philip Reeves reports from Rio de Janeiro voters are expected to take a sharp turn to the ...\nPoll said the favorite to win ... a retired army captain from the far right to advise Brazil's pause miniature dictatorship\nHe voted at a polling station and really should NATO and was greeted by a crowd of supporters many waved Brazil's national flag some Charleston slogans celebrating his pledge to wipe out corruption\nThe election campaign has been marred by political violence and assume ... fake news\nWell it's not it was in a runoff against Fernando a diversion from the ... the the government Brazil for Thirteen of the last Fifteen Years and is now the target of much public anger over corruption crime and economic mismanagement does she says both are not always a threat to democracy votes to NATO pledges to uphold the constitution Philip Reeves NPR News reddish noodle\nLast night in Los Angeles the red Sox defeated the Dodgers Ninety six and game for the world series share it Springer of member station WBUR you are in Boston Celtic the red Sox are now one went away from the Knight World Series championship team history\nBoston travel by four runs before its role players parked in late inning rally at Dodger Stadium the visitor scored five ... in the ninth inning to secure the when within three to one series lead the red Sox had their first opportunity to clinch a World Series title tonight in game by\nShira Springer of member station WBFO you are of Boston takes it seriously to be there for the title since two thousand and four\nI'm Louis ... NPR News Washington\nSupport for NPR comes from NPR stations other contributors include American Jewish World Service working together for more than Thirty years to build a more just an equitable world learn more at age eight W. S. dot ORG and the listeners to support this NPR station\nSupport for high plains public radio comes from Amarillo College at Amarillo College faculty\nAnd staff are dedicated to the bleep that every student will succeed more at eight feet P. X. dot edu\nIt's a Sunday baroque\nWilliam Shakespeare is which is there anything ghosts are some of the most vivid and memorable supernatural characters and their midst yes and mayhem and figured prominently in his plots Thomas Lindley junior composed and food on the which isn't theories of Shakespeare with selections performed by the musicians of the globe\n[noise]\n\n\n\nHigh plains public radio would like to take this moment to express gratitude to all of the number of listeners who contributed to the wellbeing of these surveys over the past month\nThank you for taking H. P. P. R. so very close to the cool\nThings to another listener in Amarillo, Texas who has offered up a membership match to encourage others to join in and supporting public radio in the high plains help fill the gap and double your dollars at H. P. P. R. dot org thank you\nThis program is funded thanks to a generous ongoing support provided by their friends at Sunday borough who's contributors include the ... foundation and the shelling Family Foundation incorporated Antonio with all these ... nicknamed the night she'd probably be called the nightmare\nIt's movements have titles such as in tons of them said the dream mentally group breathe slow movements make this one of these more unusual sending concerto is set a RINO gets a loony performs with e ... [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\nI Know\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n... played the devils dance the comedians mess because the Mary clerk and to be\nThe legendary character Foust\nTreated his soul to the devil in exchange for knowledge in while accounting ... teeny didn't make ... bargain he did say\nThat the double came to him in a nightmare playing ability that chart teeny scribbled down as soon as he woke up this is just a teeny devils trail ... played by violinist Joshua Bell with her record is John Constable\n[noise]\n\nComedy for a long time favorites to new discoveries you didn't even know what you're worth looking for I Hope you'll join me this weekend for killer show with comedians talk very gifted fishing Diana Gordon and the one the only Jeff Tweedy turn on\nTune in and prop on by Sunday afternoon at one central\n[noise] this is Ninety One point five ... eighty nine point three ... a service of high plains public radio available everywhere at H. P. P. R. dot org\nYou can help ensure the reliable operation of our Web stream by serving a signal monitor to inquire or volunteer just email us at H. P. P. R. S. H. P. P. R. dot org or crawl eight hundred six seven eight seven four\nFour for its Sunday baroque I'm Suzanne bona\nBritish musician Nicholas Nikki can planned to study contemporary music and compose but he's required class and acoustic met in the home of a professor who happened to collect Eighteen century would wouldn't instrument\nBegun already played modern fleet so we tried out one of his teaching for real clues and it changed the patent is education and his career Nicholas thinking recently announced his intention to retire as music director of fill her ... today we're reviewing the remarkable career of the flu to the court is conductor and all around baroque music\n\nLive from NPR News in Washington I'm Louise given a shock and sadness in Pittsburgh and around the world\nAfter what is believed to be the most deadly attack on a U.S synagogue during worship services in history eleven victims were killed six more injured that suspect Robert Bowers is facing twenty nine separate federal criminal charges and could face the death penalty NPR Shannon advanced that had more\nVictims of the shooting rampage range in age from fifty four to Ninety seven they include wind married couple and two brothers during the course of the shooting official save our it's made statements about genocide and his desire to kill a Jewish people us attorney Scott Brady said prosecutors are treating the attack as a hate crime\nA hate crime as an individual is animated by a hatred or certain animals toward a person of a certain ethnicity religious faith and if\nIt becomes domestic terrorism where there is an ideology that that person has been also trying to propagate through violence and so we continue to see where that line is\nPowers just set to appear before a federal judge on Monday chanted and sent NPR News\nPresident Trump yesterday suggested that houses of worship like the tree of life synagogue in Pittsburgh squirrel hill neighborhood they have no choice but you have armed guards today the mayor of Pittsburgh William to do though disagreed\nI think the approach that we need to be looking at is how we to the guns which is the common denominator of every mass shooting in America out of the hands of those that are looking to express hatred through murder\nPseudo told reporters he doesn't live in a nation or city were armed guards are required for schools churches and synagogues he spoke on NBC's Meet the press and the caravan of Central American immigrants makes its way to the U.S border from Mexico there is a surgeon the number of honor\nAs a caravan of Central American immigrants makes its way to the U.S border from Mexico there is a surgeon the number of unauthorized immigrants being released from detention Texas Public Radio's David Martin Davies explains three\nA human but Alina shivering San Antonio greyhound bus or should she and her son were just released from a border patrol Alan\nSimpson Antonio Honduran citizens to hold his use of the books or she was much older your liver which is what's it called the ... out in the last part they separated from her son\nWas one of those middle several thousand immigrants were released over the coming days with racial\nSt Louis originally took force than those releases are due to the limits put on the white in action in Congress for NPR News I'm David Martin Davies in San Antonio\nTickets purchased in Iowa and New York match all six numbers and Saturday Night seven hundred and fifty million dollar Powerball jackpot drawing this is NPR News in Washington\nAmid a respiratory virus outbreak New Jersey health officials are reporting and nice death\nAt a pediatric rehabilitation center health officials say the child was medically fragile and had a confirmed case of adding a virus a total number of twenty five cases of the virus have now been identified with the previous jets all children and at least one young adult\nAnd gain forum baseball's World Series the red Sox beat the Dodgers Ninety six and Los Angeles last night Boston showed his trademark rage against scoring five runs in the ninth inning to err on the when the red Sox are now one went away from the Knight World Series championship and team history\nDetailed true share Springer of member station WBFO you are and Boston\nRed Sox role players provided the big late inning hit in game for it started in the seventh inning when pinch hitter Mitch more than ... three run Homer to right field Marlene sent the red Sox take pride in their debt and their ability to stage they come back\nWe're going to ground until the last about the last pitch and uh you know we've we've proven that all year we've had a lot of come from um wins you know we're we can we can throw a beginning together pretty quick\nWith a three to one series lead the red Sox have their first opportunity to clinch a World Series title tonight in game five at Dodger Stadium for NPR News I'm Sheera Springer in Los Angeles\nSometimes marketing is everything is a new Alabama minor league baseball team as discovered the Madison, Alabama based rocket city trash pandas have unveiled their logo raccoon lifting off in a trash can like rocket\nThey have merchandise requests from thirty countries I'm Louis ... NPR News Washington\nSupport for NPR comes from the three R E oh the polling enterprise digital transformation with artificial intelligence predictive analytics an eye on these illusions learn more at sea three I O T dot AI and the ... foundation at ... dot org\nSupport comes from turned center a nonprofit comprehensive therapeutic facility providing physical occupational and speech therapy for children of all ages online at turns centered dot org\n... Sunday broken like everything you hear on this station it's made possible thanks to generate support some listeners in Nineteen Ninety to Nicholas Mickey confounded the arcadian academy\nA chamber ensemble intended to focus on the lesser known musicians have music such as these airs by seventeenth century Italian violinist Nikola my pays\n\n\n\n[noise]\n[noise]\n\nSupport comes from palace computer center of Garden City with ever expanding sales and service for computer needs in southwest Kansas locally owned and operated\nFor Thirty years palace computers dot com\nI Am Christy Lee hopes to buy from here are sometimes raucous sometimes poignant always excellent variety show each week we fill your public radio tote bags tropical musical comedy for a long time favorites to new discoveries you didn't even know what you were looking for I Hope you'll join me this weekend for killer show with comedians talk Barry ... Diana Gordon\nAnd the one the only Jeff Tweedy turn on\nTune in and drop on Sunday afternoon at one central\nThanks to all of the member listeners who have played a part and sustaining the service there still time to show your support things to membership match from Amarillo, Texas hope H. P. P. R. fill the gap and to get your dollars doubled at H. P. P. R. dot org\nThis program is funded thanks too generous ongoing support provided by the friends of Sunday baroque who's contributors includes after Lewis piper a strap or Connecticut Nicholas begun played modern fluke but one of his professors\nCollected Eighteen century would wouldn't instrument and let them try a baroque fleet which instantly appealed to him Christopher hog would also happen to be an acquaintance and he invited me to join the Academy of music\nThis is one of the recording they made together it's Antonio Vivaldi concerto in secret to fluids played by flew to St Nicholas ... and Stephen Preston\n[noise]\n\n\nWhen\n\nWay to work with another way of [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nUm [noise]\n\n\n\n\nFlew to Nicholas ... even Preston the academy you think should music played on Tony has all these doubles concerto five thirty three\n... let's begin originally studied piano at trinity college of music in London but his work as an early music specialist means to me it's a lot of parts of court Nicholas Nikki can place a sweet from Johann Sebastian Bach I Know my ... new book [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n", "show_name": "Sunday Baroque", "year": "2018", "city": "Dalhart", "day": "28"}