{"month": "10", "state": "TX", "station": "KTDH", "content": "Be the poor for it we would lose out on so much it makes me sad to think of it ever going to lay\nThe great thing about public support and you don't have to do this for the shareholders because we're the shareholders so you're doing it for us You're doing it for yourself and not some nameless corporation\n[noise]\nThis is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can support public radio in your area by becoming a community sponsor and receiving frequent on air recognition for your support\nLook under the support debit H. P. P. R. dot org for details Mrs Sunday baroque I'm Suzanne bona [noise]\nRecording or is often the first instrument you introduce playing music\nFits into small hands and it's easy to make it sound on it but recorder is not um your child's toy recorder in the hands of a virtual player as a whole different animal exciting beautiful and impressive today's highlights including very accomplished grown up record ever to also playing a sonata by George Frederick handle [noise]\n\nLive from NPR News in Washington I'm joy ... Snyder President Trump says he will exit the landmark arms control agreement because Russia is violating the deal and\nThe treaty has prevented us from developing new weapons\nHas not adhere to the agreement so we'll go to Germany\nThe deal the treaty is preventing us from developing new weapons\nRussia has not had here today agreement so we go to Germany and we're going to develop their weapons if that gets hard and others get fired and they say let's not develop these horrible nuclear weapons I Would be extremely happy with that\nTrump spoke to reporters after a campaign rally in El loco Nevada as his national security advisor prepares to meet with Russian leaders in Moscow this week the BBC's John with Marcus reports on what's behind the decision\nConcerned about Russia's development of a missile system breaches the IMF treaty predates the Trump Administration but the U.S decision now to walk away from the agreement not significant setback for arms control many experts believe that the gas stations should've continued to trying to bring the Russians back into compliance\nIs they fit ... from the wind the unraveling of the whole system of arms control treaty does this help to cubs strategic competition during the Cold War\nThis was the ... treaty between Washington and Moscow China was not involved\nThe BBC's Jonathan Marcus reporting in Moscow today a top Russian diplomat says the U.S withdraw would be a very dangerous to\nJust by Mexican efforts to stop them at the border with Guatemala caravan of thousands of Central American migrants back on the move toward the U.S they resume their march at first flight this morning reporter James Frederick has been following the caravan\nI'm walking on the highway that leads north from the Mexican Guatemalan border and behind me are thousands of people from this migrant caravan Mexican police stopped them from crossing a bridge that connects Mexico and Guatemala\nSo the migrants to the river swimming or taking rafts across and police now instead of locking them have given them a police escort as they march north famous\nFrederick reporting there from the Guatemala Mexico border Afghans casting ballots in parliamentary elections for a second day today after voting was extended to accommodate people whose polling stations did not open on Saturday impairs the deed reports from Islam about\nHundreds of polling stations opened Sunday says I didn't get that chance because ... stuff simply didn't turn out likely because the Taliban and ISIS had threatened to talk of the elections and throughout Saturday there will dozens of attacks including a suicide bombing in all the I pay counted ... people killed\nThe first day of elections will also mocked by kale biometric systems what confusing to use and some stations didn't get ballots despite that over three million voters didn't turn up it will still take weight for official to tally the fights these elections are being closely watched as a dry run for a presidential race yeah\nHe had date NPR News Islamabad and you're listening to NPR News\nRescue crews are on the scene of a train derailment in Taiwan at least Eighteen people reported dead some one hundred sixty injured the train was carrying about three hundred people at the time as NPR's Anthony Kuhn reports\nThe ... express was headed to the east coast city of ... when it derailed in about five pm local time in northeast Taiwan's inland county the line has been in operation since twenty Thirteen the trains were imported from Japan\nPhotos from the scene show several train cars lying on their side in his exact pattern\nSoldiers were mobilized to help with rescue efforts including helping dozens of passengers trapped inside the train the injured were taken to several local hospitals in service on the line was suspended in both directions many of the fatalities were reportedly due to cardiac arrest Anthony Kuhn NPR News Beijing\nSecretary Steven Mnuchin says it is premature to comment on any possible us sanctions on Saudi Arabia over the death of journalism ... and ...\nSteven Mnuchin says it is premature to comment on any possible us sanctions on Saudi Arabia over the death of journalism ...\nAnd who should spoke with reporters in Jerusalem today as part of a six nation Middle East tour to address terrorist financing you met with Israeli prime minister Benjamin Netanyahu is us prepares to\nReimpose sanctions on Iraq a couple of big lottery jak costs will be up for grabs this week a day after the huge mega millions jak pop went without a winter\nThere's also no grand prize winner in last night's Powerball drawing the Powerball jackpot now estimated to be around six hundred twenty million dollars for Wednesday's drawing the next mega millions drop will be on Tuesday for record breaking one point six billion dollar grand prize\nOn trial Snyder NPR News\nSupport for NPR comes from NPR's Beijing other contributors include Jones Day and integrated partnership collaboratively providing legal services for more than a century forty three officers five continents Serbian clients as one from worldwide learn more at Jones Day dot com\n[noise]\n\nAnd then the ... of classical guitar along music from ... opera Carmen in the form of a guitar concerto I Am Toni Morrison joined me for this week's edition of classical guitar along the tree and Peter ... Carmen concerto that this week on classical guitar alive [noise]\nSunday at noon central [noise]\nThis is that they broke me topical things to generous listener supported this station the Greek mythological character he be it's usually get picketed statues and\nPaintings holding a picture or godly\nShe's the goddess of youth and the daughter of juice inherent in her main job was to pour the nectar and serve the ambrosia into the golden drinking cups that the guy that would be a banquet he was also the star of ... feast William Christie in late ... flourishing arts ensemble\nLike some of the music from it [noise]\n\n\nWilliam Christie led leads are flow resent the flourishing arts ensemble playing a sweet from jumping the round those opera TB feast it's about the mythological goddess of youth and spring time you're listening to Sunday borough\nSupport comes from chamber music Amarillo presenting the gym Laughlin quartet for the jazz on six series friday October twenty six eight PM at the Fibonacci more information at C. M. A. M. A. dot org this program is funded thanks to a generous\nTwenty six eight PM at the ... more information at C. M. A. M. A. dot org\nThis program is centered thanks to a generous ongoing support for friendship something around who's contributors include the ... foundation and the shilling Family Foundation incorporated ... if you think of reporter is just a child's toy or beginners musical instrument think again there are some nominal record player to\nBust that stereotype Dutch musician Marianne ... has an international career as a virtuoso recorder player and the teacher and mentor for the next generation of instrumental is this is Mary interpreted playing George Packer candles another number nine to ... and ...\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\nMm\n\n\n\n[noise] [noise] [noise]\n\n\nNa\nNa na na\n\nNa na\n\nMm\n\n\nFrom their CD ... acronym played to sonata by German organist and composer Johan Philip Krieger whenever ... music students would you had ...\nHe was a prolific composer of more than a hundred sacred works for opera in a wide variety of instrumental music ranging from intimate cheaper works to larger ensemble music can pet study Mari plays a sinful nearby you'll hunter predicts by\n[noise]\nFor saw the war in treaty Mr Gabriel ... [noise] Sunday afternoon at one central\n\n[noise] this is Ninety One point five ... eighty nine point three Katie de ... service of high plains public radio available everywhere at H. P. P. R. dot org\nYour business or organization can gain greater public awareness and the appreciation of listeners by becoming an underwriter up high plains public radio who's ... H. P. P. R. dot org and look under the support for details\nDoes this Sunday baroque I'm Suzanne bona [noise]\nUnited Nations was founded in Nineteen forty five in each year had occasion celebrated on October twenty fourth in honor of un day Sunday ... opera multicultural collection of musical ideas including charming English major bills flute sweet by a mystery\nIn honor of un day Sunday ... opera multicultural collection of musical ideas including charming English major bills flute sweet by a mystery Frenchman concerto by Philip tell them on that was partly inspired by polish folk music [noise]\n\nLive from NPR News in Washington I'm Barbara Klein\nRussia is threatening to retaliate if President Trump withdraw from a Cold War era nuclear weapons agreement Trump said yesterday he intends to terminate the Nineteen eighty seven intermediate range nuclear forces treaty accusing Moscow of violating it for years the b._b._c. ... for reports\nRussia is calling a unilateral withdrawal from this treaty by the United states unacceptable under dangerous\nThe deputy foreign minister and they've made basis of President Trump's accusation the Russia has long been violating the INS treaty by testing ... nuclear strike in Europe giving the targets next to no time to respond\nTo cough described the U.S pulling out of the ... treaty as a form of black male but if you sat there will still room for dialogue to reduce American can son\nGermany's foreign minister says Russia needs to address allegations that it's violating the treaty but he calls Trump's decision to pull out of it regrettable in eastern Congo militants rebels have killed to health care workers\nManning an entry to an area that's at the center of in a bowl of outbreak NPR's Eyder Peralta reports\nControlling the bailout break in eastern Congo has been hard because it is in the middle of a conflict zone with many armed groups and health ministry says the local militia attacked two members of Congress was rapid intervention medical unit health workers have had a tough time vaccinating against the disease\nBecause of persistent rumors that they are spreading you pull up and harvesting Oregon\nLast week a group of young migrants ... the body of a friend to find out if it was intact\nAfter negotiation they agreed to re bury the body and be vaccinated against Ebola because they had handled been infected court meanwhile attacks by the Islamist group a BF have continued this weekend of the group killed Thirteen people in a town at the center of the outbreak in prop up NPR News Nairobi\nSome Afghan voters have another chance today to cast ballots for a new parliament as Jennifer glass reports from Kabul yesterday's vote was marred by violence and disorganization\nDoesn't mean we used to voting boosted this ... it's one of the dot four hundred polling centers around Afghanistan hoping for a second day because technical difficulties poor management and violent kept some at against the poll Saturday to hit ... skeptical that this election will be better than previous one marked by corruption\nJust for the responsibility I came here to vote but I don't believe the government that there were counted\nAccurately the government has announced it's a wreck and dozens of people including police for fraud and interference in the election to death is seen as crucial to the country's young democracy for NPR News I'm Jennifer lack in Kabul\nThis is NPR\nThan a thousand Hondurans are leaving a migrant caravan bound for Mexico in the u._s.\nNPR\nMore than a thousand Hondurans are leaving a migrant care of them down from Mexico and the U.S to return home after being stopped at the Guatemala Mexico border thousands of others have made it into Mexico and are now heading toward the U.S [noise]\nUs immigration and Customs Enforcement has dramatically reduced its use of federal prisons to house detainees Oregon Public Broadcasting's Conrad Wilson reports only three ice detainees remain across the five prisons that once held hundreds of immigrants in early June\nIce announcer would sending up to sixteen hundred immigrant detainees to federal prison in Texas Oregon California Washington in Arizona\nBut now a total of only three ice detainees remain are being held inside the federal prison in Sheridan, Oregon a spokeswoman for I said the use of federal prisons with a temporary measure demanding as an immigration attorney in represents the three remaining ice detainees\nIt was an abject failure of government policy years the federal prisons um forwarded the detention of asylum seekers\nMany of the detainees center president were seeking asylum and weren't facing criminal charges that might have been released on bail others deported or sent a private detention facilities grumpy our News I'm Conrad Wilson in Portland\nResearchers have announced a new drug combination that helps women with a particularly deadly form of breast cancer live\nLonger it harnesses the body's immune system to help fight the disease I'm Barbara Klein NPR News in Washington\nSupport for NPR comes from NPR's Beijing other contributors include T. R. A. C. I. A. is committed to helping those who are driven by purpose reach their definition of success investing advice banking retirement learn more at G. I. A. dot org\n\nSupport for high plains public radio comes from Amarillo College at Amarillo College faculty and staff are dedicated to the belief that every student will succeed more at a C. T. X. dot edu\nThis Sunday baroque made possible thanks to your support of this station Francois shows on was a French musician whose career flourished in the early Eighteen century but not\nMuch else is known about him he wrote a bunch of sweets in Seventeen Seventeen and there's a CD of them featuring recorder player Alison Melville this is from flash of owns sweet number nine\n\nPublic radio is so much more than just a radio station it's fifty years of beating the odds of it is fifty years of not depending upon advertising or catering to views of big corporations\nNPR is a legendary nonprofit organization that exist because you deserve to be more than just entertained for over fifty years public radio pioneers have worked together and still do to power public radio\nFor Sunday borough comes from the word Family Foundation since Nineteen Ninety five providing art grants and your community and across America including gauge Academy of art\nIn Seattle, Washington on line at ... dot org German musician character will tell them on deserted Poland and was so impressed by the music and musicians he heard there that he tried to imitate polish ...\nInto some of his own music [noise] this is one of ... polish concerto played by rebel baroque orchestra [noise]\n\n\n\n[noise]\nJune fourth through eleven twenty Nineteen online that John Moriarty Institute dot org losing this chronic finally recently released a terrific recording called the Celtic lewd and it includes these two traditional Irish ...\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise] Mm [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\nMhm [noise]\n\nMhm [noise] [noise]\n[noise]\n[noise] [noise]\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\nThe\nDa da\n\nDa da\nDa da da\nDa\n\n\nDa\nDa\nDa\n\nDa\nDa\n\nLuge ... please Monaghan Jake and the kid on the mountain a pair of traditional Irish T. C. included on his new CD the Celtic luge known as the father of Swedish music and the Swedish handle Johan ... was the first major Swedish composer\nHe played violin and although staged public concerts and led the royal work has dropped in the early Seventeen hundreds\nRemind also wrote wealth ... said he dedicated to clean it will be cut alien nor I this is number nine played by flu just ... Fisher\nRemind also real wealth to notice that he dedicated to clean ... alien or not this is number nine played by sweetest ... Fisher\n[noise]\n\nA guitar concerto I'm Toni Morrison joined me for this week's edition of classical guitar along the dream fetal brain there's Carmen concerto that this week on classical guitar alive [noise]\nSunday at noon central [noise]\n\n[noise] this is Ninety One point five ... eighty nine point three Katie de ... uh service of high plains public radio available everywhere at H. P. P. R. dot org\nIf you appreciate having public radio service available as a Web stream and please thank him patronize the community sponsors you hear mentioned on the air who helped cover the direct cost of operation thank you\nIt's Sunday baroque I'm Suzanne bona [noise]\nWhen did write books to who they got the job is working at the St Mary's church and knew that his predecessor was from singer who died\nAs was expected to who married ... daughter and near the end of his career there are a number of musicians visited booked who did to scope out the job and decide whether they wanted a chance to be the successor\nThe man was exceeded him after his death was Johan cheaper decker and yet he married book to his daughter coming up music by all three men as well as one of those other musicians who visited [noise]\n\nLive from NPR News in Washington on Barbara climb President Trump is signaling a potential return to a Cold War style arms race NPRs Amy held reports Trump announced the U.S will withdraw from a historic treaty with Russia the band short and intermediate range nuclear land base missiles\nThe intermediate range nuclear forces or ins treaty says quote nuclear war would have devastating consequences for all mankind it was considered a critical step into fusing Cold War tensions when president Ronald Reagan and Soviet leader Mikhail Gorbachev signed it in Nineteen eighty seven\nNow three decades later President Trump says the U.S is pulling out Russia\nIs violated the minute they been violating it for many years Trump\nAds now the U.S will have to develop those weapons unless China which has been producing its own arsenal unchecked and Russia agreed to halt their programs Russia's deputy foreign affairs minister says a U.S withdrawal would lead to retaliation Amy held NPR News\nA procession of thousands of Central American migrants is still trying to reach the U.S even though many Hondurans who have been stopped at the Guatemala Mexico border are now returning home others have crossed into Mexico by swimming or rafting Emily Green reports from the border area\nAround four thousand mostly Hungarian migrants reach the Mexican border this past week but they couldn't get in and had nowhere to go now municipal officials into Qunu mind say about twelve hundred have signed up to return home they include twenty seven year old John as far as\nWe walk outside and so now might have gone on says they couldn't reach the American dream which they all wanted to turn around because it's situation here is really tough\nThe Guatemalan government is providing free transport for the hundred migrants still the caravan continues more than a thousand migrants appear to have made it into Mexico and are going\nTransport for the hunger and migrants still the caravan continues more than a thousand migrants appear to have made it into Mexico and I'm going to start that journey north for NPR News I'm Emily Green they've grown Oman Guatemala\nJordan says it will not renew Israeli leases on two tracks of land along the country's border the leases are part of a Nineteen Ninety four peace agreement NPR's Jane raff reports Jordan's King Abdullah says he now wants full sovereignty\nJordan state news agency quoted King Abdullah saying he had decided it was in the best interests of Jordanians to end the elites agreement the two areas how poor end up I'm or or a few square miles of agricultural land used by Israeli farmers\nThe lease agreement expires in less than a week and Jordanian members of parliament as well as protesters have urged the king not to renew it some have also called for Jordan scrap the entire peace treaty\nJordan though has made clear it is committed to the peace agreement with Israel Jane Arraf NPR News Amman, Jordan this is NPR\nAfghans are casting ballots on a second day of voting in parliamentary elections Afghanistan's first in eight years voting was extended after staff failed to show up at some polling stations yesterday because of violence dozens were killed yesterday\nAn unnamed seniors Saudi official has provided provided Reuters news agency a new account of how Washington Post contributor Jamal 'cause show gene died inside the Saudi consulate in Istanbul this month\nNPR's Peter Kenyon reports the official says a Saudi team sent to confront showed ... threatened to kidnap him then put them in a chokehold before he died\nThe Saturday explanation of what happened to show that he has changed multiple times in this latest version and official denies that the journalists body was cut up inside the consulate saying instead that it was rolled up in a carpet and given to an Istanbul residents described as a local cooperate or\nFor disposal the officials said the teams that from Riyadh to bring a show back to Saudi Arabia\nBegan to threatened and use violence against him almost immediately into job she was in a chokehold with the hand over his mouth before he died\nPresident Trump and European leaders voiced skepticism about the shifting Saudis storylines and are demanding clear answers as to what happened\nPeter Kenyon NPR News Istanbul\nThe match up for baseball World Series is set the Los Angeles Dodgers will face the Boston Red Sox the Dodgers beat the Milwaukee Brewers last night five to one to win the national league pennant I'm Barbara climb NPR News in Washington\nSupport for NPR comes from the Rockefeller Foundation promoting their wellbeing of humanity throughout the world since Nineteen Thirteen more about Rockefeller's work and food health power jobs and resilient cities at rock found dot org and Americans for the arts\n\nMy I'm Christie early host of life from here [noise] you know they say this country has more divided than ever but there's one thing we can all agree on the people just mentally I Hope you'll join us for a glorious evening of music and comedy that just might bring us a little closer together during the Saturday for a\nLive broadcast from a Fitzgerald Theater in Saint Paul Minnesota with the game for Assad the war in treaty Mr Gabriel ... [noise] Sunday afternoon at one central [noise]\nHello my name is Kerry nor and I'm from ... it's fun to travel and find those public radio stations as you go along and you see huge one\nYou know work and I'm from Amarillo, Texas it's time to travel and find those public radio stations as you go along and you see each one is a community that's not fair to Bob artificial why it is a huge listening audience in a huge gimme energy\nNon [noise] limited in any way [noise]\nBy the lines were drawn in my [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\nAcademy for each in music played the premier hunter my Johan Christiana she for decker\nBerlin academy for ... music played the premier concert like Johan Christiana Schieffer decker you're listening to Sunday borough\n\nSupport comes from turn center a nonprofit comprehensive therapeutic facility providing physical\nThis program is funded by the fringe of Sunday brew who's contributors include Dr Louis piper is Jeffrey Connecticut\nJohn Halloween plays a baroque violin with guts strings and a special bow\nYou also prefers to use autograph manuscripts of the music he played so he can learn from the composers locations handwriting and he researches the historical context of the music so it can inform and influence is playing this is John Elway playing a sonata by ... books to who do\n[noise]\n\n... ... ...\n\n...\n\nUh\n\n\n\n\nOh\nThe\nSchool and no\n\n\n\n\nOne's\nName is\n...\n\n\n\n...\nWhat\n\nIs it in a\nIn some in the\n\n...\nReally\nCool [noise] [noise]\n[noise] Mm\n\n\n\n\n\n\n\n\nAlexander ... temple were bought out with counter tender Matthew White singing them okay here all my savior by from under it's more about the music on our website Sunday baroque dot org\nIf your car is having trouble holding up now is a great time to donate it to the H. P. P. R. vehicle donation program you'll make extra space in your garage for that new car you've been thinking about getting started today at H. P. P. R. dot org [laughter]\n\nI'm In the nation of classical guitar along music from ...\nIn the form of a guitar concerto I Am Toni Morrison joined me for this week's edition of classical guitar along the tree and Peter breeders Carmen concerto that this week on classical guitar alive [noise]\nSunday at noon sexual\n\nSunday baroque has supported by Sacred Heart university helping students\n\nCindy British supported by secret huh university helping students ... full potential and become leaders in their fields but flexible fooling part-time undergraduate and graduate programs Sacred Heart now do you\nHow can she doesn't she when they were students at the Juilliard School in New York Greg Anderson and Elizabeth joy wrote forget piano do you have a dynamic an\nAnimated style of performing and they can share it with a number of music videos of their collaboration is even heard any nomination if you want to check out their videos there's a link to their YouTube channel on today's plea must pay well this is Anderson in role playing their own suite for two pianos on Johann Sebastian Bach see ...\n\n\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n", "year": "2018", "show_name": "Sunday Baroque", "city": "Dalhart", "day": "21"}