{"month": "10", "state": "CO", "station": "KRCC", "content": "Seems like a fantasy world or something in an area I'm Ari Shapiro in Michigan with views of the economy and the midterms this afternoon on all things considered\nFrom NPR News [noise] all things considered today at three thirty pm on\nNinety One point five to your C. C. programming on Ninety One point five kill your cc is supported by monument occupational medicine working was injured workers and employers dedicated to helping employees returned to work with comprehensive medical care drug screening and beauty exams and pre and post\nWas injured workers and employers dedicated to helping employees returned to work with comprehensive medical care drug screening and beauty exams and pre employment physicals monument OCC med dot com\nThis southern Colorado's NPR solution to your cc ... Colorado Springs ... hunter ... M. T. W. CCF them would import\n[noise]\nOver ten million people have already voted in this year's midterms\nThey a lot of people are looking for change ah this is just way too much changes have you made because I'm making sure I can vote just to get a head start on the road I Want and I both became I decided\nTo come early ... who's discrepancy [noise] I Would have time to resolve\nBut does it early voting surge mean we're going to have a huge turnout overall for his all this energy and the lead up to the election going to allow and what can you tell us about who's likely to win more people are participating in this in the bulk of those overwhelmingly or people who are shifting their voting from election day to earlier\nThan average turn out right there will be the highest we've seen in the last century there's no\nHistorical precedent for that politics with me Amy Walter on the take away\nCounting down to the twenty Eighteen mid term elections we'll be right back after these headlines [noise]\n\n\n[noise] live from NPR News in Washington on Lakshmi Singh authorities have a suspect in custody and their investigation into potentially explosive devices\nAddress to critics of president Donald Trump this week he's identified is fifty six year old says are say out of Davy Florida authorities describe him as a registered Republican with a lengthy criminal history\nTelevision images from plantation Florida show federal and local law enforcement putting a blue tarp over white van and hauling it away today\nAt least a dozen suspicious packages some confirmed to be crude pipe bombs were intercepted it male facilities homes and offices in Florida California Delaware Washington DC and the New York city area NPR's Miles parks has more on the investigation\nNone of the packages which was thought to be homemade pipe bombs reached any of the people they were address to and most were caught and transit\nThe first one was found Monday at home a billionaire liberal donors George Soros over the next few days packages were found a dress to former president Brock Obama former vice president Joe Biden and former Democratic nominee Hillary Clinton among others to more found today addressed a democratic senator Cory Booker and former director of national\nAnd former Democratic nominee Hillary Clinton among others to more found today addressed a democratic senator Cory Booker and former director of national intelligence James Clapper it's still unclear how functional homemade bombs could have been for law enforcement says are treating them as lived devices Miles Parks NPR News\nIn a measure tone at the White House a short time ago President Trump told and enthusiastic gathering of young black conservatives there is no place for political violence\nMarsh never allow political violence to take root in America come up with a half and I'm committed to doing everything in my power as president to stop it\nBut today Trump did not react to calls from across the political spectrum to take the lead as president and tone down the inflammatory rhetoric against his political critics and the press\nWhich he still accuses of spreading fake news one of his biggest target CNN was among those who received suspicious package this week\nDefense secretary Jim Mattis is authorizing the use of hundreds of troops and other military resources at the southern us border with Mexico\nThis is a caravan of Central American migrants continues its journey northward from southern Mexico thousands of men women and children are in the care of and UNICEF warns that many of the estimated twenty three hundred children are suffering from lack of clean water health care and sanitation Lisa ... is in Geneva she reports a journey is long and dangerous\nUNICEF reports the Central American refugees and migrants are suffering from dangerously high temperatures and lack of basic services many are dehydrated and Neal many are seriously traumatized\nUNICEF says people in the caravan of putting up with these harsh conditions because violence and poverty at home are even worse\n... reporting at last check on Wall street the Dow Jones industrial average was down more than a hundred points at twenty four thousand eight hundred eighty to this is NPR News\nMikhail Gorbachev last leader of the Soviet Union is criticizing the Trump administration's withdrawal from an arms control treaty that Gorbachev signed with President Ronald Reagan in Nineteen eighty seven and NPR's Lucian Kim has\nMoscow in an opinion piece published in the New York times become Gorbachev says the intermediate range nuclear forces or ins treaty paved the way for drastic reductions in nuclear arsenals of the United states and Russia now Gorbachev writes the US's destroying the entire system of international treaties\nThat served as a foundation for peace and security since World War two\nNow Gorbachev writes the US's destroying the entire system of international treaties that served as a foundation for peace and security since World War two ... says he isn't giving up hope for negotiations to save the treaty and that Russia in his words will take a firm balanced and Lucian Kim NPR News Moscow\nThe world series shifts to Los Angeles tonight for game three the Boston Red Sox hold a two to nothing series late for member station WBFO our shores Springer reports Boston it's been playing strong\nThe red Sox arrive in Los Angeles riding a five game road winning streak during the playoffs they have clinched series wins in New York and used an outfielder Andrew been attendee says where the red Sox play doesn't affect them much\nTo rip off anything regardless of where we employ\nFight U.S forces so far this was postseason [noise]\nTo be a little warmer out there so overnight\nThe Dodgers will be looking to rebound from too tough losses in Chile Fenway no history favors the red Sox winning the world series teams that takes two to nothing lead in the series go on to win the championship nearly eighty percent of the time for NPR News I'm Shira Springer\nAnd I'm Lakshmi Singh NPR News in Washington\nSupport for NPR comes from NPR stations\nOther contributors includes Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes a super super will learn more at ... dot com\nNinety One point five K. R. C. C. and Dr Lorrie ... have created the legacy find to help thoughtful generous listeners fulfill their philanthropic goals of ensuring public radio for future generations please consider the K. R. C. C. legacy fun when thinking about your state planning\nYour legacy gift will help Ninety One point five K. R. C. C. provide programming that informs educates entertains ended Rich's southern\nColorado for years to come more at K. R. C. C. dot org\n[noise]\n\nElection day is less than two weeks away but lots of people have already cast their ballots all the Thirteen states have some form of early voting this year and as a for earlier this week more than ten million people have already voted early\nMy name is ... I'm twenty four years old and a few surface I'm voting early hoping to avoid lost\nVoted early [noise]\nMy name is ... I'm twenty four years old and up in Houston, Texas I'm voting early hoping to avoid long lines but that did not end up happening today about ... [noise]\nSixty five from Macon Georgia in my daddy bought in the second World War and he told me every time the ballot by putting on your\nFifty five Macon Georgia I Want him ...\nHarris County Texas which includes Houston more than a hundred and eighty thousand voters had already cast their ballots in the early this week the voting rights on par with presidential election day grace Senator Ted Cruz facing off against democratic or ruin the why vote early ... Seventy five\nOh because my husband insists I'd much prefer to go the normal by and see all my friends\nThat honest enough for Christmas and Williams\nAnd my age of forty six\nCarolyn box nine Fifteen nine we always do it together\nEspecially for the algae reaching community Trump the Trump Administration has been rolling back a lot of protection of civil rights are certainly using a says red meat\nRowan Miller ... just to get a head start on the road I voted the certain Republican Party certainly\nScreen I'm twenty four and I'm going to Isabella pillow\nTo be some of the madness and get it done with race or ...\nFeet the crowd this year's elections are important because I think there's a lot of flux going on in the parties and what they stand for and what individuals fan for those parties and I think that the votes of some level some signals\nStephen King\nSixty six we voted early\nFor Twenty years fought\nMembership in order to\nDo the other one can be felt over in Georgia to in the first week of in person early voting over four hundred and eighty thousand votes were cast in the state three times as many as ... to this point the twenty four team some occasions have had three hour in line that didn't deter voters and making an hour and a half south of Atlanta\nThey're states governor's race between Democrat Stacey Abrams and Republican Brian Kemp is on many voters mind\nA two years ago and so you know as we look at news events you know I don't know the caravan I guess and and the Republican messaging on that or or the president claiming he's going to issue a new tax cut things that we think might have some persuasive power over\nOver voters we should remember that a significant number of votes had been cast before those events take place and\nI think that that's something that twenty sixteen should be instructive on and give us a bit of caution of assuming that the that the entirety of the electorate is thinking the same about both candidates on on October twentieth as as they are November sex\nWe have to take a short break more with Michael McDonald and Sasha Eisenberg coming up this is the takeaway\nNinety One point five K. R. C. C. can be with you wherever you go oh you need is your Android device or I downloaded the free Ninety One point five K. R. C. C. mobile out\nAt Google Play or the ... or just search for K. R. C. C. [noise]\nHey everybody this is really the faucet this is Krista hello this is Michael from from spirit we seem to Ninety One point five K. I. C. C. music seven PM didn't need Ninety seven Ninety three\nNPR on Ninety One point five ... your cc is supported locally by pikes peak hospice and palliative care is annual tree lighting ceremony November seventeenth at five PM at the Colorado Springs pioneers museum to honor a loved one with the symbolic light on a tree and an ornament more types ... or\nBy springs homes dot com realtors Joe and Jennifer boiling leverage their team myriad social media and the tools of technology as they work directly with their clients for both buying and selling homes details at springs homes dot com [noise]\nAirbags with politics with Amy Walter on the take away we continue our look\nAt the historic levels of early voting this year with Michael McDonald can Sasha Eisenberg [noise] Michael Sasha disagreed about the importance of the early vote tally that's far which Michael told me is exceeding presidential election levels in some places [noise] but we've heard about the importance of early voting before\nLike say the twenty sixteen election they ask about the danger of misinterpreting the pre election day but you know a lot of the public face in data\nSasha about the danger of misinterpreting the pre election day\nYou know a lot of the public facing data will see the party registration of people who have already cast ballots the race or ethnicity in some states we should not assume that those are monolithic groups not everybody who was registered as a Democrat in Florida or has a history of voting in the Democratic primary as state\nIs going to cast the ballot for Hillary Clinton over Donald Trump prefer given Democratic Senate candidate over given Republican candidate so just looking at you know who's winning in terms of more registered Democrats are registered Republicans cast\nBallots has all the problems are that you could infer the author anymore keeping in mind especially with twenty sixteen is\nHow late movement in an election intersects with with early vote so you know the second call me a letter came out right around this time two years ago\nAnd so you know as we look at news events you know I don't know the caravan I guess and and the Republican messaging on that or or the president claiming he's going to issue a new tax cut things that we think might have some persuasive power over over voters we should remember that a significant number of votes had been cast before those events take place and\nI think that that's something that twenty sixteen should be instructive on and give us a bit of caution\nAnd Michael is there a difference between people who show up to vote early you have states that allow you to come and vote at a certain location before election day versus those states where you can vote via the mail you get an absentee ballot sent to you\nRight so when we first respond to that question that you just posed which is the election forecasting question and a weekend before the election and twenty I'm sixteen I didn't and also some of the early vote in the streets where we're we're getting higher early voting numbers\nAnd um get by and large we correctly predicted it was going to happen under twenty six you know Russia Nevada Colorado where we get very high levels of early voting\nA perfectly protected do as a stage and then our correctly predicted how Trump would have to win the election which was you would have to when I Want a nice little on early voting states like a Pennsylvania Michigan or Wisconsin He ended up running all three of them on but again I I I think there's some\nValue in the signals that we're getting from the early voting data and that really plays into the the question that you asked me which is that um yes there are actually on the differences in the way in which people participate or Republicans tend to vote by mail but it's not a universal truth the Democrats tend to vote in person early and there's this\nTend to vote in person early and there's there's a this pattern that you see in the early vote on as you get closer to election day that's why I'm saying what else I'm not drawing ... says about what's happening here I think by the end of next week once we get the in person early voting in an in numbers states will be able to tell what's happened\nSocial what about early vote and the impact on some underrepresented groups thinking about voters of color or younger people are people who maybe aren't frequent voters is there any evidence or anything that you're seeing in terms of campaign strategy\nThat is aimed at using the early vote to get those voters engaged in the election\nDefinitely democratic campaigns that that are focusing either mobilization strategies see early voting as far more friendly to the to the sort of lifestyles and calendars and\nYou know are developing refining get out the vote tactics there's been a sort of culture of of plan making which is a tool that that comes out of uh the behavioral science is get people to visualize how they're going to get to the polls what time they're going to go how they're going to get there\nUm some campaigns calling people back or sending them a reminder of the plants that they had made as more sort of paths open up for people to vote\nThe thinking is that it it it's more conducive to the lifestyles of of people who may have multiple jobs are are going to school at odd hours you know and I think that there are a lot of opportunities with very targeted digital advertising to take advantage of of the sort of\nLonger window and the knowledge in some cases about who's voting who hasn't to run really tailor campaigns at the voters are still outstanding\nAnd Michael if you can you know kind of think into the future down the road maybe ten years or more is this what we're going to be done in that election day itself is just one day on the calendar and that majority of people voting in this country are going to vote before the election even happened\nAnd and that's the way we used to build a long time ago back\nBefore Eighteen forty five and we said each day after voting\nElections were over ... days and that was to allow people the opportunity to travel\nFrom rural areas and too much county courthouse to vote on and so on this has nothing to do we add it for a long time in our history of our country and then we started doing it for a while and we started having it again starting the Nineteen seventies onstage started would want us there and there\nAre early voting laws to permit first on no excuse absentee voting members are permanent absentee voting and so many um\nVoters were voting by mail in states like Oregon and Washington\nVoting that we saw permanent absentee voting and so many um\nVoters were voting by mail in states like Oregon and Washington that George Bush was there\nJust sort of threw up their hands and said why are we having these polling locations open they're very expensive but it's just moved on the ballot elections and so on that trend started out west a and now we've got three states you hold on a male founded elections we've got a California are\nComing on line with an option for the Allen Institute as their suggest runs this time around but like twenty twenty we should say many counties in California they're mail ballot jurisdictions places like New Jersey and ah and toward it you know two states that I Would say that we're going to see more and more male balloting and\nThat's going to against gene eventually again to perhaps on mail ballot elections you can go to a vote center or you're\nSort of like a Super Bowl and were patient and a and vote in person that you wish to do so so it's not quite just a\nAn all male about elections the\nOther innovation that's happening in West Virginia there were no traders are allowed to buy an app\nOn and so will monitor and see how that works this time around um but that's most were voting innovations have come through the military first so on that something needs to be looking for in the next Twenty years to other states stern adapting adopting a a a an\nApp for ah for military voters and and do they start offering that option a to a domestic civilian voters as well\nMichael Sasha thanks so much for joining me thanks aiming to Michael McDonald is a professor at the University of Florida and founder of the U.S elections project and Sasha Eisenberg is author of the victory lab [noise]\nComing up this hour there's no historical precedent for that we had never seen before we'll hear about how huge sums of money in the here's elections are affecting early voting and voter turnout also look at whether Trump supporters will come out in large numbers when the president he's in on the bottling\nYou've seen as numbers bounce around a little bit I think he's you know he's negatives aren't that much different than they were when he won that election but now obviously it's a different context is talking about him interim election we're not on the ballot\nAnd what's happening in states like Georgia what questions about voter purges Britain disenfranchising thousands of voters all that and much more this hour this is the takeaway\n\nDisenfranchising thousands of voters all that and much more this hour this is the takeaway [noise]\n\nOh well the next fresh air but talk about Lou Reed with music critic Anthony to Curtis author of a biography of read no out in paperback\nWho lives in Texas and there are a lot of Republicans who live in Texas and Lena Schneider's campaigns reporter for Politico [noise]\n\nThis is the case for Lori Cohen charitable trust\nMy good friend Dr lord Cohen asked me to help finish some task for her lawyers gift to the care CCD legacy fund helps perpetuate knowledge and understanding of the world she so cherished she would encourage others to join her in this effort to help make the community she loved and lived in a better place\nInformation on the ... sea legacy fund can be found at our website cures the seat daughter war gee\n[noise] [noise] [noise] [noise]\nSo far posters and pundits are looking at the large early voting numbers as one indication of the energy on the left and on the other side president Donald Trump has been hitting the campaign trail hard to keep his base fired up\nAnd these are also the reasons why it's so important for each of you [noise] did you want\nAnd vote yet out [noise]\nNow if you're going to vote Democrat don't bother [noise]\nPresident Trump's and not on the ballot and so the question is will the enthusiasm at his rallies translate to Republicans up for election this year\nPresident certainly hope so he's already held more than a dozen rallies this month including one earlier this week in Wisconsin the state he won by a single point twenty sixteen\nThey're great guys got a bone is an extreme liberal named Tony Evers [noise]\nRepublican Governor Scott Walker isn't a tight race against Wisconsin school superintendent Tony Evers\nRepublican Governor Scott Walker isn't a tight race against Wisconsin schools they bring tended to Tony Evers [noise]\nSo don't\nFor Scott Walker\nWhatever the outcome of the election this fall in that people would look to it as a bellwether for twenty twenty I spoke with Craig Gilbert the Washington bureau chief for the Milwaukee Journal sentinel to see if Trump's visit will energize those twenty sixteen voters to turn out for Scott Walker\nI've been thinking about you know the cost and benefits of a Trump visit and obviously it makes a certain amount of sense for him not to go to the suburbs of Milwaukee to go to Madison or Milwaukee but to go to a place like ... where he did well\nIn twenty sixteen but even in a place like why are you going to a place like central Wisconsin when you look at his polling numbers it's kind of fifty fifty and this is again the more conservative leaning rural part of the state so\nHe's not it's not like he's more popular than Scott Walker in these places but I guess the thinking is that if he can mobilize a certain group of\nRepublican conservative voters and I've talked to some people like this on the campaign trail that are pro pro Trump and there may be a little tapping on Walker um then maybe that's worth it\nWhat do you see as the reason that Trump's overall approval rating is not as high in Wisconsin as it was as we were moving into the twenty sixteen election and right after the twenty sixteen election\nWhich is one of those states where Trump's numbers we never very good and clearly\nThe difference in Wisconsin was the voters that didn't like either candidate meaning Hillary Clinton and Donald Trump broke pretty decisively for Donald Trump at the end so\nThey were always a lot of Trump voters that were very conflicted and had mixed feelings in some cases they just dislike Hillary Clinton more than Donald Trump so\nYou've seen his numbers bounce around a little bit I think he's you know he's negatives aren't that much different than they were when he won that election but now obviously it's a different context because we're talking about ... election where he's not on the ballot he's numbers or got a little bit better for example in the last big statewide poll\nThey're still in the forties they kind of bounced around from the low forties to the mid forties but by any poll a you'd have to say that you know Scott Walker is a little more popular than Donald Trump or a little less popular than Donald Trump I'm so again there's started that mystery of what Trump does for Walker [noise]\nOf what I heard after the twenty sixteen election about Wisconsin was you had to\nTrump does for Walker a lot of what I heard after the twenty sixteen election about Wisconsin was you had\nTwo things going on one very energized Republican base especially small town rural ... that we hadn't really paid much attention to because we spent so much time thinking about Milwaukee and Madison and the area around Milwaukee but the second was that liberal voters voters of color either stayed home\nFor the cast a third party ballot do you think first of all is that a fair assessment of twenty sixteen [noise]\nWell I think I'm In Wisconsin is one of those places where you can find examples are of\nGreat democratic turnout and soft democratic turnout in the classic contrast would be kind of mad at Madison area where everybody votes and everybody's going to vote this fall and they're going to vote just gets blue were bigger all the time and it's overwhelmingly democratic and nobody thinks that that's not going to happen Milwaukee is much bigger question mark because you have\nA bigger ... a minority population and Milwaukee has a history of dropping off in mid term elections in terms of turnout and that mattered you know differently mattered and twenty sixteen I mean the big change statewide was the small towns\nI mean there's sort of two kinds of communities there and that that swing was so decisive so much the stories of twenty six and a lecture but you've got the Republican small towns and then he got the ... the small town and there were like [noise]\nMore than five hundred communities in Wisconsin that voted for Obama twenty twelve and voted for Trump at twenty sixteen so those places\nThere is an element there of just swinging is\nYou know one of the things that I remember looking at right after the election was suburban Milwaukee ... county which is traditional Republican area\nBut this was a kind of place where we had heard stories I'm sure you'd written many of them about these conflicted suburban voters suburban women who are upset about the Access Hollywood tape and Trump did not do as well and walk a shot as Mitt Romney did but Hillary Clinton didn't do any better than Obama did\nDo you think that's changing now we hear so much now about suburban women especially in these more affluent areas do you expect to see that walk a shell behaved differently this year\nWell this is a fascinating question because there's there's cross currents really interesting cross currents there because [noise]\nYou know the suburbs in Milwaukee are a little different than the suburbs and a lot of other cities that size they're they're pretty Republican may have a real ripple and again we're talking about and so I'm getting in many cases college educated voters higher income voters they do have this very Republican history that's unusual in a national context and so\nAnd you about and some ... many cases college educated voters higher income voters they do have this very Republican history that unusual in a national context\nAnd so here comes Donald Trump and they didn't like him in the primary they kind of under perform for him in the general election but at the same time again that's been the heart of Walker strikes in his election so you got Walker pulling them one way Trump pulling them another way\nAnd I was very interested to look at those numbers in the midterm elections because again Trump's not on the ballot but again there there are people that clearly Republicans that have qualms about Trump\nAt the same time there's like this part isn't poll in a lot of these communities and they're very ... they're very active politically engaged and they have this history of just jumping into these kind of political wars with both feet and if Republicans want to\nTry to offset you know the the pretty big numbers and come out of Madison and Dane County they need a pretty robust vote out of these Republican out or Republican suburbs of Milwaukee\nSo great that being said is there a Trump effect in this election\nWill it's there it's but it's not something that the candidates are spending all their time talking about I mean that even the Democrats I think they see it as something that's a given and so they don't need to organize their\nTV ads around trying to tie Scott Walker to Donald Trump and also by the same token you know Scott Walker has always had this kind of awkward relationship with Trump they ran against each other droplet beat up on Walker\nBut Walker is very aware that Trump is popular with Republican voters so he whenever he kind of distances himself from Trump policy it teaches them very carefully so yeah it's there it is the elephant in the\nRoom and a lot of ways ... thank you for joining us it's a pleasure [noise]\nCraig Gilbert is the Washington bureau chief for the Milwaukee Journal sentinel [noise]\nAway we'll be right back\nWant to bring us with you on the gal subscribe to take away as a pot kept an eye or wherever you get your ...\n\nOn the next fresh air but talk about Lou Reed with music critic Anthony to Curtis author of a biography of read now out in paperback\nThe Curtis was also reads friend interviewed many people read new including two of his former wives we'll hear about how reads trends aggressive music related to his life joined us\nFrom Miami and they'll say today at new [noise]\nReads transgressions music related to his life joined us\nFrom Miami and building new Fitch away across the U.S\nYour Ninety One point five care see the membership is vital we thank you for your financial support which directly funds are news music an online services at ... dot org\nProgramming on Ninety One point five to your cc is supported by Colorado College where lifelong learners foster relationships with students and professors working side by side to attain a liberal arts education more about lifelong learning at Colorado College dot edu\n\nWe in the hour here at the take away with a look at how and why not everyone has easy or equal access to voting", "show_name": "The Takeaway (PRI)", "year": "2018", "city": "Colorado Springs", "day": "26"}