{"month": "10", "state": "WI", "station": "WORT", "content": "I haven't I still have a circle a one of the few beers in the sixties with short hair or we had a good thing going released on Columbia Rutgers I wasn't here they're usually may or June of Nineteen sixty seven and this is W O R T a nine point nine of them in W. O. R. T. H. D.\nIn Minnesota Wisconsin\n\n[noise]\nHi I'm Susan the W. R. T. staff member responsible for organizing a pledge drive with the help of hundreds of amazing volunteer and dedicated staff I recently completed fall pledge drive ran like he's saying all the famous Jamaican sprinter\nThank you to every one of you who gave your time and energy to make our phone drive six and there was an R A festive positive energy around the station during the drive and that was all you because of your generosity we exceeded are gone came very close to our threats\nOf eighty thousand dollars we also added eighty noon monthly donors\nW. R. T. has very unexpected\nChallenges in twenty eight and we are so grateful to find that the challenges have come to amend the support from you our phone here listeners sponsor and most of all and vital part of the W. O. R. T. family thank you [noise]\n[noise]\nW. O. R. T. nine to ... is coming up fast it's on November fourth extremely falsify Madison central\nW. or to DJ's will be rocking lanes as opposed to for prizes we've\nAll bowlers receive a keepsake hands how do we do with the W. or too low to buy tickets to the pick your prize raffle tickets are available to them at the sister perpetual when they'll just after the event he got over Fifteen hundred dollars a price to give away\nGoing a strike with red pin in front earns you a free beverage after bowling enjoy pizza ... while the scores are tallies from the prices are do about all for thirty five dollars [noise]\nProceed benefits W. or to [noise] to fill out the form of you or to you and then trying to do with the registry\nAlso visible here at the station ... street and at least I pressed on boys [noise]\nYou informed about ways to actively support your radio station is W. or TV nine point nine if in Madison\nAnd you're right smack dab in the middle of a program called I like I like that wasn't Iraq and John mostly rock and roll from the fifties and sixties ... from the Nineteen seventies after twenty Eighteen\nPlay on some of the stuff that fits music by big Sandy and his flying right boys and they're going to be at the north St cabaret this upcoming Thursday night November first should be a rock on the show\nAnd if you're heading out tonight here's what's going on and once I got I Apologize I mispronounced a certain artist name well of course freak first that's going on there on a on a state street lots of bands and I'm assuming there'll be lots of costumes as well\nAnd elsewhere he can catch cherry pie up the boulevard wanes tonight the beach chefs at the great Dane downtown Detroit where kings playing at the ... bar in Middleton Valerie being the boys at the medical down saloon\nAnd policy bar tomorrow's soon that's going on but north St cabaret tonight starting at eight o'clock some of the things going on tonight\nAre going to support your finger nurse in your favor nice spot they'll appreciate and you'll feel good about it and next week\nIt's W. L. S. Nineteen sixty eight part to I'm going to pick up where I left off last Saturday Night going to go roughly from July to December of Nineteen sixty eight\nGot some nice comments on last week's show or going to pick it up as I said where I left off last Saturday Night Nineteen sixty eight according to the WLS silver dollar survey part to\nA next Saturday Night show\nAnd it went to the basketball scrimmage\nLast Sunday it was like a ward gathering as I posted on Facebook Steve and Mary\nWe're that's a game that you're going from journeys it this is talk to him for quite a while you're here request the least who saw oh that's a cool ...\n... stance on\nThey sure\nGene dirty issues about\nBaby and knows why are\nNot only did you did you\n\n[noise]\n\nThey're already found me\n... and know wetter than stay\nBy the way\n... ... and ...\n...\nNa na\nNa na na\nNa na na\nNa na na na na na na na na na\nNa na na\nNa na na na na na na na\n\n\nNa\nNa na na\n\n\n\n\n[noise] [noise]\n[noise]\n\n\nMaybe\n\n[noise]\n\nTrue in a real by the way by Bebe we started off with one of his big hits and has a that was the no ... and I was a senior in high school when that came out it was a hit from December of Nineteen sixty two\nSimilar to Nineteen sixty three as mentioned I heard by me be on the radio almost four years when I was in high school really following up on the trip from Nineteen Ninety or Sunni originally came out on a cassette\nCold you Katie toward Ninety that was Bobby be backed by the bees doing the boat deans good work and we saw Bobby ... several times that the weird dance parties and clearly he was opening his show was for quite a while with the boat deans good work\nAnd how about some instrumental record rule is I like to say you can never get enough of the ventures\n[noise]\n[noise]\n[laughter] and [noise] and\n[noise] and [noise] and [noise]\n\n\n[noise]\n[noise] [noise]\n[laughter] [laughter]\n[noise] [noise] [laughter] [noise] [laughter] [noise]\n[noise] [noise] [noise]\n[noise] and [noise]\n... boy the injured but look one boy records were sort of what the rangers and yellow Jeff\nGordon ... low key words you passed away this year that was from the colorful burns your your mom Nineteen sixty one\nAnother worker the features milk you were only well is good tour of the insurers Rick was supposed to do the whole league or two that was a hit the suburb late June sixty ... to January of Nineteen sixty three hey they're really big\nSandy is we're right boy\nFather who may I\nToo I don't know\n\n\n[laughter]\nAll during the campaign\nView about we don't mean\nMan that we got to get out there and didn't die\nMan [noise]\n\nStrewn around with a\nBeer and you know mom all the way\nWhere\nA lot of your own\nBaby closer to my\nWhat was your your family about\nAre are so\nAnd the next day she was God show\nThere's humor in on the\nA day when\n\n\n\nThe the ... or the other than your um\nThe the the ...\nThe the ... the the ball ... do you think on\nThe road but he used as a\nTwo and a bomb on you\nA [noise] a lot of you may not bringing them to or not the the\nThe the\nThe the the the the the the the ...\nWhere do you hang on and\nOn the boat with the ...\nThe the da da da da da\nAnd the money in the\nLa la\nLa la no no\nMy dream come true or not\nThey are pretty\nThe police or go\nThe the the\nTwo\nThe baby who is in jail for\nSusie Lee did just rely\n... you know he knows\nYou say you know ... you know you know that's\n... they\nOr do you want to put it on\nRight I don't really have you know\nAnd they\n\nWay\nRacy and\nNo no no way they are banning\nTo Boston\nAnd everything you can\nAnd on you were on and on\nYour mind crime and ... year alone\nTime and even you can't count\n\n\n\n\nAre sort of music with the Nielsen feel we started off with general hunting him from his brand new ... Nielsen tribute CD but we want you here\nThey're like I'm doing a great version of poor little fool some written by sheer and she ... first number one record\nAnd she was on the logos Errol Hi I'm an ... the tour and everything else so that record their money actually rather Rick Nelson image type still on the ... you and that was a single for buddy\nCame out in January of Nineteen fifty nine\nThen Steve Young cougar workers make a Nineteen sixty to ... Nielsen so the legs these very what that ain't so record co written by Steve ... boy was Craig record produced by ... gifts and those are the microphones on the back of that song\nOr we wrap it up with what Neal so them super milk co blues a hit for Rick\nDecember Nineteen sixty to January of Nineteen sixty one\nAnd how about a couple of Richard Barry too is done by big Sandy\nBop bop bop bop bop bop\nOrange shooter is up next to for the blues rock and John seen it but they got the baby and it goes into wrapping up\nCindy Nelson Cindy those will be turning eighty in December and I'm thinking of maybe doing the same email from special at night and we're going to hear a trek from the Bush ... Nineteen sixty six originally are hitting the sixties for Roy Moore\nIs the sun and the instrumental version of treat her right\n[noise]\n\n\n\n\n\n\n\nJoined W. O. R. T. for the day of the dead brewery bike to work on Sunday October twenty eight sponsored by park ego captain Ellis Island all through an carbon for writers will begin at the\nPark ... eleven and then proceed each brewery\nSampling two glasses of locally produced track your each stop to get the big dollars and can be purchased at each of the war brewing Oprah equal benefits W. O. R. T. V. is limited to grab your ticket parts people ill asylum old Bruce or carbon for costumes are encouraged but not required\nBringing lively undead Halloween season ... is is W O R team in point nine of them Madison\n...\nHe was present government meal Thursday November first\n\nRight from the Allman brothers bad before guitars sworn in an original reason no ... what do you work\nDrummer yeah we play with the\n... and the roots rock sold in jail government was recognized for during song writing a story telling as it is for the improvisational ... that people are\nPill form of\nGovernment meal there's a burst into\nYour your point that I failed or support radio\n... many\nWas large Juno you're listening to shoot for the blues on W. O. R. G. eight and nine point nine ... FM in Madison listeners sponsored the radio\nYou're playing for the blues forty three years we're gonna kick out Tonight Show a with a set of music\nFrom the modern ... rpm labels that comes from a series of this or that ace records in in uh England for the hour we're going to start with Willie next\nBig try me one more time and [noise]\n\n[noise] [noise]\n\nYeah I Know John\nA ... job that you know\n\nNo no no no you know [noise]\nLove those bad de dum de\n\nOn the job and get a better job you know what it was done by da\nDa\nDa da da da da da\nDa da da da da\nI Walk up the tab then\nThey'll give a gallon a nice time\nI had the at the Donald when I when I left I didn't\nHave time to go she drank can while I'm a\nGod you\nKnow and oh you know [noise]\nShe was doing and mom mom and no one told me I Know\n\nShe went straight to a table\nAnd I didn't know what to think\nTime to go by\nAnd she is now the main cause she\nIt drag him while I'm\nOr no [noise]\nShe was a man during my order and I know well does the ah no well\nI think\nShe was about ten minutes\nSee I got to step around here\nNear baton she'd go out and come back\nShe ends up the bill Cosby was\nSaying you know I'm a\nGod no man don't you know [noise]\nGee why the beer drinking wine mountain in Nevada and I know ball to see you know\n[noise]\nAh no I was voting dominated the mind around trying\n[noise]\nYour mother treated me like I'm ... you mean by well tell me any time soon mother treated me like I'm a man in China [noise] guys Weinstein science so hot and pound bag home do die [noise]\n\nMennonite that'd be by nine a minefield I'm drawing a line on Muslim prime dominant name vetted by by a mind no matter what nine known as I told him a bind\nAnd they're saying good bye to do go over a non ... come on man from known though man or any of them are going on all\nThe mariners brown I'm non then then now them banning them to lend me now\nTo be from [noise] Mm\nWell let's bring my general lying big voting lend me down the boat and let me down bombing campaign money buying a ballgame than me\nDown in an ordinary wisdom printing crying all the brain around [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] do\nYou guys germ new new God damn near and dear God damn knows a\nLot of them are going there and all\nOf a\n... you've got to the\n\nUp\nAnd down and there\nSome uh\n[noise] you may be ha\nHa you may be low\n... you may may raise ya\nYou may\nBe born born in oh the\n... you\nDan is saying\nThey are\nMm\nMm you see that\nThat low here do you see a bully is no\nThe burn one you know\nYeah man you got to do\nThe\n\nSame thing now\nMm\nDo you guys\nYou guys don't let\nYour guard down a new job or\nA\n\nGeared ... na\nNa\n\n\n\nNa\nNa\n\n... ... ... oh my\nLord ahead on line\n... ... ... ...\n\n... ... ... ... ... ... ...\nNo ... na na na then no mine mine\nDo you make\nThose loans man\nNamed ... ... ... ... who\nAre known to man this\n\nThis wireline na Don Gamal or semi head\nMm Mm\nNo man had them for you\nIn in the new the new one\nMan I Love it had a busy you\nNeed to go\nWhere no\nWay you want to\nDo with the\nHanging out on me\nNew new deal in the\nLow\n\nLow man now then ... man who [noise] [noise]\n\n[noise]\nWell\nI'm a lay O O K C\nO L O O you'll be like in\nThe manner [noise]\nWhere do you train them well\nTo\nAnd why [noise] nice\n[noise] [noise] [noise]\n\n\nThose bugs and you know and not grow to\nBe a hobby\n[noise]\n\n\n\n\n[noise] [noise] they\nWere in a\nI don't\nYes thank me back\nTo Iowa yellow no\n... I got no\nWhen he comes to\nMind and I know\nWhy don't you take me\nI Won the bad no\nJordan\nHe said on\nI joined in\n\nDid not nervous not mine\nMy mom and I thought\nI Am an\nI actually don't\nAfter your segment\nI Know yeah well no\nMoney she I don't\nKnow I Know no\nI ain't got\nAnd after Iowa event and no\nI\nShe I ain't got no\nI\nDo I\nI ain't got no matter how does\nThat was a William Harris from a previously unheard recording that was just discovered in the last year or two a do get too cold I'm a Roman gambler and it's also a a\nA CD that comes with the calendar that whose images puts out each year and this is the twenty Nineteen calendar a ... and a series of CDs that come with these calendars it's called the classic songs from like\nTeen twenties and that was buying from volume sixteen\nThe beside is also on this or a CD but it sounds exactly like a the ... to you just heard before that weird Cal Cal Davenport doing ... blues from Nineteen twenty eight and we start with Bobby leaking\nOr doing a tune called suitcase breakdown and this was recorded this day in Nineteen twenty seven Ninety One years ago\n\nOr ... or ... at\n... prison that's that's her desk you trucks back Monday and member of fifty seven thirty PM overture home\nTo the rescue trucks Graham has spontaneity and jamming along with some in conversation after touring together in two thousand seven as Derek Trucks and Susan ... sold do revival they merged their respective groups to form the rescue trucks ban\nTwenty first concert was that the attorney general savannah music festival and Susan's with that's even worse might actually be what angels sunlight ... saying that the ... trucks band Monday November of ... thirty PM overture all\nWe are eighty nine point nine W O R G ... Madison kidding you inform the live music all Roma capital [noise]\nHere's big daddy Keynesian McKinsey report doing a tune called a called bad situation the title track from their discussing the rooster record label [noise]\n\n\n\nYour\nLa\nLa la\nUp in\nAt\n[noise] [noise]\n\n\n[noise] no drive down me they were dying on me all\nDo\n\nLot of ... da\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\nDun\nDun dun dun\nDun dun dun\nDun da da\n[noise]\n\nWe started that set with big daddy can Z doing a a tune called or a bad situation from his uh the title track from his discussion rooster records and\nUh that was and then following that we're Luther Allison doing you're going to need me from Nineteen Seventy nine that's from a disk called south side safari\nAnd then after that we heard Elmore James doing I held my baby last night recorded for the fire label in November of Nineteen fifty nine we ended with big twist and the mellow fellows alive version of poke salad at any recorded in Nineteen\nEighty seven and the writer of that tune Tony Joe white sadly passed on three days ago at age Seventy five\nUm poked salad was a Tony Joe's greatest chat but uh he had a lot of other great tunes as well we're going to hear a few tracks from him\nA but before we do that I Need to say you're listening to to for the blues with our Juno on W. or tea eighty nine point nine FM in Madison here's Tony Joe white\nDoing or perhaps my favorite tune is Willie and Laura may Jones from Nineteen sixty nine\n[noise] [noise] [noise]\nRomanian Jones may be wrong\nMaybe a brand\nShanghai trash ordinary job I ever learn about how\nAbout a man from [noise]\n... ... ...\n... on the front porch and ... and you know when the sun\nWay they would win lotteries were saying and I'm sure to listen\nThat vein go when my kids and we re in terms of the night and every now and\nThere were they were granted to play\nAnd and then to go in there\nKind of ... and\nI remember we did get to the man who was on Saturday or ...\nWe do we stop by our weather's how safe do the\nSame thing\nHe's saying now but the why don't Joe stomp on your way back\nAre getting louder man\nI'm\n[laughter] still use ruled by a struggling\nBack but they given\nA ... to have to do for a while I was going to make a living\nOur separate ways and ...\nThey charge Saddam\n\n\nThe woman that much\nTo slow\nI said Charles by\nA week and said we need a bang\nWith them to speak to the\nTo vote more than ... this is a male\nPerson I\nAnd I\nLamb and a\nYou\n\nAnd [noise]\n\nBuy your way to ...\nOn a\nBang or whatever and\nAnd the day to day and\nRun a ... and\nField or into the\nDa da da da da da da da da da da\nDa da da da da da\nDe ...\nDa de Sandler murder he is\nEvery Thursday lover or\nOperator the tomorrow\nDo more\nCan go down the road\nEat\n\n\n\n[noise]\nOh\n\nI got the cause of registering them but I Can't see the traffic it's scary\nI don't mean to sound right to do things in my mind as we\n\nJob and you may want\nMaking two\nGet this one in my face the beauty in my woman by the time when talking you\nKnow [noise]\nDo\nThe never done and you make\nYou you know how to make you and\nI'm a\nDone to me she\n\n[laughter] yeah\nThey say they're\nNot getting a witness\nUh uh the really big tree\nAnd the\nFamily [noise] [noise]\n\nThere's been\nDa da da da\nInsect be a good time\nDa da\nMm\n[noise]\n[noise] me\nHave rather than the old you know in my in my in my ... year old man you know that's a\nLot on me I mean\n\nI'd rather not you know I Know when a\nMovie\nLast night and now they're saying you have such a way you wait till your whole ... thing that the rats\nSo my ... that's true\nWell you know a lot on\n\nMy love you baby\nWhen I went around you know [noise]\n[noise] oh man like me [noise] well ... [noise] I don't want a man like me\n\nYou know they go nearby but not on your own you know [noise]\n\nWhen my kids don't read the and the San ... would be lower leg if bond that you are ... where\n... where do you mean yeah but at the mall dry [noise]\n\nIn some way\nNo\n\nWell I'm In a long way you live in\nAnd\n\nI'm from ... ...\n... I Know ...\nI Know and buttery\nMy gauges gender by God only ... ooh\nI Believe ... about it now\nOur bodies staying\n... just like a millionaire yeah\nAnd\nAnd I still got ...\nI Do ... and\nArea that I Am I getting\nPitch and\nMean you need you call it a ... and\nWe call the ... and\n... miles every body\nAnd it sure feels good to me\n... ...\nWhat do we know there\nWe diving smoking\nSent him a very sue\nMm\nDon't sit on my resume\nNo I couldn't imagine\nIt was another cat ... blue Dan\n... Mm\nCan be ...\nI'm just about as far as I can be\n... dollar wrong\nA ... ...\n...\n\n[noise]\n\n\n\n\nWhen it's done go there and I gave him a brand that began to grab\nWhat the people that say no no no no\nYou know I\nYou do that\nNo no no no\nAnd they begin to both the honey I\nWhat the people that make you know I\nMean I'm just driving by God I\nGo out here\n[noise]\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n[noise] you don't read but\nNow now that we live right in and get me in you know I don't\nKnow what the people that like I really don't know\nWe're\nWhat you're going to mind you know\nLast name I think I Want to give you may maybe they go out to be back tomorrow night down and dragged him oh\nI don't care what the people in the bank you\nI'm just like you know you\nTo get the right way to\nAnd they all\n\n\nBad [noise] [noise] [noise]\n[noise] [noise]\n\n\nYou\nGet a chance to do\nMy coupons to talk to you know I'm going\nCow playing and\nAnd all of them by adding apps God\nThank God do\nIn Bay to allow\nKnow\n... [laughter] yeah [noise]\nI'm Talking\nThe ... some\n[noise]\n\n\n[noise] is that the\nA candy and then\nThat while the\nGame then\nWine and and you know or I mean\nI'm at right now I'm like I mean I'm not I don't know me and then [noise]\n[noise] [laughter]\n... songs to try to prevent anti gay marriage and people do take a long\nYeah the reason they entered into\nThe dream tiny girl on the line from the left knee deep in the\nOn the line and learning that interested in how we should uh you know they made a big deal because we\nKnow how ...\nTell ya I\nDon't want to be back again why\nGetting ready\nThat yeah\nWe\nLive in an injury\nCountries in the laundry while I'm\nPleased\n\n...\n\nIn that gap Sean\n\nScans and\n[laughter]\n[noise]\n[noise]\nPrint\n\nYeah who feels like getting funky you know Halloween weekend [noise]\nW ... the eighty nine point nine months Madison style barbecue but this is your DJ hosts metro dance and\nI'm calling all my my friends out there who are who are in the mood in the holiday spirit Halloween spirit [noise] together around the warm to the radio you calling in [noise] come together around the fire\nAround the ... on the phone [noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\nYou're funky with the the sounds of the season let's have a little holiday on Saturday nights Smokey joint style [noise]\n\n\n\nTen years ago on the night of October thirty first small towns do victim to an escape killer healer [noise]\nThe cover of darkness he carried out the most horrifying mass murder on record ever since that night no money for\nMr Mr Mr that and Halloween\nHas never been the same [noise]\nSo the first time you hear the the concept of Halloween so the first time you hear the the concept of Halloween Halloween Halloween\nWhen you're a kid your brain can't even process the information you\nYou're like what what is this what did you say [noise]\nSo what did you say about given out Ken who's given those [noise]\nEveryone\nEveryone that we know is just given out than they\nAre you telling me what is this happening where why take me with you I got to be a part of the other way they want I can wear that\nWear anything I have to wear I'll do anything to do to get the candy from those who are so stupid like giving it away [laughter]\nI I I I did that I had when he had to do do do you\nDid do it did was to lose your casinos\nStuff with the knife knife will go man now\nIt's a really really good for you [laughter]\nWe [laughter]\nYou have some fees and how you spend nine will go now\nIt's time for China continues\nTo me it could be oh how\nWe maintain [noise]\nTo the country [noise] this is Susan and yo\nThe things in life so it's a it's really a country\n[noise] give it a little\nDopp ... children\nTo get things done\nI mean you keep looking curve\nThat keep looking\nWants that to me I'm walking down\n\nOr the other one goes out to all the super freaks lifting tonight thanks for listening on a Saturday Night taking us what you wherever you are in case it's just at the party right there where you are\nBeing used super break and I don't cook too\nShe just\nWants to get off the street how like the\nMan that I Am not bad\n\nDo the writing\nThese never had to be oh\nAnd then drove it while you\nKnow try to really go oh that is I really loved [noise]\n\n\n\n\n'cause there's some debate when\nThey\n\nTo\n\n\nBe\n\nTo do\nLet's go to the moon long wait wait don't see\nNot\n\n\nAway\nOn gays on them\nI don't know all the\n\nThey\nMoney or not\nKnow\nAnd then the next\nDay and then do\nDidn't\nSome\nOn the game and then they\n[noise]\nYou\nThis [noise]\n\n\n\nHow do you need\n\n\n\n\nHappy happy happy Halloween to everybody\nOut there in the city is listening also on the trust real are driving around town about the Internet\nWhere are you what are you doing to got new listeners out there in Portland, Oregon nice for tuna and Saturday Night smoking a joint I Love it covered and they were just made me wonder you hardly ever here maybe one or cover [noise]\n\n\n\n\n[noise]\n[noise]\n\n\nEverybody's\nBeen around and the one who made all red and blue\n\n[laughter]\nYou can tell\nMe what my daughter she\n\n[laughter] oh\n\nGosh\n\nDo\nDuring my God if you\n\nAnd do you go and do\nThat you\nKnow and do you go [noise]\n\nWhy don't you know or do I make we can actually learn how to treat Juno ground to burn all at home and that they're going to go do we know what do you move your way\nYou're a motor that for about ... writer ... ... you know watch out for the past I'm up in jail\nBut why don't you think that you did you like so much from the other\nGroup and you know I think that probably would have\nBuild up in a while\nJust kind of an old time you'll be shut down all the last three weeks\nI have to be the beach but\nMy parents are and when I\nYeah I Do like a needle work yeah you got to do the goal for\nTo answer my pants on who you know\nDo you think\nIt and you're going to be the key\nIs okay and you know although that\nAn issue as it\nIs all about it and let the\nEnding to it [noise]\n[noise]\n[noise] [laughter]\n\n[noise] [noise]\n[noise] [noise]\n[noise]\nGate to\nKey\nDa da da\nDa da da\nDa da da da da da da da di\n\n\n\nDi\nDi di di\n\n\nDi di di\n[noise]\n[laughter]\n[laughter]\n\n[laughter]\n[laughter]\n[laughter] [noise]\n[laughter]\n\n\n\n[noise]\n\n\nToo [laughter]\n[noise]\n[laughter]\n\n[laughter]\n\n[noise]\n\n\n\n\nIn the digital\nTV [laughter]\nYou\nBe trained to be\nTo people ... boom\nBoom boom boom\nBoom ...\nOne two three four ... to ... [laughter] one two three four ... ... ... [laughter]\nThere and\n\nShe\nJoined W alerts\nTea for the day of the dead brewery bike to her on Sunday October twenty eight\nSponsored by parts that you don't have room Ellis Island to an carbon for riders will begin at the park ... eleven and then proceed each brewery\nSampling two glasses and locally produced craft beer each stop tickets are Fifteen dollars and can be purchased at each other for brewing I'll put these will benefit W. O. R. T. V. is limited to grab your ticket at parts depot Ellis Island ... or carbon for costumes are encouraged but not required\nBringing lively undead Halloween season jak earlier it is is is W O R team ... point nine and then ... [noise]\n\n[noise] [noise] hey hey there's the music fest let's use some music bed music it's the top of\nThe hour [laughter] hell yeah\nIt is eleven o'clock in the mad city and you are listening to W. O. R. T.\nSo\nYeah maybe nine point nine FM Madison [laughter]\n\nThank you for joining in I'm having a blast [noise]\nThis is\nThe party in place [laughter] I Want to thank mark his fraternity me onto this track this is the bomb for music bad I'm having a great time like I say I've got the lights going got the costumes going you got your party going I'm over here in the corner where the radio is\nHow come they always put a DJ in the corner I don't know oil led logically it makes them want to be close to the bar [noise]\n\nFor all of you are following along at home you know the music is a on W. R. T. F. M. dot ORG is right now ... listening live on the archives and also on the playlist [noise]\n\nSo now that we've done the business let's get back to it\nWe got another hour coming up here [laughter]\n\nYeah if you're a Halloween party [noise] without further ado let's get back into the Halloween grew what does that mean [laughter] I don't know\nThey will invite the great pumpkin [noise] or or whoever I got on the list we've got a ... year we got snoop we've got black Sabbath we've got\n... because it's funky we've got a a mash up called evil Supreme it's the streams and yellow evil woman\nAnd a spooky you know the dusty Springfield song well it was a cover of it I've got that boy Boogie Man the Jackson Five\nAnd we're going to take you to church with some house music 'cause it's just a ... hour of\nSaturday Night that's what it feels like to me you're enjoying along at home to keep it up\n\n\n[noise]\nGreat for every ... every night\nI Hope you and me not just ...\nRight right right right ... I'm writing is a great can make this\nNice\nSure the anti Christ you're on a good man is your land\n\nWouldn't the needle do the grew with Mr\n\nWe're going to rain we believe there are a lot\nMotivated laughing\nAnd I'm not so much about our book the D. J. ... your ... your three and then they'll blow the beat goes up and she I Can't make it just right now when you get a lot to make you know the girls get naked so bring your friends over\nThat we got over the world\nFor me are right in the ... law who don't drink that their vote on it now but when I got a ... a bread bowls and we know from the book but they're going to shift so gene or a little bit back not lady when we when\n\n\nPeople should be to do\nThat [laughter]\n[laughter] [laughter]\n\nThat's\n\nNever made it clear this I'm preparing\nFood the gym is\nMiss a\nLot from me I'm On\n...\nReal la la\n\nGrow\n[noise]\nAnd the guy next to camp every now\nAnd [noise] that I really can't\nPrepare\nThat purpose I began not\n[noise]\n[noise] and then [noise]\nTo turn the TV and [noise]\nShe's going to get into the bank account for capital projects\n[noise]\n[noise]\n\n\n\n[noise] [noise] what do you not even [noise]\n[noise]\n[noise]\n\n\n\n[noise] the rhythm [noise] [noise] [noise]\n\n[noise] [noise]\n[laughter]\n[noise]\nYou are listening to that when you are the eighty nine point nine F\nSam ... your your host Mr Dan this is what I call right or the right to smoke is joy for your Halloween party that you're paying but I've been born [noise]\nPie let me tell you something [noise] [noise] and you know what that means that no\nOne wants to be held on to like you say [noise] I'd have to adjust your mind you're panic and you\n\n\nKnow whatever you think the way I'm Glad you know when it comes on [noise]\n\n\n\n\n[noise] [noise] [noise] long day we we don't buy the blind tend to be crying [noise]\nLost their lives\nHad\nA big\nAnd [noise] we'll wall mom\nAnd dad mom and dad and we're paying off\nA bomb and then we lived in\nRun it\n[laughter] [noise]\n[laughter] [noise]\n[noise] and\nAnd the doctor and get the people the\nPeople on both the\n... and ... and ... and ... and\n\n[noise]\n\nBit\nIn June and then there's been\nAnd they\nThen they\n\nIn the lab and they do do\nDo and then and\nAround ... back\nThen\nBang bang\nBang bang bang\nBang bang bang bang\n\nPeople from other from other than the\nAmount of flash [noise]\n...\nOh they're going\nTake the stuff abroad\nDays\nProbably na na\nNa\nNa na na live\nThe show a bomb\nLungs and that\nBe ... be do\nJuly\n\n\nDi\n\nNa na\nNa right [noise]\n\n\nNo no\nGuys\nDown\n\nAhah\n\n\n\nThis is dedicated to Paul\n... the Bedouin this woman died in with just a B. C. on them [laughter]\nOh yeah\nSure oh\nJoe with no names beginning over here at our\nWith a tale that will be glad Jake about a woman you ready no one no chocolate changed but the may yeah your brain pushes the gun show\nI don't worry because they're not to jog a little girl\nA friend of his gender asking them much you know you just who holds the fights you would\nWith it's got deep ... was that she and she told it all your all voted went on we don't don't that God will bless that she did for the straight I think college jumped up three she hired by the jumped on him every one of them were you know why\nThey want as much as I tried like a Stone Mountain mama and what you're telling me that you need to be controlled\n\nBut they got a pocket because you've got cannot draw your brother didn't the good and plenty of love for the ball\nFor this phone may want to stay calm talking most just end up being bought high make put the ... thing a lake on it and then maybe you\nAll thanks for listening to Saturday Night a smoke is drawing with your DJ must or dance boss ladies up what's so universal votes blows in next\n\nWisconsin union directory and the greater Madison jazz consortium present the conclusion of the twenty Eighteen and did you use yes dealing with Madison music scene heavyweights immigrate on friday evening November's nagging at the place circle\nTrue to their ... immigration trade the dynamic cruise and unrelenting calling rhythms comprised of ten local musicians immigrate delivers a worldly jazz rock sound was swirling repetitive guitar pattern these funky baseline and the series because you sections horns and piano\nImmigrate play the final installment of an indigenous yes theories that memorial union place or go on friday evening November second at seven thirty and you are listening to W. O. R. G. eighty nine points\nYou know what I mean if ... and ... oh I see and found that or [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise]\nNeighbors strength of selling so [noise] so [noise]\n[noise]\nMade us think they're selling some sun don't sell so they'll they'll hit\nOn a picture with the president I just wanted something to the man speak for the boys in a band or am I going to have a working again apologize if I'm hoping they can do these things happen often but I'm back on the scene I was lost in the dream is that right it's a team that I Know since\nI've been bit on the house back home in the stock market will believe what it's costing and sit for king writes omega cussing and explain order pain at a cost him sixteen should've came with a call center for the fame and fortune well maybe not a fortune but what I'm saying it's a show that a\nFamous exhaust and that's why I moved away on these privacy surrounded by the ... recruits highly sticking you will you know I Do many cribs got a big back yard when you can stand on past the guy to\nDo with ... foot any forensic lab mix it up in the driveway to rap because just as she gets back and forth just as she gets back on Fox well good sort of sheltered this show will help you if you felt insecure and it would be to start you all knew you were wait I think police did that with ... seconds\nStarted don't [noise]\n[noise] [noise] [noise] I don't [noise] some so [noise] I was\nVery strict on selling them along [noise]\nI Do some traveling through some sort of throws mother fucker some\nThings you can't escape ... society to make every need to feel like a candidate ... kind of fake even with you\nSit on a lake ... even when you're black saying on the wall even when the president can take a look at the end of the\nAnd it's like I Can't speak to the paranoid black and white man's parents don't talk to us and with the army guns no evidence at all and we don't just a couple of neighbors that it's only ... only ... the U.S we'd be on the news and change that\nWe don't bother me don't bother me don't bother me during the second stomach don't [noise] some\n[noise]\nSome [noise] some [noise] so [noise] very critical selling so I Know [noise] do you\nMarried for second stomach do\nSo\nMother fucker I Am I Am I Am tired of the guy was like on a tire I Am a mother fucker I Am\nSo much for granted I don't know what I was finished and then back so that was a\n\nMuch greater do know what they\nMoved back\n\nTo your\nPoint [noise] [noise]\n\nMan town was going down to remain DJ pay more than a year or two in eighty nine point nine there'll be you know or the boss lady and the universal so long\nGood thing about turning as a child did you did you do but like universal so if you [laughter]\n[noise]\n\n[noise] yeah [noise] yeah [noise] yeah [noise] do lifted\nIt later on that on that\nAnd they don't at all [noise] drip drip Swedish bitch hunter or to switch pitch in order to slash its own special on that on that\nAnd they don't at all [noise] stray cats wishing bitch hunter or to bitch Swiss rich on you know\nRoof top down window into\nI Do not appeal trying to buy me well and markets to praise be killing would I be\nLooking to pay more than just 'cause I Know they just may cause they not I'm a big I need it creates tiny me a break when they look like it there before the raid that oh this is the state as much damage and yet as you know the your bakery and you might say the Republican National because I Know when you\nTell myself that was the trip and you know what to call Vince well how could end up all the time when the troops over no I'm In New York rich and the campus afford this\nOn a spaceship do much of a hobby you get with the same damn now I have to have you in the same damn boy that they should not be put in your head now your name\nOn at all not at all [noise] drip drip swish bitch hunter or to switch pitch order slash rich on sanctions on that on\nWas why can now be in the world was the things the ban does this is my seems to me raising you from the past and they give us some like you would ease the punishment your mother was given me the other team the snow I Love your son and I'm wishing that I can see the\nGovernment's done something wrong they get all your daddy\nThat you know daddy Demi Moore thing of what you've done [noise]\n[noise]\n[noise]\nKnow you your mom staying with her being in the building you partially black I'm confident that feeling interviews they don't like coffee and thereby just delivered they used to be going to grow up shooting guns delivers\nBut that's not true though that I Know you're not like that you know I've got to listen he's a funny joke that you can tell your grandmother\nShe looks like marshmallow man from college but [noise] I forgot you're too young to know that is that's the kind of thing I like state of property that shoots the arms to my chest and not real lasting if you look closely you can see she's made a plastic like you might or\nMy problem is we need to get them out when I Am very ashamed that you don't have\nEvery night I go to being a feeling it's wicked\nPain because it's a good a good man and now you know mom you know in\nA tough time [noise] that's right [noise]\nDaddy [noise]\nCurrently my life is hit the floor I Can't lie to you should it's hard I should be building with the lord it to be what Mr know maybe I should continue to her mom and do some more just to relieve the tension that fits the Martha Stewart when I'm speaking bars about all my kids and it's good to cars on my vision is the one I did it\nFor my relationship with your mom is the name of the more after all a cane lie was who did it for a lot of the the one that we could go to now you know your daddy don't condone that broken family also that we couldn't work on a if you were right now you have to separate his mom and daddy\nAre stupid law your way too young to know you don't deserve to go do this do you see your mom again this time I Will still be shot at least then I feel like my banning justify look at your mama think to cook\nIn the last thing\nCould have been a good man you know your dad\nKnow daddy that was my\n[noise]\n[noise] [noise] oh\nSorry I Can't be there with a B that daddy does\nMom mono\nJenny do these buffets mono just you know the long\nAnd then my dad\n\n\n\nOh right hey I got a dedication here dedication that came in and this one is going out to\nTo hold on I was not prepared [laughter] it is going out to boost the body boosting Johnson ... and it said God Bless us all that's from a leash us oh he's on the\n[noise]\nBackpack and they\nMe [laughter] I mean you have to\nA bad now\nOn your back and bring them to think of what I mean we're the bad ones are great grandma lived like I'm at\nThe beginning of the ... to ... [laughter]\nThat time I got out in the ...\nThe bad ... bad\nAbout it but I Want to bring down and I wanted to go watch [laughter] I don't want to hang on\nToo\nOne of my little but I mean don't\nUp on elm I pack up your book that go don't may not agree on that they make a tank volley maybe back to the goose why why does the song that John and John if you're\nTo the fact that you wouldn't need them but trying to get up in my hand I got a nice guy but I don't know how they make I Know about\nBank and make a lot of the I got my mind made up my mind make a case\nI'm On\nI'm not a ... a lot of kids I don't put it in front of the day I was talking about the battle to your table you know I'm not going\nRun them ... mother talk like my three three updates protect and\nA dollar a day is not a man that he may not and not a main\nLike all three great big down payment and make them pay more for\nTime to take a same day trying\nFamily say don't do much\nDone as\nOn\nI remember going on right\nOn and\nAnd\nNow\nI\n\n\n\n\n\n\nDon't know what it means to be around for making machine to do with\nYou\n[noise]\nYou know what the ... main drag queens reform whatever with Jean and Jean's regal pressure like clean them with me\nI Would like to watch from the bottom\nOf the things on which which which would make you\nCome across like agenda they just make a\nChange like this stinks shrinks and they go\nTo Jay Jay Z\nBut I'm running a Jimmy\nGrown maybe you'll be able to do the job became\nYou know what I'm saying that's what makes me feel good about it you know what I'm saying so that shocked or my boy JFK that's my dial right there that my dad got to come out there\nAbout come out their hand which all I that's that's definitely going to be within the works you know what I'm saying I'm going to come up there man we talk a lot of business somewhat come out there\nAnd work with some of the audience out there you know what I'm saying get my main more work than what you guys out there a moment that definitely appreciate things that you've done for me to fall so who knows what come\nNo doubt definitely um we're looking at maybe December beginning in December to sow we'll chop it up and put some more working together\nBelow hold you to all ... big Eugene I Know you want to build and I know you're going to do the\nShopping ... Eugene he's not in the building right now the other big loss Eugene\nAll right okay okay okay well I thought that's what I used to but you know I got a shot the big army out you know there are call and of course one ... lady I'm going to get back to the show soccer get up here in charge my phone some more or less the men mommy you don't ...\nYou don't need you got all the level of support coming out the baby girl greeting gang universal explosive shut them up would detect what's up you know ...\nRight right no doubt much not did agree to gang five maybe I'll get back to the shop lifting and I I write taking a coffee later\nI think I got one more you know we don't so back to the music because we have been taken over here six to eight to five six years easier when you go\n[noise] [noise]\nYeah [noise]\n[noise] just saying it's saying is getting the same color as saying from the motherland look down and see the world of my hands and ... and I'm just hit a focus on the plane then some days it's like the world are stuck in the trend\nIs not the most pride in being free immigrant is why they hate me just to me and me we want to leave over seas we will under siege leaving Channel's great love is deep\nDeep vein forties didn't have all you'll have a boy in a way I Believe that they love you that you know you can keep that\nThey don't want to know what he was just oh you this belief that the feed the people around you and you'll be raised and what Thomas can hardly even keep track you know democracy for didn't know that you know that's why I got to make the money\nThat you do oh no\n\n\n[laughter] yeah\nA lot 'cause we're in a while and we wouldn't make some cancers shootout\nPut that in the yard and they could ride herd is what I catch him in a row in that case the president's\nThat up they come in at that time they need your friends but I think we're right but what we watch them by Japanese friends up friends now I don't know the only thing that was one of the little girl got you got a high speed cameras being that I'm an\nAfrican nations managed and they never showed a hit on PBS propaganda no probably not going to tell them I got a hammer you like to play with what we complete the gravel sometimes I came on my mind was starting to handle the lights on the line when you're young black friends or not\n... a\nPrayer and fasting model\nFor him\nAway\nThem to\nThe old law were native breakthrough got babies up and then they tell us that it's fake news well you know we need a breakthrough build a fucking guaranteed people break through I worked at had like that you could tell them that\nGet in a red but all these snakes don't tell them that they already said the trans border million Brett I'm going on playing and I can get the putting them back\nPulled out here on the news is good news but again we're all just rushing through clues is less than a news and you'll find them humans that we can do more than a movement\nThat watches to perform used ... who was wearing they only wanted to do they do with when Europeans blacks on a foreign Broncos the president would rather than deal where orange jumpsuit entirely on and\nOn and then by\nThe police in the minority Marion on June\nGloom above human reading deliberately treatments to find one\nWe are in their new immigration for the\nFact of the matter is that is trying to get everybody in this country or for trying to get to hear your new same area where he's talking about whether they're going to say we we we are hauled immigrant\n\nMm yum this Joseph all my mother lives in the logjam in people's incarcerated for those way making\nYoung in the house and now this email they train them the world the way it's memory state the grains almost brother is locked down what high number and the young hung up on to these last ...\nYounger and it's a new world order for them in women and children to be just around the building to keep what killed in the project was like Vietnam vet dumped them all several threats have been become when it comes to my building complex that's the one voter junk I'm Ken much like well we're going to prevent thought that was raised on the straight guy and they change\nJobs reject the twin towers I Know what I'm saying the gay bring up at the same thing\nRight now in the ... case moment of things on this role play those roles honor to be the whole mission there boy the sleep well not a role model a well garbled the bottom of the novel that joke both the ... the gospel will solve some don't swallow home and\nThey polled and they actually know the like but it sounds like the average is down but if you don't mind to the ... the size of smart you can't walk out of your life away in your life away smoke your life away all your life away dream of life the way your life or way to do the same way\nOf voices rise from the moon is from the norm\nFor representation of the family that lost one\nOf those things costs no rush into vicious families you know young viewers are executive was ... and they were places maybe being wrong with this particular way says it's going to say on the faces and their beer will remain the mothers that can't be the main\nThings where he says this morning well rather specifically from hell look on my honor lightly videos brings me\nAnd are hitting the passing train this can be a little thing and just do the ... the lead swaps was huge Donald him as this give me your name whether it's saying that they let us know when [noise] jump\nFrom war innocent blood spills but said to school they go all the way they handle let me bring this relied more prices would we go again why Joe flourish in having an older brain ... my son got me locked in prison in Wyoming job hardly remember he moved about religion and busy and blow some in as many of them\nAnd the ... bridge and the middle of a plant that's progress become dominant America's most wanted like doing it won't it doesn't have the three some satisfied have someone to be down this young guns in the jungle free which they're almost be someone's out\nThe one building one clue is grace and they won't mother lose the candy three seven's right like we'd rather\nThan I Am writing this man will be limited by playing the game is the ... with all the records die young and a hard job and\nBeing part of your life for wages rank your life away smoke their life away while your life away during your life but when you're like wait just sees no one was saying why don't you see the same way that you see the\nSame way out to just go to the pool that what you're going to get up at this point they should in order to do with race focused on the whole block that the trap read the high school dropouts one that's being allowed him to you know Saudi hand but some of our ... for making profits\nSo much and the city structure or the place where you minimum wage was reading in a number of them are living out in my lab low when that show up to a lot of blood bond and bring it down applying\nThe law was for the ... the weather's ... blood white for the cognitive bongo drum notice a lot of betting new to follow the on\nAll the light blonde some might sort of find out who is well\nDo the song green all my new home mom\nThings they found young man and Billy Joel Rome don't want to like you wrote day to the gym or the glory days you have a head\nIt'd be warned us Naval War American Dream no more gas ruled by reading reading on weight bearing on the baby came out and jump on\nTo major in math margins on them and then re green blocks of the night shift boring mum on the floor Jane get longer you know long ago Roberts was young my chain Wendy Sherman who may be shown hand part of your life away drink your life\nFrom your life away from your life the way of life for wearing jeans you know my way to be more strained why I just read from the same way\nWith the drug dealers and right now I should I pay to go but the number of stuff and he still holds back when they're not going to change some more [laughter] pleased with the book listening back to back perfect but our relax you know my\nMy gosh\nIn my God oh my oh my God oh my gosh oh my gosh grief coherence carrying weights like see I'm trying to extend\nCommission it could be a blood and treasure chest low to\nMe 'cause I've been accused of milk show but I Would have no clue that never liked him because I keep up on the low to\nYou know I got to shut the world's him does is he a when they could just see if they could get to watch it used to do to lead to hit the speed with which is like putting him in like which\nHave to go under state law that part of the day for it just type in a band like a party drug because they are taught how to cook in the kitchen and watch it on\nMy my God oh my gosh oh my God\nOh my oh my God oh my gosh oh my God oh\nMy oh my gosh oh my gosh oh my God [noise]\n\n\nShould be as they go they can turn back around to the river road alone here where I'm\nSpending spending that we got the job and then that that many in Turkey you're back to pets hanging out the window meant to me it's been a ... it's been a while but\nI Know they lack of known and well I'm about to God's name oh well I'm about to get back to the one about\nAlmost ... die Englewood new way to check out of ... that you make your nobody was holding the day was old enough for me go drink originally on their own ever for a job was catching banks and one of those people that work is being attacked rain ain't going on my own ...\nMy brother in law said proud damage trying to get it back very well in in in ... that's why they don't let women because I'm not really the bricks only the ...\nAnd I get it set it on my next to ... say they Teach Like a new plan maybe mom was pregnant the main one like in a about a year because our day to the city as the cash and they know their ... and they say we do when\nIt first like to be able to kill a lot of that whole new ... not that they want to drill oh no no I Know ... doing that loves me thrown into demeaning big and trying to tell the pillows I'll be talking to determining\nDaily here I don't want to go though we may\nThey may they turn to a good they can hang dry the germane demoted bang bang bang a family when they want them I'll pay total head came back to being involved in it do they get it done and they don't fit in twenty three and one day that they get a ...\nCold blue jeans on you look like chicken pox and I've done that guy that you know need make comments dog\nAnd then they come up with these you know ... I mean I made that him and I heard the political ... reading the way he flip income\nBritish run around the dread going\nRight around the marathon\nGo set a negotiated a Bull Run around they're\nGoing to go run around more mess on\nRather much jak going\nOne man's last year and spend a lot of spending more money to throw it all got to drop on them as many as ... random\nBit taken by the window regular prescriptions not spending what am I ...\nI Know they can make a boat and why motor God's name of it one more to\nThis but did it one more to almost hot in the summer during the ... from a hotel clock so you talk about with the regular school buddy drop drop air power\nTo bomb us or do they come out with a group of that\nToo but we'll let a blast\nYou've got a lady that it's been done this being the Wimbledon title in ... it's been about spending more money to go to ... ... ... they\nThey go rather than to go to [noise] go I've been to go but all you really [noise] this is going on [noise] I don't think of maybe guys bundle Newman while I've been trying to do with the man\nI was I was making more money than a RINO now we've\nGot most of the soda ban on me you know Muslim Jane my\nIs may be even give a byzantine jeeze what you believe it will just from the big good Disney though as we leave out new ideas I'm Sorry what was needed to be a no need to do so no read about spend does that mean spending one motel gets above [noise] so you made\nAny woman will spend about getting one more than\nAll right hey we we got a call on the line go ahead\nYou go from one county for\nOur your plants that were seen mhm right\nWell yeah just a matter of falling down\n\nFor me me me All right I Want to bring in court for like\n... so you can you can go around and seeing for the next month and make everybody mad\n\n[laughter] All right I guess that you cannot you already know hey I'm Nicki says says she sends a love for me from herself and from the children you already know\nWhat it is so much that would be\nAll right yeah definitely no doubt keep us keep us informed\nMe that you can\nFind you again All right All right take care\nOh right man shuts Dane County sad to everybody behind them was 'cause you know you got love out here you that love out here definitely I we're going to get into a couple of these requests his otherwise I'm gonna have to have all these calls come back to back down but why don't you plant so here you go [noise]\n[noise]\nFairly low with these strange I've seen a hundred dollars for the bad ditches run in well I just pray Bobby forgive me I see myself as well because my money\nTrying to please a bitch at almost drove me crazy I was breaking brand wouldn't exist that was that we never change somebody's\nIt was twenty three and one woman drove me crazy in the cell phone to enter the feds [noise] I just want to make it home to see my opinion\nBut the streets I seen a hundred dollar hundred thousand child to do both I wanted to bring them while do a drum up in my forties shoot a hundred times when the Dow my cousin is loaded mind somebody\nIn the first time he gets which just died like they can buy them to be the\nOnly thing I said I'm standing on in my job in the feds you turn it on I just worry that you know should the mom was in love with the streets I see no hunted\nIn terms of trying to make you feel the stretch she's a retail so recently thrilled to Capitol Hill because everything that we don't want to kill the bill combs and football players they put this on the shot but straight multiple getting caught up in the back room and who do get your flight to seven\nFound again one branch respectively your job this next chance for\nTo do that for that Senate just west of the place to the pitch she wants to try to stay out a lot more than the man who just lets say should stop it was sold out making the grade up production will be put ships that pledge of allegiance\nOn the not for me to not be in this must be just a little bit shocked the light we ended up my son will be\nA deal is strange past cream cheese on it for me one of the brain tiny plot I don't claim condominium stop threats like the\nMay ostrich now for\nRent on your head bottle of ... home I think it's more of an individual metropolis the brass writes apocalypse you that the cloud\nTo watch it up and my\nI got that used to fail to put a cure to say I went\nGold except when production corporate corruption I ended up sort\nI was just a little dog in there and all of the well cats playing clad say twenty attacks who who seemed to me my eyes flash point you can only play three forty you're going to catch much money on your late night candlelight playing with a white flight with only ...\nAirplane right to work do I want to get the money they say much plastered on fraud Cypriot the Germans want him gone to jail and the next week as we bought it gets all puts Bill White mother lost so much in my early on saying that there was a real eye opener you just\nWe ended up as say your brain to live so long\nThis is John to light a guy when it comes to you all the time on his time goes by ... by now\nWe ended up just like your beat the smart so this is Josh Josh just light up the guy we ended up just so you don't mind [noise] leave that\nIs less some support lift rules will be a she'd pull your money should be [noise] [noise] [noise] [noise]\n[noise]\n[noise]\nThan what we're talking about\nBy\nDown in covering the best\nTown trying to make a million dollars\nKind of\nYour darling blah blah [laughter] don't\nWhere you wind up in a way\nTough man because he would have to\n[noise]\nMuch on\nBall like going to talk for a moment that decide what to make the meal you got to stay there and the government how to make a joke but I like\nOnly on the job or even above the gene\nBut when I'm In a book about a bond there I\nA little bit of both the both the money and then then on the park and not the ones that you know I mean money and the main\nWay one girl's you give them a day to day on that end up with all the money they can take the data from a young lady\nBut there's no way\nTo know what you're looking to pull the trigger waves\nJob you're doing what are\nThe time oh but they're going to see the memorial\nPlayed by saying you know they can stay on the plane but\nYou don't want my both\n\nWallace to regret but general both got the Muslim right wing back in the ... the law\nA eighty nine point nine F. M. W. R. T. right here in Madison Wis skill [noise] and also\nThe radio in NYC you can check it can you can listen and you tune in radio operate on your phone if you have to go somewhere and you need to bring in ... and see All right we get a caller on the line on your life I don't know\nYo yo yo lose me\nSet up some woman eagle might make a big part of the Martin Luther you a little bit far from where you live up to have to\n\nRemember that so many things to come in [noise]\n[noise] [noise] [noise] [noise] [noise] it was you\nKnow it's not only of California are you still have to know\nAll right hey I appreciate the phone about\n[noise] [noise] oh right yeah\n\nYou need to be on I'm I'm trying to put you live on the air go ahead go ahead and see\nWho you can forget common you know\n\n\nOh yeah most definitely\nI mean it's\nAll right that's what we'll talk to you soon you know\nHey it's free said he said he said I think I got I think I'd get another caller\nAnd\nLet's get some callers on the line eighty nine you live\nIn the current John and give a shout out that the big not keep your head up the last ... yes\nThat's what's up on it\nShe said we are here to judge you can put your Mike and to see it in in that thing in that thing and I think\nA lot more so man Charlotte Charlotte's Mr Holland also as me yes you liked that formal first paper Nick yeah nobody knew where I stand [laughter]\nWe get another caller on the Internet Ninety alive shut up\nHey I Want to give a shout out 'cause then don't say no that's not to tell them to keep its head up and then stay positive then it's time I've done some\nAlright hey I appreciate it thanks for calling and God Bless\nYou pursue it about two parts it mhm I mean it's so that's a terrific chef\nYeah rare ... abroad doctor who's outside but I read the message from devils lake comes out on you to Halloween riffraff shout out to ... to me\nBut we're the point now where everybody knows when a movie yes I appreciate\nTo open my own little boom bang bang on it at the end you wherever you Nineteen eighty five is the worst the lightning to try\nAnd more money they wouldn't have law you have only knew what was the common story would change but for reasons unknown maybe you can explain them memorial donating you would pay\nMaybe I could understand was too much and then you never really had to have a story but you will man and you know most of the day what is that you would have been rated knocking on wood you know in the morning and you can\nNever learned to type ... years old and already in the possible for me I was alone time some may Twenty years go by and I were name to go ... miles long boom bang\nBang and you'll problems with the worm may ... may Twenty years go by nine or name\nThe open my hospital boom bang bang as a young ... years old or older middle middle school trouble making young men we keep in the mail man\n'cause I was at a loss how to play to have that will do what was that I ran away from the state that I ... I had to build\nYour career criminal juvenile delinquent as you make a big ours is face to try to paint me I was wrong sent me to Nick and healing and what I could learn a lesson was left the\nDecision a confession that there will be\nPossible for me I was in ... Maine Twenty years go by your name to go up and my father you know boom bang bang age old problem the worm may ... may Twenty years go by nine or name\nThe open my eyes a little boom bang paying\nEight Seventy two thousand and three the worst thing that could ever happen happen to me except my mother was dead\nThis is Jay how was locked in a fuck you know losing my brain ... told you that you do a luxury ... jobs in order to ... what you would ask let you wish to be dead on that when she heard it's still ... there's a God I'll be damned due to hell with boxing you first but even a mistake you know ... book to blame\nWant your money calls holes in a welder Fisher British ... belt\nMay Joan bad you know hoping her to maintain the debt is yours alone you build a pain in the bed\nAnd you also known you don't pay and they will go down the ... main and that was a long time for me Twenty years go by nine or may take a look up and mocked by a little boom bang\nBang and Bob's on the worm me was when ... may Twenty years go by nine or may\nTake a look up and my little boom bang pay\n\n... a\nMan shut out now see that that was the dope actually I Want to know the name of who was on that one\nUh I guess I don't think this email says who it is so let me know let me know so I can check on that but for anybody that's listening that was recorded in the prison system so show some six but yeah they're free to\nBe careful I kept going home\nYou know the deal we're not done yet though\n[noise] can\nDon't mind the girl who your legs on me when I slapped me upside use 'em ... mile run around and more important than the president you know we're always do they'll never will [laughter]\nWoman's time with marches countries we have what is it on just goes ... doesn't fit [laughter]\n\nYou just draw no he's a he's a rich\nRich or the middle of the richest negroes or do I had a great topic I don't know I don't wish to me that she comes to face on your new Cooper takes on your English class but which man on where am I supposed to be with my mom or ... from my dad another role in\nThe printing money how to really do show up front a nigger thirty three pound in anal Patrick Ewing yeah don't ask me how I'm doing in LA say only maybe you know cool ain't no money I Move\nInto it right now I met a girl on how most of them is with my guy he directs them when I slept with me pesticide use them one of my style when it comes to my house pitches running around and more important than the president you know\nWell what they'll never won a bag a women's time with my kid comes stashed in hey why did I just made the mistake of\nGod\nPut on my blog two million and cause nobody from my side of the town would be the dollar a billion dollars on a dying on my wish list\nBaby you 'cause my ... I don't change this is my little clique in my neck sultan ... if it costs a million bucks and they don't ... I took a college student so my speech I mean almost ... years old I Know all switch on my toes be like down he I Love\nThe ocean and luckily don't change [noise] keeping one line to which you keep it nine percent\nI got to cut you off ... off all met a girl or my family is in my guy rex on me when I slapped\nMe just say you use bombs worn down when it comes to my house which running around and more important than the president yeah yeah well what is beer but they'll never met with them\nWomen's time with my kids contracting effects and hey why did I just going to do that doesn't that sets\nUp God\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise]\nMm Mm\nWe're planning on your on your head\nThat so you know\nAnd then later [laughter] and\nKind of a lot of [noise]\nMean I got a you mentioned I mean I Lived in my book for the young\nMarine no money some really young man in case of morality no sleep when you get more really young like\nThe main challenge\nIran or Iraq ended up\nLittle bit of a red light on your holidays are there every day life a little bit safer from quicken or why is that\nJust say take 'em out came came out was that was the lead us out and let it go but I guess at least\nBack in the summer maybe you know light up against in the planning you know is that you know those things\nOf the late ... let's say get in the streets were not dumping tightened the murder rate increase\nDown that path and same with some man\nOh there's no you are listening and diamonds are a lot\nMy hand for example you've got to stay with the change that raised in\nBritain is a drug addict and I got into towards that can get away ain't no remorse he faces\nGuy that you mentioned meet them at the same time [noise]\nBut my ... case by case a Mormon and see what the rest of the\nDon't know what I mean John up or\nOn a rattlesnake ended up around\nYou're missing the gene randomly and then you may have spring ended up getting having those things I rented a nicer random were me like you're bringing this may get the\nStream of freedom is is my land boom of Google McEwen I couldn't get on with China you know seeing that and\nOf the strand for everyone to ban now\nDon't do it in a piece of the gang and dance to see what\nThey ran into the wrong mine and it's like\nTo to be right back\nAnd then a no way around it\n[laughter]\nI Know\n[noise]\nThey didn't say nothing to do about it\nAnd it ain't no way around it\nI think our biology I got my dog I'm Down\nShe not only one I Will only garden I really keep it up well wait in the ... mile down the street or not betting at all do\nThey do nothing to do about\nIn any way around it\nI think about the camaraderie the dog down the\nOnly one I've only guarded already made up last week in the bed with a buddy Bob my down you don't have any and all but mine are just\nTrying to buy your dream but then you won't allow that to free the whites are passionate about it about it\nIt's well when I was\nCan go to ... oh [noise] she was some of them are God she was all of my job and then at the\nEnd of the ... when I got married like love\nSo you won't want to work on you when\nThey nothing to do about it [noise] in any way around it [noise] I think I'll Try it out I got my back on my down\nSee not only one I've only got it I really keep it up in the best you even though the public my down based you know and I've been in all different\nStages dentists enough in the news about\nAnd it ain't no way around it\nI think I'm about I'm a rabid dog down\nAnd you know only one I've only got it already made up in the best buddy Bob my down and you don't want to know do you buy my\nOther way sometimes got actually lower down with the three some evidence on that island or something you write about when women do gum [noise]\nReal numbers she never backed them and when I'm the owner of somebody's\nSort of got my brother's going oh my God\nAround a little reduce the most about\nJob so she just goes\nSo your friend but go home and told them to the phone so none of that you know they just let the rather see you're only\nMaking up in the news about it\nIn any way around it\nI think all the time I ride a doc I'm not down\nShe not only went up well we'll only guard at our ... in the best you even go to Bob lick my down the street on I bet it\nThey just done it up in the news about it\nIn any way around it\nI think I found it on my brother died down\nAnd you know only one I've probably only girls that are really humid up in the bed remain involved to make my down the street on that in all do\n[noise] right\n\nYou can get a mission they're against do if you're going\nYou should stay on as long as far as I Know what I hear\nI think she did she say students on a pie by every other minute and we'll begin\nI Want my son is I think she gets students don't apply buys\nIn another dialing in may and the other day that the\nThey some of them than it does it go on and that is lay I entered the building is saying the other ones are just by the Bush because then they go to ... to to go to the Democratic candidates met his butt in may and June ... doing a judge our letter legal way\nTo do about those bands and don't run dry\nI think she did she do they thought a pie\nWhy she ran on my mind I guess\n\nA\nWrite in your life and they're like oh my\nGod just running up high you can't do that now that I write and thank you and let me back then that aren't yet right yeah\nYeah I suppose that they have a good night\nFor the court made clear to\nExcel eight to five six years\nWe still hasn't has shot up if you want to give us a call got you yeah\n[laughter] [noise]\n[noise] start backing getting stone ground much recreated on many Joe blow you ... ... ... my hand ... Deborah Dan gave me\nLike a place like a guy like a guy like a like a\nKayak guide to go out by pure Poughkeepsie the White House which is why you have been garage a mess the bedroom and the good deals are liberal on the phone book with me because my wife both almost all my money in my book is why both be hurting Udall moody below ...\nMy ...\nMonth that would be my my trees where she did she do me wishy washy likes to ... in the jungle with the more liberal ... meal she got too much you can\nWe do about one beach and then you'll do get mad at your company presumably they weren't going to these two story we just finished shots twice over into his ... his birthday\nYou know where to go jump in comas or trained by a little like both guys to agree with the judge on what she wants to be for like ... ... people around me\nOut of the eyes of our little girls who you think\nIs a Muslim balling oh backing gay stone ground much created on many Joe blow your friends who are lonely ... noble rumble them my hand ... go to Deborah dad\nGot me find like a like a guy like a guy like a like a guy to go out of my pockets like white chocolate Jews like Yemen garage a mess the long run the liberal and\n[noise]\n[noise]\n\n\n[noise] would you look at least a half times the um [noise]\n\n\nYeah but like [noise] in your life here with our like just a lot of shit you know what I'm saying [noise]\nLike you you're going to listen to him more for the weather like\nSomebody out of the nation from like in my day you're saying [noise] in a light [noise]\nBrand names you know like I Want to be like [noise]\nThe one most for camo you know what I'm saying when they need to\nBe the\nYoung\nTo push a new in the way they do they still let me just like you know the\nBring our race will call you know I got a little bit wary\nWeeks I'll be honest we got we got was ready to him as much\n\nIssue which\nDo you replace bill between the the more\nTo be treated me so I think the busy\nWas leaving\nThe company that was one of them at least not in the middle east are\nBringing in Mountain View of the top of the sharing the same as being so [laughter] so I think I Do read a great deal\nTime where we're being told you\nImplied when now with your pets you know you feel like that you know quite what it was in\nThe middle of the memory allows you to do\nI think is a way to truly a\n\n\nYou\nKids need [noise]\nBe glad to use their bounce back you may call Bradley Blakeman not Damien ... we ... about smell the fear\nThat not inhaling detail how well we re say a little bit in them that you do need from don't eat meat homes do move in with the down from the booms in Cancun drone ...\nLone gunman then yeah but in your mouth\nThat they do that you had\nHad to get that one I saw an ad badge\nHad to hit you know they're making me by to get about ... what must do\nOr below ... built where you at bistro ... back and let me go there when I got one of the whole bit\nThink that that brings me dialects or where they they don't mistake him saying you're white data been trying to pay your rent or to me\nTypically ... let me know how you feel when they broke the story that you are spread don't mind that data burned are waiting to double check join no weapon but they do with race they didn't\nDay in day to day\nAnd then\nPut your wife do picking your mountain didn't say you know but the body but you have to pick me make me don't be afraid of Grand Rapids said after\nBut not tonight you know ... there was no right to defend do gotten the permit never go out to bourbon and why do we get to where you won't be no matter how well they'll call me baby to me the\nToo I wound up being your men are meant to be able to our head you'll find the\nLet them home with\nHead with some of them down wherever legit right at the tail end of the ways in order to tell me things\nWhat were you dont want\nTo know what do you want to hold\nAnd then\nI don't know but I\nTo hear what you know we're going to make me\n\nOkay\n\nYou know well what do you know a guy that I\n\nI\n\nI write hey you're still sitting in eighty nine point nine at the end of your hearing your medicine with go sleep out there is\nA good shot in the building was take her neck\nSee for for ... for black says I Want to give a special set out to my little brother Michael cinnamon he's into any kind of you are right now\nJust took a plea on a fake case we dodged the bullet on that well that led me to death for go ride this out and we definitely make if they have and the day now if wherever and yeah again now just no ... is a light at the end of the ... the same thing in\nThe eyes and we'd go spread you're going to fly free be a set of emotion let's go [noise]\nBeing\nYeah\nThen when you say with some level that a lot of ... ...\nYeah I remember when you when you're\nNot in the last man standing and saying I'm going to lose levels bin\nTo them when they gave me the other\nNight and did a lot of bad days people saying that ... that was that a lot and they spoke go take a light speeding name came up to crack into\nDone blood south independence vote and then also had an ... even the moment I\nG down through the front do you think that they've been if I bashed wouldn't be surprised he's on the glass you praise them being trained leaders I should pay me get an actor police when you're waiting for me to have you would need to bring up the gates me not want the money for the some of the beginning of June ... games at\nThe ministry me down for guys don't don't park built the there was a great product that my hand down side and\nMiddle school they wouldn't tell jokes and grown to the brain you know the phone with them they will let me say little dirty it inconvenient but if you even knows with the neighbors would win and they can be really had no previous numbers venting now\nWith the Muslim people even most of the negative named him the next order then people will pay for a couple of things we demand some chance Sam Brown they banned it doesn't need it for granted immunity to some random ... on the bed now due to a couple of down because new demands on can sound broad they would say about that\nBlack college about the law go up but knowledge ... been bluffed into the ... or by may come at home of the main thing is\nIf you're sitting there boots bitches jealous and make it you know we trained by which you know without working or not or your mom\nPreaches omega ... by Paul ... of the bond that you go back to ... about the militia they would let me finish that cops more job of jumps don't know\nIf you've got enough to cause we can smoke ... nothing good when you grow up so we can never be no never bite the hand that feeds you know never fear may be plea to now is Nita head shots and making me to ...\nStreet and they'll\nYou can't see the sequel to\nGo to [noise] get either have\n[noise]\n[noise] no\n\nNo\nNo\nI don't want to do [laughter]\n[noise] [noise] [noise]\nWhich I'm not\nToo long on\nAnd I'm right in Michigan is brand new\nThat I'm On\nMy head was selling dope but then my daughter's been done a little bit of another dollar in a rural looking up and make a joke\nKnow when I was getting paid by\nGo we was back when\nHear about it\nAnd it's rained much rain\nRain rain\n\nRain rain now what's on the\n\nMission and we're just beginning to\nDuring my rent maybe in a dorm um a friend of his way over so it was not in the kitchen cannot wait on the porch my father was\nAmbition as much\nEnd up putting it on my name\nI Would change\nBest band\nIsrael much training now will not let\n\nMe\nWell wishes to my opposition you make your pride complete before you traveled to I got nothing against them they got about potential but area who have read gotta get additional\nMany in the streets but at least mentally I'm never going to see how much it was just after twenty three family get\nRound the row\nOf I'm losing\nMy badge\n\nBack on my\nScreen my train of thought\nGod I mean I Am ...\nBackyard I mean I Am\n\n\n[noise]\n[noise]\n\n[noise] [noise] oh surely\nOn Monday we'll send that to my game and they can't get a beginning\nThem I said they're going to bring when no one would remain there was a big thing in the bank game I Know it it seems\nAny reason I've been I've been in one day we'll send that to my game and then they can\nI say bull and if and when the homeowner man I point\nGame I Know in the same time\nWould bring them in the morning I took a future would I Would say that the one thing when they go to a woman album manager now don't compare me the\nDean of the one I Move around the training to do what they do make their own where did you how do I do and then I did I mention to dedicate any change the way they treated then in the\nDoor is to bring in a ...\nThat you're going to end up paying a trend in trying to build whatsoever to build ...\nLet me tell them that way now to Bill Bill with that\nBritish destroyed our mills and all that Bush\nOf any city would be much\nShorter Mondale than that to my name is penny and none\nTheir minds but when it went on to remain on at that point I think the main game I Know in\nThe meantime and shrimp and I'm enjoying my nails done that to my ... and then they can get\nAlone when it when they voted to remain on him\n\nYou know a shot to everybody that still out there rocking with a freak fast you got to be careful out there man as people walking around and people not finding their way home and all that stuff\nBy drought I'm standing here this year I'm In here I'll spell it out to make things clear to me while you're in near I've got a ... year people wonder who's next up that conversation really in fear you represent talk much stress me out I chop a Dutch week ... now but my style as much and I'm more\nAnd you're more like a punch genes do them I think I Know I got out much my side and you try to stop and they talk rented it sure don't get a vast she gets a little brown we get it whereas the ranking stoop down and you really think he states right now\nFucking your girlfriend and there's nothing\nI mean [noise]\n\nI Know I mean [noise]\n[noise]\nMoving in the new movies\nMillion and then all of them are [noise]\nFirst of all shapes you better start over right now is that much like chasing them with your mastery while you're I don't have any interest rates for me that race\nWere your parents or reduced price you pay your parents certainly compare me to change the guy\nThat was an accent you're\nSmack Wayne as they can really make your courage to like you can pre make mistakes I made that same new places to pretty cougar Going Rogue girl\nPracticed smiles quite gushing everywhere to sing you know we're paying like drowning every movie chain [noise]\nFreddy's a mentality after the Getty if you were ... you know why these on the Sandy ma ma British or I didn't get me some our world choice which\nWe think tanks minute warning so to speak of bars in this place project doors locked door to me to skate who's your favorite shows\nMe my students to read all the written in blood and I talk about what you're talking to a lesser you can't get this Freddie Krueger\nHello Sydney\nFamous scary movie while you're moving back to the pool of capital and does not end up with\nAll the more slash gas could end up the whole of the past week that was no mention that passed\nThem also demonstrative bond is the way it was time to time is really filthy your own which you know what they call ... get it to be with you want to tell you to stay in the six day my teeth and I said I'm On my way\nThey have one I'm each easiest seat it's harder to be quiet while snapping up then it is the story [laughter]\nTo be like how my goal when I come up with and he gets to your house\nAnd the thing is my last I go to\nA focus on the monitor their upon them by broken\nBlue jumpsuit rent you wind up for you when the sun roof to get so many ya know Wayne bag cookies like bloody candy happy Halloween sad\nKelly and you're typing up your neck see me out the window people on the bed you wind up for your life I sang it in your head and walk and real but you're still going to bed I'm aware of all the all the kids know me made 'em in the movies and I ain't never see when they come off I'm keeping down the street Minnesota but the\n\n[noise] [noise] [noise] [noise]\nFriend my friend and my son\nBut sometimes I\nA forty them ... but I didn't plan my\nFields with my baby about the mid ... New York in a concrete unlimited\nDoubles and we're just directed to a yellow light basic below pop up both the ... problem and I'm not the law will not the\nMuch less than money you're only allowed to give them the knees in the book the Russians would see\nMIT says my\nBasic need even like the even the ... some teams were present\nMake sure your paycheck slave wages age and they have to admit you know would\nIll Todd Monday Night then not\nTo be alone in the ... like it makes me wonder\nKids don't you don't get my time on them but like leave out the lights on Michael like I'm like what was striking I got was from a joke you look at you like to\nLot of what's your stop me bought me just me my check came along\nThe day we did it for the pages ...\nA job to be when when there was\nBelow me just remind them we'll\nTo love didn't like every jam on\nMy friends were all day every\nGet suppose your your eggs in right so the more the nickel bag begin by saying what might make them a million or so and then make the\nIt'll pop up tonight that nine eleven\n[noise]\nLike merging but would imagine that Indiana and the grand new ... the remote control boom bobsled but know much about the guarding the\nBarely upstream then freeze in like middle\nJak you for that pope give him an astronomical original see their mom and all the heat on the protests rather than the battles we'd like to change\nThat the last four now you're ... you're going to dinner or got to draw the line with the universe is the way we hold them in may and there's no more on oil pulling more data for re in a ... year maybe\nYou're walking around the world trade you know I'm not pregnant or you don't have long hair to renovate imposed long in the battery and knock on the animals\nYou want to be proud of the whole month challenges you don't want to marry you know how you view the hammer just ready to board the ship and then we'd all be going to break the law that not only that you lead cause I Know quite a boost for the skill of acquiring celebrate the auction reconsidering\nOr when I'm ready to go or how the world to hold out hope that all of them would you leave the button to push the\nPlans freshly over the belly of the post let\nYou know it\nWas nice to meet the BP can jump up on a piece called ... what do you find the people we will find a remote pushing the way one run the crap out of nearly a year later said you know and I'm calling because little things and not in an office all the way you\nWant to get away power to Pitino in age while I'm On the bottom dropped but you have to do something and then leaving that blew off I papers the bunny in the heat and the one that was fun to play until they tried to get a new techniques Robin\n... object or ... you got them drinks thanks you bang you know the older I Know my monitor told me I like the only one in our\nPoll by camera bag West Nile out loaded on some other Palestinian holes along the way that I Can't give them ... no longer than what I have no time jammed pointing scrambling going I'm like oh you're going to ban on that in\nA little\nJobs in the [noise]\n\nNo but we must have a treaty was left the smoke on the street\nWhy do we feel like I'm up by beyond like he'll do quite well with that next week I'm probably\nJob to our\n\nMy\n\nViolence in the ... the data just the love\nOf the way about what we'll play blade which will be able to balance my older\nWalk by them but my mother left by the gambling and when that like myself blessed her\nWe are the ones that were they were not that 'cause he's the stuff we\nDon't know who bought those\nMore than me we may just put on a plane just to\n\nTalk\n\nThe new movies\nYou\nCan\n\nDo is you know during the day trying to channel way kind of get rich in maximum like Ninety here with a a nice way to hide then I just wanted to ration got me doing it on my back and landed on with them\nIt takes to make the stress job is to get money like we have to be you know in a written policy my doctors who from beyond the whole place for probably you're good to see the climate in this way I wouldn't say max real blast here that was real basketball\nAnd then he couldn't have the right to do you think he's going to call but we had to stay healthy just off the back door works now for perhaps go with the tax cut marks the ... the co ops lipic gossip and the Piglet thing in the kind of things are trying to stop it as a profitable part of what's lovely the biggest kick still practice my God I just want\nTo start my own work blessed the bomb was the power of the black man by\n\nThe way you know in these won't take Kobe's like point in all ... they're going to slavery or whatever the dolphin garden party leader the quick to know like ten minutes has so many problems plot like horses and so now the city's a phrase you\nKnow we're not wait the beep right of course go Monday gives the Braves gone down the similar to the terminal blocked up with the kid will never happen to blow up the other based on the part they clip minute travel and the U.S now blessing moment while I have\nThe jobs are they going to get married to print the family in the plane will be will wake up in the camps that they make their broke yeah go watch back to the to do start to make things you know real carbon independence but you're not going to try to make a point in the\nGround today the cost of what they had the crack the cap\nOught to try to make it but I have tried to take so many ... freedom\nTrail on his ... west ... even ... bother me your thoughts when they're playing the mountain and it would be you know what the candidate bring them like the emails on still don't want like the liar I\nTry to like ... billion that limits it that way so that was the original was the last ... last\nNight and [noise] you know [noise]\nUm [noise] [noise]\n[noise] [noise] [noise] [noise] do\n\n\nAny\nBusiness in the in the age thing [laughter]\n[noise] [noise] [noise] [noise] [noise]\n\n[laughter]\n[noise] [laughter] [noise]\n[noise]\nWho SHOT Show up for the call too quick to strip the song goes to the brink hockey here's what tripped compared to the parents wrong\nButton for with the cold during this whole just not enough to make a book called the top of my life on the drive through your ... small around the door the whole school and the more appropriate for\nLaw [noise] my mom would\nFeel most games I Would say so much snow with over the place where we are to you they say oh I'm going to talk to them which was the lead proves was big poppa\nWho's going to get married because of the cast rules allowed me to go out and buy the book\nWas written about blonde and palm and pound good for me was that boys\n[noise] [noise]\nGo on to like the whole\nMess just drop ... must be going to watch my back to the conduct you didn't do much disliked must be something from\nBoth cost me she was a man that just letting them like the commandment thou shall we talk on the left out the steps will not drop your meal for some time now\nWhen they showed the home a lot\nTo learn from them so to speak so you know the late ... where are you going to throw the look look look\nLook look good on the rocks and soil blood intrusiveness in the\nMilitary will not let me\nTell you that\n[noise]\nOr [noise]\nOr a bus to go to the grid like during the ... were made of Iraq being bombed by birth on their way not got told them put up with the head bowed they didn't catch the bike for the what the them with like on the table\nBack give both put that on the take me down to ... to eighty per plate that kid what the base back their dollars if you would know that what the turntable damp but might fall I used to\nWay to outlaw\nLet's\nBeach and\nDo well with the ... gone down like you to try get mine go up on what round I like ... rock band\nRom and my wife would have to do with the time they never threats without them I get these like ... and the boat beat up the ball Mikhail wrote it down what got laid off their\nMoney where the ... the border but rather\nPay would that be like cloud get ready for the break their walk up the price hike\nSo the yeah the thing is like where we had them before they would do\nWithout make get paid so much to go back to sell a mix tape I used to\nWithout one when\nOne to the to to avoid it it's the only one in ... in so the black Blake Leyh ... wants to do but it's been the ... no I get up that we get\nTo that part though when they're around town and get totally blind to live on the ground well there'll be yelling in\nThe blood that didn't make the get go up to ... and you can't let that he gave me ... all one big do they get all that the steady during a two week well well I used to\nBut while might now be\nWith\nBeach\nWay\n\nMan a man\nJob was the one that you were out to all of those to put them back there when I started back in school and\nThey're not as far as the the not by the the the non upon them by the\nBy the way more about how they might they bowed illiterate than they are\nThey're not into hip hop plus it's been a little time with your\nMom liquid making wind down from that he doesn't look like\nSomething about migrants now called on these you know ground\nWrong like Hong Kong is what I didn't know we don't want them to the hospital in mind that the guys are marshals back to get beyond just sit tight\nSo as long as I got a bomb on Columbine and they're going to live on the bottom I got on them without going on behind the for the one that you know I never get along with my phone plan your boss on guns don't make us noted on these men and like the boy will\nAbout it you know with all the time they don't get that looked at all because they're not trying to find them like if you don't like we're told that I'm not going to say now what that might have gone wrong\n[laughter] [laughter] I really\nDon't know what was going to home we remember the show we did a Modi eggs and in the ... will be with all the way it is a lot of the major problem now with like make us off his weight they even with all the ... the clown why'd you on a plane and\nThe ... the place to live with that is like a poor return the Ron Paul Mulshine hurt me I like the ... I remember when you\nWant to talk to them like a J just going to come from them as a matter of you know we try to fly on higher than that shit like that on one of the game like during your don't drop drop track now [laughter]\nI'm the J. O. J. D. on you know we are going to look\n[laughter] June [laughter] him green\nGirl sending a bitch rolling up\nOf doing it with them and they are making up a little strange because even though I got all of them are even believe in the long run\nDo\nBe\nBang bang bang bang bang bang bang\n[noise] [noise] [noise] [noise]\n[laughter] [noise] [laughter] [noise] [noise]\n[noise] [noise] the\nPain and bang\nBang bang bang bang bang\nYou know my little eight of them they\nGet out and go round with the power strap on the side no actually it's a case that got us full circle raft has shown that day because my dad I said why blonde hair 'cause I just I was a threat for example for a number of all types\nOf people thought that perhaps they locked in a long time to kick me out there like they figure that and that's just from history because we saw in ... and I said oh that's right in front of swat sway yourself up and down the road trip my ask us\nWhat might happen to have like thirty two year old boy here and now we have well by the time\nWe went to go about your travels\nClass front to back off\nAnd they got it\nFive grams of on a contest between\nThat and you don't have you know they'll have to chase the brain going down there and bomb about ... billion dollars a month just ... Iraq most shot him\nTake his phone if I Would say that they pay for it for them to overcome the ones that everything's what they allow more point ready to blow up a no slack for black not represented don't love me when I go from one for him come so far off sweat stuff all the trauma from Miami\nAnd what you're doing now that might help collect no\nDamage to look don't that looks more wind it written down upon their government ruled by the way the number all turned up\nOn long drawn out eventually gone gone gone\nGone gone bang drawn\nMartin I ride the not the right or wrong why the cause of the gang of ... the wrong threat now to manage\nThe rabbi ... style odd looks up the phone Joanne in hot ... learned your lesson black or white twenty\nPounds every we're right here between me and to me that what it looks like round the way you don't have to look for ... sake you know in my building wage went up by the by the time about reality traveled anywhere but roll with the degree that\nAll been drawn from getting a gun battle\nIn a\nWay to do a lot of those things on TV I'm gonna do like to go down this year will be at the end of liberals and around the novel applying\nFor that battalion light years behind the scenes like on a great job and last to be where his lap and yet it down like objects rock and it's ... ... American the charges me Patrick some of them lives on the\n... district and the daily missions you Lynn\n... ... like the bombing them you'll be the only choice for our national naturally to me is rarely come in\nThe little ones I like the Japanese Campbell liberty a key role to none lead over there is what we should tell you loan enjoy themselves now why do you where it was created on July ...\nShe'll from like one of ... them\nLet it be no progress just do\nThe ... the height of its own sleep lean am naturally role but even in its own like dungeons money you're studying knock on their feet and burn it said was like a man would not have reality machine the single count of\nMonte changing became like the ball and then the oil from the strain on the now with the national\nIs handling\nThat marriage is\nA little border town\n\n\n\n\n\nUm [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] I Know you're ready so when you're buying largest but no no way that we do to ... and you'll get they make you know what else would you be living next to me Ken my way learning to watch them when they're\nMaking up or down the thing about the way you know do\nMake the urban lie\nFor him and when you know jobs are normally do them little plane main domino rang\nIt will change going on in the pre born in trying to get me wrong but no one I went down on that no matter what state is going to the wrong thing\nAlone I Love listening to this day and\nI Can't cue and in the back and read\nThe long run because you got\nHave you\nBeen with the low paying your rest born and raised\nOn the brink yet but that would end up paying you know money where we do\nNot bring the low ... back to what I'm doing my pockets bad it breaks up the kind of thing when my kids when they found the need for them at thirty Williams in them and you know don't blow Don King you\nAbout that at like you know I'm In law and the and the mayor like more than likely but I got to be in the ... bombs are better than the ... made out of bed and you're going to be able to tell\nIn the black cherry automobile that's not what Bill everybody claiming real an old until but I'll be on the ... holding down from above ... wrote that while I was like ...\nTo get your Hogwarts don't then but now I'm not like white blond mind runs the black cats\nYeah you can't get jobs to play the prayer low but there are three ratings and your hair and your eyes to bring your last record not I think the job when we have a prize\nLot of anger really want to play because we'd be doing like a big day doesn't like that and I got a job like that and something like that a premier night and put in your bag and the higher you don't care about you when you're through them that gets that Iran with limited good you'll get down which I guess we become then went down to it got better and more shit\nWe got that Russian on the island in the end of the Beagle you don't want to end up being you know the time they didn't want to try and think that what you got there I Am the\nMother of a nearby you'll play that hey that is no down by black boy black boy turn that shit damn bought that now feel the camera and my style\nBoom boom boom in\n[noise]\n[noise]\n[noise]\n\nWent down there not just got to go to bed at ... the ... left up here\nFor a company they'll they'll look back at a greater let me do you know we're going to buy them and and I got the but what what no no we ride with them they both men and I'm flipping the meat sauce but probably by far the biggest drop in the ...\nBrian go early locks made the ... and make a dollar above the ground up for me but [laughter] but not what you said none of them don't listen to it then you have to smoke the smash mouth big donors laughing\nLoud he wouldn't let my God now than they were just regular brand new five dollars a game of ... problems like that get the broker those like you know the ground I bet I had to get back on the government\nYou\nYou\nKnow you\nDon't miss it that we both grew up in the snow we make a new one up is the best bet is mayor jealous that you've passed on to your to your chair and I have\nWith the money you're making your rubber bullet wound up being the ... of it again and put it up in that first strike slap Rob read in the ... nothing\nWhen just relocated real great up the hill jumping up and my eight to ... get my knees hurt when it's not going to make\nA bet don't want to grow I let him walk up apartment jumps bad to go out and walk in order to become a ... must be above the ground the guts to do with that\n\n\n\nYou know\nRest of the night clubs jokes\nThey're talking about cricket type job jak than it was not the passenger seat I mean I don't like your previous light not your today probably three years the block as the know how how much less well let's talk about is coming up to bat threatened to kill you know how we deal with\nThat with the ... in the\nMountains very little college can be put in your piece them here and there was the limit is but not the book we try to light up and then they put it up but now you write them more posted outside yeah I'll go get rid of the country\nAnd how we want to agree to stop making with them at the family to do when they\nYou\n\nKnow\nWas\n\n[noise]\n\n[noise]\n\n[noise] [noise] [noise] [noise]\nAre just\nPrime\nTime that you\nYou what is the guy and\n\nNa na na na\nMaybe the will like go more than a\nChange\nLike you know\nOh no\n\nOh [noise]\n\nOh [noise] [noise] [noise] [noise] um\n[noise] maybe about\nThree\nMy\n\n...\n... should be\n[laughter] [noise]\nFor for the lower again next ... will be\nYou know very very\nYoung stood up and said how do\nBut I was caught I'm\nSure I'm\nSure my son is much\nMore than just about\n\nEvery ...\nA man\nWe will be shorter that lady as a\nMan by\nNew law will\nBe sure\nHe's just like\n\n\nMy\nMom my mom my mom\nIt's supposed to say that as well [noise]\nYou know the problem that you know they made it all over again\nJust going to be the ... the [noise]\nUh when I'm\nJust going to be the one of those\nView of the lead the bottle\nStairway mold when we\nSay\nBy the\nThan having\nI mean the ... like ... or [noise] would also like bars [noise]\n\nSo [noise]\nBut you know\n...\n\n\n\n\nWhen I told you\nKnow\nHas\n\n\nFor\n\nYou know I mean\nYou\nKnow\nYou know\nMay try\nTo be here today in your day and you know\nI\n\n\nLa ...\nYou got me\n\nTalking about real world\nWe write any\n[noise]\n\n\nThe last line\nYou know\nKnow\nMom\nThings in my mind\nOh\nJumps dating all\nWell yeah the\nRent and\n[noise]\nNa\nNa na na\n\n\nNa na na na na na na\n\nIn the middle of a chance you know\nMean they invade [noise]\n\n[noise]\n[noise]\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\nWay with me\nI don't\nAnd\nOn on\nIn a\nAnd why\nWhy do you\nOh well you know\nAnd when you\n\nYou've\n\nIt in\n\nAnd\nI'm dawn the change in my\nIn the\nFall in love\n\n[noise]\n[noise]\n\nFrom the [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHear the birds will they be given the cameras all over\nThe [noise]\n\n\nWe\nEnd time home\nMade food in and then by the river the\nBlind leading\nThe [noise]\nRooting for the Olympic team in no\nHurry to stand in front of you know\nThe the [noise]\nI don't\n\n[noise] just\nSo sad because\nJust really [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] no\nI Know that he took me you work your way\nDuring the\nTime with me the time\nOther day I\nHad\n\nAnd\n\nDa da da da da\n\n\n\nDa da da da da\nAnd if they need to walk in the Marines no women's town hall or you know we're we're in a show there was no overall for making a\nLife liberty and you know the low\nPaying job on Monday\nAnd Tuesday when you\nHave anything to do\nNow and then it\nAll in all I Do them in school you\n\nAll the time but now I don't know and you know\nI Would change on both sides have for you know there is you know how I already know what you eat my heart that you have you need to\nHave\nA\n\nMan called I\nThey\nOr on your love for you\nKnow the only\nI\nDo it for\nYou know he he was four years I may go wrong\nYou know it's not really well for reading you know do we draw on do we do they talk for a New York has been hard for you and I joined him I mean\nDid you live you know do\nUm [noise]\nAnd we saw you know\n[noise]\nIt must be met\nBy a\nDied\nFor you to buy\nDo know man\nAnd all that\nTo\nDo you write me Oh thanks\nGood you know let\n\nMe did you do not pay no\nWell you sure right\nYou know they're not getting much you know we may need me you know being that job you know more common sense\nNo no\n\nNot very\nGood you know like\nThe\nWay my good you know\nYou're talking about how much you love your mom needs me you know being dumped in no more common sanction\nYou\n\nThey do their job\nTo me I don't know I worry I guarantee you read about brain does do want to know what\nThen do you think about but you know I\nLearned to change\nYour view [noise]\nAround the things that\nKnow big\nWay\n\nI Know that they're wrong wrong I don't know when\nYou know\n[noise] [noise] [noise]\n[noise]\n[noise] who ran\n\n\nOn young or something you know I Know moan about Madison or\nDid you get to do so don't do among which I thought you were young new Sunday she has to do things ... ... ... ... ... one of those who whose original lawsuit who don't want to hold the dog so to speak to\nDo something to do with Tony each song to some\nSome ... ... ... ... ... guy get good to go do get ... get dumped\nGates econ ... the thing that got killed on the moon hooked on to the job was you'll ... been moved to the men\nWill go on they keep telling does do American more ... to the young gold mums going blah blah ... who's here with Dell should or shouldn't John ... ...\nYup yup yup she thought that they get to know Mm\nMm Mm Mm Mm\nMm Mm Mm Mm Mm Mm Mm Mm\nMm\nMm Mm Mm Mm Mm\nMm\nMm Mm Mm Mm Mm Mm\nMm Mm\nMm\nMm\nMm Mm Mm Mm Mm Mm\nMm Mm Mm Mm Mm Mm\n\nMm\nMm Mm\nMm Mm Mm Mm\nMm\nMm Mm\nMm\n\n... ... ... ... ... ... ... ... ... ...\nTo enjoy the naming a man\nI don't plan on a lot of Charlie\nThe\nGene ... like you know only eating\nSushi or trying to put on the\nMachine [noise]\nNew a hockey team needing\nCollege I'm only you know ... maybe ...\n... e partial to you know I'll\nBe in\nYour mom on draw ... leading\nIn Vietnam to see a child ...\nYoung gene high school I'm On the young\nTo see a child learns the law in ... jumbo\nLoan unchecked ... nine dollars an hour\nGo on the show known\nMy little ... and\nMy me more high Pierre\n...\nTrayvon Lucy people on during the winter\nBe annoying to see a child blonde\nBlue G high school I'm On the young\nShe a child's ... law e jumbo\nLoan unchecked di di di di di\n\nLaunching Joan Joan\nMy piano and you know and\nAnd he got into a ... I'm I'm don't eat on your show it's on your shoulder knock wood tomorrow I'll do it to a pony you know into the ball the doing of mostly don't know jeeze on you know\nA ... year go through more number and a\n... drum one shown here we're going to ... I'm going to get them they got God she's done genes are getting paid Hogan\nAnd talk on the lunar yet to see seeing a drum wants to go see a ... that he had in our ... year she's not going to law school what it is yet to be a a gene chore chart you more do or don't do it here and you know\nGo more than you're showing a Sunday night show ... who is on your show no sign no wonder you're not gonna know inside the dog a ... going to shore you know you don't do a chance to ya and you know go to a doctor\nThey don't come you know\nA whole sudden during a ... a lawyer shortage not to who can't show you're on TALK of India to who [noise]\nAll\nMm Mm\n\n\n\n\n\nYeah and you know non\nCheese\nHe he gave me ...\n[noise]\nMy sister who sees [noise]\nMoney on the team to lose\nHer being you know little blue\n\nCheese [noise]\nAnd my knees [noise]\nTo go all the new\nLibyan no\nNo no no\n\n\n\nNo\n[noise]\nThe man she knew who\nThey are\nThose who wanted to go to ... [noise]\nBut he had been cheese\n... [noise]\n... to ... to\nLose\n\n\nNo no no\n\n\n\nNo\n[noise]\nAnd you know she sued lose\n\nThose rules are neutral on\nThe cheese\nAnd [noise]\nNot too good to seize\n\nMom [noise]\n\n\n[noise]\n\nYeah no I like the\nManaging in my ... uh\nYou know ...\nYeah I'm\nLucky he should be made you\nKnow\nI don't know I Do ... do do do\nLocal achievable um onion do we\nGo along\n... uh\n\nYour key in one year or ... ... a\nBig bomb you and me both nah\nBe um\nThe blue John no no no no\nA knee you I'm not you know we'll get yo\nYo yo yo yeah\nBy the ... up by two\nMen or near there\n[noise]\n[noise]\nGive you a hundred a\n\nYour key in one year she um was a\nGuy who joined boot na\nVe um\nThe blue John no no no no\nMe you are not cheap no little kids you\nKnow your yeah by the ... of a bind to\nYou know on the\nThey are to you know she ... pluses and me or that you know they were probably the young elites against the big chi toilet thing like you know I knew she had to lead to political mayor which really aren't into her public\nCommitted against our legal don't listen to him or not and you're in a news joining us just a youthful chi do or how you knew or not the usual now yeah you can you hear me kind of let me can you start training young you'll sit\nAll you know you ... you have any ... you know pick up from ... union or whatever and you're the volunteer does it get a pneumonia so moment in a in a penny ante might\nUp shut up I mean a a pay well no not eight innings go Jake with their own they will only ... finish don't you know not being done you know\nIt's been on it issued middle national championship energy let's say a ... year ... or ... or something that you don't want a punishment is a big international heighten you know they got them in Oklahoma with ... ... ... ... ... ...\nA a goo\nGa monitor the ... Beijing a home no man named Johnny each ... victim no shame named it been a lot more going on a good team in the cycle which I'm not a me who don't want to\nBe ... bring a huge on the you know do some ... ... ... ... ... you know so she had like a ...\nA famous injured while he planned I leave him alone and then they no longer going room so yeah and I knew what yeah that one yet\n[noise]\nLast year I mean then or your mind to ...\nTo ... get a cup or ... ... to ... to\n... do they just are taught the doctor to us it gives you a lot to a hundred a lot to on the bulletin it's mark it down ... down your door you hunter ... to ... or ...\nOr you know do shot to meet ya ... or ... guy\nTo ... to\nThe doctor China owns them into the junior not having to\nBloom what Don Tony let them know did I never got to do more ... more young adults do should share your button Jay you put into it did you change that total new door to door to door then that you didn't genius to\nGo to the backup plan mainly made that scene that you got your ... or not they can eat down on the ... of the beholder look bad\nYeah\nAnd it's a local ties that sits in a drone is to the left of center to make a little bit about my\n... go ahead and\nGet paid less ... at the\nDoor to door should be your ... your ... what's that tend to have the ... to ... go ahead do you know\nJane that showing a typical ... article blown and\nPlus I ... that you don't ... yeah that's the ... the ... the company\nBut um ah will do more new new to learn that go to a certain book\nAnd I see a much different than Jay ... got into the was it did yeah she had to do that to make a ... not debate in your thought she has to start to send that gave a month on which is ... ...\n... ... ... or ... are your thoughts are on their thoughts on that you love done by a bone and oh God you don't ... the little ...\nTo ... who made the more ... talked I often wonder what the more much of money ... ...\nWith them what they're taught to hold us yeah there's a lot though and chain daily in the\nElderly the G ...\nDidn't want the unions do start to make a whole lot to talk with them ... and I said my\nThem do it or to me to hold on tonight and who will get losses and its adequate them what they're doing more than ... who will do more ... noon with them like the other the job that je ...\n... more than look within their job to make up and put the dog ... to make you met this they must have to do without them they cook will still sounded that he is ... ... ...\nWas in that she is a project on ... don't go to you when my mom lost you have to look up on it went into what bus you know the loop\nOh look towards the hula ... took bingo into this she does she didn't\nShe nearly into who ... who is a more ... towards a bit in its secret dinner John ... who taught for ... look for them and saw ... soccer toned up took it and you don't want to do to help me Pacquiao who've gone on the whole ...\nSays you order up almost the whole gay but didn't it didn't jump into till it gets on your quality to about ... ... ... will do more\nThan ... just outside in the night ... ... ... you have to to make capital to to die in the ... with\nUs here but they're good at what you went through the ... ... who wouldn't it will tell you who goes to focus on his ah ordering it on the coaching them to you\nMr donate but more Tuesday and time it got to stick with them with a ... a\nBig um what do we know what's in the ... good Cynthia like would never do that to me it got hit that she might she point they sell enough that didn't that was imposed on third or the ... ... ... who taught them how to\nDo new ... but they both they pay more to the moon local but I'm Down to\n... plus off with full size outsized on it and then when you go to the dollar loss tough but never did to me you\nKnow within the last half the ... electoral votes in ... and the phone's not falling on my young enough to live there to London and we'll go there to make that especially among the holy moly one\nHospital non among them whenever they can make ... ... ... ... to make ... make I'm assigned them or to start him on the eight to ... you shut dates of\nMuslim like that you got a good thought that you need a pet store but it will just do a lot to do more satellite did this the shit that you thought you thought that this shit they're they've gotten into a fifty cent off you know getting the ... when the end\nIt that's not in the ... thought based on this secret then it ... it doesn't if the sun you let the ... J\nDo more yeah too much this some gun Duncan especially my good don't don't there's always some ... ... ... ...\n... ... ... they don't they don't make a eulogy ... or ... ... ... ... ... what can don't last to get them to get them it got their\n... most highly yet they're tiny percentage or China and the system wants to them when they hit us hit the link between us on it just does she reports on what the ability to pay the bills that money will\nSit on the earth Archie especially at the last thoughts and it'll shut down a lot this I'm going to see their interests with it and if we can start young couple just done for some time to to make it fit totally out there some new ones are like just the most is um pass hosted some ... ...\nJust to do all your phone will set you for more than ... ... what is the ... thought they thought that too many guys on a Tuesday\nOr if I'm not there to make a little bit to look into enough then it will be gone a couple of start to look at your costs Newt you have to just see them trying to get the multiple more almost ten years on you know as I get that much I don't know if they knew my vehicle for donor ...\n... they look young voters yeah your thoughts on than just that she was just on all of them that you understand them with thought it said ...\n... what's up gave out money will come on the ball get they get that didn't have to update them blow not not too much of that stuff gets on your what your son UCS such ... to ... they had done the adjusted to model show could move couldn't yet they're trying to do with like the what is it what faces and you'll almost all\n... conflict jolted I wouldn't even want to do with what your favorite food stores you\nDidn't have their say with the ... with them what's the most ... didn't is that how did that in the lunatic up with them when we got thrown at the famed ... and ... the hotel opponents in the Olympics yeah and there's only ... the money should pass up\nThe money to fail until they go to Montgomery it's a whole new core haiku today John\nAnd it's the talk shows on them will not let they couldn't do a little ... to ... Norman\nNo joke on the big soup ... that's what they've done it pause yeah not a lone gunman Jones usual number they looked over my head junior high or what they look don't ask don't talk to ... but ... I don't know for not tighten up will not no more than ... got the she\nDidn't ... didn't ... that I pay she bought them before they just didn't have to have their nip about them and going through a what ... does he eat it will deter type who did not show us a call\n... ... ... ... ... to bone I mean that there's ... ... ... it doesn't it door was on and go go you\nKnow had their ... and under your to sending them go and brought them to produce on ... ... ... do you get to go and join them oh don't go to their little looked into one yet\n... new book will learn who lost their don't don't don't go on to do with not a new sound more than ... ... by\nWhat they're dealing with your fundamental ... Le Pen by boost to looking at it but I yeah well groomed in your home looked I don't know peace they get the da da da da da da da da lo stalk it looked on title talk get paid my throat you don't change one thing but you point out people need to\n... to ... ... ... ... ...\nJust don't tell them that they will not ... you know not to pay to fit to she bought type it does it'll last thought ... they're not talking about the pit bull that they put them out to like them by ... done by showing my costs they'll cut to a doctor too but I thought I taught in the\nGym I get to ... to ... or ... or ... time that you know we just didn't go to look at the new stadium will not\nVote in a little taken out of the time by the time that we're talking to a lot of them voted not looked on this secret didn't adopt or not you know she knew set himself on\nYour mind that that that to my oh what do we don't really don't ... your local boom boom bah dum got them like the boom both\nDoesn't have thought do not want to know that don't toasted my two numbers in the U.S ... said to them I said look I'm jaded under your mouse you know not what it is too high then don't take the puppet don't get you posted that she doesn't have to own don't get caught on ... TV\nPet ... who's with too much in what they\nDid you get all you have to tend to come with the kids will do to make got your attendance ship it to\nYou and your phone number and then I thought to make that they're not ... but ...\n... look at those darn near that the protests out there to ...\nProtect the dad kicked get the ... that there was some kind of get their ... paid the most part tend to get you won't get done yeah soccer I put the what's on TALK and they don't end up with what to do the peanut sauce on it just it just don't see the ... going back on ... ... ... you know more more than your typical fishy\nThat the kind of go through the path to ... go more than you could do that you will do what I'm going to let them\nNow that you like to hear for us in our talk with you but you must have had the uh tightened ship it pay they\nGet to do with our pets in their put them to go along with the union goes to what you did you have to form a little thinner and had in that I mean do you have to flip they came up with my own tail to flip that Lead Belly Michael ... it'll don't go to war yet that should nominate dealers I'll go to ... more U.S it\nEspecially in my ... to ship pay him ... who pay that worked on a sweater\nFor us either a new show not ... ...\nYeah hung up with an impact on science into shock will your shoulder you type in the book was I think we're stuck I let you know not not much in the ... yeah my thought on top of this you know not up on your porch opinion that was a co pay not to get in on them a lot to go into the was telling the Seattle don't go to do when I\nHad more time we're told in the Senate they'd gotten taught in their own go go go go Mark I'm a hotel above\nDick up well depicted motivated or truck don't assume that that's the norm and the ... topic I had to shut down the the Monday went to an industry has got to release it get out and telling them from that didn't have to learn that that that don't have time to go into the easy you almost have to be told him\nWanted to throw more do you get paid and what the Catholic and yet the Shia who killed on than it does do among day more than ... on the air 'cause it's dividing up all your ... to push you into this you know will do more cut them big numbers you hit the hold on ...\nAnd the whole of the time it got hit with the Internet that they looked at were not sympathetic to to him which was that you need to win ticket that helps to have the nipple it'll be good to me Ken don't give up and go down to ... you don't need to do to to make any stock in the union and the woman that went on in your announced that they needed to come with them to be another ...\nWho could donate those typical motivate them what to look at ... ... ...\nWhen the diluted to make a ... page it's on and do you do what they're listening to that in the typical month old who bundle Jason did little to no clinical who doesn't matter ... when they put a chip black\nSheep when it's on you couldn't do that to me was that the industry oil to the bottom of sick with a new students and they say the Willard hotel two sons and Jamie Dimon but here you click on TALK on the ... dollars\nStick with the blue chip on taught how to ... to get to go into a little whom one day my thoughts on Sanjay Gupta in order to understand them too much into based\nOn that limb omelet dollars into money paid to go to the length yeah they do that in the ... one nickel and Jake ... new mum picked him being the dumb or to to do it in the ... do a lot\nDepends on how it got to tell my kids are looked at it and don't had thought that the the whole law been tacked I looked at it but you cannot do based I did talk on lip poked at ... ... ... that's the way you get that hold on hold and get Tim on the ... or ... ... ... that you want to let this Chinese\n...\nIn the school should let them what they can be a lot but ... didn't know that they're not going to know if they told me hold on to put you in a ... have you had to listen to both of bullshit Lou show judge it and now she is a twelve to ... to\n... ... ... that's what they're going to lose should be adjusted to hook up to you didn't put stuff that you're not just the government and you're up to\n... to ... to give that to me that the ... elections and\nNo neither do I want to let go and do what they looked at him and he was a pitcher diluted here\nBecause the more so so just we ... them all\nThe money or to will only pay loop blow knew who get a lot there no one don't let that didn't back to the dollar cuts in by CNN CNN my ignored them I used to hold on ... ... ... ...\n... is okay Tim nickel suck it up a political\nDot com we can't guarantee you'll find phone on your wild west vacation that we can guarantee\nThem what to me it's like a political ... in your thought into it if I get the top ... to ...\nYou had to ... ... is known for their niche like when you know that's an you'd see a food ... who am I going to me I Know we have to look good to know a plume all sold in the boat that particular what's your ... or ... or through the ...\nThe idea and they both they looked at him and got hit with it to blow your mortgage she hopes and just to give you a sign you up in the ... though\nBut she ... what do you wouldn't do come when you assembled at the center on do more to do that\nYou didn't do that and you know the multi we'll talk with no that would that would you like this and that they were there for months on don't like it doesn't mean it's yeah you didn't know what I mean to me the suicide of Jack Lew knew that they thought that you know that you have to do that to an uncle my total ... yes you are kidding\nI'm work I'm more hope because they're just banging on the feeling when you are a lot of just not do ... did not see that you don't need them when you know my stomach to\nGet into your state to state that you that that that that that I don't see them but you don't really know what to do with that the eastern will eat bosses too much thought that the money in my yard and data\nOr not it ... ... what gate to let them know what then but it'll be like that but the woman got what they\nSay doesn't ... ...\nThey had to get them when we got them to make them ... that's ... that's ... ... what they told me something that you would actually tonia not master them up with your toes she'd pass it ... you can't do\nMonday we'll get to get those are both from the time it got into not lost at the ... that the what is that there are more CSI producer number ... ... they're ... they're not just\nThat all the ... to record their thoughts allowed tested a domino effect in that you talk to them you know Yoda you don't let your somewhat here she telling them what to do that to make them what you thought that she got to get my thoughts I mean you don't start a new in the early ... almost ...\n... a lot more to get the local ... stick with the money your money to the Internet\nAnd then there's one the one that you worked in a little political don't do your general at the at Tony ... forget those ship ...\nPoem she didn't know what to make it this year to ... to ... yeah that you don't want to make it this year could decide the grip on this or that diluted to make a whole lot to me and my new because I did and they do to his own tea or moral ... don't go up and pizza who can go\nTo a clinical doesn't go ... go to a particular about them into a window unit will go to ...\nIt doesn't do do you go into the co hosts in the ... when they go into a little bit to make\nThis you usually another dip with a kid just sit there and told him on the pole so your idea called ... ... ... who don't the nickel Jula\nDid you ever done in the show to ship them both in our poll we did I did and we just see ... ... ... ... what were they don't ship you took with me and my mum did that gives them as I could do ...\n[noise]\n\n\nYeah ... ... ... ... ... he joined ... look on the east\nA a ... year a ... ... what you do or gunk who went to ... or ... though Johnny don't go to a young uh you know she was shown as you don't do a nation of them don't you know you're you know\n... what do the job he joined us short on your show uh\nThe ... the ...\nDon't you know one dog and pony show by shuttle or don't ... to ... to ... a new ... ... ... you know it's not too once you get really mad but I'll go to a dump that John what Egypt the\n... or ...\nOr ... you only know\nA ... a good job so I'm going to Kenya and you know being home loans don't you're showing the John ... going on than than a ... a ... a million ...\nYou know the more a chainsaw\nCome from a new show on our game [noise]\nNa na na na na jeans and a while and I guess she bought a\nA tone changed ... ... or [noise]\n[noise]\n... um ... um [noise]\nI actually saw her mum and John ... ah\nYou know a while you are I Know I'm not ...\nIn the new cheating on me Tom on\nA\nPhone number ... ... or a loon gaining ... you know a machine you know gene I'm a [noise]\n[noise] ... you can gain you made changes in the game and you know machine\nAh\n\n\nWe went to New York when they come up when they look them up into the busy busy busy the model in the in the evening when they when they hit the ball but when they hit looked\nUp a couple of times I did go see that only with it yet the machine that will make Godzilla idea the ... as he gets a little bit of tuna ... or ...\nDid not get into like got up here and it's equal to geography is what's up with the market you got your with them like you didn't have the will do to them and when\nWe met with them which they'll go towards already managing it didn't it wasn't really that my mother told and the Patriot act did let it go when it to him on the topic or they don't you don't you think that ... what they do to both of them have faith that well to some lengths to nip yearly not your log\nThe funding was indoors I had to name what their ... what's that protein they're sick and they had to\nWind down boa ... told my in my thoughts are ... that you don't clearly are circling assume I associate that got thrown off during the summertime I taught my pizza dough don't fully my ... ... email ... got to show them what to what they talk talk talk talk talk talk comes off\nThe muscles you with them and you're going to tell you to see pop pop pop pop in my you know what to do you do feel too kept on talking about you how do you know so I'm On the whole ... basically when you're hooked on ... but they do know that they can go if I might have to see what your thoughts are what's that going to see what the ...\nThe ... the jihad and yet she told me that ... you would think it's just it's not your book it pick up on my ... what's the apple did not you know ... ...\n... you don't know the ... the picked it up but when they go in the aftermath typically do they do they look there none of them were drawn in India you go to ...\nJim Bunning does yeah especially in my ... year why did you have to listen to him on a ... up up up if they don't know who might actually it just does\nNot look them what you guys were just there to guide us through what haven't told her that does that mean that your mother has got to avoid ... invested in the book you might not do that you got that would end up and then you have to ... to ... ... ... ... or\n... billion dollars to put them once they learn to do you do you did your says that they would just you know somebody should you like to see ... what bothers you choose to be a cop that they've caught\nCaught that they're caught they could do more typical in there and go through all that was I said they've got you didn't talk to and do you want to tell you what your what your thoughts to duck goof that it doesn't start with the ... they call you up with them what to do that the Boston do\nYou go in there and go what's up with ... and they do you do that they ... they totally got it but I just saw Don talked to thought what they do they lost without the an adult with him with them all up ... ... ... she had to\nGo near typical among good just yet then they put in jail on such into your ... on the ... just\nIt it just shift the what the ... or done yet I'm going to ask them but not only she none of none there isn't a good tortilla soup dental debates in in ... she will get on their own jak the law and I know like on that point did did they might as well the only because I get the up with a lot what gives which it up with them what to\nNegotiate and within a ...\nTicket or not to touch and go and do not go to more than ... high their new money ... ... ...\n... ... what the ... pool but you don't go ... well it done and going through our time alone at the ... well it down into not see nothing ... about it and stuff like the ... Jones to\nThe sun's out so they might have stopped into your you'll notice that they actually among the messiah messiah la du\nDa ... de Luna beyond that they looked at him when you get a call tell them I ... I\nDid it or not limited to share with them wants to not didn't attacking go into the market though yeah kisses and of course ... cheaper to la da dum dum gift when they took ...\nOnion among your hotel a more high maintenance to deliver Delaney somewhat of a ... on whom I stick with the law school I thought you needed to get blown up real hope in all kind of\nBeen my ... not ... ... ... not alone and let them\nCause you had good evening right [noise]\nYeah yeah name\nMinnesotans aim of ingenuity and a dollar a minute or two of my kid on Jim and genuine talking to didn't change and don't tell them to get someone said can I Do want peace what ... [noise]\nIt's up by what she said well ... that's ... that's what that's like you know what time talk will how well does she bought they started on the deck and it just showed it to be a little bit get enough pick it up just cannot pick up at like ...\n\n... ... what a couple of and yet when the guy who did not come up again when you're ... your comment into ... wouldn't you thought about it I Know the ... did you enjoy it and go through the difficult part they're interested in what's thought to and then don't listen to the theater you that\nYou have to come on yet you don't have to go to ... months yeah you don't I don't want them because they want to end up with you I don't know what to whom do you um are you on that you wouldn't really get in the sea Tony additional you want to do new\nKnocked off down bone and so she had to quit now\nDo you want you to know about CNN Bashir with him and when I got that new combat Sheena don't don't don't let the boat to shock when all could you know picking up call to come by she hasn't on a book it's okay to call them what to do that on a new ... pickled on ... which is you want to do it unless your soul she in a bona ...\nYou lost them and it just you know a couple of Mindy Mickey ... ... ... ... to ... the national ... focus on you you don't know if you if you don't\nDoes that she done him or is it the book you know should I mean do you say you just don't do a lot I must say that I don't I Would just sit down with on buses and it says she doesn't go send them back up and down on it with the industry to his own uh with the\nKids to do it on the\nTop of it by CNN\nBy saying that we're trying to come to make that got you to call them blue new into my house it to be good to sign a school that ... to to to going to\nDo that on the ... or ... or the ... the whole medical doctor was or did you do then isn't it the whole my what their the end they into the you know during the genocide ended ... ... email ... thoughts on that but but the elected to\nThe new numbers on them within the [noise] people it's just you know get a little more subtle debates it all the time you got on\nThat end up punk and then cut to get that tell you what did they say in the house is high enough to join the you're on the job is yet to get off of me gosh I'm going to get to get ahead in that I didn't mean to cut out some ... to ... to ... million Jay tend to you ... ... loose that my vote by\nThem what did I get to getting into a couple and I need when the ... but they're not going to come to your ... or they turn on my own you know what to do with it they just did\nA little bit too much too when they got along to\nYou and then you'll pneumonia coming you'll come on if it was done with the\nYou're ... not that they can't do that in the ... got them penned up here and they don't really young my ... my father did do some hook it up on TALK to my budget gimmick and go to me that they picked up a whole lot on it I don't know\nBut a whole lot of them are really dealing with a lot easier to pass a filibuster boat docked on both to look up a book that will or not the ...\nTo ... to talk to a movie that the whole to get back to the ... talked on both ... both of them will come on the Internet ... do you have to look out to eat that don't in Oklahoma you know my ... ... with us out to the moon today by ... it would have thought those turned up at the moment and all the good to me Ghana\nMatch up with south within a ... ... ... who was the most in Mali monument or not\nYou're up to about ... ...\nSo they are with him with a Kitt Peak and then we'll talk at them as you've talked and yet we're not we're taught what I'm Wondering how you know it's you know one of my ... in London but don't doing them and that it did oh I see my which you talked on was that the whole law that lets you know\nWith something and then and then they will not be holding on to another ... and all the time with them to make our team they talked to did they do not going to be able to not to know them they were not ... or send them with it that's another issue that between ... difficult to get them to\nGet better I think they don't like going to see that it'll end up going to be thought they'd all grown up on it too much a part of your own Janet from blowing through knocked on both parts and it kept on ... ... ... ... what is that your house you know\nDo you get the most yeah when it was it on yourself to see my not to ... ... or ...\nYou know to use ... for you to you how did that didn't just probably you didn't get enough though not to look forward to you in jail that you cannot did you have a whole lot that there will not talk to him but then the law which at a second thought da da da da da da da da da da ...\n... ... what do the ... kind of thing that I had ... you know kept ...\nVoted no oh no no no no no no no no no no no\nNo no and they seem to know what's ... ...\n... they're going to Nicole Nicole don't know I took him to do is you know that some bluffing that says she did oh no no no I'm ...\nI'm I'm I'm not you don't go ... ... ... watch out what time\nIt will have the time what did I did I ... I don't think you know she had to you when you have to do she wrote down her seal up your car but you know one of the knockout summertime Joe\nPaterno thought the ball park it's ... ... ... ... I wouldn't know dinner you know might actually none of my major them with bullet they ... they showed that didn't have a cup but now that they've got to know about ... do you have to him with Don Pettit says I'm going to come down to ... which is they'll shake you\nJust shouldn't do most ... don't let you do more to it that was not their ... and ... ... who knocked up which is ... ... they're going to lead toward another\nI buy my book with all of that but you know my own both cause it to a new on all looked at it I wouldn't have put it and it'll go to dinner don't you thought you know ... ... on it get it either would be only be the smugglers will do a mammal but the woman at them and I\nDidn't want a dog or a lot of what the sets them up with the ... quote unquote ... none of the elements these ... no shift you don't see them do not get the shot out of the pieces that you\nKnow the northern border your boat it was just on them pluses dealing with a little cycle that didn't need to see that one of them didn't go to jail ... la la la but how did you get to this too many people lost stuck you know ...\n... you're touching your money and they got their ... uh yeah the first time they don't tell them that you're going you're impacted up and down the ... and yet you\nDon't have to talk about just I'm One that didn't get them a boat I ended up the phone to the ... out about this she did not get the analysis I had to when they take with things that they owe it to the\n... you know one of its own it\nWas not the way to know not to say was that the more you have to send a law and Jim with us on TALK to him but I'm going to do more than I\nDid you move your son do do you ... have you on the new monitor ma ma just below you're much more money in it but when you and then when you want it to him when he was born a young woman they wouldn't have to me how to ... when the with the boat and actually none of them looked at to McKenna\nWe look at them and know that your name was submitted to make them a glitch in law I Know they literally doing them or you know luck with your last name a glitch in law and I\nGo to a new not only do more subtle ... to ... I don't know how to ... make a new one AM and doing that will fight it up to new ... New York is out there and they don't want to learn it and why is that then they will not do not not do that and then I\nHad some I knew it didn't it hits you know we lived with it to me chemical none none no not me was I just I'm not into\nEspecially my own up on the one that was the tip bought that none of that that's a type black in there to produce other name the glitz with ... percent or ... or ...\nGet it done and then when you want it to ... to ... ... ... ... a menu pose new cuts are there more than a month old is she a toll on you to do\nA lot of thought and that gives you a joke gift shop based on that don't seek within a job you have to say that Boehner you'll do she ... she low they moved to ... ... where I'm at the high ... how do you what do you support then that ... especially when it's that she had done it\nBy picking up the ... the whole time you're going to basically had to deal with ... with us she voted they toasted one day with on a pulmonary ... not ...\nNot on top of the ones I was just opt into your money and moved to a new mother in law that they'll get on with the U.S isn't it that she had been well known entity\nPromoted ... us you know ... all the time I'm sure did I talking about ... say ... or ... no well about\nNot smoking dot com we can't guarantee you'll find phone on your wildlife vacation that we can guarantee\nLook ... what they get what the wheel and will debate that she might go ahead I'm not sure what the equivalent to know that we'll have thoughts on on with them it got there and what they mean that you know don't want to do that if we didn't want the owner of a lot different when you get it that much with on the other depending upon it than the ... uh when they want in the ...\n... at the Georgia 'cause it but not as you've gotten off ... which is a book but then on the one dog ... would you within a ... year just because of what button to get it get to talk to my local Tacoma dominant that she knew she wasn't in the ... did you ...\n... ... ... ... ... what the new to the doctor who kept up with any more that wouldn't ... I don't know who just called in the mid ... oh what's that that puts out the\nName\nThe\nRoad or not she well\nShe\n\n\nBe [noise]\n[noise]\n[noise] [noise]\nYeah [noise]\n... ... ... ... ...\n\n\n... ... ... and\n[noise]\nMm\n\n[noise]\n[noise]\n[noise]\n\nMm\nMm [noise]\n\nThis is W. or ... you know point nine if em listener sponsor community radio\n\nVocal\nEnsemble ... to ... plays that Shannon home on Sunday night November eleventh acclaimed as the premier men's book on sound willing United States continues as an eight members singing sensation who connect with audiences not just with their lively performances\nBy also mentoring young singers and educators their latest show titled Alone Together isn't introspective narrative\nOn the struggle of humans in community to find meaningful connection in our increasingly digital world included are pairing works by Beethoven and Bernstein as well as contemporary composers gender breakdown in Gabrielle ... [noise]\nVocal and found all come to places that Shannon hot on Sunday night November eleventh at seven thirty\nSupport for this program is provided\nSupport for this program is provided by medicine essential southern Wisconsin magazine one hundred percent dedicated to covering local businesses nonprofits and people making a difference in our local communities now publishing six issues per year\nProviding fresh local compelling content every other month at over two hundred convenient pickups spots or online at medicine essential dot com\nGood morning this is ... I'm your host this morning John W Barker and let's see the usual overture is the weather uh it's rather\nA little bit grim out there right now and it's going to be pretty much a\nGrace for most of the day was the temperature getting up to forty nine degrees or it'll be breezy ah oh as much as ... miles per hour winds uh we're selected showers as it says\nTonight Sunday night be clearing however and cooling a with a reduced when the temperature will go down to thirty six\nI'm tomorrow we get into the most leaves and partly as a sort of a mix of sun and shade a with a high a fifty four\nAnd a low it Monday Night or forty three Tuesday we go back to some scattered showers just how scattered isn't clear a temperature it will be up to forty three degrees and down to thirty nine at night\nOr Wednesday mostly cloudy a with a high a fifty four\nAnd a low of thirty four at night Thursday back to port lays a partly sunny or you know how much\nYou'll find out a way they\nTemperature of forty eight degrees high or low of thirty three at night\nWell that's what we're in for\nAnd what we're in for this morning is a program dedicated to um reformation Sunday which is the label for\nThis feast in a Lutheran surgical tradition or the actual uh Lou Thursday is a reformation day on the thirtieth will come two days later\nBut um uh this is always or they didn't raise annually my cue to ah give us music of the reformation era which of course is extremely plentiful\n[noise] uh and so I Want to start 'em with what might be ... might seem to be some fringe reformation music one way or another first a very interesting program on the um\nUh whereas the label\nA Eli aim the Arab aims label or this is a a program using Jacob music taken from these so called global our leader book\nOr a collection from the ... of course the fifteenth century\nUh mainly from aside leisure and Germany\nA mix of sacred and a secular music of it covers the course of the year um the performers here or polish group\nLed by Renee ... ... the Austrian musician who has been very prominent in the early music for some years um and the um\nHe adds for his benefit or a good bit of organ music rare bear in mind that most of what you will hear a we have the vocal lines the instruments are headed by the performers\nAnd also point out that our whole program today will be predominantly vocal\nFor the simple reason that the message a it is religious and to get the message across you use words and words to require singers so we will hear a lot of coral and uh\nSo local music well from this logo or leader book program then three items um owning a lack\nOf reflecting still leak Catholic tradition on the eve of losers reformation um we'll hear first I mean they ... him to the Virgin Mary\nThan the food you know the ... uh in praise the intensity and find me ... ... to ... who da a celebration of the resurrection of Christ so here uh to begin with these three sixteenth century German secret\nSong oh\nA\nA a\nOh a\nI'm a I'm a I'm a\nMan oh\nNo no no no actually na na\nNa na na na\n... no no no no no\n\n[noise]\n[noise] well over\n\nA year in the\n\nNavy [noise]\n\n\nNa na\n\nNa\n\n\n\n... maybe ...\nEgg\nEase the\nBig\nDay in the ...\n[noise] [noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise]\nNo ah\n\n\n\n\nFor a\nLong\nOh no no ...\n\nI'm\nIn the\nKnees na na na\nNa\nNa\nA no no no no no no\n\nWe didn't know the two selections from the fifteenth century German collection known as the blue gum or logo or leader book or a combination of both sacred and secular song in my ... German\nOr in this case the whole program taken from their collection I'm as performed by\nA ensemble ... Rene ... on the ... labeled a we heard a I'm a smoker or German some links are good and then the sending them\nAnd him maybe some day spirit to associate with the uh second batch of two selections I'm well we'll have more music as fact all of it this hour is anonymous that is to say we have no data fired composers for it uh so we'll be back after these messages\n\nW. O. L. I. T. things that the listeners sponsors and five nights a locally owned cloud service provider of enterprise level IT infrastructure consulting hosting and management services on the Web at five nights dot com oh number five one to one thousand\n\nClassical pianist Kennedy ... in Madison Sunday November fourth parties has a piano to show\nThe twenty three year old ... silver medalist at last\nYear's Van Cliburn international piano competition will perform send out as by Beethoven ... in barber originally from Minneapolis\nKenneth ... is also prize winner of Sydney Seattle in New Orleans international competition his debut album was released by deck a gold in twenty Seventeen peanut Kenneth Groberg Sunday November four four pm at forty salsa piano Schober sixty five twenty two ... rode on medicines far west side\nTickets available in person or a salon piano series\nDot org bringing great piano to Madison this there'll be ... W. O. R. T. F. M. dot org listener sponsor community radio\n\nAnd this is of course moves or could you could get I'm drawn W Barker your host this morning on reformation Sunday which becomes a theme of the whole program music or various aspects of the reformation era\nI'm I Want to devote the remainder of this hour to an interesting release a you might call it peripheral to loose or German Renaissance because it features music of\nSuch well anonymous composers um that parallel a loose there's reformation movement\nOr in the period before Calvin ism took over\nIn the Netherlands dish territories are here the influence of Luther was quite a media and for a while quite strong and certainly in musical terms with the use of the core owls that Luther had popularized I'm here are\nTwo examples of from this\nProgram on the globe label featuring the a ... a cover up that try ex Dina led by Nicole ... nail a first we have a\nUm well it's called a Christian song to be sung at the grave side\nAnd it is in fact a Dutch adaptation of loses treatment or you know a hundred voters treatment of the old Latin low tech media V. tallied more taste so most in the midst of life\nOr we are in death and then the second um is a a well an interesting Dutch\nSong um a three stands a song of the so called sea beggars beggars of see the Dutch um captains you might call them pirates are free boosters who attacked Spanish shipping during the Dutch war of independence\nSo uh uh the first answer devoted or an appeal to God the father\nOf the ... second to a God the sun the third to God the Holy Spirit asking for blessings and aid so here are these two examples of a non them is sixteenth century Dutch music\n\n\nI'm a I'm a\nBurning in Fifteen twenty five a of a Mennonite disadvantages that Protestant dissident I'm home well certainly the Catholics did not approve of or his condemnation\nAnd that his rather botched\nBurning at the stake then that of a woman the first woman to be burned to the steak\nOr and they brought us to crack down in the Dutch Republic and will and Dutch territories under Spanish Catholic rule this is a um a song about a minute can place daughter or a woman who\nRejected Catholic do good at was burned at the stake for it actually would gladly helped set up the execution and there were so\nSome of these two examples of Dutch told the sixteenth century or above the ordeal of burning steak for here see\n\n[noise]\n\n\n\n\n\n\nTo be you know\nAnd\nAnd\nThe me too\n\n\n\n\nWe'll\n\nAbout how to\nDo here in the old enough to be able to each\nSchool ...\nLet me know goes off to\nMe they call it\nThe old no no they're being or was that they can be made up of low ... told me\nThe\n\n\nMade fun of\nHelp from all us based on a cattle and to hell no some stuff on them and those are all the talk of\nA\n[noise]\nHe's based cholesterol says the de ...\n\nOld ... old ... suddenly goes a modern day those are the ...\n\nWell may\nBe down on a\nGood\n\n\nOn both need\nTo leave\nMe alone\n[noise]\nGoing to be\nOn the phone from a need for them they don't\nSeem to\nMatter\n\n\n\n\n\n\n\nMhm seems to me ... ... you know hey\nRocky Albany real cheese to be ... even if they really haven't cooked ah the off the\nMark ... on on on the Web may come ... recall seeing\nThe ball and we see a ton of new tools hum too good to a\n...\nReally men how to me\nNow and then a lot more to go from a hey let's put it on in\nThe hot ... and ... really read e bay area in the city for hey you know it's\nA ... ... really nice to talk to a more than ...\n\nThan I can see both Donald needs will will work for a\nA ...\nA little bit to knock them north some soccer mom in\nA book that I\n... the dumping maintaining\nThe last ... and it's pretty close to me than the rule birthday\nIs that I have to pay more\nThan I was on this it's not it's not because he he had a baby\nMy ... na na na na out of a ...\nA little bit out of office eat off boats going off course ...\n\nThis is ...\n\n\n\n... if I'm\nWrong but then what do what\nInto the office longer\nMe she said in\nThe\nTown\n[noise] and\nWe heard two are examples of these Dutch sacred or at least devotional settings parallel to a Lutheran reformation core owls\nAre all from the ah sixteenth century in well in this case in the hall and then the Dutch territory as\nA I made a mistake and I didn't play the\nSetting of some Seventy nine based on our T for note well these things happen\nMaybe we'll have time for it at the end will see but otherwise we heard the Dutch setting of a ... a ... a known very well to German Lutheran musicians well uh we have around ... and then we'll return for music\n\nSupport for this program is provided by whom elements in concept southern Wisconsin's magazine one hundred percent dedicated to providing local inspired ideas about remodeling maintenance decorating landscaping and more for Wisconsin home owners from the professionals who provide home products and services\nAvailable each quarter at over a hundred and fifty a convenient pickup spots or online at home elements concept dot com\n\nAnd we're back versus W. or TI eighty nine point nine FM Madison listeners sponsored community radio I'm John WBUR courier host this morning for ... in the celebration of reformation Sunday\nA standard part of the Lutheran lethargic over here and something that gives us an excuse to look at various aspects of music uh during the referee\nMission era a one way or another one tradition or another not just Lutheran\nWell I Do want to get to the Lutheran tradition and in fact the German tradition and its um extent not only in the sixteenth century blossoming of the congregation corel\nThat Luther fostered but um how those corral those were used by subsequent Lutheran musicians\nThere a magnificent heritage and these composers understood very well how they could be used\nSo I Want to give you I'm from three different recordings some are no two different recordings are some examples of it this variety first from the seventeenth century or Johan Harriman trying\nA and in this case or a [laughter] while the treatment deals with vi I'm famous corral Chris log into despondent\nWhich of course Bach used to create one of his most extraordinary can taught us but I'm here we have a century earlier shine a composing a ... a sacred concerto\nUp for this case to Sopranos and tenor with ... um and then after that or we will hear the same corral used as a basis for interestingly enough a Latin Mass\nPerformed by a Lutheran musician who was no less than a teacher of yoga ... a free drink handle in this case ...\nOr the whole um and uh so we'll hear first the ... the\nConcerto the sacred concerto on cruise log into this but then and then we'll hear the standard a missile brave is with just the curia and Gloria uh which would be used for Lutheran services actually as Luther preserves parts\nThe whole liturgy and and I put forward by members that's me right in the country right here but not\nA director I may empty gene labeled so here are two treatments or the ... to ... music around\n\n\nIn\n\n\n\n\nThe ...\n\n\n\nIsn't a lady\nFrom the edge [noise]\nMm\n\nI live in\nA\nIn\n\nThe early\n... going\nOn\nI'm running\nA\nA car\n[noise]\n\nAnd then\nA a\nA [noise]\nA a\n\n\n[noise] a non\nIssue\n\nThen we have a\n[noise]\nA a a\nA\nA um\n\nHum over\n\n\nThe age of a [noise]\nA\nOn a nice day in\n... he was\nA sacred ... concerto a Noonan call them they're heightened highland a well known\nAnd coral which you may know from other examples is once again to Sopranos tender and bus okay in oil we hear a mess um buy you a hunk costs are non sure\nFrom the very beginning well late seventies early Eighteenth century and his work is missing in ... go\nA gnashing counterpoint for five four I'm Sorry for four voices with ... you know it's a a thing of all\nFive six inches a Latin ordinary or which goes beyond normal Lutheran uses pilots\nSo we have the curia Gloria credo sunk to us and and you stay with all of them based upon the musical material\nOf the core al ... call in or their height highland so here first is this sacred ... baroque style and\nExcuse me in the um uh ... we're on the corral a by\n\n\nUm\n\n[noise]\nI'm\nI'm\nUm\n[noise]\n\n\nUh he ... on on a\nSubject [noise]\n\nUm I'm On a\nTV [noise] [noise]\n\n\n[noise]\nOn the school that\nThe ... the um uh\n\n\n\n[noise] um [noise]\nIn the city\n\n[noise]\nFor\n\n\n\n\nMe in the movie to see the ball\n\nAround ... de la ... de de\nDe\nDe de da de\nDa\n\n\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da\nDa da\nOn the wrong song on\nThree\nMen on a on a day and age is a\nWay that he did he have to be a ...\n\nA long road rules when we're\n\nOn on on rural\nYou learn to\n\n\nRead that in a room\nIn the school\nI'm I'm On I'm On the line from San\nDiego pretty crazy\nIt is you don't need to be the maid in\nManhattan da da da da da da da da da da da\nDa da da\nDa da da da da da da de\n... shows me on the on the phone da da\nDa da da\nDa\nDa da da da da da da da da da da\nDa da da da da da da da da da\nDa da da da da\nDa da da da da da\nDa da da da da\n\n\n[noise]\n\nUm\n[noise]\n\n\n\n\nI was the big thing\nOn um\nWho\n\nAre\nOn uh\n\n[noise] um\n\n\n\n\n\nWe've heard the we'll let you it's cold call around last\nAre based on the Lutheran corral gluten comb they heighten highland and we just hear that corral is treated they secret concerto by your on your mind shine\nFor two Sopranos dinner and get you know the least heard an interesting idea Neal renaissance\nCorral less by Johan ... non you share of the late seventies early Eighteen century a mix a in ... the way\nI'm In other words a public funding mess with all four or five of the\nMass ordinary let's heard and this is part of the very interesting release on the beach the label I'm dealing with ... glasses and sacred country or do\nThey use a looser in court rails this material not only for small baroque\nPerformance but also a as you might say parity material and they all renaissance style for setting of the Latin Mass either the mission brave is are in fact even the full five section masses referred\nWell this again on the empty gee labeled as performed by members of the writers are caught her eye led by hair modern mocks\nWell we'll have more music and just a moment\n\nW. O. R. T. thinks it's listeners sponsors and community shares of Wisconsin community shares and its member groups envision a future where we all have clean water and air all neighbors have family supporting jobs and all communities in Wisconsin are safe healthy and thriving\nGifts may be made to community shares and its many members nonprofits including W. O. R. T. their workplace getting campaigns this fall for information community shares dot com or six zero eight to five six one zero six six\n\nW O Archie thanks with listeners sponsors and budget bicycle setters used bicycle showroom located at nine thirty region street used bicycle showroom operas vintage bicycles from ... in Raleigh and threw Joe as well as refurbish bicycles for people of all abilities including one speed cruisers three feet up rights\nAnd bicycles built for two to five one one six six three\n\nAnd flew back with more German loose from music from the reformation the euro and it's\nA after mess in the great Lutheran tradition of sacred music built above all around the Lutheran corral led great congregation a lady that looser pioneered in\n[noise] well um\nI ... I suppose we can avoid in treating Lucerne German Lutheran choral music we simply can't afford ... who is over but\nBy the triumphant a greatest composer of German Lutheran music and want to give you one of his ... tomatoes are one of three composed for a reformation Sunday which were celebrating today\nOr this is the ... got their hair is just gone on shoot a God the lord is sun and shield\nUm ... number Seventy nine if you will it's in six movements a chorus a an area for Alto or a corral\nA rich to achieve for base a do it for ... soprano in base and the final corral again echoing the loose rent a original corral originals and all those French tradition\nUm I won't drop off this from a release on the harmonious Monday label which is called reformation Fifteen Seventeen to twenty Seventeen\nFifteen Seventeen of course being the date of losers a Ninety five feces and they are well I suppose we could say the official launching of the Lutheran reformation movement\nUm [noise] it's a recording made in at Clara college in England and in Cambridge and um the orchestra choral work is a little bit a wooly by some comparative standards but it has a very nice team of soloist\nSoprano Mary Beth and counter tenor Robin plays and base Neal Davies so I'll present that now are the ah corel ... to\n... their hair is selling on she looked for reformation Sunday\n\nOh\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\nOh [laughter]\n[noise]\nOh [laughter] oh God\n\n[noise]\nHeard you hunch bastion box cutter number Seventy nine ... their hair is just gone on shoot a one of three composed for reformation Sunday which we commemorate today and the Lutheran tradition\nI'm not normally does that corral appear in the first the opening chorus and then the final corral but of course the coral in the middle is not that but it's the more familiar ... don't get a ... uh we we all think God\nThanks giving him a this was performance on the harmonious windy label they release called reformation Fifteen Seventeen to twenty Seventeen including music of\nMendelssohn Brahms on Williams but with two of the reformation Sunday can toddlers this number eighty performed by the choir and\nClear college Cambridge will be clear baroque group led by Graham Ross Ross rather and uh some solos soloist\nSoprano Mary Beth and counter Turner Robin relays and base new Davies well we move on to the finals\nOr of course we have some messages\n\nW. or teeth thanks it's listener sponsors and the highland campus of pre senior communities in some very dedicated to enhancing the quality of life for residents through independent assisted in memory care\nInformation about highland park in highland crossings communities can be found at highland campus dot com or by calling six so eight eight three four two seven three\n...\nWisconsin union theater welcomes the chance ensemble but Norman ... to the place or home on Sunday November for at two thirty PM\nThe chance ensemble consistent composers and performers sharing that an at will let it get a chance to began collaborating in Los Angeles in Nineteen eighty six in January University of the wilderness the chance ensemble explores the connections between wilderness experiences and alternative chamber music setting select tax\nNearer to music sounds in public radio norm and kill them delivers them and they're beautiful and impactful way much chance takes the audience for a walk in the woods\nFrom the comfort of your seat\nPresented by the Wisconsin union theaters performing arts committed Wisconsin theater welcomes the chance on sounded assuming killer land to play circle on Sunday November fourth at two thirty PM\nYou're listening to W. O. R. T.\nIn nine point nine if Madison W. O. R. T. F. M. that work\nWe're back with a final hour of ... on your host this morning John W Barker celebrating and the Lutheran tradition reformation Sunday and uh we want to move now we've been in the German Lutheran world we moved out to a different reformation\nThat in England it's very troubled sixteenth century ups and downs and the upheavals are but some very wonderful music for\nComes out of it or relates to it um I Begin with a release on the obsidian label a and we start as devoted\nMainly in the music oh let's let's I Want to begin with a short ... ... ... in the whole my trust humans who grew up near led by David\n\nOn on on on on on a long way from a ... year on the log\nOnline or on the line and why we have no I hear on the\nLine with or to a strong alliance\nAnd see the movie going to be a little or no cost also\nDied razors edge to be or they could be\nDone online on like the way we are on the on the\nDog the dogs in seeing\nThat on the line to be around for\nA long line too long ago I sold layer by layer on the line with climate all all day long\nYou guys are on on a day to day after the\nI'm\nThinking you know on Wall street you know online for a week or two years ago I used\nTo call all the way that I see where are you know I don't really well for you\nKnow that the ... or ...\nWell all your time today on the line\n[noise]\n[noise]\n[noise]\nOh\n\n\n\nReferred me and some of the English ... handsome by Thomas chalice lord in the ... on my trust or this from a release on apes in label featuring like British ... mia led by David Skinner\nThis relationship devoted entirely music of tell us that samples of variety cities are probably than the reformation the euro it sixteenth century Italy but what are the most interesting thing is he's the first recording of a very curious well it's colder Contra facts\nIt's a sort of re composition of a already existing piece the piece is this very long march ... the block here Mary in him by countless last about Seventeen minutes\nOn a on\n\nA on a really nice you know my mom you know\nOn a on the\nOn the on the line on on on\nOn the Internet and a lot more to name the money to do\nWith me to see the the ... mind you\nKnow the games on there and have you been to a\nHundred and where are you planning on having somebody died\nOn the line\nHum\nWhen you're going to be the man you know for the most money money money online for a long long on\nOn\n\nOn on the phone from la la la la la\nLa la la la la la la\nLa la la la la la la la la la la la la la la la la la la la la la la ah\nNa na na na\nNa na na na na na na na na na na na na na na na na na na na na\nNa da da da da da da da da da da da da da da da da da da da\nDa da\nDa da\n\nDa da da\nDa da da\nDa da da\nDa da da da da da\nDa da da da\nDa da da\nYou know what I'm supposed to\nBe\nA sign on the line or or um or or\nOr or or or\nOr or\nOr\n... or\n... or ... or ...\nOr or or you\nKnow on on on on on the um on on on\nOn a on the line\nOn on one of the game and they wanted to know\n\nNa na na na na na\nNa na na na na\nNa na na na na na na\nNa na na na na na na\nNa na na na na\nNa ...\nAlready you know you don't even try\nA lot going\nOn in line behind ya\nAh\nOrange palm oil all all all of\nA\nLa la la la la online or on the phone\nCall all the\nOil and da da da da da da da\nDa da da da da da da da\nDa da da\nDa da da da da da da da\n\n\nDa da da\nDa da da da da da da da da da\nDa da da da da da da da da\nDa da\nDa da\nDa\n\nDa da da da ... like ha ha ha ha ha ha ha ha ha ha ha yeah\nUh but he himself seems to have assisted in re casting it using English words the words are no less than the last of the six wives\nOf Henry the eighth Catherine par and uh this recently discovered Contra factors called apparently by tell us himself has been recorded by the I'll let me or ensemble led by David scanner\nFor the city and labels are quite a a very interesting discovery well more music after this\n\nSupport for this program is provided by net for your Internet services offering over Fifteen Years of experience in website design extra nets in custom application development hosting solutions for windows in UNIX domain registration and content management information at net for a a dot com\n\nAnd we're back I Want to go along with an English music sacred music of the reformation and its aftermath and they sixteen and Seventeen centuries um another piece well we'll have three pieces just now\nFrom a release on they Hyperion label or the performers on the small vocal ensemble the jazz while do six led by when park and the title is simply English motel cats\nSo we began actually with an answer I'm an English by tell us if you love me for four voices then we have a Latin low tech by no less than Thomas morally when we usually associate with English Madrigal was\nBut here he is setting and Latin ... domino is\nThis is the day the lord has made and then finally one of the truly great posted Elizabethan Madrigal was you call it a magical or an anthem by Thomas Tompkins when David heard that ... was plain\nAh\n\n\n[noise] those are three examples from a release cold English motel gets on the Hyperion label\nFeaturing any small local group the jets will do six led by when park\nWe heard first English and if you love me by Thomas tell us\nThat they really quite unexpected ... ... from Thomas Morley mastered English metric of its cage ... da ... I don't mean it was an insanely Thomas ... instead of king David grief\nOver the death of the sun for ... when David her that absolutely was plain\nAre we here I Want to hear who want to give you read it to a more examples from this program by the judge will do six\nA first a an English ... by Robert Parsons\nWhose will be live from Fifteen thirty five about fifty to Seventy two so right in the midst of sweet sixteenth century reformation to a this was some delivering me from my enemies\nAnd then uh Orlando get the news or the first day and some that is a a piece for um [noise] uh so Lewis a full course and instruments\nIn this case filed concert so he really instrumental parts are written by the composer of the opening words are lured in Iran review may not so here are Parsons and given\n\nYeah na na\nNa na na\n\nNa\nNa na na na na na na\nNa na na na\nNa\nNa na na na\nNa\nNa\n\nNa na na\nNa na na na na na ... on a cell phone line\nOr a director of the la la\nLa la la la la la la la la\nLa la la la la\nLa la la\nLa la ...\nNa na na na na na na na na na na na\nNa na na na na na na na na na na na na na da da\nDa\n\nDa\n\nDa da na no\n...\n... ... you know ...\nYears ago\nAnd I am\n\n\nThen they\n\n...\nOr\nSo [noise]\n\n[noise]\n\nThe\nGuy a guy\n\n\nOr\nA law\n\n\nUh\n\n[noise] whoa\nWhoa\nWhoa\nWhoa a\n\nWe heard two examples of yeah English sacred music from the lose obese and\nRest a reformation I'm first by Robert Parsons an English setting of some delivered me from my enemies\nAnd then from Orlando give them this the end some lord in my ... I mean not I was mistaken this is not averse to have some with soloist and vials will get that in the next music to come up then you're right I wanted to finish\nWith this music sung by the jazz well do six in a release on the Hyperion label\nWell then we go on to one last release of this English tradition in this case jumping a little bit\nFurther on chronologically its release on the signal label and it was called chains in trains are gold\nSubtitle the English pre restoration diverse and some volume one and it gives the complete anthems of Orlando given a whiz\nAs I say so Lewis and file concert here or as a part of the written out material first from a welcome mode for the court\nDo not pine are we here just part two attacks beginning joy that alone was better days then\nThe first time and so we're concerned see see we're isn't ...\nWe hear this by a performed by the ... we can sort of work from the release music I'm One of my\nFor her turn followed by her in for that for a day or the next\nUh months you'll hear a as your hosts Carol most are sent a force of November there now in your head on the eleventh Carol back on the Eighteenth and I'll be with you on Thanksgiving weekend on the twenty six\n\n\n\n\n\nI'm\n\nIn\n\n\n\nA company\n\n\nOh\n\n\n\n\n\nThis is W O T eighty nine point nine if Madison this next sponsor community rate the\n\nWisconsin memorial union presents mature ... come on friday per second I'm a terrorist\nA collaboration of powerhouse folk Americana bluegrass musicians Sarah Watkins Sarah gyros an eight foot down and then\nEach both impressive athletes and the contemporary\nFolk landscape Watkins is a member of nickel creek gyros this latest solo album undercurrent when the two thousand Seventeen Grammy Award for best both of them and know Donovan has a successful below full career the group's chemistry extends beyond the stage and his key to achieving the level of intimacy\nIn unity evident in their performances\nThe Wisconsin\nI'm with her at Shannon Hall on friday November second at him for being with your head for over forty years this was W ... nine point nine ... Madison and W. O. R. T. F. N. dot org\n[noise]\nGood morning and welcome to her turn a program of news and information by and about women I'm Holly show and I am Ellen ... on today's program the Trump administration's ... attacks on transgender people\nWithin election just around the corner will provide information on what you need to vote in the state of Wisconsin\n\nYou don't understand how many failures there were you don't understand how many missteps you don't understand the depth of the ... list they face you don't understand all of the obstacles they had to overcome\nThat was professor Carol Anderson who will tell us what it took to get the voting rights\nOf Nineteen sixty five she was recently in Madison to talk about her new book one person one vote and the un population fund reports\nIt's a lack of access to contraception as an obstacle to development worldwide so tape state so stay tuned for all of this and more on the Sunday October twenty eight twenty teen edition overturn [noise]\nThe Trump Administration is considering legally or racing trans people the Obama administration had loosened the definition of gender recognizing it as an individual identity not determined by sex at birth\nNow the Trump Administration is attempting to read an estimated one point four million transgender identifying Americans from legal recognition and protections by defining gender strictly by the ... at birth giving the binary choice of male or female [noise]\nThe department of health and Human Services hope to implement district Jeff mission of gender and the title nine the federal and civil rights law that bans gender discrimination in education\n[noise] since gender is to be defined by ... the U.S Justice Department told the U.S Supreme Court that businesses can discriminate against workers based on their gender identity\nAnd possibly even sexuality without violating federal law [noise] this is not the first attack on the Trump Administration has made against the transgender community\nThe Trump Administration has also attempted to bar trans people from the military withdraws civil rights protection for trans people in the healthcare system and withdraw protections for trans students wishing to use the bathroom corresponding with their identity [noise]\nThis attack on trans people has even reach the United nations being urged by the Trump State Department the state department has that officials to UN's third committee of general assembly a buddy tasked with items relating to a range of social humanitarian affairs and human rights issues that affect people all over the world\nThe hopes of the state department is to a race or gender from documents on human rights one example of the push is U.S officials desire to replace gender based violence\nWith violence against women in a draft trafficking and women and girls resolution put forth this month the guardian noted that if Trump Administration wants to succeed and restricting translates bands or sorry restricting trans writes\nIt will have to partner with Russia and conservative Islamic states\nAgainst the U.S European allies trans people across the U.S our outrage and terrified\nHash tag ... will be a race has grown in popularity with trans social media groups in an attempt to stand up fight back and spread awareness many trained folks are pleading for their allies to speak up and fight back against the Trump administration's transit race your movement\nEncouraging people to vote in the mid term elections with trans people in mind Neal fascist\nPresidential candidate John here both so narrow is raising fears that Brazil could be the latest country hit by a wave of far right authoritarians and is Brazil Brazilians head to the polls today\nSome say the world's fourth largest democracy is in danger full scenario is a seven term congressman who is hard line on law and order issues and he's considered racist ... homophobic and his outrages outrages are numerous and well known\nIn nearly three decades as a congressman both in our own has never concealed who's ... dislike of gay people in his stated quote yes I'm home a folk phobic and I'm very proud of it unquote\nYou know twenty Thirteen interview the far right congressman claimed homosexual fundamentalists we're brainwashing heterosexual children to become gays and lesbians to satisfy them sexually in the future and declared that Brazilian society doesn't like homosexuals\nBoth ... both an arrow who has a twelve point lead over his left his rival Fernando ... is using anti gay rhetoric to bolster his campaign activists however say that while violence and discrimination against oh gee Beatty can the LDP T community\nHave long existed both narrows brazen bigotry has helped launch a new era of brutality and threats it sailed Paolo based lawyer Elle GB T activists in recent weeks\nHas seen a frightening spike and reports of physical and verbal abuse carried out by both scenario supporters it's expected that both in our own might try to roll back hard fought gains such as the twenty eleven legalization of same sex unions\nLooted insults groping constant sexual propositions that is what women working in Georgia's prison system say they endure everyday although the women knew going into the job that they could face harassment they didn't expect the behavior from their male co workers\nThen as the Elsie comes in and we start getting the churn the meetings that moment on the Edmund Pettus bridge\nIt took decades of struggle\nWe don't know how many bodies there are this wasn't\nWe need the right to vote okay\nIt wasn't like that southern dominated Congress the southern Democrat dominated Congress because they were being able to be reelected over and over because they didn't have to appeal the most of their constituency\nAnd so they are travelling down and so as you've got this insurgency coming out of the black community\nYou've got your going over my dead body\nThat was Carol Anderson speaking recently at the Wisconsin film festival about her book one person no vote\n\nWisconsin book festival sorry about that about her book one person no vote Anderson is a professor at Emory University who return news reporter Arlene's out to tape the talk\n\n[noise]\n[laughter] [laughter]\n[laughter]\n[noise] [laughter]\n[noise]\nAfter a judge ordered access for women to the ... in a corral a India unknown arsonist set it on fire the ruling overturned a long standing tradition that prevented women of a mensch treating age from entering the temple\nLifting the ban and the subsequent attack is seen by many as becoming a major issue in upcoming elections the ruling community party of India strongly support the decision and has been pushing to ensure enforcement [noise]\nOn the other side is the right wing opposition\nBar AT T a John a Tea Party that is using issue to increase its visibility advocates of the ban say that women of childbearing age defined by the temple caretakers as those between ten and fifty years old\nShould not be allowed to visit because the shrines deity celibate the judge ruling in favor of lifting the ban stated that this tradition\nAnd with the help of UN Women have secured the conviction of two offending officers this conviction was groundbreaking for women's race being the first time anywhere in the world that a national court had prosecuted sexual slavery during the conflict using national legislation and international criminal law\nThe women were granted a total of Eighteen reparation measures\nIncluding education for the children of the community access to land and the health care clinic and other interventions these women are still waiting for the operations that will amend the abject poverty or their community that their community has endured across generations\nRussian police are refusing to investigate reports of divest domestic violence against women\nThe Russian police are instead suggesting that these women reconcile with their abusers\nStudy says social stigma lack of awareness lack of legal protection lack of shoulders and lack of trust and police resulted in survivors not reporting abuse\nThe tabloid in Russia's even run an article saying that women should be quote proud of their bruises unquote from violent husbands because some evolutionary psychologists claimed that they are more likely to give birth the sons\nOf thirty three year old domestic violence survivors said quote I Lived with him for ten years once he hit my head against a sharp corner of the wall and forced me out of the flap while the wound up my head was pouring blood but while we were together I knew I had to bear it I thought I needed to help keep I thought I needed to keep the family together\nIf I knew that there was help available I Would have left much sooner and my son would not be as psychologically traumatized now in quote\nRussia is one of the only major countries not to have legal protections against domestic violence\nIn February twenty Seventeen Russian parliament adopted legislative amendments that decriminalized first battery of fences among family members as a result victims of domestic abuse may be stuck with there'd be some partners for years with no one to help them out of their violent situation\nEven in the FISA World Cup there is paid a ... nation on friday the ... council ratified an increased financial package\nFor the twenty Nineteen women's World Cup in France\nThe winning women's team at the twenty Nineteen World Cup will receive five point six million dollars while in July the French men's team won fifty four million dollars this pay gap is justified by ... because the men's world cup generates more wealth than the women's\nHowever critics argue that to make the women's team more self sustaining there must be fined mad financial investment into them others argue that most women's football players worldwide are amateurs and the climate for women in sports must also be changed to generate equal financial representation in the fee for World Cups\n\nThe United nations population front on Wednesdays said that about three hundred thousand girls and women die from problems related to childbirth Ninety percent of these and developing nations the agencies state of world population twenty Eighteen report notes that in forty three countries women have average an average four or more children thirty eight of these are in Africa\nSpeaking to US News you and P. S. P. A. director Monica pharaoh called for more countries to increase report reproductive choices\nIndividuals and couples are not having the number of children they want they either have fewer or more children's that what they want and this has to do clearly with lack of access to reproductive rights and what we see when you consider the high fertility category of countries is that it's very clear also\nThat there are institutional barriers there are economic barriers but they're also barriers when it comes to access to reproductive rights like contraception ally access to a broader spectrum of rights\nAnd when we look at this high fertility countries what we are telling countries is that they should focus on a mix of policies that can put a check for a new perspective helps in primary health care\nThey should consider the company asks if that college education in school they should consider abolishing law that limits women's options and by all means possible Charlie force marriage because this is\nPutting their women and men in a position where they cannot control their fertility that's not enough choices it's up to every country to decide the mix of policies they want to enact but they surely needs to act they want to deliver economic and social development and wellbeing for their population\nAt the Nineteen Ninety four conference on population in development there was a general consensus from all over one hundred Seventy countries that reproductive rights were linked to human rights in the nearly a quarter century since what has changed\nWell that was really a landmark document and it's really we call it a paradigm shift because we ski that country's stop focusing on human numbers and then they start to focus on human rights and that's a major paradigm shift for us\nAnd that means that for the first time it was as knowledge that there is a link between enabling people to access their reproductive health and rights and the quality of rights of altogether rights they can enjoy and this is clearly linked with\nSocial and economic development with wellbeing even with peace and security and this is why also this gold made into that for Daniels development goal so sex reproductive health and reproductive rights are both\nAn indicator of good wealth and an educator of gender equality and this shows that title Nineteen Ninety four was really setting the vision that we need to deliver so there's a lot of progress everywhere in the world not enough progress in many parts of the world but there's a lot of progress if you consider\n[noise]\n[noise]\n\n\n[noise] ... ... ...\n... ...\n... ... ...\nMy\nPick her\nBy would you\nGood\n[noise]\n[noise]\n[noise]\n\n\nI\n\nI'm\n\n\nThis is\nWhen\n\n[noise]\n\n\n\n\n\nEverybody is W O R T and you're listening to her infinite variety and I am highly shell infinite variety at the show where we get women's voices place to be heard\nSo what you just heard was a these days I meet ... trained song by ...\nWhen you're in and then dolphin by Linda perhaps and up next we're going to be playing digital witness by St Vincent gasoline by alpine and girls chase boys by Ingrid Michaelson\nAnd just to recap on the first song we played um the artist Nico was part of velvet underground\nAnd upcoming we're going to play a song by St Vincent and this song is from a twenty fourteen album digital witness and the latest album that St Vincent do put out was mass production and twenty Seventeen but last month or sorry pardon this month\nUm St Vincent also released a remakes album called mass education so stay tuned for some more often tunes\n[laughter] [noise]\nThe [noise]\nPile on\nLong time and [noise]\nThing\n\n\nTime\nDon't\nHow that's\nOn\nThe\n\n\nNa\n\n\n\n\n\n\n\n\nNa\n\nNo\nNo\nHe [noise]\nUm\nMean\n\n\n\nKnow\nSay never\n[noise]\n\n\nThis is W O R G A nine point nine at and mad and\n\n\nMm\n[noise] Mm [noise]\n[noise]\nAnd and have a\nThat have\nAnd\n[noise]\nAnd then and have a high da da da da\nDa and kids\nYou can have a\nIs a\nOn and on top\nGovernment can\nDo [noise]\n[noise] how\nHow how how how how thanks thanks how are you know I don't know how can you know what do you think oh\nWell I'm a mother that sticks come through um [noise]\n[noise]\nI think you know\nKnow I'm really really\n\nNeeded on\n\nShe says oh you're hearing\nLot to me hours before the only in her name and I I don't think about the\nFor meaning\nAnd journalists do ... ...\n\n\n\nBurning\n\nDa da\nDa da\n[noise] [noise]\n\nNah nah we\nOn and on and on them\nOn the mound and\n\n[noise] or if they're really in love with\nTry them really good\nBut none of\n\nAround\n\nNa na na na na na\n[noise]\n\n\nWe\nWe just heard the only place the title track from bats cos twenty twelve album\nIf you've heard that tune you've heard every best coach song at the really all sound the same but that's great before that we heard Getty from sad thirteenth Walker L. P. sat Thirteen it's a solo project of speeding\nOr his front woman maybe do a do plead\nComing up next we have ... ... data from Canada to walk\nThis is from the Nineteen Seventy seven million over the ... the the the ... are looking at a middle ... nobody the above the sense that you see at the L. P. and translates to the new sentence in English after that we've got some French indie pop from yeah lay and more dance ...\nThank you for listening to her infinite variety a W or tea eighty nine point nine and ... that it\n[noise] [noise] [noise] [noise]\nWe'll continue up to date as the millimeter gambit gangs that are made up she she just wouldn't ...\nGo ahead and most things on me to die down to sell the ban in Mali Nicole Nicole ... like a stupid little ... to build a label ... by the other dog owner\nYou thing when you go to ... ... was the last CNN\nNow\nNow that in the butt of it you know again I'm not sure what they say are they not have I'm not\nGoing to go there and I gave it to them again up and let the little boy in the international [laughter]\nNot report that we're going\nTo be a skin does she go get the don't get it got plenty to modern peanut there she done then I'd have to get on it and the lady that will start at the end of it that don't allow the female getting enough they beat at the notion\nWhether what the stuff that are available on the bed as soon as I Do know that he just shattered level ...\nFeet that they're not that I got a they've got that I thought that ... that that ...\n... ... oh the student or what\n\n[laughter] I don't have that in Cambridge but I'm sure they'll do again on Monday and another point that they are they not know about going back now now like one day and that guy then\nI went in and try to get them again I'm not I'm not going to look at the way they are they ... up one day\n[laughter]\nAnd I go on date now about eating no\n[laughter]\nNo Caitlin\nCaitlin can you know when you're when you're\nWhen you're ... ... ... ... and ... [noise]\n[noise]\n[noise]\n[noise]\nDa da da da da da da da da da\nDa da da\n\n\n\n\nDa\n\nWe just heard on your own by night jewel who's been incredibly per se\nIn both luckily cool and real high end twenty sixteen will attract we just heard was released in June of ... the year before that we had the classic re mix of pop group yup city\nComing up next is a little ... from the uh disbanded Atlanta group warehouse and the speech based at ... gun that last year actually her job during\nGone\nRing and the\nWomen and men and\n\n\n[noise]\n[noise]\nI thank me\nThey know the\nThem on\nAnd ... and ...\n\nAnd\nThere are many twins yeah ...\nYou're on and then they and they he made\nA lot\nAnd then they'll do it in\nThe woods\n[laughter] yeah [laughter] oh\nAgain\nMe and you know\nDa da\nDa da da da da\nDa\nDa\n\n\n[noise]\n\nNa\nNa\nNa na na na\nNa [laughter]\nAnd all that\n[noise]\n\n[laughter]\n\nAnd they're not going to\n\nBe\n\nAround\nThe news\n\n[noise]\n[noise]\n\n\n[noise]\nNa na na na\nNa na\nNa na\n\n\nNa na\n\nNa na na\nNa na\nNa na na\nNa\nVe and\nA\nThey don't I\nDon't know\n\nWisconsin memorial union present I'm with her at Shannon home on friday November second I'm with her as a collaboration of powerhouse\nFolk Americana bluegrass musicians Sarah Watkins Sarah gyros and he thought oh dominant\nEach boast impressive accolades and the contemporary folk cascade\nWatkins is a member of nickel creek gyros this latest solo album under current one to two thousand Seventeen Grammy Award for best folk album sounds and know Donovan has a successful halo full career the group's chemistry extends beyond the stage and his key to achieving the level of\nIntimacy in unity evident in their performance as the Wisconsin memorial union sense I'm with her at Shannon Hall on friday November\nSecond at eight PM [noise] poking with your head for over forty years this is W O R T H A nine point nine FM Madison and W. O. R. T. F. N. dot org\nYou me and the ... here on her infinite variety broadcasting on W. O. R. G. eighty nine point nine out than in Madison that track was from the submarines submarines two thousand ... album honey cycle weeks coming up next\nWe have space talk by Ashley push\nPush feely and spring affair by Donna Summer winter may be bearing down on us but we're going to try to warm some things that's still\nStay warm with these funky tunes\n[noise]\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm [noise]\n\n\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n\n\n\n\nTo to the\n[noise]\n\n[noise]\n\n[noise] [noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\nOf them but\nHim\nThe back of the show I\nWho could\nThings through ... grade from the\nThe same\nYou know\nLot of them you know they were\n\n\n[noise]\n\n\nIn the middle of the\nNation is\nGoing to be interesting in that\n\nWere used to be\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n\nNa\nRely on our on\nHey we did that last a track put you to sleep\nVery relaxing piece I almost fell asleep myself it was called the memory of trees which is an instrumental from and yet we may not have heard a woman's voice on that track but the show is called her infinite variety oh I think that one count\nAnd I'm not just saying that because they have another metal leader a show\nI'm coming up next to me has come on home from the ... sisters who are currently living together in Brooklyn New York after that we have sticks and stones from Jackie ... a trans woman of color who never released a proper she and her\nLife so this is from the and the other way compilation but before that we have some station business to attend to so bear with us\nW. O. R. T. thinks it's listeners sponsors and that you W Madison division of continuing studies offering community programs in the arts and humanities\nA panel discussion about how local monuments and markers sit international conversations about monuments in American history with experts from Madison and you W will be held Tuesday October thirtieth that the joke presidents hall on the you W campus\nInformation available at go dot whisk dot edu slashed Wisconsin dash ideas or by calling six or eight eight nine zero three six to six\n[noise]\nHer sir and keeping women my\nCharacter and reading the next generation of powerful feminine\nHer turn covering the story's important to you tune into W. or tea every Sunday at eleven AM or any time at all on W. O. R. G. FM's out or your news from women feel\nHurt your women news by women for everyone if you're a woman with something to say and some time to give joined the richer and collective no previous radio experiences necessary hall to five six two thousand one right now\nAnd asked W Ortiz volunteer coordinator for an application her journey because it isn't just a man's world and be sure to listen every Sunday at eleven AM right here on W. or tea FM Madison furniture and keeping your breasts of women's news [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\nI'm I'm\nNew to go wrong\nWith the\n...\nAnd\nThe thing\nThey\nDo need\nHelp and I know that was a\nAnd they\nDe da de da\n[noise] you\n\nKnow\nBlow to the\n\nNine eleven they were\n[noise]\n\n[noise] [noise]\n\nSo he loves to say\n\nYou know\n... to be able\nTo agree with you\nYou just heard smoke rings by Les Paul and Mary Ford before that we heard the end of silence by ... brown lame brown joined the black panther party in Nineteen sixty eight and help to release the sees the time\nIn Nineteen sixty nine oh which this song is included coming up next we have survival by adult mom\nAnd young bye Frankie cause most so we're bringing you some clear some groups after your dose of radical black Semitism here on her infinite variety I eighty nine point nine at W. O. R. T. medicine\nBut Mm\nKnow ... to ...\nThen\n\nUh\n[noise]\n[noise] ...\n\n... ...\n\nSt Louis\nHe loves\nThe glow there you go you know\n\nI mean\nWe're winding down this week's edition of her infinite variety here on W. O. R. T. again on your hopes highly shell filling in for Cooper tell that coup or if you're listening I Hope you're enjoying your day off in your pajamas although you could always wear your pajamas to the studio as I keep telling you [laughter]\nWe're going to start the next ah set off with analog by Whitney Rose after that we'll hear my moon my man from yeah east will wrap up the show as the move by law students said and don't let the kids when by Juliet Jacqueline\nThank you for listening to her infinite variety I W O R T eighty nine point nine ... Madison and stick around for a better living through show tunes see ya\nI'm Still\nThe\nJob then really\nThe\nThe\nThey maybe\n\n\nDo with the group [noise] so do do do\nYou see and you know beat you\n\nTo hear that he's given oh my lord I\n... ... ... ... ...\n... a\n... in\nThe ... and they have no\nThe\nThat\n...\n\nThing and\nLaw Order master planned when it\nBlame them right in Manhattan I\nAnd try to get a little boy than I\nSaying oh like ...\nAnd you know like\n\nThere boil a giant dynamite by a man and\n\nYou're looking at W. R. T. you bring from Madison, Wisconsin what's your sponsored community or a\n\nW O R she's nine contempt tournament is coming up fast it's on November sports extremely sponsored by Madison central\nW Archie DJ's will be rocking lanes as opposed to the surprises you reach school level\nAll bowlers will receive a keeps ... with the W. or too low to buy tickets to pick your prize rebel more tickets are available for ... the sister of perpetual window just after the event you were Fifteen hundred dollars and frightened to give away\nWe can strike with the ... earns you will remember after bowling enjoy pizza pizza while the scores are trolley and the prices are do about ... thirty five dollar interesting all proceeds benefit W. or TV interview reading your\nPrinting fill out the form at W. or to your conduct was and then turn it into the registration\nForms are also available here at the station one Eighteen so Bedford street and it looked like ... on ... street [noise]\nKeep you informed about ways to actively support your\nYes they should at least is W. or two we're known as in Madison\n[noise] which would ease the September ... Europe but not too long before oh\n... you come to the ...\nOf this reporting underneath the surface as\nThis evening is like the other places [noise]\nStop [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nGood afternoon and welcome to better than we do show tunes W. R. T. eighty nine point nine of them listening about their community radio this is Maureen and I'm here with John and Tony today and we're bringing you a ... so what better way to start off with that and a little ... ...\n...\nThat grade level horrors so let's continue with uh some selections from\nWicked ... didn't want to use these days\nWritten the oh\nI remember the ... ... ... no longer be old movie oh I'm an old ...\nWhen you're writing hoping to reach me also introduce three inch\nOn the room a bunch of people who get nominated given all the way they want all things by what\nHappening in living terror but\nBehind the scenes I'm thinking\n[laughter] [noise]\nThat\nDumped a gentleman it's something\nHappening to the animal ... with her that's why we have a ... no nothing\nYou know me know that\nThey must really be [laughter] oh\n\nGosh\nCould in top\nHe yeah oh\n\n[noise]\nKnow not that I'm In another day men with lawyers to get in the\nWell there was a little bit of time and the oh\nWe already in the time yeah\nDonald say John you're on the bad\n\n\n[noise]\nBut my mom\nI don't know\n\nIt doesn't\nMatter\n\n\n\n\n[noise]\nOh\nDid you do when you don't know when you go do why don't you go with that she did\n\nIt ...\nThe\n\nDressed up like a million dollar dream\nDrying hard look like ... who\nGoing to make ... there's one with the November ... men and\n\nI'm you know I'm going down on\nWent then no it was it in the\nHappy than average ...\nThe ... bending every dime I'm One of my\nIf you do when you don't know where to go do or don't you know where the ... they\nWould put a little bit to the ... been\nOh no no\n\nBut they are the best way to\n\nMake a living one when I'm In the\n\nTime [noise]\nAnd talk\n\n\nGoing\n\n[noise]\nDog was um\nLet me let\nMe think\nI Wonder do they not know about you might\nMake like they\n\nIt\nMakes me\nA while there\nMay be you\nYou know but you\n\nKnow\nThat's\nWhy we were\nWe\nWere you you\nKnow\n\n\nGod I\nKnow\n... [noise] no no no no no\nThe gold and finger you\n[noise]\nWould meet your bronco max and every one you know\nGo to the spot that I think you know\nYou\nDon't say that me\nOh I\nLike who they\n\nAre\n...\n...\nI'm happy I'm behind the\nNa ve young that high in\nThe mind that they\nAre gonna be\nVery very very very very very very Han Hi Dane [noise]\nA drill bits oh dumb law under ... ...\nOh no no no one to ... or write to\nThem that you had the uh [noise]\nAre counting when they use and John ...\nI'm now seeing big here is not\nMuch on how to be I haven't written in a high needs\nIn mind you know in my heart up by a year and you need me in the euro\nOh\n\nNo\nWanna be your producer\nThey hit show on Broadway\nI Want to be reduced\nLunch in parties\nEvery day\nI Wanna be your producer\nTheir ... and ...\n\nOh\nI was\nOn one of the news\nYou you know you know\nWe'll be\nWe're not on\nA\nA R name I knew my own blue\nNot [noise]\nI'm not\n\nLike I Know that you're on I\nDon't forget the balcony eat like I think you\n[noise] so I Try to gain\nWeight\nIt\nWay that they\nI don't\nThe guy I don't want\nThe greatest random and all that yeah that's right yeah so I mean I'm not\nOne\nRight now\nRanch campaign on the line between you and\nMean when you\nI'm Donna Bordelon show who\nReading Monday evening\nYou know Tom I Want to be a\n\nAh the Marines say\nI'm not on a on a baby so one hot he\nReads reads The Revenge revenge race and read and read there be no\nI Love to see\nHold everything what am I doing here is to be always stuck was right there is a lot more to me than there is to me some of the world I Want to get on\nThe air coming right now\nYou think your marks I got news for you\nHere's my my ... my did some tai chi ... number two pencil and my did in ...\n\nMy God\nOh\nOf course that was I Want to be a producer from the producers you reached our costume section of the ... show today we're going to go into the woods with the next one from ever after and then here from Mary Poppins students when the sugar\nCane wrong what's wrong with joy and all those who deserve to certain live along at me like every\nHour early over all the men and it's not just more than you but your morals and extended him around all the guards and I've been in the river was wiped away the laughter forever and\nEverything I could end up I went off and we're not going to be done but I never lost their nerves are there is still there and they got what they did\nNot\nGreeted with me and we were happy to be blind them you know what we can never really I think the only thing but you know we're we're we're then it went into the wouldn't again they would you\nAre going to be in that book would you ain't no we're not going to but you know what we might go\nThat\nLong\n[noise] [noise] [noise] [noise]\nMan\n[laughter] [noise]\n\nYou're always W. R. T. J. max ... from Madison, Wisconsin ... sponsored community radio\n\n... ... ... ... ... ... ... ... ... ... ... ... ... ... ... [laughter] [laughter] I ever\nMade 'em right exactly Idaho when my my\nFingers crossed the word across the pile the lid off like getting less water balloons and drift around Michael\n... spoken word artist ... ... ... you know becoming ...\nThe ... the em on the accidents that working with the read poetry our rubbish sharing my own songs book be recorded and line be sure to tune in this Monday at ... pm here on the access our W O R B eighty nine point nine ... radio in Madison\n... [noise]\nThe excess power is W O ... community access to the year when abuse expressed on the exit never do not represent the music it's down programmers or the board of directors ... ... ... ... ... ... when\n\nThe noted settlers block jumps on Thursday November the seven thirty up a full bore building\nIn order to ... bucks we'll begin reputation for ripping and unique blend the two thousand nine they can do to the audience who wrote the world with their blend of little traditions original composition and get your band bedroom\nComprise the or ... yards yelled Norway\nAnders Fogh Sweden and Kevin ... some shoveling the club or use of harmony rhythm registering baseline reaches some leaves in the world but at the same time dumbfounded some comes from only refill the neurotic fiddler blocking cops or\nThursday November seventh doors open at some of the book or village just off highway one fifty one when Ridgway and dodge you're listening to a building or the Internet for nine fell listening to morning radio matter [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\nAnd so [noise]\n\n\nWell\nGood afternoon everybody that you'd be forties so I must be held in a white and you are listening to on the horizon right here on W O L E s United but none of them will H. D. Madison\nI had a great show planned for USA Today have a special gas station Miranda is the daughter Miranda you may know her if you've ever seen the band\nThe whole show she played the violin due to flee in that band\nSo she's going to be playing a whole bunch of music from the Philippines by winning so I'm really excited to hear that going to be a whole lot of different genres and we're also I'm going to have a special guest Shawn Michaels Ogden becoming any talk to them and\nHe's going to be talking about an event that's coming up November eleventh commemorating will be one one hundredth anniversary of the armistice has all but one\nYou've got lots of music are you going to lead to kick back relax and listen to the great music um will be with you from now until five o'clock or two that might help with that catches the [noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\nMm Mm Mm\nWell I\nDon't know I go in and then he would go we do need it to grow a little ... a\nLong long ago that\nWill\n\nOr the need to go go go go go go dancer or ... but not the way the moon\nIn\n\nBaby\nBe able to do well not a big at all when they moved the numbers will be the nominee will be a\n\nBit\nWell I'm going to be pretty neat though don't they knew it was [noise] during the ... of the news\nBut\nBeen very\n\n\n\n\n\n\n\n\n[laughter]\nOh no no\nUm [noise]\nUm [noise]\n\nNo no\nDa\n\n\n\n[noise]\n\n[noise] All right well I liked that\nAnd that was um grace no no Hindi see\nThat's the one we just said yeah he needs to laugh when detail I'll let you say why am I see it 'cause I Can't pronounce his and then we started off with well we had played can Arlen but they'd be what you tolerate read yeah\nTrend or with a ...\nSo it's a to God basically it's it's a it's a heartbreak song you you got to start [laughter]\nFor the heart rate heartbreak song the kind of just you know about ... you know there's some something someone bigger [laughter] and they're banned from the nineties yeah there from the nineties but still kind of pretty you know keeping it strong and playing and digging and\nPerforming up to this up to this day old old female um the means to be banned or\nA quarter members that for him to the band or all female\nI'm ... amazing a vocalist um with some of her friends from from school um they've kind of grown up together and and now I'm Still paying\nHim making music together lovely so can you tell me about more about grace no no I'm so Greece no no it's a very prolific artist I'm In the Philippines also trained a ethno music colleges\nUm so I think I Can't remember now where she teaches art but I think she trained in NYU ... I'm not mistaken but very prolific artist or collaborate said a lot of ...\nFor musicians and carpets a lot of um [noise]\nUh ethnic instruments I'm if you've heard um I think in this tractor we just played I think the used a tape of loot or I could long kind of about loot um instrument and that song is it's really a\nReally great song from an album called ... boss a women's poetry and voices on that song kind of talks about um [noise] you know women are kind of encouraging diamond empowering them to take control of their lives and and you know make decisions and\nFor themselves and and and be in control of their own thing\nSo yeah I like that message and it sounds like she's contemporary musician yeah definitely and it sounded like she was also using some kind of a wooden ... um um yeah I think there's a lot of a bamboo precautions that if I'm not mistaken that they use as well and then that I'm\nA kind of to string instrument you kind of here I'm being played there as well\nAnd is that played with a bow or slap locked up instrument nice cool very good\nWell we have um well have a little bit more of grace no no and then we have special guests in the station who are going to talk to us about\nThe gracious wore a rock and roll ... libre can real history show about World War one and that just getting ready so we're going to pay a little bit more gray center so this is at any uh any longer law by\n\n\nGoing to do\n\n\n[noise]\n\n[noise]\n\nUm but there's there's pretty serious evidence to say that there was more than the standard amount of ah you know a couple of boxes of uh thirty six year old so [laughter]\nSo yeah this one's called in the belly of the Lusitania\n... John in this uh in this tune is I'm I'm playing the Brits specifically Winston Churchill but sort of an amalgam of fabulous spreads from the era a pleading with the United states and I'll be mostly channeling a president Wilson [noise]\nGood one nation in desperate need of hey\nWe we will produce\nWill soon to Mount Shasta this blood and\nNot been why\nAnd then die down [noise] meaning cheese ... but mostly we need\nShall [noise] how long will call this trip back\nThen when they left to change can love\nThem to build the Lusitania belly or news chain yeah I'm a little never know what else we have really a shame yeah Mm\nHere's a man too proud to fine cheaters um\nThe brink Mm Mm a ship too tough to much too fast to see ... on\nA project your ships the ball rolling by any elite go mean mhm from prowling on restricted as a marine and\nWill call this is true\nBut\nThe one they like take a look in the belly or lose the chain\nChain belly or lose the chain chain ... things you need will stay in the you know in the belly of chain\nMm\n... know\nCruiser rules or any type\nOf change around the union Jack ...\nRaise the stars and stripes on the southern coast um I ... in the Florida slow live I live in the Asia German U boats slowly drift in Mm\nThe men drank brandy yeah after lunch still in chalk CEOs the ship was rocked by Jews huge blast only won George ...\nHey gene man it's down to the gym or the\nVery last the dresses and the belly of the Lusitania belly of the chain young we change when\nEver know just was it was\nIn the valley of the ...\nThe valley of\nThe belly of the game\n[noise]\n\nOh my gosh that was beautiful\nOh my God he may go oh that that singing voice I Know that that's\nThat's John ... from the periodicals isn't it [laughter] my goodness [laughter] I got one of those guys you're too good [laughter] and showing you involved in a lot of different projects I you know um yeah I think the musical term as horror [laughter]\nBut I I embrace it [laughter] hey\nYou know what are you gonna do absolutely when your time it's his his his math you know you can't stop right let's got to make a living and I don't\nDon't withhold your talent from us you know let us let us at ... so anything else you want to say about the show um it's gonna be it's going to be at the ... on November eleventh starting at seven PM tickets can be purchased ahead of time\nAnd we ... outlet in the ... so to ... you can go on our website which is the ... uh well gee ... and there's a link right there and there if you're ... you can buy 'em there of course Reagan if you're at the brain where website and checking out um\nYou can go there as well and and we just we we also really wants to encourage people to get involved in other things around this a hundredth anniversary I'm as you may have heard we have\nA really expensive uh exhibition series a much cooler night by if Pinochet from the veterans museum\nAs well as um there's a ... a drama performance of ... at the ... on the day off to the limits on November on the twelfth and actually people want to get involved there's going to be a couple of opportunity is one of them is coming up\nIt's Tuesday we going to be making a there's a group of people making puppies for an art installation at the central library\nSo if you'd like to come off ... to the library that penny um you can help us ... the mountain or an artist is going to turn them into these huge strength so that's kind of ...\nNow the red puppies represent the red puppies at the at Flanders in the fields of London in ... right only won\nHe writes um towards the end of the war poet named William McCray wrote this I'm now classic poem influences fields which uh highlighted a um the puppies that grow in that part of\nA ... a in a you know the ... and how residents like ... with the the uh the side of the blood from uh the fallen and as it turns out the\nWar having ... the fields actually meant that the the ... seats are grew in prolific numbers so um that's where the puppy comes from it's not without controversy or around the world there are people who are critical\nOf puppies thinking that people who might wear them looking to kinda celebrate militarism I think what we're really trying to highlight is or how this conflict and those people um deserve some um attention at this time in on the issues that they were\nA wrestling with a and the legacy that they've left us is something that we really want to think about\nSo would you guys like to play another song before you go is there another song or\nJohn has to go yeah All right we'll just leave your wanting more than ... November\nThank you both John wedge and Sean Michael diving thank you so much for taking the time to come in here and thank you for having us thanks so much you November eleventh well see there and um now what I Want to do\nI'm going to turn off my microphone once and what what I Do know is I'm going to play a song from November criminals\nI Believe they're going to be playing a no man's land that so so I got to pay no man's land so that you guys have a taste of one of the musician or group of positions who are going to be paying that that day November eleventh and then we'll get back to music from the Philippines\n\nWhere young my mobile home in New Jersey [laughter] shorter than any of them will do all the readers when every ...\nOr ... [laughter] and she was the first one [laughter]\nWhat's your major crashing on the rivers will go national bombed them old ... [laughter] and bombs on [laughter] [laughter]\n[laughter] [laughter] maybe Obama rubbish rubbish [laughter] [laughter]\nWell [laughter] maybe [laughter] handle [laughter] wage [laughter]\nSo we're not going to run on the phone call for a lot going\nUm I think it's available on CD Baby and other um online you can quickly um look it up also available and vice streaming platform on line or less ... that's L. E. S. L. I. E. that myself\nSo she is a top notch Philippine a musician and she's living in middle point\nYes she uh she collaborate Smith the can is adjacent grits who's also studying here at the U. W. school of music so yeah so we'll play a condemned man that she has on her one of her taxing her album fantastic\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\nOh\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nYou are listening to W O R T H U nine point nine FM an HD Madison\n\nW O R G E thanks it's listeners sponsors and five nights a locally owned cloud service provider of enterprise level IT infrastructure consulting hosting and management services\nOn the Web at five nines dot com so number five one to one thousand\nSo my name is Helena white and ah with me here today is ISI met end up from the Philippines playing music by women from the Philippines and the name of this show is on the horizon\nOr on the horizon plays every Sunday from three to five and there are three of us who\nCome on the edge to do on the horizon it's myself Helena wage and pull Novak and for black well [noise] um so I'm just want to let you know that we do have a Facebook page W ... on the horizon\nAnd if you have any questions about what we're playing You're welcome to give us a call at two five six inches in Missouri won and speak to me and also if you go to the W. Archie website you can see what we're playing right in the top right hand corner says current play list\nSo if you click on that you can see what I'm playing because I type everything into spinach on sea belt is it\nUp next at five o'clock is will news\nAnd so please stay tuned to this wonderful radio station that brings you like an hour and a half on a Sunday of music by women from the Philippines you know where else on your radio dial do get that kind of\nIncredible programming before we move on with more music from you see I wanted to just let people know that there's going to be a candlelight vigil\nFor Greece and interfaith solidarity this evening at seven until eight PM at the first Unitarian society nine hundred university pay Dr ...\nThe Frank Lloyd Wright church over there by DU W hospital so that's from seven to eight o'clock tonight I don't have any more details about what to bring\nBut I'm sure that um if you just come along a up people will help you out and get you what you need so just wanted to let you know that that that opportunity in the community to this evening if you feel the need to go out and\nTake a stand against violence and hatred um of which we seem to be seeing a lot these days so easy back to music from the Philippines what you want to play for us next so um\nI have a track or from another favorite band of mine it's a I think if I'm not mistaken it's a favorite a karaoke [laughter] karaoke and and Filipinos have a very a\nClose tight relationship was this a next song is by the group a Gees um fronted by the U.S ... or their sisters I'm\nA mercy Juliet than I\nDo not so this is a song is ...\nWhich roughly translates ah how do you translate it wet very ... went into rain drenched in range I guess that would be the better translation or something that you'd probably find yourself I'm In the Philippines with all the typhoon\nYeah you're right and it's a monsoon season so at the monsoon kind of de song and also another heartbreak saw oh\n[laughter] yes [laughter]\nYou know all the greatest art comes from heartbreaking disappointment a tragedy but yeah so if any listeners want to sing along for the you know the song for you make it louder yeah hey you are right on with\n\n\n\nAnd you know the the\n... O W I'm\nLeaving and I'm In\nThe long\nOn and\nOn and\nOn the\nJob and I live in Iowa and\nNa na na na na na na da\nDe\n\nAnd give them a while and you know do\n\nSaying and\nGoing on\nAnd I'm not on the\nMap and\nNa na na na na na na na ve\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter]\n[laughter] [laughter]\n\nI Know the bad and\nDo my uh\nCell where the uh\nThe goal money I can understand your doctors\nWho might not be in the ah you know\nHow long\nDo you\nGo and\nLook I got\nA new\nType of thing that was how\nSome of them when they don't like to go by\nSome dying to know\nHow long\nDo\nYou have got ... na na na na\nNa\nNa na\nNa na na na na\nWise\nTo compete na na na na\nNa na\nNa\nNa na\nNa na\nNa na na na na\nDa\nDa da na\nOne time\nGod you know what God go by\nDied your huh da da da da da\nDa da da da da da da\nDa da da\n\n\nNa na na na na na ... mhm Mm nah nah nah ... na\nNa na na\n... mhm Mm\nNa na na\n\nNa na na\nNa na na na na\n\nNa ...\n\n[noise]\n[noise]\n[noise]\n... no no no\nNo [noise]\n\n\n\nKnow the question was\nWhy insurance who are you going to walk into the spring we sure will always doing something we all just shoot you know [noise]\n\n... to ... do you want to do that all week long\nFor\nLose\n[noise] [noise]\nMaybe\nHe was going on here\nYou know what the ... the the video the legal but it was a long while the barbed\nWire July the ... to protect the\nRun up a little bit more than whatever\nHard on them on\nA page Turner never\nTo be a\nThey can you believe in the ocean is enough\nFor us to talk about jazz\nTrack shouldn't\nViolent protests\n[noise]\n\n\n[noise]\n\nGuy\nTo do a lot\nWho grew up in\n\n\nDa da da\n\nDa\nDa da\n[noise]\n\n\nOh\n\n\n\nOh oh\nThe\nKnees you really\nKnow\n\n\nThe three\nThe\nBe nice to me\nAnd then in the end [laughter]\nThere will be certainly a public hearing there'll be public comments that could kind of go one or two routes they could just require that some sort of medication for the greenhouse gases that are committed another one is that they could actually starts to shut down the plant as well if there was really nowhere to mitigate it it's kind of are we thought there's probably just too much political pressure to actually shut down the plan [noise]\nOn October in the draft supplemental environmental impact statement when she needs it concluded that using elegy produced by the plant would result in an overall decrease in English and compared\nWith not enough [noise] but climate activists and opponents in the ... just selling it probably can any\nLaws or a bad position in this document and hope that their comments at the upcoming public hearing on October thirtieth can have a bearing on the clean energy agency's ... statements\nThey have already been fighting fossil fuel projects at the port of Tacoma for three years and they see a long fight ahead for making contact this is Barbara bringing [noise] Mm [noise]\n[noise]\n\nUm that is so we have time for today thank you for listening and thanks to making contact for our future\nIf you want to comment on world view or to join us in bringing international stories to our community please send a message to nobody your or the world view a de Mayo dot com\nJoin us next week for another edition of news from around the world on world view here on bumper to you or the community sponsor radio eighty nine point nine ... him on state to him for some ... we saw the next\n\nWorld view is written in produced by a collective of volunteers we welcome your comments in the direction you can also\nContracted here at this station if you're interested in joining or collective to bring world issues you hear me well view can be heard and Sundays from my ... pm on W. or eighty nine point nine o\n\nW O R T thinks it's listeners sponsors and community shares of Wisconsin community shares and its member groups envision a future where we all have clean water and air all neighbors have family supporting jobs and don't communities in Wisconsin are safe healthy and thriving\nGifts may be made to community shares and its many members nonprofits including W. O. R. T. their workplace giving campaigns this fall for information community shares dot com or six zero eight to five six one zero six six\n[noise]\n[laughter]\n\n\n[noise] [laughter]\n[laughter]\n\n\nIn Arabic we say\nCorn ... on and I called the more ... been to ... so yeah the ... with somebody [laughter]\n\nTranslation stand tall in front of those who envy you for the tall palm bears the sweetest fruit\n[laughter]\n\nLadies and gentlemen welcome to another installment of sell them at your weekly tour of Arab an Arab American issues\nCulture music food it's ... with your host setting out to you and your going to feed today oh and geography and me your engineer ruin our thought well um\nOur Henson engineer man which really matters a lot on the radio you look very good under those headphones thank you end up being very fitting\nMust be the reflection off of my skull\n[laughter] the shame you know [laughter] I'd been blinded by the same [laughter]\nSo I somehow our our normal cautionary consultant myself new I don't know we're going to do food segment anyway I Know but she's a scapegoat you know she had no I Know we know where she lives so [laughter]\nMaybe it would be back with a vengeance [laughter] not to\nSound creepy right anyway [noise] so we're in we're in the world is ...\nIsn't that like the bottom right hand corner of the so called the re being peninsula\nThat is right it is the tip of the boot\nThat makes the Arabian Saudi Arabian peninsula who do I do I win a prize for gets hotter yes or for knowing that it was not to be confused by with a I'm a man now which is the capital of Jordan down\nRight which is not it's actually at the um the uh the next part of the boots [laughter] ever been in so [laughter]\nYou know how to trim on top if you have a ... if you have winter boots there is a furry part that sticks out on a day when I called the ... the room I don't yeah top of the boot I'm not sure but anyway that it makes me think of other things not ... not that\nAll right well good\nBut without wasting much more time on our [laughter] geography lesson [laughter] it is perched not sold\nIt sit thing [laughter] what else do you like that it's over there and that part of the world are mine is it's a Senate whose sole then recently met with Israeli prime minister and they said it's time to accept Israel\nAs a regional player and help build a more peaceful\nMiddle East that's ironic considering that the middle east peace pretty much hinges on the racism that is perpetrated by the Israelis against the Palestinians and the extreme elite isn't that as a\nTypically as a sign of those who um come over from a faraway land to take a land that doesn't belong to them and displaced its people and calling them animals\nAnd treating them as the villains though they are technically the victims but nevertheless we're talking about on ways online and the news recently at first of all\nWe rarely ever report on Oman now why is that because there are just a peaceful place and it's on not it doesn't [laughter] it wasn't being attacked by anyone until\nUh not too long ago the Iranians who are by the way whereas Iran from there maybe I should check your geography I'm a knowledge here\nI'm just crossed yes go you just have to swim militant bit few miles [laughter] you're a couple of [laughter] a couple of miles and what we call strategic ... water [noise]\nA strategic waters of the streets that separates or the Indian Ocean or the Arabian Sea depending on who you talk to\nWith the Persian Gulf War there in in golf depending on who you are you talk to your brain depending on who you talk to [noise] [noise] or mine is a small\nOr something that a with a capital a must pots and that straight to the streets of a a nod her booze or ... you know it is straits of\nHormuz I'm In an area that is like you said a one side is every been peninsula and the other side is the Iranian mess of land\nA though that part of the water was threatened to be closed by the evils Iranians\nI could you I I'm just kidding you're all that that being said it was a matter of are realizing quickly that an enemy of your enemy is my friends as friends\nEnemy friend right I'd\nSay the enemy of my enemy is my friend yeah that one thing ending up rowing gets the prize being\nNot a Israel has been a placing itself as the most favorable enemy of Iran\nAre pushing hard on the U.S to make decisions are in their own or not and their own interests but in the interests of Israelis are pushing Iran and the rest are pushing the rest of the world to take sanctions and and repeal any deal was made with the Iranians whom thus far\nOr interfaith vigil for the victims of that attack\nEncourage those of you who are willing and interested in helping to find a source of reliable a place to make your donations and just be wary of who's collecting those Tunisians\nAccording to a newspaper article within hours Muslim groups in the U.S raised thousands for Pittsburgh synagogue victims a campaign or launched I'm a I'm launch good is a website and the Muslim focus crowd crowd funding site or\nA reached its at twenty five thousand dollar goal in just a few hours and it's continuing to receive donations or after closing the or the goal\nAnother crowd funding campaign started by two Muslim groups are celebrated celebrate mercy and in power are empowered change has reportedly raised more than forty thousand\nFor the victims of the shooting at the Pittsburgh synagogue on Saturday\nHates are we standing together we as a nation are stronger than hate is what the campaign together stronger than hate or or\nHunger than hates a organized it's good to hear that so that's what's happening or the uh deal of the things go ahead\nI was just going to ask you for your can we talk about food no uh yeah what what kind of [laughter] kinda\nWhatever you want to be on the spot I Am I'm putting you on you wish for me you were assured me that there was going to be a ... area segment mentoring on the\nApparent escape of Arcola Mary ... no it's not an escape I think it's just a a maybe she couldn't find a place to park\nYes [laughter] there is a neighbor's lawn didn't have any cars in it what yeah that's right just as she kind of viewing yes that one yeah [laughter] she she could've I Want it\nTo a chit chat with my saw and get her a opinion on something called ... it's a a a desert as simple desert made with kids or for the kids\nAre hello it's need has been made for centuries and the middle east and I believe it started when men discovered cheese\nIt's going to sound like it's a sweet ... by the name is that yeah\nAnd uh the recipes very but most of most of them including the two ingredients\nThe semolina and the cheese and a bunch of sugar [laughter] okay that's three ingredients\nRight well you know any dessert deserves some sugar right so the semolina pudding or a ... or a taste of a ... if you go to a place called piece of Beirut\nA hello within this need is the name of the particular ...\nAh some of the NIH has found anywhere just about anywhere if you make the lender that uses semolina wheat semolina a finished somebody in a product that's a\nFine cuts um a semolina I'm an ... Durham wheat product ... made like pasta practically a without egg and then tracked again in ground autos\nAround into a pace yeah and not so much a pace that just the powder or the ... consistency the powder\nBut they must slurry it if they they're drawing it and then cracking it again that's right so it it becomes um\nIt feels like a cruise cruise right just finer grain of course goes is technically the same uh she asked me it's the same a product where we we take the Quds goose [laughter] some Molina [laughter] semolina it it is a manmade products from Durham wheat\nRight now but it's delicious so so\nCould you use ... and this in this case no it's too uh too grainy too early to find some Lena ... need to send me is used in making those are my mood na cookies if you remember a we've covered my mood here in the past ah you take the semolina you heat it up with a little bit of water and sugar\nA and you create a ... paste lake at St ... picking up\nJust like ah jello does in a way in July ... is a little bit because of the starch and then you add some ah no the unsolved the cheese like fresh Mazzetti ... would be great in that\nAnd you could use or you could just do the plain cheese itself if you heat it up a little bit and you add some orange blossom waterfront flavoring I Know you're surprised to hear about that in a in a Middle Eastern desert\nShowering lots of water [laughter] you or rose water and some cases and crushed pistachio nuts would be ... it is layered but it's it's sweet semolina\nA layered with cheese melted and in some cases they roll them or you can just spreading flat on a sheets and then uh they're served relatively warm so the genes and nice and melting and uh it's delicious with nuts crushed nuts on top\nOkay so now how do you want to distinguish this from ...\n... is a cannot fire wheat is made a raw mixed flour and water and then it's a sprayed on a hot rental so you may you basically make a brand\nAnd non living on living a fine fine hair\nWhich is called ... and that then it itself is not like a pasta process I see it's more of a cooking process and then at that point it is shredded or shop super find to make that can offer\nAnd it's very close to the enough it doesn't have the same consistency with cannot follow your ... your ... covering the\nOf a Philo do or the shredded Sheila do with butter and this ah in this recipe it's more of a gummy yummy a Turkish delight is kind of thing but not ... but with cheese\nOkay so ... hours is largely in the texture them\nThe texture and the different combinations of flavors and there is no butter and some it's also dessert and that's eating eating eating just like an awful warm milk and it's a variation on the theme both of them are delicious\nBut they both ... I mean I I have firsthand experience with enough huh okay but you know we should but then maybe you know nobody can already with a competition cooking background has just happened ways around it how oh wait a giant pair of\nHello it's a need right whereas you know that has happened with Ken Offit all you're lucky and I would certainly itself extremely ... yes\nSo this semolina pudding with cheese in it as a delicious and it's so prevalent apparently I see a different cultures from that part of the world have different names for it but the Persians the Turks the Arabs\nAre that part of the leftovers of the Ottoman Empire Syria Lebanon Palestine or Jordan Cyprus uh Iraq I don't know if the Iraqis do or not I have to check with my wife\n[laughter] it wouldn't be bad for her to shake [laughter] hey do you do regularly there\nAre but it's something that we that I make with the kids in and we love it I encourage you to try some of these far far fetched recipe ... don't set themselves on fire speaking of far far fetched are you ready\nIs everybody radio there in radio land because the U.S is about to review and I'm not kidding you the century do we have any reverb any echo something that would make my voice sound quite selective um\nI'm Out here [laughter] ... let me try this like an ... of this century\nTo Israel next week so apparently this view of the century that's supposed to be something to fall revolve forever [laughter] and they're the the the the Palestinian Israeli conflict I like how to use the term conflict right [noise]\nUm apparently it is due in that deal with the century as you may have guessed ah Rowan started by a Mr Trump deciding to sever Jerusalem take it off the table that's just you know when you negotiate and then some of the two sticking ... some of the three sticking things\nThe sticky if things on the deal are in the way of making a deal hey you just given to one side\nRight makes perfect sense does [laughter]\nWell the public radio lab at the very public radio on among other radios in the middle east where just all over the place saying we can't wait to hear detail of the century [laughter] going from here and here I Am holding my breath\nDon't tell that for so long you would fit and blue and then put up and and then we have to get you off the floor\nHopefully on peace right [laughter] so that the worst joke [laughter] I heard on the radio or Arabic radio\nIs that um [noise] um you know how Palestinians need a visa everywhere they go anywhere they go right at their their the it's the hardest nationality in the world\nTo travel with by raising if you have just the the the travel document you should do Palestinians living in somewhere in the world but you're you're you're not a citizen of that country your SOL [noise] so a Palestinian attempting to go to Saudi Arabia\n[noise]\nKnow that\nThe\n[noise]\n[noise]\nGod\n\nI'm Michael\n[noise]\nThey don't know who was um well I ... or ... ... ... ... ... yeah\n\nVeto any age and I get on my home for a permanent last weekend\nUp in the two Mardi Gras\nNeeded the long term I\nThat you will look graveyard man you're came off\nAnd he\nMug logging thank God I'm a\nThe vote came down on the news I get\nA job for my on my true\nThat they do them all about nine years ago the grave yo man strengthen your\nAnd they do come on and they\nSaw me is with having bomb you along we go down here in Studio ... by you know ...\nAnd he is\nThe game now he owns James\nThe ... you know like they belong to match you for the graveyard man that is called\n[noise] they said the long\nDriver or you can read in the game\nOn the line while hoping to be really or is this what about them about girls will be\nMade no sense at all of them all based on my hand and engage a graveyard smack in the army\nMatch [laughter] it's called the police about my\nAlmost ... gets a\nMen to get to Mars or tell them to be in\nThe navy man you hear the longest time out and do my great jobs better match you catch all\nMan you can vote\n\nWhat am I saw you\nKnow the Halloween some rich or rich but it's been sung by a lot lots\nOf ... ... ...\n\n... [noise] [noise] [noise]\nI Am\n... na na na\nNa ... and a\nFrom\nMm I hand him and then\nYou will [noise]\nNa na na na na na\nHe well\nOver me [noise]\nAll love in um the\nSo glad I didn't say to\nMe\nNa\nNa\nLet's go to I Want candy by now wow wow wow wow wow wow\n[laughter] that you can do you argue every Wednesday Halloween\nI just want\nTo trick or treat what are you going to be probably on the ... and you and your mom we're working on the coast\nI think I really wanted to go to hell we still think it might cost him but it was\nOnly\nForty dollars yeah that was that was what it was very good I got really mad at you\nBut we were we went um we're good will and we went to see what the job and we got ... for different things to make up your costume\n\nRight we have for you or what\n[noise] [noise] [noise] [noise] [noise]\n\n\nAnd there's evidence that they don't even\nAnd [laughter]\nTo make sure you don't learn from Jonathan in long term oh man\n[laughter]\n", "show_name": "no_show", "year": "2018", "city": "Madison", "day": "28"}