{"month": "10", "state": "WI", "station": "WORT", "content": "Hey this is W O R T eighty nine point nine FM in Madison let's see what's going on blues wise around our town tonight the good the bad and the blues club tavern and I commend says at nine\nOr\n\nComeback in has a band called ... that's free and starts at eight\nYou cite club B.D blues band they started at six playing for the fish fry I suppose at Louisiana Middleton Johnny chimes he starts at six thirty here will be there tonight as well as tomorrow night then on Saturday to Chris so leery ban will be playing at the knuckle down saloon that starts at nine\nAnd then uh we jumped to Tuesday\nWe know that's Thursday round here won't home yeah yeah Tuesday or Tuesday to come back in\n\nTime Weber starts at five pm on Tuesday Louisiana's Johnny ... will be there at six PM spoke Tuesday and Wednesday evening live gambling the rolling dice are going to be over the Ohio tavern that command says at seven PM\nAnd then ah we jumped a Thursday or ... will be hosted in the blues jam at the uh knuckle down saloon that commands has at eight thirty Johnny chimes will be a north of the bio and that convinces I Believe at five thirty\nAnd that's what's going on that we can uh that we were able to discern for you so try and check out some live blues around town and keep everything going keep the uh keep the scene going\nA message for you're listening pleasure and then we'll get to something from Lee kinda hear a piano player for the cash box ... she's got a solo album she made and we'll be listening to something from it momentarily\nAnd\nToday a super sixteenth there'll be where the brink when it's presented in the ... Belvedere with the ... the love struck valid years music make the dream that\nLink traditional music Margaret Flinter sensibility during a simple numbers choice\nThe New York and Chicago [noise] they don't look at me describe the old time ... and they keep the answer to all of the usa medical Joan ... from the French my fingers are open with the wind like it's like it's hard to make sure that will make you wonder when you haven't been\nTo one of their shows that the love struck Belvedere and meld won\nThe October sixteen Seventy on the brink\nBringing your music that won't let you senior C. W. R. T. eighty nine point nine at them and W. O. T. had been for\n\nMan she knew\nBan Ki\n\n\n\nIn\nThe\nOn\n\nGone up\n[noise]\nRegistration is now an for the W O R G nine of the damage tournaments sponsored by ... that many ... will take over dream lanes once again in December for that six PM but we made it easy to bully or gee this year\nFor instance you're allowed to form it somebody or do you get them done or and then turn it in with your registration forms are also very little to the to the lakeside prison where the street to no need to collect pledges\nThen the ... or ... D jays will be rocky believe boulders compete for friends and three skill levels you don't need to be the Web or to win will ... will\nReceive a keep fit into all the ways in that nobody ... logo in science tickets to the you're trying to grapple more tickets are available for purchases if you've been willing to strike for the rape in front of ...\nBeverage that's the joy to the point is there\nFor thirty five dollar proceeds benefit will be for community radio ...\nTo be just turn on the six PM Lisa shoes will you\n\n\n\n\nOn on on on\n\nWhere\nA\n\nI don't know\nJust say you know I Know\nDa\n\nW. R. T. thinks this listener sponsors an IRS painting a family owned and operated company since Nineteen eighty providing commercial and residential drywall and painting services\nExamples of new projects and more information are available at eight Y. R. E. S. painting dot com or by calling six to eight eight three one seven for three eight\nNeeded you know\nIn Mumbai style [noise]\nOh you're in law\nLive far right\nNow you want me to judge him by\nYeah\n\n...\n\nI'm here to tell you about the female oh\nMomma\n[noise] no\nAnd we're all\nOne\nMovie\nNow you're\nAre\n\n\nDa da\nDa\nDa ta ta\nNa\nIt's about you mean the\nProblem\nDye you say you want\nTo buy the mom\nLate\nTell you that\nThe moon is oh\n\nReal low in the middle\nTo go and who are in the middle one on\nOne side and then you're not going to vote\nReally they don't know when they\nWhen they when they\nDo they respond na lip\nDa dum de ...\nNa na na na na na na\nNa na na na\nI'm jumping on the phone for a living wage\n\nThey\n\nAnd then we went out there and they will be made in my\nSo\nLine\nUp and in some way to lose\nNo\nNo\nWell I'm In a long way you\nLive in\n... ... ... ... ... ... ...\n... ... ... ... ... ...\n... ...\n... baby while\nWe're really cared about being seen\nWas the ... the lead where no man\n\nIf you give me all my big thing right\nThe\nBall out a well did\nThe\nYou said when I\nBut a new CD that just came in from alligator records journeys\nTo the heart of the blue from Joe Louis Walker Bruce cats a Giles Rob some weird real guy lover [noise]\nBy Skaggs before that the feeling is gone from the album out of the blues or the Concorde labor\nThat before that a couple of tunes that I think the ...\nThe Knickerbocker all stars features throwing the editor David ... good rock and daddy from the album love makes a woman\nBefore that\nA ... Copeland to be right up there with a Mali and they have makers and Wanda Jackson the wrong idea from her album America's child [noise] police this year an alligator records or the background [noise]\nListening to the Curtis Mayfield to people get ready [noise] it was done by the Godfather's a groove Ruben Wilson on in the habit beat three Bernard pretty on drums in grant green junior on guitar\n[noise] maybe the album is the godfather route [noise] special gifts Jerry ...\nThe state watches the blues cruise I W O R point not FM in Madison hope you enjoy the music I Want to thank you for listening so grateful\nAlso grateful for the fact that ... will be on in a moment I'll be listening in the car you don't touch that dials so you lose due to say [noise]\nHave a great weekend [noise]\n\n\n\n[noise] [noise]\n[noise]\nEighty nine point nine ... gathering at the harmony bar and grill on Thursday ... some six to eight PM along with the harmony beverage in two choices they'll do live\nMusic ... starting at seven thirty to mix gender sex is self described as homegrown bluegrass from the east side of the eighty nine point nine social stretch create opportunities for work volunteers to hang out with one another club gatherings are also a great way for members of the community to meet their telework volunteers\nAnd get a better sense of what what is all about join us for an eighty nine point nine social club gathering harmony by on Thursday October twenty six to six to eight PM keeping it in the community for over forty years W T eight or nine point nine if they're not a simple W. or tea FM dot\n[noise]\n\nJeffrey Brady and you'd vicious present for our phone on Thursday October twenty seven seven thirty PM at the gates of heaven\nComposure Jeffrey greedy and your mission present an evening of exploring world music sources improvisational the composition of\nThe country play tribute to Fred cats considered the first important Jesse Kelly medicine locally grown ... ensemble yet in mission will bring a program of extending compositions by Brady into improvisation by members with music for Egypt Dan Jabbar Guyana and the America as far out both with Jeffrey ... and you'd vicious\nThursday October twenty fifth seven thirty PM at the gates of heaven and James Madison party on the shores of like men do it on his is W O R G eighty nine point down at them on W. O. R. T. S. dot org listener sponsored community radio\n\nIs [noise] [noise] [noise]\n\nI'm a guy in the water\n[noise] Daniel from being a child who\n\nUm [noise]\nNews on\n\n[laughter]\nIn stone in\nThey're all around him\nYeah [laughter]\n[noise]\nDo you need\nWhy\n\n\n\nShellfish ban on your watch\nLike I'm\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\nUp for stall reform school break out the second thing going from the sham sixty nine I Would get you up with a single banned by the BBC as the the the one that they all under the scourge of the statue of liberty a single both of those single released on my birthday\nJanuary six to ... to do was\nNineteen Seventy eight there will be featuring the music of Nineteen Seventy eight tonight and\nFor the next three shows that I your next weekend and the first week in November going back and celebrating forty years of rock and roll hopefully you will remember if you were there and ... and if you work\nThe\nWhy you're there in\nDay and nine dollars a day\nDe\n[laughter]\n... ... ... ... ... ... ... ... ...\nSome of the [noise]\nOne of the other line Janice dog all my life and [noise] I don't ... they began wants to live because [laughter] you want to do I get low\nFly does [laughter] news on\nDad [laughter] my main that Don neither of them does fly dads [laughter] no may just need a friend who wants to live and [laughter] one lie again oh\n... wants\nThat [noise] I don't again\nJazz was\nLong time [laughter] um\nLa\nYo\nMa let\nHow bad\nWhy\nLot yeah why\nLive on one of\nI Want\nTo live yeah why\n\nWhy why\nDo I gather around a lot of young a lot of jobs do you\nA lot that\nGoes on July ...\nCharlotte Hi now battles\nAbove onto a jolted lover the bus got the chili you what do I get there for forty by then before that but uh Howard ... and ... their debut single shot by both sides the bus back out on January twenty\nAnd the next four sons also came out on that same big looting just delicious the ... of a ... ... ... ... ... says up to today\n... ... ...\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] well\nAnd\n\n[noise]\n\nNa\nNa\nNa\nAnd\n\n\n[noise]\n\nA time\n... ... ... ... on the\nShow that they are now and when I was younger to all the way I can I ask how old\n\nYou may not be in the next round\nOwn\nMoney\n\nNow getting shiny object\nNa [noise]\nAs ah\n[noise] I Love how that one beat up at the end of the swap debut rough trade single read about the more yesterday\nRead about the more came out on the thirtieth of January\nGets you up with the meat and then there are you single never been in a riot on bad records and then a great record the effort no time to be Twenty one like me I turn twenty ... and the ... is our first us\nThan to be played this evening from L. A. and your so strange I'm back door man record and you are listening to a look back at the year Nineteen Seventy eight tonight on something else on W. O. R. T. eighty nine point nine out bound in Madison\n[laughter]\n\nTwenty Eighteen W. or tea record write it on Saturday October thirteenth from one to four pie in the art in fourteen forty four east Washington avenue come down and check out our selection of rock folk jazz and miscellaneous records at rock bottom prices\nOther vinyl vendors will also be on his selling their wares while W artsy DJ spin their best fighters throughout the afternoon the W ... record right as one of the biggest all vinyl events in southern Wisconsin and the proceeds from\nOur sales were benefits a station that the twenty Eighteen W. or to record right Saturday October thirteenth from one to force the end of the art in fourteen forty four east Washington evidence spinning your right\nAround for over forty years W or two eighty Ninety nine percent Madison and W. or to you got for [noise]\n\n[noise]\nAncient futures two friends one day ten band music festivals Madison Saturday I sold the thirty four pm that high news answered future is about mixing up ... opening my moose we focused on\nSite Iraq and electronic [noise] they bring in headliners rump all over the country next for local and regional lax\nHow heavy metal band away metal should be those four bastards players primitive old Chinese gothic country music\nAnd fantasy in post for progressive rock candy and more [noise] that answer scissors to sound values are fast on Saturday October the\nThe New Orleans I knew a nine point nine W O O G ... who can move on [noise] the next one was the number to get ahead in Glen Hubbard rubber Randy in rainbows song called the need\nNeed by blind the\n\n[noise]\nNa na na\nNa na\nNa\nNa na na na\nNa\nNa na na na\nNa na da de da da\nDa da da da da da da da\n\n\n\nI felt\nNo need to be\nMaybe the structure\nThat needs to be\nCan learn\nLove going to show them\nBig ...\nWas waiting\nI\n[noise]\n\nWe'd during the U.S for a while they were you he we then I think that can really take me like your\nBefore that reckless Eric and Rick ... Sherry is just single but speed it up a little bit you could probably tell\nAnyways at strip at one time wanted to put an album out the debut album out of Elvis Costello on one side and reckless Eric on the other side not label and let you go to school based on your photos\nAnd Elvis in his book I'm\nAt a no time for that he would walk ... record deal on that one you know regard directly there at all yet records of do make a record but went out earlier this year\nAnd a before that generation X and their tribute to the British TB pop\nQuiz show ready steady go for a single up there is a Christian ... records all three of those released on the town of February\nValentine's Day brought the debut single from the record label Rupp trade records at the beginning of a great run of single and albums and doors still going to this day\nInterestingly enough the youth and go with the French band called mental urbane and Mrs Faris Mikey\n[noise]\n[noise]\n\n\n[noise]\nA job in the south so to say ooh decide on da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da da da da da\nDa da\nDa da da da da da di di di di di di di ... to have something in a bottle and\nDa da da da da\nDa da da da da\nDa da da da da da da da da da da\n\nDa da da da da da da da da da da da da da da da\nDa da da da da\nDa da\nDa da da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da\nDa da da da da da da da\n\nA new\nThat Iran da da da da da da da da da da da da da da da da da da da\nDa da da da\nDa da da da da da da\nDa da da da\nAll its job job I'm\nOh\nLa da dum de\nLa\nDa da da da da da\nDa da\n\nDown down and O'Donnell\n\n\nYork and the lady I said oh they do\nYou know what they do da da da da da da da da da da da da da da da da da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da\nDa da da da da da\nDa da da da\nDa da da da da da da da da da\nDa de da de da de da\nThe [noise]\n[noise]\nSo I thought oh lord show\n\nAnd you know been to\nBan na na na na na\nNa na na na na na na na na\nNa na na na I'm completely been not been going on and you know there's been a ... and ... and ...\nAnd a group in\nBoulder grasses ... says those B. E. T. ball a little bit better than the other boroughs better soldiers\nIn the middle middle you know do the ... the number one number so that you can use wine bottles with all the time there was a lack of their business model was simply won't be so old\nThat does sound better and better and stay in the ... and I don't want to share she'll still outlawed\nOut of ... to\nBe\nHere were the bottles ... you're ... you're going to the ...\nAnd ...\nAnd then\nGo screen then tried to do when they do very genuine Bible\nWould be one maybe about one and then now we're not able to go to\nMove out of ...\nBall sold can show and\n\n[noise]\n\n[noise]\n[noise]\nYeah [noise]\n\n\nWell just to make sure that indeed there was\nCertainly not in terms of how\n\n\n\nOften do in jail\n[noise]\n\nKind of a part two of watching the detective shows is almost the title cut also of last year's model yeah I don't want to go to ... we heard a recorded lie but the combo club on march\nIs sick in Nineteen Seventy eight in Toronto to think about really three days earlier and the album was released about a week later Elvis Costello and the attraction before that Eddie ... and her big yet because the night from Easter and I'm probably going to hurt somebody named Bruce help right\nThat one Patti Smith came out the beginning of march of two thousand Eighteen will began to the night of that'd be wary from Cleveland\nIndustrial waste land up Cleveland bring you an ... a white man packed with hair ... from the modern dance that album released on that they\nCould buy it you know we're going to [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n\n\n\n[noise]\n[noise]\nDa da da da da na\nNa na na na na na na things\nCar\n[noise]\nNa na na na\nNa na na\nNa na na na na\nNa na\nNa na\nRemote rockets a rough year up until I read that the group that was hit by\nBut a\nLot of time and I'll Try and none of my family and I know and I'm a\nMan you know on a ... a big log in may and I don't know about you know and I do a lot of ...\nYou know then then then they want and then then then then there was a big fan man may be a lot of that and uh and\nLot of time on them or not being and when I met him at all not at all the money a lot of ah ... them on and on and on the road and I don't know no no no no\nNot at all after a while and then and then the ... and and then there was a and then they are a lot more than a year and\nDe de\nDa da da da da da da da da da da da da\nDa da da da da da da da da da na ... then then ... and a while and ah ... then\nThen why are they live their lives\n[laughter]\nEven ... it may not be a party all ...\nTo get what caused a nuclear bomb or John\n... the ...\nYeah yeah I'm\nA year and the ... ... ...\n\nUm\n\nA two man\nThat they don't see that no one knows John like you see the\nYou know\nWhy\nYou\n...\nWho you are you\nNa na\n\nNa na na na na na na na about\nThat idea and then they bring a little\nKnow mom and they are on their\nMind they can and and some\nJust a minute and reading right now\nAnd they're man you might be\nTogether pay and our\nNot have been out\nThere but they are now\nDad and my mom and my big\nThing about it and uh\nAnd and now not\nNa na na na na\nNa na na na na na\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n\nShe's still my data and\nAnd that one gave him the title of the elbow my hunting for the troops the boom town rats with Bob guild dog\nFrom the end of ... in March of two thousand Eighteen we kick it up with the rebels I must be a law firm all you needed cash the TV show that premiered\nOn that that made the twenty second of march then the remote and do you want to dance to Bobby three months so I think there is from rocket to Russia now come on the Chuck Berry song for me and gum from Britain ... same a new glow when to sell the career and producer and are the most over\nThe bridge we've turned into the rumor backing up\nThe ... one on a summer holiday on his own and came up with that non lp single from may or march of Nineteen Seventy eight you're listening to the music of Nineteen Seventy eight tonight you're on W. or tea\nAnd I'm not a hundred percent sure but coming up pretty soon I think rock and John on an upcoming Saturday maybe even this Saturday is going to take a listen to Nineteen sixty eight\nSo hopefully you can tune in that and if you stream or archive W. or do you go back a week and listen to a show that I did for Iraq and John Macdonald last Saturday hopefully you caught it and enjoyed it if not\nNow you know and you can go back and listen to what you got one more week here's the influence for our next song by the author's\nA handful of misfit strawberries soda engine Bennett's California thinking about beat poets Vietnam vets believing ex scene with Mary Magdalene\nA dead tenet leaving throat cancer medicine in the freezer and a permanent behind circus books West Hollywood in guerilla rose writing wanting to write a song like bending king loving John Waters movie desperate living\nThis made\nWere desperate and that just one adult books featuring Jackie Suzanne is from L. A.\n[laughter] God [noise]\n[noise]\nMaybe a day or maybe they ... they come in and\nAnd I asked me you know these marine disturbing the area [noise] and I say in the dining room I may\nMaybe I'd be interested in it [noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] maybe a day [noise] Stevie on days [noise] maybe on a date in the news\nMaybe our days and days and days and days\nAnd days and maybe our days comedians\nMaybe out\nThey moved to the news media gays and maybe ... days [noise]\nThe dam or\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\nYou do\nThe\n...\n\nMan [noise]\n\n[noise]\n\n\n[noise]\n\n\nYou don't\n\n\nMan\n\n\n\n\n\nRajaratnam\n\n\n\n\nDa da da da da da da da da da da da da da\nDa da da da da\nDa da da da da da\nDa da da da da da da di di di\nDi di di di do\nThough is it not on a job though that oh\nWell I'm not a not very da da\nDa da da da\nDa da\nDa da da\nDavis says no no no no I mean being in a large chain saw as I get my gun doing their job and you know I mean I mean I don't know I saw I saw at a job right now I'm a\nJar do octane Sean na na na na\nNa\nNa\nNa\nNa na na ... found on counter last year oh\n[laughter] no no no not not met ya da\nDa\nDa da da\n\nDa da na na na na\nNa na na na na na ve I'd rather\nNot by a guy there\nAre no I'm not counting\nThe fourteenth floor almost like a twenty fifth floor Betty Cochran or the Ninety nine floor of the moving sidewalks TV peas only had to go up fourteen their first single the first time we ever her from Dan Tracy on al ... or single from the or\n\nApril of two thousand Eighteen we kick it up with the normal and T. V. O. D. the single on new records on television\n\n\n[noise]\n[noise]\n\n\n\nCrap to work singing in their native tongue German and ...\nFrom the man machine corrupt work from uh the nineteenth of April up two thousand Eighteen would kick it up with the kinks and live life from misfits on Arista Records X ray specs that day the world turn day go\nWith Polly staying arena helping our ... our T official records and the suburbs from Minneapolis the first release on twin tone records\nAnd that was called the goal was just are entitled the suburbs eat pie and crap worked finished just up there you are listening to the music of Nineteen Seventy eight part one will be back next week with part to end in November believe it or not to do perjury uh you're so good it takes almost a year\nTo do it in the meantime you might want to check out\nThe interesting thing\n\n[noise] six pack productions present on Saturday October\nTwenty from New new coach who I Am down some new [noise] not that is a professor and Iraq are willing to joy featuring ... not dead yet more bastard ... from Madison mind slice or Indonesia jump\nShore and gays from Wisconsin and others from Minneapolis Chicago such as much worse hellish view more flags the seaside stomping grounds coronary envy uncouth not fest who was on Saturday\nWas only a few human shields way up and down a little ...\nThrows in Madison [noise] you are listening to W O R G E eighty nine ... Madison and W. O. R. T. F. M. dot org [noise]\n\n\n[noise] by news to lose prevents a freaking how weekend twenty Tea Party October twenty six and Saturday October twenty some starting at eight pm on opening the annual gathering of coffees and candy features many local musicians\n... states as a face to face friday features tributes to Nick Cage modest mouse pretend to the police and black Sabbath on Saturday your tributes to Franco who\nFighters Elvis Presley the cranberries and foreigners [noise]\nThe freaking how we can is friday October twenty six and Saturday are totally\nTwenty seven at the high noon saloon towards that seventies show starts at ... keeping your part of this rock and roll fantasy for over forty years this is W O R T H U nine point nine up in Madison and W. ... been done more\n\nSupport for this program is provided by net for your Internet services offering over Fifteen Years of experience in website design extra nets custom application development hosting solutions for windows in UNIX domain registration and content management information in it for you dot com [noise]\n\n\n\nAn\nTrying\n\nLife\nMy writing or reading or\nWow\n\n\n[noise]\n[noise]\n\n[laughter] [noise]\n\n\nI'm\nGoing to turn over and over and over and over and around and\nAround there and I am trying to [noise]\nMy\nWhole life with that a channel on a chance to get out and buy a new trend than a trillion dollars\nOf it and I think Tom on\nBut it is the man in the\nOn on the planet is under the latest news\nNews and the month and a ... and\nHe always trying to live in an hour and they say you know\nDay job not in\nAn on line a lot is like a da da da da da da da\nNa na na na na\n\n\nDa\nDa\nDa\nDa\nDa\nDa da da\n\nDi\n\n\n\n\nAverage Buddy Guy to be\nBy any time\nI guess that get in the dodge\nBut on another dog\nThat on the line da\nDa\nDe ...\nA stand and what the last page\n[laughter] have\nTo share\nShit though they're not thinking\n[laughter]\nDot dot dot dot\nOn\n\nDo you know it's always been\nBeen done\nRain gauge it\nHave\n[noise] uh [noise]\nDo\nNot walk into Wal Mart down to do with the council may be in you know the the Jews she managed to be there was a man to\nCome down and down and to maintain the big\nBang\nJust the [noise]\nNew one on one and the\nI'm I'm older than me the money I Will lay down on them they don't normally go on line but it does me me me believe me they do you do not go to Jay and Jay's on dies\nMom gamma lose up to ... to ... and ... and I'm planning on line and go wild ...\nDue to the ...\nI don't I don't believe\nI Am not a gift buying a ... dollar you buy it on the man we named the big boom Dave ...\nYou on that they know that I'm getting it done by Don\n\nI ended up you know the ...\nAm done and dying in those by not in\nThe news today and get in there but I don't know what I'm saying\n...\nDa da da da\nDa da da\nDa da\n\n\nDa da\n[noise] [noise]\n[noise] [noise] nah nah nah nah nah nah nah nah [noise]\n[noise]\n[noise]\n[laughter] [noise]\n\n\n[noise] [noise]\n[noise]\nYeah I Would drive me a yup big gorilla that Dickey is out to LA and I think all of their\nOn AM records before that the members did solitary confinement a one off single on your records and then they re recorded it\nFor their album but uh the superior version was this just single and you heard it there and uh we kicked it off with Rudy on good vibrations records and big time and the nips ...\nThey were called at the time the nipple erector\nAnd the king of the box and they evolved into the hole and you'll be hearing their second release next week as we continue Nineteen Seventy eight we just finished up with a bunch of trucks from the first half of may ... pick up where we\nLeft off next week\nAnd I said it's not [noise]\n\n\nThe W. or the board of directors will hold its regularly scheduled meeting on Wednesday October seventeenth at seven pm here at the W. O. R. T. studios one Eighteen south Bedford straight the public is welcome to attend\n\nYou're listening to you W O R G eighty nine point nine at them and H. G. Madison, Wisconsin\n[laughter]\n\nWith\nRoom in the middle east [noise] Haley so they believe in\n[noise] to really the main\n[noise]\nOr [noise]\nWin win in ... in in the\nPulling away from them in the room\nIn [noise] in in one and two in the morning and then the men and women being an independent and intimate making anything anything and\nHe needs to be easy for them to be in the in the in the room and the man [noise]\n\n[noise] ...\nAnd and and and\nAnd and and now and and\nAnd and\n\nAre no good and the low\n\nLevel losing\nAnd\nAnd and\nAnd\nAnd\nLot better than I\n\n\nNa\n\nHow\nDo we need to [noise] ah the [noise]\nThe ... [noise]\n\n\n\n\nWhen we do we mean in in\nFlu [noise]\n\nDay [laughter]\n[laughter]\n...\nDa da da da\n\n\nDa di di di di di di di\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] I Know that there were [noise]\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\nLast friday they do to make that you know but not that I dealt with\nDa da da da\nDa\nDa da\nDa da\nDa\n\nOne or\nWay\nTypes\n\n[noise] [noise]\nJoined joke with requiem for a number scratchy all twelve inch single here on twelve inches which well before that scratchy twelve inch single ... this is not a love song public image limited\nAnd then a before that even so watch why with the ... this week by Greg ... up again the ... this week you pee SST Records\nAnd or your inner ear own their own vocals and again you W O O G ... who took our baseball team in state near one against my home town team oh\nI'm In the middle of that anyway are you listening to the ... twelve inches the twelve plan a rarity from that era of twelve inches and that you were going to go a little off the map here and do something or by ... and go but it's not actually something from the eighties or something from their nineties releases\nAlthough it is one of the more darker\nTo show up and the more you can and it was a beside of ... was featured on their ... album or worldwide from you\nUniversal amphitheater in this we're going to hear it\nA very yeah boy who had some really dark going with this one I think by far ... I made that the Daniel ... but the Turks for the ban it seems like you said that the ... the nightmare before Christmas and all the others don't track you wrote for but when you wrote this when he really was\nWas still more dark I guess and it's really wonderful that you're a sort of enjoy the ... ah yeah here we go\n[noise]\nStuff that\nAnd this is ...\nActually\nDeep deep deep deep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep beep\nThis is a big win it but it is\nDog and the law it is a shame that they may be ...\nEating eating you\nKnow no no no no no no no no no no no\nWe're we're both of them were building boom boom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nBearable number a Montana and da da da da da da da da da da da da da da da da\nAnd\n\nAnd not on top and then by the bottom ... percent dared on people and the\nAnd\nI Know\nPlant and\n\n\nOn you know I Am I Am on the other side of land but they do the\n\nThat would be able to\nSpeak [laughter]\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n\n[noise] [noise]\n\nBoy oh boy oh boy that was fun one that that was Fred Schneider and the shakes society after their record that came out called Fred Schneider and the shake society that's back from Nineteen eighty four\nThat's not a twelve inch or uh besides that I probably shouldn't be playing it but it's just such a good song and it's got that wonderful production by Bernie whirl and and I just couldn't help it so anyway what are you listening to you listening to W. O. R. T. it's twelve inches to twelve with your host DJ T. B. A.\nWe started off that set with the ... song called helpless originally appeared as the beside or a extra track on the set\nWhen you bought things on the set back then in the mid nineties that's from Nineteen or came out in Ninety four that was actually a live version that came out a year later or live album\nAnd then uh we heard the beside to a peach Shelley's very first single as a solo artist there from uh from Nineteen eighty one\nPiece is called the witness to change and then also his version dubbed version of I don't know what love is and that's actually the beside too I don't know what love is the twelve inch single again came out in Nineteen eighty one and uh\nThat gets us to where we are now now we're going to head into some weirdness year\nOr a nice long piece as he beside to a single by a banned by the name of wall of voodoo won't lose the band I got to see growing up live a few times was very fond of them seeing them in Los Angeles a lot of people know them for the the a side of the single which is a which which is called Mexican Radio\nBut before that they were known as a very experimental a man that could go into very bizarre atmosphere X they first fancy themselves as a as a musicians to make movies soundtrack a music they didn't actually fans themselves a pop band\nOr until some new some final members came in round that it out and figured out that they can take this not just for movies but to the stage\nAnd or what we're hearing here is a experimental ten minute track\nThat a part of it is is called there's nothing on this side and then there's a a sport of dubbed version of Mexican Radio at the end of that\nSo again a very rare beside off in Nineteen eighty two single called two songs by wall of who do iris records here as well as you do\nAnd see if I got the right turntable turned up your didn't I don't actually turn the switch there\nAnd again this was the fun of buying records and buying a sides in singles because there'd be besides and when you had a single with a beside that was ten minutes long called there's nothing on this side but it takes ten minutes but the ... but they're across well let's just find out what they mean\n[laughter]\n\n\n[noise]\n\nIt sounds like turntable one's going to be temperamental I Do have a backup you're on an MP three let me see if I can get\nStarted\n... how can you tell when something like this scratches I I don't know that that's part of the problem\nBut\nThere you go let's try this again all of it there's nothing on this side\n[laughter]\n[noise]\n\n[laughter]\n\n\n\n[laughter]\nThere'll be ... new as do the show twelve inches which will be back again the second friday of next month\nFor one whole hour of eighties\nRemake the besides and rarity is\nWould you like what you heard you can listen to it again on line on the WTO are guys who are of all of our music shows for two whole weeks [noise]\nAnd uh you can listen to him at your leisure [noise]\nThe beginning case I don't say that the top of the hour the W. O. R. E. F. M. eighty nine point nine at them and H. D. in Madison, Wisconsin [noise]\n\n\nW. or tea currently as an opening before I parked my book keeping\nThe bookkeepers responsible for that motion implementing it maintaining financial records and W. or to financial policies using the cruel accounting methods within GAAP in a timely an accurate mentally retarded company it was to get to return to the few\nPart time and those are the ... additional income with possible ours would make ideal can contract services ... the British and description is located at W. or do you have some dot org ... happening actually do applaud the resume cover letter and three professional references to dance with the by email at the L. I. P. P. I. G. G. ...\nApplication deadline is Monday October Fifteen at five PM backwards radio broadcasting is an EEO affirmative action aboard persons of color veterans women's persons with disabilities are strongly encouraged to apply\n\n\nTo [noise]\n\n\n\n\n\n\nNah\n\n\n\n\nHa [laughter]\n\n\nEvery\nAt ...\nAlright welcome to put your core radio you're ... W O O T nine point nine of them here in ... ...\n... ... that that's going to all of our friends over and you get\n\n\nAnd [laughter] I\nEven [noise] mark\nIn my professional life\n[noise]\nTo do\nAround [laughter]\n[noise]\n\nOn the\n[noise]\n[laughter]\n\n[noise] [laughter]\n\n\n\nI\nHave too much\n[noise]\n\n[laughter]\n[noise] [laughter] [noise]\n[noise] [laughter]\n[laughter]\n[laughter]\n[noise]\n[noise] na na na\n[laughter] [noise]\n\n...\n[noise]\n[noise] I ...\nI think those are the most\nDiverse San Diego every\nDay in day care\nUh\nUh\nFor [noise]\n\nSide is Roger Clemens at\n...\n\nThat I\n\n\n[laughter]\n\n[laughter] to actually\n\n[laughter] big [laughter]\nEveryone around [laughter]\n\nAnd\nThat guy na na na na na na na\n\n\nI Know [laughter]\nDa da da da da da\n\nDa da da da\nDa na na na na\n\n\n[noise] registration is now ... for the W O R G nine of tournaments sponsored by Mendocino central somebody already will take over dreamland once again the reports that six PM but we made it easy to boil so they'll be orgy this year\nFor instance you allowed to form it nobody or do you get them done or and then turn it in with your registration the forms are also be a little treats in the end like Cyprus where the street to known either going pledges\nW O R D D jays will be rocking delaying boulders compete bringing women three skill levels you don't need to be wherever to win\nMobil ers will receive a keeps it in the old ways in with the ... or do you do go and buy tickets to the to your prize ramble more tickets are available for purchase if you've been willing to strike for raping in front of free beverage after boiling enjoying\nThe whispers or county and the prices are going on for about thirty five dollars and three and a procedure benefit there'll be poor community radio\nThat the W nine them just turning it on Sunday and of course at six PM Lisa shoes and will you do for Debbie [noise]\nAll right let's get in to the music again here with the New York do his personality crisis [noise]\n\n\n[noise]\n\n\n\nKnow [noise] now are\nDon't [noise]\nNa\nNa\nNa na\nNa na na na\n\nNa\nNa\n\nNa\n[noise] every time\nLie down and [noise] well\nAnd [noise] by\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nI'm\nJail\nTime\nJail\nIn jail jail time in jail in child and you're here if I can tell my\n[noise]\nThe first\n\nTime in a loud thing\nWhen they asked to\nRead all\n\n\n\n... they do\nGirl\nThat really is they're\nTrying\nTo [noise] [noise]\n\n[noise]\n\nAnd and\nAnd\nI\nKnow\n\n\nNa\n\nNa\n\nNa\n\nNa\nNa na na\n\nI\nAm now\nAnd I I don't I don't know I mean I don't know what I did one last shot and\nNa\nNa na\nNa na na na\nNa na na\nNa we could [noise] either be is that\nGoing to do the competition for the doctor and ran ran around\nSure sure sure sure sure sure on channel ...\nYadda yadda yadda yadda\nYadda yadda yadda yadda yadda\nYadda yadda yadda yadda yadda yadda yadda yadda\nYadda yadda yadda yadda\nYadda\n\n[noise]\n[noise]\nAll right All right All right that was a the clash of course have guns on the roof\nAccidentally interrupted there by a sonic youth and we'll get back to them or after a couple of the essays but just like to check in and let you know that um that was off to give them enough rope the clash song given give him enough rope out in Nineteen Seventy eight\nAnd it's got a lot of energy very a very typical of the clash never tire of that song I Love it doubled underground Venus and first from the velvet underground in ... was before the clash and then off the ill communication out the beastie boys to sabotage those two songs went down to\nCharlotte North Carolina Danny Rachel and if you'd like\nTo place to request you can always call into the studio here it's six to eight to five six two zero zero one\nOh happily player song if I can find if we've got an a librarian I can get it into the pipeline year I'll be pleased to do that um we've got a couple PSA fear for you know\nJust like to remind you to listen to pet your core radio I'm oh Joe and I'll be playing music for another about another hour and Fifteen minutes until two AM here central standard time in Madison\nSo let's get to a two year old on\n\n[laughter]\nLook twenty Eighteen W. or she record rice it on Saturday October thirteenth from one to ... ... art in fourteen forty four east Washington avenue [noise]\nCome down and check out our selection of rock folk jazz miscellaneous records at rock bottom prices [noise]\nOther vinyl vendors will also be on his selling their wares while W. or the DJ spin their ... throughout the afternoon [noise] the W ... record right as one of the biggest ... from southern Wisconsin proceeds from our sales\nWere beneficial station that's the twenty Eighteen W. or she record\nI Saturday October thirteenth from one of the ... at the art in fourteen forty four east Washington evidence [noise]\nSpinning you right around for over forty years this is W. or two eighty Ninety nine percent Madison and W. or if he if any more [noise]\n\n\nThey bring in headliners run all over the country next for local and regional wax\nHow heavy metal band way metal should be sold for bastards players so much evil shiny gothic country music\nAnd fantasy in post ... ... ... animals that ancient history to\nMusic festival Saturday October\nYou know I\nEighty nine point nine or ... ... ... [noise]\nAll right here we go we're going to get back to sonic youth year kind of came into the to what I wanted to play for you about three quarters of the way\nThrough it so I Want to start from the beginning as it should be played this is a ... this is the cover sonic youth did for a\nCompilation album called freedom of choice in Nineteen Ninety two and they're covering plastic ... song supplement poor ... I think you'll recognize this song if you don't recognize that that title you certainly have probably heard this song before\nGreat song great cover sonic youth\n\n\n\nYou know and a half\nA day or two and a a a a ... a you know you're in the\nHundred\nAnd sixty nine [noise]\nAnd [noise]\n[noise]\n\n\n\nYeah Maduro's from the Pentagon Nineteen Ninety four saw them play in Madison here at the rats scale or I think it was yeah the rats scale are\nProbably right Nineteen Ninety four seems like ages ago a lifetime ago great show though as I recall I don't know what they're doing these days but they put out one or two albums and maybe more\nI enjoy what I heard back then gutless from whole before that lived through this Nineteen Ninety four also\nYeah yeah yeah as proceeding hole with their yeah yeah yeah the P ... miles away was the song we listened to and ... the plastic bart's wrong cover song by sonic youth off that\nVarious artists compilation called freedom of choice in Nineteen Ninety two you're tuned into federal court radio on W. or tea eighty nine point nine FM\nHere in Madison, Wisconsin got a couple of songs now from two outfits are headed up by Holly Ross Angelica\nWhich is no longer together as far as I Know and the lovely eggs or going to start with someone from Angelica why did you let my kitten die off the out in the end of a beautiful career came out in two thousand and then something a little bit more recent but certainly not their most recent the lovely eggs album wildlife\nWith the song food and after that we're going to get to a another request going down to the south ... south east excuse me us\nAre from Jay retard called my shadow off the blood visions do Google to cover that um I implore you not to it's rather ...\nHere we go with the yellow\n[noise]\n\nWas a\nHang\nMe [noise] hey\nHey hey\nHey\n\n\nYou got paid\n[noise]\n\nMm ... [noise]\nNa\n\n...\n[noise]\n\n[noise]\nThe\nThe\n[noise]\n\n\n\n[laughter]\nTry\n[noise]\n\n\n\n\nGod was with the Jackie late old school Japanese punk right there\nFor that was hard Christian ... really masterful albums an arcade game out Nineteen eighty four showcasing some of their most innovative music that that that um love it never tired of it every time I listen to that song alone or a Christian I discover something new\nGeneration before that Nineteen Seventy seven the title track from Richard Hill and avoid\nAlso spectacular um\nWe're going to listen to ... the stooges now from Rob power search and destroy and after that we're going to follow up with the something from the germs and something from Generation Next we heard from the blank generation moved here from generation X\nIs well John's mentor blues explosions also on tap replacements public image limited ... still got about I don't know\nSix thirty seven minutes so probably get through all this maybe we'll hear from victims family list\nThere is well if there's time we'll get to one of our favorites here in Madison long villa but I'm not sure we're going to be able to do that so that a lot of music lined up here but nice if we good here comes the stooges [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\nHear some resemblance to hear some some cognitive and with John Spencer blues explosion at least on this song and the replacement\nAfter that I you know we're going to be cutting it close to your hope we will get the rest of the music that I got back up for you\nGet to it all including a bong\nVilla but right now the replacement were coming out\n[noise]\n\n\n\n\n\n\n\nUh\nNot jams will try to get\n[noise] ...\nDa da\nDa da\nDa da\n\n\nDa\nDa da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da\nDa da\nDa da da da da da da na na na na na na na na na\nNa\n[noise]\n\nUh\n\n[noise] them to do that\nKey to [noise] to get in da da da\nDa da da\nDa da da da da da da da da da da\nDa da da da\nDa\nDa da da da da da na na na na\nThe Internet and learn and da\nDa da da\n\nDa da da da da\nDa da da da da da da da da da da da da da\nDa da da da\nDa da\n\nNa na na na na na\n[noise]\n\n[laughter]\n[noise]\n[laughter]\n[noise] [laughter]\n[noise]\n\n\nA song from uh Madison zone ... the title track from their album ... or ... marijuana\nCan and uh I think you you know you've heard these guys here I'm Patrick ... before you've probably heard them around town they've been around for quite a while they're still kicking out a lot of GOOD Music globally last I heard\nSo to back in next weekend if you want to hear the show you can always go to W. R. T. FM died or gene download or not download and listen to the archive all of our music shows are that are on line in the car for two weeks\nIt's been a pleasure\nAnd I look forward to playing some more music free in about a week\nYou're is ... [noise] I'm\n[noise]\nIf you love great jazz guitar Denmark Sunday October fourteenth on your calendar when the Wisconsin union theater presents an evening with Batman scenic Shannon home at eight pm\nJust releasing his first album bright size lights in Nineteen Seventy six the denier says damaged himself as the preeminent voice in jazz guitar or two generations of musicians and it's worked with great just like Warner Coleman Michael record Jim Hall Dave Holland\nWrap metal do and many others both in and outside of the jazz community with over forty albums to his credit for the national rate versatility both\nAs an instrumentalist am composer incorporating a wide range of musical idioms in sounds you wanted to speak and will leak musical boy that's an evening with that ... hall in Wisconsin memorial union Sunday October fourteenth at\nEight PM keeping time with the music since Nineteen Seventy five is W O R D listener sponsor community radio in Madison [noise]\n\n[noise]\nThat is a music collective and the greater Madison Jess consortium present Britain encounters straight passage seven thirty friday October nineteenth other Wisconsin union theater [noise]\nBurn encounters and straight passage have been performing in Madison for over three years exciting listeners with a range of sonic capability [noise] the repertoire includes original composition of fuels favorites and Raul improvisation\nThe group is led by Brennan Connor was on to entering the Sopranos saxophone Jeff Brady provides orchestrated drumming percussion textures\nAnd Ryan Grim Roosevelt the trio playing cello Contra cello and electric bass [noise]\nBurn encounters astray passage seven thirty friday October nineteenth at the Wisconsin union theater you're listening to W. O. R. G. eighty nine point nine CFL listener supported radio ... [noise]\nYou're listening ... [noise] [noise]\n\n\n\n\n\n\n\n\n'cause she you know\nWant to ask you one more question\nThey do need it you know I'm I\nNear like David ... you know when I don't know why should we all know moments in November and I'm like okay but not enough [noise]\nAnd she comes to be done through under the watch me ... and ...\nRight out of Russia I strive\nOf them don't you go to\nOther expansion Jon Cote you\nThree obviously not another dog\nPrivate jet would sit\nGuy looking\n... what if they see she\nCan't 'cause I'm a reason so many on for you\nWhen you get that money to keep your I'm flying in a coup and gotten to be\nFound me be the war when you will run dry you know people were\nA deal with you know what I'm doing if the planning to get behind on CNN\nTo to say I'm a pregnant women not the best\nBeing like I'm Jackie ... only trying\nAbout\nThe you know when I was not about being\nSeen many what I mean money wasn't on my Jean\n... what is it should\nIn the journal [noise] where's the fake no game ... snow cease to be the cars I mean the case may emerge battle me we you know she ate our Bernice per se our\nTeam when I Will be on the eastern part will is with us from him in ... ... [noise]\n[noise]\n[noise]\n\n[noise] everybody [noise]\nYou to do today which is why do they use the new law as Richard Kevin gave me a\nDollar\nThing I can be new remains the key they gave me you know you could do maybe they do when you when I get home and I you know do they not of a deal but the question a mom and dad to sit down and\nWhat we got a monetary see my painting the safety of manic ... take care of your your mom or go out they clean my father does not have to keep up with President loving tell me\nThey driven a bottom I'm coming to me they limit eight hundred like me and they see a movie that I didn't know much about\nYou'll get new new here dollar\nMentioned black comparable by you won't get ... to them I don't come with you we\nTo the bank and I'm trying I'm trying to\nIn your ... your name in your life in fear and apply it is I hold on one\nHey how you how to be the Boulder you got to drive a chauffeur bombed you're definitely was my old we can mean that the whole state what Iran will be when I drive a big when\nAll the deal boom\nGet you'll get you'll get I'll\n\nBut the guy\n... they made him again for the team that you eat Chinese magazine where Sean appreciate when you really want to come in and I'll root for the day you know\nLast one in the dining room in the year I'm going to\nFor three going home and your business and\nIf they're going to go to\n\nHave been nearly a dollar\n[noise]\n\nYou don't want to give me a bit is looking out and how much does that mean your money and they can't get no sleep problems they cut ... what do you know bleak gum you don't want to start one of the budget rain you'll be a big you got out of the song make them down in that case management you understand you know when you want to wait until the\nLate in the middle one drink a lot\nThe giant na na hey\nHey you're not actually is out trying to find me to look up and do the ... that change it into a river grimy Clinton symbolism business she despite ...\nThe money in a jazz me maybe I was in your twenties them in a ditch the hottest or the ... the west side they are just shit I'd say surprised me hey [noise]\nLook June and being when I Am dramas timely a got a president for my opposition to smile at least I Know a man gotta move a from a sign me\nI'll swear she got that ball\nAll of that but she won't change worry about the wrong\nTime they get arrested gets there should be buying that just plain level low key word there are guys just do what you do girls play sweat joke game playing Lesko though Bowers limos on going back to that make you know as well dang dang who got a new group would assume right Jennifer isn't that a bomb\nYou were up now you fell in love you pull up a cast better not get a job I might get caught with my son bitch because I put my main bitch and I got\nReally bad bitches and they lay low to switch to gain ground with this shit is a total switch [noise]\nNow suing them if you don't want to try to keep your business looking out you don't want us to have a young man who can't get no sleep honestly\nYou walk around no bleak complete you don't want to start it run about him but you raise your become big Utah to swallow Nazi Tom make them down the street you know can't benefits from the um main you know ... ... what do\nYou want to drink a lot of protein I'm trying [noise]\n\n\nStraight on tables\nRight which leads up\nYou'll excuse me let me go deco ocean called killer whale\nThe footage grade tip the scales to try to keep a steady\nStream of science class with the killer had the grade\nCan do to try to keep a disaster I hate to\nSee some bakers we give them some gas first class from Jamaica certainly steam two minutes later you still be the place you know ... plus it now\nI Do it gave me somewhat full day up a pile of daylight knew he does something like you can do it over here I'm somewhat puppet down I Love bowling balls\nTalking poll put this to happen to get there you could still smell will not finished their bag with people and try to put a bag or something bad damage I'm hoping you bad because I got the ... but no one you know talk to him the way some hills up to them high enough I smoked at least\nOne of the killer whale watching science and drag with the killer had the police raided the tip the scales to try to keep a steady\nStream of super size flag with the killer sneak into the brain can sometimes have to keep a ... I'm going to try\nTo keep saying they don't apply that get high gets the killer whale was made to read what they ended up failing though what you got to do with what the two within inhale way you know when the exhale\nSo well known a lot of weight and they told them back to the Houston like we got some trial and on the record record triggers boosting the blues and then I'm helping out on the secular cast as they keep telling her to calculate\nThe baggage which they have they can break it down and wrote it up and now let's get back to the business [noise] I Need to cap some Swiss just because like I\n\nOn your back against the war and the boys that show do what you want to do one nigger which is you know ... nobody else [noise]\nHey check this out in the Gulf so I just wanted to get a chance [noise]\nSnow to walk away and pray to God you know\nI Know I left school between like ... some she gets the\nPretty been many step in when I'm In his speech\nWe'll talk about writing a book to reinvent with me\nOn the kids love your show called ... which\nGoing to be called a bleak\nBody feel as if it was back to back home\nComeback county occupy them keep up with a\nFor that for\nIn my geographic I Need a million real niggers was the it happened\nSteady was overlooked and so I gave you actually saw Adam Smith magic set up the habit thank you Neal we didn't\nThem onto his diction get choked sucking tail game on Bush with all the money they can just look at\n\n[noise]\n\n\n[noise] [noise] [noise] um but my name on and\nIt took him on a ... a trial down that a woman named mind\nTalking about earlier on and we cannot buddy ma ... seen his parents\nAnd\nHow do they do I\nKnew people who I\n[noise] if\nYou're able to talk about rich no wouldn't never happy catching the hobby not opinions wagging pocket for the magma never sweat a book in the past watching several was bracket and they were bred nickel\nBaby I got on the west that out by ... like I'm trying to make us better understand the whole goal but you've got the family or something like that oh she told is actually on a book on like that\nI spent time\nSo they do [noise]\nTo people who I\n\n\nThey've got to do Twenty one going slow pot roast policies are televised she got the Jews of why he got out of my G. go door to door Gucci suit lined up for the ... LA a no fly zone take it to my aunt second to your second finish I met\nThem for them to show for parents God\nPut that on my mom I Try to watch that but I suppose the best buy for your business you know that's a crime gang feed it up and shouting gangs hated up Sally or gang fight it up ... percent games get enough that you're trying to do with nine months or years\nIt took him ... though\n[noise] um that's my [noise]\nMy on my student\nLoans and [noise]\nI'm afraid you [noise]\n[noise]\n\n\nUm\n\n\n\n\n\n\n\n\nI mean I didn't know that when you come back\nYou up with the video you\nWant to read you know we both brown eyes you know life liberty and all\nThe way I mean I don't feel like I\nI'm In the real the right now I'm going to\nWoman\nYou know how to secretly posed to be going\nYou guys to these in a trench with rivals out quicker than phone in the bathroom and all of that I saw it it is a priority for the night eternal upon how come saying please be also\nMake America traveled games [noise] pick up here on the ground but now\nWe're for travel care [noise] ...\nI went to keep that on the low I got it from a going forward in front of the things that were Alfredo they're ready to give you trying to make good for your time over time\nYou know the the the bad writing is a clear from the get down to three five I'm trying to do which\nMakes it will be bad for the children\nBut they weren't big enough to bring Iran to fill the band look we\nTo phone these trenches rivals sample owning a ...\nAnd all of their little concern I have also\nRead from your image rapidly in the last man like Americans around pertinent to the airports around here and I'm looking for an individual students\nHe was on that but you're never going to get past me but again I Want to break up white green wondering what the book and do what they mean fucking on another ... percent negative alone but just not the best just pretty much we have a yellow\nNow you're wondering why not give me your phone\nYou'll start getting rid of that the that you're\nTouching yourself looking back you up to hear that now seem to tend to be even though I don't know what the fuck you tell me who you are right on the part of a gun ownership that I Do for your daughter and my mom or dad\nDoes she know what they're trying to you guys are soccer now you're\nUp you know what I did well let me go you know not a problem that in a way maybe not that much\nBut you know 'cause I'm not I'm not supposed to do this I guess told me to go to this\n[noise]\n\n\n[noise]\nMore except me how dare to oh you mean how\nMany she took me a long way more [noise] more meaning to me like [noise] man\nMoney how much money [noise]\nMy money [noise]\nTo me how do\nMean I can go once they won't let me\nThe line from we smoke had to go work for me to be there you go to ... to give them like she wants to stay [noise]\nMan I can you stay mad though 'cause they don't want to tell you is it should be um and they need to be stuck to help with the life\n... ... dollars for the longest I Know exactly what the what's it like for me to make fun of my way you've got to come up with what's been shooting\nNow\n\nDo you remember when I get a caller in on the one I'm\nWrong on\nMay ... ... ... on the wrong number ... ... ... ... ... ... ...\n... ... let me so much about what's wrong with much like the health care\nAnd they were like on the air for me I'm\nFrom already made up on me so much for joining me so much so you know I mean there's really no no I'm just like this and now that you really can't even though\nI mean I just I mean I I don't like 'em now right now\n\nAnd then\nLike every every\nDay\nShe used to say he's a hobby though ha ha ha\nHa ha ha ha ha ha ha ha ha ha\nHa ha ha ha\nHa ha ha ha\nHa ha ha ha\nIt might be seen on my clothes but I Know we were like well when we smokers lemon cookies will grow but the moment with the dog will below with the last election will myself were the modem that were my and I love when we're low\nBecause I notice she gave me though I mean don't end up on me closer something new coming to something that she go right now one thing in the media does that can be an addiction a show of soldiers leather ... must members would not be a little older so I'm Still don't want to pretend oh of course still don't ever ...\nOhio mom I my uh you know like a blind eye just by the time my three by white black Asian guy out here I Am so I\nLike dogs are right now our gay that your butt down right now on July ... right should try to\nMe like a little wary during my we hung lonely\nShe died she she's a she's a she's that right now I\n\nMean like we knew\n[noise]\nNa na na\nNa na na na na na na na na na na na I Am I\nHa ha ha ha\nHa ha ha ha ha ha ha ha ha\nHa ha ha ha\nMy guy dynamite brain by by by mine mine mine mine mine mine mine mine why why why why they call like this guy I'm not I mean I just my time I three by my three mine\nMine read my my my my my wife my town like this guy out\nUh [noise]\nDon't know\nThat you've been jumping encouraging you big government\nMidsection Dana\nDana doing what\n\nStaying in Beijing\nA man or but straighten up saying and thanked\nAnd again you get too much\nJust because she never would it make you would do just about putting you in a limbo John about the brain to bother me so much you need to go see it on our shut it up\nFirst show on and say thank you guys for giving me the opportunity to do shot him than the weekend I wait for friday's to come and stay up so I can let my husband Wahkeel low at Fox site that I Love him and I care or let him\nWho the love of my life you are like king MSU and again thank you guys\nI Love you appeal you woke up research growing up you can you guys do a song lump day by plane fly foreign\nLoved to have my way of life yeah please we got it I think you guys just you know which\nOne\nGo back and my broker\nOr like they'll do them and put in front of my coat\nDown to the um like\nI'm\nSuffering from\nMy son\nUm it's called [noise]\nThe bad part of growing up I was\nGetting my mind went through it all the medical bourbon than I was already on the table you ever been laying down the road there\n\n[noise]\n\n\nThat come down over the next morning the\nSay never heard from them even being you know we're\nDifferent set up on the plane that someone could witness\nWe can do to rain check\nDocument coding racket no Ken let's talk in rolling down the block stopping smoking barrels ... lower down as well known we thank them up and down the window I doubt among\nAround the tone it down in my lap you know it sounds like it's not just joking when the pound above us Shane Rio Grande low create\nGrow a caring for a train to appraise the dog to break the chain restaurants\nTrade it brings it brings the pools are carrying a train to praise the break we're going to change it brings it to bring the pool jak [laughter]\nThe heart\nOf the town [laughter]\nDogs the same trap protect you'll\nGet in line [laughter] find the time just shot trying to shine a\nMonth so\nWe think is the best\nUp talking to me you may just lay your loss I came to praise the break the same time take all your brain the brain the pools\nAnd I know I Know I Know I Know and I know I Know I Know\nThem by trying not to be and they don't when they made that regular with my brain made how\nDon't know that he would make is I grew up with the\nUp and she does talk paranoia and yet I don't want to date back to drink but we tend to do before we got the same in the right to know your way to go to one of the\nProblems that they wouldn't and then we are\nWe waiting for them to get a bird and once I get in\nBeen back for a moment we've been on one thing that we believe me oh I Do believe that too and they made me and my mom wait one more to come up that way and I know that they lose\nA on a on a on a on a on a on a\nOn a on a on a on a on a\nBeing made that then they won't be\nMainframe idea but I got\nAnd you will get my rabbit hole not that they will go with my mom\nThem although they may they may get banned books and I went\nBroke through one room and yeah I Do not know that they're not being married because they may go I wrote a book you're reading\nOn and on and on and uh\nYou know on a on a on and on and\nOn and on a on a on a on a on a on a on a\nAnd a little boring rang again and three members living on your\nWhat made me wonder what this much I don't mean to\nMe and my dad around the country you're going to get what they want\nSee what the hell do you have to be that way you don't mind that\nKnow my in my opinion but now\nMy Lai maybe get online\nAnd on and on and on a on a on a on a carry on and\nOn and right and I know I Know and I I Know a ... I Know I Know I Know\nHow they treat me in the journal loving them when they get a loan\nTo me the money I'm not really what might be able to allow it to be a\nVote in the past that do\nGlad that I like to go try to talk about in their lives in the bank or\nRun by trying that\nMcCain bravery goes on the other day and then hey what do they do it\nOn a\nA on a\nOn a on\nOn a on a on\nOn a [noise] you\nMy comment that don't obey there'll be a bad guy told me when I hear your new book over the over there don't have the whale broke my\nRule in the laundry on the phone call here at home mom from the bank do when\nYou're in that part of the unit of where you do\nDo you know and I do when\nComes down to my life I have a good thing for\nTime right now in my life on a on a on a on a on a\nOn a on a\nDay every day that we would do that now because it's not no no no no no I'm not that\nGod\nWill be a lot of money invested in New York\n[noise]\n[noise]\n[noise]\n\nA number of them are you\nKnow [noise]\n\n\nUh\n\nI don't know where you live in a month and a bird for during the day just restrain ever had in the room for the money that you know but\nYou know and they were proud of them are are near ... there were no it's a different set in my mid ... or ... or even more of\nA better job than another but we end up\n... better known each other and that's why I'm Down the down a lot of I don't\nSee the rising share my friend and feel that there will be about you know and I may see that we will get loose but I think I don't even make love any more than I ever got tense and they'll be watching television and the main lesson you react live each day and\nI don't know where I had a um\n[noise] I'm not supposed to be here\nSo that you know ... a night and she didn't want to read email you weren't as a vice about what about ... ... I Know she you know what I mean as you paint got the Louds barrel getting off the bat\nAt you like me back maybe what am I ... that gets on the body and then the other that I'd be bad teeth map that don't know who your enemy of problems and I'm Aaron ... what do you do then they just keep it really strange\nAnd I never ever done it and but you are on even most gas\nOr something in a different time with him about it we don't even\nThank God it's\nDone you know end up in the ... or ... hours a day\nI Need a bad thing that\nPressure that\nThis would be like you said I\nDon't know where you live in a better man I'm there are talking with you and then they just ...\nEvery man woman thank God animals you know then there are no different than it does you know in a [noise] they beyond\nHuman game of the things that\nWe know enough about that it's bad for you know make sure that you know like a month that you know the good news right\nOr no you're right\n\nDJ big juicy tune into the ... you say we listening to the new wave that was perfect strangers this one is used to go get it to some of the music um say get right back to it which you boy did you do see your own\nThem or what but then I Know you get used to make me think reading that you make your ... to make me think men as you make a fringe I\nUsed to make you make me to keep\nIt on the east to beat that it'd be the\nWay you could be right up there and you must be getting the now\nYou want to be a junior give you the number you\nWere you were never been afraid to do their mouth and said now been helping slipper nothing there been trying\nTo turn the page [noise]\nI Do not want to give\nThem a semi ... be\nDitching di di di di di di di di di di di di di di di di burn up in a way to help them out but what\nAbout you know unit goes I don't know you know you just I don't know what my middle like we need\nTo go to ruin the of black men in Britain like a ... do you need to know the thing is none of\nThem really get to know what we're going to break down there with them now it maybe it's better to be there when you were there\n[noise] [noise] [noise] [noise]\n\n[noise] I just\nWanted to give them a leg even\nFeel bad about [noise]\n\n[noise]\n\n[noise] [noise] love isn't near as FCC present the main squeeze\nOn Wednesday October seven see that the Amazon highly knew we were the roots as a party ban at Indiana University the main squeeze preserves of how our fate fusion of full sunken hip hop styling inspired by the great yet timeless futuristic remains where you can cook up a vibe mixed with emotionally bigger\nOpening will be the Minneapolis based for presenting their funky ... that's the main squeezes on Wednesday October Seventy eight PM at the high noon so this is an Eighteen and over showing what he'd be funky and informed this is eighty nine point nine when you have to have you ever you are the medicine [noise]\nTake threat will come about by [noise]\n\n\n[noise] [noise] [noise] a little run down below the\nClinic click click click and not a bad man man and one\n[noise] oh God [noise] one I've\nDone the bad business deal with every day and my black behind me like I'm coming down the driveway ... friday and I'm right but not by me to say wow a\n... D try and give me that now might that might prove bang micro deep and saying I'm aware of the other great you know my real name you know saving up pulling up and they're\nNot going to kill as many Neal and when I'm walking in the middle of bringing women now\nBrother bank account about bill that was really no they got me young players from day to day by day let it go\nIn the late ... and my mom was laid off a little bit more clear a Laker fan man [noise]\n[noise] ...\nYou know your dream and where to draw on what you would like us just push a button and you're like oh my God you know\nThat you're home a lawyer a jab at your home my lawyer just cut your mom or their blood trauma on your idea that you put your idea that you get out there but you know you are there but I'll tell you I've never ... oh yeah\nOh yeah oh I Want to give me one on one or lost or need a lot more about the big dome is a\nProblem with the drama roller no more dry no no stop the and the question is do that on the news these do it the battle of the world back in March ... she's a\nWoman on a call ...\nDe ... says I peach cobbler I'm On a good mom no no no no\nJust added to most big money world in profit Dodgers made another one them let's start with we want to do that just bone all black the new ... well\nI Want to give me what are not lost on me to move back to the big drama stand on my own come all the drama last no more dry and they're\nYoung [noise] [noise] [noise] [noise] [noise] do you\nThink of a thing of uh\nHer maternity a drug dealer during you know how do you happen to be ... to get their children in doing\nThe company or he did not call for this child rebel soldiers join open in her lap return traveled came off in the U.S border trapped but you know with him more than a pub [noise]\nThe judge said the smoke would you know our own you know you know not only that but you know you all either merge [noise]\nLands in law's yours because you're from the bottom of the low cost if you know you you know\nOne of like a Wal Mart rejects attended the drawing board you know you know [noise] did you know by the current law shrimp George supposedly um where did you know you you know\nThat's the reason we ball full circle round twice for the call do you ever been in the water weight has been had the way the more always you know you know we all clear like Golden State agents in Japan with the movie you know [noise]\nBeing green which is like the genie some bad to be a little teeny town\nThen how how do you mean the job market right now [noise]\nThe only returned to his show on rapper tired of being on the front lines with shrimp boats are drawing and\nWe're here with big brother I mean we're we're ... we're we're we're we're we're way where you went wherever you went by where where where were you when you when you when you when we're ... we're here we\nAre no no no no but more and\nOf it was a member of our number ... ... you know we're in a\nDifferent set up on the ground and got someone with a\nBrain then\nHave to re check my playing soccer I would've rocking and rolling down the Pearl roundabout Barrows lowered Donald Trump\nAnd no one to make them up in the window a data moping around the corner and learning about the no smoking when the above I say for your mother in law creates dog ticks may go for a trade\nFor a drink to pray for the three guys take all your brain the brain\nThe poor [noise] Jane [noise] three the three the no fly J. brain the brain pool table though to\nShe amount measures [noise]\nPGD brought about bull how 'bout jak on balls split go\nAmount can measure for [noise] the ... part of the bowl compiled project on the couch check\nIn with your friends are in charge you might be more like a tired day tell nobody that's what I say\nThat don't go to Jerry on your Sunday all\nI'm a good job of chairs in the tunnel hanging on my locker chandelier type to move to a ... in a way to guarantee that right now in a\nMuch better to do that she thought about\nThe ... the part about Jack on bones last year to\nA massive [noise] take the heat the part of does not bow object on\nLindsay on them look bad oh did you get out the job of ease up was brought up in the house you know what you do but it's cloudy Hugo but stayed open your mouth shut she'd go on the ship lumber told you smile I Need to make\nDo it but again I never thought of buying a Cadillac the dishes and then my bank for that\nAmount of thought about the region jak on [noise] [noise] [noise] [noise]\n[noise] ... part of\nOur project on a golf [noise]\nAnd it makes the short black do right here on the eight O W Archie eighty nine point nine in Madison humor\n[laughter] [noise] [noise] [noise] are you know you had to switch from\nTown on the body the body that job then they\nWant to know me as I said so rolling stop what they'll never stops it to do that that the ... ...\n... ... ... ... I didn't get that on every day just blend in with the debt data sneak it in a bigger sweating 'cause I'm going to be gone by both with the ... the left on a blind\nUrban pet pet pulling gimmick that they can get a rat\nFunny how they should pay pal embedded curtain by myself to take a look a\nBit by bit of 'em are hard hit yum light skin but I'm Still a dog I'm always ... I'm ... I'm a given by a dog ... widow got I'm a bit of um a bill ... I'm a great big uh yeah I\nAnd there have been over ... percent when he was going to do on every damn bottom willing to do the job market would end up with the news you know I'm all for me because I'm going to leave the back door now are the ones with Daniel from Mr ... you're right\nThey really do it and give you a three day in and did you hear me now to help with what you know when you said\nIt's hard on them to go on them yeah I've got a hold on hold on to win a gold on them yeah and how old are you mom lives\nDown di di di di di\nDi di di di di di\nDi\nBut the shades left me in the game in hockey game shows I won't lie to me\nOn law then I'm I'm blowing it\nIn your blood I think you have when you leave\nAnd not just learn from this is Don\n... who died you know the day of just died and I'm dying to know [noise] [noise] [noise]\n[noise] you\nNever know what are\nMoving\n[noise] when you [noise] [noise]\n\n[noise]\nWhen they [noise]\n[noise]\nI mean when I when I when I was let me thank you might you might be one of my\nBrain every day then you're pranks tend to have as being the same as a way to pray every day to day your brain that I hated the name is writing yeah\nI'm a black man in the past time may be in danger or watch a lot about three and oh by\nThe way to live in a memo by young yeah drink drink and drink a number of problems out on me nobody to name a lot of that\nBut the ... district break down the road so what we don't pray every day they pray to anticipate the same as a way [noise]\nPray that brings the hate is paid to the other way [noise] prank there every day they print the average pay the same as well have a great job at the same price to pay the same way [noise]\n[noise]\nOkay no uh uh [noise] you can go away from [noise]\nCan a high but she'll I can ... you know\nTwo young ... [noise] [noise]\nNo I Do a lot of\nThese so did you [noise] I just wish strewn news [noise]\nAh we ah well there's some mine is one of the guys go\nFrom a live in the soil you [noise] who\nIs a big man [noise]\nAh just good shows no nah [noise]\nPlease a big man [noise]\nAh just to say I'm a\nDay [noise]\nI think I may I think I may I give them a break for now\nThere again explaining and in the summer time and I had to get low as they get low I had to get back and I had the report I had to give back you into that you that in your intro swimming and and I find them amusing during the boom swimming\nAnd I guess all the time on an economic anymore I mean you don't want to time it's been a daily reminder of how that guy like when did you find a\nGood look at my around me I think it would only in central and if you're not aware of like those in your mouth as the law by me up that back from a lot like ... and all that so factors\nMatter when it's happening in my life is going to change I still DREAM Act and he was known to do it just so happens I think\nI made it and I think I made it gives them I was smiling and your the racing down there I Can't explain it and it's all in a job and I had to get low I had to get low\nI had to get back I had the ... I had to give back to say that you say you're troubled swimming and yet I find them amusing you'll end up making a\nSide of the status and started a new study says yeah that is so close and\nI have a dream demo great lots of people are just supposed to have you been in the mix when DJ short\nBled do right here on W. R. T. eighty nine point nine if you know eight which is a DJ big jumps is coming up some more a little ways in the car to five right here some\n\nIs no room for debate over the nine ... sponsored by Mendocino central committee or the greater dreamland\nBut we made it easy to bully or gee this year\nFor instance are allowed to form or ESPN or early and then turn it into your registration forms are actually living in like a price on the street you know when they used to collect pledges there'll be a ... or ... D jays will be rocket fuel blade\nWhich can be funny in three skill level you know you were ever to win\nThe mood is Lucy but she says well usually with the nobody or your local fire tickets to the your fries raffle tickets are really ... which is just that moment to strike raised in the front lines of ...\nThat's the joy\nOf this for the prices are we looking for a five dollar proceeds benefits there'll be more community radio\nLet's just put you on your mind in tournaments on something and then it's the least of which in its history gently\nLifted W. R. T. eighty nine point nine FM Madison\n\n\n\n\nMonday\nAtlanta I'm In love with it like in the\nAir me out of reality on\nBad a gal that lack of negative negative\nJob than a damn about\nLike what you meant factory\nShock [noise] and\nAnd I'm tired I rather the\nDi di di di di\n... no no I Know the blood that know me\nRight now in old and all that but in any given day that I\nMight even have it in that age ... mom let us know why but you know what I can show by the way\nThat you\nKnow I don't mean to you on a day that I'm a newly game man I Can't farmhouse Adam my hey if you want to win my high jumping on to say that on balance all I Am a mailman MRI [noise] you know what I Am I ...\nI Am the one that I Need that and I'm\nTrying to find cannot\nTurn up tonight that man knows where every man for hours at the Dana men and they stay in that atmosphere thing though that the data and ...\nMy mum jak your around well because ...\nEven on anyone will learn new in the you know we make them do\nNot know damn well you know I heard you come down and you have a great thing then I got at the same old am I train narrow and I know and when I may not have now turned on and [noise]\nAnd and as soon as I said that Adam fat and they haven't run I don't see that good\nThat game but she is bad you know my mom I Want a good\nLuck to you to\nDo so\nMuch that the girl she on fire must next girl killed you dial the month jak he drove do well my only desire they've done their job to make them ... or ... or maybe I'm\nGetting the money on their them on the other guy you know maybe manual going on like you know and I was\nA non but sure why\nDown in China that lived to be at a factory wherever you live\nBothered me my wife about that but I should write drowned my life\n\nSo [noise]\n\n[noise]\nRight right and I gave divert [noise] we I borrowed from Gerald emerge as we search for that one way to die to\nGreek yogurt ... the church and I don't speak Byrd gave the burden of queens I borrowed Bartels street I learn a lot of say lawyers\nHave lived with them anyway and it's like my base of the parts of the American idol speaking my language you know as soon as I Am but we\nCan learn [noise] I got no concerns about every ours and buy like a ... themselves and blow a superb admitted it hurt and he's with lots of a nerd you turn out to the ... are you from ...\nSeat and eat per person per E R B but I Will be getting started on the eastern part to the church I don't speak bird\nSeed to find time\nTo time\nSee me man\nCame we part Puerto Rican bars beat them these birds ... percent in the in the Marines I Can't remember what I Want to learn how to eat ... multiple king had multiple jobs\nI'm a general matter you're going to the gym and not be the gym a lot of talk on that him talking to him a lot to be in and out publicly trip an awful lot they're going to beat up a cricket ... made a couple of not turned out that but not all about the market out there that are playing on the\nEast or the ... when I Will beat skate scars on the eastern part of the the ... I don't speak for part\nTime to time to time see me come to the\nGate learn learn and we have already learned I learned aren't they go back to your ... of our day to gardens I read it\nA darn good I gained ... oh geez I beat the cars I beat the case or beat the market\nWill be ... you know she eat or eat I eat are but I Will beat brunch [noise] hard on the eastern part I Would like to like the earth [laughter]\n[noise] [noise]\n\nThe guy who do during the more and more of the new album Don ... we can come you enjoyed chatty next week here on a\nMore and more the ... the\nCurrent trial of immigrant drove it get up from a film that but\nJust go with the ads on a story\nI don't know where to go back to where\nMan named strain on trade I'll\nWatch that dramatic way they handle me actually when\nIf they do share\n[noise]\nYou\n\nThing got to say it again if you're\nTrying to play the game when I go to\nKorea just oh you mean like you know\nSay only buy up on the other hand if they know it might not want to have you on\nOn the no no no\nImagining getting rid\nOn right now is\nCan't\nWould you include knowing that\nAnd they were doing was injured\nWay\nTo make better known as ...\nOr ... or ...\nNo object terror in the day or two but may\nThe black or white or black crows both\nOn germ [noise]\n\n\n[laughter]\nSaying for change\nThey felt that all we do what I Would I be able to do this you know my family we bring\nStory and I'm Glad I got caught you did you become rumbled bomb bomb bomb bomb I tell them that I'm On a made me mad dog day the owner\nDied on a diet may be\nI did then me mom is they had to do any made me die\nStay on and run it died on Vermont may be in my eyes on the day I Me mom and dad and he made me sad that ... me sorry\nBought more than ... like when you're hooked pressure on a ... actually on a ... a bummer by those extra thing was you felt that arming the rebels do but Wellman up their money over there and now I Am ... at it I just die in a\nTo die by I don't know what the hell yeah\nEyes jumping at your comment was commenting that Jack Conway magic in a way you can't come back from ... I've been at the ... the other side the ads and you've\nBeen there not been building ... and you were not being black and I've been to like the ...\nMillion in a ... billion in a\nPatch or you don't want to use or kill you but now mama say\nThat I'm On the rise of the online I don't remember them out and buys a lot\nOf the day may mom and dad I'm running mate really tied to adults they buy a bond and died on\n... may be\nTheir their me mom is there a bomb and maybe we bought a magazine and by the dog and a ...\nA lot of good\nThen died on me about it but a\nA young man [noise]\n[noise]\nI\n\n\nDon't even\nKnow that to go to a place next girl Shannon the state's next ... next ... next\nTime the house a lot of them are faced by jihad in last place next everybody in the face by now and I get the ... next\nOn tap in to pay ... pounds no doubt that murder what came next I mean my mom and dad implicate type when ... and like all of that\nAnd I was safe and we ended up in like an open said that if a deeply over eight nine one one button debate none of\nThem [noise] you know to pay higher paying job with apple butter whites and I had to jump you'll probably pass out in that building and shit I learned a sex and the bank no one caught a case by case bank bunker but it may not be just like night and um\nHave like an on base gray and when the ...\nAnd ... and\nThat May Day yet I'm Amazed that yes or no coming back with that gays and that led to play but I like playing the\nThat you've been turning over he grabbed nigger brand new to their jobs and they got like ... I'm On my right\nNicole by ... by ... Nichols bumbling glad and don't get Nick on the spot as the milk breaks do bring a new money print a ball game\nWhen they said we don't break and don't need based aid that we don't need at home may have come in late ... which low pastry do every single thing blows me away his\nDonkey I have ever conflicts and I never paid by the pattern\nZone snake bite or but I think I Know you're not talking about a ... on a blow to the like to say that\nYou look at like ... next time\nMy mom a ton of celebrating like got an Kobe\nHad that vote will\nGo by the\nUs take our heads in the bad boys ... as long as he told me well amazed a nickel random then there'd be a donor rampage\nIn the morning and brings in the bank\nAnd they have to keep the last place I don't always managed to keep my best friend has a new one time I sang while you're bound by candlelight kitten Bush that mankind give and take a plane with a bag and I go along and I get up on your tongue okay now I just\nI just love how they ended up that around\nAs ... they do they did say no but the whole day what is the ... knock on the white out no ...\nProblem and pump that base and the guys apparently close to say ... to bring to capitalize on homeless they locate you'll miss cut all age when they went on my show in the ... and they've got all hang\nOn a ... eight and then a guy that when we are in advance of Mac and just in case nickel bag on the Gulf based upon you know right now I'm All right thank you got to talk to you know I\nI Know I made a man to die in the middle man again maybe\nNot in my mind I've\nGot an idea of not wanting to get a pet I didn't want to go back\n[noise] [noise]\nSleeping with the enemy and my name is an intermission sleeping beverage Italy so not just on the interest in that it's done in the middle of making like Britain that we might get in and she didn't die sympathies dream and fight you have to come live with somebody I Love that physically\nVisibly pug didn't lose the hook some jak kissing me she died neighbors the not a boat you're going to be with demons got dignity theme of memories I had a little revenge and reason um is this the bus stop giggling\nA demon deem a man [noise]\nLargest team a\nMay\nHumor with them and ... with them and I'm a beaming with demands I got damage done them a a um a demon uh them you know by name and not\nThe ... or even to demonize them or even a [noise] I'm In a\nGame or a man\nAs a team of about has emphysema Kim we dance founder hello and led church you know talk about\n... ... and\n... the minor leagues\nAround with them in the ... the ... that now on to my\n... on the the Mumbai demand so but the Damon on the global jihad Greta ... as a problem with them by name and not much at all but they may not have to [noise]\nSleeping with the enemy and my dad was a\nLot of a sudden in Britain I buy my misery deacon like Britain lick you might end up eating like sympathy screaming cry for me come alive mentally alert that it's basically a low class\nMiserably lose but how long that gets me she about died neighbors the now the pope you're going to be but then we got\nName of God memories I had a little revenge and meet the Mets into the buck stops giggling and did it start\nBig deal non human being a\nMan\nWas the same and that is what the damage that they play in a budget that theme or about\nHere though when I travel you know\n\nOr ... or [noise] and he's a man\nA man or two and a man\nPleasures there'll be ... D jays will be rocking believe two bullets compete\nThree skill levels you don't need to be wherever the when ... received let's see how ... nobody will work you wrote it find tickets to the your friend is rapidly more tickets are available for purchases if you give them more like a strike or read the front lines are free\n... average after being drawn\nTo discourage the prices are doing it for fun though the proceeds benefits there'll be more community radio [noise] but uh but you know you just turn them into the it's the least ... ...\nFor example\n\n\n[noise]\nI mean remember [noise]\n[noise] [noise] [noise]\n[noise]\n\nOver there all\nDay by another awful I mean if they told us that was walking on the show of force vice\nAlmost fall off a couple of things like that so often almost [noise]\n[noise] um W. or to currently as an opening for a part time bookkeepers the bookkeeper is responsible for that washing implementing in maintaining financial records and W. or the financial policies using the cruel accounting methods within G. A. P.\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGood stuff but they'll be\nGet me out on me them in and\nDi di\nDi\nDi\nDi di\n...\nIn the last thing we don't be God\nYou know then\nThe guy who did\n\nOn the are you won't be regarded by many here we are\nCertified you\nKnow I'll see so many people in Mali soldiers Goldman's or you know\nStick by him so [laughter]\n\nYou could pretty much does it then and now the mood and now we're not\nGoing okay now they know that can go down right now to\nMe that no no no no what am I ... no no no no no [noise] highly\nEnough to above ... by the time they go to guy in your body to move down to Atlanta depends on the line a little\nIn my own mental do go out and buy another you know not only do you know what am I going to look beyond land on me that no no no no I\nAt the time of day though\n[noise] more and um [noise] and\nMood and\nThat took it\nAnd they may be one\nThing is that over\nAnd now you know you\nKnow unknown [noise] mood and I'm going to be part of the\nMood and I'm going to\nYou know [noise]\n\nThe drama of young men and won't be reviewed me go resigned if you read\n[noise]\nA title but when they woke\nThey or to buy another one for them a family member that\nThat in mind if all up and that's all they were walking is almost in a couple and then you know the jokes all that's when my son was all over the last I think when you put it\nOff I don't want that [noise]\n[noise] twenty\nEighteen W. or tea record write it on Saturday October thirteenth from one to ... at the art in fourteen forty four east Washington avenue\nCome down and check out our selection of rock spoke jazz and miscellaneous record that rock bottom prices\nOther vinyl vendors will also be on hand selling their wares while W. or to DJ spin their best players throughout the afternoon the W ... record right as one of the biggest old vinyl events in southern Wisconsin and the proceeds from our sales will\nBenefit the station that the twenty Eighteen W where she record right Saturday October thirteenth from one before the end of the art in fourteen forty four east Washington evidence spinning\nYou write round for over forty years this is W. or two eighty nine point nine if Madison and your W. or if you got for [noise]\nDon't want to go to Julie money's always going to\nSay bye [laughter]\n\n[noise]\n\n\nGet dumped by some bumps when they did that get the best on the rebuilding the most dynamic\nBuilding in\nThat get you know what I'm\nThen out any gummy\nBuildup\n...\nThat long\nA mom who get clean and all\nMore or less\nSide job on\n\n\n\nIt's not a lot longer than that [noise] this did they get the\nBack burner missing the boat and then we'll start\nThe ... the ...\nThere'll be gummy\nThe domain name living\nThe game but I Would get you\nLive on\n\n\n[noise] [noise]\n\nShe's\n\nProduced around the country are geared that rocky be reviewed ... a\nStrict by the river [laughter] [laughter]\n[noise]\n\nOn your\nReal\nWent on and on\nThat is due to\nFeed them\nStopped me dead and you don't\nGo there and go back to normal but the\nBottom and he loves to make a lot of people do\nDa da da da\n\nDa\nDa\nDa da\n\n\nYou\nThe\nWhen men still you know none of the uh\nAnd really if you're\n... a number of times\nThat we use ...\nMy knowledge that you don't have\n\n[noise]\nAnd then we had to learn a lot of\nPeople were the people who had um maybe they're running a\nBaby [noise] um\nYou're going to be running in the long run how\nWe're ... [noise]\nHow do you what you want to ... [noise]\nAre you do [noise]\nI ... I was nine years\nA\nSo ...\n...\nAnd the lady a ... so a\nOf a town\n[laughter]\n\n\n\n[noise]\nYou know to me ...\nI'm On my knees\n[noise]\nNo no\nNo\nO\n\nMe oh you know\nLong\nTo\nMaybe I Am too\n\n\n...\nWoke up the phone and found out that she does she says she's tired that I'm ... I'm not too hot and dry low and even though she didn't know that she getting so\nMuch to me that a man that and uh I used to man\nI Know that I have a family\nAnd you know you work in a way you know he's a man\nYeah no man the\nMountains the\nRichest man when you're in a in\nA ... do not\nKnow that they know the only thing that that child did not drink I Can't do it three or four you know the but they didn't know\nThe\nThere but the time and then what about the law they she ... the day\nThey came from\nNow\nOn your\n\nThe way that our parliament's\nReligion man when you\nHave\nOn me or\n\nNa na\nThan\nIt is not a clock you're listening to W. or G. F. M. an HD Madison for a\nYou know carrying their man no\nNo no no I\nMean [noise]\nMm Mm Mm Mm [laughter] [noise]\n[noise]\nAnd and and\n[noise] and\n[noise]\n\n[noise]\nAnd\nWay they did on the guest you\nOnly do di di di di di\nDi di\n\nDi di di di\n... and when you do get out\nKnow that um [noise]\nThey need to do the job\nAnd do the job\n[noise]\n[noise]\n[noise]\nThat they do do\nDo do\nIn them and then in the\nAnd ... and they want to come and get us man and\nInstall on again\nIn the bank and da da da da da da da da da da\nDa da da da da da\nDa da da da da da\nDa da da da\nDun the young\nThem and let them do the\nThink that that was dumb and da da da\nDa da da da da da da\nDa da da da da\nDa da da\nDa\n\nDa\nDa da da da da da da da\nDa da\nDa da\n\nTold me to the game and\nThe birds that have been man\nIt was your user friendly you know\nWell I don't\nKids and I\nI Know that my\nBrother when\nLet's go well no\n\n\nTo be I guess\nIt's not\nThing\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nThe tent resource center speech has been updated as part of the next step realizing the future of social justice mutual aid workshop or I may not be the maid W brings together community partners Dane County ... what's the new common good bookkeeping cooperative Wisconsin empathy guilt medicine nickel shop six so we are and more\nThe dean county timing birthday open now you see some new to him on Saturday ... at ...\n\nAm for that we were listening to the music of the average white man and a tune into work to do\nNo the eyes you did uh did that song probably they probably wrote it and uh but anyway that's a comes from a a greatest hits CD [noise] and then before that we heard the great Tyrone Davis I got carried away from his the CD entitled to be closer\nThan before that a Patrice Russian uh look up in a plastic star with love me down\nThe road that we heard too I'm more contemporary R B artist Anthony Hamilton singing Charlene a from a CD titled coming from where I'm from and then before that a deal got golden and who is Jill Scott words in some\nMixed up ought to get the one of my favorite singers Mr Michael Henderson Scott such a great range shyness voice this comes from a best of CD a\nThe nice composition also have gene ... the great Phyllis Hyman singing with him on a number of do what he was one in titled take me I'm yours [noise]\nTry and move around for a\nLong way to get\n\n[noise] [noise]\n\nNah\n\n\n\nA good\n\n\n\n\n\n\n\nNo\n[noise]\n[noise]\n\nYou know I'm\nCome\n\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nOh\nThat you don't want to be you know you\nDon't let it go to do that\nDon't let it go and do not know now that you\nCan't live without how do you really don't don't\nDon't\nNow that I've given you you should read a lot of ... ... each let's go to you\nDon't do that\n\n\nBut after ... ... ... [noise]\n[noise]\n\n\nNow that you do go through a lot to be that we're giving\nMe\nThe next to\nI don't go to bed\n[noise]\nThings don't go to you\nDon't let it go\nTo do that they don't want to go to\nThe team that I don't do it and we're\nGoing to\n\n\nBetter to do that with the book do you feel you know now\n\n[noise]\nThe big the\nLet it go to your head you\nFor one for one connecting you with the builders of safe and inclusive communities this is W O R T eighty nine point nine is them Madison\n\nW. or do you think the listener sponsors and if you live presenting to ... trucks bans on Monday November fifth an overture hole but by\n... says she ... trucks trucks made has grown to more than a dozen musicians garnering an ever increasing international audience what's their soul food blues rock more information is available overture dot org\n\nAnd before that we were at the musical shoveling more or\nLess ones with the liberty and before that we make the move before the ... the car don't want to your show up in a again Michael Jackson to pick me\nUp the music of right or wrong\n\n\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nNo\nNot say\n\nMan\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\nRide my\n[noise]\n\n\n\n\nWhen the\nJust\nThe village\nYou\nYour\nAbout it right\n\n\n\nOn\n\n\nHe and he made a\n\nTo show your\n\n\n\nNews oh about a month ago and I\nBut they're going to be [noise]\n[noise]\n\n\nW O R G eighty nine point nine yeah same Madison listeners but ... muti radio street you know routine\n\nI'm trying to make sure\nThat\nThey were both on the [noise]\n\nThat that the book the book [laughter] [noise]\n[noise] [noise]\n\n\n[noise]\n\nBut we're we're both\n\n[laughter] [noise]\n[noise]\n[noise]\n[noise] [laughter] [laughter]\n\n\nGood morning welcome to entertainment\nOn June ... will be with you for the next two hours linguistic jazz swing it a bit of blue serum listener sponsor community radio\nW O R G E eighty nine point nine FM in Madison, Wisconsin in a big thank you and to ... to ... to do so sessions to me thinking what Augustine you can catch soul sessions every Saturday morning here on a double your teeth from eating them to to name him\nGo watch the music for you today we'll hear recordings by Lionel Hampton woody Herman ... going back in time ... Smith in our number one of the program\nWe'll bring you we know music calendar in our number two we're going up to me was classic jazz and swing Janine thanks for tuning in ... kick it off with these recordings between while Hampton\n[noise] [noise] [noise] [noise] [noise]\n\n\nHe sees me she\n\nShe loses the the the\nHe he he ... he ... he ... he he he moved\n\n[noise]\n\n\nNa\n\nNa\nHey hey\n\n\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\nAnd\nOn Tuesday a silver sixteen there'll be already on the brink wow it's presented a lot of drug ... years with a ... D y [noise] eleven struck valid yours is the main thing still extremely [noise] think traditional music with modern player\nIn sensibility during an samples members in Detroit in New York and Chicago [noise] their sound that apple we'd be described as the whole time jazz if the right way to make the dance floor for all across the usa [noise] Madison zone mellowed out\nFrom the French my fingers her opened with a Hawaiian flaps and seals lie disarmament that will make you wonder why you haven't been\nTo one of their shows before that love ... years in ... D one\nDay a tourist sixteen Seventy and at the brink love\nBringing your music that won't let you stay in your seat the W. already eighty nine point nine of them and W. already at ... dot org [noise]\n\nSupport for this program is provided by Madison essential southern Wisconsin magazine one hundred percent dedicated to covering local businesses nonprofits and people making a difference in our local communities\nNow publishing six issues per year providing fresh local compelling content every other month at over two hundred convenient pickups spots\nOr online at Madison essential dot com\n\nBegan to do with music by Lionel Hampton Andy's orchestra from the L. P. Lionel please drums of bites in you know which certainly did all of those we started with a tune called tracking problem\nWe heard the low will buy a bird wind and lose for ... and then you know the angels sing ... vocal and then there are limits your state and ending with I knew that you know\nWhen all hippy ... from the opium the audio civility label little Hampton plays drums ...\nThank you for listening to entertainment to ... your host wake up to numerous classic jazz swing in some loop Syrian listener Spencer community radio W ... or ... eighty nine point nine yes and in Madison would continue to do with music by woody Herman in his orchestra\n\n[laughter]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nWell what do we both love to do that but that doesn't have the\n... what part of the robots to do this by the ...\nWill be one of the new\nAn eight hour any dollar and eat on not\nLow an eight hour day I said I'm not\nBy ... what part of the book by the by the by the deal but it would be one of the awful\n\n\n... and eight hours eight hours a day at our our\n... and it on\nBoth buddy buddy who goes by the by the by the by the way it will be awful\nAbout the about\nReal bumped do well by\n\n\nW. O. R. T. thinks it's listeners sponsors and we'll be street co-op offering hot deli food pre made sandwiches and sushi daily menus available at least St ... co op\nW. O. R. T. thinks it's listeners sponsors and the wind and hop shop Madison's local source for home brew in wine making supplies\nThe wine and hop shop is open seven days a week in Nineteen Nineteen Monroe street and has an east I pick up the patient for online orders at working draft beer company located at eleven twenty nine east ... street more information available at wine in half dot com\n\nYeah we heard Herman or second sick today starting with a number title that's right\nWell I mean that lemon drops and Ralph Burns composition early on him only met something they Shorty Rogers keeper the flame than more moon again or Rogers composition as well as the last one lollipop\nFrom the lp capital jazz classics volume number nine woody Herman ... orchestra or we bought him those recordings all meet back in the Nineteen forties thank you very much for listening to entertainment today I Am Jon Corzine actor hosts going up to new with classic jazz swing\nAnd occasional blue sea around lister sponsored community radio W. O. R. T. you had a quick reminder of the other programs coming to any great music programs it new tropical rhythms with that for the\nAt two o'clock in Africa\nFour o'clock ... who to Latin music\nAt six o'clock rock and John Macdonald and I like it like that with a lease rock in it eight o'clock to for the blues all hit here on lister Spencer community radio W O hearts he will go back in time now to a recording made by trumpeter ... Smith\nAnd his rhythm he says\n\n\n\n[laughter]\n\nDon't know about what about Bob and Bob my mom and I know nothing\nBop bop bop bop bop\nBop bop bop bop bop bop\nBop bop bop bop bop bop\nAnd\n\n\n[noise] [noise]\n\n[noise]\n\n\nWell\nSome food\nFood food is\n\n\n\n\nNot probably not I mean I Love\nThe\nBall you know some of that that's what I was well\n\nIt's not over\nAnd over and all those\nDa da da da da da da da da\n\nDa da da\n\nDa da da\n\nBig bang bang bang bang\nYou know\n[noise]\n\n\n\nI\n\nSome movement in their\nThey and\nMade it\nThe day today and then they\n\n[noise] [laughter]\nI got\nFrom time to confess that\nYou just missed the boat to handle\nIt any less ... John like I\nGo to the ...\n\n\n\n[noise]\nI Know that he didn't even know that I'll go wherever you go to a huge eating well gee I Wish she knew how much I loved to fall in line and\nThis is talk to him and his message I Am will soon be he just five times in in the style I mean come on the type that much\nMore it'll kissing not lie\n\n... teams [noise]\n[noise]\n\n[noise]\n\n[noise]\n[laughter] why you\nKnew that you know that I'll go over there you go to a huge a little more than ... junior high when she knew how much how long do you live in my opinion this time is brain remind time will soon be good for my son is not I vote for him to type\nWith little kids say not to lie\nDid they did\n\nI ... that's ... ... blame it on my ...\nBlame it on my union\n[noise]\nIf five small guy to eat\nAnd sleep and gravy [noise]\nBlaming it on my you know [noise]\nIf I Try to later on\nWhen first die like the\nTrue [noise]\nDon't blame him pushing on my heart to\nBlame it on my [noise]\n\n\n\n\n\n\nIf you were on my ... all night and day he's\nGoing to blame it on my ... [noise]\nFive ... guide to eat\nAnd sleep and gravy\nBlame it on my you know [noise]\nIf five or ... or so\nWhen I first started let her in the\nTrue you\nDon't blame it on my heart just blame it on my hands you\nKnow [noise]\nOh [noise]\n\n[noise] [noise] [noise] [noise]\nWhen I grow up\nTo go in to dream been voted\nOut or have we\nBeen to three members ... do\nIn the means to be when I grow up to all the new shoe dream you're levine will lay ... then you can learn how to be the only thing they\nDo so with the new\nKids think they need because the environment is sweet and she [noise] any time in\n... where you live\n[noise] and I know when I\nGrow mix to well get paid to dream big huge land of the wind blades ... is the ... and ...\nAnd [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\nDanny de da da da da da da\nDa\nDa da da\nDa da\nDa da\nDa da du\nHis his thing maybe my sweet and the\nThing and ...\n... new new letters palm for it in the days leading\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\nNo no\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise] oh I'm going to burn a custom cars in the middle\nOf the\nDay\nYou\n\nHow to\nBeen a long time now I don't know\nThat\nIt\n\nIs\nThey needed [noise]\n[noise]\n\n[noise]\n\n\n\n[noise] oh hold on a on a I'm a [noise] a lot of uh [noise]\nNa na\n\n...\n[noise]\nYeah the great Illinois you get a chance to intersects there\nThe to the Puerto Rico from\nAn album titled bottom so that came out on the prestige label bunch of years ago\nThank you for listening to entertain mentioning I'm Jon Corzine at your host I'll be back next Saturday was more classic jazz wing\nThen some blues zero listener sponsor community radio W O R G eighty nine point nine of them in Madison, Wisconsin keep that dial tuned eighty nine Ninety throughout the day lots of great music programs ahead including tropical rhythms coming up right after this announcement\n[laughter]\nTwenty eight teams W. or to record write it on Saturday October thirteenth from one to four pie in the art in fourteen forty four east Washington avenue [noise] come down and check out our selection of rock folk jazz and miscellaneous records at rock bottom prices [noise]\nOther vinyl vendors will also be on his selling their wares while W artsy DJ spin their best fighters throughout the afternoon [noise] the W ... record right as one of the biggest all vinyl events in southern Wisconsin on the proceeds from our sales\nWere benefits the station that's the twenty Eighteen W. or to record right Saturday it's October thirteenth wonderful the end of the art in fourteen forty four east Washington evidence [noise] spinning you right\nAround for over forty years this is W. or to the United states I Know some Madison and W. or she is ... [noise]\n\n\n[noise] W. R. T. six piano local news is seeking new producers for we featured\nMaybe you love books or beer or food once reviews them for us how about pro finally local artists have a lot of science [noise] want to share your knowledge with W O R T listeners joined more than three dozen community members who work on our local news program\nThat came up with our recording studios professional Michael\nFelons and audio editing software you produce a weekly five minute segment for broadcast and thought that\nIf you have a fresh idea and a few hours each week to commit get in touch contact news director Molly stunts that there'll be or to you by email she's up Molly that W or to a friend [noise]\n\n[noise]\nJeffrey Brady and you'd vicious present far all fall on Thursday October twenty seven thirty PM at the gates of heaven\nComposer Jeffrey greedy and yet ... percent an evening of exploring world music sources improvisational based composition\nThe coffee place tribute to protest considered the first important Jesse Kelly medicine locally grown slightly more ensemble yet vicious but bring a program of extended compositions by Brady into improvisation by members music for Egypt stands are gone out and the America as far out full with Jeffrey ... and you had vicious\nThursday October twenty fifth seven thirty PM at the gates of heaven and James Madison park on the shores of lake Minnesota this is W O R T eighty nine point on FM W. O. R. T. F. M. dot org listener sponsored community radio\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\nGreetings greetings and welcome to tropical rhythms will step rpm for the next hour in fifty six minutes [noise]\nReggae music reggae music here on your list are sponsored volunteer powered community radio station W O R G A nine point nine FM in Madison broadcasting throughout south central Wisconsin and along the cheddar courting\n\nStreaming internationally on our website W. O. R. T. FM dot O. R. G.\n[noise] there you'll find an archive of tropical\nStorm shows two of them to four hour shows where you're listening pleasure throughout the week brought you buy the tropical rhythms family thank you so much to everyone who's contributed during our last pledge drive and especially the reggae fans who contributed a during the show\n\nWas a special thanks to the man Tyler will assisted in a jam who is with me we can week out here on the W ...\nG helping produced this show and today a another contribution from the tea and we'll be talking with a T a little bit\nGot pretty excited about the [noise]\nLiberal Thompson earth strong [noise]\nTribute that we want to do today we've got [noise] 'course we play some new music and some [noise]\nRequest but generally do also want to pay a tribute to the great producer and singer liberal Thompson\nBut in the meantime it's a top of ought to today's whether it's forty four degrees currently it's mostly cloudy here in Madison area humidity sitting at sixty five percent and it's because our viewpoint is it thirty three degrees when is out of the south at twelve miles per hour [noise]\nGiven us a wind chill of thirty eight degrees are expecting it to continue to be mostly cloudy today was a high here forty nine that solves when will continue to about ten to Fifteen miles for our children a little bit about five to ten tonight\nUh later on tonight with there is a slight chance to twenty percent chance of showers but um after our time and so looking at the overall I'm forty two thirty percent chance of showers tomorrow early looking at a higher forty seven\nWhen will change from the south west northwest said about five to ten miles per hour [noise]\nAnd we have a forty percent chance of showers or tomorrow night looking at a low of thirty three and then it looks like Monday through friday we'll be sunny entirely sunny week and we're looking at high as a mid forties maybe fifty on Tuesday\nI'm again mid forties on Wednesday reaching the upper fifties by Thursday and friday and looking at Lowes uh let's see the lowest level view is thirty two degrees\nOn Monday Night and then uh looking at a\nLooks like a mid thirties throughout the week do indeed us a sunny sunny day coming our way kick your legs off a contribution or from a ... T who brought in a\nAn album from a group that goes by the name of mystic eyes and also known as mystic I comprised of lead vocals vocalist\nLes Clark a valve in ... and Anthony Johnson probably the most famous member um it started out with this when I'm ... and we go to yeah there it is\nOn the burning sounds record label [noise] grief shoot in two thousand two tea and it is a little time [noise] production [noise] looking tell me work on it [noise]\nFrom the Nineteen seventies midnight gene eighties the name liberal Thompson in the Thompson sounds monitor\nHas serious currency in the world of Jamaican reading [noise]\nAn addition to his reputation as a vocalist on over a dozen albums Thompson was the producer of over forty albums\nAnd hundreds distinguished by artist secluded\nDennis Brown reading McGregor various and leave\nThem out Gregory eyes the wailing so [noise]\nJust in Tacoma [noise] porno Campbell [noise]\nJohnny out [noise]\nDevices Roy [noise] sugar mind [noise]\nAn examination of his work makes the case that Jonathan's contribution to ...\nGay was essential\nDuring the music golden arrow simple Thompson the sugar mine I can\nBe credited as the first reggae singer is exercise significant control was producers have their own worst [noise]\nPreviously the perilous route to become an Iraqi producer in Jamaica was only traverse the by shrewd\nBusinessman sound system operators and a handful of sound system the journalists Steve ... full wife describe ... Thompson has quote an artist\nLauded by [noise] knowledgeable reggae files is practically unknown by the rest [laughter] as a singer [noise] Thompson is not as well known and some of the artist the retail world wide success with it felt like Freddie McGregor eat them out\nIn the engineers scientists Thompson's is relatively low profile is due to two factors at the height of his singing career choices when it's time reducing instead of touring that's me missing an essential avenues to name recognition moreover\nWhile profile deals with major labels [noise] only one of Tom from album line Robin ... started like managed to find major Libya distribution that was three mango\nPiling in Nineteen eighty eight however\nCompton did have a thriving business this devilish independent labels in his own imprint [noise] coming up next the voice of Linda\nThompson happier as strong [noise] [noise]\n\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\nWell you know that day and age [noise] I was wrong\nAnd you know at least ... and it keeps the not the ... and they learned it being a genuine\nIraq gaining new and it may not be allowed to swing or in the white man who loved her book Mary the logic of God you may be a good book while on a\nGame and now I Do you manage stage of the\n\nI Love me too much higher than excel or when I drove by smoke gaming and I ended up by nine or ... or ... the not the janitor and John ... in the ...\nNew book in the ... and ... and ... you\nOr a\n\nBig job why\nDo you make at night and they now or I bowled while they're in the in the study of age\nThey met in ... John Boehner's ... being married to Rob Gifford in ... the anti relax we are in the white men\nLaw married or not the latter came up on the bay area\nOr do I know the ... or ... or\n...\nOr ... or ... or ... or ... or ...\nLove the girls are older or I read a book\nI Love me two hours channel or white planning a\nBlack man of God and man it may not be in the last ... the the ...\nNeed and I like the lunar it's\n\nBeen\nCreator died on June\nDay I got a janitor and I\nWant to live\nMean he's dying and then we got another when the law and order and I write dating these I mean you brought up driving around on it will be no way and do it on the news\nYou know try to I mean are wearing a little bit and through the darn though when we're\nIn the fall and they really like maybe if they win back in ... shape to do that today that Adam and Jamie in\nNot that tray everything's been through that that they're not out of the jury room this anti trade and injuries that they lose touch it started out as a dream you know and then they want you going to do it that\nTo them and then they want to run out and then they\n\nThe dude [laughter]\nThey could do that\nAnd once you got a two way we're ...\nThese are doing and to bring in where he was on a ... hour a day to anything by asking you to go and try to run around the leading the way you\nDo do\nGo and I try to live on the way they know where you go by\nThe end to find out a new law\nIn in to get the drug we use in the fall and they do not you're\nNot they're not they're not you're not out and drink and they know\nIn and they do not\nTo each other and not out in the ... not ... not not out of it and you know\nEyes and you\nWill never ever\nThe ...\n\nIsraeli journals that ...\nThat Bush has to sit in there\nAnd do what what are you gonna do it in the eye when we got our own language is\nLegal terms and we've gone to ... they came they judge ... Nineteen Seventy nine the roots radical back you know\nThe voice of Lindsey ... homes in life and originally record in Nineteen Seventy four and a ... as John redder than read to type ... first down in tropical rhythm version\nIn ... version of the song as it was originally recorded [laughter]\nYou know the other night and I didn't know about Jay Jay direct um and and\nTaken from an album that in this series entitled you know the yard record it in a way we say\nTwo thousand three [noise] two thousand five\nAnd you know each you said hey I Can't find that any more well reason being that my son went out of business do their their catalog is out\nAt any rate to you can find it you know I in in the yard great acoustical treatments there resenting the song is the way they were created great voice of liberal Thompson doing\nHit them with the one drop\nAnd I'm very familiar rhythm for those of you reggae fans are wondering what was that well I think it was originally written by the man BBC and into any child joined the\nMorning and playing a little bit of that from the king Jimmy along with a chronic [noise] from the new album will get to that and a little\nBit but I tend to be done with this a little should be [noise] to learn to liberal Thompson [noise] great voiced by him up before that we heard judge rather than dread again from the [noise]\nYou know the yard series [noise]\nFor the whole uh [noise] giving label in the yard with it it was supported by mark a sound that they may pay a and so you in the\nFrench a record label and in the ... the art presents the songs the way they were created in the yards and backyards Jamaica [noise]\nCourse of the lead voice when it gets harder times company and by being around her background vocals debated on the five [noise] definitely it was a back to the roots of reggae music as it was when it rose from the ah [noise] also look for in this series if you'd\nFind it out there a real ... Smith denied you're in a great when I can as a kid is I of course the Congo's a great one Congo and it'd be gardening\n[noise]\nOn this uh last uh acoustic bet you heard um Jeremiah also joined in on a guitar with percussion by spot so Craig ... I was there with Russian jai you\nDerek Heinz on horn and keyboard to fly Lloyd home or in a cush McAnuff an awesome so Craig contributed to drum where Mr special dig up to liberal Thompson roaches mission\nSide [noise] continuing on with the great voice of liberal Thompson as we mentioned earlier in the show we did a tremendous production work will begin\nSome of that in a bit but we will continue on with the the voice of liberal tops and this one is titled dreadlocks no run record in Nineteen eighty on his own\nThompson zone record label room at seven in the ... dreadlocks no wrong [noise]\nGod then [laughter] [noise] that's what my job [noise]\nBut\nI'm not going to leave them are grown louder ... to ... go home and then go\nAnd buy their cash you know\nThey should not be judged ... get dropped by ... by\n... ... ... [noise] gets on my job I got\n... ... you'll get jobs ...\nThey gave me a new format ... [noise] they can do them I said then we'll get diabetes and and [noise] we di di di di di di di ... June\n... um [noise] a lot of them are going to read a lot of ...\n... ... ...\n... Steiner [laughter]\n[laughter] do you get not they're not [noise] get struck by Dr drop by ya [laughter] [noise] they're not they're not get\nJobs in their mouth ...\nHave\nA good job right out and buy me a lot of your mom gets on my young [noise] we've da da da da da\nUh uh [noise] we end up getting a job that I Know when they're raw data red shot\nIn the last ...\nSenator died while you're right it was a little something done about it [laughter]\n[noise] boy Seventy five and I knew that it is [noise] way than the da da da da da da da da da\n\nDa da da da\nDa da da da da da da da da da da da da da da da and the men\nDo in China and India\n[noise] budget and they'll come on [laughter] [noise] I've been there before I sign and [noise] and do what he was just [noise]\nAnd then the next day [noise] the rather than be used to do well with the young one a bit too close to dying in the mind\nAnd I think so [laughter]\nUm I\nKnow that this new ... items and [noise] you\nDon't want to be on your blog though and read\nThe book and so on and [noise] you know by ... been in a book called the ...\nMhm [noise] oh yeah [noise] um [noise]\nDo you do to help like was it worth yo\n\nYo ... below and [noise] you can go as long as you know may [noise]\nScientists sees you\nKnow my sons are some uh [noise] I [noise] I tell you [noise] [noise] [noise]\nWe really don't want to see the bottom of\nThe [noise] the\nReally the only one mostly in\n[noise] ... ah [noise] the ... from those on the whole family she should be some um\n[noise] we live so long nomination ... has seen his dying let's see if that has so much for that so much the same yeah I've been in a um [noise]\nTimes in a as a nation to\nAh\n[noise]\n\nBoy you're way\n[noise] the guys in the day after day\nYou're gone there may have undergone di di\nDi da da da da da da da\nDa di di di di di di di di di di di di di di di di di da\nIs she in pain but I'll read the Bible as it is John ... died in ... [noise] I really don't know [noise]\n... says no food that we can talk a lot of letting them get to do that but you know that they can do that without a doubt [noise] get very generous in an hour an hour to get no [noise]\n\nNo I\nGuess that that it did not get to the middle of the business [noise] they\nGet in my judgment you might add to that and get my ... died and my right does it fly right [noise] I live by the way it\nGoes around and then when they put out the animals really young you know spend the night\nYou know by now on [noise] you know we large most of the law that you can get no money no I'm not going to be judged on business and that'll get ... get it and they're not going to be a guarantee that not because\nGoing to the food that you know do you have to but she says not to do to get good luck to you know do you get to know about the new guy\nDo they do anything to do that they're brought it down to ... to ... get tired\nOf them the ... that can do that or no they can do their little\n... to ... to ... ... ... ... ... ... ... ... did not everything down\nSince the ... [noise]\n[laughter]\nWell no no no\nVery\nYoung men and yet they still don't may not jazz or do you do when they do that then the\nPatterns out cash so that that oh the ban was just\nYou know to my mind I guess\nLead them in the town\nI Know my\nYoung man shot in\nThe job\nAnd that these are people who do\nLive in the ...\n... who could be punished for some\nGuy who does not do\nWho knew people\nBe with your mom and pop jazz though who who\nWho and who\nBeing ... and ... they're not that big a them by young\nTo be bad\nThe adults\nGave no mine and my head down\nYour job you know be able to get a job he made a big thing\nGo ahead and do not have been saying we don't\nGet I get out at ... dot dot dot du da da\n\nDa\nIt'll be the last day of\nThe stuff funny when it among me oh I\nThink that's\nWhat he does believe moderate [laughter] your mom or\n\nThat way you know that\nI Would probably be man and not\nOnly that we felt money for that kind of funny [noise] then you get to and from my rent it out on the ground you only get to whether or not and\nThen it was all about those things and and my mom for a little shopping [noise] and we got to work\nAnd we have to work with cheap\n[noise] do they make up the wages I Am a\nWoman on the\nThing that I\n\n\nWhere that money when they went on my way to see them\nThey they they they\nThey I don't know no no actually I didn't know about them socially mailed out the fire grew around\nThat you can imagine that the less they hold on\nMainland to make lots of big bang bang bang\nBang bang bang\n\n\nNo no no no I got a I've got the weather at odds in the day and they\n[noise] they\nThink that [noise]\nThat there\nThree in a row from Barry ...\nAnd the Thompson son record label record in Nineteen Seventy nine Nineteen eighty to just release well for us just released two thousand\nFourteen and milk labor [noise]\nAll those songs arranged it produced by ... Thompson [noise]\nRecording that channel one mix by at king TBI by scientists and backed by the ... and under my voice\n[noise] ... [noise] ...\nAnd a twelve inch from the W. O. R. G. library [noise]\nUnlikely labor to figure out what your this\n[noise] [noise] [noise]\nBourbon in [noise]\nIn freebies\nThink there'd\nGot people though don't you think you probably are not allowed\nGames make added terms and let us know\nInducted\nInto and the\nThey didn't\nThink we\nLearn from the\nBeep beep beep beep in God\nWe can be changed\nGuy leading by\nNow and then the ...\n\nAnd in my day and they just\nThe real being able to do that in\nIndeed died speed by all the way in\nMy early but\nGiving blood drive through you\n\n\nShe and ... and\nHuman they didn't do you do you love the new law will work for a number and I love news in the mid ... [noise] from the birds and never\n... late ...\nMe the ball ... and do you\nLive it really does he do you have a new law\nTo provide for them to do with a guy that we do do you regard la\nLa la ... and ... when\nLoving do you do your bills and ... ... a lot about\nThe\nJob on the other hand you when you don't do better than\nShe read any way to use the ...\nThe chicken and make more money than the key Lauren loved him leaving ... people discriminate gaining independence day during the during the ... and you know why\nI mean they do make a big issue\n[noise] [noise] oh\nNo [noise]\n\n\nReligion [noise] Trojan Records the [noise] accomplishing the songs from\nThe album [noise] liberal Thompson runs Rutgers from channel one heard the love is the question\nAnd stop loving it varies dubs when the roots radicals as well it momentarily will move on to an album a compilation of songs from liberal Thompson\nFrom the great a blood and fire record label this on a compilation of songs from Nineteen Seventy five Nineteen Seventy seven ... Thompson right on dreadlocks but we got to\nRemind you that a W or to you needs a bookkeeper and a scene um need to remind you of um oh little message from her church so let's\nTake care of that and then when we return a little more liberal Thompson from the album right on dreadlocks letting fire label\n[noise]\nWe're in a moment of all hands on deck emergency for democracy historian Nancy McLean she intended to write a story about public education I ended up on a research trail that led me to Charles Koch her book democracy in chains follow the trail from brown versus board of education to Chile too right here in\nWisconsin what did she discovered dangerous ideas\nRight are there is a values are being challenged you find out more on Sunday October fourteen\nTo add a lemon am I W\nOh we're in information and then we really need to make our democracy work again for people to Sunday and Monday and Tuesday\nWhen women gimmick [noise]\n\nMm Mm W. or tea currently has an opening for a part time book keeping the bookkeepers responsible for ... implementing and maintaining financial records and W. or to financial policies using the cruel accounting methods within GAAP\nIn a timely an accurate manner [noise] retired accountants those seeking to return to the field\nPart time and those in the field seeking additional income flexible hours would make ideal candidate contract services need on the fly position description is located at W. or do you have some dot org under the words happening structured to applaud San resume cover letter and three professional references to Dan Lipinski by email that's D. L. I. P. P. I. T. T. at\n... dot org application deadline is Monday October Fifteen at five PM\nBack porch radio broadcasting is an ... affirmative action employer persons of color veterans women in persons with disabilities are strongly encourage do applaud\n\nContinuing on with or liberal Thompson shouldn't desserts strong which was yesterday\nWow wow a little version here la la la la la la cut off your dreadlocks runs da\nDa da da\nDa da da da da da de ... [noise] I'm not that you ...\nI'm driving lie low training [noise] dot dot dot dot dot\nThe last few\nYears down the law should\nGo go go la la la la la\n\nLa la la la la la ... miles per plane that that last night and day the men do\nLet me ask you some things that a lot in my life Charles Manson Donald da da da da da\nDa da da du some rather than they should go go\nWhoa a loud bang and da da da da da da da\nAble to catch the bombing ding ding dong ding ding ding ding ding on on the job I Know\nIs that they're not that\nWe should be teaching Bora Bora she she she she ... she is she or he or\nShe did she come from Russia and Georgia which seems to be on the books over and over eating and going on in\nBeijing and then you end\nUp in the ... you should teach teach he didn't he\nDidn't know\nSecond version with that's been written by now the address again anyway that at that time and\nBoth times when the Berlin briar record label loving track many of the things that the drug shortages\nSong on here might be five and a half minutes longer to be seven minutes and you just heard twelve tribes of Israel by seven minutes and all the other one is continuing on with our tribute to live with Thompson's are\nYesterday on the anniversary release a new look how many will continuing on with a another production of his own artist\nThe\n... my name is more than I Am now going on in our new to many yeah in the\nBeginning and the bottom God at all by God and da da da\nDa da da da da da\nDa da da da de ... by and I'll never did any border letting them know man I saw that and they get it all back to the dog\nBut uh I make a moderate bought out to me is that the debt and the man I'm a big endorsement by a dog and I haven't done the mayor of I'm going to be done\nAbout four and a dry and da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nAnd I read that oh you know [noise] she said on me about gay men on the bed [noise] and you may not be headed out by a name Iran God only\nWhen I hear a beep firing line out well for the\nRed line up up there are a da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa dum la ... and blah blah blah blah blah\nBlah blah blah blah blah blah you know\nThe ... billion dollar already bought it all do they are and all the way I\nDon't know about you know and my mom the\nBigger the object may may do da da da da da da da da da da da da\nDa da da da da du da da da da da da da da da da da da da da da di di di di di di di di di\nDi enjoy law here in ... drugs not letting the Goldman Saddam Iraq I don't know why they got to do about it on on or not we are about being all about it and\nGet a job going to be about the owners um\nYeah\nThey do not I do I\nAbout a dollar a bomb on my way or being by ball and how many I bought it all you know maybe I\nDo not\nNeed to be [noise]\nBut I'm going on and on on that all the way I got a dollar a\nDay\nOr is it about their bottom line I mean they don't have all the time I get on the job market right [noise] I I jog you know all day long die on an island did\nYou know I did a da da da da da da da\nDa da di di di\nDi di ... was the opposite where you know they're not in the theater and I just saw it on their image I thought you did oh do you\nMay know bought any di di di there may be a job to do it on and the bottom thought or lazy we've gone down there\nA while you do get to re you melt adult talking about what's going on about God and not be Jack and da da da da da da da da\nDa da da da da da da\nDa da da da da da da da da da da\nDa da da da da du ... bringing it in the lion from the Bible all the time we read on the fantasy memory record label releases to do before\nBy Lyndon Johnson and he'd say around what Eric ... Seventy nine to Seventeen I Wonder why go fly a lot of those false positives route [noise] plenty roots yeah uh-huh as opposed to read the roots are\nThere are some of the liner notes I'm sort of ... pro war off I'm left behind in the studio\nAnd then later found him a liberal Thompson just if he doesn't remember working with them which is all very odd because he sure my astronaut that Thompson clown or\nIndeed so this when a re issued in two thousand fourteen from the last case or the album again read bunny lying\nOn the fantasy memory record label thanks for bringing that and that's definitely not in my collection but not to do a little more research about this is a kind of funny this one on me I think you for bringing it in a ... to have it under my voice I'm On the adrenalin dread rid of them are soon entitled mountains Diane\n\nStudy on those are great to vintage a photo in their of them are in Brooklyn hanging out in New York by the way it liberal Thompson spent quite a bit of time in the United states he started out as soon as he used to Jamaica moved to the United states uh went back to um after he got a re energized and ready to music and\n[noise] she's really on Google's um [noise]\nSome of the list went out to everyone who saw Freddie McGregor at the Oscar Meyer theater back in the day [noise] big ship Freddie McGregor even named is a record label after big ship during liberal Thompson production from Nineteen eighty two\nAppeared on Thompson sound label and also on the green sleeves record label a twelve inch from friday McGregor produced by\nLinda Thompson going up at the two o'clock hour central standard time is just a couple of minutes away from those of you outside of our time zone pen Africa coming your way before this we heard from parents and levy sense to me or another level Thompson production taken from\nVarious artists compilation Linda Thompson presents can't stop us now released on the easy star record label two thousand five\nComing out of the set of bunny bunny lion and Linda Thompson songs [noise]\nHuge huge library and just scratched the surface of this limbo Thompson record libraries shut out to our own record library for maintaining reggae records\nFor us to play and thanks to the tropical rooms family and big shut off from\nThe man so Neal and also from them C O D rivers wrote letters today was for the mount here a\nLot of horrible him group thank you for your letters in the beginning\nYour requests and got a song from\nTony brown that I received in the mail they don't want to share with you next week entitled vote and a ... at that point or I'll be able to share your your thoughts about or\nWho the tropical rhythms family should vote for you know like the endorsement of some artist we'll talk about that in the future but in the meantime\nWe thank you eat chief are bringing in a that great bunny lion\nOr the berries brown\nThe mystic eyes you know all stuffed up I was ... well what a place and very brown but does Mr guys I don't have and and also that bunny lion so thank you so much for bringing that in\nYour all her welcoming work you all for ... and ... to ...\nIndeed and if you uh enjoy today show you can listen to it again it's a it's archive for two weeks on our website W. R. T. F. M. dot ORG until next week peace love and respects\n\n[noise] [noise] [noise] [noise]\n\n\nAll right we're going to face Jon tropical rhythms and all the great shows thank you for our pie this is just bits heroes major host\nOf Patt Africa until the four o'clock hour air on W. R. to nine point nine and ... and Madison a listener and also fellow programmer erode W ... to ... uh\nTold me you're going to Senegal and Cape Verde with his partner this winter wants to know what kind of music is you're looking too so that's what we're going to do today we're going to feature the music of Senegal and keep their looks\nYou're not going to go with them all\nI Am a lie if I'm\nBoy am done tomato I find on\nIt in ... and they gave\n\nYou know\n... ... we need to be you\nKnow a ... ...\n\n\n... by San nine or you know\nSomebody game\n\n... member to run a liberal\nWho don't put down the line from\nCleveland\nAnd my little\n[noise]\nHe knew I'm going to go for most female singer here on Africa there'll be ...\nYou know what's going on so many ... job that's run into the glass or the name of the song would talk to the bar for the call raises a that's a she says it's dedicated to journalists musicians spreading around the world\nCould not which is a\nWar that we used to endure the total cost from I bring whatever love which is actually a music from the movie\nI bring what I Love I have not seen that movie but the CBS me curious ought to look for it\nAnd we open up and they said uh and the show which we're featuring the music of Senegal and keeps ... uh with Bob among also from Senegal so all three of those musicians or from Senegal\nGreat musicians from Senegal a the tune the FAA they find on off who's missing you a CD from two thousand and one way to keep playing music from Senegal at least in this next sets at some point will shipped over to ... keep their um [noise]\nWant to remind you that you can feel free to give me a call it's six to eight to five six two thousand one if you have any requests for music of Senegal or keep their ... to try to get that in today\nOr if you just have a comment about the music or the show our question a and don't forget you can if you're out of radio range you can as a regret sixty six people even right now streaming line twenty four seven here at W. R. T. at them for the next ... ...\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\nOoh you know what I see no nothing you\nCan go to John Dean guy you know\nThat the main topic\nInto the I mean you didn't\nKnow that they do little to do\nWhat they want um\nI mean I'm getting up but they need to go up a little button and dropping\nThe hair and my\n\n\nDi di di di you didn't do it but I'm not a lot do you do the son of\nGirlfriend Johnny\nAnd be\nTo get down\nTo\nIn the ... when they go into the general differently\nNow you may not been you know little about the\nGood guys and the general boots on on that\nIt ... it ... most of\nThen again\nThe next generation when they when they do that\nWould you feel that John\n[noise]\n\nLearn to your mind and I read a\nWhat I've been a\nThey\nIn the game I mean\n\nAnd games\n[laughter]\n\nAnd thereby\nDo and then when we went\nMy daughter and I knew what\n[noise] [noise] [noise]\n[noise] well you know not only day\nMan but you don't ah doing them\nTo do when you do not do the day by day during ... na\nYou do do you do the moms yeah yeah but\nAh no my dad got yeah I mean a body I mean I'm\nIn the middle [noise]\nA lot and I go to the ball or do anything to do like a ball\nGame when ... al ... or\nDo you mean\nBy yeah guy yeah I mean I'm Glad\nOh\n[noise] [noise] [noise]\n[noise] [noise] [noise] ...\nNa na na na na na na na\nNa\nNa na I'm young American indian or\n[noise] [noise] [noise] [noise] you\nKnow get down to the bottom of my body at all in this day and they began by by by them but\n[noise] [noise] [noise] [noise] no\nMom was um\nWhat annoys viral animal\nThe mom bilateral non\nWhat are the only in the in the you know what I Know\nHim by the end up like a\nThing [noise] you know\nWhen you're not doing any day but they are not doing\nAnd ... ... do you think you know when you do not doing the na\nNa na ... beans and ... around the moon\nBy ... by the on a\nNew beginning in ... in the new one and a\nGuy yeah the mom's body I made a\nMovie do you do need to be in the game and you do do you\nFind out that I Am a mom lived yeah I'm a mom or\n[noise] ... [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\nBut you know not only man by looking and when you do not need and [noise] you know not during the day but we do not all\nThe time ... able to be a little bit\nBy a guy yeah I mean I'm Glad you have a\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise]\nAnd\nMy ... my level I Am\nPulled out and let 'em\nLady get time money hungry\nWhite the money I mean by you ... your ...\nYou so much you get in my county Miami highly or read\nBan the guy knew there were there and\nThey may be\nGoing on you\nKnow the lady on the boy you know I'm\n... daughter in Elena ... junior law\nThe matriarch on your or my ...\nMy life but I knew how\nGoing out on my man you\nAnd what not but he I made the idea of what I've done\nMy ...\nMy God I'm\nRely enough for you\nBy the\nThe way the Monday me\nNo no there are none of them are known\n\nYou are listening to the and Africa radio show on W. R. T. eighty nine point nine at that many ... in\nThe you know I really don't when they want to know\nHe can be needing game and you know bad game on Monday the mean many of them do and when the ... the lead plaintiff plant them and they did not\nLead but may need them to bed Len Len Len\nAnd the la la la la land and then and then let it let a lot of people in the\nIn the middle of the Sunni guy\nWill you my number one little di di di di di boom guy he was\nYoung among settlers and he'll be named William ... with him winning local what they're going to money a lot do\nHighly ... when my children\nAmy mathematics but you\nBe engaged\nLa la la la la la la la la la la la la la la la la land\n\nTo\n\nWorld\nI'm not doing\nMuch emailed me a little mean\nDa da da\nDa da da da\nDa da da da na na na na na na na ve by me happened to my main thing that\nI mean my ... and a\nNation you know\nI Love\nDon't they just\nNot\nBuild bunkers that\nWould make\nThe money you\nKnow my mail me on\nA lineman lead\n\n\n\nHe's got ... new book that he did believe in ... when he goes in the ... and then go to the beach Betty Mays did do the\nResearch gone that the the the news they made that decision\nYou got the going thing\nMove is beginning to show\nRookie no yeah but that'd be ...\nProgram of hate groups that saying\nBus to make money\nMay seem to be a\nLong time as the\n\nThe ...\nNot because I Know that no no no choice and a\nNice guy putting butter let me go to not that\nThey\nTake that time\nBut I'd like to stand on\nThat on there and just give me no no no\nMy ...\nFive dollar Rashid that\nMight be going down and those who has a\nBus map you're not allowed to\nSmoke\nThey didn't know\nMuch they\nKnow their\nBut they do not understand that your mother\nJust give me a million I Know\nMy mom died when they're buying you live\nA lot to me that the more\n\nYou give me\n... me that they they blow them on the\n... da da da da da\nDa da\nDa\nDa da da da da da da da\nAnd then but I mean the ... do they go\nTo me about the they wanted to go but I mean they stopped or they go to Rachel Ward was the the ... the\n... range you guys doing today well do\nYou do that in their ... their name you go into your lungs and ... minutes before my marriage\nIn the beginning you know the ... ... you know when he did he do\nDa da da\nDa da da da da da da da de la\n... over the place much government but I mean when somebody or they go to Beijing will blow your mind is going to be one thing but I mean\nDo they go to me it was all\nAbout the leverage normal but the ... ... ...\n...\n\n... ...\nBut I gave Bob and I can\nAre a lot\nHey them that if they\nThen not even\n[noise] [noise]\nWe're in a moment of all hands on deck emergency for democracy historian Nancy McLean she intended to write a story about public education\nI ended up on a research trail that led me to Charles Koch\nHer book democracy chains follows the trail from brown versus board of education to Chile too right here in Wisconsin what did she discovered dangerous ideas and never had the right\nAre there is a values are being challenged find out more on Sunday\nToby fortunes and eleven am I going to be on our information about we\nNeed to make our democracy work again\nTo send me kind of lemony and\nWhen we see the chemical [noise]\n\n\nSorry about that got started on Sunday ... saving for the next ah [laughter] it's bad press in my Mike but anyway this is Jeff spits Resnick W RTD nine point nine of them an HD or host on the Penn Africa radio show until four o'clock hour [noise]\nOr we started off the show featuring music from Senegal and then the second our future music from Cape there\nAnd let me tell you what we listen to the last song was from ... ... ... uh the song she got dean your money in ya off her\nCD votes voice and then she was beautiful voice and before that we heard perhaps at least in this country the most famous Cape Verde and senior semi passed away get to see her I think a couple of times ...\nBeige a robot off her a two thousand three release both the more voice of love\nAnd then we open up that sat with a another female lot a lot of women singer from Cape Verde which is great lure up the tune pump Fiona offer tune up her desk ... for a [noise]\nA once again the number here if you want to ask questions about the music make a request and they're not sure if we can put it in before we can try let's stick to it to buy six two thousand one and streaming online twenty four seven W ... dot O. R. G.\nOr let's keep going with the ah keep very music in this case we have a\nA meal singer boy is Jim and uh\nBut the\nBaby boom boom boom boom boom boom boom boom boom don't don't do the same boat overloaded\nWith both of those ... ... ... all those people\nChildren doubled somebody said to them and the other two minute Joe Main characters now your daughter\nDouble minor children and you got also bugging out have you with your dogs on line Joan bathrooms or other\nAnd connect you to be prepared needs to\nBe ... nearly ... million people a week so nice and brush them because you know here's the thing\nBe made to nearly ... years in a way to tell them it does raise it on the bus to learn how\nDeal to go to Bernard Bernard with notes that they they do then you're looking for a living in a God\nMy name is ...\nYou know jumping to lead them who knows no doubt that ended up in a while and does not mean no none of the day not stay needed in the day and it's you know they know that a non lunch date or why the reason that the minute they got us love suddenly young in terms of their day to you\nKnow John ... who knows what ...\nDoes not know none of the time you step to eat or just a thing or do they know they did not know running a little while and he leaves the law to\nGet to know judging by the age or you're in the ... the star turn in you know the ... later in\nThe building you know the last day\n\nEight or nine to thirty [noise]\nNo [noise]\nNo but in\n[noise]\n\nBrady and yet vicious present for our fault and Thursday October twenty seven thirty PM at the gates of heaven\nComposer Jeffrey ... and yet ... percent evening of exploring world music sources improvisational based composition\nThe coffee place tribute to pray cats considered the first important jazz cellist medicine is locally grown\n... ensemble yet vicious but bring a program of extending compositions by Brady improvisation by members music from Egypt ... gone out and the America [noise] far out full with Jeffrey ... and you had vicious Thursday October twenty fifty seven thirty PM\nAt the gates of heaven and James Madison park on the shores of lake mendota this W. O. R. T. eighty nine point on FM W. O. R. T. S. dot org listener sponsored community radio\n[noise]\n[noise]\nThis is just bits of Resnick a W O T nine point nine of them and H. D. in Madison\nLast twenty minutes of the pen Africa radio show four o'clock ... comes in with Latin jazz cell submarine gay Roomba and I'm sure some other great music for you\nBetray music or from Cape Verde during this hour we started the show with music from Senegal\nAnd the last two cuts were both by Maria to borrow a last one we heard was those parties so our paradise for two thousand nine release Moro bay so [noise] and uh before about her so we heard her son and my mom or\nA ... the are just getting down some me dance with me\nAnd we open up that keep dirty and sat with a tune from Boise Mendez or not shown as the name of the tomb and like go by the name of the album or or keep going with more um music from\n\nCape Verde heard what the tune from Maria\n[noise] [noise]\nDid you do with the the\nBig apple did not seem to be and you\nKnow he got the new building\nThe new law and [noise]\nThey gave me the most of the\nPeople I mean I really do much but I Know she may need to be the [noise]\nMaking any money then\nMaybe they'll do early on through the day\nMaybe we need to be the president needs to be\n[noise]\nThe mom Gail\nGail Lewis day\nWe're going to\nLet you go\nAndy and feel the need to give you\nDo a\nRadio on\nHe\n\nTo show their little group\n\n\nComing out of the\nYou need to do is going to be a\nGood idea\nAnd you're not going to give the\nMan\nLove\n\nNew\nFor me to go down and I\n\nThen\nWould appear to be\n\nJust go on\n\n[noise]\n\n\nAnd\nJunior or do they look very young man young they\nMy line they'll just have to do with Donald traveling yelling at the new book for young\nBob Bob ... and ...\n\nIn mhm\nReally only been in in New Orleans when you're in the ... the little\nKids trying to make the blind in Delaware\nNew it and you want to get in the ...\nAnd he jumped in Paris many long trip than ... pounds to land in the room and\nThen when I when I was\nSearch on the line and then and then when you find your general audience and then you know no oil audience and a man and\nThey going to run around and they don't\nWay or the money on and on and on the news in ...\nDelhi oh blind and where I\nBit and then what did they would\nNew already in them\nAnd doing them and I've been\nNew and everybody you\nYou know\n\nWe would have thought of this goes up and around the corner or the other room by for a moment\nBill six o clock will listen to the best of both play let the gift your loved one dies for one and I would like to think\nFor a show that just ended in a lot of people that were listening to any of this whole weather which is getting pretty close to the winter time even though he saw a ... but there's good witty and I know there is a lot of people in their whole as we know you know let's enjoy these the next well we're so let's start with the ... so it's like you were at the level though\nNa\nNa na na na\n\nNa na na\nNa na\nNa na na na\n\n\n\nNa na na na na na\n[noise] [laughter]\nNo no\nNo no and they\nWho knows what am I ...\nAll the time I mean I don't mind\nI mean I have an email me I'm\nNo doubt that go way back in ... I'm\nThat I don't know I mean I Love it out and all the time\nThen I mean Donald di di di di di di da da da da\nDa da da da da da\nDa da da da da\nDa\nDa da da\n\nDa da da da da\nDa da da da da\nDa da da da da da da da da da\nDa\nDa da\nNa na\n\nNa na\nNa na na\nNa na na na na na na na na na na na don't get a job why\nDon't we know now they know\n\nOne of my bed\nThat on the job done time on on John Ball game it was all\nTheir guns down a lot I'm done with me but also a lot\nDa\nDa da da da da du pont maintenance man you can be on that island there that can\nTwo and ... and bill\nThe end I don't I don't know by the man and earn that I Do a\nOf them are dead they learn to bang boom and the guy who they know and and do that to be that\n\n\n\nTo do\n... ...\n... to go\nAnd out or not\nBut NO NAME all that it might not know that a man on the bottom and all that\nWell you know\nWell I'm\nThat and then came\nThen they can get in bed and a game and then\nThey go into that but they had fond\nDa da da da da da da da da da da\nDa da na na\nNa na and they do that but they don't try and go\n\n\nBeen around them then go wrong wrong wrong wrong wrong wrong wrong\nWrong wrong or indeed\nYour little man I don't know very quiet and\nRhode Island border C'mon man on the ... on them in\n\nA way to go to the gold going on in Mali late late Tony Blair\nAnd I do not want to go along with me\nNon non buying a mom and\nDa da da da da da\nDa da da da\nDa da da da da da da da\nDa da da da da da da da\n\nDa da\n\nDa\nDa da\nDa da\n\nDa\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\nWell maintained well why\n[noise]\nShe is so so I ... I mean I spoke to him over the joy global those those are the only send it to there'll be what the eighty nine point nine if fame\nFor twenty four six zero eight to five six zero zero one doesn't number in the studio if you'd like to give us a call and request and songs or anything that would like to to let us know a ... do\nYou do something happening\nDoors or do you know this month in thinking about ... October twenty seven soup at his thoughts on Saturday is going to be a great night for those folks lovers\nIn to greet what gives us are going to be performing or the bring lunch which you saw located a sibling or one used Washington avenue and ... I grew up\nIn order to stop cells told bill Mayer will be performing on Saturday or do better when you stupid doors open at eight o'clock in the one the interesting thing is that up between eight to nine or this is going to be\nThere's listens by other means all in all these middle and I'm so he's going to be a green nicer than I Do like in a ... between the kids will be the Roomba with a missile well let me see God grossed over so don't forget October when he's serving\nIt started at eight o'clock at the brink loans super thoughts on Saturday or\n... or ... you know get the soul soul bill mid October twenty seven\n[noise]\nYou're listening to W. ... who's a let's continue with the best of both but here for ... [noise]\nOn my\nI don't know why she woke me up you know I'm\nOn my on my\nFace and also I\nDon't\nKnow do they thought she was a long\nTime oh wow [noise]\n\n[noise]\nI don't know why [laughter]\n\n\nSaid oh named Donald told me the ball and\nIt'd be more than I\nDa da da da\nDa da da da da da da da da da da da da\nDa da da da da da da da da da da da da da\n\nDa\nDa da\n\nUh ... you're listening to all of whom to hear W. or the eighty nine point nine ... um well let's start with the first one that I played said there was a ... their bite or what throw into\nThe mid levels by ... ... but also a little better to San Diego and then there was a ... I ... with joy called\n... or the pistol a protester I wouldn't ... mainly made under in the Wonder Years her\nI'll actually own with many out there that was a great song or one of the one that a promise you to get you on the dance floor for sure I Would like to thank everyone that he saw listening online through a W. W. W. dot W. out the F ... that all our G and also\nUh to uh all the um the ones that are we sending through through eighty nine point nine FM love winter W. R. T. FM six zero eight to five six two zero zero one doesn't number to call in the studio for thirty nine and I got a great surprise for all of you\nRight up to the five o'clock I'm going to be playing a couple of songs\nAnd actually one of the one of the first time I've done a good will be here in Studio ... is a a son that has been nominated for the uh left Libya they currently two thousand Eighteen\nAnd ah the Sunnis were negative in Cali and this is a by the senior for any my uh so you're going to be they send it to the ... and then right up to there are going to be playing a song by a a great ... from ah Chicago Juan Carlos [noise]\nUh with or kiss that listen you're ... or those two songs are going to be great so I Know you're going to be in joining a joint does those two songs right up at five o'clock so for now let's continue listening to the vessel salsa here W. or the eighty nine point nine\nAnd I got a song here for a little minor jello all the way in missile many\nYou want it to listen to a fully ... is that right I think ah we\nWhat I Hope you enjoy it and like oh well but he dies waiting for you just started dancing so this is uh what what did della enjoyed listening to levels that there'll be what the exact point nine\nDifferent [laughter]\n\nNa na na\n\nNa na na na na\nNa na na boom\nCompany a local\nNo no no I bought a new game and then it all\nOn that at all\n[noise] [noise] [noise] [noise]\nOh no no I don't feel that it is although no games on their own little new games than\n\n\nMe and I\nDon't get Bengal\nBom\n... all\nOne building\nBomb bomb bomb\nDog and then go\nKnow I Wonder\nNo and then\nBeen a long\nTime but I don't know\nDraw the line with no\nNo no no not at all do that it you know\nDon't know I Know that\nI bought a game on on them\nDon't I don't\n[noise] [noise]\n[noise]\n\n[noise]\n\n\nBe male dog my\nSaid oh\n\nYou know\nNo no no no I don't know I don't remember any of that the guy knew better no no no I Know that they do do\nDo do do that now the na na na na na na na na na\nNa na da da da da da da da da dun dun dun dun dun\nDun dun dun that men do not I don't\nKnow [noise]\n\nYou're ready for this one hour to warm up in just wait for the two bands that are going to be performing the night there'll be somebody October twenty seven children goggles so in order to get the ... and ... and in between ... you get room but with the rest of our music so don't forget Saturday\nOctober twenty separate it let's go Kenya we do so I'm a grade it was\nBut a a great tool like money or does he make it up yet I mean you don't forget right up to ... well who's your prices one all the way from Columbia in the second one from Chicago Illinois just said\n[noise]\n\nAgain on getting married the guy in the Boston Marathon\nLong and then you don't know the\n\nNational League after you're gone all day long\nBut I don't I don't know why they don't mind\nDown and down the main good order\nBack again be mad oh\nNo\n\nJohnny ... going on around here are very na na na na na\nNa na na na na na\nNa na I got there\n[noise]\n[noise] eh\nThe\nThe beard\nOh man that get on the guy that they\nAin't got\nAnd\n\nThen\nThen\nThen then\nThe ban on\n\nGuy in Maine and I'm going to be make are being laid back I think I don't get all the\nYoung boy and I mean\nI\nAnd\nThen bam bam bam bam\nA lot and then they let me ask\nGuy I mean we are not being able\n\n\nTo do the work the eighty like boy you know if they were like why\nDo we know don't forget six or eight to five six two zero zero one it was going to go big big life up pretty soon at one time or a Facebook page and coming up we have a two songs so I go to one of them is going to be from Cali, Colombia one is from\nChicago but meanwhile I'm\nGoing to be a good listening to the ... here at like one thing let's play a this is talk in a while so romantic song by got he got a new good one you version or doesn't fourteen actually and compared to the original so we just got lucky though\n\n\nUh\n\nUh to uh\nUh\n[noise]\nI tell you the in the name but in any better than\nI mean yeah that that he did a\nStudy that delicate me\nHe ... he left they do get you know tell young [noise] again no yeah no they didn't get the better than this one guy down some better\nIn numbers so that they put on the\nYour plan you're\nNot in any field\nLet down by that I don't believe that young man I'm like man\nAnd working on the amount of land and get them outta luck and they may get anything done\nA little\nBit like\nBy\n... a little better now than we did on\nHere and da da\nDa da\n\nDa\nDa da\n\nDa\nDa da da da da da da da da da da da\nDa da da da\nDa da da and then they'll\nLet down by those bully\nWith the young man on the ... the\nLook at all you know we've got to be getting\nUp and down on that\nWith that and that's\nBad for the benefit of the battle there they believe they let us\n\n\nTo\nThat I'm a food bank but now they will be well to me the good guys don't get bogged down\n[noise] [noise]\n[noise]\n\n\n\n\nYour experience with all the wealthy and I'm forty nine FM level here in Madison, Wisconsin and you can go online W. W. W. W. ... FM dot org ... you can listen to us and you can also are getting through the different apps on your cell phone like a tuna radio and just fine [noise]\nW ... medicine and you'll be able to listen to us but there are different ways to fight a team that these moments and he would like to contact us in the studio six zero eight to five or six to zero zero one [noise] well no one debate ground they go to a song that he was a\nIt even though they figure that guy that does the same um [noise] is one of the most well known songs in Cali, Colombia [noise]\nWhy am I talking about this song in particular or a Cali, Colombia because I've got to be presenting\nA song by frame or rain though he um the recording and this has been nominated\nFor ... two thoughts on a team does a godly spare two thousand Eighteen\nYou know good or talk to you a little bit or give you a little bit of history about golly they're not ... or ... or one of the most important\nCultural events in Cali, Colombia um each one of the ritual the region's culture it empathy famous for the toast\nMedicine or that's one thing that you can miss or they just dance through or\nAre they go through different blacks in the city though the mayor a Roach in the city and they just dance all the different groups in the city they participate in these uh video the ... or they don't do the horse riding anymore are due to a different conflicts\nBut uh besides their that he's a little while dance parties and that is a lot of different events I'm like a collection is over lp is a that's a great event or if you'd like music and you want to listen to the really uh all these are all the classics that is a place you just can go and find something that he's\nActually that's really hard to find somebody else a cold I figure the collie the feral colleague in he has been celebrated seems Nineteen fifty seven and that's pretty much like a sixty I Do my mail fear\nSixty one years they're making a certain Nineteen fifty seven\nUm and it goes from December twenty fifth until December thirtieth so that's five days straight a wild different events are happening throughout the whole city and it promotes cultural ethical and musical diversity in the region\nOr three some around the ... is a main driver of the city's economy during the end of the year so you're looking at a place to go a Cali, Colombia um game\nYou're going to find um besides a dancing the food the culture like I'm a people everything is so uh it's a good place to be a in a few occasions suffer included but you're not too in ... groups from a\nA different places in Colombia in the surrounding Caribbean countries so besides or the local groups that they perform in Cali, Colombia will also have a group they usually go from there to Cuba Puerto Rico or other countries\nAnd also some some schools from Rio de Janeiro Brazil um and also that varies known as the fifth year they're like I mean it's going to see like um what I figured they'd like on your sugar fame fair and ended up the idea that I saw it as a you've got different names\nUh but actually ... happens throughout five five days people enjoyment activities like the opening a guy we got the which\nThey no longer do that they might do it in a smaller\nTowns but decided on different events and I'm\nAlso they have a ... a which is the international food streets Tulsa concerts\nIn a different rates in a fairly uh activities and I'm so Vermont and international ... also known for the capital of this house is going to look more like a piece that they left such unless you are the ... I'm given the CDs infatuation with that type of Africa like\nA freak Africa ... excuse me music in early July the results or summer starts a festival which last also for one week I don't usually includes guns or by the world's greatest remaining salsa bans\nAs well as Dan shows in middle ... that's what it was talking about the middle of models they usually have their own day and they just go to a specific place in the city and they show the el peso you'll be able to listen to music that you might not be able to listen somewhere else\nAnd those middle of mental they also have the competitions and we saw 'em straight to out or to see who's got the best LPs the best songs by digging really deep into their archives of sorts of music in relate it sounds to find the ... um\nReveal or the long lost on ... so\nWhat do you like to go on in December four or five days said he had a collie um has been around for sixty one years and it's a it's a great great event so uh no see some been talking about what he is a lot of the collie\nAnd I'm going to be a a perform or actually I wasn't going to be performing I'm going to be a giving you well let's go back to what it was playing in the background\n\n[noise]\n[noise]\n[noise]\n[noise]\nAnd uh those are by group on the ... I'm named after the um [noise]\nUp in the city but no there is a song that he has been nominated for a video that kind of two thousand Eighteen in this song by I'm Brittany made\nAlmost a but it's better than at the moment though when theme I guess you know me know what I said yeah the ... the media it's your choice to lead them when they're getting ... ...\nOr ... or do they know and I do you can buy this song on YouTube or I Do in a different places to provide the TV also\nUm so this year these are going to have nominated for the video that got to do some Eighteen hope you enjoy it it'd be sea level though what about a ... D J broom ball\nYou guys again and\nNot as bad as you\nIn a town you may\nNot be the one now\nThey're being that I'm not willing to die and none of the way no\nThey\nGo down and record but they're they're low ball the grand on both of them\nAre getting in low boom\nBoom boom boom\nAnd record it and do do do do\nDo do\nDo do\nThey know they're\nGoing to this day that you may not know that they're not they're\nGo down there that da da da da da\nDa\nDa da da\nLot of students she must have nothing to buy a gun on the ... ... which I mean the ... which is a ... you said it's something that they do these stunts you win or lose some but are\nLess you are the ... uh me pretty much longer the Minnesota companies selling at the moment about though is the ...\n... W or the FM that or just want to continue with the ... and I got these one by governments that are made a lot since they were one goal is to get them but you can see go let them bomb\n[noise]\nHere's\nNice see\n[noise] federal games on mainstream\n[noise] your mom\nTold us some more loners\nA\n\n\n\n\nJudge on the same beyond actor\n[noise] are you\nGoing to get to some say\n[noise] not my job be joined by more than they do\n\nBut now I'm going to get to get anything done\nA lot\nDown there is a valid or not trying to say no but I got down there and made them do\nGo down there and then down\nNa\n\nNa na\nBang on better than\nDown on that on my home\nThen down then\nBe the\nDown\nDown\nDown down down so\nDa da\nThen down those bombings come down\nIt all down\nNa na na na na\nNa na da\n\n\n\nThen I got\n\nNot as\n\nBad\nAs well\nBut you gotta get get get get gotta\nThe bottom line dollar tend to be\n\nMedal nobody's loving like you're wondering how not gone\nDown\nThough they don't throw them back down to one\nAnd that type of show they make when they go down to those do not going to be there and let them go to like what are you going to be\nGet better prepared for that but I bet everybody but everybody but I but I represent what I read it more\nThan\nThat no one does\nNobody can go now na na na\nNa na na now planning\nThey do not go back\nDown there by\n\nFor those are great song by I'm going to be made him license the other one going to continue with the best also your W worthy eighty nine point nine ... ... to Cali, Colombia when ... was there with a jumping on the\nPerson that's going to school and unless you are the guys are going to be able to go on the other one of my NATO but she ... Illinois law unless you're the Madison, Wisconsin okay I'm In the ... led to the finish it out to everyone that it's reaching and also a or make us any religion were getting\nEnough really that also listen to all of you and I will I'm no one's going to dedicate a song\nNot a myself but um my brother and my sister I'm\nIn a ... just a a sun for their forty ninth or a nursery\nIn um would like to send them a eleven lots of love from all your family and friends all the way from here in Colombia in different places in the United states so for us for that or ... you got ... uh do song you dedicated for you\nUm are the original songs are different that term but this one is a Sosa looked I mean there will be the ... but I'm just voted the building of media this was she was yet those I'm One of those those\nDid I mean\n\nDa da da\n\nThe\nMall I Wonder though I Know\nThat's another great additional law who do would be Judy Blume book which would work this is W O R G ... to ... million W. O. R. G. H. D. or middle soon Wisconsin\n\nW. R. T. thinks it's listeners sponsors and the crystal corner bar at Thirteen to Williams in St featuring live music of various genres throughout the week music scheduling updates at the crystal corner bar dot com phone number two five six to nine five three\n\nW. R. T. thinks it's a listener sponsors along with cargo copying ground zero copy which operates house roasted coffee along with a variety of soups sandwiches and baked goods cargo coffee is located at Thirteen and nine South Park street in seven fifty east Washington avenue in ground zero coffee at seven forty four Williams and St\n\n... June and it's time for rock and roll\nMm [noise] you're ...\n[noise] no no\nBut I Can't do those guys they're no good\nGuy but I Do\nRemember do they do\nWork out and do it\nWe were da da da da da da da da da da da da da da\nDa da da da da da da\nDa\nNa na na ...\n\nNo no no\n... no gender or gender\nOr da\nDa da da\nDa da\nDa\nDa\n[noise]\nWe don't town el no no\nHad ever been to China right now [noise]\nA man you know if you don't see the uh thing\nYou may recall that good at it and then I and\nStory could be wrong [noise]\nNa na\nCheese are run by the time\nPlan and then as young as ...\nThat's where we start tonight so there should have I like it like a rock and joined for two hours this mostly\nArea but she was in\nWe play it it can you know they made a name and it's still a very\nOf tea and shared\nUm [noise] do you remember [noise]\nIt's fine I\nTo be able to use\nThe [noise]\n\nResidents not exactly as reporters isn't just disaster in this ...\nSometimes would've gone to the store and made the word is now was a there\nAre scandals which the yeah the ... on the side of the time no matter what we don't\n[noise]\nMean you\nWhen we um [noise]\nWith the uh [noise]\n\nThree year old featuring the weight Bobby V. we start with Bobby ... and the crickets alternate take of buddy Holly's Peggy Sue that was recorded in September of Nineteen sixty one\nThere will be the flip side it was big hits take good care of my baby a song called bashful blob that mentions Peggy Sue the lyrics if you are listening closely and that would\nBe a side to take good care of my baby was a huge hit for Bobby beef aroma Joanna November of Nineteen sixty one at least a point bashful bottle what\nAs I mentioned several times used to flip the singles over when I bought them\nAnd play the besides and then we heard Bobby V. record than to those are the three the lyrics by trim rice Bobby rewrote the music what ever happened so Peggy Suicide bombing these sons backing him up the fees on that recording\nIn about a little bit of muscle tone\n[noise]\nDon't we\nDe la ... and\nIt and that\nIn the way it is you know how how do\nYou think you know to\nMight even be\nGuys and\nI have done it\nTime to play a game and you know I\nDo miss the biggest thing to do\nNa na\nNa those\nKnow what I Am\nNow I mean nobody did you do drop it just shows\nAre they the way I didn't even know\nIt may be you know\nNo no I'm\n\n... money mood drone who does a little more but where do most were real really the first really bring your mood tone hippie first number one who would we use mister postman really either he would do much with Bill from the silver Nineteen sixty roller to merge Nineteen sixty\nReally ruined a little bundle you moved tonight we're going to hear a couple of friends from the ... was one all the original ill he looks like a one off the original forty well I don't know are the ones that we're looking here [laughter]\n\n\n[noise]\nHey man\nNot [laughter]\n[noise]\n[laughter]\nSame thing\nThat\nBut I don't know\nI\nWent\n\nI don't know that I'm Donna and\nKnow why that I've got a million and then\nThat may not be oh my God we're\nI don't know\nYou agree with me\nDo now I don't know how to do about a girl that I did go [noise]\n\n\nAnd we're all of our lives you\nThen ... like that\nAnd then the man of honor and\nDa da da da da\n\nDa da de da de ... than down\nLike he told her old man now in\nThe radio ... do\nThat she can then all\nDay in the theater\nThat if you\nManner you know you\nMake a need by\nDo you manage\n\nThere is an interesting triple plenty we start off with the beach boys and their version of Peggy Sue that's from the MIU will will not came out in Nineteen Seventy eight within Obamacare you're most\nLikely a bunch of tricks from that it really was that album one of my favorite Beach Boys they'll peas your mind you will woman Nineteen Seventy eight\nIsn't brand new stuff from the white walls on a Minneapolis St Paul brand new this called woman ... we're the white walls\nJoined the beach boys ... do we want to dance the Bobby Freeman hit and they put a little bit of the body Freeman original what the big ending at the end of the new stuff from the white walls\nAnd the rest of the what the Beach Boys with the royal philharmonic orchestra new CD of acquaintance from this\nHere in twenty Eighteen we're the beach boys with the royal philharmonic and Boeing pulling on the original single by the beach boys a fun book was a huge her memory to April Nineteen sixty four\nBut right now we're going to plunge elbow deep in the bill would\nYeah\nOh yeah you\nDo when she died\nWhen I'm a good team and I'll say I'm\nIn the wrong man be neat ball you or a\n... [noise] [noise]\nOh too or is that the people who love will be a good thing [noise]\nI'll be around\nLunch and dinner\nDo one or\nThe people in\nOur lives for them to do before the\nPie and all these years [noise] and yeah\nHe\nWas in a [noise] who knows [noise] that that's\nWhere the where [noise]\n[noise] oh dear [noise] do you worry in my heart is a good mood\nI'll play a ... a\n\nLot more\n[noise]\n\n\n[noise] [noise] [noise]\nOh oh yeah did you break my heart is a good to know\nHow they the ... oh yeah\nLong or a\n\nI'll say that\nOh yeah\nOh\nYeah Mm [noise]\nReally heard a lot I heard somebody just heard one of them but we really Charles here we go again that was a race for re one for me the joy of Nineteen sixty seven oh here's an interesting sort of a music store which\n[noise]\n\nTo be the way I view\nDi di\nThey live where\nThey were yeah [noise]\nKnow and she began\n\nYeah they're they're bringing home here in the Nineteen sixties the schools they stored up as your schools they shortened it the rascals later oh we just heard one of their big hits a girl like you\nKnow for the schools ... September of Nineteen sixty seven and this is W O R G nine point nine ... W over to your member dot O. R. G. Madison, Wisconsin", "year": "2018", "show_name": "no_show", "city": "Madison", "day": "13"}