{"month": "10", "state": "WI", "station": "WORT", "content": "I have a car ... tape player so I went through the old sea wall it you know those you know like gold people still are you all your life was ruined\nEducational David thank you so much for taking the time yeah thanks for putting up with me\nAgain our guest this week was educational team as a musician based here in Madison you can hear his solo work at educational Davis dot band camp dot com\nAnd you can check out one of the other current project therapy grown at therapy drones dot band camp dot com are the music is my occupation are pod cast is produced by Chris Play Doh unbroken Shelley ... ... ... and me for the tone Madison podcasts Scott\nCourt you know [noise]\nAnd that's a rough road W. or do you live local news at ... ... ... contributors carousel barrier and Scott Gordon building broken engineer to like show Molly spent with the news director here at W. O. R. G. M. misdemeanor prevents you was your reporter producer of disease me like you guys were listening I'm your host markets leagues and\nAnd your how Stacey harbor up next perpetual motion machine thinks you're listening\n[noise]\n\n\n\n\nAnd you're listening to the mighty W. R. T. eighty nine point nine FM andme manifest standby for for ... shouldn't have said oh God\n[noise] W. R. T. six PM local news is seeking new producers are we see the church\nMaybe you love books or beer or food once reviews them for all how about pro finally local artists have a lot of science [noise]\nWant to share your knowledge would W. O. R. T. listeners joined more than ...\n... doesn't community members who work on our local news program\nYou up with our recording studios professional microphones and audio editing software you produce a weekly five minute segment for broadcast and thought that\nIf you have a fresh idea at a few hours each week to commit get in touch contact news director Molly stunts that there'll be ... by email she's up Molly got W. or two of them [noise]\n[noise]\n\nHello Madison welcome to the Wisconsin energy broadcast a show about clean tech renewable energy and the waste is rapidly growing industry is changing how we think about power\nThe Wisconsin energy broadcast as a project or the perpetual motion machine hurt on W. O. R. G. eighty nine point nine ... and Madison now here's your host Heather Alan ...\n[noise]\nHello it's good to be back with you on this episode of the Wisconsin energy broadcast I'm your co host Heather Alan and on today's show we have to excellent guess interviews\nThe pledge drive finished up this afternoon and we didn't quite mean our goals but there's still time for you to donate and received one of the fantastic gifts available through Saturday at the sixty dollar level you can take home two tickets to a fantastic science event\nOn October twenty six seven PM joins Steven diverse of the ... Institute for climatic research Raj Shukla of the river alliance and the words own weatherman Rob Mick lower\nFirst stimulating discussion of how climate change is affecting our listening area and what the future might hold on friday October twenty six seven PM at the government center two tickets for a sixty dollar donation to the station you love\nJust visit W. R. E. T. F. M. dot org and click on the donate Lincoln the top right hand corner\nAnd thank you for your support so in some nights show we will first dig into the series\nOf very exciting renewable energy commitments issued by Wisconsin utilities in the last couple of months on August first whack energy group an adopted a new long term target an eighty percent reduction of carbon dioxide emissions below two thousand five levels\nBy twenty fifty ... energy group said it's retiring more than ... Eighteen hundred megawatts of coal generation between now and twenty twenty including the recently shuttered pleasant prairie power plant in Kenosha\nJust one day later on August second line energy announced its goal to cut carbon emissions from eighty percent by eighty percent and eliminate all existing coal from its energy mix by twenty fifty\n... LA and energy plans to spend more than two billion a new renewables doubling it's number of wins sites from six to twelve through this new construction and additional purchase agreements the company's energy portfolio we'll have more than twenty seven hundred megawatts of wind power by twenty Twenty one\nAnd renewables will represent over thirty percent of alliance energy mix by twenty thirty\nSo these are big announcements and for those of you who are curious about Madison based energy any they also share the same goal of reducing CEO to emissions by twenty fifty ... eighty percent by twenty fifty and that had been previously announced\nSo we wanted to dig in further to these major utility announcements and in a few moments you will hear the interview I recorded earlier this week with\nOur guest will dean will as a graduate student in urban planning at your W Madison he is also earning an energy policy analysis certificate and works at renew Wisconsin where we are colleagues he takes a deep dive into these utility announcements that tell us what this might mean for the future mix of renewable energy in Wisconsin\nThe second half of the show\nIs an interview recorded earlier in September\nWhen much of Dane County was underwater and suffering from extreme rainfall events\nSo let me remind you there is a great to talk about that on October ...\nTwenty six at the government center at seven PM and you can get tickets to that event on our website by donating\nIn this interview man than I talk with the three of ... the head of the Dane County office of energy and climate change he talks to us about his work and the work of the recently formed Dane County Council on climate change\nThe council is working to put together a county wide action plan to address climate issues there was so much to talk about what keeps that we had to break this interview up into two segments\nAnd part two of our interview with Keith will air on November\nOn the November episode of the Wisconsin energy broadcast\nSo we have a jam packed shell again let's get started\n[noise] [noise] Hi Will and so tell me a little bit about yourself [noise]\nYes so they found me all Heather I'm I Am a second year grad student at U. W. Madison I'm getting my master's in urban and regional planning and a certificate through the Nelson Institute in energy analysis and policy and ah that's pretty much what it means to me to renew and I've been on a new stuff now for almost a year\nHow do you like it I Love it I'm learning a lot of my coworkers and colleagues are extremely smart friendly and ah it's a great environment to learn about the trends and renewable energy and energy as a whole\nRight right exactly and that's why I wanted to bring you here today so there have been some major announcements from Wisconsin utilities over the last couple of months about shifting away from dirty fuels to renewable energy what can you tell us about what are the major things that are happening [noise]\nYeah sure so in Wisconsin there are\nA arguably three or four large investor owned utilities that\nMake up most if not all the electricity generation or in Wisconsin that isn't used by the customers um so two of those uh uh investor owned utilities or a W PS and Web ... and those are under the auspices of whack\nEnergy group and so what's happening there recently both of those entities have pledged to reduce its CEO to emissions\nBut ... percent by twenty fifty using two dozen five as a base here and so what that means essentially that\nGiven the amount of fuel to that was emitted from the electricity generation and oh five they're going to reduce that eighty percent of that number by twenty fifty right and there's many means by which to do that\nRight so ... wack just so I'm clear um includes Wisconsin electric power company ... which was previously called ... energies and Wisconsin power service corporation WPN correct\nIn that happened and then merger happened rock was should I guess you could say happened in the middle of twenty Fifteen okay sometime and Tony Fifteen\nAcross the entire county public sector private sector everybody and everything that's going on in the county and come up with the climate action plan\nFor Dane County that will put us on a path\nTo deep deep carbon is Asian basically to make sure that by mid century we have reduced their greenhouse gas emissions by\nSomewhere in the range of eighty to a hundred percent which is a very tall order but that's that's the meat of the work that I'm doing right now in the middle of right now\nOkay can you say a little bit more about what it means ah when you said deep deep carbon is Asian\nRight so you know our economy is is primarily based on fossil fuels burning fossil fuels and a curse fossil fuels\nCombustion emit carbon emissions are and CEO to a form of carbon is the most prominent greenhouse gas emission there are other greenhouse gas emissions methane for example from agricultural sector is another is even more potent greenhouse gas emission\nThe carbon dioxide really makes up the bulk of the missions and and I like to refer to it as carbon pollution\nMake up the bulk of the emissions that are really driving climate change and driving the\nCrazy weather that we've been seeing of late here in in Dane County uh we've had a great example unfortunately\nOf late so deep deep carbon is Asian is really just the carbon ... and our economy so that we are no longer dependent on fossil fuels but instead we're power in our economy with clean renewable energy resources\nThank you for that definition and um and for supporting the workings of Wisconsin energy broadcast since clean energy is our thing\nYeah absolutely absolutely and you say you mentioned it climate action plan can you tell us about what goes into the plan who is working on the plan and how you're developing that plan when when it will be the plan\nGreat questions so the way we're going about developing this climate action plan for Dane County is we have convened a climate council and the climate council is made up of thirty eight organizations that\nIs also there to bring that equity lands and the Urban League of greater Madison is also there um to bring that equity injustice a perspective so there are a lot of groups in that space and so um it's really a very broad diverse range of interests\nOr any mean that's the palate is represented on the council thank you there are several of them so actually five to be exact so city Madison is there the city of middle attendance their city of ... known a city of Pittsburgh in the city of ... prairie\nYou've got a big group of people there how are you doing the work of writing an action plan together\nYeah so I'm In addition to that large council and it is as large but it's a great it's a great thing that we have so many people interested in being part of this effort but we also have ten what we call work groups that advise the office of energy and climate change\n'em on different areas of clean energy so for example we have a work group on renewable energy resources we have a real work group on energy efficiency or Groupon sustainable buildings\nOr group on transportation and land use another one and a culture forestry and food\nAnd another one on water and think of that as sort of the water energy nexus\nSo those are six substantive work group areas and each of those groups\nHas and their ten in in total but each of those groups has\nA ... about an average probably ten members and unlike the council which is really about stakeholder perspective those work groups are really populated with experts in those areas and so there are a lot of businesses a lot of\nAt the energy efficiency were group has several energy efficiency program implement ers for example energy efficiency consultants\nAnd I'm so a lot of deep expertise and so the way we're coming up with this climate action plan is that those work groups are coming up with ideas for programs projects and pollen\nSo you use those are sort of the three buckets of different actions we can take to address climate change that will populate the climate action plan so they come up with a with recommendations for different policies and programs\nAnd they're they bring those ideas for different policies and programs to the counsel of the council deliberate on them and ultimately decides what will go into the climate action plan so it's a consensus based process\nSo all of the council members um ... is a a wide diversity but the kind of all I have to agree that these are actions that makes sense for Dane County\nHow can a member of the public or one of our listeners find out more about the work on that council and and what proposals or prevent patients seltzer giggling when you're an activity\nYeah that's a that's a great question and so you can go to a the easiest way probably is to go to the Dane County Web site at which will quickly leads you to the website for the office of energy and climate change so um you can go to that website you can look at\n'em all of the meetings that the council has held you can look at all the presentations that have been made at those meetings you can look at notes from those meetings so that's a good way but you know actually another good way would be actually to just email me or call me and you can email me at\nMy last name is ... R. E. O. P. E. L. L. E. dot Keith K. E. T. H. at\nCounty of Dane all one word dot com um and yeah you know so many\nHave you heard that this effort is happening to create a climate action plan and have contacted me already and that's you know terrific I we really appreciate it so we'd love to hear\nFrom more citizens in Dane County um but the other thing is we are going to have some some more formal opportunities for people to weigh in and so actually\nUm if you send me an email that address or be happy to put you on a list of folks that we will send a draft copy\nThe of the climate action plan to to get comments and that that draft 'em that drafted the climate action plan probably won't be out for a few more months now but within a month we're going to send out sort of a precursor to that draft climate action plan which was just\nIt'll just be a laundry list of all the different recommendations that the climate council has come up with so far\nSo there'll be a couple of very formal effort efforts to get public comment on the climate action plan that we're developing and that reminds me that Heather you had asked me a question before about sort of the timing of this whole effort\nThe effort started I'm almost exactly a year ago and I have I'm told the members of the climate council that we'll wrap up that work by roughly the end of this year and then it is going to take us another few months to actually\nLiterally right that climate action plan and get it published and so are expected sort of release date if you will for the climate action plan will be Earth Day of twenty Nineteen\nTo of course is April twenty second and that's that's when the climate action plan will be done and that's one will share it with\nUm the public and um and by the way of speaking of that sort of release date I have to put in a little plug 'em there's a national group called eco adapt and they are holding they hold every other year a huge climate adaptation a conference it's a three day conference\nYeah definitely I'm part of a paper his job is to inform the students and the rest of faculty and staff about what's going on in there is something going on a faculty and staff um we would report on it\nOkay uh now how often is the clarion published\nA so we're by weekly so it's two issues in months OK\nOkay as editor and see what is your daily routine do you have a routine that's more or less the same every day or\n[noise] um yeah I guess go to class then checking the office a talk that Douglas correct ... get a newspaper the advisor and a\nKind of see where we're at if we add articles in it for a short somewhere and need to add something and asked about design and what we want to do with that issue uh-huh\nAnd you mentioned dug a or Douglas a coach bird or who is he again\nHe's the newspapers adviser\nMhm and so what what is what is his job what what does he do\nSo he's not I'm a teacher has only job is to advise a he's got a declaring and then clarion broadcasting also at the journal so he can uh helps make sure all of those are up and running\nYeah yeah well he seems on because I I've been out there uh because I'm I've I've been a I'm a professional\nAnd so I I I I've been at Madison college enough\nFor a many many semesters\nA auditing classes but I participate fully in the classes I don't just sit there and listen and um so I've been in the clarion office and I must say that I I feel completely at home there did from the first day uh and uh so it's it's a it's a nice place to be\nYeah you and I signed up for [laughter] a stocking\nYeah and I'm\nNow I'm I was talking about a dug a yes and he and um 'cause I've been working with Doug a little bit because he's been showing me explain how the studio works and the\nThe uh the ins and outs of that uh but won't go into that a today because what we're going to have a cure a hero Carbone\nAre bony car she pronounces it sort of like it yeah yes she is Italian\n... she is Italian yep her grandparents I Believe our traced back to ... yeah that's that's our grandparents yeah but I I think she's Americans and see yeah yeah ... yeah I said when I was growing up I didn't hear people saying well I'm Italian or I'm this rhyme that uh it was only\nAfter it was only actually when I went abroad and met Americans I heard more and more people saying oh well I'm Italian nuns in your Italian and it turns out that most of the times they didn't even speak Italian [laughter] they met their grandparents or great\nGrandparents were Italian and or their parents in in ... I Would say most cases didn't even speak Italian so it it always seems strange to me to hear them say they were Italian and an Italian it's interesting because it seems to be the the most frequent things you heard sometimes would be you know a germ nor\nWrite or another nationality\n[noise] anyway um\nYou go to class and uh how many hours the classes do you have a week or so I only have two classes on both an hour and forty five minutes so that's what six credits\nOr yeah I think so\nAhah there about three and uh so you go to the uh clarion what ... how do you refer to that the clarion declaring office office okay the clarion office and uh and what do you do there\nDoes anybody in their talk chat with them otherwise I'm thinking about my stories do some writing or maybe just outlined in uh-huh\nMhm yeah when I whenever I mean there I Try to not to talk too much because I don't want to distract people from their work but I just find it interesting talking to all of your people in their un Sean and some of the other people yeah yeah um and I and I must say that I found that everybody there just is very welcoming\nYeah oh and a question I Want to ask the more we should ask this before 'cause I've millions ask Doug this\nAh can people who are not students work on the clarion\nUm I don't think so I think you need to be registered as\nA huh OK I'm that somebody asked me a question about the the radio and uh and I thought when I you know maybe it's just about the Claire and in general [noise] let's see [noise] so\nYou're the editor in chief now did you appoint the sub editors or\nYeah or Bryant or news editor and Jackie opinions edited and\nEditor I gave them has yet uh-huh now I'm\n... years did did you have any trouble finding some of the staff is needed ... particularly editors or did or what the was there an abundant a number of people choose from\nA kind of a yes or no there are people that were really interested and then they kind of faded out and but there was interests I'm Still looking for a managing editor but oh yeah\nYeah I had the people that I made editors they were interested in men responded quickly mhm\nThat's good and so how does this work do you do you\nWe once every two weeks or once a week and devout assignments and\nSo it's once a week that first meeting is uh the story meeting where we go through the list is stories and I can I we come up with a list before the meeting and go go through the stories let ah the writers pick what they want ... and then if they have any stories that they want to see themselves they can do that\nAnd then the next week that'll be our that Wednesday the next week we'll be are due date and was a meeting before then to see where everyone is in a in their stories and\nI was about ... ever presented a story that you felt you couldn't publish for one reason or another\nThat no not yet uh-huh mhm\n[noise] um ...\nI I I I have no reason to think that this is true or or not true but I just wonder if whether you think that maybe\nStudents or some students or many students or few students might tend to take the pay for granted they just see the finished product and they don't think about all the time and work that goes into producing it\nMaybe um I don't know of\nTake for granted necessarily but I think definitely it you're going to get out of it will you put into it and can be a very even if you don't want to go into journalism his looks there'll be a like a meaningful experience for you and something that can be proud of\nYou know but I'm but I'm ... I'm not talking about the people who who actually work on the staff or the ... the general students who\nWho see it there it's available it's always there and it looks good and they just they know they can pick it up they don't have to you know leave a dollar for it and they just pick it up and it's all over the cap listening or fifth forget to pick it up there you know a few yards further along\nThey can pick it up and and it's just weird it's like you know when we turn on the faucet well we I think we we assume that the water's going to come out and so and unless you are actually paying the bills\nYou probably don't think of of you know there's water really expensive\nGetting this water and get into some actress it'd be and so forth and so I Wonder if the students might tend to have the same attitude they just don't think about the the the fact that that it well it does cost a lot of money and to produce any and it\nTakes up time and you and Sean and and some of the other people and there are sitting in there every time I go into you're sitting there writing and thinking and taking notes and making phone calls and and then you know we later that there's the paper but you know very few people see you in there doing all that hard work\nYeah as far as that I don't know how big our readership is that I think the faculty and staff read our paper on a regular basis in size this Steven ... um I think a lot of people know there is a newspaper but I don't know that actually read it\nAnd and now I'm Madison college being to where we ... we have traditionally called a two year college um\nIs there much overlap from year to year among the staff do you have people who actually say it's been at at least two years on the staff or is it mostly new people every year\nI think it depends I think last year um when I was an editor in chief I was one of the new people I think there was a decent amount of um\nReturning people mhm and then this year I had there was three of us coming back and then everyone else with Neal oh so you like it just depends on I guess the students and where they are and in what they're doing with their programs\nAnd now when you took over ... ... I assume you were on the staff last year I yes okay and what what position did you hold last year\nSo I I I of course I get the the emails about staff meetings although I [laughter] I didn't attend um\nSo how does it work it 'cause I Know it's hard for for everybody to come together at the same time so do you do have staggered times or do you have times like two times a week or do you have regular hours when you were there and people can come in turns England or talk about projects\nSo we do have um one cent meaning temperature Tuesdays at three and then I had won Monday's earlier but people weren't really able to make that\nMhm but I'm usually in the office all the time so anybody needs to come and talk to me and usually they're oh yeah yeah\nSo uh tomorrow is friday argue it's friday in a different from other days do are you already halfway towards the weekend that you just have so much work that you it's just another workday\nSo it's friday of deadline week so oh yeah we're putting all starting to put things together and\nUh-huh spend a lot of time in the office probably tomorrow uh-huh\nSo does that mean you said that mine would that mean that next week\nIt won't be quite as um Woodward should I use um\nYou won't be quite as anxious you have you can relax a little bit\nBut yeah next week it will be everyone gets their stories and then we're writing so uh-huh I'll be free for that\nOh yeah and of the week and a big scoop [noise] are you working on the big scoops the expos they have\nA no not any snow ... the you know\nUh one thing I ask you about quickly\nBecause our time is actually a a and that is a or you aware of any opposition to building but the south Madison campus and closing the downtown governments and actually selling it or at least you got for forever was I opposed to it no were you aware of all you\nKnow not that I Know of I think they muti all was in huge support of this none of them is something well\nThere was a lot of opposition although I Would yeah [laughter] but unfortunately we can't go into that this time um because our time is up and a thank you Andrew too small try to get your name right for being with us tonight and this is ... ends and saying good night until next Thursday\n\n\nYou've been listening to radio literature collectively produce weekly program on W. O. R. T. eighty nine point nine Afghans matter [noise] an W O R T H ...\nWe our listeners sponsored community radio [noise] join us again next Thursday at seven thirty for more teachers local writer and writers local into [noise]\nThis month is a must be music is it hot off the presses every month available music stores clubs cafes and restaurants from Madison to Milwaukee whitewater to La Crosse in Steven's point maximum in covers the local music scene from local to national shows\nIn features a club calendar and every issue as well as on the Web at maximum dash ... dot com\n\nAnd now I'm In his new\nShow on face the title curtain\nMy friends outside blizzard\nUpstate my case you know\nOf course John I'm certain\nI live\nLive such\nI've traveled\nA very high was\nA more\nMuch more than I Do admire\nI had a few [noise]\n\nAnd I saw it through\nWithout exception\nTo eat the sharia code\nEngage care among step\nAlong the violence\nThat much more than a much\nJust there were times\nI'm sure you\nOr nothing I could choose\nHouse to tone or\nDid it by one and\nOf ... and my my share of religion that now\nAs to subside\nA fine and then I'll\nGo on and so\n... and all of that\nMay I say\nGet moderate weather [noise]\nYeah he has no\n...\nAnd ...\n\n\nDo [noise]\n\nUp to date [noise]\nUm there's much views\n\nA\n...\n\n[laughter] [noise] must be bigger than most\nIs you know the ... regional\nThe mad\nIs [laughter]\n\nBack and\n[laughter]\n[noise]\n\n[noise] [laughter]\n\n\n\n[noise] [noise]\n[noise]\n[noise]\nYou know a good\nAre\nNa na\nNa na na na na na na na na na na na na\nNa na na na na na\nNa na na na na na na na na na\nNa na na na na na\nA member of the [noise]\n[noise] [noise] nah [noise] bom bom bom\nBom bom bom bom bom bom bom ba ba bom out on their mom and uh [noise]\n\nDon't you [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n...\n...\nYou sound like a little\nWashing all the bad news dumb down the drain well at least for now I'd rather than three hours yeah\nAt least for this moment we can't help you in any other time [noise]\nBut at other times we actually might bring it all back up\nYou know I mean get a plumber snake out and just all O'Hare blog out trigger drink drink a drink I drink a trigger you know ... yeah it does make a whole song of trigger but anyway sometimes but right now\nMoving from like slap you upside the head it again in the wake up ooh see your head it's otherwise subsided your head you know stop you know get your fingers into this the the wall the side of the pit and try to clog yourself back up again and then her weight [noise]\nThat's how she votes building yourself right\n[laughter] I Love that [laughter] that laughing at you and all these [laughter] but yes\nShe is she is of the ... she has a German art students yes and now they're that band yes and I don't read the art students from oh let's see\nI think that uh [noise] I think that now and\nThen beef is is coming after that will be a master right they need an up and then there's going to be another said it's gonna be\nUm oh I on the borderlands are going to be playing in that that will not sure exactly what the whole final lineup how it's going to shake out but uh and Ken ... friends are going to be in that said he was going to bring a full band and I'm\nLyric advisory board is it going to be performing and we play them on the show a few times and then uh being bonds and they're going to be playing and then there's going to be uh the last hour uh there's gonna be music by [noise]\nTo get away driver's it's going to reveal five and um\nUh Tom castles and the material boys whoa that's a lot of action for yeah our eleven bands and they're going to play like ten minutes at Wal wind farm yes so let me a lot of fun and mingling and you know looking at the art I mean living in January you know yeah ... in your\nYard all and figuring out what you can do to help change the world et cetera and have a good time and speaking of which like here is a track where [noise]\nYou know they're having a really good time of getting a message across at the same time so this is Ken ... fan and if you don't recognize it as a parody of a song by artist named Tom Lehrer move you're not familiar with\nA very influential poisoning pigeons in the park for political and humor is a folk singer [noise] starting in the sixties and seventies and he had a song called the Vatican rag which is a poignant critical and hilarious so this is Ken's take on that but it was called\nWalkers bribery read so interesting and informative no [noise]\nNo [noise] you know let's let's let's artist thing that\nThen we got some eight forty music something brand new from the band after up and who knows what more before we get our news is get nine\nCounter information and enforce them one\n\n\n\n\n\n\n\n\n\n\n\nIncarcerated for the oily and when he was the worst record in history if Romney law lord pipeline spring\nAdvocate advocate response a village Jane clean up so let me let me no longer in the village are far more and more and more rivalry\n\n\n\n\n\n\nHere's the other ... and ... and um [noise] ... [noise] you\nI'm In the winter and\n[noise]\n\n\n\n\n\n\n\nHey you're listening ... W Archie FM this is rather Eugene to name Monday seven pm to access our will be happy talking points about mass incarceration and having a guest on the line listen to music and not just grew matured during Monday seven PM\nW. R. T. ... FM address on\n\nThe excess our is W O ... commitment to community access to the air wing\nAbuse expressed on the exits ever do not represent the views of the nation from its programmers or the board of directors\n\n\n\nLogic deemed dragons change\nDanger string complied sixty bits can do a stranger time Jack Kemp was these spy ring climber can try to get the ... the\nYou said just get a shambles from reading your grandmother\nSince we have is stolen\nLive among the tokens quote we'll\nOpen to people for that in ...\nThe beautiful plump pan\nLike it has\nLiving up to three hour shoveled\nGood night will be ...\nRemember the little prince in there and the largest they bought a long road so we ... the bar and there\nAre\n\nCouple of years man you got me on flagstone over here and\nThe snow on the same\nMention the pressure on the bench oh people on the street out here Robin for judges are not on Medicare\nMy ... my anesthetic\nIf you're still with me when I got to say how medical insurance and the agency\nYour profit in college the American\nBut this may not make it a little weight\nLoss in the long run I Know the costs are those are just call the HMO hold a non profit just before we August so\nThat they have the best thing calling themselves the meal class or come across as I read that he was up\n\nFor past the dog that may be but if you think I'm Single\nAnd you start to get better take no one will be a doctor with our paper is just what that split up\nYou know when you when\nYou when\nMy hands out by a cancer concerns hands were shackled forking hands from my mother my income shaking hands Perry Mason hand in hand it's not going to say they're dirty hands go man can balance Framingham\nKilling me for you know should we tend to now we have a chance to use the phrase how old am I getting money\nFrom where we can still for fear that [noise]\n\nAh\n[noise] Mm\n\n\nSince well before winning album cheddar revolution has a sequel celebration released the the new cheddar revolution bonds of resurgence on Sunday October seventh from five to eight as a harmony by an ad\nSounds for searching the compilation of the original songs by this continues to inspire them to rise up and maintain our state upcoming election\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nT Madison eighty nine point nine FM community radio [noise] this is psycho acoustics case you couldn't tell [noise]\nAnd that's bad sister Hi I'm Bad sister Heidi here yeah\nI wanted to thank Mathew [noise] ah from Bristol he's pledged online just a little bit ago oh yeah\nA map to peace [noise] I don't know I I don't know if I don't\nThink he's from Wisconsin 'cause the comment says two thirty\nAM here I intended to wake up briefly during Vietnam\nTo pledge but messed up the math and woke up in our late and joy and keep fighting the good fight oh well we'll make sure that perpetual motion machine hosts know about that thank you very much now that it's very nice\nI'm\nThey're searching for\nYoung\nAnnie [laughter]\n[laughter]\n[noise]\n[laughter]\nAnd and the day\nTo day [laughter]\n[noise]\nUm\n[noise] [noise]\n[noise]\n\nI'm Talking I don't\n\nSeemed to be\n[noise]\n\n\n[laughter] nah\n\nNah nah\n[noise]\n\n\n\n\n\n\nJeeze\n[noise]\n\nIn the ...\nAnd\nYour own and\nYeah my name is ... I'm not on\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nStill lots of fun a lot of my favorite things happen during it and I'd like to thank you for your support on my favorite people are down here hanging out yeah you get to you know oh you don't see every day I mean right coming in at different time we say here\nIs here a lot in Nevada villain and top ranking Ralph and um then we will I'm really awesome see some other people around a lot yeah everywhere like Anna everywhere\nJust the different shows mixing it up showing up on other people's chosen here from a lot of the same people like the uh Dora\nWho just listen to a lot of different shows do you want to thank all and each and every one of you for all you do of course the chickens people\n... and ... [noise]\nAll right all those are [noise] um and so yeah that was that last set this is say go acoustics and W. R. T. W. R. T. S. dot O. R. G. [noise]\nIs that Web portal for archived and streaming and are constantly updating content [noise]\nSo we've been definitely hooked on the new stuff tonight it's just a lot of it that we think is good and want to share with time new stuff I'm been impressed with this woman on a ... [noise]\nUh-huh he's an impressive woman [noise]\nFeature here yet but I'm\nLet's let's say listen to what's more the sounds like from her newest album hunter\nAnd you know then we'll get to discuss in a little more later on\nSeveral more too and this is the biggest thank you to everyone and all the ...\nOh and especially to fabulous that's his were hiding oh and a special guest she told in the educational Davis oh yeah\nHe's really set a novel in this weekend on friday yeah there's a story about it at W. or ... or ... page do white you know David or he calls an Eddie I'm ... I'm a combination\nI call them educational 'cause I don't want to be too familiar educational yeah but\nYou you can use you know All right\nWe electrical were yes it's electrify congratulations good luck on that\nIn a healthy\nWith us see in the in the ... in the in the in the ... the decent\nThing to\nKnow those were\nThe ... and\nOh no no and you\nKnow [noise]\nI don't know but\n[noise]\n\nOh what do you will need knees um\n[noise]\nDo things for me you were living in the the [noise]\nOh no it's only you know if you're going to [noise]\nIt really\nAble to compete\nNa\n\n... you know okay [laughter] okay [laughter] I don't know\n\n\n\n\n\n\n\n\n\n\nBe they can\n\n\n\n\nWell we know where it is in the in the [laughter] you know the the the the the ... yeah\nPrognosticators on the future [noise]\nAh we just heard white diamond than them more than I'm dumb yeah hands yep magazine from their newest album performance or an city slang records\nOr before that the we went to the actual wonderful and friday frightening world of the fall\nAnd her two by four before that Sharron sin Shaun Shaun at least the sky is blue featuring aerial pink from the album oh\nThat was a little more like it was soothing wasn't right when I was taught that you know it it had it's\nYeah it's good to drink some are always say to okay\nAnd we started off with something that was a little more rock and Anna ... I'm a man or do as a man from the album hunter oh on domino\nYou know goat cheese to [noise]\nWhat about oh yeah I'm with the Rosen him [noise] so that was that last set and then heading into the future hurt us the future refer [noise] perhaps I\nLike to go out right arrow night we have got a show at the art in ... well first of all it is gallery night and um that is all around your eyes and some are at the gallery like for nine\nGM and jabbed me our places are a little later you know start a little later and a little earlier you know stroll the streets of this now also through October a Wednesday through Saturday Night stairs leaning are in a new light at ...\nHighly recommended like six thirty nine thirty gleaming also recommended on a friday show it Mickey's no cover their mobiles hard feelings river's edge and the ... oh I'm Sorry that's today not today\nAlso it's an analyst today and tomorrow and the Marlboro [noise] and ... it will be um\n[noise]\nA turkey fast oh yeah no ... no money that Mickey's tomorrow\nSo that there's your way into it will make you know bunny yup\nMickey's no money while we wild [noise]\nWhat else is a friday night [noise]\nDo house revival party [noise]\nGetting the gallery that goes from at would Winnebago downtown et cetera um [noise] the governor females going to have something special some of them have live music [noise]\nKnow you can just look that up on line to get all the info happy hour show is zero zero sky urging at high noon\nAnd a skateboard a exhibit on east Washington across the board that's the sort of like a big national thing not just the gallery night\nConnection five to ten pm that'll be cool um and then a\nLot of the shift you burn sure shook him to disarm or she's got a great new album out that's Goshen seven to ten pm therapy drones have a CD release of the band they ask for that starts at nine that's over at the Wyss go\nAnd uh\nAt our in gallery just all ages there I'm next to the bar drug spider unnecessary gunpoint lecture sons of\nRon ... for a pet I guess\nMore Iraq hard rock and me is that one show starts at seven PM\nAt seven thirty pm on communication over it and you're walking\nYou wash your Bible and Lynch local artists combine\nA sea legs David drew in combat now on Japan's Seventy Kim in remote location\nI'm ... I'm Sorry got turkey fast is actually on friday at the Bristol it's not like it had it wrong which is the\nPlace wasn't showing for me so nine thirty PM tricky festive smells teenage means an unelected Rick and the husky and then a\nSaturday Night show is when nobody's in town for the turkey says friday Mickey's has a couple of blocks [noise]\nSo that also on Saturday um [noise] big progress that are for black\nWomen benefits bunch three three sixties bail fund so much a rappers and dance like a big long\nList of folks\nMetal at Boston eatery need metal reaching ... cowboy meeting obviously impair a tour\nUm\nHow he'll elder bar and David Murray is going to be a cafe coda on really street Saturday Night and further up the street a crystal on Saturdays recalls amount of dig down\nAnd the relatively happy hour the hunting and Saturday Night at five thirty and again at a tricky fest night to show is when ... nobody's in town Saturday Night long with washed cavers Alex Wylie coyote\nSo the first night it's like how has he has ... neither of them are and it is it's leather last night Saturday Night\nAnd uh also as cells eases October fest is outdoors music from loving him to ten GMI you're ready to fight and you know it was pretty good ear shot from my house militarized saying American feed that I don't know them or David Ossman biggest ...\nNext door neighbor the ... the local journalists children vegan steak houses the name of their being oh hear them playing\nAll the times in the basement next door and I'm Out\nPretty good ... I always thought they were good good drummer so the playing out out of the ... at five thirty don't mess of cupid six forty five and we'll house\nAnd they're given on any given center from there um and that's it for Saturday Sunday tiny deaths that are at our in at seven PM [noise] of course the ... revolution party from five to eight at the army are\nTaking donations you know we're not turning people away whiskey from ... borderlands Tom castle getaway drivers material boys lyric advisory board we'll fire thing by German\nStudents and uses again five to eight PM parents can bring kids than if they want to ... ... yeah and then also said later that night uh starting at eight thirty\nEasy transition Roman ... and ... at high noon Sunday night Monday got the teachers at the mall house that's a freak show at seven thirty T. M. here I like the team\nThat's not the problem Tuesday ten nine or ... will be at the gym at seven thirty I'm sure there's still tickets for that Mickey's has space tugboat\nAnd products and free show after ten and also high noon as a rock and\nShow Tuesday machinist druids androids attack it starts at eight thirty and then a Wednesday the central ... started to come from I\nHeard time helping ...\nTon none Monroe stomp her and darker and darker era communication ... Wednesday next week\nThen there's the autism society benefit behind new ... ramblers in therapy drones and struck in St\nLouis [noise] let me get Sharon has halted lip Wednesday night next week\nAfter ten PM and then you get up to next Thursday and ask them young red bras fan and chance and ... justice bears and recommended show but also we'll be back here back here in eighty nine or ... FM for you [noise]\nI'm thinking\nSlack oh yeah let's do it for a whole hour alright fifty five minutes\nJust letting you all know how much we appreciate what you do for us even usually of genius or a station so much and we'll do our best even a appreciate you\nHey we're wisely and stay safe to think another person who pledged on line oh well let's do that at least saw from Madison thank you just wants to be surprised for their a generous pledge\nAll right well thank you well we will happily surprised is blue how there's all kinds of swag around here you know ... what it is there's you know trophies yeah there's a pint glasses and\nOld carts old\nOld I met her die as glad to be ... what do you think of that All right enough of the Sox talk [laughter]\nWe uh hope we got all the word out about everything let's see mentioned her harvest festival Saturday during lunch that no he didn't learn how to build the high holy holiday fire farmer bill belly button club is playing now since the\nSince the end of the odds of course and lacking some direction it would not\nI Know its power\nAs you rated than sodium\n... burn all after the war [noise]\nI just stay in the last ... literate to face with eight I'm\nAn artist who has the right words to help them for the book does\nAnd I've had to do so it was many many things that I have to build dissent confess that [noise]\nNot you know I have different how Rochester Muslim world could be if we had the rival atrocities\nWell people were truly understand why they are what they're doing and they wouldn't need any of the ugly motivational\n\nThat's not right to get that book came away it's meant to be\nMile walk so [noise]\nI found a place where this book a long way was needed [noise]\n\n\n\n\n\n[noise] ancient futures two friends one day ten band music festival to Madison Saturday I sold the thirteenth for him that high news [noise] ancient futures is about mixing up ... opening mine mostly focused on say Iraq\nThey bring in headliners Ron Paul over the country [noise] mix for local and regional lax picturing for\nHow heavy metal band way metal should be [noise] those four bastards players primitive old Chinese gothic country music\nCamp vanishing can postpone progressive rock candy and all that ancient history to\nMusic festival Saturday I told the\nSee you know\nI'm using a nine point nine double O. R. G. S. emanates from [noise]\nUh yes different business rubber and I've been staying from a church up the sub genius\nYou to listen to cite go work crews sticks on W. O. R. G. I. by nine if Madison, Wisconsin listener powered radio\nAnd now for a short story kids this is called the war between the futures\nShe if you can guess who wrote us old timers\nWas a limit what's number of ways to imagine the future but only a few of them come to pass the most\nSpike Lee features the ones that make sense and herself consistent\nBecome real urgently unlikely ones that are nonsensical or silly there is a very likely future in which humans have become immortal and have developed the ability to make their everywhere she come true\nBecause they were able to do or have anything they wanted the moment they wanted it [noise]\nThey became dreadfully board and suffered\nAwfully from less listening send on we they learn how to swap bodies with each other just for fun and after thousands of years had swap body so many times they had no idea which body was stairs originally [noise] the people of this is ... feet elite future\nBecame so desperate for amusement that they created devices to see into other futures timelines parallels to their own [noise] one of the other most likely futures was a post apocalyptic\nWarriors of the waste land future in which people drove around an endless desert in cars with plastic domes and duct work stuck on the outside\nOr huge trucks crazily\nFrankenstein doubt of half a dozen other trucks were hold heavy metal bands on 'em howling and shooting things up [noise] in between driving around howling and shooting things up there plenty of time to work on their purple mohawk or build exotic weapons out of hand tools and farm implements [noise]\nAnd did they ever ... [noise] my God you would not believe the smells\nWhen the if the elite future discovered the warriors of the wasteland future they were shocked and appalled\nThey took its existence as a personal front insulted their dignity to acknowledge that such a low brow tasteless and on refined future could possibly dirty up to continue on with it so famous [noise]\nThey resolve that it must be abolished [noise] defeat elite fine we had something to do they created magnificent\nSince death machines that look like glory asleep gorgeous angels which split up and down the front door exposed a thousand fantastic weapons of destruction [noise]\nThe feet elite sent them through portals into the warriors of the wasteland future and the carnage was a ... on issues [noise]\nThe if the elite did not record with was the carnage was meat and drink milk and honey to the warriors and the waste land to them brutal Savage warfare was a mere past time\nThe right of adulthood was simply to go out and murder someone in the most startling way you could think of\nTorture was to them a form of humor and the most admired persons with those who could keep a victim barely alive but in incredible pain for as long as possible in short the feet but we didn't know what they were up against\nThe warriors of the wasteland quickly learn to defeat the elites magnificent death machines\nAnd men to capture them\nThey set their wise ones to work [noise] why isn't a monkey like folks were struggling gray locks and spectacle that has a dozen interchangeable lenses wonderful shapes and colors and before long the warriors were rampaging down the broad avenues of the feet\nElites lovely dream like cities messing stuff up and making all sorts of noise\nBut even kill people lots of them in the most insulting wise than they created imaginative displays of the mangled remains which offended every since simultaneously\nClearly there was nothing to do but escalate the feet elite contacted other futures\nTasteful and elegant futures and enlisted their aid in combat hitting the scores [noise] which was of their own making by the way but somehow they failed to see that the warriors are the wasteland were ugly and stinky and noise and had shockey taste in everything\nBut they were not stupid\n\n\n\n\n\n\n\n\n\nBy uncle doctor own and kinda bought [noise]\nSee own them counterpart and oh though [noise] I Can't remember\n\nThe twenty Eighteen W. or the record write it on Saturday October thirteenth\nFrom one to four pie in the art in fourteen forty four east Washington avenue\nCome down and check out our selection of rock folk jazz and this latest records at rock bottom prices\nAre their final vendors will also be an ... selling their wares while W. or the D. J. spin their best fighters throughout the afternoon the W. or the record right as one of the biggest all vinyl events and stuff and the proceeds from our sales were benefits\nA station that the twenty Eighteen W. or keep record right Saturday October thirteenth from one to four pm that'd be far in fourteen forty four east Washington avenue [noise]\nThen you write ramp over forty years\nW ... Madison and W. or the up and got for sure\n[noise]\n\n[noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n[noise]\nMm [noise]\nMm\n\n[noise]\n\n[noise]\n\nAnd that was the psycho skeletons once again\nA little ditty called popular tight squeeze\nWhy frankly when people say politics I reach\nInfluence in shiny he has a weird crises electronics Christ much like Bob jobs and chief walking\nI was just about to a mention a Bob jobs as I'm having his origins and something completely unlikely\nWell I mean he has some short he was he was born in the Midwest but I Can't stay it's not ...\nBut the um\nThe actual engines are icon that we're all familiar with\nWell you know oh we've we found a predecessor to photograph\nThe jobs had the classic jobs has lifted off pattern uh that that we use regionally be ritual limit you only venting and try to small it was the yellow pages clip bark\nAnd a fire went out both sort of same conflict in this book and we just knew that was\nThat was a but subsequently about five years ago\nSomebody found it in an old a couple of different old newspapers from us of small Virginia town they found ads that have the photograph that clip art was made from and it is creepy as hell you can superimpose them\nAnd er and people have done this and do everything winds up exactly there's the white ram around the park glimmering as hair the\nDeal and he was actually he was for older and the photograph and it strikes much fuller and he looks like a normal\nAnd ... and if this was the original law yawning to watch\nVersion he looks more than you\nBut if this was the original image about dogs are you sure it was from Virginia and not say Canada and uh and and I'm sure he didn't have five bodies\n... drive or none of the only parts were seen any sign of the ... newspaper Arabs and they were Arabs for her name was for barber shop and one was for a party or tobacco\nFor you to tell you there's nothing better waking up in the worst thing look at the violence like\nYoga part yes I'm Talking about what used to look at the first thing that was you know for little dogs yeah\nHow's it going down to a very well huh oh mom\nHere in the wild I've been in measuring foraging if you will me too I just went to the ah [noise] ah [noise] the far east Asian trading company and bizarre I did the dollar store\n[laughter] dollars or the the the gyms or the orient prevail\nI um I I found I found some things\nToday and there is so amazing I got\nThis thing it's like a it's like the head of the mayor and you stick it onto a staying and then it spits out near like like the kind that you see on on the movie pet cemetery like you like fog is from a but it's supposed to be able to help you breathe so I think in Columbus ice\nBears the bears on the fire I think so I think so it makes my sinuses open right up and ready for bears I got a frozen food maker\nMy gosh you do that's a that is going to be they will lumping may ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHave them like show up on my doorstep\nYeah but then you'd have to use those companies that make that one guy really rich and killed whales\nYes Kim trials are just condensation\nIt\nMe that I have to explain this to a population that used to be space faring not so long ago I shouldn't also have to explain that magic not stage magic mind you but actual magic\nJohnson work friday the thirteenth is just another day\nMercury in retrograde means nothing at all there is no and documented persons crisis and they're never really was one new or was there a credible terrorist threat afternoon of September eleventh two thousand one\nYou were told that all these things are true by people who have a vested interest in having you believe anything other than actual reality\nSometimes not directly you may have in fact been\nTold that huffing essential oils\nIs the thing by some other hippie but that hippie\nHeard it from somebody else ... Paul ... maybe for obvious reasons or maybe the Koch brothers for totally different reasons\nOr maybe probably\nBoth the reason this sort of crap it's easy to sell to otherwise intelligent people is that rewards the receiver in three ways one they get to know more than you and tell you what without all the bother of going to medical school\nToo they get to feel like an insider like one of the cool people the privileged few that no the real truth\nAnd more to the point they can congregate in get validation off of each other\nNumber three they can ... near the mundane who still believe in penicillin and other actual functional things\nThis is why I hate you this is why I shouldn't be allowed to walk around with a two foot deal do with reality written on it stumping hipsters yeah\nBeaten to death with a deal do sounds awful when the police have to explain what happened to precious Dakota or scout or whatever Gen x named their kids but there really isn't any choice\nWhen looked at from altitude it's clearly self defense you\nTo W. R. T. unite when I think people pass the W. ally turkey is a major part of medicine well Madison and they cannot bear to think it went south central Wisconsin would be like without a unique blend the new music programming musical laughing world\nYou can help you and I can come\nYou mean W O R G you will or Trump for more information streets cause she can show that six zero eight two sides to zero zero one during business hours Monday through friday\n[noise] [noise] [noise]\n\nHey us ... W Archie bill is rather you know through name Monday seven PM address our we'll be talking about math regards the racial\nAnd having a guest on the line with the music you know this group that you're doing it one day that would be a W are the ... ...\n\n... is W O were these commitment to community access to the year when the music on the exit never do not represent the abuse mentioned its programmers or the board of directors\n\n[noise]\nWhich they\nShe\n\n\nCrowded\nJust that you\nSchool and\nShe's\nBeen named ... ... ... ... he he he he can eat some\n[laughter] our\nIn your car\nAnger and bitterness and members of your current and they're\n[noise]\n\n\n\n\n[laughter]\n[laughter]\n\n[noise] [noise] [noise] [noise]\n[noise] hearts on fire mostly looked like [noise]\nI mean that that's that was seven do\nFlame from the ... [noise] so the late nineties so do\nI Would the first one I bought before that the ... the ... Clearwater revival banned [noise] fight fire [noise] usually a nugget nuggets box got that from completely recordings sixty four sixty seven [noise]\nFor that Iran would [noise] I can seal the fire [noise] might recognize the other guy singing their [noise]\nHe's the co writer [noise] Mick Jagger I think the stones actually did that on one of their records at some point [noise]\nRun what's first solo record I've got my own album to do Keith Richards unique logging Willie Weeks [noise] pretty crack banned [noise] this is pre stones or Ron would just buy a year before that the meat puppets with like a fire from live in Montana\nRegular disc Nineteen Ninety nine very excellent [noise]\nDemonstration of how good they were alive we started the show with deep purple doing fireball from fireball Nineteen Seventy one classic line up [noise]\n\nIf you got fired songs I have a big list of them [noise]\nMany CD's many records many files\nWere going to be flaming on here right now with this guy [noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGo let's go\nYou know he says fire in the song but it's not really about fires not as far as I can tell [noise]\nThe vinyl resting place on the other Mr s lifting some fiery fiery music from all over the world inspire will carpets and Tibet set with fire revenge of the goldfish [noise]\n\nWhat about the same time as a the ... song here will do that similar thing before that talking heads\nLove building on fire from their stand in the Vaseline come\nFirst place I heard it's great early song with some acoustic guitar before they were uh all sophisticated and stuff we started that set with fires first the fanfare fire home\nAnd then fire itself you don't get the full effect of you just hear fire which is a great song got here at home where he suddenly on fire and then it makes sense that he's going to want you to burn as well\nThere are a lot of songs fire ... as the title I am going to play a few more fires\nAnd then I'll probably play fire and then maybe fire but I'm not going to play fire that was not going to happen well maybe I Will maybe if we get to that you might run out of tune into mental have to\nCall a Bruce Springsteen so let's kick it off with\nMaybe the most famous fire I don't know a pretty famous\nI suppose the Aryan song by her now\n[noise]\n\n\n\nMm [noise] than than the disease [laughter]\nThe probably\nThe best you can do to\nActually see I'm not\nReally seeing\nThe news [laughter]\nWhoa [laughter] you don't mind when you're well look I Want to want to limit the next two year old\n\nMan [laughter] sometimes you know\nWhen I used to be\nThe amount of money [noise]\n\n[noise] [noise] [noise]\nClean [laughter] [laughter] you must be\nPhone\n\n[noise]\n\n\n[noise] she [noise]\n[noise]\nMm\nMm Mm Mm Mm Mm Mm Mm Mm Mm Mm Mm [noise] [noise] [noise] [noise]\n\nYou know that it would be on through you know that I Would we know that I Know it ... it was the lead to a girl we couldn't\nGet much lie or a mom and dad and live my life I'm ... I'm not a bad then that on by a\n\nBy ...\nNo no while lowering the my\nNon and we go\nAnd ... may come up and be ruled by a\nLong way like five\nA long way to live on my mind a\nLot of that that a lot on my uh\n\n\n\n[noise]\n\nWhat man you know\nMaybe\nOne now\nMy my\nMom made\nA\nOf land that na na na\nBy my\nYou better not you but I'm not gonna get might\nYou want on the ground you know I mean the way along\n\n...\n... a a a\nOh ... oh my\nGod I didn't know whether they smell are very whether a ... a ...\nAnd ... to ...\nBe saying to so many\n[noise]\n\n[noise]\n[noise] I\nJust brings you know ... ... ... or the night you that much but just listen to the ... will take ... ... ... ... ... ... ... ... or see this\nFor instance you allowed to form a nobody or to you or and then turn it in with your registration\nForms or region and the lakeside Bruce Willis street to no need to go and pledges W O R D D jays will be rocking billing boulders compete for friends and three skill levels you don't need to be wherever to win Mobil ers will\nReceive an old boys and with the ... or do you go and find tickets to the to your friend is rapid more tickets are available for purchase of the events bully go strike rape in front of free beverage after boiling to enjoy\nThe movie version and the prices are going on for thirty five dollars and free proceeds benefit there'll be bored community radio\nThat W\nNine been turning them into the sports six PM Lisa shoes and she will be [noise]\nIf you love great jazz guitar than mark Sunday October fourteenth on your calendar when the Wisconsin union theater presents an evening with pat Mancini Shannon Hall at eight pm\nJust releasing his first album bright size lights in Nineteen Seventy six the denier says devilish himself as the preeminent voice in jazz guitar for two generations of musicians and it's worked with great just like ... Coleman Michael record Jim Hall Dave Holland red Mel do in\nMany others both in and outside of jazz community with over forty albums to his credit and the initial rate rest until they both\nAs an instrumentalist and compose incorporating a wide range musical idioms in sounds you wanted to speak in little league and his cohorts captain evening with pat ... hall in the Wisconsin memorial union Sunday October fourteenth at\nEight PM keeping time with the music since Nineteen Seventy five years W O R T listener sponsor community radio in Madison [noise]\n\n[noise]\nOh I'm Glad to\n\n\nBe made\nFor access\n\nA man and the wages\n\nAnd\n\n[laughter]\nAnd the midnight here in the final resting place [noise]\nW. R. T. A. yeah we're not at the Madison listener sponsor community radio worldwide W. R. T. F. M. dot org gee [noise] fire everything is on fire babies on fire and maybe we'll be on fire leader no doubt [noise]\n\nThe fact that last set the bookends of fire what else to live the it's a medley of six was nine and fire we skipped the six was nine chart that wasn't relevant although it is very good live in double in Nineteen Seventy three\n\nThat their belt thing in the six or nine\nPart and then the one that gets on my does a little Hendricks before that the picks the Boston no addict for fire from Nineteen Ninety [noise]\nWhether the Rolling Stones Amano mix of places\n\n\n\n\n\n\n\n\n\n\n\n\nHow\nCan you do fine she\nRunning by your pre K. picked on by a big thing\nThat people who\nA game and then my every day and you can do\nUs to talk about um [noise] you\nAnd that gets on my every day by a three day and then as\nI said to me\nBy my bed and the guy every day we read them [laughter]\nRun\nNa ...\nA friend of mine that\nI was back in touch\nBy McCain side\nA liar liar game\n[laughter]\nMy dad and the fighting and they're just like the\n[laughter]\n\n[noise]\n\n\nYoung guy\nOthers you know\n\nLong time so I'm On a hot summer night and\nIt would make you want to come back more than I\nCrawling out of drove three hours to buy a\nMe and the\nThe team\nBe the by the ... the ... will be the by the ... and the little league the fire department and they will be\n[laughter] [noise]\n... na na na na na\nNa na na na na na\nNa na na na na na na na na na na na na na na na na na na [noise]\n[noise] wow [laughter] wow\nWow and it's\nGod [laughter] [laughter] yeah [noise] [noise]\n[laughter] [noise] get a bad guy got mad [noise] come on [laughter] I Know [laughter]\nBack down\nBy\n\n\nA mom\nSee them that I find my job I had to hang on I was down in my mind you know\n\n\n... ...\n\n\nMy family is from my mom\nDad or mom\nLongmont shown on\nThe thing that I\n\n[noise] no\n\nThat's why I spoke [noise]\nWe got fire fire everywhere just like water everywhere everywhere you go to fire [noise] bill Marshall Tucker going on in the background here [noise]\nWhere did that set the shelter re but not heard of like the lives for their own that more than me EMT police and fire department not so much a song about fire but that's by her the title and it's a good song from her door girl CD from last year\n[noise] before that dealt with in the dead milkman if you love someone put them on fire [noise]\nSort of reggae punk anthem from their regular collection Nineteen Ninety seven\nFor that exceeds the great fire from ...\nWhich maybe three there for a studio record [noise]\nFor that got hit by voices from the very first record\nNineteen eighty four\nVery early devil between my toes before\nBy powered put on the British accent and they went into the basement they record the best record in real studios couldn't figure out why didn't sound right probably because they weren't very good yet but also because\nIt's something else to figure out a portrait destroyed by fire from the sky goal started that set with the move fire brigade from the twenty two thousand seven re\nMaster of the first record three disk set [noise]\nThe whole first record mano with all of a single room in the whole first record and all sorts of weird\nOddities and just to and then a disk of live stuff which is pretty good as well they were hotlines band\nBut never made it in the states the great last British Band as far as I'm concerned [noise] to kind of out of twenty sensation here [noise] we haven't really dipped our tone of the country saying about halfway through the show it's about time slowed\nDown a little bit down that some longer fire assortment songs [noise]\nComing up shortly after a little a\nGram Parsons here and the rest of my stupid sixty thousand one\n\n\nNo no no man to be\n\n\n\n[noise]\nAnd the shoes are they going to be\nThey a lot of a gun ... that ... minute drive\nMaking oh get tone but I live in a bar to own a brand new day in the Tampa\nHas been done and I don't\nYeah like we're saying that you may have been a big dinner we\nDo both love to read and the wood don't buy\n\nThat\n[noise]\nAh my hot rod so we get paid\nWhat they're not they're betting what don't we don't bet on the one on\nOne plane went down we have the time all rather that no would don't\nBy ... by the ... the ladder to Mars thank you guys doing fine average\nJoe and drew a\nMap sand and I'll be darned well we get along with the law allow it to be right back wow in Latin word oh my\n[noise]\nInches futures to one day ten band music festival for Madison Saturday I sold the thirty\nFour pm a high news introduces as about mixing up ... opening my mostly focused on strike hard rock and metal electronic\nThey bring in headliners run all over the country it's real milk and regional lack\nHow heavy metal band way metal should be those poor bastards players primitive oil giant got their country\nMusic camp fantasy and killed postpone for Russian Washington DC and more answers sisters too [noise]\nThe band music festival Saturday I told her\nGiving you all know live music eighty nine point nine double O R G ... some ... [noise]\n[laughter] [noise] ... productions present on Saturday October\nTwenty hours from New Jersey church who I Am down some of them [noise] not that there's a punk rocker will enjoy\nFeaturing fourteen fans are truly not dead yet we're bastard ... from Madison lines twice or Indonesia jump show more gays from Wisconsin and others from Minneapolis Chicago such as much worse hellish view more flags the seaside stomping grounds coronary MB uncouth should\nNot stress too was on Saturday October twenty or from human shelves to AM EPA knuckled down solutions twenty five ... in Madison ...\nW a large ... Madison and W. O. R. T. S. dot org [noise]\nMan is\n\n[noise]\nGreat ball that are that was William Safire as a younger brother never met you never heard of him\nTwo countries that there are groups the cake William sit in the woods on fire in the eighties I Believe from a millennial questions before that Loretta Lynn and on wait where they spend a lot like a\nLike a lot of people in that air I guess so that was the\n... I mean you know I Would have sworn it was George and Tammy had I not looked it up\nAfter the fire is gone\nFrom her millennial collection I mean ...\nSandwiches in there was a threat from a more fuel for fire for transistor radio [noise]\nAnd started that set our gram Parsons with them in the Paris hearts on fire [noise]\nBy the brothers Bryant's reviews angel second filthy before the ... of the desert the background here during the ball of fire and it's like everybody watched the show\nWas on last week with while Ritchie and strike was on the week before that some fun\nReally appreciate people supporting\nCommunity radio because\nWe have a lot of fun doing this bring it to you worldwide southern\nWisconsin as well so let's get very carefully for the heart\n\nIn in in you know [noise] [noise] [noise]\n\n\nYes [laughter] [laughter] [laughter] [laughter]\n[noise]\n\nOh and then you know the whole\nBegan making da da da da da\nDa\n\nDa\nDa da\nDa da da da da da da\n\nDa da\nDa da da\n\n\n\n\nDa da da da da da da\n\nDa\n\n\n\n\n\n\n[noise]\n[noise]\nFCC lie for example ... see this role now will\nHarsher and no question Monday ... October Fifteen eight thirty PM at the high noon so little money ... empty seat the band plays bass hardcore punk scene about far left socio political ideals express\nThe animal rights gay rights\nTransgender rights for racial equality and anti capitalist conviction just rolled as a hardcore punk band from Chicago smell harsher John ...\nTheir home zone is stole Wisconsin's no question\nThere is a hardcore Sony\nFast and we see this ... you know harsh of an old question among day October ... thirty the I'm ... Hi keeping you informed on all\nUsers around the capital gifts was eighty nine point nine W. O. R. G. F. M. an HD Madison community rating [noise]\n\n\nAnd you're listening to the final resting place on W. R. T. eighty nine point nine in Madison back porch broadcasting W. R. E. F. M. dot org gee worldwide ... in Bangkok right now it's just about one in the afternoon\nIn a big hug and how you doing [noise]\n\nLooking for like a ... a version of this but it's pretty good way to the set with ring of fire Johnny Cash classic in by his wife June\nCarter had a dream about foreign [noise] horns on a country song can you believe it works really well\nBefore that the purple made their second to parents tonight into the fire from the purple and rock Nineteen Seventy\n[noise] picked a set [noise] [noise] [noise] [noise] ... off with milk and jump into the fire another very famous by her song or\nA\nLot of the famous ones there are lots of not so famous ones I think we're\nGetting a good coverage [noise] a good mix of both [laughter]\nI\nJust stepping into the want to\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTo\n\n\nMan and\nA year\n\n\nAnd uh you\nYear but uh\nOn an island and I was interested in [noise]\nFor me to do is they\nA new\n\nBook as a\nMatter of\nTrying to use it as\nA society a\nThe ground\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKnow that's true [noise]\nThat bonding and\nThe ...\n\nDa da da\nIs there anything [laughter] [laughter] that we have to talk about that [laughter] we shall not to go out [laughter] yeah ... the loud [laughter]\nYeah reopen throughout [laughter]\n\nThey do or\nNow now now they do\nThat [laughter] [laughter]\n[laughter] but uh\n[laughter] you know what I'm saying then about him [laughter]\nYeah we'll thing now though [laughter] down now [laughter] yeah they don't [laughter]\nI Know and for the phone call\n[laughter]\nAnd then [noise] they're somewhere around there [laughter] [noise] after a while and\nThen turn around and now they're saying that though [laughter] yeah I mean those those out and [laughter] they don't go out and\nThen when the um [noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n\nNew here with me the other one's dressed in the final resting place\n... to going on in the back [noise] produced by Mr Brown and you know you can hear with all the\nKeyboard and stuff\nYou may not be popular anymore but uh just record this record did it for me still doesn't do it [noise] you got it as my bed here we figured\nThe vet said put some fire bans not as many as the water banned by her head's from here in town dads theory from fire heads their self titled [noise]\nFrom late last year I Believe\nFor that fire hose sometimes if in\nMemphis tea Nineteen eighty seven\nFrom the ashes of the ... men restrictive kind of a mess cigarette is good [noise]\nBefore that fire water\nI don't think I'd ever listen to so I got acquainted with fire water Borneo from the golden hour on blood shot [noise]\n\nFor that they would do away with the song that's not really so much about fire [noise] but maybe after the fire [noise] who I could play after the fire versions of that [noise] from scary monsters Nineteen Seventy nine we started with brain you know [noise]\nBabies on fire from here comes the worm jets all the you know CDs from the box skip I played something else the other week and it skipped immediately [noise]\nLook into that [noise]\nAnd cleaning going on around in one twenty two\nThat's more stuff for yeah here are loaded will be in short really take over the airwaves and take it if I Am [noise] makes everybody that's called got another request and they're going to put on a couple of more he's the vinyl the spin\nOr more things to go dig out of the back [noise]\n\n\n\nA couple of bands are making multiple parents is here [noise]\nSomebody that was going to come back with another fire song which I thought of this afternoon and I was searching my brain for fire [noise] the search for fire the quest for fire as it were [noise]\nYou do the same shows you got to dig deep [noise] look everywhere [noise]\nI'm not sure what the next one is I don't know who's going to the earth [noise] or air I don't know if you could do a whole a show about air and be a little tougher than fire and water will see a couple of shows I wanted to do for a while so\n[noise] they too [noise] materials shall we [noise]\nDon't push them too far [noise] tonight [noise]\nNumber here and there are\n[noise]\nThe the ... ... ... ... ...\nThe B. B. B. B. B. B. B. B.\nB. B. B. B. bing bing bing bing bing bing bing bing bing bang for your\nThe new the new that's Jewish and be the tea or through it's\n[noise] I Know a guy brings me to find\nNew been shown me to do the ... crew say the the big bang rejects or be\n\nAnd the the the the the changes in the in the ... the ... you know some\nOf the ... the\nSame way and a cougar on some of that is a need to be\nA cause the law is a ... a\nCity in the ... the same as the ... the by the way you so much going on in a human\nTo swing and flavors at all the local ... beds in Nineteen Seventy five this W. R. T. eighty nine point nine FM listener sponsor the rate and me\nAnd [noise] [noise] [noise] [noise]\n[noise] I'm right\nWe'll call you know the radio [noise] and you know for me [noise] and then I say I don't like it\nOr not you know\n[noise]\nOh yeah [noise] fire [noise]\nTwin sisters took Bruce Springsteen [noise] long and\nTurn it into a fifties crews and sort of feel [noise] you know those guitars have lots of harmonize or is on I'm\nTalking about that earlier [noise] you can tell when the guitars are from Dr [noise] what effects are on them when we kids [noise]\n\nLinks were hanging out with me tonight and the buying resting place because of shops here twenty minutes [noise] places more fire stuff we did that that was the Jesus Mary Jane catch fire from Chinese dad do Ninety two [noise]\n\nBefore that Ben hailing from van Halen on fire\n\nA song that I did not think of the records of hope for the first time I've been here for the set off the subject do\nSo under fire from bubble scrape Nineteen Ninety three [noise]\n\nThere are many fires burning times you've got to put him out sometimes you've got to keep them burned in\nMany different kinds of fire you can have [noise] finish it up here [noise] still leads scratch Harry [noise] he's going to set your so on fire [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\nBeen done but they do and [noise] the\nMorality in da da da da da da da da da\n\nDa da\nDa\nDa\n\n\nAnd\n[noise] [noise]\n\n[noise] back in\nThe water and [noise]\n[noise]\n[noise]\n[noise] and [noise] and\n[noise]\n[noise] [noise]\nThey [noise] they gave me they called them\n[noise] can you can [noise]\nPeople don't bring them\nThe [noise]\n\n\nThe\nAnd you\nThey can speak now can you say\n\n\n\nThen\nAs long as\nThere's no way that you know\nI said get around my grandmother\nWorry pry into\nSay that the\n...\n\n\n\n\nFor\nMe personally you know\nAll day ground aid you planning to spy on the channel to find one day\nGoing to change me\n\nA little\n\nMen ...\n\n\nBe repaired there will be no other warning you are listening tour W O R G eighty nine point nine FM Madison\nWisconsin listener powered radio right he's a\n[noise] did you get a free\n[noise]\n[noise]\n\nOh reading through the hello and welcome by\nThe time it's too old to and you are listening to ... or ... eighty nine point nine of\nThem it's time for Phoebe weird things on your host cardinal damn I Would like to say thank you to everyone who's pledged over the last couple of weeks in\nThe last I heard we came up just just a hair short so why don't you go to the inner webs and and you could be like James and you could be like we saw is where you could be like Matthew\nA very generous donations you know where you are right there are a W. R. T. S. dot O. R. G. [noise]\nWe did pretty good the last couple of weeks [noise]\nIf you didn't have an opportunity hey there's still a chance we love to hear from young [noise]\nLots of great we used to say thank you but we can't do it unless you're planning to take that into consideration you got a little show bowling nightmares lots of other ...\nHey you know what it was dark oh dang you guys have a good Johnny Dark days or Thirty years ago in October second in Nineteen eighty eight rest in peace and rest in peace on it\nNot quite the\nLong long time ago\nA galaxy far away now was a direct attack\nAnd I thought man why gun gene Google top the senator arrangement into maybe cutting them loose they're\nVery sponsored didn't thrill is\nThey lock the doors in the right to kill us years came from that again\nThe jar jargon but then\nWe took the bomb go from the scene and we went to speed this eight and we\nWere all well the one ... to ...\nThat's the way we found this\nOh mom line here in a good\nMaybe ... Sunday later now it's just the ...\nMommy by\nGoing to be ... ...\nGoing to be a gym John\nJohn John saving any ...\nKnow Steve Harvey ...\nThey are\nRed line no rebuild be three in Rio and um how bad is fun to go and we were\nMoment and job a burnout battery\nNo man my line of beer and a great guy maybe they are done they later down the ...\nHave a good mind paying\nGoing to be ... ...\nTo be ...\nCouncil renewable wrong to\nMale any my\nBay and now the the big ... your\nIn my mind here\nTo be ... or\n... ...\n... ... ... ... one or two ...\nSpring we would have like this that\nUh uh uh [noise]\nOh [laughter] [noise] [laughter]\n[noise]\n\n\nAnd the twenty Eighteen W. R. T. record right on Saturday October thirteenth from one to ... at the art in ... Washington ...\nCome down and check out our selection of rock folk jazz miscellaneous records at rock bottom prices\nAre their vinyl vendors will also be an ... showing their wares while W. or to DJ spin their best fighters route the afternoon the W. or do you record right as one of the biggest all bundled up in southern Wisconsin and the proceeds from our sales\nWill benefit the station that the twenty each in W. or to record by Saturday October thirteenth from one to the end of the art in working forty ... east Washington avenue spinning your right\nAround for over forty years maybe W ... Madison and W. or tia ... [noise]\n[noise] [noise] [noise]\nThe the two thousand twelve award winning album cheddar revolution has a sequel to celebrate the release of the new cheddar revolution non diverse\nJumping on Sunday October seven from five to eight him as a harmony bar Annapolis\nSongs of research in with a compilation of the original song by the nuns musician written to inspire citizens to rise up and reclaim our state in the upcoming election this all ages gallows will include performances by with the farm can moms with borderlands getaway driver material\nBoys German art students in so many more the song research and album released garden is Sunday October seven five eight ... at the harmony bar an adequate\nFor more information and the full banned list visit Wisconsin protesters\nZone dot com this is W O R G A nine point nine FM listener sponsored community radio\nShack\n\n\n[laughter]\n[laughter]\n\n\nThat much to do and we've got\nBall ball go all out\nAnd bought one by one now\nAnd\nAgain\nUp to do all the da da da da da da da da\nChange\n[laughter]\nDa\nDa da da\nDa\nDa da da\nDa\nDa\n\n\nDa da da da da da dum la\nDa\nNa\n[noise]\n[noise]\n[laughter]\n[noise] [laughter]\n[noise] [laughter]\n[laughter] no no no no [noise]\nAh\n[noise] ah\n[noise] um\n[noise]\n[noise] ... [noise]\n[laughter] so\n[laughter]\nUh\n\nI'm\n\n\n\n\nUm\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\nUm [noise]\nGoing on\n[noise] [noise]\n\n[laughter]\n\nBy the way to the bathroom and I gave them when they were living in a pretty long though we all are they just the other\nAbout it and they said about gay but he's still never done one of my my buddy he did that because in on a friendly but with by by that when he was running for mayor with other than a liberal you buddy playing there with\nTogether and what that means I'll meet and they don't know if you've got to be ready to go you're going to live in the body you gotta live with anybody got a lot of buddy bonded\nNumber in the mom and dad you know bad\nWhat he wanted them or whether they're going to therapy or the apple ... been in a mental thing of the race in a case with a great need support born in the bars of hated the ... maybe another minute meeting with the ... the training that I had with him or what happened to be there to think that later when it does seem ready to do in\nA poet during like I'll go to Michael in parts of the pain but while they're going to blow things up in the same for the weather there now and then the habit never knew what the richest man in the Senate about summer about going to the picture editor for during the fixture\nBonded novel again the Bob and then you had a bad\nYou know I get a job we'll then within minutes out that way then you're done with the title that they don't make the ... that we did something above everything with a double by the gate in love and they'll get back up again the gilded twenty kids would be able to do with the money that you\nNever know what to do it in my book and the parents land among the during the ... where am I really had the when the sun ... more than ... Taylor and even even being able to go in my town they offered emerge\nOut of you ought to be more limited amount of kids\nVote in a while but you know by getting them saying that you know again my gang bonded gumbo yeah a bomb and you know a bad\n\nYou know the doors you know\nWe're no longer if it should never crossed my mind that you're done and if\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\nTime in the real dream and you are listening to be mean were brings on W. R. G.\nEighty nine point nine abound\nMadison, Wisconsin la\n...\n\n\n\n... oh\nA [noise]\n\n[laughter]\n\n\n\n\n\n[laughter] [noise]\n[noise] [noise]\n\n[noise]\n\nTiny tiny ...\nLittle ... now that Jon Kyl enough you know man I mean I don't know how many [laughter]\nNa\nNa ... when the\nLike I'm actually a drawn out enough to patch ...\nListening to you and I'm not in a you know one\nOn and on and on top of that my son ...\nWhat I\nMe just ask you if\nI didn't I didn't I didn't know the idea that you do that\n\nNow [laughter]\nI\nDon't I\nOut\nRegistration is now but for the W ... or the night and you heard of it much\nThe shows that many worthy will take over dream late once again and then the river but we made it easy to bully or be this year\nWritten below the Mormon nobody or do you get them done or and then turn it in with your registry the forms are also maybe liberal state you need that like Britain where the street you know need to collect pledges\nThen the ... or ... D jays will be rocky in the late ... he brings in the three skill level you don't need to be the Web or to win ... will\nReceive but keep the old ... nobody work you will go and buy tickets to the your prize rebel more tickets are available for purchases the event\nThe strike it repeated front reserve brief beverage after being like to join the money for the parties are doing it on for thirty five dollar proceeds benefit there'll be more community radio\n... it'll be eight or nine being ... on the board six PM Lisa shoes will be [noise]\n\nMTC lied Seneca lake mountains on Sunday October fourteenth at eight and the yeah the\nGuy is the brainchild of Columbus ohio musicians that little ... latest album pillar of nah sports memory and remember in ... and other functions of by using the idiom of folk\nRock aggravation cynical type of rock and ambient sound and other genres to create a new musical direction openers traced mountain a personal\nProject northeast American Songwriter Dave renting that you've got to go with race mountains are hiding settlement on Sunday October ... at eight pm his show is Eighteen and bring you a wide range of music for over forty\nYears there'll be a working eighty nine point nine of medicine and there'll be ... FM dot org [noise]\nWrite little Jell tonight little nuts and blew the DJ Tron little Christophe to Babylon little three thirty ... there's an evil set up music if I've ever played one I have to crate just went up to plus eight just to keep up the pace oh let\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThat's weird [laughter]\n[noise] that one [laughter]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\nWhen\nYeah\n[laughter]\n\n\n\n\nHow to\n\n\n[laughter] yeah\n\n\n\n\nIn the long\nRun\n\n\nThe clean\n\n\n[noise]\n[noise]\nShe said I\nAsked\nBottled\nShe [laughter]\nShe [laughter] she on DVD\n\n\nNow you know\n[laughter] [noise]\n\n\n\n[noise] [noise] [noise]\n\nThat ain't you ... to raise a one day jam band music festival Jim Adams and Saturday I sold the thirteenth\nOr OPM the miners angel future too as about mixing up ... an open a mine mostly focused on like Iraq and metal electronic they bring in headliners run all over the country next for local and regional lack\nBasic drink or how heavy metal band away metal should be those bore bastards perimeter of old giant got their country music\nAnd vanishing good old all the rest of the law Indy and all that answer your job is to jam band music festival Saturday I Do look both the\nBe in your in laws live music eighty nine point nine double all the ... the ... [noise]\n\nTo the good thing to do\nDi di di di di di di di di di di\nOr at least\nFor the [noise]\nThe truth or or\n[noise]\nOr approach for sure for\nSure [noise]\n[noise] [noise] [noise]\nI uh uh you know if\nSee on the way I'm going to be on\n\nFine\nNot really [laughter] not concrete [noise]\nYou know\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\nYour whenever\nYou want danger uh-huh so you would think\nYeah you are in danger little my life with the thrill kill ... actually a good spirits and I'd see bad spirits\n\nNineteen eighty [noise]\nWe heard from swans we heard from rubber oh\nSome skinny puppy\nRadioactive goldfish and Marty in that sense it's a break your bones cranked up the state\nBecause we're ... when it about two hundred and Seventy BP I'm there for those of you who work keeping score\nThe Chinese for if you're a you're listening to feed me weird things with your old colonel in\nIran W. R. T. A. nine point nine of them Madison, Wisconsin how about some flying lizards [noise]\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nLittle\n[noise] [noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\nYou know what that means it's time\nTo remember things theater the mind this week they will be enjoying wires theaters how can they be two places at once [noise] when you're not anywhere at all [noise] would you like this little jam [noise]\n\nTo just happen to be a little uh\nAnd [noise] you know it's like the last thing that you would expect to find [noise]\nIn a [noise]\nTotally and completely random box of [noise] lab ... seven inch records [noise] I decided to take thirty seconds to flip through and see if any thing caught my attention and sure enough Spanish popcorn and [noise]\n[noise]\nYeah\nIt will be enjoying this one all month long\nAs we lead up to an undead dance party parties seven that's right it's our annual Halloween celebration invite your friends going down in October twenty cents right here I mean we're things [noise]\n[noise]\nOh yeah if you would please [noise] do that then you\nDo [noise]\n[noise]\nThat's right and it's\nTime to land inside the theater the minute she mean weird thing\n\nI have friends ... Ross bought bought one of the world's largest new ... the news ... motors here in the city out ... and ... I watched it go get the accurate on that race car why are we are about ... always need for when ...\nGot it and about ... ... and ... minutes an hour from our only academic Mac and rain and ... with SARS cases languished on them\nOh my ... Wainwright moly five dollars and eighty money may run out of the week right and we got never Audrey thank you thank you I Can't wait to get away from it all wow All right well they know inside Europe you know [noise] thing\nI heard the guard but what we're the bully lie director I designed with your mind and mine were inside during all weather climate control and red blue or green when a special laundries endanger indicator level\nWith their guard your own personal remote control but there is I got our TV with ... ... just read your mother barred press the button right there under the handy laminated ... wild west on record with ... ... ... can I get your\n[noise] [noise]\nAnd I shall resign night you know I don't believe in flying a little blue ... and I get a little more orange and if they want your regular wherever I go under the trigger a second second got to get to safety or [noise]\nOh [noise] [noise] [noise] I think I've looked at the muscles on that too is a Muslim that era you know\nSo [noise]\nThat they're they're not like there's more ahead oh yeah I thought I'd see this one [noise]\nWhere where's the basketball huh All right next to the ah radio that completely modulated would do a lot better right stereotypes maker dental compatible with your am\n[noise] [noise] [noise]\n\n[noise] my brain and\nWe only have ... FM over here I'm trying to do\nWas get in an election in almost every way real life than with a couple of oh let's row boys who told me I don't think you'd find humorous thing a lot more\nAbout the new CEO Don romantic boom open in the mind is Johan although it is but that [noise]\nRow to wait for them to be on that FM listening I\nHope not done yet live right here in Grand Rapids my Internet only automatically manners start ... can I get to dilute it down the road got narrowed down where you know we\nWere not your motor vehicle and then they got to know what a lot of his own is not going to be a little closer\nNow\nAnd I don't know why why why I like I said well wait a minute I learned that my mom\nRainy oh All right yeah\n[noise] okay I'll get the teacher no no no wait living off from it\n\nYeah yeah I have seen that one guy got parents don't\nReally watch that answer keys\nGo by private land happy motoring back on a freeway which already right right [noise]\nWell you go\n[noise] my sweetie [noise] don't know how\nCan you be in two places at once when you're not edited ... but I think I'll get this\nOh baby a spin on the freeway white [noise] entering freeway it we got [noise]\nEmergency party [noise]\n\nMerging buses ahead giants slide Nineteen hoses underground parking business too easily access [noise]\nGoes only had\nA dominant jak Strasburg blame one reaches but I'm the only got ... by virtue and look freeway and nor from when I go north or don't want to take the chance to see the more expressway west\nI don't really kind of if you live here you'd be down and a little selected living goes easy okay low freeways this way and that sort of\nYeah I think I'll take the old I Love less traffic [noise] antelope freeway one mom clean up our opinion poll that low ... see what they regard quarter mile ... you're going to have to really wanted\nBugs wipers for all relate ones the temperature and climate contract low really ruined and see what kind of climate I can get low freeway once winter wonderland\n... wearing fever\nIndian summer freeway one tropical paradise regarding paradise I think I'll give it a try\n\n[noise] wow well I grew a tropical paradise\n[noise]\n[noise]\n\n[noise]\n\nAsk him oh Mr policeman what\nMakes America great ... is candy wrapper that only ... you were writing all day and\nAge what was that was done well go well\n... ... ... ... with no just as long as you're a ... cent chance in go sing gigs and holidays [laughter] oh no\nIt's a matter of buddy just remember Abraham Lincoln didn't die in vain he died in Washington DC I see well who\nAm us anyway where one of you\nYou're one of us I think maybe ... well how do you tell I mean how do you know for sure how do you ever really know they didn't\nAsk questions like that back in Seventeen Seventy six no they didn't have time like Seventy Seventy six bugging them Annie Wu thinks boy they were too busy singing songs like\nYou'll have to fight the fire just feel as though they\nDo that for much some of the fall ready dead and my son is a fair trial in three\nWhen they start out what are the climate\n\nHarming don't want to be an actor [noise]\n\n[laughter] gee\nGrandpa how did you come to her defense in those\nDark days that\nWhere they said they came from the endless plane July away the loans from cranes of Illinois the white trash mountains of Virginia a\nLady who did not do\nGet them to a lot of them [noise] mostly them and not many of us and that's why we're here and they are they're told they're Mr Monday morning quarterback Mr wheelchair general are you going to turn your mind on America's fighting men when he come knock knock knocking at your door you\nKnow had a boy cat just see now as if it were almost tomorrow but I was in on the shoulder to shoulder right heart to heart\nDid it get Joel do you got it you get it\nOr greetings from the beginning not United States or or a\nSpeech more open Yes sir Yes sir what do you\nWish\nYou ain't got no no no you're right you know you\nDon't want to thank\nClooney banks ... pounds\nOf grain right just to see what I can\nDo on a lot of money more if they don't come in a while you got the lights on in your baby I going to talk to her story honey\nLook this is a serious you you've got to go out there and some of those men like face who he's not really common ...\nFor either where every bills hunting we've all got up which we all ... would you put that stuff they're always what would build things used to be looking at honey if it wasn't but those millions of both the so that the president of these United States will be named ...\nBaby excuse me for saying that but ever since and you've been acting like a spoiled\n[noise] this is talk\nAt least here in the ground for you miss the engineer for ... I'm Sorry I didn't know this is where\nYou don't do committed boy yes I wrote about everybody [noise] you\nThink you may have just wandering off ... we've been waiting for you There God God Bless you know what I mean let me see let me see that telegram we're hunting that is from Washington DC but ... you read it for me All right\n[noise]\nThey don't let me just maybe ... president of the United states you name chicken group I\nLike going there were no honey we can't go out to like what you were going up there because I really\n\nOh well we hope\nI didn't think\nWe [noise] really\nOh\nOh come on both\n\nAll\nThe early [noise]\nLike roots press are appreciation complete United States Marines the British Commonwealth occupation forces the French like human being on call no if I were opening without room all the way that we didn't let\nAlone the phone call\n\n\n\n\n\n\n\n\n\n\n\n\n\nOh ...\n... ... feet wide than you are dumb bully\nMicheline we are smoking wider like I Believe right only what that Robert Mueller allowing unmarked whales delivered to me Rob ice by going to blame brown Robert by a brown ... square\nAnd my dad up nine ... from the sky blue waters that are favorable Mexican made I think my ... and ... leather aprons and running through the field by the you know where I live to see her em remember\n\n\nThe responded to you\nIt seems that was his own citizens or\nWe went down to the stream to look at the ... basin reflection upon\nMe ... you just learn\nAny thought about those origins he's\nAttended and he bought a ... at the border with all of those little ... wouldn't impose this year to get behind the bushes\nAll of a sudden a mentor been you know and that's how you deal with the ...\nOne of those that are [noise] which only goes to show me\nThe following\nThis is the answer to reading your\nFriday a terrific\nOn the death penalty the Supreme Court recently did watch\nI'm Bill Newman and this is the civil liberties minutes in a case from Arizona the high court first said no to the request to reconsider whether the death penalty is unconstitutional\nNo surprise there really the high court has many ways to not decide an issue it doesn't want to but then in the same case the court somewhat surprisingly refused to review a much narrower\nQuestion about the death penalty\nIn Nineteen Seventy six when the Supreme Court reinstated capital punishment ruled that the death penalty would be reserved for the worst of the worst offenders and the most ... of the most heinous crimes by requiring the jury find specific aggravating factors that justify death as the sentence the problem with the Arizona law\nIs that it has so many aggravating factors\nThere between Ninety eight and one hundred percent of all persons charged with murder are eligible for death\nIn other words the law does not call out the worst of the worst or the most heinous of the heinous crimes but rather the wall makes every murder defendant eligible for death which is exactly what the Supreme Court said over forty years ago clearly an unambiguously a state dense penalty war could not do\nBut the recent Arizona case well the Supreme Court simply denied the request for review so the death penalty verdict stands and so does the law the civil liberties minute is made possible by the ACLU because freedom can't protect itself\nThe kiosk brings your commentary for members of the public all opinions expressed or those of the speakers have an idea for your own two minute commentary email W. R. T. S. F. M. dot orgy input commentary in the subject line [noise]\nThis weekend's that count\nAs a caregiver for someone\nShowing signs of dementia a free workshop for caregivers will be offered on Saturday October six from ten AM to two PM at the Klan library for the three forty took people conversations were family members about changing behaviors can often be challenging and than comfortable this program on for tips for breaking\nThe ice with your family to address common issue for info called to six six six three eight five need help with basic computer Internet skills looking for assistance downloading library e books\nFree one on one computer assistance sessions will be offered on Saturday I took her six from nine to Lebanon am at the lake field library twenty eight forty five north German avenue called two four six four or five four seven for an appointment enjoy free\nBird and nature walk with Wisconsin DNR bird expert evenly ... from two thirty four pm on Saturday October six starting as a penny parents teach their team series Sherman avenue\nYou'll be looking for all manner of birds and recording what you see by using a bird a smartphone citizen science app the citizen science program contribute standard that help scientists better understand the wonderful world to birds for info called to six six or seven when when\nThe insurgent menial task is a pre recorded segment featuring a commentary and Nick ... daily events events must be low cost or non profits in of interest to people in the W. Archie listening area in which other media might not highlight pleads submitted announcements at least ten days before the event\nIt's W. Archie have him dead or ... the cats because if they own on line up your GSM that orange slash kids this has been in search in radio cast heard weekdays at five six thirty nine AM and the two PM which engineer lead me an inmate [noise]\n\n\n\n\n... since Friday morning Costco music during global you or cheese it's\nAlready the ... of\nOctober and then they'd be feeling more alert for for for over to the\nRain developing and sticking around for march ... into the night and through the night aren't so perhaps from Ruben flooding could happen here in Madison or somewhere it's grown to Darren\n\nHowever our program is called see pictures because eventually in the third our and I'd be playing a set of songs by elder called that China's for performance today\nAnd\nSo I looked around for others see pictures and of course one of the places to start this heightened or attorney or the creation which you may know\nWe're supposedly based on\nA milk and the libretto was fashion for handle on their eventually came to heighten and he had to translate into German from English and that's the way he said it and then it was translated back into English\nSo that uh it became the first score in which both languages were published\nIn or two languages were published or the route you know what what was the original and what\nWas the translation and so therefore you know the the whole issue of doing creation in English has always been a problem because\nI didn't set the English and when you turn to cram the English back into his German the agent of all this was a beer and treat funds return\nA it sometimes doesn't work very well so finally Robert Shaw made a\nVery good updated translation your version of the English and that's where we're going to hear some are ... and in fact er Machar will be conducting the forces himself\nThere are fewer forces in this particular offering because it's the or receive an area of the angel Rafael ah\nWhich describes the creation of the ocean\nDr ... for ... in fact it's number six and seven of Kurt Warner part breach was your beach John ... or\n... or ... or ...\n\nWell\nNot all over the last\n\n... that's a yeah oh\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\nWe're talking about [noise]\n\n[noise] that's what\n[noise]\n\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\nMendelssohn was er which are near ... won't release mature for\nThe calm sea and prosperous ... overture which turned to pour into gr true with the appropriate course ending\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nReturn to the ... were ... Walker ... the Colombian company when he was about\n... ... you know some three years or so after church ... your ... your screen this fantasy earned Romeo and Juliet grabs your true he wrote the other one based on campus for three\n... begins right in the Bronx borough in New York and we were absolutely rocky for national\nAnd you're strong washing\n\n\n[noise]\n[noise]\n\n\n\nMm\n\n\n[noise]\n\n\n\n[noise]\n\nNah\n\nNah nah\n\n[noise]\n\n\n\n\n\n\n[noise] [noise]\n\n\nMm\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\nMm\n\n\nNa\n\nNa\n\nNa na\nNa\nNa na na\nNa na na na a\n[noise]\n\n\n[noise]\n\n\nHer curfews tempers to fair to see or after Shakespeare ... each team\nRefer National Symphony orchestra of Washington DC conductor on told the rocky are emerging you're tuned to do with you or to your family dinner important or in Madison and no rejoined the b._b._c. for world news\nMen itself that will treat them over three and a half thousand women yeah sometimes he performs as many as ten operations that day he said well that spot in repairing intestinal damage caused by gang rape\nThe other laureates ... three months of sexual slavery after being kidnapped in Iraq by Islamic state militants four years ago or ... says editor Sebastian offshore reports\nThis story that not humor I'd have to tell is one of extreme brutality against to have family and community\nIslamic state fighters seized to town and the amount singer as they stormed through Iraq\nThey must've ... thousands of Yazidi men and women including six of non GMO rides brothers and a mother she was captured with two of us just has\nTo be sold into sexual slavery she was raped and taught should that managed to escape and flee to Kurdistan she's become the face and symbol of the suffering of the ... and their resilience\nOfficials in Indian easier said they believe more than a thousand people could be buried under a massive government housing complex in ... city a week off the hugely destructive us quake and tsunami rescue teams had previously so generally a hundred people were missing in the complex\nRussia says it signed a deal with India to set its S. four hundred surface to air missile system despite the threat to the sanctions by the United states\nThe five billion dollar agreement was signed the presence of the Indian prime minister Narendra Modi and the visiting Russian President Vladimir Putin in daddy I'm about our son actually Russian has this report\nIndia essays it needs a sophisticated weapons systems like the s four hundred me science to modernize its aging weaponry\nMoscow is expected to start the delivery of the ... and two years' time Russia is India's largest supplier\nBut the United states has long countries trading with the rest just a different sectors that they would face automatic sanctions because of Moscow's annexing Crimea from Ukraine and alleged meddling in the twenties ... us presidential elections\nWorld news from the BBC\nA coach and so has sentenced to form a South Korean president Lee Myung bak to Fifteen Years in prison after finding him guilty of corruption\nThe court found Mr Lee was the real owner of a cop parts company he claimed was owned by his brother had to use his political power to benefit the business he was also found guilty of accepting millions of dollars worth of bribes judge ... case soon said Mr ... had abused the trust of the Korean people\nWhom I had to get that sounds like he think he had taken him ... joined the price says to disclose the truth in cases that was sort of down other crimes that they knew that had committed during his time of office will also uncovered the accused of as mistrust and disappointment in our society\nAs well as the people that supported and belief in him\nFrench media are reporting that police are investigating the parent disappearance of the Chinese national ... home way the president to the international police organization Interpol\nA source close to the inquiry till the French news agency a S P ... the Interpol directed was last seen leaving France for China in late September his Chinese wife has said to have reported him missing\nThe Russian President service says that the jailed Ukrainian filmmaker or less sense of his agree to end his long running hunger strike\nIt said he'd agree to this and writing and the nutritionists had been consulted to design a special diet to allow him to resume eating salads has been no independent confirmation from this distance of his lawyer the happy and fears for Mr sense of health optimal than a hundred and forty days on hunger strike\nThe Anglo Dutch consumer goods multinational Unilever says it's about ... cents to move its corporate headquarters from lumped into than other than\nThe company said a significant group their shareholders did not support to read that patients investors see it being devious and the London stock exchange quit Spock settle BBC News\n\nOr mental though listening county announcers with things and you will you watch the nation wide ranging from where the fire place\nOn the entertainers in that you would start ... lunch there is no Walker\nIt'll proceed so fundamentally ... grams county including or education advocacy involving schizophrenia or this or leaves really obsessive compulsive disorder it's like you just are not going to say she family are encouraged\nOrganized large lakes to foreign aid or is it mainly watch or\nKeeping us of opportunities for promoting wellness in our community this is Debbie ... are largely I guess in Madison\n\nAnd ... says friday morning card school music and there'll be ... chief on Tunisia program is called see pictures because\nAt the beginning of the third oh we're in for about half of the hour we're going to be hearing you know ... song circle regret name first performed on Mr you're Eighteen Ninety nine\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nIt's up your chance him dead or ... you can't build on line up your ... or explains kids this has been the insurgent radio kid friendly case at five six thirty nine AM and need to be an engineer lead me and you made [noise]\n[noise] [noise] [noise]\n\n[noise]\n\n\n[noise] Mm [noise] um W. or to you currently has an opening for a hard time keeping the bookkeeper is responsible for that will shrink implementing and maintaining financial records and W. or the financial policies are using\nCruel accounting methods within ... it'd be in a time we had a three man to retire to countless it was seeking to return to the field part time and that was in the fields digging initial income flexible hours would make ideal candidate contract services you apply the position description is located at W. or do you have to end up working under the warts happening\nSection to reply said resume cover letter and three professional references to Dan look at my email the L. I. P. P. I. T. T. ... application deadline is Monday in October and like the like radio broadcasting is it you know affirmative\nAction employers persons of color veterans women at persons with disabilities are strongly encouraged to Islam\n\n\nAnd Ontario where there were few for French Asia for the fifth of October of\n... jeans see pictures is the general turtle when the specific turtle agree ogre song circles you're beginning next door but before that here's something by Maurice River all I'm\nFrom Houston ship channel pieces called Nipah mirrors\nOne of them is called ... park ... Burke on the ocean and is often they're putting them in the real humid or stress you know\nAnd there really are that where there's more to you know conduct during the orchestra of terrorists\n\nShouldn't use the euro stretching of rebels ... Rios\n\n\n\n\n\n\n\n\n\n\n\n\nOffering and this time from American composer Charles Thomas some Griffiths who made to sitting sort of a porn called la mirror which nonetheless has an English\nAnd we'll hear both of them but the next one the second one at the end of the next door this is the city from Nineteen twelve ... soprano fees these ... and pianist Thomas More oh cool\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nTo sitting\n... lawyer\nBurt Charles timeless and Griffin is the American composer who quarter French leaning improve misleading with soprano pretty ... and ... more are cool\nOr Mars you tuned to there'll be were words here for maybe nine point nine medicine or rejoined the b._b._c. for world news\n\nThis is David Austin with the b._b._c. news this year's Nobel Peace prize has been joined today awarded to the Congolese gynecologist Dennis ... at at UCD human rights activists Nadia ... rod that work against the use of rape as a weapon of war\nThan a bell committee said the prize raised awareness of the need to prosecute the perpetrators of rape last ... reports\nDenise ... from the Democratic Republic of Congo has\nSpent decades treating women who's been victims of sexual ... violence in war and has been a front runner for the Nobel Peace prize for many years he's kind of story it is now the Murat his his health became a victim when she was held captive alongside thousands of yes Haiti petty swim in in Iraq by the so called Islamic state\nSince her escape she's wet tile is neat to highlight how violence against women around the world is being used as a weapon of war\nOfficials in Indian easier say they believe more than a thousand people could be buried under a massive government housing complex in positives city a week after his huge destructive earthquake and tsunami the complex second to the ground due to the forces a quick\nFuture ... ... ... is a coordinator for the international committee of the red cross which is participating in the rescue effort at the housing complex\nYeah how's says I don't know they eat because it'd be like being out of college and they're around plenty meet their identities it lets quite difficult to how this take dams because they think they have the equipment to live\nBecause it takes around two or three days then yeah that's a big town to being the way\nIt's MORNING we already get they have adequate\nRussia says it's signed a deal with India to set its S. four hundred surface to air missile system despite the threat of sanctions by the United states\nFive billion dollar agreement was signed in the presence of the Indian prime minister Narendra Modi and the visiting Russian President for the mere roots in in Delhi Russia is India's largest supplier of the United states has warned countries trading with Russia's defense sectors that they would face automatic sanctions\nPolice in France are investigating the disappearance of the presidents of the international police organization Interpol the Chinese national among whom way he's believed to have voted to fly to China late last month his Chinese wife says she hasn't heard from him since he was Schofield reports from Paris\n... home way who's sixty four was elected as president of individual two years ago last Saturday he supposed to have boarded a flight to China leaving his wife and children in the city of legal what Interpol is based\nBut since his departure his wife says she's not heard the word from it and she went to police and they've opened an investigation a French official has said that Mr bang did not disappear in frogs so it's presumed that something has happened to him in China\nWill news from the BBC\nOf course in Rwanda has granted bail to an opposition politician who was arrested last September and charged with inciting insurrection and forgery ... denies the accusations she was barred from contesting last year's presidential election told me a lot IPO\nReports\nPrison warden separated ... and her mother at Len from excited support as after the announcement was made in a court in the capital Kigali\nThe panel of judges said it approved the bail application because the prosecution did not give credible reasons why the accused she'll be detained during the trial\nAmong the bail conditions they regard as would have to seek permission to leave the galley and also submit their travel documents to the authorities the prosecutions that had had strong grounds to oppose the court's decision and\nConsider whether or not to challenge it\nOn a car has refused to use a work visa a respected international journalists after he refused to cancel the press ... to ... Hong Kong independence despised government pressure\nVictim outages the Asian news editor at the Financial Times and also serves as the vice president of Hong Kong foreign correspondents club is ... by the prime independence activist at each time in August\nThe coach in Germany has ordered a temporary home to the time to share into the petrified forest at the center of the dispute between environmental says to the coal mine and company is allows time for the court to consider a case launched by environmentalist who opposed the destruction of the ancient ... forest for open cost coal mining\nThe authorities in Somalia have refused to allow it seems that you had to defect to just on regional presidency on Thursday a former deputy leader of the al Shabaab ... Muqtada robo announced he was running for president of the southwest region the Somali government says he's too on the international sanctions\nBecause of the nation stories from BBC News\n\nW. O. L. I. T. thanks it delays in it and find a locally owned an enterprise level IT infrastructure consulting hosting management service it on the sidelines dot com and five lines you then\n\nW. R. T. thinks it's a listener sponsors along with cargo copying ground zero coffee which operates house roasted coffee along with a variety of soups sandwiches and baked goods cargo coffee is located at Thirteen online sounds parked street and suddenly the eastern Washington avenue in ground zero coffee at seven forty four Williamson street\n\n\nAnd I'm very aware of this this Friday morning classical music and double your tea and I should have\nLong go or sank those of you I mean in this show think those of you who\nContributed to our recent pledge drive especially on this show and all the other uh places you might have contributed to support where we do hear W. or tea we thank you as usual with gratitude and er and sort of humility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise] [noise]\n[noise]\n[noise]\n\n\nNot too cool\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\nOoh [noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nOut washing your boat and she's trying to figure out what's going on\nA moonlight you associate scrape and disarm storm News Corp follows so we have these\nFor the interlude from\nBritain's up or Peter Grimes with the London symphony orchestra this time conductor but Andre president\n[noise]\nOh [noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\nThe second ... ... they're\nGoing to English by sitting by Charles comics some Griffiths which are really are sitting\nAt the end of the second hour and I'm just\nSitting a little shorter a little more sedate we've already we're soprano Lucy show and and pianist Margot Gary\n\nWell I thought I Would try to go out with something a\nPopular is a sea skateboard it's just not so easy 'cause they used a lot of them in the show so I thought well why not a at least start the last movement on print ski cross the cross ...\nWhich uh you know begins once again with in reference to sugar as a telling detail into buying land but eventually\nComes to the uh the sheer purchasing bad so we'll start time and they're doing as far as we have time for\nYou get eventually to the b._b._c. news and the ... which was titled that you're wearing your tuned W were ts and eighty nine point nine Madison\nRemember recruiting is\n\nOh\nNo\n[noise]\n\nMm [noise]\n\n[noise]\nAnd I'm Ari motion with the b._b._c. news\nThis year's Nobel Peace prize is being joined ... to the Congress has gone to college is Dennis ... a ... human rights activists not humor rod for their work against the use of rape as a weapon of war the head of the Norwegian Nobel Committee said the prize raised awareness of the need to prosecute the perpetrators of rape his Caroline wholly\nDifferent different generations different continents but the Norwegian Nobel Committee said they said put that personal security at risk to combat the use of sexual violence as a weapon of war\nNow damn a rod who's just twenty five was kidnapped by the Islamic state group in two thousand and fourteen she was repeatedly raped and tortured the Nobel Committee commended to uncommon courage in ... thousands of other women subjected to the same with the whole deal\nHer fellow laureates Dennis ... is it ... gynecologist known as ... ... what are the two decades repairing the internal damage done to women who've been gang raped\nOfficials in Indonesia say they believe more than a thousand people could be buried under a massive government housing complex in ... city a week after a hugely destructive as quake and tsunami hit the Indonesian island of sooner way see more than Fifteen hundred people not confined to have died in the disaster how will Griffith is on sooner way see\nIt's now a week since launched waves of central subtle ways in which changed forever by too powerful earthquakes and tsunamis while the focus of the rescue effort started in lieu\nOf least a thousand people are being killed this autism now trying to quantify the impact in other places like potato bowl on by law they're mudslides of droned entire villages and national disaster agency has told the BBC that the funding auto cliff deaths maybe run three thousand\nIn reality we may never know that also Seventy thousand people are still in need of aid having been forced from their homes\nFor these in France are investigating the disappearance of the president of the international police organization into ... the Chinese national among whom way he's believed to have voted a flight to China and they last month's ... reports from Paris bring home where you're sixty\nAll was elected as president of individual two years ago last Saturday you supposed to have boarded a flight to China leaving his wife and children in the city of legal what ended up all these based\nBut since his departure his wife so she's not hurt a world full name she went to police and they've opened an investigation a French official has said that Mr ... did not disappear in frogs so it's presumed that something has happened to him in China\nThe Rwandan opposition leader ... and her mother had been freed on bail up spending a year in jail both face charges of fraud and inciting insurrection allegations they deny and describe as politically motivated his\nYou're listening to the nation's well news from the BBC\nW Aarti Thanks This listener sponsors and broom street theater presenting all for one the three musketeers musical September twenty seventh through October sixth at eleven Nineteen Williams and street all for one is a musical adaptation of the classic tale of sort of play an dastardly deeds\nProduced in collaboration with our we delicious all for one is not for children\nMore information and tickets are available at B. S. T. online dot\nOrg\nW. O. R. T. thinks that listeners sponsors and overture center for the arch presenting something rotten October night to fourteenth an overture hall\nSaid at Fifteen Ninety five is Broadway comedy tells the story of Nick and Nigel bottom two brothers who are desperate to ride a hit play when a local Sioux City or for tell us that the future of theater involve singing dancing and acting at the same time Nick and Nigel set out to write the world's first musical\nMore information is available at overture dot org\nW. O. R. T. things it's listeners sponsors and tap in Newark presenting wit and wisdom monologues have Ruth Draper October fifth through seventh in Wisconsin studio at the overture center\nFeaturing a diverse cast of ten female actors and one violinist the monologues selected for waiting wisdom showcase diapers evergreen understanding of the human experience in her wicked sense of humor administered with a kindly touch\nTickets are available at overture that or more information\nIt's available at habits Newark dot org\n\nThey don't there's\n\nIn exhibition original prince from three Wisconsin women leaders who have been impacted by bigotry intolerance and racism the other show entitled hidden in plain sight is an exhibition by artist kill you park Snyder that explores the often invisible truths that exist in society about power and privilege inequality and injustice\nVery topical these days and with these with me this morning are two of the three artist and you know at the arts and literature away I'll be Kelly park Snyder and Rachel Griffin good morning Kelly Rachel mind talking\nAll right uh thinks for joining me and the arts and literature average already man it's so wide ranging or about the kinds of things we have just that we have on from there so here we are getting a little bit more into kind of a gallery a night typical I I don't want to say typical but an art show\nOr that you can look at it in a ... what what else is there what tell me about the show tell me about what is visual and what more is happening 'cause we've got a lot of programming around to to throughout the month well I think most of the um\nUm well all of the art there is a connecting to activism I'm and I'm as artists were using our art as a way of you know broadening a conversation\nI'm many conversations um that center around social injustice political and cultural injustices\nAnd uh we're using our art I connecting are are to a activist or to thinkers and people have been affected by these injustices and were translating\nWhat we've learned I'm into um arts a prince a sculpture and and our hope is to draw a huge crowd tonight and continue um that conversation using art\nOkay so we're supposed to talk for a goal I guess we could delve into there to report it was talking to you about talking about right before we came of ... or ... or ... or so told me about both shows a little bit more specific or\nSo women against hate United by love features a lot of activists from all over the states all over the area and we traveled around so it's been two Appleton\nIt's been in Milwaukee and we pick up some new activists everywhere we travel\nAnd kind of connect them to each other and really focus on the area and what's going on locally [noise] so those prince feature of the women and then they also have a message so you see their portrait\nIt's a print it's an ... screen print 'em and then they have their message what they want to say what they want to go out there\nAnd we've actually had them hand right most of the messages if they can that brings a little bit more personality in there to um and what would it be or Richard\nIn Milwaukee yeah and you know yeah it was by an international woman's day and at that first show we had ten\nUh women activists women from marginalized communities women from um minority interfaith communities uh we had women activists from the immigrant community and our point was that the women women whose communities and lives have been affected by the hate rhetoric that centers around this administration\nUm that has been a an attempted to be normalized innocent or in ministry and we wanted to a heightened the visibility\nI'm a of these women I'm In a way that they could speak to how this has impacted them and along with what they are doing about that uh because these are awesome hard these are some really bad ass or activists ah throughout the state and so one of the\nThings we're doing is making art but we'll see written yesterday other yet or if they're doing with\nTheir their their message their declaration what needs to be said what what is not being revealed about their work about their community um and then when we do is we we travel and we work in this coordinated effort of creating change and we'll line\nAll of these women together from one community to the next community using art and then the art is the platform for a discussion and so we localize the issues that are important to that community and the artists are the activists in that community speak to that\nAnd we tried to connect our audiences to their workers so much going on now people are say what can I Do or will the action and uh you know there is actions we can do right now and the activists [noise]\nYou know we connect them to their their organizations basically\nTold me about a way that they were maybe ... one of the pieces and particularly the the art I'm starting to light on the statement at about the work you know what is the connection between making art and being an actor summers in church\nYou know I think that how um you know as an artist I'm an activist it's always kind of a little complicated place to be because you know as artists are in our attention is to open people's hearts and minds in and get them thinking about\nAh these these issues and new ways as as activist it's our our intention to create some tension you know so people notice a these issues and look at them more carefully\nUm I think I think star would be a really good example of star is the executive director of nine to five and she will be one of the featured a activists at our October thirteenth event at arts and literature laboratory\nAnd I'm so art a star a ... ... many of the work that she centers on is worked at centers around women and working conditions\nAnd so on her a declaration or her her written statement on her artist says if if if I'm not\nFree you know you're not free were not free and that's that's that speaks to our project is that if one community is suffering all communities are suffering and that we need to work in a coordinated effort of heightened the disability\nOf of of of of people who you know have been impacted by injustices and I think the link between art and activism as well both are trying to get that message out there in different ways than anything through art visually you can see it in a different way some people aren't always listening\nAnd you can kind of put it in front of people's faces and get it out there and different spaces and just get that message out I normally awareness\nI Want to go back to when you said you as an artist you need to create tension around\nAn issue 'cause I Am thinking back to um had the privilege of interviewing Holly Near recently when she came to town and asked her about a political songs and um and how difficult the order right and she agreed that were difficult\nUm to write and I'm a real interesting conversation about that but can for continuing that threat\nI think one of the reasons it's difficult to write some times is there actually is no tension and a piece of art if you're speaking to the choir everybody agrees that Donald Trump as a buffoon and you create a piece of art that says Donald Trump is a buffoon\nThere really isn't any tension there right so so I'm sort of coming to myself as I'm hearing you\nTalk like maybe people need to be challenged even who you agree\nWith to think about an issue differently what what can you say about that I don't even have a question without I I just have a thought so what did you see I said I don't know [laughter] it's gotten a water here I don't know if\nYou feel like the art needs to challenge people even who are of like mind and putting their shoulder\nTo the same or to the to the same we'll I'm also need\nThe attention needs to be created there within the community and within people of like mind in like goals\nOh I definitely think I mean I think we all have room for transformation in in in every aspect of our life and and the minute that we think that we understand things is is is where the problem begins I mean I think what our does is it answers questions it doesn't answer questions all the time it at ... for me I began\nShowing the film thirteenth and we'll have Lisa grades an aunt or any con bury us doing a post screening discussion our events are women against hate United by love the exhibit along with the discussion will be on October thirteenth that will be at arts and literature laboratory\nSomewhere else maybe on a cottage grove ruined further\nCloser in uh towards the capital Livingston street three hundred bucks solve under construction and ... between ... and the ... is also under construction and that's about all I have a lot of them\n[noise] All right thank you so much Rick gift card from Graham careers with this morning's traffic report and are we turn our attention to staff picks for what to do with your weekend there would be our we've got John cyber earlier engineer up first John\nThe morning [noise] All right to go to\nThat so tonight or by the end of ten PM and ages Twenty one he's Washington avenue a ...\nDebt code in conjunction with the medicine museum of contemporary art\nOr doing a photo gallery night featuring over twenty local artists a alongside with an existing collection\nOf a two hundred and fifty one of the kinds skateboard that sort of been customized and there'll be over there for a viewing pleasures of skate videos on display a do believe that there's going to be live music into a beverage of choice snacks also\nCreate lots going on for gallery night tonight or not yet another from similar to our our last gas and dust that men are producer Scott stuff going on perhaps but I Do too so I'm going to go next we've got an album released party cheddar revolution songs of resurgence\nAnd this is it the harmony bar and grill this Sunday five to eight feet them there is a lot of great bands that contributed songs and many of those to this a collection this is the second collection they've done about the political risk resistance in Wisconsin\nOr this one has just released his uh download I Believe folks like a whiskey farm Ken long quest borderlands Tom castle the getaway driver as the material boys lyric advisory board veal fires being bombed the German art students in the past\nThese are all folks too who are ... of contributed music and are performing at the harmony this Sunday swamp things got a song my band but um [noise] if we are all scattered across the country are not performing and also our song titled cannot be said on the air Shelley\nVery nice guy and then ask and okay so you probably know that it's gallery night tonight right or put on by the Madison museum of contemporary art but extending all across Madison\nOr one of the events that will be happening tonight is at hand impress a which is over in the east side of Madison at Seventeen forty three commercial avenue and um I was just there a couple of weekends ago and uh it's a beautiful space they just moved on a few years ago into this really\nLate in luminous stay so anyway they will be at having an opening reception for their new exhibition cold nights and weekends and opening receptionist tonight from five to eight PM and the cool I mean other than it being an ex edition of kind of print making\nA ... a kind of people that work there and\nThere will also be it the ... jazz studies a program than ensemble the blue note ensemble there'll be performing there from five to seven so it's a nice interdisciplinary jazz an art thing happening tonight for gathering\nOr write or stuff for you to do with your weekend and a lot of\nThings for all that and a high also ... ... oh I I ran into right after\nYou [laughter] okay you're very ways [laughter] I was reading it actually you don't think Russia out of your car\nBut it worked out that we all we all we all made it here on time so but ah my event is actually happening on Monday the mafia hits Madison and this month the means disguises you'll have five minutes to tell a story about your undercover sells\nA lot of scaring the real you perhaps with a fake mustache or mental disguises like a degree you earn to appease your parents undercover cops social chameleon and wolves guys up like lambs it's all up to huge discuss your hidden identity Monday to operate at seven thirty PM in the high new saloon what a great film I ...\nI Want to get on with our show too I Know I just wanted to thank Robert who pledged at the very top of the show a online at\nW. or TSN dot ORG and he says his favorite shows or entertainment I like it like that in fact to the country and he picked up our beer made a punch card a four available for your pledge\nYou so much of course the drug is officially over but we came up a little shy and addition to thank you all who pledged we are asking anybody else who didn't and we'd like to to help us just to get us up to go\nGive us a call six or eight to five six two thousand and one or pleasure W. R. T. S. dot O. R. G. I'll write a little bit of a mood setting for you and then we will talk about the first musical\n[noise]\n... the little town and it's certainly the brightest you'll in England going about John I began by not worthy my own no not fair that they don't know about the audience you make them be among the\nOr something in my heart just getting myself how can you say that\nMcCain and\nAll of a brilliant and one guy named\nSomething rotten tells the story of two brothers in\nAt least Fifteen fifty nine this year is wrong here they they are desperate to write a hit play with a local Sioux say or for tells that the future of theater involve singing dancing an acting at the same time\nThe brothers Nick and Nigel bottom set out to write the world's very first musical the national tour something rotten comes to the overture center a it's already playing there it opened on Tuesday it runs through this runs through Sunday October\nOkay I'm going to start over that it actually opens on Tuesday October nights which has not happened yeah and it runs through Sunday October fourteenth and joining us now is Middleton very owned Brian ... who is swing and ensemble member of the national tour the musical good morning Brian and welcome home\nGood morning how are you good a good to meet you in here from your uh so let's first talk a little bit about uh uh the show and\nWhile you enjoy being in it and then quickly we'll hear how you got from Middleton too\nSo what what is it a what's fun about this show and what do you do in it\nOh well I Do a lot in it um I'm In the ensemble and I under study a four tracks in the show um and it is a it is a\nHuge huge Broadway musical um we we never stopped moving or we're tap dance scene Kate Klein I'm just all the things you would want in a Broadway musical this show is it\nOkay and uh because it's the first musical uh amber I'm yeah I'm assuming that the writers that part of the comedy is that they don't get everything perfect the first time out it\nYep you you got it [laughter]\nAnd I guess that and hilarity or as a yet okay so what are some of the troops that are played on some of the ... the big uh numbers and the staples of musicals that uh get go awry\nYeah so ah about twenty minutes into the show is our first a huge production number it's called a musical and it is I'm a spoof on all\nAll your mega hit musicals um and uh\nIt is choreography it is just a snippet of lions here and there certainly music theater fanatic um you'll definitely love this show and you'll pick up on the little pieces but if you're not a you'll know some of them for sure uh enjoy just as much\nOkay and uh is a little bit of an homage day a sort of subplot in here because these playwrights are are just desperately jealous of William Shakespeare and and they want about exactly\nThat they're trying to find out that his next big hit 'em which doesn't go quite as planned\n... okay we don't want you to give me any spoiler so let's let's figure out how you got from you know where you in the school plays in a in Middleton and and your time here in the community what did you do in a you know something you always wanted to do to to go to Broadway\nMhm [laughter] yeah ah so I grew up uh in Middleton, Wisconsin I grew up during high school theater middle and high school I grew up in children\nPeter and Madison and doing there are some are stage programs and a working for them uh and then I decided that I wanted to go to school for musical theater um\nI I come from to a ... my parents are both music teachers where music teachers um and I just kind of always knew that I wanted to go into these theater so I went to Oklahoma City university and graduated\nFrom there with a bachelor of music in musical theater um and then uh I also started with direct union choreographed in in college and a directed all over Madison and have been for the past couple of years um and then I moved to New York and I'm\nAnd that you know the twist we're putting on this of course is that the three musketeers the book is all about the three musketeers in dark ... running around the countryside France and killing people and making love and so forth but we wanted to focus on the palace intrigue especially the women's stories are within Paris at the end you\nThat's right and let me say to just rent\nAnd we've at your mustaches looking very three musketeers Russian dapper Tony [laughter] oh this\nIs actually my very first ... mustache and beard but I grew up for the show because I'm also in the show I have a smaller a player red guard\nAnd a ... we have a price party every night and one of the prices that you can be in the show so you get a costume and you get a line and you're standing next to me and you have your line and it's really fun to come to the radio you write your name on a piece of paper you put in a cup and you could be in the show\nOr you don't write your name ... some people don't want to be in the show it at no good way to or they don't have to be right yeah 'cause I like All right well we're running out of time and we want to give away tickets so I Will just say a guarantee that are all for one of the three musketeers musical place tonight and Saturday tomorrow night seven thirty a broom street which is actually a really street of course\nUh we can give them ... tickets when the music starts\nYou can call to five six two thousand one we'll just take the second caller we've got a pair of tickets for either show is it or is it wasn't right okay either show just calling to park sixty thousand more when you hear the music and I'm going to think jolly put me in our producer John cyber we're engineer type ... on the phones on Colonel Hoge are away on assignment and here's a song that Martina Eldorado used to play at\nThe end of every bugs for many years [noise] ah I don't speak French it's in French\nHere we go next to this researcher leader kiosk its powers ... all the great things that fall into the weekend I'm Jonathan ... and I am out of hair comb out [noise]\n[noise]\n[noise]\n[laughter]\nYou're listening to W. Archie eighty nine point nine ... D in Madison, Wisconsin [noise]\n\n\nThis is the answer is we can't friday [noise]\nOn the death penalty is Supreme Court recently did watch I'm Bill Newman and this is the civil liberties minutes\nThe case from Arizona the high court first said no to the request to reconsider whether the death penalty is unconstitutional\nNo surprise there really the high court has many ways to not decide an issue it doesn't want to but then in the same case the court somewhat surprisingly refused to review a much narrower\nQuestion about the death penalty\nIn Nineteen Seventy six when the Supreme Court reinstated capital punishment ruled that the death penalty would be reserved for the worst of the worst offenders and the most of the most heinous crimes by requiring the jury find specific aggravating factors that justify death as the sentence the problem with the Arizona law\nIs that it has so many aggravating factors that between Ninety eight and one hundred percent of all persons charged with murder are eligible for death\nIn other words the law does not call out the worst of the worst for the most heinous heinous crimes\nBut rather the wall makes every murder defendant eligible for death which is exactly what the Supreme Court said over forty years ago ... clearly ... unambiguously hey state ... penalty ... could not do but\nThe recent Arizona case well\nThe Supreme Court simply denied their request for review\nSo the death penalty verdict stands and so does the law the civil liberties minute has made possible why the ACLU because freedom can't protect itself\nThe kiosk brings your commentary for members of the public all opinions expressed are those are the speakers have an idea for your own two minute commentary email W. R. T. S. F. M. dot orgy input commentary and the subject line [noise]\nCaregiver for someone\nShowing signs ... dementia ... workshop for caregivers who will be offered on Saturday October ... two PM at this clan library forty three forty took people conversations were family members about changing behaviors can often ... challenging ... comfortable\nThis program on for tips for breaking the ice with your family to address combination for info come to six six six three eight five\nNeed help with basic computer into\nSkills looking for assistance downloading library books\nFree when I'm when computers just sessions will be offered on Saturday at Cooper six from nine to a Lebanese damage to Lakeview library twenty forty five nurture ... called two four six four five four seven for an appointment enjoy\nFree bird nature walk with ... even leaving do speak from two thirty four pm on Saturday October six starting at the penny park beach thirteenth thirty Sherman avenue\nYou'll be looking for all manner of birds and recording what you see by using ... Byrd a smartphone citizen science lab the citizen science program contribute standard that help scientists better\nUnderstand the wonderful world the bird for info called to six six or seven when when\nThe insurgent menial task because the pre recorded segment ... daily events events must be low cost Jeanette profits of interest to people in the W. Archie listening area in which other media might not highly we've submitted announcements at least two days before the event\nThat W Archie of him dead orange slashed ... the gifts because the build one line of W Archie up and down orange slashed can't this has been insurgent radio can't read which is a five six thirty nine AM and the two PM which engineer lead me to me [noise]\n\nGood morning and welcome to the money ... grass that show my name's Chris powers will be your host right here in the or the up until the hour a new\nHangout hang round hang tight hang ten would that be bringing the very best in bluegrass new grass who's the music little tiny ... will just about anything else and let him know than\n... ...\n\nNew Jersey\nThank God he ... ... ...\n... ...\n... ... ...\nThis country is he a crack in\nThe\nLong Beach did\nThe ... the ... ...\n... ... ...\n...\n... ...\n...\n\n...\nKnow and nobody and na\nNa na na\n... [noise]\n\nWell do you may\nKnow there's been a fan\nIn the ... all we know the\nDe ... ... ... and then then the champagne\nAll day\nI didn't know it and then they didn't show up\nAs you in the morning na na\nDo we know the ... the low end again the\nNo one in charge\nThe budget back together again\n\n\nName wrong na na na\nNa na na\nNa na\nNa na\nNa no man\n... no no\nNa\nNa na na na\nNa na na dragging my na na na na\nNa na na na na\nNo no\nNo no no no we read lord ... na\nNa na na na\nNa na na na na\nSun miles long\n\n\n\n\n\n\n\n\n\n\n\nFor some of that latte on you I don't know they're angry and angry and mean a got a blue wave coming and governor governor warned that he's down already on ... latest poll is down ... points against Tony every man\nHe said but if the party will quit sitting around in the apple orchard listening to speeches and get to work\nThey can still turn this thing or\nYou know and that was Saturday for the gun on Sunday he went up there to Green Bay to go a little tailgate party watch this package to defeat the Buffalo Bills and went up to\nDodge county field office to seize volunteers they're gathering to make annoying phone calls to voters in hand out literature that offers voters no useful information that was in dodge county\nAnd then as it that's governors weekend and then Monday he went out and continue his donors tour what we call the donors tore and went to the area and company out in the air really and\nAh they were celebrating the production of therefore Malian snow throws snow blower they they made they made three million nine hundred and Ninety nine thousand nine or nine and none of the things now they made a four million one and governors on hand\nAnd watch them I bet the governor's twisted a few uh just did a few minutes there as well I'm putting that snow blow to get help them put together I'm sure he did a course that the errands company donated nearly fifty thousand dollars to the governor's since Ninety two thousand nine\nJust in only goes to reason that he would be on hand for that and he was also the same day Monday he was at the masters gallery foods now that courses up an internship boy and his family run cheese business up their family\nThe whole family donated hundred and forty five thousand four hundred dollars to the governor over the years so his various elections so as part of his you know donors tour and he continued to visiting businesses throughout the rest of the week he went out there to Richmond center to the miniature precision components\nAre they gave four thousand four hundred sixty two dollars or to the goal on a bait and fish farm and dodge ... five thousand nine hundred and fifty dollars and that was Tuesday then on a Wednesday the governor's out that Clemens sausages in Milwaukee and use it\nFiftieth anniversary chip ... river industries and Chippewa falls on Wednesday and\nThen yesterday he was at the U.S Ventura energies and a combined locks and and that that the locks plastics and Clinton's deal\nNow come in and I know it's fun and now a lotta fun\nIs zoom around out there an account for someone to go to all these little businesses all over the state and read all your donors in it and all they select employees and all your scrubbed an ego volunteers but doesn't that seems like since you're running for re election as the governor you might maybe want to go out one of these days and then make some contact with some\nOf the voters as well wouldn't that be a good idea\nAnd make your case to the voters maybe maybe it wouldn't be down five point I don't know how what do I know about it anyway that's your tax dollars at work signed a governor around all these places\nAnd um and we'll be right back with a feature down them right after a couple of messages don't touch that done civil again here\n... ... ... ... good one\n[noise] Willie for the dog eared dreams silver anniversary show Saturday October six to eight PM epicenter more theater searching for the shame and that led inside the guitar his leg Willie Porter funding musical and personal odyssey spanning over two decades down the albums and multiple confidence\nEqually accomplish as it gets ... singer and\nSongwriter orders songs we the universal perspective about the question struggles and\nTriumphs of human existence a largely self taught musician for to begin treating audiences was brand of good charter plane and rice story telling in the late eighties while living in Madison [noise]\nPorters log many miles across the United states Canada the u._k. and Europe tore so low as well as with various incarnations\nOf the William Porter ban will be for the dog eared free silver anniversary show Saturday October six eight PM as a Barrymore Theatre you're listening to you know word the eighty nine point nine FM listener supported radio\nMadison W. O. R. T. thinks\nA listener sponsors and Willie street co op offering hot deli food pre made sandwiches and sushi daily menus available at Willie street dot co op\nAlright and\nI'm thanks for that report um I'm Joe cracker about where the governor is what the governors up to\n'em I should mention at this point in the program that we are still taking pledges for our um pledge drive we actually didn't make 'em enough well we made our goal on this program we actually a hundred dollar about a hundred dollars or so\nOver our um our our goal both of the week but uh\nOverall the pledge drive didn't quite come up to what is needed so if you are have been thinking about maybe making a pledge or maybe you're out of town during the pledge drive or maybe\nOr maybe um something changed during the last couple of weeks and and you know thinking blames Bush I sure wish I had a call up during that pledge drive and made a\nMade a donation you know maybe you can still do that actually where you know to still take a pledge pledges here and we've got a looks like we've got all these ah thank you guessed it says we've still got the so um [noise] I don't know if they have a list out there but they can come in here and and are they going to have my\nSummer right okay\nAnd you can do that on line of questioning as well you could check that online and see what's going on there a seal the premiums and stuff that we had a few things left over All right\nUm meanwhile it's time to get onto our featured albums and uh this is we actually did a a an interview with Missy rains I'm not\nA back in the spring when she was passing through town\nAnd she mentioned that she was doing this album for um a compass records and here it is\nIt is she's um she's won the\nInternational do best rapes association bass player of the year award seven times seven times and she finally got this new album out of a this is more or new\nThat says or bluegrass kind of an album and related music little bit quite a bit more ... than her last venture\nAd features people like Stewart Duncan and Tim O'Brien as well as members of her current band and I'm Alison Brown produced it also includes a cut 'em which is actually a\nNominated as IBM a that's international bluegrass music cessation song of the year for recorded event or the year it featured all of the uh the first women\nA bluegrass I called is actually the for the women who won um awards in their instrument or the first woman for example Alison won the banjo awards first woman to win a banjo award\nFrom the bluegrass association international and the Sierra ... mandolin Becky Boulder on federal Molly titled on guitar course see on base so that's included here as well let's see if I can find this here it is\nAnd um [noise] let's see push a couple of buttons here by some Snyder's All right I'm ... new album is called royal traveler world traveler and salad or just out on the\nThe mood in on the bottom\nThat was the day then\n\nMove on to some ... ... ... ...\nThe\n\n[noise] I\n\nLive near the ...\nBy the deal is but you know I'm mother yeah\n... no no\nNo I Do want to comment on the stand\nAnd wish me and then the then ... ... do\nThe best I can and\nThen I get to be in their ...\nLike pool but them\nMm I ... I mean that was the Nineteen sixties in the news [noise] [noise] Mm\n...\nMm leads is now from\nHis blood is ... I'm fine thank God\n\nAm ... my life you know I'm ...\nMm I Know when\nYou help me get back\nMm help me get back\nInto town\n\n\nYou can be doing his knee and everything to do\nThings for women in in ... we did not\nGo under\nAs well\nYou know it's a huge and I just let them do not like\nI'm Ross my other\nIn the lead Nashville's Belmont [noise]\nA hands on learning strength\nThat's fine but not that dumb\nI Am on the road driver ... live long legs and saw the\nI swim\nIn the world around me get back to [noise] do they get that\nThe man\n\n\nJeez I'm\nOh I'm\n\nYou're listening to W. or TNT nine point nine FM listening sponsored back porch community radio in Madison, Wisconsin and we've been listening to our featured albums today from Missy rains\nAnd uh her album is called royal traveler\nAnd we heard the first bunch of pieces here\nLet's see we heard a Allegheny town we heard the a few of us love that feature down to my Brian Singer on that one we heard swept away which features the first first women or bluegrass\nAnd that title cut was that last piece\nReally traveler co written with it's not early\nSo there you go that's Missy ranges new recording it's out on the campus records label and find it wherever fine pre recorded\nMusic is sold if they don't have it where you shop ask them why the hell not why not why don't you have it\nRight okay well\nWe'll be back with a little story for everybody right after we do more messages here\nLet's see what we can find the right ... well here's one you might like\nThe neutral on line for mental gr listening county announces the thirteenth annual memory walk shipping nationwide fundraising middle of the worst program the fires to place on Sunday I work with energy\nMr Walker ship in it for a new start time cookout\nLunch and there is no Walker industry should be at all proceeds will funded\nAny programs in the county including support that your kitchen and advocacy involving schizophrenia bipolar disorder major depression obsessive compulsive disorder severe anxiety disorders company they she and family are encouraged\nTo organize teams of Walker [noise] for me and goes to the two for nine seven and when the state or is it ... dot org\nKeeping us informed of opportunities for promoting wellness in our community this is W O R C nine point nine FM medicine and\nOn Tuesday a silver sixteen W. R. T. brink lounge present the love drug ... years with Mel Watt [noise] a lot of struck valid yours is the big banks still dream that\nLink traditional music with a modern player sensibility this during an some members of Detroit in New York and Chicago [noise] their sound with Abu describe your own time jazz if the ... and they keep dance floor for all across the usa\n[noise] Madison zone Malibu or from the French my fingers her open with a Hawaiian flaps and seals lie disarm them because that will make you wonder why you haven't been to one of their showed the point that the love struck valid ears and mail one\nDay I tore sixteen Seventy and had to bring Glenn\nBringing your music that won't let you stay in your seat W. R. T. eighty nine point nine at them and W. already have them dot org [noise]\n\nAnd it's story time boys and girls friends neighbors and today we have a classic story for you\n\n\n[laughter]\n\nDa da da\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm [noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise] [noise]\nMm Mm Mm [noise]\n... ... ... ... ...\n...\n[noise]\n[noise]\n[noise]\nMm\nMm\n\n[noise]\n[noise]\n\n[noise]\n\n\nThe need\n\n[noise] um and it literally instrumental music for you on a rainy friday morning over and I says oh gypsy music\n\nSo people ask about on this ah what's his own gypsy music is it all gypsy swing no it's not\n\nRight so let me see if I gather everything make sure you get\n\nTo talk quietly amongst yourselves while I gathered his together here right here we go now we started off there with a a violinist named Kim Angeles this is from back in Nineteen Ninety two but ah that was one of her gypsy dance is called ... ...\nAnd she does all kinds of different uh different types of federal pieces\nAnd or the next piece is called the sort of a T R K A third of God and that's from ah the new recording from child's play which has has a new recording called the bloom of youth did lose ...\nIn student maker so that was sort of\nAlbums features of the singing of carrying Casey is well\nVery interesting\nLet's see they followed that with the cup oh\nYes a couple of gypsy tunes of first one of course\nWas the um what was called ah the Hungarian dance number five and then of course was developed by you hunt is Brahms classical\nType composer and that was performed by Henry the fiddler from Henry the fiddler in friends often old lp phonograph record from Nineteen Seventy seven\nAnd then another uh another L P\nGym is well this is from Nineteen eighty from ridge runner records and its body Clarke I I don't think Bobby put out any other\nRecordings of his own we had some some great a great people in this session\n\nAnd that was a piece he wrote called the one legged gypsies\nOne leg a gypsy and ah then\nWe heard a piece called the gypsy fire now this is from a brand new album or from ... and ... see a way out or single ... single days out of ... and I'm so beat his ensemble course from Chicago\nIllinois and\nUh they joined up with the Czech Republic spanned a gypsy way and um put out and sex to disk set and these are pretty much classical pieces are things can pose in the classical manner and that one was um as an extended one written by putting down this book all\nOf this book called gypsy fire so that's available if you like\nThat gypsy classical gypsy music and who doesn't it's a lot of violence ... violence music and some a clarinet or involved and various other instruments course piano backing things up quite a bit instead of guitars\nSo at the same grades are from ... ensemble\nAnd the last piece another gypsy song written by David Grossman\nAnd Dave wrote that I'm Dave wrote that for the ah king of the gypsies movie so that's a that's also from the old L. P. and er that's Toni Rice's arrangement\nAnd I'm John rushman playing the mandolin on that\nRight and I think that's um yeah and that's everything that you've heard with a bunch of instrumental music All right well we're running a little late on the bluegrass calendar but that's all right when you get all of his long pieces in there so we'll be back\nThe bluegrass calendar after a couple of messages don't touch that are\n\nUm\nAnd details\nAre here we go is that the harmony bar and grill it's written down here in tiny tiny letters at the bottom of this page All right All right so harm the bar and grill the or cheddar evolution science a resurgence album released party\nAll right when I was trying to track that down a boy and uh what else we got for you I'm Dave land out of course plays Monday Night is kids music\nThey're at the harmony um there's\nA there's a program called African roots of the banjo on\nWednesday night they say and get this one to appear before us here and let's see that didn't work very well at all did you ever go\nThe Internet's are not the best way to produce calendar if you don't\nKnow what I mean I mean you know African roots or the band you this is six thirty to eight PM and um this is a single night free educational event supplementing their nine Fifteen intend twenty concert offerings\nSo the next to grace presents concerts with a tiny the kite and or the afro funk stars on September fifteenth lots over already and the NO NAME string band on October twentieth Sharon unlikely common thread the banjo\nSo there you go this is going to be a I'm just going to be\nA single night as a as a educational event yes it's yeah it's a grace a pistol church right off the capital square that school six thirty eight PM and then there's a band together um for autism event going on on Wednesday night at six thirty PM\nUm\nTo help or autism societies in Wisconsin a therapy drone will be playing rock music and the oak street ramblers will be playing bluegrass music and there'll be punk with strikes and snakes so it's\nA nice heaping helping for anybody um and you'd come on out and help people with autism this is an event down at the high noon\nSaloon I knew something right right\nAnd a NASA music is going to have like Celtic music fusion um music at the north streets cabaret\nUm\nLed by a killing my ... minutes we're dazzling ... technique and beautiful soulful voice and co founder Rob\n... right so NASA Celtic fusion band the nursery cabaret on Thursday alright\nSo those are the non bluegrass things I Know about and that's it if there's anything that you know about maybe you know more than I how could you not give us a call here to five six two thousand and one and give us the details and we'll let you know\nOh yeah so you're a couple of things I neglected to tell you about here um three Sendai is going to be playing out featuring trip Smith on fiddle you're doing the show um tomorrow night and this is going to be at the rushing waters restaurant in Palmyra from five thirty eight thirty they will be laying\nThere and they're having the actually having a a lobster boil that evening lobster boy we didn't have any lobsters here in Wisconsin to eat\nWhat they what they heard them\nWhat you mean like they have the lobster boys that heard them across they travel across the country I don't think that's right it doesn't sound right\nWell anyway they didn't say I will somehow they got here lobsters so there'll be at the rushing waters restaurant in that same evening so what can be better old time music with Jeff Smith on federal\nAnd lobster married okay\nAnd um and a crispy be called us up during the fund drive and says that there is going to be a bluegrass jam weekend coming up\nI'm this fall\nStrings gatherings going to be in on the sixteenth of November sixteenth through the Eighteenth and this is just going to be the bearer embarrassing to declare hotel\nAnd convention center and you just hang out and jam from friday from five PM till midnight and Saturday from eight AM to midnight in Sunday from eight am till noon so this is like all use string players who enjoy jam and you can just jammed to your heart's content\nAnd um it's an amazing thing\nRight\nThe ... gene right now those are all the things that I have here but that's not something else this is the ... progress special and\nIt's W. O. R. T. eighty nine point nine is enlisting sponsored back porch community radio in Madison, Wisconsin and we're going to do songs about the world to songs from all around the world know they're just about the world\nThat's just that's\nWhat I'm In the world am I talking about let's let's find out\nLaying me I'll hang me I'll make ... job\nMean are people getting jobs not to hang in there and I my ... mom ... around\nTo the common man of ... no\nMore I have been wrong man in my own martial law Rapinoe around on\nGoing to bomb the mountains in Iran make my when I Am\nGoing to bomb them their object my name\nIs Joan in my pocket and ...\nI don't know that in our land\nPaying may or may have been dead and gone\nMe and I made that it\nNot the hanging that I'm On a day and the ...\nThe guy you know rather than\nBomb on top of that little ...\nMama and papa and little ... you know they come and see me hang around\nBelow normal guy been around when\nOn that when you read those with murder in mind they\nRoad where the murder up on the line who\nWork in a big John Henry no argument you know that I've seen all around the world\nDo enough bomb mountain in there on the mind and go and bomb in there I think by stands\nIt's done in five talking on arrival in my hand over the top and I'm not going to\nAnd mail and me I'll be dead and gone\nMe and I mean ... not to hang in that on line and laying in the long don't do that in all around the\n... ... ... ...\n\nOr get your hands\nYou know in the in the go by\nYou swing state and\nOf late a gospel show\nBut I opted for a different one in here [noise] it just called it a big old goofy world\n\n\nMm Mm up in the morning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nA\n\nGreat [laughter]\n[noise] [noise] [noise] [noise]\nAnd the\nAnd the gum may or June mother\nHave been I mean the last ... the mother\nStone me\n\nI go on a journey\nVery old things and\nTo play the new drainage James ...\nJade again in the room\nAddress slams dream mobile and\nNeeds to be a time we have\nI Know she's down make common\nCause the added to\nGame being being married to ...\n[noise] [noise] [noise]\n... ... she's a reason to erect plus ... she's the ride\nShe's a ... one thing when they told you not to go\nIn and the rest of the leaders Jew and a key in our hearts and do the kingdom ... them and then a plant or a\n[noise] to me I Love and I'm In the\nBook written down she's ... the bulls eye because there are targeted child who was written down\nI Know she saw make common but Dr then because the ... and ... those are the law that\nVersion ... she is a ... a\nI Know she saw the common to study the\nSun goes down by the view\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFor oh man home again when the walk in the Irish re\nA chapter anything by hand look out for ...\nStop double up again when I get\nA gathering of hands on guy\nDo love began when I get to run\nCan they are average rain well give me Ira today\n[noise]\n... ... ...\n... who may be\nWith the\n\nYuri ... a ... to ...\n... ... ...\n...\nThree [noise] this one from\nThe ...\n... ...\n\nOh ... well ... he\nThere\nWas a young\n... ... ... ... and ...\nA law that uh\nThe da da da\nDa na\nNa\nNa\n\nNa\nNa\n\nNa\nNa\nNa na\n\n\nUm that\nWe ... ... when you ran\nOver by the\nWe have a gym\nThe trial of la\nLa\nLa\nLand was\n\nJust so you know then the jailhouse ... the curfew rings tonight\nAnd I and a number Thirteen so we'll go wild Michaeline ... she knew her dad was innocent and so our little new\nJets during ... ...\n... ... actually I ain't going\nYou're more involved there's long been found and bring\nFor you there I remember the current never hurting and I [noise]\nGet all the big game but now he's been known to have been jak cheap Ronald ... the crying 'cause they're not going\nShow a no no no and no jobs no\nOf the trails\nMade about a\nA\nCaroline uh and uh\n[noise] [noise]\n\n\nAnd it's a show boys and girls friends neighbors started up there with a piece from guy Clark somebody named Chris yeah\nStill saw her and then from the band California from their album traveler a that was a song for Catherine and song called walk Irish rain\nAnd then a song for Maggie from the bluegrass patriots cold when you and I were young ... and then\nFrom a country ham a song for Nelly hang on the bell Nelly hang on about\nAnd then from other that's from an old phonograph record by the way from the ban country ham\nAnd then from another old photograph record a band called half and half half of two bands came together in order to their own album and um it was a good by Maria song for Murray called good by Murray\nJust play Murray\nAnd then we heard from a rat who's in the sky and a song pursue that one's called Sioux City sue two different ways to spell sue\nAnd finally from Doyle Austin and quick silver song Carolina Carolina in the pipelines and you know boys and girls friends neighbors I could stand to stand right here and do this\nAll the live long day long about now sort of a overwhelming force takes over him happens to me\n[noise]\n\nAddress time ahead on down the old catfish highway but\nLike to thank everybody thinks Nancy forgetting our\nPhone calls in the second half the show and thanks um everybody for listening thanks to all the pledges last week\nOr two five sixty thousand one if you want to up your pledge and um [noise] W. it's a ... blue grass special W Archie eighty nine point nine fmri Madison, Wisconsin have a wonderful weekend by by [noise]\n[noise] [noise]\nYeah I'm an old got fifty one votes fool and forty nine against a final debate and confirmation vote will be held this weekend from Washington Jane O'Brian reports\nThe Senate has moved ahead with the confirmation process on the floor protesters took to the Senate Colorado was to demonstrate that real physician to Brett Kavanaugh who has become a lightning rolled in America is increasingly but it's a culture voice\nSenators now have up to thirty hours before voting whether or not to concern the judge to the Supreme Court the White House is confident of victory but his appointment is by no means to us and\nA handful of senators could still change their minds and that those\nBoth winners of this year's Nobel Peace prize apply to the significance of the award to women suffering sexual violence around the world\nIs where the ... gynecologist and his ... and the Iraqi Yazidi activists now do you I'm All right but that fight against rape as a weapon of war with Iran said it was a significant victory for abused women she became a rights advocate after being enslaved and raped by the Islamic state group and twenty fourteen\nBut he's ... said the award was a step towards the recognition of women's struggles\nThe secretary general of the United nations Antonio ... praise the wind is at this year's prize\nToday the normal commute to recognize the efforts of not being able to and then as ... as vital\nMinorities the founders of human dignity these dry social recognizes countless victims that only will we have to offer to be stigmatized even some of these used there\nBut he's in France are investigating the disappearance of the president of the international police organization Interpol the Chinese national among whom way he's believed to board a flight to China late last month he Schofield reports from Paris\nHome weighs sixty four was elected as president of individual two years ago last Saturday you supposed to have boarded a flight to China leaving his wife and children in the city of New York what Interpol is based\nBut since his departure his work search you won't hurt a word for me she went to police ... an investigation a French official has said that Mr bang did not disappeared in frogs so it's presumed that something's happened to him in China\nThe un refugee agency says it's great you can send for the safety and security of seven ... mostly men deported from India to me on ma\nThe men would be in a detention for immigration offenses in twenty twelve were handed over to the man most art is on says day a spokesman for the un agency out in Geneva said the men had been denied access to legal counsel\nI had a chance to have their aside and claims assessed by the end you know SARS he's world news from the BBC the unemployment rate in the United states has fooling to three point seven percent its lowest since December Nineteen sixty nine\nYou official figures also show an increase of one hundred and Seventy four thousand in the number of people with jobs last month\nThe b._b._c. economics correspondent says it indicates a strong jobs market\nDoctors in South Africa before the world's best liver transplant from a mother infected with HIV to her baby who doesn't have the disease from Johannesburg he's ...\nDoctors at the vets don't old Gordon medical center a private hospital linked to the prestigious vets lots of small University in Johannesburg said that that the town's blonde was the best jobs for the critically ill child to survive\nThe child his name and gender is being withheld to avoid stigma was born with end stage liver failure and adjust to that in months the life saving operation was carried out\nThere were no guarantees because this is the first time an old and has been transplanted from an HIV donor to a patient without that disease in the world it's not yet known whether the Thirteen month old baby has become infected with HIV most some of the child and his mother a taking\nDrugs the governing coalition in Ethiopia is ready to extend the championship of prime minister Ali Ahmed cementing usual SARS he is leader of the country the election to play\nAt the end of a three day Congress at the ... coalition is Abby is introduce sweeping reforms including making peace with Ethiopia's pool in the enemy every try a\nLawyer for the imprisoned Ukrainian filmmaker owners and solve\nHas confirmed he's ending his long running hunger strike in a rush in jail and then that's it since all said he made the decision after Russia's prisoner authorities threatened to full speed and he signed supportive but apologized for not having achieved his aim BBC News\nW. O. R. T. things with listeners sponsors and just coffee Madison's fair trade roasting cooperative just coffee buys fair trade coffee to ensure equitable conditions for coffee grower cooperatives around the world and roasts locally in small batches\nMore information at two zero for nine zero one one we're on the Web but just coffee dot co-op\n\nSupport for W. R. T. comes from greater Madison vision and ten minutes survey gathering public input on regional gross the survey shares possible futures for the region and explore social technological and environmental changes the surveys at greater Madison vision dot com\nKnown window and no one there have been no change we don't\nKnow what you want to [noise]\n\nDo you owe earthy eighty nine point nine FM listeners sponsored community radio Madison, Wisconsin\n[noise]\n\nHello welcome to a public affair I Am as to the new or we have is very fool show today but before we get to that I first of all I Want to thank 'em all those of you who pledged in the past two weeks this um showed did wonderful\nNobody bridge um\nAnd of course I'll go find me we have as well to support us and we're asking folks to support our legal ... you know our legal costs just because of you know that the cap and being out on the waters and doing this water monitoring because we've been doing this for really intensely and on the ground for like I said ah for the for the\nMost part of this year really for the whole year and um we've been successful in\nStopping the pipeline construction to a delay their deadline there was supposed to be finished with the pipeline at the end of October and now they're saying they won't be finished until the end of December so we are doing you know we're really doing the work on the frontline or we need support we need people to reach out and share the story\nLet me ask you um you mentioned the just the three indigenous women will will ... um\nThe the machinery and what they were trying to call attention to was I'm missing and murdered indigenous women um do you want to make the connection between that and the pipeline [noise]\nYes ah the connection between that and the pipeline is that uh the pipeline brings in workers um that aren't necessarily from our communities they don't hire workers from our community\nA summit communique and and they're set up these a camp called man camps\nAnd uh you know there there's a horrific stories of man camps in the oil fields up and and North Dakota I'm the sex trafficking and there's a documented missing an indigenous women along those\nRoutes where the pipeline and demand camps are and so we're bringing awareness to this to this issue and the relationship that it has to the pipelines in terms of\nYou know the raping a mother earth the disrespect the mother earth and how we are women are are or were embodiment of one of the earth ourselves and so it really is a direct attack on women on it and it's women in particular and so we're bringing that\nTo the forefront in this particular action as well as as well as stopping the pipeline for another day and it was a key space along to do that so\nYou know the strategic actions to bring awareness as well\nAnd another thing I Would like to talk about is um the attack on the media which ... the president's that we have no um he's leading the duck in every way possible but in the case over ... and and you say differently you say Louie, Louie Louie\nLow low dose sale okay I'm In the ... I'm ... and and also really in the case of Standing Rock because we'll be talking about them soon\nUm media you know people who came to a document war was going on they what is going on currently in a mule\nA part of the world are being attacked two are also being arrested I actually saw the video and local reporter a woman I'm being arrested we view um being in a rural ... early ... Joan Kimball here and\nI'll do an el do over a community smoke woman\nWho was arrested for really large um hops is as though she was dangerous as ... there was something she could do that they needed more than one um same is going on with you talk about\nThat at ... own um [noise] the media and um the attempt to not to get that information out I think that's what it seems to me to be doing\nThat is exactly what it is it's an attack on a media and attack on our First Amendment rights and I'm really trying to\nUh stop us from getting the story about\nStory out about what is happening in South Louisiana but the attack on the journalist Israel okay I'm Karen Savage has been on the ground with us\nDocumenting the story reporting the story first hand and this was the second time that she had been arrested the first time she was arrested was earlier this summer I'm folks were doing an action and kayaks and um they pulled her and to other uh\nTwo other water protectors 'em\nAnd literally put them on the eve meant which is um you know considered a felony so they weren't doing anything they were in waters that we're now but ... which are legal up that are very legal for us to be odd for anybody to be on but\nSo that was the first time she was arrested and uh really if you see the videos you know they're just\nLight in her face stopping the camera does very disrespectful and really just really doing illegal things and then the last time a she was targeted we were both targeted actually [laughter] but um yeah there she was doing nothing not one thing they've fabricated\nThe charges against both of us um she was walking down to the boat to get on the rap or on the on the ramp to get on the boat and yeah there were some police there at the ramp it went down and targeting her pulled her out we're very a pretty rough on her she's a small woman but um\nYou know as she was being arrested I ran up to the a levee because that's the only place that we can get a cell phone reception or any reception now mind you this is very remote area when he very wary about the run up to the levee and uh\nThe jailer at the jail at St Martin parish Louisiana said that there were no warrants were Karen Savage so they were down there telling her that they had warrants for her arrest so we'd go right back down there and then they snatched me\n[laughter] yeah and I'm\nThe same thing warrants from Iraq there were no warrants in the system and we asked them to showed us the warrants and the guy actually said um there'll be warrants for you when you get there\nMhm you know yeah so I'm an ... [laughter]\n[noise] no they did they were they made us wait oh they didn't slap this then it's you know as soon as they were finished hyping it up or whatever slapped down on the counter and said there's more you know\nUh-huh I see well and I'm I'm white had um we have for other people are waiting to um get on the show but um I Want to say I leave ... some say they still\nGo sometimes to ... I Love that ... it is in the ... the incredible as as I'm\nJust as you I'm described a really um would like to encourage your listeners to read about the ... to look at photos um I really want to thank you for what you're doing can we um\nCheck with you maybe once a month and see how things are in in us led be great okay and again people if they want to come they should go they should write to resist at no be BP dot org and the ... go fund me um\nPlace where people can help with money and loyal heavy camp ease on Facebook\nSo you can get thank you so much on white hike some show really you have a good day you to really appreciate eat on white had\nShe can't go to court that from South Dakota mother or beliefs water protector I'm and she has been a member she still leaves a member of the indigenous women's advisory council of the ... the\n... the bayou bridge pipeline resistance come in South Louisiana\nLet's go to a little bit of a trailer and we'll be back with a bunch of additional amazing women\n\nWhen the call was made [noise] we didn't waste turning we came out here we ask permission from our elders in me and they said yes go protect the water the sacredness or something [noise]\nOur ancestors were amazing [noise] um keepers of what we refer to as time and space so they left a much information as to what was going to come about\nThe people from the north for the people of the people of what we know today called South America or people\nThat we would come back together [noise] stations back into the country [noise]\n\nAnd uh we are black and that was just about a minute ... a a brand new documentary film created by Paulette more title of the ego and the ... or phone standing broke with love\nAnd pull that is one of the women who is with us today how low Paulette\nHello at say it's great\nTalk to the Polack [laughter] the\nThank you [laughter] and I'm also on the phone with us is um germane trim male and elder Lakota\n[noise] so so that actually um goes to what they wanted to ask you next ease um so what happens when in in the spiritual rooms if you will what happens when you get together in prayer\nUm to to bring 'em change 'em\nTo do to affect things I'm eating in a way I'm\nThat will take them away from destruction and exploitation and soon and so forth and I'm as the ceremony happened looms\n[noise] these brutality um doesn't do um\nDozens of police and mercenaries as you see in the film and as I think a lot of us remember who for whom\nThe actual time seeing eat and um\nThe the ceremony is disrupted\nBy a by these forces that the ...\nThe ... the powers that have been doing the destruction and the rape pain in the uh um exploiting and so on and so forth what what happens when\nWhen this was all going on and one of the most powerful things that that happened\nIs that there was there was an energy that happened that came in and the buffalo came ... the buffalo came over the ridge right and it was all females and they all had female babies with them that was a sign right then and there and it was the males than the male or a ... a young\nMan's scenic it's these kinds of themes that yes we went through the physical atrocity and we went through the physical abuse\nThat happened to us we were we were we were never actually in in the lines of of of ah abuse that happened to our people our elders were were taken in hit and their their sacred items destroyed\nBut those those things that's okay but our physical dean is attached to his spirit\nAnd your spirit has to be strong your spirit has to be overcoming and that's what happen no matter what happened to our people even today\nThey're they're they're getting you know they've been jailed or they've been beaten or they'd been marked and they they all these things happen to them this is this these are things that is not going to be unknown\nAnymore because this has been happening for a long long time to all people yeah too many ... it's not just the the ... the ducks\nAnd the court to people it's all over but now it's exposed you see and that's why it's so hard for our young ones to to understand because we're dealing with a lot of anger to ... a suppression of anger and that's okay\nWe just have to learn to start feeling again 'cause that's where we lost\nIn ... we now\nWe need to feel each other and help each other heal\nAnd that's happening ceremonies are happening all over now yeah and our young ones are getting that healing because if we heal our young people that goes into the earth that goes into the water\nAnd these ones that have been selected and and chosen to watch and be observers and document\nHeat because it's been so many years we've been underground with hidden we've been assignment\nNow the voice of the eagle in a condo or going to be heard together not just one singular but to gather\nMhm and not\nMore of that going to be the power of change because yes we may have gone through physical abuse that that's\nGoing to change to ... there's been many\nMiracles and and I say the word miracle but there's been miracles we saw about to camp but we saw also on the other side it's\nNot about just our site it's about the other side because we did these things for them to\n... or their generation with a lot of them ... and it's hard\nWhen we when we were doing the ceremonies it was hard because we had we felt the pain\nPain of what was going on with our young people being on the front line but we had to give our energy in our prayers to them to protect them and help thanks so they could continue the story you see\nAnd that's what it was about is about to now our voices are heard now we need to know we're still hear all of us together or not\nBread anymore it's not about just an ego in just a con door it's about the legal on door\nWhat it's about and that's a powerful thing so ceremony is still going all over it's spread all over the world now\nBut we just got to keep it going and help each other so that's what that is about and we're still in it are young people we guide them we still call them the calm when you do these things the calm\nPraying very powerful thing when you unite because that energy is very powerful and very powerful and we need to bridge\nWe've seen that one that I mean all the people came together and they dance and they stood there with their love and compassion not their anger but their love and compassion for each other or human being so that was powerful we've seen a lot of things happen there\nThank you germane um tears in my eyes Rebecca [noise] um you want it to ... yeah and German just said the word compassion so not only\nWhat was the brutality and the power dynamics um you know centuries long power dynamics exposed to the rest of the world through this\nUh through that that fall and winter [noise] I'm not just exposed to the eyes but people's hearts or opened um ... millions tens of millions I Would I Would get venture to say heart were opened and compassion\nUm and my extremely brief experience there\nUm I was handled I'm very roughly in fact I I blacked out I don't remember what happened after I was first grab by the police um I just remember you know sort of coming to an someone was pushing me\nAnd meet me saying I'm a comply with with your orders you don't have to push me and I was you know very far away but I ended up with a show\nOlder injury and I'm at any rate I I think of that and the whole experience uh in in jail which again was extremely brief and very mild compared to you know what many women face but there were um\nA three or four local local two women in jail already on like trumped up drug paraphernalia charges or very minor minor misdemeanor charges but they didn't have money to get bail and and all of that all four of them were\nAll they could talk about was their children and how their children were going to be cared for and how their their children what other family members could calm\nAnd you know feed them and take them to school and um it it occurred to me this is just this is another removals you know this is another family separations [noise]\nYou know that the boarding school was but this time it's taking the moms away\nFrom the kids at any rate I had in in my again my brief experience I considered this sort of a sacred won't because what it did was it gave me a deep understanding and not through reading books not through anything but it was a deep spiritual understanding and feeling\nGermane said feeling we have to feel again feeling of that long history of um disposition and oppression and also of love of people's love for their children and love for their family and I\nThrew being placed there through that you know kind of a freak thing that happened to me I was able to feel that to understand that and to to have compassion for people in a new way and to relate to people in a new way\nAnd then also to use my platform as a public figure to be able to spread that story you know germane was talking about continuing the story and spreading the story everywhere not just\nIn places where you know people hadn't knowing the stories but\nPeople you know and and that's what this film is about really and um I think Paul I can talk more about\nYou know how in the creation I've I've helped her produced the film but in the creation of this it's taken on a life of its own and it's it's a thing that I'm you know we didn't know germane until last year to remain in mind you we just met them out of healing ceremony on\nI'm against the pipeline at Standing Rock and and the pipeline was put down it is I'm In the earth moon under the water [noise] but um it's in the end is it and um\nThe future these yours so what would you like to say in the last two minutes that we have left\n[laughter] um\nYou know even though that the pipeline is in the ground even though I'm\nThe type that oil is slowing it it goes back to what my family was saying about the fact that the movement hasn't stopped\nMhm something was greeted there\nYou know and I I Believe that those claims that those you send the grandmothers when they came together to\nTo start this is a lot like an intention that it was like thought out or anything it was it came together by heart and compassion and spirit in combination and so that movement is still being carried and all the directions and all four directions\nAnd um and that flame is let\nAnd that's it it's a you know um you see a lot of youth out there advocating for water right do you see a and and they come in all different colors is also but that that flame that passion of understanding and love and commitment to\nThe land that we live on that we feed off of that we commune with um it's not stopping the fire you cannot stop and there was no matter how many boots come\nAnd you know try to wash our dreams or try to ... spirit or try to wash our prayers because I can\nSave or something that's really deep and me is that I came out with a ... in prayer\n... and I brought them that I had to bring on the side of the the side of the continent of turtle island and I brought them just on Iraq because I was there in prayer and I'll tell you all the use their ... it it it it's a it they're going to be the driving force it already is no\nYou don't nothing's over yeah it's it's it's one going and and and and it's it's real\n... we are all you can claim I'm thank you ladies so much money Jew dot your main ... more Rebecca Kimball um my ... too says I'm thank you do these women and there's a beautiful stories love to all of you thank you so much\nUh the film again is on Monday ... you can go there at five thirty until streaming on free speech TV eight o'clock central time\nIf you have access to free speech TV anywhere in the world you can watch it there and the comment actually as I learned is from Leslie in not somewhere shell but that's I'm fine\nI'm I'm STD nor will be talking again next week next week on a day when Nancy I'm summer and re show good job so I'm a first time he engineered\nBye bye Bye bye bye thank you [noise]\n\n[noise] [noise] [noise]\nYou're listening to W. O. R. T. eighty nine point nine at the end Madison\n[noise] wow\nI didn't know what\n\nI'm doing now [noise]\nWell good afternoon welcome to the melon Floyd summer replacement show I'm mill Floyd is on assignment but ... says always the man knows everything Mr my pants\nThank you how you doing okay good I'm a little I'm a little nervous right now because I'm about to leave with painting or about to leave for for Paris, France was Paris, Texas [laughter] no Paris, Kentucky\n[laughter] hop I noticed the the ... [laughter] there's a telling a gateway to Springfield there is a town out yeah exactly as a town outside\nOf um outside of Lexington, Kentucky where Louis Felipe the king of the French came and his is famous tour of the United states back in the early Nineteen century\nAnd he left some patio painting or something there and the name of the town is it's named after the place where the the French kings famously lived outside of Paris but it's not pronounced Versailles it's pronounced verse sales\n\nGoing out diverse sales [laughter] so we're going to Paris, France [laughter] I bet y'all know I can laugh because I'm from Minnesota where we have things like the nickel ... oh yeah yeah and it's like yeah there is a key on their let's yeah pronounce it [laughter] that's the hardest thing that really when\nEspecially a in a in a Wisconsin we have a lot of folks that have um came over many years ago with French and German and polish\nA last name and you have no idea how they bang sized them you have the slightest clue because it was just catches catch can write is kind of like well I don't know that that's too many letters lady that part out at night [laughter] I Know I've never never ceases to amaze me how uneven the angle 'cause they shouldn't of\nOf a foreign name yeah I used I used to work with a guy who came over um after the ... from Vietnam after the war ended even you know that wave that came over sure and and he said that the immigration people\nYou know the a lot of them didn't know their birthdays or anything and have records on that soon so immigration people just assign July Fourth is their birth [laughter]\nGood enough for America yeah Estee Estes here on the roads\n[noise]\nWhat's that guy's hey I just I have another thing to see to um my Shashi pledged um on line to the show very nice to me and they they really only she ate how're you doing\nA you know [laughter] I'm not really [laughter]\nWell have a good hour readings Estee yeah yeah you and thank you Marcia\n... did I had a really good pledge drive I was told so thank you all the people that pledge to se show and and we did two sons you guys sounded like you are doing pretty well less yeah we did we did not number we did not too bad we did pretty well and of course I ask Susan and the most important thing is we'd be Corrine accent\n[laughter] [laughter]\nVery nice [laughter]\nSo what are you doing in in Paris, France [noise] well I'm I'm writing a book\nAnd it's always nice to be somewhere else when you're engaged in some creative endeavor ... I've been doing a lot of work here but I'm going to be there and uh and companion as you know as an astrophysicist and so he's going to be working with the University of Paris during some stuff astrophysical like it when like a horoscopes and still\nExactly [laughter] she's had that experience on airplanes or we'll say what do you do for a living and they think that something to do with a straw that people do [laughter] so sometimes the moon rising Amy thinks that's going to happen\nIt just tells him he's a physicist which is also true yeah so he he covers astrophysics and I cover metaphysics and that's pretty much it\n[laughter] all the as I got all I got it all covered [laughter]\n[laughter] uh so while the cabin not\nTrained he keeps rolling on here I mean they they did that the very obvious ... of saying let's let's have a let's say I have a weak cooling off period and I know we'll call it an investigation but it was really a cooling off period and a and they they did this sham investigation but uh but it sounds like they're gonna vote tomorrow in him but uh\nYou know what I think they were doing they wanted a week for people to forget who Christine Blasey Ford was oh yeah and how powerful her presentation was right and replace it with their parity or caricature of her and now the caricature\nIs what they are all responding to yeah to crazy lady who some meat too crusader that has to be struck down mhm because God Forbid yet you know men be held to account\nYeah it was a little word yeah I missed last week's show and I was a little worried that are that we white males would be losing all over\nThe addict you didn't happen [laughter] worry about [laughter]\nBut this was an ... an enlightening comment from um [noise] Republican Senator Ben Sasse he he he was on the Senate floor Wednesday and he was talking about the me too movement sexual assault survivors in President Trump's inability to leads for this type of discussion\nYou reveal during the first ever Senate floor speech that in June or July he urged the president to nominate someone other than Canada in fact the urge that the nominate a woman and sassy sites\nAlthough I've said many complimentary things about judge Brett Kavanaugh and his distinguished record of twelve years of service\nI Will say that I urged the president back in June or early July to make a different choice before he announced the nomination I urged him to nominate a different individual Ayers the president's nominate a woman and now here's a\nHere's here's the the rest of the story he said here's the money shot [laughter] she said the Senate was not at all well prepared to handle potential allegations of sexual harassment and assault that might have come forward back in June and July ... they knew they forehand mhm\nAnd and and the accident they acted like they were so shocked and you know and not just that but that\nThe Democrats ambushed them and they're playing a trick on 'em and blah blah blah blah I just want to remind people and just go to compete in look it up it's the fiftieth anniversary of the first time that any party ever filibustered\nBut I mean they're basically returning to form which the activist court is exactly what you had for most of American history activist in\nThey were of corporations who favor power in capital so that's what they're that's I mean you know reproductive rights is super super important I'm not denying that but if you look at why we want Brett Kavanaugh so badly why do we want him so badly well we wanted so badly because he'll always a rule in favor of the of the owners and whose job yeah\n\nBeside of Sweden an eight year old girl was or was playing in a in a lake and she found a Vikings soared so [laughter] so now she's\nThe queen [laughter] don't work [laughter] so I'm a lottery aquatic retired [laughter] it's not the worst is [laughter] it's better than the electoral college is back like a\nA deceived people the thirty three and swords and the bottom of the lake wow held it up into the air and declare daddy I found a sword I'm not I'm a great thing yeah that's what I that's a whatever whatever doesn't my kid with us [laughter] all those ... off with their heads wanted it to the sword made of wood leather and metal could have been made Fifteen\nHundred years ago experts say cool\nWow a friend a very acidic ... yeah it was insane\nIt surprised that lasted that long after the first sort of it's kind of going to be found in Scandinavia\n\nOr the girl's name as Sega or Sega then a check she grew up in Minneapolis and course [laughter]\nI just read in the last year she is the Minnesota Vikings fan making the find all the more sweet so and people have started calling or the queen of Sweden [laughter]\n[noise]\nThere was a economic piece of economic news released today which sounded really good which is of course that the unemployment rate is at a fifty year low people were very excited about that one thing that people haven't been talking about very much though is the national debt and you would think\nTalking about this a lot because as you recall when the Democrats were running the show that's all the Republicans talking about [laughter] but now strangely strangely they're not talking about this and one of the biggest problems that's a that's coming up in in the future\nIs the fact that the interest rates on the debt are ballooning because interest rates are going to be going up here\nAnd as the interest rates on the public that this is the total amount of debt indebtedness of the United states is that a continues to climb then the share of public debt as a share of GDP continues to climb to ridiculously high levels so\nWhat we're basically seeing is a situation in which as you will recall we had a uh we basically basically had a situation which the economy was getting better already\nAnd somebody said let's boost the economy more by giving lots and lots of money a rich people\nAnd all it's ended up doing is making\nThings a lot worse\nThe deficit just the deficit is expected to total about one trillion dollars next year and that's the biggest it's been since ... twelve and you remember in twenty twelve the economy was in crisis and interest rates were almost zero but\nAll the deficit hawks of all gone silent they haven't set of worried about it and they're even proposing\nChanges that would make the deficit worse House Republicans and you might want to go out and vote on this issue\nIntroduced legislation just this month that would make the tax cuts permanent\nI think they also have a proposal that will be like another round of tax cuts which you know again we know that all would play out [noise]\nWhat what they're going to have to do of course is exactly what a herbal loving speaker of the house said ten seconds after the ink was dry was like time to go after Medicare [laughter]\nIn title ... yeah ... middle class people think they're entitled to their money right\n[noise] [noise] [noise]\nI I Love this apparently the defense department this is ...\nThis is really freaky the defense department is working on a plan to genetically modify insects\nAnd have them carrying viruses\nThat descend upon crops and then genetically modify them to withstand droughts floods and foreign tax so they're going to change the insects insects are going to come down on the crops\nThey're going to basically I guess through ... through a colonization and so and they're going to change what the crops are able to do [laughter] I leave understand as it sounds like some kind of bizarre ...\nWhile the fly in the ... while the spider I'm\nSo they're gonna be using gene editing tool for sure that this is the idea and a and this is from DARPA this was the defense advanced research Projects Agency\nAnd there they they they\nIt's called you're going to love the insect allies [laughter] and it was a ... I did this is I ... I I feel like I'm just like this is some kind of like Alex Jones is going to make a living but this is actually a real thing that's happening fail and Lansdale the aunt the insect allies\nResearch program started in twenty sixteen and they're they've been budgeted forty five million over four years to transform agricultural pests into vectors\nThat can transfer protective genes into plants in one growing season the department of defense doing this I mean I I read that swing get that there people are worried about\nSo they've got for institutions that they've roped into this uh Ohio State or as we like to say in Columbus the Ohio State university um Boyce Thompson in students in New York, Pennsylvania state you and uh UT Austin\nAnd uh so they'd be getting money to do this but critics and I don't think you have to be to a out there to be a critic of the sort of thing um critics said publishing the new research findings could establish pulmonary instruction manuals\nFor developing offensive biological weapons they're not even saying that we might be up to this\nBut they're saying that even looking at the research for how insects can be modified to carry things\nCarry viruses could be used by and I know who would think to do this but it could be used by a our competitors in the in the world foreign military programs and this is a giver again theoretical thing to say are often driven by perceptions of competitors activities\nAnd the mere announcement of a program like this may motivate other countries develop their own capabilities so you see we're going to do it and they're like well we are as good as they are you know we'll do it first they'll have it all over it so ... we're going to weaponize are insects first\n\nRound of me like writing giant dragging [laughter] with lasers on and I had to say I I feel a little more comfortable with the idea of atom bombs now [laughter] [noise]\nWell the problem with insects is they they reproduce yeah like crazy yeah and and they they like go everywhere yep and and so I mean if something goes wrong with this ... it's probably worse than an atom bomb Iraq from like the survival of humanity right\nI'm Alive long term effect yeah yeah yeah yeah and they're hard to eradicate I mean I I read that lending versus the ants story a long time ago [laughter] they ended up getting him at the end yeah\nUh did you get your presidential emergency alert the other day companion did as you know I'm off the grid oh okay yeah I don't I don't even strengthen your on your tomato can\n[laughter] I didn't receive a telegram [laughter] inside trading everybody and everything's fine candy or am for president [laughter]\n[laughter] well in the Pacific northwest right after the presidential alert the Eighteen T network wouldn't die soon [laughter] wow they they were unable to download data or use ap soon after the Texas sent\nA Eighteenth T says it was just a coincidence I uh but uh then but everybody a last Internet email all their apps and I'm really yeah so that does sound suspicious that it has nothing to do with the presidential\nText alert it was the hardware data issue ... are you sure that the that the the Russians didn't direct him to try that out [laughter] just do this if it works [laughter] little handy thing we got here\n\n\nWith us at the record straight on a a headline that I saw this week the headline was man dies from infection from brain eating a ... and I want to be really clear about this this uh this ...\nThis poor guy his name was ... he was from ... New Jersey and he was out uh swimming and uh and he ... something that happened to him and he didn't know what was going on and he started feeling really bad\nSymptoms got worse and worse and when they did an autopsy and they've ... they've discovered that he was infected with them and ... that was basically eating his brain that he got from being in the water and is his name as a declare a of salary but I just want to set\nThe last twenty four [laughter] I think the only time I ever eat fast food\nIs when we're driving on the road somewhere right and you think okay you know I Want American eating substance which I Know will be safe and reliable and so on some bachelor chow yeah I Do some arches over there I'm going that direction you know you know you don't have to stop for an hour then that you don't have to stop and you know what you're getting basically yeah\nSo uh this this survey did but the notion that poor Americans\nOr eat more fast food the report found that intake actually rose with income ... about thirty thirty two percent of lower income folks ate fast food more than thirty six percent of middle income and forty two percent of those with higher incomes\nMaybe it's just convenient yeah I don't know interesting yeah\nThey did a study in the United kingdom trying to figure out how much value to society housework household chores like washing dishes and taking care of the kids and so on\nHow much value that provides to society and the estimate which was published just this week by the British office for national statistics said that they estimate the value added about one point two trillion pounds a year which at the current exchange rate's about\nOne point six trillion dollars and um so they found that the so here's some some of the they did a breakdown of categories which is great\nUm\nThey said they so they they they basically are looked at the taxi service that you provide your child and I know you did a lot of that when when when you were you you your child was young shuttling children back and forth to swim meets and yeah and things like that lasers you have to drive back 'cause I've been drinking\n[laughter]\nWas responsible where do you like beer [laughter]\nYeah yeah it's All right um\n[noise] I prefer a dry martini [laughter] but um so that's the biggest slice of unpaid household labor which is about the the they estimated about three hundred and fifty eight billion that the taxing yeah there is not going to get us about four hundred billion and then they followed up by a generalized childcare it's about about\nThree hundred and fifty two billion\nAnd then a nutritional services and they they that was cooking and serving food and then laundry so those are the big category so shuttle service childcare center generalized childcare cooking and serving food and then laundry laundry is not as hard as it is that some of those other ones but still it's it's not fun [noise]\nSo the total is greater than the combined output and here's the interesting part of all of Britain's do retail and manufacturing companies put together and amounts to an average of nearly Nineteen thousand pounds again that's\nA little over a twenty two thousand dollar twenty two thousand dollars\nOf unpaid work by each person in Britain who's doing that uh and of course the reality as we all know is this uh this responsibility and the value that's being provided is not evenly spread according to a study that was also done written a couple of years ago\nWomen children most of the burden for unpaid work doing proportionately more than twice of the cooking\nChildcare and laundry as men transport that was the one only area where men put in more unpaid working hours than women\nThat's a lot of skimmed value there a lot of exploited labor yum\nYum yum that's how the system runs [laughter] there's the gulag and then there's taken the kids to school [laughter] same principle just a little nicer that Sarah [laughter]\n[noise]\nUh two thousand Eighteen Rand report on health promotion and disease for present prevention has painted a grim picture of the militaries physical fitness and sleep standards\n... study uh looked at about Eighteen thousand randomly selected participants across all the service branches showed that almost sixty six percent of service members are considered to be either overweight or obese wow based on them\nThere is use a body mass index and isn't it there's just as giant powerful muscles they mean BMI sometimes is is is none of those guys are pretty nice ...\nBut but the men and but yet if they use that uh the number of overweight service members is a cause concern but it it correlates with the obesity epidemic plague in the United states so the one way which the military represent\nSociety and the only way [laughter] I'm\nBroken down my service the army was the branch accounting for the highest percentage of overweight troops with just under Seventy percent [noise]\nA coast guard sixty eight percent Ninety sixty five percent right air for sixty three and Marines sixty\nOne way or another problem with the the ... was a sleep [noise]\nNearly nine percent of military personnel reporting taking sleep medications either daily or almost daily\nWow that's kind of scary for a lot of anxiety yeah the army report the highest rate with about ten percent and the Marines and a little bit less than that\nAnd ... sailors a mob six percent you know about the coast guard there are good you know the big enough slows waves rock yeah [laughter]\nUh fifty nine percent of soldiers reporting getting less sleep the needed thirty three percent said that the lack of sleep contributed to being regularly bothered by an energy efficiency\nMm So you know another another problem I just learned\nAbout this recently them when you're in the military at least in certain branches of the military you can't seek\nA mental health um help really why not well because it it it's it's\nIt's like the old fashioned stigma I mean it's like well if you're going to see a a shrink then you must be crazy and we can't trust you with you know these with his\nGun don't they don't people have the tune up concept [laughter] I just got this little knocking just being you know again I guess you just look at my at my timing change you know I mean it wasn't video or what was that it's all I'm asking [laughter] I Would think it'd\nBe more important for people like with with guns and pain yeah and in heaven and you know missiles and\nAnd stuff I wouldn't want them to be mentally stable but uh but apparently it's it's a big stigma and if and if\nIf you do that then it it kind of no pun intended torpedoes your career and uh so that so it's really an in some ways the military's fairly progressive in ... in human resource type thing but not in not in that field\nI mean is fascinating book about the brain right now and and this guy's he's on his his himself a of a neurologist but he's on this big a narrow scientists pardon me is on this big kick about how we're we we ... the brain we treat the brain as this thing on its own\nAnd it hasn't helped in a he has a chapter on a mental health professionals and and and so on\nHe says it has it really hasn't helped to a medical ... this in the way that we have because we think of somebody that has uh some issues with adjustment or whatever as having like a busted brain you know like it's like you know it's like you're you're ... you're a diabetic acceptance in the brain\nBut there's so many environmental factors so many ways in which when a person responds in a way that seems crazy they may ruby responding sensibly too crazy situation I Can't imagine it working in the military would not be\nYou know some of the responses might not just be the kind of responses that you would give ray if the if the options that you have in the things that you have to do or so in and out of themselves\nAntithetical to what a human being ought to be doing that you\nAre just acting the way you should act you know what I mean it's not your brain is broken it's the crazy right at your ways and and I'm just talking about soldiers on bases right not not in a combat zone rain or high stress\nThey're bored and they are being ordered around by people that are already sounds horrible to me [laughter] I mean that's it [laughter] my dad said he loved being in the military and I was like because he you know like a lot of men of his age\nHe had a little three year 'cause they used to have universal drafted at little three year thing that he did you know after that to the Korean War but before\nYou know before Vietnam and uh and he said I Love that he said they told me they fed me they uh they told me what to do a you know and you have to worry about anything I just you know do whatever he told me about that sounds terrible [laughter]\n[laughter] oh dear [laughter]\nNot soldier material\nNo I get bored too easily and that's part of my problem as I got that old\nADHD or whatever it's called um so are there was a fascinating editorial this week from for Rodman Jew who is the uh\nTechnology correspondent for the New York times and he was responding to this or that the Facebook announcement that you've probably heard about last week that there's been a huge there was a huge security breach that allowed hackers to infiltrate the accounts of about oh I don't know fifty million years [laughter]\nAnd ah so he said look they've lost your keys so it's time to change the locks that's what he's saying and uh he says this is is this is his claim is is what he says he's going to do I'm going to quit using Facebook to log into apps insights on line\nAnd and and here's the thing they don't really know what the full implications of all this really are the are the hack\nGave ... attackers access not justice is this is a far I'd ... you know they attacked the hacking of attackers access to not just your Facebook account but also possibly the many accounts you use Facebook to log in with\nServices like Instagram spot by air BNB tinder interest Expedia the New York times and they estimate more than one hundred thousand other sites like\nRussia Today [laughter] I still get my magazine I Know about you [laughter]\n\nA for instance a France's junior minister for gender equality Marlene ... keep a ...\nA spirit of the law and she plotted the outcome she said bravo to the bus driver for his quick reaction and everyone for carrying out the sanctions led us together put an end to sexist sexual violence and the incident occurred in a a little suburban town about ten miles outside of Paris\nTwenty one year old got on the bus when we got on the bus and rush hour and there was a man who was drunk and he kept a slapping are behind and saying things about her widely attributes\nAnd then when she didn't respond well he started calling her for everyone to describe the remarks as degrading\nAnd or the bus driver a intervened demand hit the bus driver and called and ah but then that buster called the police and lock the bus stores until they arise so it's\nPretty intense I'm hoping we don't see anything like that [laughter] so are you going to it's going to fess up to being an American while you're there are you\nGoing to yeah I Know in a no no I don't want to do that I you know I I think the thing is I'm so I'm\nUnhealthy looking that people usually take me for European so much trouble I it's it's terrible when I'm In England people actually stopped me and asked me for directions when I was in London I that cello greasy looking over there he's probably one of one of one of the English that when I ask him these are good yeah my like teeth are okay but not although as I discovered I think I told you this\nSome a mystery that I've pondered my entire life I I Do I have ... teeth because I have my two front teeth are a little bigger than the other ones next to them and I don't I have tiny lateral insiders I didn't realize that was a thing until a couple of weeks ago and apparently your lateral in size or is that the teeth that are right next year or two front teeth\nCan can be different sizes and some people don't have them at all so as you can tell you that are just you know I read it in New York Times yeah they said no this is something that the that you can people can suffer from and they showed pictures of it and I looked it up on a ... oh that's what I have no interest you know my dentist had no clue\nAbout [laughter] it's like what is your bills [laughter] hey guess what it's\nTwo o'clock you're listening to W. R. T. eighty nine point nine FM an HD Madison Time to declare the weekend so I have a great weekend everybody\nIn the pan separate triple miss yeah\nIt'll be fun I'll come back I Hope you will come back we'll come back\nAnd I hope that I Hope that Gladys inflate and and you know and everybody else Cee Lo and your other women washes up on the short hair [laughter] ... let's say that [laughter] and the mayor of Pittsburgh [laughter] Gideon John ... union mines and land [laughter]\nAre you have to get outta here the kiosk is next after that who cooks for you what the real jaguar Amy Goodman democracy now labor radio blues friday in my mind all kinds of great stuff you're on your favorite radio station W our team every week but I [noise]\nMan [noise]\n[noise]\n\n[noise] this is the answer is yes\nFriday October [noise]\nThe death penalty the Supreme Court recently did watch\nI'm Bill Newman and this is the civil liberties minutes in a case from Arizona the high court first said no to the request to reconsider whether the death penalty is unconstitutional no surprise there really\nThe high court has many ways to not decide an issue it doesn't want to but then in the same case the court somewhat surprisingly refused\nTo review a much narrower question about the death penalty\nIn Nineteen Seventy six when the Supreme Court reinstated capital punishment ruled that the death penalty would be reserved for the worst of the worst offenders and the most ... of the most heinous crimes by requiring the jury find specific aggravating factors that justify death as the sentence the problem with the Arizona law\nIs that it has so many aggravating factors\nThere between Ninety eight and one hundred percent of all persons charged with murder are eligible for death\nIn other words the law does not call out the worst of the worst or the most heinous of the heinous crimes but rather the wall makes every murder defendant eligible for death which is exactly what the Supreme Court said over forty years ago clearly in unambiguously a state dense penalty ...\nCould not do but the reason Arizona case well the Supreme Court simply denied the request for review so the death penalty verdict stands and so does the war the civil liberties minute has made possible by the ACLU because freedom can't protect itself\nThe kiosk brings your commentary for members of the public all opinions expressed or those of the speakers have an idea for your own two minute commentary emailed W. R. T. does FM dot orgy input commentary in the subject line [noise]\nIt's this weekend's that Kevin I'm hearing a caregiver for someone\nShowing signs of dementia a free workshop for caregivers will be offered on Saturday October six from ten AM to to PMS declare library for the three forty took capable of conversations with family members about changing behaviors can often be challenging\nAnd then come to this program on for tips for breaking the ice with your family to address combination for info called to six six six three eight five\nNeed help with basic computer Internet skills looking for assistance downloading library books free one on one computer\nAssistance sessions will be offered on Saturday I took her sick from nine to eleven am at the Lakeview library twenty eight forty five nurture them an avenue called two four six four or five four seven for an appointment enjoy free bird and nature\nEquipped Wisconsin DNR bird expert evil even do speak from two to four pm on Saturday October six starting at the penny ... beach thirteenth thirty Sherman avenue\nYou'll be looking for all manner of birds and recording what you see by using a bird a smartphone citizen fanfare the citizen science program contribute standard that help scientists better understand the wonderful world the birds for info called to six six or seven one what\nThe answer to maybe okay that's good to pre recorded segment featuring a commentary in the calendar of daily events events must be low cost or nonprofit interest to people in the W. Archie listening area in which other media might not high like we've been announcements at least ten days before the event\nThat W Archie of him dead orange slashed kiosk announcements the gift because it build on line looked up your ... of them that orange slash kids this has been the insurgent radio can't read which is a five six thirty in the ... pm with engineer lead me and then made [noise]\n\n\n\nWho will go on friday to old fart folks [noise] started off the sonic you [noise]\n\nYeah some smart or on a cute [noise] [noise] [noise] [noise]\nAll this from the made in the usa they'll get some more exotic you coming back you know\nDa da\nZap\n\n\n[noise]\nAnd that's so much I knew you know it's just need by mud honey from their album super ... big mouth came out in Nineteen eighty eight on some pop records songs called need you may have heard smashing pumpkins yes does smashing pumpkins\nFeaturing Belichick Oregon will be coming to the ... November twentieth\nTickets went on sale today I Believe it was sold out don't mark my words yet maybe tickets available somewhere but we heard the smashing pumpkins from their debut record dish you know virgin records we heard the song right Nasr is\nRecorded here\nIn Madison at butch big smart studios\nRecord from Nineteen Ninety to Ninety One right\nHere in Madison, Wisconsin also banned that had spent some time at smart studio sonic youth was secret girl that's from the made in the usa soundtrack a little bit different version and what was appearing on evil and if you like words that's love spelled backwards\nE. V.\nO. L. oaks you are listening to W. or TAD nine point nine F. M. H. D. I Want to thank all of you who pledged your support to who cooks were you and more importantly the station here in Madison and this is your back porch broadcasting\nCommunity radio you the listener or what keeps us going\nSo much more this to Twenty one and the PM folks\nYou're a you know sorts of stuff coming up\nIt's night is the kickoff of turkey fast with the ... playing over at the crystal corner tonight and that Mickey's tomorrow will be no bunny and a whole slew of other bands including wash new local bands\nUp and coming younger younger group I'll give you more information on that you also have to have ... going to be playing tomorrow night at Mickey's tonight again turkey breast will be happening at crystal corner I'll have more information on that\nComing up I got this first I think you'll you know I think it really really going to love\nGene safe invites you to participate in the third annual trick or try five K. walk run this year's event will be at Franklin school on Sunday afternoon October fourteenth at one o'clock this family friendly event features face painting balloons a kid's stash and trick or treat stations along the route\nKids in strollers and dogs and costumes are welcome participants receive a long sleeved T shirt in Halloween slack of choice\nThis year's options are unicorn ... race proceeds important gee safes worse to create inclusive schools for el G. P. T. Q. use registration and information is available online and gee saved W. I. dot org or by calling six or eight six six one\nFor one for one\nConnecting you with the builders of safe and inclusive communities this is W O R T eighty nine point nine is Sam Madison\n... hello hello yes that's right that's Madison folks you're listening to W. or to eighty nine point nine up I'm an HD on the real jaguar just more ...\n[noise]\n\n\n\n\n\n\n\n[noise] well\n... ... ... [noise]\n\nNa na\nAnd na\nI'm a God and man\n\nNa\n[noise] ah\nNa na na\n\nWell [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\nIt's another law by [noise] another law by you may from cocktail twins [noise]\nWell the buys to violate volume one folks\n[noise]\nWe heard the song ... they're\nWarm up here [noise] afternoon here the chili is a message to forty three and fifty three seconds where the scientists with frantic romantic before that [noise]\n\nWe heard DiMaggio Washington from the album heaven and earth street fighter mice came out on young Turks you're all caught up you're listening to W. O. R. G. eight or nine point nine FM an HD [noise]\nWhat I think a very special happy birthday wish to Wade\nWill be listening for having a great day [noise]\nAnd um [noise]\nAny else anybody else who had a birthday happy birthday to you to\nThe wonderful time of year [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\nOh no no\n[noise]\n\n[noise] I saw\n\nStory goes through ...\nPictures\n\nWhen\n... ... ... ...\n\n\nAin't you futures to one day ten band music festival to Madison Saturday I sold the thirteenth for the um\nThe miners ancient futures too is about mixing up an opening my loosely focused on like Iraq and electronic\nThey bring in headliners run all over the country ... built and regional lax\nHow heavy metal band [noise] way metal should be sold for bastards cemetery of old Chinese gothic country\nMusic and vanishing postpone the rational and more anxious to Taliban music festival Saturday I sold was she\nValue and formed\nBy eighty nine point nine or ... FM in Asia [noise]\nOoh yes I recognize that voice that should be a good fest [noise]\nSounds interesting lots of good bands [noise]\nWe just heard teen gives it in the lizard wizard during a journey to shell\nOut between the mild high club the album sketches of Brunswick east features mild high club came out in two thousand Seventeen on HBO\nRecords they also hurting desert and the lizard wizard\nFeaturing you know at my old high club the book that's what we started off that can gives her block with\nBefore that banned from Ohio Helen from Cleveland parrot ...\nComes from a compilation one man drives while the other man screams mountain rough trade records in Nineteen eighty nine we heard the song rap city in pink you're the interlude of Stefan ... Ali and Yahoo de ... new and with just one of those things Cole Porter cover\n[noise] you're all caught up you listen to the W O O T eighty nine point nine FM an H. D.\nI Love this whether you're going a little fast your eyes start watering\nW O R G thanks with listeners sponsors and budget bicycles setters used bicycle showroom located at nine thirty region street they used bicycle showroom offers vintage bicycles from ... in Raleigh and ... as well as refurbish bicycles for people of all abilities including one speed cruisers three feet up rights\nAnd bicycles built for two to five one one six six three\nAnd if I if I didn't mention the nerve you hadn't heard I Want to take everybody\nFor donating so generously to W. O. R. T.\nHelping us make\nThis fall pledge drive successful especially for those who donated after the pledge drive was over it helped us kick us over our goal or meet our goal I should say\nThank you very much for donating your hard earned cash hard earned money to community radio [noise]\n[noise]\n\nLet's say we've got some Wesley Willis [noise] my request we'll see if we can get some of that um [noise]\nI go back to Australia actually were in Australia or like [noise]\nSome king desert in a lizard wizard underneath us\nIs one from a compilation where bird men flew [noise]\nEspecially where I pulled that scientists\nRecord from Earl excuse me that scientists song frantic romantic\nEarlier and things to build the walking doctor will be playing music tonight [noise]\nFrom eight to eleven\nPart a friday on my mind [noise] the rotating cast of DJ's he'll bring you [noise]\nWonderful selections\nTimes live music here at the station every Friday from eight to eleven [noise]\nAnd they build a walking doctor I Know he'll be going down there [noise]\nThis comp I got from an old friend Jamie [noise] we lost to assume they mean ... [noise]\nWe're going to hear one now from New Christ face a new God [noise]\n\n\n\n\nBeing a new\nJob now all I Know why or a\nOr a job so I don't know what I'm saying so how long are you a\nCheck or you know\n\n[noise] [laughter] [laughter]\nThe guy the get go home\nAnd [noise] and [laughter] no no no no I'm I'm a long\nTime [laughter] God and da da\nDa da da da da da\nDa da\nDa da\nDa da da da\nUh [noise] how do I do and I was a real thing\n\nAnd and ah na na na na\nNa na na na\nNa na [noise] and the bad guy [noise] the\nGuy that I\nLive on it and [noise] um [noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise] [noise] ... woo\n\n\nWhat not\nWell\nW. our thanks to listeners monsters in high noon sullen located at seven oh one east Washington avenue high new features music theory ... seven nights a week and it's available for community events apply the parties to sixty one one to two or high dash news dot com for more information\nLike you ... ... we just heard\nThe most Sheldon Adelson from Japan though it's a collection titled collection on alive records and we heard world and that was the primitive version before that ...\n... W. O. L. I. S.\nOriginally came out on the gun hill label who do you love and we heard Pussy Galore with hang on that's from their album Dial M\nFor murder a foreigner\nI came out on Caroline Records in Nineteen eighty nine we heard new crisis the new Chris snow crisis with face a new God\nThat's from accomplishing legends of marsupial punk ... has double record your all caught up you're listening to W. artsy eighty nine point nine FM an HD your listener sponsor community radio in the real jaguar coming at you every Friday afternoon from two to four thirty\nOnline at W. R. T. F. M. dot O. R. G.\nWhen you think everybody from the community radio by and for the community becomes all that more real things to your generosity so thank you very much for sponsoring and supporting community radio especially here at W. O. R. G.\nEighty nine point nine FM an HD your listener sponsor community radio hey here's wisely well is what we will us by requests as one's called chronic schizophrenia [noise]\nAnd [noise]\nMy mind plays on me every time I make something and bring people out of my head in vogue or at least starting raining [noise]\n\n[noise]\n[noise]\n[noise]\nThe main calling from\nBeing ridiculed Tony bombing cause dementia\n\n\nGrind age and I'm Renee is brandy a\n\nNone of them are not going to Chicago punching\nActually rebuild excitement [noise]\n[noise]\n[noise]\n\n\n\n[noise] burn da da\n\nDa da da\nDa da da da da da\nDa\nDa da da da\n\n\nDa da da da\n\nJohn [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\nMm [noise] Mm\nMm\nMm [noise]\n\n\n\n\nLike a bird fly [noise]\nUm [noise]\nNo no no no\n\nNo no no no no no no no no no we joke about me or\n[noise] [noise]\n\n[noise] do\nThings they\n\nDo have\nThe high dollar during\nThe day to day and the people that are still stay in\nAnd and the truth is the\nWith the dog the\nTo be there for me to be able to win in the late\nTo\nThe boat and\nOn all the\nTo\n\n\n\n[noise]\n[noise]\n\nThe two thousand twelve ward winning album cheddar revolution has a sequel celebrates a release of the new cheddar revolution songs of resurgence on Sunday October seventh from five to eight PM as a harmony ... an adequate [noise]\nSon for searching the compilation of the original songs by Wisconsin musicians written to his fire citizens to rise up and reclaim our state in the coming election this fall ages gallon will include performances by which the farm\nKen ... borderlands get away driver's material voice Germany art students in so many more the songs of research and album released party is Sunday October seventh from five to eight PM harmony Byron adequate\nFor more information and the food ban list visit Wisconsin protests dot com W. O. R. T. V. nine point nine FM listener sponsored community radio\nWe just heard on the bang bang club the road house\nWhere the twin peaks series this herd viva Las Vegas by Shawn Colvin get mistaken on that tip with Rebecca Del Rio for that same album songs called no stars are we're it's written by David Lynch\nJohn Ness yeah Rebecca Del Rio no stars\n[noise] mhm mhm\nMhm mhm [noise]\n\nMhm [noise] mhm [noise] mhm [noise]\nI\n...\n...\n... ... ... maybe\nA little da\nDa\nDa da da da\nDa\nDa\nDa da\nDa\nNa na na\nWould it make\n[noise]\nThe\nThe\nThe [noise] [noise]\nNo [noise]\n\nNo\n...\nDo ...\nPm dude\nOr ...\nOr none ...\nA ... ... ...\n...\n...\nPeople you\nKnow the\nThe\n... [noise]\nMm [noise] Mm [noise] Mm\n... de\nYa\n\n[noise]\n[noise]\nDidn't need\n\n\n\n\n\n\n\n\nBe able\nTo do\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\nHow many ... thinks it's listeners sponsors and maximum ... music magazine hot off the presses every month available music stores clubs cafes and restaurants from Madison to Milwaukee whitewater to La Crosse in Steven's point\nMaximum in covers the local music scene from local to national shows and features a club challenger on every issue as well as on the Web at maximum dash in dot com\n[noise] Wisconsin union presents the indigenous jazz series featuring fathers guy friday October fifth seven thirty in the play circle\nAt the Wisconsin union theater\nThis Milwaukee based jazz trio is headed by classically trained pianist and composer Anthony ... accompanied by basis John Christians and drummer desk and drop got\nThe trails lyric based songs site a diverse cast of artists and styles from Paul McCartney Janine is among and lose the gospel fathers guy friday ... seven thirty in the place or\nOriental at union that whisk that any keeping you have to swing and flavors at all the local ... since Nineteen Seventy five this W. R. T. eighty nine point nine FM listener sponsor the re me\nYou know we heard one from ... mall on what's ... ski on a trim accomplish in Bombay the hard way no excuse me the Bombay connection yes [noise] yes Bombay connection before that another from king deserting the blizzard wizard thinking\nListeners for love and the the king gives there's also that was we will is back there\nThat can gives her most recently was most of what I like\nFrom their album paper machine dream balloon before that we heard strange harvest with the song amnesia that's from a cop temporary selections from the Indians pop underground during it didn't use me we heard Rebecca Del Rio with no stars that's from the twin peaks music from the limited event series\nYou're all you're listening to W. O. R. T. eighty nine point nine ... H. D. mentioned turkey fest this happened and starts tonight crystal corner and heads to Mickey's tomorrow\n\nWhat is the nicest as also from that bond bacon accidental I guess ... I Believe you're listening to this and that will get back to some seldom Zelda but seldom\n[noise]\n\n\n\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\nThat was the burning trained by our government has felt up what who town of ... [noise]\n\n\n\n\n\n\nThink we will be will be\nThe\nYoung\nYou know the\nThe the the\n\nRight before so I mean nobody I Know what it was but it's not your fault that was well you know\n\n\n\nOh well there we go with all the violence\nNothing no\nReally ... in\nThe ...\nBobby husky who started turkey fest in Turkey Kentucky records\nCelebrating music from all over the world here in Madison starts tonight at crystal corner [noise]\nAnd tomorrow and [noise]\nJust heard a song there is called future dust [noise]\nWho look it up a little um preview some democracy before that Jay retired\nFrom the album blood visions came on and the red records in two thousand six song called turning blue [noise] underneath me some more sonic youth [noise]\nGetting close to earthquake minutes so stay tuned you are listening to W. O. R. T. eighty nine point nine F. M. H. D. [noise]\nYour listener sponsor community radio which you\nAre listening ... has listened to your yes listen tears combination of all the volunteers and listeners\nAnd hard workers [noise]\nThe staff here thank you very much for all your support [noise]\n\nIn war it grows on you [noise]\nAnd the real jaguar coming at you every Friday afternoon from two to four thirty\nIs it time are you ready are you ready for this I don't know if I'm ready for this yet either um [noise] we got it are we ready All right oh my goodness I feel like there's [noise] there's a lot of shaking going on you ready I'm ready\nTo uh even corrected it yeah oh now I went and got bubble gum in my mouth\nWell how did how did the correction go\nOr the correction like good except I still said when's sailing I corrected myself now this is the final correction I promise wind surfing\nOkay is that a new online thing in Chicago\nI think it's I think it's what they were doing out at tiny park down like my daughter oh well I think what the big sale and I think that's like a surf board and it was a combination whim sales surf boarding so they call it wind surfing\nYou know when I have too much to look at it I get bored sometimes too\nSo get yourself a wind surfing or a parachute and get out there on a board I'll be watching for your height your guy here did you want me to proceed with us jaguar of course\nNot quite a new production yet but it is time to start watching the Vancouver Seattle region for a big earthquake sorry to say also Guatemala Colombia and Ecuador prediction could be coming soon that one just made landfall Japan's shook Japan and real bad\nAnd unfortunately once in awhile I like to say alert for Seattle um Santa today Kelly Mesa, California had a three point six Richter Sunday\nAnd a three point five ... years on Monday This week so we will keep watching all of Southern California for a five five point eight maybe up to a six on the Richter scale there could be maybe even bigger and I could go all the way down and they had a four point for and northern Mexico too\nAnd then they just had a couple of them out to San Clemente island three point three and a three point O. yesterday dealt in San Diego to because I'm moving on because of Indonesia a death toll now they're fourteen hundred in its\nCounting you see the size of that ship that landed in the middle of the city no home I got it looked like the Staten Island ferry big bow they said the waves must have been forty feet high that wash them he was\nA it was under control and everything and it was ... well I'm going to park it here like right in the middle [laughter] anyways because they win an airplane in the middle of a busy intersection his was pictures were\nAll over I got a couple of good ones I'll bring them next week in an offshore um to you I'm because of that Indonesian earthquake tsunami we're not watching Italy because this'll be the tectonic plates moving Italy turkey Greece Burma and New Zealand I mix back to New Zealand to get some shaking here one of these days major earthquakes there and\nAnd if I got stuck and Tokyo pie or Chile I don't sure I'm pronouncing ...\nAn almost sounds like a all around the Pacific desert\n[laughter] talk about what all was whipped cream I'm hungry October new moon jaguar window runs late Sunday that new moon is you're right about now through this Tuesday this week and there is sure\nTo be lots and lots more major earthquakes coming this week don't forget to tell everybody you heard it first right here on earth quite\nMinute yes much needed info we don't always get here in the mid west and a lotta earthquake's coming it which comes where's the predicts you know the quake\nOh oh well we had that one and we talked about Indonesia on the air or winter for one week before it happened it happened like ... and nice I set my ... my words were the next uh Sumatra sized earthquake tsunami around well and they have why it's not hard to predict anymore we do it right here on the show\nThe Indian Ocean tectonic plate is moving it's on the other side of the plant\nBut we watch 'em ... stole like Italy and Greece around me\nWere definitely approaching that production for sure yeah hey what's needed info thank you eat your guy I don't think you jaguar and W. R. G. ... always here on W. R. T. random and getting back to the listeners were pledging too great on that yeah for sure hey\nJust and we do have some tickets to the ... McGee so at a Sylvie happening tonight at seven P. M. with son squad be\nSon squad be will be in attendance opening up again that friday night today it's all ages I've got one pair of hard tickets so you have to come down to the station to pick these up I'm I'm gonna put on a song here and we will get right back to some\nUm given away we only got about four more minutes so yeah I'm In a hurry this up here in the black from their album not nothing to\nFancy music by a priest muggy it's you [noise]\n\n[noise]\n\n\nNever had a dog\nGoing to be moving\nThe so called investigation was released yesterday only one copy was printed for the entire Senate to share\nJournalist confirmed independently that other women with accusations against Kevin Oh we're not contacted Lizzie Ford's attorney claimed that the FBI did not even try to contact her\nToday Senator Joe Manchin became the one Senate Democrats to vote for closure on the cabinet nomination fifty one votes for closure forty nine against labor radio asked ... both the seemingly strange demand by mentioned that she showing him quote respect unquote\nClearly I wasn't being disrespectful I was asking for an answer to a question that all of his constituents deserves an answer to but I Am certainly used to being outspoken being confused with disrespect as a woman with thoughts so\nThat was Emily ... a high school teacher a union activist and an activist for women's rights\nAdditional audio for the segment was provided by boat with West Virginia women\nThe vote to confirm Brett Kavanaugh to the Supreme Court is scheduled for tomorrow\nJust mentioned has announced that he will in fact vote for cabinet the one Democrat to do so with the ... foot boat of Republican Senator Susan Collins Kevin O's expected to be confirmed at press time mentioned is the one unconfirmed Senate vote\nLast friday the house Republicans voted to permanently extend individual tax cuts put into place through President Trump's two thousand Seventeen tax law\nThe two thousands Seventeen law lord both corporate and individual tax rates and included other changes such as larger standard deductions deductions for pass through businesses GOP lawmakers made the individual tax cuts temporary\nIn order to comply with budget rules that allow the two thousand Seventeen law to pass\nWith a simple majority vote in the Senate Josh ... research director with the economic policy Institute in Washington DC explains what the new legislation will mean if it's passed by both legislative houses\nThe tax cuts related to things it was a huge cuts a corporate income taxes and it provided some cuts for individual income taxes that\nThe individual parts of that are actually set to expire in twenty twenty six where's the corporate rate cuts for a permanent the corporate rate cuts are the ones that most obviously accrued to the very rich and and so in response to that the Republicans are trying to make the individual income tax cuts permanent as well and that is most of what this new tax bill is about\nOne of the leading arguments for the ... tax cuts has been that it will raise the wages of workers and that will help stimulate the economy that is the old trickle down theory ribbons addresses that argument\nBasically eighty three percent of the benefits when it's fully phased in go to the top one percent these are not people who then run out and spend it these are not people are constrained paycheck to paycheck in terms of what they spend money on so it's going to provide some stimulus but really weak stimulus relative to sort of anything else that the government could have done with that money\nCorporate investment of the additional dollars is another argument often use to support tax cuts\nThe other thing that is supposed to happen when you cut corporate tax rates is this a long chain of reasoning through which you cut the corporate rate you\nInduce more investment in tangible plant and equipment and software and research and development that leads to higher productivity in the economy and that eventually trickles down to a higher wage growth for workers there's zero evidence that any of that\nIs happening or it's going to happen it really hinges on the idea that higher profits will do some more investment but we already had historically high profit rates and got investment was really weak to the degree there is a problem in the U.S economy to date it's holding back investment is not the profit rates are too low there actually historically high so it just is attacking a problem that doesn't really exist\n... pointed out that taxes provide the services infrastructure that helped to improve the economy overall\nIf roads were free is the safety net was free of Social Security was free then not wanting to pay taxes would make some sense\nThey're not free I think and I think many people agree that they are worth the tax money we spend on them so the idea that the quickest route to a healthy economy it's just slashing away at taxes\nIs just doesn't make a lot of sense you can look at the last time we had a really good quick economic recovery nationally was in the Nineteen nineties where we actually raised taxes quite a bit at a much stronger recovery than say compared to the early to thousands where we cut taxes a lot\n\nOn a jumble of this outcome can be seen on the local level when comparing economic growth between two neighboring states that took very different approaches towards tax policies\nYou can compare your state Wisconsin to a neighboring state Minnesota which took a very different policy path starting at twenty ten Wisconsin took a anti tax anti regulatory anti union stance Minnesota what another way and since then the historical record is really clear Minnesota's economic performance and ... has been clearly superior to Wisconsin's\nThe bill is not expected to vote in the Senate ahead of the midterms and it is unclear whether the tax cuts will actually help Republicans in the elections in order to pass the Senate the bill needs sixty votes however only fifty one seats are held by Republicans some Senate Republicans have said they wouldn't support the legislation do does impact on the deficit\nAnd the Senate they would need to get over a filibuster and so I don't think they will do that I think there's also concerns about\nThe additions to the deficit caused by the early rounds of tax cuts at the end of twenty Seventeen some I guess we don't see these new round of tax cuts become law I think the one wild card is what happens in the lame duck Congress after the elections headache regardless of which way the elections go you\nCould have a lot of people in Congress who have lost their seats but still get to vote you decided to get one last gift to big pain contributors and send them through I don't think it's likely but we live in a strange political world these days\n[noise] that was the economic policy Institute research director Josh movements\nLast week President Trump Canadian Prime minister Justin Trudeau and Mexican president and the drinking thing yet neat though announced these so called United States Mexico Canada agreement\nU. S. M. C. A. the three leaders claimed it's a significant reworking of the north American free trade agreement or NAFTA labor radio talk today with Peter ... the general president of the\nUnited\nElectrical radio and machine workers' union or you eat about the effect of us MTA and what it might have on organized labor and working people note and says the new agreement must first be understood in the context of NAFTA\nPeople should remember that NAFTA which was passed from Nineteen Ninety four with a horrible trade agreement the biggest beneficiaries of it where us corporations particular grain companies but also us auto companies us renewed fractures ... Mexican workers for their own benefit in their own gain or their own back profits and the huge influx\nOf Mexican families and Mexican workers from Mexico to us happened after NAFTA was passed estimated that upwards of five million people wash their small family farms as a result of cargo marched into government\nGranted corner and to the Mexican markets disagreement will not completely by any stretch on route\nUnions in the United states and Canada has so far reserved official comment on the complex deal\nEarlier this week F. L. CEO president Richard Richard Trumka wrote quote the text we have reviewed even before the confirmation that Canada will remain part of NAFTA affirms that too many details still need to be worked out before working people make a final judgment on the deal\nOr a history of was witnessing unfair trade deals destroyed the lives of working families\nDemands the highest level of scrutiny before receiving or endorsement unquote however note in notes that Mexican unions have reached a conclusion the U.S and see a it's not good\nThe Mexican independent trade union movement pretty much unanimous Lee rejects disagreement and would much prefer not to agree to be renegotiated and where and Obrador becomes president in December\nAndres Manuel Lopez Obrador is Mexico's president elect a social Democrat who was promised reforms that will directly benefit workers they're so Trump and Trudeau negotiated with a lame duck Mexican president and that may have been intentional\nYet politics a side note and does see two provisions in the proposed agreement that should clearly help workers maybe next you know and certainly in the U.S and Canada\nThere was clearly some parts of the agreement that have been reported to show you that the I asked the asked which is the interstate you as allusion mechanism\nWhere corporations historically have been able to go before a panel of corporate attorneys and been able to just totally destroy the sovereignty of communities in Canada Mexico and the U.S on the interstate dispute resolution that provision has been wiped out has been taken away so that's a plus the auto content rules that have been reestablished\nIn the new agreement are much better than the old agreement\nAnd it will definitely benefit of auto workers the U.S in Canada\nThe U.S and he also sets wage floors in the auto industry which should be good for workers well in theory as ... note in explains\nPutting weight floors in any of these kinds of agreements that is a meaningful rage floor and that actually works to raise wages amongst lower wage workers in\nOn the north American continent would absolutely be a benefit to\nAny trade agreement we've been demanding a long way a Canadian unions in particular uniform\nThat a key piece a any traded in between the three countries raises significantly the wages of Mexican workers and does away with what we call the yellow dog unions the company unions that had protections contracts in Mexico and prevent workers from having a real democratic union\nOn Monday October eighth rallies by all four postal unions the national association of letter carriers the American postal workers union the national rural a letter carriers association and the national postal mail handlers union will be held in each congressional district throughout the country to say no to privatizing the postal service\nUS mail is not for sale rally held on mountain in medicine at the U.S post office\nThirty nine oh two Milwaukee St in Madison\nThis is ... this is an anti privatization rally designed to preempt recommendations that may be coming soon from the postal commission for more information go to any L. C. dot O. R. G. slash US mail not for sale [noise] the vendors from noon to\nFor an October we\nAll are invited to celebrate indigenous people's day on Monday October eighth that the first Unitarian society in Madison\nThe event begins with the community dinner at five thirty pm followed by a showing of the film the eagles and the ... or from Standing Rock with love at seven PM following the film will be a discussion with filmmaker poll that more and producer Rebecca Campbell the event is free but goodwill donation is can be made to help support\nWater protectors working to stop the back forty mine\nThe event is sponsored by W. R. T. Bruce ... society whole chunk gaming Madison and many other social justice and environmental organizations the first Unitarian society is located at nine hundred university bay Dr Madison\nAs a reminder its fundraising time\nThe United way of Dane County more information can be found on the drive at the United way of gain county's website United Way is also helping with the coats for kids campaign this year volunteers have needed at the community action coalition officers from three to seven pm on Wednesday October seventeenth contacts in the United way if you can help [noise]\nMore than ... oh okay [noise]\nBanks are listening to Madison liberal radio thanks to editors frankly I'm back in Illinois ... assistant Robin ... reporters Greg ... and Tony ... and damage control specialists Joanne powers special thanks to keep stuffing our reader coordinator into our readers and the members of our B. E. W. local twenty three year old\nFor W. O. R. T. staff\nCollect I'm very Mitchell from asked me retirees\nAnd we also like to think Lydia Stevens or announcement coordinator and I'm Ellen loans or and we'd also like to thank all of the generous contributors to labor radio N. W. O. R. T. please stay tuned for the blues cruise with Dave ...\n[noise] [noise]\n\n[noise] W. R. T. sixty I'm a local news is seeking new producers features\nMaybe you love books or beer or food wants to review them for us how about pro finally local artists have a lot of science want to share your knowledge with W O R G listeners joined more than three dozen community members who work on our local news program\nThat came up with our recording studios professional microphones and audio editing software you'll produce a weekly five minute segment for broadcast and\nIf you have a fresh idea at a few hours each week to commit get in touch contact news director Molly stunts that there'll be or to you by email she's at Mali at W. or two up on that [noise]\n\nOh no [noise]\nNo I\nMean you\nYou might not be able to\nDo the\nJob [noise]\nYou know I Love you I don't\n\nKnow I I don't know what\nTo\nDo [noise]\n\n[noise] um so I Would cry [noise]\nJust\n[noise]\nYou\n\nKnow the problem is that [noise]\n\nYou know [noise]\nYou from man\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUm [noise]\nYou\nNo place to [noise]\nNo fun at issue [noise]\n\n[noise]\n[noise]\n\n\n[noise]\nMhm [noise]\n[noise] [noise]\n\nThe Wisconsin union presents the indigenous just your dream fathers died friday October fifth seven thirty in the play circle at the Wisconsin union theater\nThis Milwaukee based jazz trio is headed by classically trained pianist and composer Anthony ... a company by basis John Christians and drummer desk and drop got\nThe trails lyric based on site a diverse cast of artists and styles from Paul McCartney Janine it's among and lose the gospel fathers guy friday ... seven thirty in the place or\nAre there more into at union it dealt with that you need to keep and you'd have to swing and flavors that all the local ... beds in Nineteen Seventy five this W. R. T. eighty nine point nine FM listener sponsor you raised me\n...\n...\nHas been from ... in the\n\n...\n... na\nNa na na\n\nNa\nMan yeah\n\nNah\n\n[noise] [noise]\nDidn't you do it All right you got that knowing that the [noise]\n\nReading my way to spend much time to be at ...\nYour meat always ...\nLying to me on the line I made in ...\nTold me many movies like Jay Leno and who knows who knows no\nOne of these day in Maine and does it make you really do I make sure that they planned mapped out how to make\n\n[noise]\n\n\n\n\nDa\n\n\n\n\n\n\n\n\nAnd he said\nHe\n... he says\n\nWhen Bob\n[noise] and the mother\n[noise] despite all the time\nAnd the sister and brother\n[noise] your\nAh [noise]\nMm [noise]\n[laughter] isn't that\n[noise] as far as hobbies [noise]\n... [noise] to\nCouldn't sit\nNo time for the call because I saw that brought them from\nReally nice [noise]\nYou know so\n[noise] you're just starting\nThe ... ...\nWhat type of\nMoney [noise]\nSo [noise] some\nAnd that was one of the blue you\nKnow [noise]\n\n\n[noise] I'm with them for it at all [noise]\nSo [noise] I don't\nKnow me alone\n[noise] [noise] [noise]\n[noise]\n[noise]\n[noise] it's been since\nThe teams to the middle of\nThe [noise] the in the\nMiddle um [noise]\nHe manages to be [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\nDa\n\n\nDa da da da da da da da da\nDa da\nDa da\nDa\nDa da da da\nDa da da da da\nDa da da da da da\nDa da da da da da\nDa da da da da da da da da\nDa de\nDa de ...\nMom you know\n... de\nDa da da da da da da da da\nDa da da da\n\nDa da da da da da\nDa da\n\nHello this is Sarah Eliot market manager for the Dane County farmers' market the original Madison farmers' market around the Capitol square\nIn partnership with W O R G FM this is your farmers market report for Saturday October sticks well the countdown has begun including tomorrow's market there's six more Saturday in our outdoor market season\nThe market is open rain or shine\nAnd we promised it will be filled with Wisconsin goodness no matter whether the apple is ubiquitous proof of fall but I Would wager guess that you might take the apple for granted to help correct that today I'm joined by one of our growers Genevieve Weston from west and antique apples [noise]\nHello Genevieve hello Sarah can you tell us a little bit about your orchard\nYeah well my great grandfather started the orchard in Nineteen thirty six\nI'm now the fourth generation I'm it's run by my father and my aunts who are in their late eighties and my brother and I um and we've been operating it since Nineteen thirty six and I've been out where since I was seven years old so it's forty plus years now that I've been selling every Saturday on the square\nOh that's fantastic um how many varieties of Apple's grow\nWe grow over two hundred varieties this particular Saturday all have over twenty at the market and we do have parents as well so the apples and pears that the market\nWhat are some of your favorite varieties\nA well what we have right now what's coming in Saturday's the golden Ross said which is just lightly hard and very rich\nIn flavor at an all purpose apple but I just love eating it out of hand um we also will have the kids orange red which is half taxes orange and half red delicious\nSo it's very sweet but that vitamin C. the Cox's orange give that it's wonderful flavor and then another favorite town which is half mackintosh but half Jersey Black and it has it's wonderful crunch to it and the effervescent tape of course for baking we have the wolf\nEr which is not the greatest Marshall Grady it's very large it\nAlmost your entire head and it's excellent for baking whole because it's yellow skin turns golden and it come away from the meat of the apple and it's just wonderful\nOh that sounds delicious thank you so much Genevieve I Know that makes me excited for an apple a day this is Tara Eliot and this has been your farmers market report for Saturday October ...\n... ... ... ... Mm\n[noise] [noise] [noise] [noise]\n[noise] [noise]\nMm Mm\n[noise] [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nMm\n[noise]\n\n[noise] [noise]\n[noise]\nWalk longer\n\nWe're all in\nAll know [noise]\n[noise]\n[noise]\nOh well good morning\n\nAnd uh\nYeah check it out war pack of memories dot com as a link to it and that's happening tonight or tomorrow night up in war Packer\nWell we got some more blues coming up for you momentarily we're going to listen to some from BJ Miller right after this message\n[noise] Mm Mm", "year": "2018", "show_name": "no_show", "city": "Madison", "day": "05"}