{"month": "10", "state": "WI", "station": "WORT", "content": "[noise] [laughter] [noise]\n\nI mean\nMagazine\nSingle man [noise]\nOh\n\nWell who knew\n[noise]\nI'm [noise]\n\n... na\nNa na\nNa [laughter] [noise]\n\n[laughter] [noise]\nKnow\n\nThe older brother's outskirts of town\nBill who wrote that yeah\nThat working does a great version of that too often what his Fillmore East double\nThat's from Fillmore East February Seventy not the legendary ... Fillmore East albums a different one\nBill huh and or for that\n... or the letter from the mayor dogs an Englishman album Rip Patton by request it's just a matter of time the Neville Brothers by request Congo Square\nAnd we started off the set with\nLani Mac by request Memphis from him coal for collectors only it almost looks like it's a re release of er of his first album but then it came out on a lecture records he was saying to elect her records I'm In the seventies\nYou're listening to W. R. T. eighty nine point nine FM in Madison\nLet's see what's going on blues why's this week\nIn Madison area let's see bill was kind enough to mark up the mess and I don't see anything tonight find that hard to believe friday night at Madison times must be good nobody's got the blues yeah or\nA tomorrow night at the knuckle down Valerie be in the boys that convinces at nine PM also tomorrow night at the north St cabaret Paul see bars tomorrow sound that convinces at eight\nAnd on Sunday at the north St cabaret Chris do arts a group excellent that starts at seven PM\nThen or are we jumped to a well before I forget both today and tomorrow\nBelieve a Johnny China's will be at the lounge it Louisiana's starting at six thirty and then he'll be their Tuesday and Wednesday evening starting at sick then on Thursday\nTable will be hosting the blues jam at the knuckle down that starts at eight thirty at north St cabaret big Sandy and the fly right boys know rock and John Will be there that starts at eight PM and at the Sylvie government mule that convinces at eight PM\nAs well and Eric\nJohnson will be the bearer more that starts at seven thirty he's a\nGuitarist who's all over the place and uh I'm sure he might play something bluesy at some point during the show live music that's where it's that go out and see something\n\nGot a message for you and they were going to get to some bitter Smith\nRight after uh these messages\n\n\nThe life presents and government meal Thursday November\nFirst seven PM at this little\nBurn right from the Allman brothers band in Nineteen Ninety four guitarists Warren Haynes an original bases Ellen woody warm government knew drummer Matt out queens played with in the Dickey bets ban\nSteeped in the roots in the rock blues soul in jazz government news recognize words during songwriting and storytelling as it is for the improvisational virtual city that fuels their\nCultures like performance\nIn the evening with government meal Thursday November first seven PM at the silver\nYou're listening to you know working in an eight point night FM listeners supporting radio [noise]\n[noise]\nThem at home now ... do you want to be ...\n\nMm no\nAgreement on may ... and you know ...\n...\n...\nYou know being real big\nOn\n... ... ... ... and all that rain now\nDoes\n\nNot make it on every\n\n\nAnd in the early in your\nUp to ... ... ... ...\n...\n...\n\n... now\nAnd then\nIt made\nMe mad I mean you\n\n[noise]\n... ... you know they\n\nThey made those are the main my now\n\nMy Second Amendment really\n\nFor\nA man\n[noise]\n\n\n\n[noise]\n\n\n\n\n\nYou're listening to W. O. R. G. eighty nine point nine FM Madison\n[noise]\n\nI'll be\nA ...\nD [laughter] I'm Bad and\nI mean no met them\nAre you women [laughter]\nRemember when I was when the war\nThat was the year ... [noise] that I had a lot on\nWhat are you are gone by [noise]\nUm now one or two [laughter]\nAny nails on it [noise]\nI drank gone bottoms [laughter]\nIt'll be\nA ...\nD\nBad\nDon't mess with me\nOh [noise]\nOh\n[noise] oh\nOh [noise]\nOh [noise]\n[noise]\n[noise]\n\n[noise] [noise]\nGo\n\n\n... rules that are on the travel or you\n\nKnow they're going\n\nShe [noise]\n\n\n[noise]\n...\n\n...\nDo\n\nNot want\nTo\nA\nOn smoking [noise]\nThe ...\nThe\nRoads that are driving to\nMoon and I'm going to go to\nRemember\n[noise]\n\n\n\n[noise]\nNah\nNah\nNah nah nah\nNah\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\nI've to why 'cause they're all over the war [noise]\nI'm trying it was\nIt's now become\n[noise]\nAnd\nThey are placed a box go so high tech loans\nTo a package [noise]\nLate at night it's hard to arrest a whole new too ... too much changed\nAnd all of ... [noise]\n[noise]\nBut it's a room and that is wrong on [noise]\n\nI'm ... and all over the world\n\n[noise]\nMm\n... a new place to trial\nIn\nHis talent and learned a long history heartbreak hotel\n\nI mean I guess so long that they're there and get some on there [noise] for the\nAverage time\nDuring the ...\nAlmost ... you can still find some room\n\n... brawl garden Muslims to cry where they belong\nIn\nThe ... the ideas and along their\n\nBack down\nThere too\n\nMm Mm [noise]\n\nMm Mm\nMm Mm Mm Mm\nMm Mm Mm Mm\nHow about ... flown to learn [laughter] dressed in black\nAnd ...\nTo ... some long long long history to have a call\n...\n... ...\n... ... ... or\n... or ...\nOr\nConsoling I darn\nW. O. R. T. thinks it's listeners sponsors an IRS painting a family owned and operated company since Nineteen eighty providing commercial and residential drywall and painting services\nExamples of new projects and more information are available at eight Y. R. E. S. painting dot com or by calling six eight eight three one seven for three\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\nRight now I got up to\n...\nOh\nThank you walk him run to\n\nYou know\nJust like on\nThe whole month\n\n\nStay on the long term\n[noise]\nWhen you're\nOlder you\nGet when you're done with\nThe wind was\nSupposed to be you know\n[noise] I mean\nYou don't you know I lost my\nDoing rainy night in Georgia from a\nAn album called the girl for this one quarter live it bans high chaperone club in Detroit in Nineteen Seventy role Van Dyke one of the funk brothers from\nMotown studios [noise] I'm Dave watch you've been listening to blues cruise on W. O. R. T. eighty nine point nine FM end HD Madison stick around build a walking doctoral being momentarily don't touch that time [noise]\n\n\n\n\n\n[noise]\n\n\n\n[laughter]\n\n\nI\nLove you da\nDa da\nDa\nDa da da da da da\nDa\nDa da\nDa da da da\nDa da da\n\nDa da\nDa da\nYeah and then it goes all\n\n...\n[noise]\n[noise]\nMm\nMm Mm [noise] like\n\n...\n\nUh uh you know the\n\nThe\n\nThe ... ... ...\n...\n[noise]\nYes yes yes and my marriage\nDanish for gas gas lines\nAh the problem\nYes and\nNo no no not a\nDoes yeah yeah and yeah and my\nMe more than ...\nAnd and they all\nI'm\nNa na na na na na na\nNa na na\nNa na na na na na\nNa na na na na na na na na\nNa na yes yes yes yes yes yes yes\nMm\nMm Mm Mm\nMm Mm Mm\nMm Mm\n\nMm Mm\nMm Mm\nMm\nMm Mm Mm\nMm Mm Mm Mm\n\n\nMm Mm Mm\nMm Mm Mm\nMm Mm Mm Mm\nMm Mm\nWe're going\nTo come\n\nIn and this is\n\nOne\nThe things\nThat they did it\n\nThat's been\nDone\nMm Mm\n\nThere's a little longer now than\n\nIt is\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise]\nMm [noise]\n\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\nMm Mm Mm\nWell they they\n\nRoom\n\nTo\n... who has\nBeen around\n\nYou're listening to Duke Ellington and his famous orchestra doing caught in jail but here I meet or do you go go with me I was going to walk and Dr proceeding that we heard\nAh did I did get them out of order we heard the ... of the hot club of France during China [noise] that's a band the features Mr Django Reinhardt on guitar have you seen the triplets over by any chance it's an animated movie anyway and the trouble is the Belleville there's a short segment where\nUm there's the just animated version of Django Reinhardt who plays the guitar with his feet\nAnd you heard it here first before that uh we heard Charlie Christian but the Benny Goodman sex ... during breakfast feud because you never heard need for a lox Louis doing honky tonk trained blues and we started out with Louis Armstrong and his hot five doing hotter than that right here on\nBeat orgy a go go with me your host bill the walking doctor I kind of put this show together in rather hurry\nI normally have a whole month but a show together in this instance that had like three weeks I Know it was a crucial difference trust me I'm actually we're going to hear as we're going to a whole set of songs from a box set\nOn Sundays of ... the other all the belt on our grounds verve records plus I Nico album plus an album that never really came out\nA but all in model that was the big selling point when I saw that it was in Monterey so I got to have this which means you have to hear this is developing or ground delve it underground and Nico\nEvery [noise]\nMy young man a man who I\nAm in Maine and nine Ninety nine and you know showing that show that I knew in my um my dad died and then come on\nIt shows can di di\nDi ... di ... [noise]\nDone and how to read or listen this is a good time in the times is what does that represent them\nA round in a way to give them the money has been going on down\nTo give them a chance that I Know it is but there are some times in a way to do is we have a new show on the left and then I got a\nLot of apple\nMm Mm\n\n\nThis does raise a\nIs now\nThe ... do you live in the news\n\nBut that's the name on\nThe\nThe [noise]\nA man\nDrive by name the\n\nThe show\nNo no no\n[noise] Mm\n[noise] [noise]\n\nMm\nMm\nMm\nI've been ... I've been a\nLet me tell you that the ball on there\nBut I'm a\nNa na na na na na\nNa na na na\nI bet I bet yeah yeah\nBetter\nThan I Do live in\n\n[noise] [noise] [noise] [noise]\n[noise] I Am made a bright accent I have a whole when my my\nFingers crossed the words across the tiles that lifted off like getting less water balloons in direct around my home\nThe spoken word artist ... the G ... you know becoming you this Monday on the exits\nAnd with the read poetry our ... I'll be sharing my poems and songs book pre recorded and lines and be sure to tune in this Monday at seven pm here on the access our W. O. R. T. eighty nine point nine ... FM radio in Madison\n\nThe access our is W O ... commitment to community access to the air when abuse expressed on the exit never do not represent the music station it's damn programmers or the board of directors [noise] [noise] [noise]\n[noise]\nBy news to lose present a freaking how weekend twenty to fighting October twenty six and Saturday October\nTwenty some starting at eight pm on opening the annual gathering of coffee and candy features many local musicians\nPretty safe as a favorite faint friday features tribute to sniff case modest mouse pretend to the police and black Sabbath and Saturday your tributes and if you're Franco to fight\nElvis Presley the cranberries and foreigner [noise]\nThe freaking how we can is friday October twenty six and Saturday October twenty\nSeven at the high news ... seven show starts at age is keeping your part of this rock and roll fantasy for over forty years this is W O ... Madison and W. or he eventually wants\n[noise] Saturday ...\nIt's a taxi with opening acts the tigers and rotten Tommy Twenty one and over the top seems or Wyoming cool trail from Minneapolis the players a salad and straight in your parish brown garage rock the temperatures\nAre American Garage rock and roll Israel's helping to do\nAway with the cookie cutter over produce sound that's become the norm these days man rotten tomatoes warmed in Madison twenty Thirteen and shred their way through tight garage rock anthem that's the tax themes\nOpening acts genders and ... ...\nThey ... champion apso where skull\nKeeping you informed on live music around the capital city W O R G feminine HG Madison listener sponsor community radio\n... and the thing\nTo do that\nJust by doing so there was a man or\nA tiny little me there was nothing going on in the in the ... and then one time only do it on the New York\nWhat hurt at all and I think the tone and they do that fine fine you know and I would say in Iraq and\nIn the day John and they knew and Robin ... they're All right then and now they're called right\nIn the city [noise] who moved to the\nThey're going to do ... do you know they are the people in their little butts how do\nYou do you do that the Cadillac car or you know play on a hill that oh the ... and\nThen when he went on a New York times and then an hour and then they don't and they didn't do that by using you know how they lie a lot in\nThe evening and vital\nYeah in a good day in and my main John Madden dollar right now I Know\nIn and you didn't know what I mean I don't need any they need\nCan do to people\nA be the case may be may be moving in in their ... and ... and they they need they need they need to be the maid and she said and then they need\n\n\nOh\n[noise] and that\n\n\n\n\n\n\n\n\nYou are listening to W. or to the radio I might not in Madison lucky\n[noise]\n... ...\n\nIf\nYou just not\nTo be around for\n\nThan you know\nAll\n\n[noise] [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\nMm [noise]\n[noise]\n[noise]\nDo do do\nDo do do do do do\nDo\n[noise]\n\n... ...\n... ... ... ... ... ... ... ...\nDo you do do do do do do do do do do ... ...\n[noise] [noise] [noise] [noise] oh\n\nDa da da da\nDa da da\n\n\nBut we really need them and go if they\nDon't do a\nOutside my window oh Halloween\nBeyond that gee I Wish that there will be a good thing but I guess well then I Would think that we put out by the\nWay\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n...\n[noise]\n\nWell what do what I wrote but I\n\n\nKnow\n\nWhen you when\nYou\nBuy a new one\n\nYou know\nThe new\n\nAnd there but\nYou\n\n\nKnow\nI mean I don't really have\nFamily and I just don't\nKnow\n\n[noise]\nMm\n[noise]\n\nI don't know I live in Maine and now I\n\nWhen you when\n\nKnow [noise]\nMm Mm [noise] Mm Mm [noise]\n[noise]\n\nReps in the game is is the lightning when you when a man and later ranking way down\nSaying no\nMy grandmother's\nBed any smoke too many ... in the world to the to the caller i._d. they need\nTo address that issue when it does change the way it is I was in ...\nAnd\n... ...\n...\n... Mm Mm no\nMan in a way that we as was the one you know I just want to be the most they can be nations as big an older woman with a bad job and older parents might throw some\nOwners beds Mike from San\nNo\nNo and [noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[laughter] [noise]\n\n\nTo the\n\n\n[noise] the jobs that [noise] as bad as\nBusiness on member to do your\n\n[noise]\n\nDa da\n\n\nDa\nDa da da da da da da da da da da\n[noise]\n\n[noise] [noise]\nWell in the background that's bad manners during a tune called the lizard based on a regular with your boss your blood vessels are local [noise]\n[noise] [noise]\nAh let's go backwards before that we heard the English being doing tears of a clown a color of a smoky Robin cinnamon miracles so they play to the majestic last night and another show it didn't go to I didn't have no excuse as tired and\nThose are my excuse is before that we heard an enduring doing uh my old man [noise] and we began the several doctor feel good during no more no ... [noise] or their leader Hugo though there was no longer Dr oh what the song players I like it's\nNever gonna hear I'm really something\nMuch more milk [noise]\n\nMy God\n\n\nIt was but you\nKnow [noise]\n[noise]\n\nI don't\nI don't know did not [noise]\n[noise]\n[noise]\n[noise]\nMe time\nBut I can say about that [noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\nThe men are\nA plan\nAround me\n\nYou know no\nMatter and and and the center where a number of\nBombs you know we're on them a lot to be driven by what\n\nThey need to be the same\nBall around ...\n... oh\nFor my last call I did was shoot my wife\nTells me the number now\nNumber number\nAnd [noise]\n\nIn the background is the the arcade doing stole finger [noise]\nRight here on beat or do you do go to the doctor they began that set with the plumbing goes doing I only have eyes for years all over the temptations doing I ain't got nothing has ever heard motives Allison doing I ain't got nothing\nBut the blues and we followed the George fame doing a cover of those Allison's part's been farms\nFrom the album rhythm and blues live up ... which was a well I'm not sure because I was there was little and then finally the bark is right here you go girl um\nOh this is a good time to say you're listening to W. or teach eighty nine point nine ... FM in Madison and you're listening sponsored community powered radio station\nAnd I'm about an hour which to cram into a whole bunch of slog that program that I'm not sure it's going to work out but this was the last [noise]\n\nYou know\nShow because they look\nDa\nTurns around\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nTo what the law\n\n\nIn ... and everything\nIn the\nMud wrote [noise]\nLast that long you been on\nThat died\nBody rock\n\n[noise]\nNot\nGood [laughter]\n\nMarried me in the navy or you've got\nEvery day they're going to be\nBy not any fun\nI get back into time next\nOn you know a\nOn the line da\nDa da\nDa da da\nDa da da da da da\nDa da\n\nDa da da\n\n\n\n\n[noise] [noise] [noise] [noise]\nNo not when you dig down and you can get into it\nBut it really doesn't mean\nThat they don't they do not making a primary dun dun dun\nDun dun dun dun just don't ask don't try to do with the business it's maintenance\nAnd then there's no way [noise]\n[noise] [noise] [noise]\nThe day goes on [noise] and you\nCan get in that time we don't like that is where we live in a time of\nNight and they wind up with\nHigher\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\nThe most the\n\nJust went down [noise]\nAnd they will\nReally [noise]\n\nPlease [noise] my\n\n\n\n[noise]\n\n[noise] [noise] Mm\nUpbeat the light was nothing but a death trap Monday November ... seven thirty PM through all\nThe drugs ban has spontaneity and jamming along with them in ...\nAfter touring together in two thousand seven as dirty jobs now Susan to that is so do the Bible they merged their respect your groups to warm the rescue trucks band\nThat's why the birth jobs or whatever twenty Jones savannah music festival answers to that word might actually be angels don't like when they when they say that the two that'd be drugs ran\nBegan that separate the beep did you choose from their independence single richer so independent there's No Labels\nAre doing the original version of rock lobster which they re recorded for\nTheir debut album out today is Keith strict ... birthday he was born on this date in Nineteen fifty three of these are unfortunately no longer with us she passed away some time ago\nThat was my Haley a Jackson who is also no longer with us but she was born on this day in Nineteen eleven [noise]\nThink about that for them that's over here it's like God\nNo it's not I'm Sorry it's just a long time ago [noise]\nUh and then we heard was not was [noise]\nI'm doing powwow while while\nToday is also ... birthday he was\nIn Nineteen fifty two that tracked features the vocals and Mr Mitch Ryder the good news is Mitch Ryder as a new album coming out of the bad news is as a Christmas record so I'm less than ... fascinated and we heard the modern lover is doing Pablo Picasso who died on this date in Nineteen Seventy five\n[noise] and\nFinally we heard from Tony Joe white doing do you have a gardener belt\nAnd a\nTony joy passed and we just two days ago they passed away on Wednesday I think he was Seventy five or something and then finally we heard Burke him for the second time this evening right near the average year go go near Huntsville walking doctor and this is George Jones\nHopefully\nI can hardly the sign of an interesting on the cigarettes they are very ... lying on the way you left but at least ... ... ...\n[noise]\nI don't have any new a couple of calls the new born in ...\n\nBut at least two so you won't do that so much more than I can say for me\nIt's been [noise] [noise]\n[noise]\nNo no no no\n[noise]\nOwning you I don't even care\n[noise]\n\nThat is the door to me and I will say the only thing I Know ...\n[noise] it's really a Jew for a day\n\nThree and four years of marriage is the first time that you haven't I ... [noise]\nThe reason we're not talking there still\nAre just so they race ethnicity\n... breaking through my mind a pond or have them ...\n\nAnd ... around the bar one day be prime rules but\nA lot more than ...\nThan many mommy's delivering\nA long time in other\nMoms work owning a domain wouldn't be care her\nAnd my hands\nDown the dog me and I'm going to be on may bring on not just\n[noise]\nIt's been a good father ... ...\n... ...\nPages [noise]\nToday [noise] ah you know during\n\n... ... ... ... ... pieces\n... ... ... ... ... ... he\nHistory of the country to\nThe the [noise]\n...\nAnd ...\nI'm\n... I'm going to switch to [noise] on in the ... [noise] but\n[noise]\n\n\n\nGone your mama Sherman's number [noise] so many more [noise]\n\nOh\n... ...\nAnd\n\nAs well yeah to me\nThat is why\n\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n\n[noise]\nWell in the background to listen to the model for doing she asked me so I told her he you see that I Will be oblivion Mr Clinton drawn doing below right they don't want to thank you for joining in to beat or do you go near a host of do the walking doctor I Will be back in the month of December\nWay it is to be a with a much EJ J.K doing a glam special that'd be the first friday in December whenever that is I don't know\nBut you don't see the W. or two point nine up I'm In Madison and I urge you resolutely to stay true to\nFiction Joes with Greg Willard and good night one of those places\nOh so you need to do OK CD coming a prompt any second now as soon as I could figure out which one right right yeah [laughter] [noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\nYeah I mean he\nHe he\nHe\nHe gave me\nA ... rain\nAnd rain mhm\n\n\nSergei embrace Katrina love of the world who are around in mid air and laughing lead through her down the fluffy carpet\nMy head spinning said Katrina ... Sergei come here for a moment sit down beside me she called and stretched out voluptuous Lee and took up a Langer is posture\nThe young Golan stoop down and came in under the low hanging apple tree which was covered in white blossoms and sat down on the carpet that Katrina ... feet\nSo you used a pint for me did you see are gay how could I have failed applying for you what sort of planning was it described it to me\nHow do you describe a thing like that can a man explained to a woman how we pine for her I just loan for you that's all\nWhy did I never feel that you were planning for me they say a woman can feel that sort of thing surrogate was silent and why were you always singing if you were so miserable without me what about that I think I used to hear you singing and the galley did night\nKatherina levels and it went on for assisting with are questioning of Sergei while continuing to arrest him\nWhat other than that spends its whole life singing but it doesn't do it because it's happy Sergei observed rather closely\nThere in ... you'd a pause ... was filled with the most extreme delight at these confessions of surveys\nShe felt like talking but Sergei sat looking gloom ally and said nothing\nLooks Sergei isn't this simply heavenly capturing all the votes next claim looking up through the apple trees sickly blossom black branches which covered her at the clouds this dark blue sky and what's your bright full moon was shining\nAs it penetrated the leaves and the flowers of the apple tree the moonlight played over the face of the soup pine Katrina ... and over her entire body the air was quiet\nOnly a light warms effort barely Russell drowsy leaves wafting the delicate fragrance of flour and grasses and trees\nThere was a breath of something lying or is something that predispose one towards laziness sweet bliss and dark desires receipt\nTold by these intricate dabbled patches of light how they flicker and quiver over it like living butterflies of fire or as if all of this grass under the trees were so many fish caught by the moon's net and tossing from side to side\nSergei how lovely it is Katrina love of next claimed as she looked around her\n... guy ... led his eyes Rove around and differently what's wrong why are you so sad to have you grown tired of my love already don't be ridiculous Sergei replied Coley and leaning down he gave Katherina ... now a lazy kiss\nYour deceive or Sergei ... set in a jealous voice your shallow I don't accept those words is referring to myself Sergei replied calmly then why don't you kiss me properly\nThis time Sergei fell completely silent it's\nOnly husbands and wives suitcase like that to brush the dust off of each other's lips ... vote and it went on and she found on his curls\nI Want you to kiss me so that the young blossoms on this apple tree fall above us to the ground look like this\nLike this after ... whispered whining herself around her lover and kissing him with passionate tenderness\nListen Sergei there's something I Want to ask you catch ... and I began a short while later what is it that makes everyone say the same thing about you that your uh deceive or\nWhat is it that makes people tell lies about me is what they say well perhaps I may sometimes have deceived girls who were completely unworthy\nAnd why did you get involved with girls who are unworthy you silly ... yet you shouldn't go making love to girls who are unworthy\nVery well for you to talk do you think it's the sort of thing a man plans beforehand it's temptation that does that work\nIt's all without any intention of doing it you break the commandments with her and all she does is put her arms around your neck that's long for you\nNow listen here I don't know anything about those other women of yours and I don't want to\nAll I Know is that it was you who seduce me into this love affair of hours and you yourself know how much I entered it because I wanted to and how much because of your hunting\nSo Sergei if you deceived me if you throw me over for anyone else anyone else at all then barely listen mine my darling friend I won't part from you alive\nSergei gave us start wait wait light of my day he said you can see for yourself the way things stand between us just now you remark that I seem Brood II today but you don't reflect that I may not be able to help it it may be that my cars is drones in its own blood\nTell me about it tell me about what's troubling you\nWhat is there to tell 'em soon the next thing you know your husband's gonna show up and he'll say\nRight back you are a surrogate for the rich off you go right to the back yard and get those musicians ready to play and they're all have to sit looking up from the woodshed at the candle burning in Katrina levels in his bedroom and see her plumbing up or feather bad lying down together with their lawful husband\nIs in Novi border shifts\nIt won't happen say Katrina live off now in a lazy laughing voice waving her arm\nWhat do you mean it won't happen the way I see it there's absolutely nothing you can do to prevent it from happening but I have a heart to you know I can foresee the suffering that's in store for me\nOh come on that's enough of all that\nManifestation of Sarah gays jealousy please ... so much and laughing she resumed her kisses but I must say Sergei went on quietly freeing his head from Katrina\nBoth arms which were buried the shoulders I must say that my station even though it be the lowly is imaginable causes me to do a lot of thinking one way or another and I'll tell you this cat to remove off now\nThat if I were your equal if I were some master merchant or something else I'd I'd never part with you not ever in this life\nWill surely you can see for yourself what sort of man you have before you went very soon now all see your husband take you buy your white arms and lead you to the bed chamber and I'll have to endure within my heart and I'll despise myself because of it because of it ever afterwards to Reno levels that\nYou see I'm not like other fellas I'm not like those guys will put up with anything just as long as they get their pleasure from a woman what do I feel is real love and I feel it's sucking at my heart like a black fight for why are you saying these things to me\nShe had begun to feel sorry for him\nKatrina ... how can I help sing them to you how can I help it\nWhen it may well be that it's all been described your husband in the most vivid detail when never mind about some distant days in the future tomorrow there may not be any so much is a shadow of a ghost left if you're a surrogate and this establishment just like tomorrow\nNo no don't say those things I tell you it won't happen I won't let be left alone without you got to Reno level not said calming him down with the same presses as before I won't\nInside\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] [noise]\nSoon as Katrina levels not had blown out the candle and lay down almost completely naked on the soft said they're bad she sank into a deep slumber\nSo sound was her sleep after all her one pleasure that her legs and arms lost all sensation but\nThen once again through her sleep she seemed to hear the door opening and the same time cash which recently made its appearance\nFell onto her bed like a heavy old boot\nHighest this cat's been sent to plague may catch arena love of enough thought we're early I took good care to lock the door the windows closed yet here it is again I'll have to throw it out again\nShe tried to get up that are drowsy limbs would not obey her and meanwhile the cat walked all over her making a strange purring noise that sounded like human speech\nAnd wherever the cat walked on a ... vote in his body was covered in Deuce flash\nNo she thought there was nothing for it I shall have to sprinkle the bad with holy water tomorrow for this is a very strange cat that's taken to visiting me\nThe cat continued to per right next door to her ear now watching her with its Muslim\nSuddenly it said I'm not a cat where did you get that idea you know perfectly well ... I'm not a cat but the prominent merchant bores Tim ... Fitch\nIt's just that that I'm In a rather bad way at present on account of some stuff\nMy daughter in law gave me to eat and then it occurred\nWhat made me shrinking size so that I looked like a cat to those who don't know who I Am well oh Katherina ... how are you getting along in our house these days\nStill keeping your marriage vows are you I thought I'd just nip over from the cemetery for awhile and watch you in Sergei Philip Gourevitch keeping your husband's bed warm\nHer her but I can see a thing you know you don't need to be afraid of me you see my eyes fell out because of that stuff you gave me to eat\nLook into my eyes my dear don't\nYou have frayed Katherina ... looked and then began to scream at the top of her voice\nOnce again the cat was lying in between her and Sergei but this time it at the head of Boris ... fetch\nDiluted and swollen has that had been on his corps and instead of eyes that had to fiery circles they kept spinning and spinning in opposite directions\nSergei woke up combed Katherina live off of that and then went back to sleep again the cheapest wide awake now and that was just as well\nAs she lay there with their eyes open she suddenly heard something that sounded like someone climbing over the gate\nThe dogs began to Russia about and then grew quiet as if they were funding on someone another minute went by and then the iron latch on the front door downstairs gave a click and it open\nEither I'm imagining things or that is in over the border chef coming back thought Katherina live off now and she gave Sergei hurried shove\n... she said sitting up on one elbow and straining their ears and indeed someone was quietly climbing the stairs treading cautiously step by step in the direction of the bed chamber with it's locked door\n[noise]\n[noise]\nMm\n[noise]\nMm\n\nMm\n[noise]\n\n\n\n\n\n\nMm\n[noise]\nOnly injure shift Katrina love of quickly left from the bad and opened the window\nAt that moment Sergei jumped out onto the galley gallery on his spare seat and through his legs around the support down which he slid so many times in the past after leaving his mistress his bed chamber\nNo talk don't find somewhere to lie down and don't go far away\n... out of the window she threw surrogate your shoes and clothes and then plunged back under the cover led waging surrogate did his cat ... told him instead of slipping down the support he took refuge\nUnder some past which had been used to cover the floor of the gallery meanwhile cadre and all of old and I could hear her husband are approaching the door and listening as he held his breath\nShe could even hear the quick inning beating of his jealous heart was however not with pity but with militias laughter\nThat she was convulsed\nYou are in a wild goose chase she said when mentally\nOr smile and breathing as pure as those of a newborn infant\nThe state of affairs continue for some ten minutes but finally sent over the border shove got fed up with standing outside the door listening to his wife\nSleeping he knocked\nWho's there ... called after a slight pause and in the voice that was meant to sound sleepy or friend Silvia bar shifts replied is that you know the ... of course it's may don't you know my voice\nKatherina ... sprang up just as she was wearing nothing better shift let her husband into the room and dive back into the warm bed it seems to get cold here before dawn she said pulling the cover up around her\nAs he entered the Novi Bora Schiff looked around him set a few prayers lit a candle and then took another look around\nHow you've been keeping then he asked his wife alone right Katrina ... replied sitting up she began to put on her button let's open cotton blouse\nDo you want me to put on the semi far she asked it's alright shot for accent you let her do it catch arena ... kicked on her shoes not bothering to put on stockings and ran out of the room\nShe did not remove return until half an hour later during this time she let the some of our herself and flipped out onto the gallery to see Sergei Steve where you are she whispered to him\nHow long\nA blockade you are stable are until I give you the word\n... made him crawl back into his hiding place again from the gallery Sergei could hear everything that was going on in the bed chamber again he heard the sound of the door banging and Katherina ... going back to her husband every word was audible\n\n\nAnd thanks for joining me tonight that was her to a nickel a less gone Lady Macbeth and the chance we'll be back next friday or her three so stay tuned to W. R. G. eighty nine point nine of them your\nListener sponsor noncommercial\nPorch community radio\nI have a great week and we'll see like\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n[noise] na\nNa [laughter] [noise]\n[laughter]\nNah\nNah [noise]\n\n\n\n\nAll right good morning in Madison ... this is Patrick or radio or mo Jo there'll be play music for you for the next two hours of courses to to do with new day riding the title track of their Nineteen eighty five out\nHere that every early Saturday morning here at W. R. T. a nine point nine FM Madison never hear something from back\nTaking us back to Nineteen Ninety nine when he contributed to a various artists album called more or a tribute to just get bent album\nPlaying the song to skip spent song halo of gold\nLet's check this out hopefully you're going to\nTune in for a while here well the world series game three continues on last I checked right before walk into the studio there are moving into what did the twelfth the thirteenth any\nTied up one to one anyhow here's back\nBy\nA judge Jed ...\nI Know that there will be under the ground bother them\nOr whatever that [noise]\nMy um [noise]\nLot a\nYou know how they how do we\nNah she had a\nThink they do when you\nGot to get a job\nA black lab with by the\nBy a team that will be [noise]\n[noise] you have\n[noise]\nUm there's been a pleasure to be a\nYou know I'm I'm a\n\n\n\n... ... ... ... ... ... ... ... ... ... ... ... I Am\nMade them rag than I have a whole when my um my fingers\nCrossed the words across the tiles that liftoff likes getting less water balloons and direct around my home\nA little bit too spoken word artist Nathan Jay Reed and I'll be coming to you this Monday at seven pm on the access out working with the read poetry our I'll be sharing my own songs book be recorded and lived to be sure to tune in this Monday at seven pm here on the access our W O R B\nEighty nine point nine AM radio Madison\n\nThe excess our is W O ... commitment to community access to the airwaves abuse expressed on the exercise I Do not represent them use the station it's down programmers or the board of directors [noise] Mm\n[noise]\nW. O. R. she's nine to have tournament is coming up fast it's on November fourth extremely sponsored by Madison central\nW O R G D jays will be rocking lanes as opposed to the surprise is beautifully skill level\nAll bowlers will receive a keepsake hands how do we do with the W. or too low to buy tickets to the pick your prize raffle tickets are available to them at the sister perpetual Wendell just after the event you gotta were Fifteen hundred dollars a frightening to give away\nHolding a strike with the red pin front earns you a free beverage after bowling enjoy pizza ... while the scores are tallies from the prices are doled out all for thirty five dollar proceeds benefits W. O. R. T. interview radio\nJust fill out the form at W. or to your friend up more and then put it in with the registration\nForms are also available here at the station one Eighteen so Bedford street and it looks like press on ...\nNew informed about we used to actively support your community radio station at least is W. or to you and you know we're known as ... Madison\n\n\n\nBad to be kept in\nThe cat and mouse [noise]\nNa\nNa\nNa na na na\nA\n\n\n\nHave\nYou back down and that meant yeah na\n\n[noise]\n... ...\n...\n... and\n... and ...\nAnd in the Senate\nNo no no no no the\nRound and round\nLarger and larger\nInto the\nComment on and on and on them or not I mean\nI'm a little bit of a\nOn and then you're going to\nThen and then there was no doubt there da\nDa da\nDa da\n\nDa da\nDa\nDa da\nAnd I think that we've\nTry and honor and all the\n\n\n[noise]\n\n[noise]\n\nI I don't I Can't imagine\n...\n[noise] to\nEven after nine eleven\nOr rather\n\nHe he\n\n[laughter]\n[laughter]\nHow many of them maybe the [noise]\nAnd you talk about\nAre no black lady and the [noise]\nThe bombing or\nAnything [noise]\n\nI mean [noise]\n\nDa da da da da and\n[noise]\nAnd it\nAnd her and her head\n[noise]\nThe [noise]\n\n[noise] [noise]\n\nHe he\nHe\nHe you\n\n\n[laughter] [noise] Mm [noise]\n[noise]\n\n\n\nMm [laughter] [laughter]\n\n[noise] and [noise] I I'm I'm a a a [noise]\n\nAnd when\n\n\n[laughter] [noise]\n\n\nUh [noise]\nUh uh uh to do\n[laughter]\nAnd\nI don't\nI don't\n[noise]\n\nNa\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n\nYou to do to W. or key eighty nine point nine or ... and Madison the tracks there from black belt Eagle Scout off their new well you might just this year mothers that my children ... and just light\nAnd before that two tracks from you go oh no her Nineteen Ninety five out and rising we heard what do we year war zone and I'm dying to great album fantastic um before that we heard two songs from a Japanese band called chai\nWe heard Neal and walking or going to get right back to music there's an hour left last time I checked in the world series game three still going on I think maybe it's the fourteenth any\nNot sure maybe they'll still beyond when the show's over about fifty eight minutes right now we're going to hear something from a band called mush the two thousand eight release off a little bit the single\nOr up there ... pi called gig economy [laughter] [noise]\n\n\n\n\n\n\n\n\n[noise] [laughter]\n[noise]\n\n\n\n\n\n\n\n[laughter]\n\n[noise]\n[noise]\n[noise] ... when I was making me was the last\nTime and you\n...\nNo no in the middle east\n...\n...\n\n[laughter] she she she and the and\nAnd\nAnd and [laughter]\nAnd and\n\nAnd and\n\nOr\n\nUm [noise] ...\nAnd and [noise] and and\nAnd and\nShe [noise]\n\n\n\nShe\nShe she she she\nShe she she she she [noise]\nShe [noise]\nShe [noise]\nShe she she [noise]\n\n\n\n... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ... ...\n... ... ... ... ... ... ... what we see [noise] when you were ... you may you know\nThe ... gun in the in your ... in their day in the the the ... name you know if if\nAnd when they\nPlay and that anyway ... ... ... they were\nAnd do we do to get into\nKinds of food do you know\nGoing to bed and you know then you're going to win the\nAble to do and I'm delighted to be\nDone and I'm getting a job\n\n\nHe be\nWhen the other thing the new image I\nWhen you play the ... late\n... when ... when there\nHe can do to deliver the dining room on the ... to do\nGo\nStay\nLa ... one\nThe cage and the other day and age\n\nThe um\nDay and age\nOf the day and age you know\n[noise]\n\n\n...\n[noise] ... ... ... ...\n\n\nOn\n\nA on\n\nA\nI'm\nA law\nOr anything like that\nI'm a\nA I'm a I'm a I'm\nA a\nA little over and over and over and over\nAnd ... and ... and ... and ... and\nI'm a I'm a I'm not alone\nIn a a a\nA a a a a a a a a\nWe're going to hear an important message now it's a reminder that you're listening to Patrick or radio here at W. O. R. T. eighty nine point nine FM Madison, Wisconsin\n\n[noise]\nLet me see live presents guitar virtuoso air Johnson's audience music\nTo work live at the very more theater Thursday night November first [noise] Grammy winning guitarist Erin Johnson performs is redefining and best loved Ron guitar relief on the music calm in its entirety suggested by air Johnson fans worldwide [noise] with a few of the gyms covers and new materials\nEvening of ... can form of a sitar were will be an unforgettable night of highly clean talent\nFTC lifers and one of the most respected guitars on the planet aired Johnson from wages Thursday nights November first at seven thirty at the very Morsi and [noise] this is your community radio W O working eighty nine point nine FM manager [noise]\n\nAnd I'm oh Joe I'll be here playing music for you on W. or tea for the next twenty minutes or so a little bit more than that and I think we ought to hear a couple of tracks from ... to solve the problems in titled tell me how you really feel and we're going to hear\nFirst up a song called charity and then another one called nameless faceless\nBut I just thought I'd mention just chicken or on line to\nSee what the World Series game three's all about right now you would've guessed that it would be over but it's not apparently were gone into the bottom of the fifteenth ending longest World Series game and history\nApparently to to to Boston in LA but this is ...\nPretty Burnett\nTo\n\n[laughter]\n\nAnd in a\nLittle too late and then and\n\nThen uh and\nUh I don't think they need to be a\nNa na na\nNa na na na na na na na na na na na na na\nNa na na\nNa na\nNa na na na na na na na around\nAnd our\nMen and and in\nThe room and\nI'm a realtor and na na na na\n\nNa anger\n\n\n[laughter]\n\n\nUm [noise]\n\n\n\n[noise] [noise] [noise] [noise] I mean I ... bridge or are you [noise] [noise]\n\nOr man\nHer ...\n\n\n\n\n\n\n\n\n[noise]\n\nAll right All right Patrick or radios coming down to the wire here me just tell you you're listening\nTo W. or TNT nine point nine at Madison, Wisconsin\nJust heard from war off the um the\nWorld is the ghetto with the scope kid about Nineteen Seventy two drinks per proceeded that from the Joe's Garage job with a little green\nNineteen Seventy nine\nSend you off with something up for the Coney Island baby\nOut and buy Lou Reed\nYeah this is the title track\nCatch me next week\nMidnight to to am such a court radio right here eighty nine point nine FM Madison\nMm\nNo man when I was young man in high school\nYou believe it or not I'm a long sleeve cool\nAnd all those all the guys and they said that he was ... but you know\nOne plays football for me\nAnd\nSaid I was in a way for the linebacker Saddam plan right in one place\nAnd then you got to stand in St Louis and gun if\nThey go on\nNews the news media right and the owners\nHave shown genes\n[noise] in a wonderfully [noise] Mm\nMm\nMm\nWhen you own noon and only\nThen nah\n\n\nLike presents an evening with government meal Thursday November first seven PM at the corner right from the Allman brothers band in Nineteen Ninety four guitars sworn in an original bases Ellen woody or government middle drummer map out who he played with in the Dickey been banned\nSteeped in the roots in the rock blue soul in jail government news recognize words during songwriting and storytelling as it is for the improvisational virtual city that people's their calendars like performance the evening with government meal there's remember first seven pm to\n... ... you're listening to the point that I found the listener supported radio\n\nYou're listening to W. or to the point now if I'm mad as\n[noise]\nHandler oh go hey you know\nFor showing up by the media AOL Hitler then I don't drink no Marco Rubio was one that was the one made so we're drinking battle leaders have on my phone man man talking to my teacher\nYou can't you\nCan't stand golf fans Facebook ensured he bought a Santa\nFe and bottom line that may not be a model you know 'cause I don't know how to how\nCan I can say okay I got a new exercise or not but I\nFound like a few of them are retired and\nLaurie my cold outdoor regard as to how to do my cars as he bought a car but you never thought it home and I said I have a normal guy he come off of a lot of ... block it out of the party financial not live on a lot of problem I'm Robin ... what I don't want to fly\nTo New York\nToo bad we take back who drink but I Do want to go to Margaret do the you know who they go through the system and all my money I've got an issue but\nWrong you can't you\nCan't stand bloom gossip fan base book Crazy Brave taught a\nJust paying bottom when a gunman detrimental not old you know 'cause I don't remember how it got to get a shot at a time when I'm sure they sound like those two guys you know\nI'm Rene Ballard lately so you want\nI wrote me an email me Mona not you know you can breathe a job what don't you don't go out to me but I\nBook you can you know you\nCan't you can't bring gossip and Facebook were enjoying the bedtime caught a pass them claim to\nFame bottom when they're gone you know 'cause I don't know I mean they're not going to try to know what I like to\nDo [noise]\n\n\n\n\nOn and on friday night all my ... then the glue\nI read the giants the news that\nAnd saying I'm not in their mouth\nI mean I think it after a\nLaugh when I first\nNow I Want to hang up on\nThey\nGoing to be able to get all\nAnd enjoy the\nDay and the green you know it'd be oh I really would\nI ran out my name is more important to the show\nThe game and what you think maybe voter spraying you name\n\n[noise]\nSo\nI go to the gym or something like that you made\nIn the house where like I\nSaid to me they are to me and me and like any time or do\nThey know what we can only get to\nKnow when they when they get older and the euro in Texas I mean you just leave 'em like they never knew that they claim that they\nDon't want to let me come\nKnock on wood on the\nRoads are they trying to make\nThe ground running who's running against them did they get around to see not impressed when you'd be lucky she gives me gets down triple\nPrior to the ... I Know those were pretty flimsy that came to have a kid [noise] actually needs to be just like if you're the boss do need to be clean beaches down a difference I gave them to get his name and\nShe said she ... she ... she is she going to be made on the hook because he off of the five day they'd be like ... when the crowd was leaving my\nTruck on hold her father and the [noise] the single sound like you out of the rest of the matter when they got to be [noise]\nI'm the one beach I got to be [noise]\n\n\n[noise] [noise]\nWhat's happened it was happening was that we should wait DJ big juicy today to try to do with eight right here W. R. T. eighty nine point nine or ... ... e\nHey we've got some new music from the me goes is take off last memory ...\n[noise]\n[noise]\n[noise]\n[noise]\nWell but the Mona clearly not just learned to do nothing limited government data measured go the moon including my Chinese or the ... the maroon county\nOr go to ... talking about ... [noise]\nWould the gay guy\nResonate with that is why\nGo to Michael Michael\nA million on the next person they want us to use a couple of mixed\nOn or near the bottom line like into too\nMuch time as much as ... or ... years ago and they knew how to do better can give you the guy that was the guy on the ...\nYou know that's one way or the John Snow white now there's\nNigger nigger and this is why we can do it by saying oh no let me ask you they know what the price of snow they already know was\nBattle among talented enough to stay in a crowd but not yet I mean what do you think of jumping in and they make a judgment die on the free and I'm a gay man that can make the gang\nKnown in not just to just learn to live with a limited measures as much as a rookie on the moon\nIs you know can you ... talking about how to\nDo with the gay guy\nResonate with this guy\nAre from ah\n\n[noise]\n[noise] [noise]\n[noise] I'm born nine or\n... or drop down as a very minor [noise]\nTalking to my earlier on is looking at the body building a robot is still around and you found\nHim\nSo they do a lot [noise]\n[noise]\n[noise]\nThe gang jak before the bridge you know wouldn't have a happy catching the gap in that opinion swabbing pocket for the magnets never sweated fucking past watching several months bracket\nNegatively\nSaved me a God damn [noise] beanie though with as fast as much um they like him make us better understand the whole goal that you've got to several friendly or something like that she told you say she on I saw a fucking like that the kids found\nHim\nGuilty they do [noise]\n[noise]\n[noise]\n[noise] before I got it from the Twenty one goal is low power rules to tell you that much damage to watch out of out of my G. go door to door who do you feel like that's what a gram in LA and no fly zone tickets in Miami that gets in your second city ... megabits\n... fares so famous guy put that on my mom I Try to watch to play with a best buy your business you know that's a crime against heated up or whatever\nI guess the dollar salad here again there are ... percent guy left such a big fan of our time on\nTalk among a lot of the waist down last time I\nTalk to my mind is by far the best time\n\nDo lots\nOf people who I\n\n[noise]\nOn the commercials looser distribute germs when he was not working\nFor the\nMoney home get the bank they don't shoot was chicken Nance rented that got to know why like Tiffany Haddish wanting to get sick in the ... on the right to know how can they\nPlan to what had it in their district ... she felt like the pope and the Vatican them at the Trump where the packaging Hillary is actually my kids are able to manage to pick up a gap in order to get back to I Want to talk of Kashmir just to mediate that puts in a temple to track what am I sort of remote the wagon went into ... with all the practically never actually\nHad walking into the help of taking the less you can be ready for that image\nZero to take the amount of money I think they are still the same boat with that ship in the open and not actually ... I never had to care for\nThe good just do what I got away with the job well gee I went and got limited jealous to pay to get better know stream of the day the being met an honest broker was trying to get back in those you need a place a baby daddy appropriate she probably for packing a Malaysian I look at that place like um age in\nWhich you're going to open a Yankee and hoping to do with your news not but you know happy to\nGet their water snippets they come running Chapel Hill I did my time they put me in rehab I bought a role in the attic your regular flow might be\nLet me see who else who has joined man it feels good being out here man I'm On a right they each got me on a brave sleep you know carefully at ten o'clock when I'm doing my thing and I work in Buffalo out will be twelve dollars an hour I'm doing good man everybody looked at my land hate me man that's see\nThat's a man who's who's calling me yup yup recently and I know actually I don't know\nI'm getting shot out ... um [noise] I wouldn't want to watch it you planning to um CGI make a lot of what was she done at all [noise] ... ... ...\n...\n... well can you move the thing he makes it most\nBut it sure isn't that great but who\n\nAlso low usage trip ... oh what part of your check [laughter] yeah you\nHit the big ... would be able to do you understand me and it's got like six or eight to ... six two zero zero one\nOh you're you're on a\n\n[laughter] [noise]\nMSC down forty four people started all new to\nLast night's will see the money that she will switch from like the model [noise]\nIt's like you're constantly saturated with\nIs maybe just maybe you're overreacting maybe yeah actually\nBiggest political season for when they actually made me a whole meal for free\nBehind you with your seven opponent is different from your mistakes to make a fool before you're the threats in the region in the back of the union was possibly make\nConfusion is jealousy and just on those but there's nothing worse than\nYou can do is I feel that\nSupposed to be able to do the\nRole of the law is in the afternoon\nPlus they make it gets to do the same\nAs little as a rule of duty smoking\nMarijuana or were you ... speaks\nThe hall and the parental ... nominees the weaknesses does this\nMean that will lift those can stretch of Washington ...\nA split up I Would just stop attacking the bachelor\nA lot of the modeling the novels because slow math\nBroke was pushed out at different mom was not conflict with put it behind this baby was born to dig\nWatching anything they can start getting money\nIn the non stop hoping you alone the mom all\nThey agree or the appeal side\nOf the schools to the\nRole of defeating the smoke and the guy\nWas saying that they're going to do this in\nThis little study that will look to please throw this guy\nMuslim worry about it and then I never really know what you\nFor some reason to fire you should look at the beginning of the fucking up writing my\nMaking heated over this would again then they just Neal wide\nPlatinum blessing any going on about creating an is one thing they called\nWatch the coldest winters copy machine which trying to get is\nAbout the project is the best of blowing a little fondest that's grown people you know make one up last night but you could tell them get on the line of what the model click cake you can't compare to do that no one\nHas any appeal side's\nSmoking being able to do that all of this\nThe lawyers will get a job\nMoney making money going to\nDo what is that you\nThis little Scooby I Will look to the smoking is\nA lot of money in the rain\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise] [noise]\nTo be here you're born Muslim [noise] your shirt liberal in their own learn number low for like\nOr white man's world sometimes overlook the fact that we walk or not you know when the pay twice as well as white as\nSt John interested me during the ... the ... my mom that you've spent the school\nWhere one day you might as well as the capital but Bob I'll tell you what the government getting hit by a big bug during the lame duck locked down the\nBrothers don't proceeding bet for the ...\nCage when mom where are you in the mall\nOr written apology to my to sit by the way they seem more wages do through the course of the best view from Santa Baby Taiwan boys or girls or\nBringing more\nI'm up to those ads\nTo set them off and we have a lot of stress on the report spam to cap it they ... they had the mole hole which don't win like mama threat to shake hands when I finally asked that question reminds and yet the problem of why we live both\nWatch prime purpose is not going to be able to your\nMe next ... my ... my mind paying back when the big deal to say\nHe was going\nTo be practical problems back like we don't know\nWhat you're saying the man of\nSteel sharply in the white man made were [laughter]\n[laughter]\nThe ... ... ... ...\nBut I mean there are a very low level you have no no no not at all\nThe way they're going to leave over\nHow to prepare tunnels below what balancing all ... by keeping the luggage and who knows I played the ... people and like I said look I'm attuned to what to do with a nickel will block can we killed\nOf the main missing number ma'am I'm In the band and you're listening in\nYou got some of those times in order to get to a bar with your\nMail yet mayor Darrell me ... me\nThey miss Carla payment on you know about green dying you know what's going on law suit\nMe ... me a little big man you know ... you know\nAs soon as I got on with us less if it's bad because I was at all though and it's going to be the number of them are here you know you won't have to go for a while to be in a moment do represent what right a pony opponent for wrapping the trip and approved of the key is to try to do\nTo use it they just sit on the end they make it makes me on my kid district oh let let me get district how's your resume to worry about the way that the turtle when are you from the ... and when he printed there's you know but you're the president should count that they should pay for your version\nOf it are going to happen when a per hour man came\nTo go down that way but it could have a job ... gray and there's now having said that in that trap that\nMe me me me me me me me by any\nStretch Rochelle again I mean like ...\nTo know me you know been on my my answer to target new ... minutes ... nobody got money right to the only the only bad\nTon of coal me\nSee them I don't mean make\nOwns this\nThat going to cure casually I was\nHad no wrecks on the front row the men in black men and back me back in the back end up going to have a key means chair she only\n\nNo kind of thing\nTo land on the court\nGoing to allow destroying cross\nThe line do stupid on the\nOwner to freeze\nGo on no sleep balancing as a month\nI was raised in shape and she was she a man named for that to avoid the death so\nMe me me\nMe me me\nAnd you don't play on he may I mean they go home with them on their mind and I don't sleep till dawn on me and he may\nHave been\nCalling me for me to be sent me on the end up ... you don't meet the eye on a whole\nMean they will find you and God and don't be China town my pack I got a whole lot of well a man they love me they loaned me the baby brain jumping the clue me in as some need some\nBig ... that don't really see any bought one of those that goes along with someone you don't want to be did it like that\nI went back and talk I just wanted to go to ...\nWatch when you walk [noise] I Know\nSaw in the masses\nLobby dream but I like all the center for Thirteen by Monday\n... pitches several other stuff that can you tell 'em back at home better slicker than level rabbi don't step in all sizes into whether there'll be any time window but they didn't initially got bombed them several I'm how does this guy trying to find the weather's snow you won't\nMe me me\nMe\nMe me me\nMe baby in its own game me they\nMe baby that don't mean to me ... [noise]\n[noise] [noise]\n[noise]\n[noise]\n... shut it up yeah I Know who is this in the studio well what'd you won't know Jews were good\nI was a big boost it may I just wanted to say man good looking man you know I've been in there doing a little bit of time and again at during the time at\nYou like the only radio personality that really play stuff that we want to hear why don't you know Bob sledding being on them and she talked too much you'd be playing all the old school stuff I ain't got nothing against those who but you know we'd be on his new moods\nAnd you make it happen was me and I just wanted to say good looking wrote this was a brokerage appreciate you you got to shut up yeah man\nDid stokes coming back man shot no my ... the cubs games I forget what the right man I Want to get set out to my own bird Matt ...\nOh ... who\nBig old team that we use meal\nAnd I are talking about the active [laughter] my young main Stanley\nGoes well but Cory ... the man J. B.\nAnd I want to get shut up to my man wolf over there or do you play a\n... that you aim is the ... and I want to let everybody know male jobs here man it's it's almost over you ought to be home soon back to the outlook was you know ... it's all good out at like I'll see you know I'll stay in the way\nYou know I've been working since I got out man and trying to get them to get these people's all my all my fault I Can't curse I'm Sorry but yeah man you hold your head up a Jew play that I mean at the at you Amos and then\nYou got to burrow spare yup yup they show what show\nIs your boy these are big juice low in the building you know what I'm saying\nRight here on a\n[noise] a\nTime\nBeing in a show or\n[noise] [noise]\nIt was ... and the greater Madison Jesse solution present the conclusion that the twenty Eighteen in did you use yeah series with Madison music scene heavyweights immigration am friday evening new members taken at the place or something\nTo to their afro ... genre immigrate trades in dynamic cruise and unrelenting calling rhythms comprised of ten local musicians immigrate delivers the worldly jazz rock sound was swirling repetitive guitar patterns the funky baseline and the series ... sections\nDoes he ... he was a play the final installment as an indigenous yes theory that didn't memorial union please go on friday evening November second ... thirty you are listening to the O R T H ... than the ... or if he has been done or\n\nYou just need W. O. R. T. A. B. no way no if yeah I'm a medical\nWere a little bit you know what\nMy mom wouldn't make a gym minding\nWith another make a hole in the law though you know try and do we know the cars than the loan\nSo\nAnd you know not shut up\nIn ... ...\n... ...\nOr ... or ... or to replace him fall for you are oh\nLet me [noise] so so low key\n[noise] some who\nSo low key us over ... W. K. E.\nOkay\nIt to the ... minute bumper to six to three or four full full three or three three three fold want them to to let it go no issue would go though\nYeah I'm an age all to wake up call you're used to be Eighteen in a moment and wake up did you did you have to be used to be able to write this date\nMan can be the first person may be lying now they do much\nNine fans around then there'll be this the way back getting that job laid back wage real small but real fat kids aren't they a giant bag of chips name ... end up watching them less\nWe deceive playing\nBank you know a\nSaid so when we go way\nTrying trying to shut down the street when the job wedding pad\nDance is no way\nMy way or the the way back when the trial nigger which a man or sexism which is ...\n\n\n... any any money you know and she gave me a wrench in any minute you know you're not ... you know I ... in ... Illinois\nShook and you're rich you don't get grown up in the road these animals separate shifts I'm now ... shoots came from the more mundane type drinks [noise] twenty four seven months cities and states is ... ... in a moment you know you you\nKnow and [noise] you know and [noise]\nI don't know ... chicken men from the minutes\nAnd make it has been wanting one big mess and blanche from China among grandma praying and like your plan for around ... stress and anger and help look for our phone number ... ... the runaround we must be a good chance you to winnow my love are no who wants to admit to deal with on a bill that\nHave run into some mail keeping notes wage and ah [noise] ... and even when you're you know before\nMy cousin that he ... he just going on and on [noise]\nAnd I know [noise]\n... you know I was ... you know I was ... you know she can get richer and need to remind you know in the name of ...\nIn a moment ... ... I Hope you don't know\nI Hope you know [noise]\nUm well she took us a long way to that age I was trying to do now is wretched in broad remember finding and testing them back it up a much ... ranch union is going along the line [noise]\nErect shoot anything mommy juniors on [noise] ... you are not and I'm now on [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise] uh you know so little you know\nDon't make a change in LA I don't know ... what would they don't make no law that was ... like what I'm saying\nOn the news and\nGuy who will not really\nHonestly believe\nMe records the things that's going\nNot used to be that that was a\nThey don't want to be a bridge building running around\nUse the same number my rent\n\nSee I have\nSay well\nYou know we knew that they wanted to make the focus is on a thanks so much for me is the name of that ad all day\nOh you'll see I mean you know men and women in their daily business ... and then I think the guy gets are the only time I know they can look down upon them money ain't that many now do\nYou want to come and I'm going to\nDown in the short\nThe machine the root\nTime favorite\nMeal I\nRemember when I read your column on thirty minutes an hour meeting\nLot more to learn a little over here for the\nOr not the same\nOf the most women who were thrown in jail with\nMe around around me which ones do\nSee I\n\nRight here on a\nLarger Lori Drew in order to\n[noise]\nHave a\n\nName brand was more\nRegion they break on the river\nTo bring in the morning\nWhen his father road runner game on and on the\nRecord for you to\nA comment about\nYou know when\nTo be judgmental\nLike a real job you're going to ... from over there in New\nAnd so on\nAnd on the ground was more\nOr you\nGenuine troubling number on the road or were you remember that district Ron\nHaving more deployable man ... every once in a non religious reform over this month when they don't teach at\nThe\n\nI'm really\nGlad that we were able to bring in Milan or you're not going to be done by\nNot sure\nYou're going on in the room and board\nOr you know there's really no\n\n\nOh\nMinute\n[laughter]\nTwelve gauge uh make them we bring you make of its cage door to me the ... thanks his birthday was glad to be made them a check them out and made them think my in Salt she stone back I'm a ... machine in big ditches back on my next [laughter]\nYou see the yours [laughter] somebody actually one of the law\nIn the Bronx borough nigger them all day what do you find out real quick what your mom we drift Nick is where the cows in the Nick of time that my gosh who won't put beef do you want to be getting watch about um the board\nDon't think he needs to bring [laughter] tell me all my friends for\nA couple of months I Am a born pull up in that coup ... how much we see we want [laughter] [laughter] I'm back to the site but now I'm going to ask like that from the lake is now I'm\nPhone call to come down [laughter] think with that Sam\nModeled on medical to them on at the same goals want your chain and the kings on your same age you want to see than someone who you are saying [noise] I did my ... in terms of the first time they needed them turning my back I really\nMiss it turned into a small town like that of course she\nWants to introduce you to us before us comfortable don't want to know that awful [laughter] and that just took a much loved that I knew could only ... on the phone [laughter] do so for me 'cause I'm off\nSo [noise]\n[noise] [noise]\n\n\nYeah [noise]\nWon the giants hang out on the porch out on the bill for surprise\nThank you but it's not an came from I ... I was so drunk devil\nVisualize wrote this way trapped without rolling\nA trap every quarter game on duty ship thing which I Do is shift the gas is\nMake it stick the bank to help them get the chance to show the different ways but it down to a gym in ... by the impact but I just was the ...\nBiography many lobbying for\nTo stop a stocky getting a job be found\nBrought up the boxing Betty mopping fall fall wacky busy cloudy slave working\nPlus our men and not a family portrait due to\nMurder victim Molly reason in the film is my life\nA guard me for the Yankee aiming\nOnly in the world is crazy when they should in my argument to let it happen that would change me last year to go in with a geeky really saved me was the main da de Leon my baby\nNiggers showed us like\nFinally made a nigger mothers are grown up front about it what you buy the negative shut up to a boy I'll let you go to Joe nigger\nCall me when you leave your family\nOut of your pocket saying mommy math for a\nTo adopt a stocky getting a job be fair and\nBrought up your biography Betty mopping for for a walk and visit cloudy leave work you know\n[noise]\nJoined them for three hours just to Korea it's keeping their bag\nThough right maybe they get paid either see hey for the the um the mountain the fucking bad they don't really bring a staff they know why be killing a cold case cats\nThat much cash here so you know one day my bag and say you say happy new ... ... you don't have a hot the path that we're not like ... every time she said I'm doing fine patriotic to shake ten years\nYou know high on my mind my all time like I ... I just buy three by white collar bark and I'm so\nLike All right now about gay that your body directly on July ... right should should\nLet me let you know we're going my we learn lonely\nShe died she she's a she's a she's a writer blogger\n\nMay like we knew\nShe [noise]\nNa na na\nNa na na na na na na na na na na na\nNa na na na\nNa na\nNa na na na na\nAre you going to a\nGuy on\nMy mind by my by my brain by going on in my mind my by my count my grandma and my three by\nA car or I've\nGot some kind of enjoy I\nGot you\n\nThe dog you can\n\nDo better than I rent a tiny daughter's money\nI mean I Can't or a phone number is ... here for the shock me there you go to my heart stop you know\nI mean it sounds like you're gonna do it I Wish I bet they will do that they were you in every day by the ... islands you get\nA\nHo\nHo Kelly [noise]\n\n[noise]\nWell I'm In no way\nRun again\nBeing mad man that you know agree yeah\nPower back\nGrill when my boys are going\n\n\n\n\n\n[noise]\n[noise] [noise]\n\n\n\n\n\n\nDo you\nSee\nI mean many ... take care of your your mom a guy come clean like they just denied ha he Bob would soon president loving man may trigger a bottom I'm convinced me they limit eight\nMe and they see a movie that\nGetting the new games do you hear it all\nMentioned black comparable to spy on you won't get ... we walk into the line I don't come with you we\nTo the bank and I'm try I'm trying to\nThe rise in your ... your name in your life in fear and apply it if I hold on one of my dial phone call hey\nHow you how to read a book or you got to drive a chauffeur bombed you'll definitely was my older we can mean that the whole date when I ride with me when I drive a big when\nDo anything new new kid I'll\nThey may have been for the\nTeam that you eat Chinese does your mate with Sean appreciation you were one on machinery to prominence brutal winter I'll root for the mayor\nCourse one of them I'm I'm wanting to buy almost all just\nI'm hearing\nCitizen happy this morning I woke up they're going to go see if you understand what each other we do it to\nThe cameras are do\nAnything at all\nYou're tuned in today which boy DJ big juice low in the building the holiday you know what I'm saying this week\nAnd next week and next we can be the worst yeah next week to ... requests or whatever you want to or am I no longer ... you can\n[noise]\nW. O. R. she's Nineteen tournament is clean up fast it's on November fourth extremely sponsored by Madison essential\nW O R G D jays will be rocking leans as opposed to the surprises in school level\n... will receive a keepsake hands holding ... with the W. or too low to buy tickets to the pick your prize raffle tickets are available to supplement the sister perpetual window just after the event he got over Fifteen hundred dollars a frightened to give away\nHolding a strike with a repeat in front burns you a free beverage after bowling enjoy pizza ... while the scores are tallies from the prices are doled out over thirty five dollar\nProceeds benefits W. or to reading your\nCan negate to the community because that's\nForgive my little boy Neal\nStone\n\nBut you know [noise] well\nAnything that's been a debate about being a packet of snow here I mean Steve McQueen down on my way of getting the malls every day now they don't recall\nWhat up and they just don't want to look like about a week but he did not start out you know and they say no I'm not going to be around to him and no matter how much they really you know the really\nThe rub put up with no prospect don't get it I mean that's the only thing that you know from the middle east in Muslim means currently backwards it not work out ... just going back and they want me you know when I'm typing you judge me if you don't even know when you have to my thought they'd been poured in from Germany bottom we ended up with you it starts to exploit gr result greatly yet they're still ... you're right they give birth\nTo lead turn it on that so much that I think I Need to have\nMe now to look up being the the Red Bull nicotine was not me saying that climate deal that gives the hunting with something I Can't find my not my cleaning up to ... be my needs to be who you know I can only do the dirty jump looked like a marriage is simple you know want to get depressed\nDid you and me I'm like yeah because they do they do not make you think you can tell us like the Kindle Fire trucks and bombing and we both taken aback by but we're not going to see my little boy when not use on my way home I sang flying through the book that\n\n\nYeah that is\nSo no you must pay\nFor our shit [noise]\n... know diehard\nTo know the mob shit [noise]\nFor no reason last bit\nFor no reason must be [noise]\nBy the fact that I don't know\nI don't know do you want\nMcKinney stand up several people the guy in the in the air was covering me in the public the public gets them dump the camp bumped among the brand strength reduced the gang stupid sweat it affects the teams to put the claim that we can say the name of the top down to me to live with the lemon juice and definitely not ready for work it's really be better to be talking about it you know to Britain\nYou know tend to convict him to give them and make it like a broken document that brought you Jane hydro lock you do that in a new place right into my head I can't get into them when you have to be looking at the past but never on I Will bring it down if you're going to say you're not going to do work I'm going to get what\nFor no must pay\nFor no shit [noise]\nFor no reason to hard\nTo know the mobsters\nFor no reason\nFor no reason must pay for it\nI\nKnow that\nNo no no no no you know you want to bomb the only one\nYou're going to need the doctor writes about the one cop and on the legs are going to Don Corleone higher but James Bond that when I'm On a remained calm but aware that I'm On the danger is elected the noted the gang with its hang tight I'm trying to get this right to the number of the population that are more\nAbout what\nSherrie ... thoughts of not being on the top\nChoice on the costs of my job and you just do not do not appear\nBecause they don't acknowledge mom told me to start to show me the greatest don't change in the arena but they put your finger on but they don't have my second although\n\nI don't know\nI\n\nKnow one\nShoe and released by mid rise I just want to get rid of it on my blood I started writing down somebody Michelin not\nStuck dollars cash pushing the currently horizon\nIf you start making really mad structure\nFor no must pay\nThey argue for no reason\nThe mob for money for no money paid [noise]\nMusic ...\n\n...\n... ...\n\n\nYou know if I say something I mean\nThese exactly [noise] oh yeah\n\nI said I should but I mean she caused me a brain that I'm only fucking it's convenient you allow Pussy that takes you we passed the round that she she but she went back to what it is we should you drop your the leash you listen I'm telling you\n\n\nI'm Wondering I'm like profound way\n\nMan on the plane around a fan of the way they dress any plan on staying come around the way down to the way for no pay to join us and like a chain or\nPrank brand new ... Spain fan twenty thousand in my bank Mac or something like I got to change and I think that will pay me more than ... to gain back pain getting not by the droplets which lane\nI Want to give up power underway asks for his life I don't know where I can tell them when I was a power plant Saturday looking kind of the same goes up the mountain town than\nAny drug any problem with that come around the way I got down on the way\nThe games on the sound like you're saying\nI'm On my brain\nPaying twenty thousand in my bed sorry nigger and gather changed when a woman must be our brain when we are not the same needs the word when it comes to mind when it comes to change some of the game\nOn a clear but like um when the one that little ... with a honey ... which I should I wanted to\nCan bring to the shore but on the ... when the when I bought it I found a way\nThan any level that come up that way\nWe're going to gain a sound like a change amount of my brain around\nTwenty thousand in my backpack and don't mean to an end up paying you know take it then I Will take more than that would go back ... by the rabbit\nHole of the money but the ... which came it twenty down the number back pocket not bring the guy in a blanket that I grew up with me\nI've never tried to do the same show just how to play the Mexican side by the German and one of many money what they\nFound a way where there were some home\n\n[noise]\n\nA [noise] a\nA\n[noise]\n[noise] maybe I now I Know are you married to land a man little boy\nSix so Don little bow al man\nYou noted message but again they're free to God I Know it's been well I've been going through a few during monsoon than I Do like my\nBoss she ate movie was so big bro which you know we are on our joke we many get down to man oh six oh wait a trait where one so far what ... what ... what was going to say\nAbout the oil and gas masks they have a big round marching on\nThey you know what it is all you know people\n\n\n\nIn the body uses Saudi or you know come in when we watch them by name I Am now I guess my yang by\nThem out nine [noise] wearing knocking on wood it's either or worse than body they are and they broke the cats are tough for him to go in and out of the worst for many many more than that and they're going to learn from me more\nMoney yeah that's for sure for sure for sure for sure what you know if you don't want to you know growing up it caught me get so shy\nDealing with these kind of going to like the hidden that you know where you're from a damning answering a jury [noise] snow when you're a young girl you know when you're dealing with a guy by now but I'm going to get to them it's not much to do it again\nAnd nominate doing man for me I Want to see the Danish audio on a on a union but I don't really you can get out of\nYour body uses Saudi or you know come in one week or so you know often by the way down I'm guessing by gang banging on the\nMechanism out line wearing knocking on wood it's either a western body may or may not broke the Catholic\nJoe is with us they are they not do both like there was the lead show they go to work and sell it back to work for me I was going to run a project under going to give me some ... or ... those are my favorite somewhat day I just love the chapter was good with money get\nYour money in your book of a bit [noise] doing that with our parents that are lower no medicines turns into just doesn't seem on our\nDealings around the girls are just as bad as they can just do the grass as a result of life I got thrown out\nLike last night was alone will run it would have slowed the well we better get is owned by where I'm going to get it on site so they would they don't like you got a buddy light though I'm just trying to get some giant go up with no body the research study that you know come in with me 'cause you know often by saying\nI'm thinking about I'm guessing by gang banged by\nMaking smiled I make somebody knocking on wood a cheater I hear what some body pages ... just broke I guess the Catholic three shows there are they not do both like there was the Late Show they go to work or sell it back then they do work for me [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n... you really don't think the thing the whole thing with the campaign three banks did make the fans give you a pack the bags they may need to know what\nI Can't tell you my big bang bang bang bang bang in the mix it up you know can do to prevent him out when no man man cameras around when ... when they can they say\nOh I'm Still a milk is going to be any dog maternal wall street from the stall church doctrine fake\n[laughter]\nPorch you want to know about it now we'll talk about what\nWe actually would like to know everything what is your passion of what happened ...\nIs the man I the man\nThese these ... right so you\nLive in\nAn interview and the\nPeople and\n\nEven though we may have known that are not there to be you must be trying to lay down trying to ... we may win but women\nSee be touching me when you when it got a ... job broken now for for free on\nI was traveling in the great thing I wouldn't eat it would be broke with loan\nEc came here to pay the\nFor me or I'll put people in now the known in me than\nClear in Franklin Delano Patti Brown ... bring me the way they know you put in a good bit calling me mad at me because when they may get down like a cheap way\n\n\n[noise] [noise] [noise]\n\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\nAnd\nIf they can choke points like only\nStudy\nThey\nThe Enron scandal\nGood lord\nLet you lead but\nName though when I was\nTo know a\n\nMy mind is the\nThan men around\n\nNa\nNa na\n\n\nNo money will come on now\n... like what did I get a job to do it then the\nNa\nNa\nNa ... not alone\nOn the last\nThing I thought this was a good thing but I Know\nThey know what are known to be your mother or my\n\nMom I don't want to get\nMad and I\nDa da da da da da da\nDa da\n\n\n\nDa da da\nDa da da da da na\nNa na na na na\n\nDon't want to get\nI don't I Know that I met I met\nThat I'm a law now are back on it\nYou and nice green God\n\n\n\nThrown at them\nAnd then uh I Know that\nI Know about it\nIt's so\nYou don't see\nAny sort of killing money's always told me this morning when I\nIn [noise]\nMake\nDan Yan son\nWho's ... again go to\nYou'll get the mental\nI mean\nI'm not saying why [laughter]\nThat means [laughter]\nThat they\n\nI'm not saying why [laughter]\nMe me my\n\nSaying that I\n\n\nThere's\nMore than ...\nMillion dollars in your shoulders your jewelry money's always told me very much more strict by what\n\nMan\n\nWho's a lawyer in the world and I'm a general surgeon di\nDi di di di do not do well yeah you see this on my ...\nHe's also very\nWhy do we have someone that I don't think that you know let me and I think that you know that I mean you're not going to come in and said I didn't hear what you do when they say is we don't know when they have to do it again and again you can buy them to come in and I got\nInto what are the are going to learn\nNow 'cause he's not someone who is one of your sister or even a little or nothing to really look at the airport I can almost say they just go for the last time since just for that scare numbers\n... composed the more you follow what's going on but it does keep all the you know probably ought to us but I got like when I'm wants to cut that whenever you\nHave to look for someone was watching the debate over those are ... in the recent grads that are less able to keep them once they got their directly in federal loan on is they are going on right now they're not home\nWhen a couple of what I might give you better believe that women are minor by somebody reports that Gadhafi over the ... you got your depending on\nHow to look out for a while now you look around there is a good number in mainly in the not enough elected to follow but it's only I'm like hey what that means ... ... ...\nYou know one of the critical some of the same as you say someone's going to look at what are you at a protest they feel like I Need to come on the issue here listening list\nA miracle in the hot air [laughter] order live whether it was it a lot of the school like ... have your kidney or [laughter] hot air left it\nBut I think he had to say it but this was like he is going to look as a a let me turn it on that but I get a look at the the the other countries they look at look is a little\nImage or can we talk to them as president on audio and expanding medical into some yeah some ... some went through a lot but it's not like it but I've learned so much below agency you want to be\nThat yeah that that's the other ... go by the Motorola gets a little bit what is that you had to put it\nThat Clinton now a couple of north of ... you want them in the name I find it on\nMy own went on for a needle in the middle east has been in this country some of those they they when they think they will look at this like you're going to go through a and get in a bag or are they see you and me and then I mentioned Mendel's competitors mother let's let the dog will\nCall you up with him or he could get into the I was going to have most of those ... somebody must have been away from the mid ... when we get you know that was very good but I still do not like you're not going to get things going on my lap quite a bit much different\nAnd so is it going to look at them you know I mean I don't mind if I saw it in and making it a lot of every dollar of and I know like I said it'd be done to hit the game but I Wonder if it means that it could be that's what a lot younger than I Do think\nThat a couple or undisturbed remnants as low when Facebook the seventh and looking at us labor than us but I was a little ... ... for the most ... are are getting for the most perfect at a company called ...\n'cause he's looking for another ... none of these protests when it's going to need when we bought a kind of like what you end up with a phobia mentioned you\nKnow what will come on let me see if they're not known they suffered a little bit of sort of get a hit man or something because you know just the kind of level and at the movies in combat or lack\nVoice I forgot to tell me more subtle over that she's looking for some of the little kids so it's looking for someone who is a kind of women are not getting in St Louis Sullivan Sullivan free press the\nTo the U.S and talk to the center of the money some ... let me think you know that's a good location or a thing\nThat you know all that but they said on the occupation but if it might not know when I say something about the lives in an added ... unpaid or the west so for sort of ... percent ... percent ... percent that you've seen is is that you're going to play in the way an insane three if I told them yet but let's begin to see a little mutt doesn't intend to be adults in practice\nI mean you just don't know\nWhat I eat which we didn't have to be just as long as it's\nYou're the critical still only about what are they going to be seen as a producer of like what are the gate a circle but I don't think it's all of\nCourse I Wish he looks like it's almost even what that means Iraq a few but not a health the locals are able to get those a lot going to lose his big that would be to be in the yeah those are not giving them or be able to get into cars on the yellow she moved to just get simple there was no if it can look up look it looks like it but I\nCan find out what your first one I could get into that I knew he was just what I meant that I Will not be offensive maybe only maybe ...\n... without than those who says I'm never going to put this or not and I'm always from there and they also have to know Robin what's called battlefield levels in the neck in Wisconsin and crucial a oval\nAnd then on the other all the Iowa testing along with it and then um\nThen they stole ... still miss the people that are still in school you know\nI think the other side but I can know chicken dinners and yeah the only one that was like I said what is it was ... which is going to put them into the into the yellow go back you know being a blinding whenever the Buddha April ... went into was when I when I Am in a sense yeah maybe maybe explain okay the most good\nImage eating is a state it comes to mind as well as as much as I can make a couple of those coming who was\nThe other ... come on I don't know if you're going to go up and coming up\nThey said all those people when they say those middle no I'm going to come and take away the single you still want to watch a\nLot\n\nOf money\n[noise]\n\nBecause like I mean that's how I Am not a unified Monday and like I'm not letting those on line [noise]\nMan\nWell no\nGod\n\nThat little you're like well what do they win\nTheir un membership or whatever well\nOnly\nLet me ... minutes\nWe already yeah God he\nThere's been a man thing\n\nYeah that's one thing\n\nMan though I was ... when the\n\nWell do you just\nLook at the end is we have\nGo to the\nThey gave us when maybe\nWhen you buy a house all\nNot to get what in the last Twenty years who\nWe're going to be\nGetting around his namesake\nIt's ...\n... when the get\nA little bit of\nBe the most dominant do get up and see what do\nYou do\nGave me the most the I'm going to get into the most one will be new\nOn\nOn the game right about the ... the government is on the\nStreet if I may\nThan\nNa na na na na\nNa\n\nThen you're in la vida\n... na\nDime at all levels all we got to be in the\nLiberal sequels\nPrevent\nMe my bill that would get a job but in the evening\nI mean I must have would I began last a little\nBit of land that we are in the ... plus years and\nTo pay\nFor them to me that I'm not\nYou know comedy about all\n\nA lonely it will\nBe that that'd be tell me again there are a lot of\n\nThem enough well those are\nAnd I\nI mean look in your little ... we're going\nTo be in one leading\nTo\nThem and beat them in the other one you ever get your news from in a\nIn\nThe\n\nA ... older than them off game\nWhen the government by other men on a man and look bad\nWhen the normal in a good or bad\nI mean I\nThought it\n\nA year long years will\nTell me and my\nLast ah [laughter]\nI mean\nNot only that\nThing that'll will hold a\n\nGame but about ... years regarded as a\n\n\nYoung girl who's got what got me\n\nThinking you know you can't oh\nNo oh\nNo that's the one that it was one of those people that you can go a little bit like a little bit give up another ... but a lot of these have you done a jump into like\nOne of the given to me but but again you've got to ... you just to get up we were blatantly yellow guess that would mean none of given in the door to know whether we would like you see me know what the ya ya mail you a ... but it's\nOne of the people that I'm going to be done for the good of what they do what you do when they say go meet them at the dinner\n\nWith everything all a lucky guy he's like in ... and they said well yeah the U.S into but when did that we can all the other my younger upper level because I'm not going to do this year\nIt's not unless the the the skin to wind up with the more than likely I got to find that kind of the ... got to let you listen to come I don't envy your your money\nI think ... I can just kind of holidays [laughter]\nYou're not going to [laughter] 'cause this is too it was good it was good as the author novelist [noise] other than others but the only disadvantage to look it up with was going to let them including a little more [laughter] you know what's going on in the\nMiddle of his lingo they laid the ... the amount of weight like it's almost like eat them a lot of those studies if you have to come across that they do not end up looking at your mother\nIs that you know the hit on when I was putting on fat on his comment that'll get you on the ... to pick up a surplus Corey those you brought up with a couple yeah yellow which I think the yellow or a yellow salad yeah luckily those no I don't know what was the last one blameless on what Michael scenic as they get a get into the world\nI think it it was ... you know let's call it or not they don't even think I'm going to come into my ... my kind of\nA high quality those was that even if the people they quoted goes but I get old you know it's been kind of stuff not talked about a gladiator the chemical get them I say that I read those for those kids don't even see them and release yet you know let me ask you know I've learned\nThe the ... the\n\nDe\nLima\n\n\n[noise]\n[noise]\n\nOkay yeah I mean\nLoving them\nBe doing in\nSchool\n[noise] you\n\n\nLean on now in the middle of the\nAre in the ...\nThe [noise]\n\n\nThe rocky won't be an immediate legal means that we\nShould\nSay\nMoney's always going to like\n[noise]\n\nI don't travel when they ...\nThey are ... by an awful and I mean if Fannie\nIs that they might have told me that they were walking is also become all in all the jokes that point in the ... the whole the whole thing went like three so often ... [noise]\nThey go all the money's going to\n\nBenefit not to know\n[noise]\nThey they don't say that I mean you know that I'm gonna go to the general the Dutch and then I wouldn't do nice to have them in\nA show than other one is going to be number without a the way that the ... they got some also going some more mature enough to be done we're going to say that I'm going to build that up on the government I mean I think they don't do those things those we don't know\nYeah you got to meet you but I make all those\nBy somebody with a Jupiter Jupiter Jupiter but I'm going to do which is you took him to get that you can look at the time you go but we know\nYeah we'll come she took I'm ... I'm not either of you know because it's got very humid here if I don't get the votes heat up as I can but you know what that means or what I hear the when the funny thing is aid but if it was one of my company but you're not allowed to make I mean they got [noise]\nLike I said you see I'm a little bit about that all my gene necessarily as a union I mean not only manuals Monday she wasn't him all the way somebody [laughter] you know all the way skip added up where\nAudited by some estimates are that will kind of like I said I don't see them and I take a look on the other things they don't you think when they say those we don't know\nYet the numbers that reflects you and they come back I learned this way they are they going to say this getting us get almost as if you will not let you look at the time and then you gotta like liquor but you know you're going to ask you know single not believing what other listeners but hey look about no you're not you're thinking\nAbout it you know they say it's not really feeling the lessons that yes I think I mean I savor care and the ...\nAnd unless you're better [noise] super shots you almost have to make a retired from a listener whether in Atlanta [noise]\n[noise] yeah I think in this I'm On a deadline looms other victory another\n... ... ...\n... what I mean it was one of the U.S let me go to ... ... the president of the other way they say several look at the illness or ... or a little bit to the root for the little to get a\n... percent better donor I'll just get the year and you just look at them and not some most readers but on the bus they ought to go\nYou know what do you cook it bought something to be the only ... Islam either north\nAnd then we'll said well lord of the last moment those inspectors some combat if you're going to take one of those\nOutlook that gives incentives because it can be done\nAnd look at the study or how that is true Roberts at the remember the order started rational thing or the ...\nThe ... [noise]\nLike what are the counter to ... to be that started working as a seat that [noise]\nThere's no solving [noise] on the toilet beat is they're going to [noise]\nTake one of those took it as a deal [noise] and for sending causes more of your book about\nEtiquette devout you that\nI don't have any federal ... [noise]\nWhat is it legal ... [noise]\nI can look at the end there's got to look into Israel and in return for them to the friend years which I put a circuit pay us for the west on market gets a reasonable that money to buy you got another thing [noise] he's not going to an airport in one day I mean say you were just when you're dealing with\nJust [noise] which causes and men than New York is sucking in order for several reasons to someone on the last ... get that I own a [noise]\nLot of him was that for a lost cause us to get the most the most gay um [noise] and [noise] and forgot I'm not saying and they submit an estimate that getting care but I yeah more than that gets on the most [noise] and that kind of [noise]\nI guess I get it for ... for a lot there there are so at least ... finishing this I'm On a\nGay guys just put it started protecting us but our car and I says Puerto yeah behind her son Todd [noise] hold up into\nA across the [noise] other than a walk or do they get it because it's\nGorgeous [noise] um [noise] but I certainly think that sometimes these DEA when Phyllis ... is with a leader in all of this but it is isn't it costs us going up there and some people but they sell them\n[noise] but I Would have retirement or whether it's\nA nice mhm\n[noise] Mm Mm\nMm\nIt's a\nLittle boy on you\nKnow\nYou\nKnow on a ... a gay\nMan in a\nMoney's always seems like you said you\n\nKnow they see these people a Monday so we're going to be doing things like that\n[noise]\nBut I don't know the ... what ... what about the some of these things you do it I mean you know the things he did it I mean I live on a ... I just have to do what you do you think when they say you know they're going to get done in some of the things I just wanted to mention you what about the numbers that good as they get there I mean you know and\nYou don't feel particularly though these are booming new not a young so stay on the list and your own and are these ... and you don't feel very naughty or nice annoys ... neither one of my brother in law on that [laughter]\nDoes it but I don't know you also have to learn and you know this is the way they see no no no I think\nThere's an almost ... ... ... that's good you thought about some other either when I went away\nOnce I got to come by the earth and my son he'll go looking with three or four three you're maligned funny he only can only buy so many\nOf them for like I'm not a whole lot of these say good luck on your that 'cause I'm going to be political uh\nThen he got up to me but bottom out of the moon yours and there but to that a lot\nThey land on whether the nickel button was his role I think he laid out by somebody and\nLimited to learn what on earth or is it going to go see this as they want to know these ... residents I just wanted to say good morning to my love ... from ... beach and I cannot wait to see him today and give him a lot of kids that I Know one of the uh\nThis is a limit to get us either one of these I mean what a big story the other ... or\n... ... tons of and so on and if I see it but I Do not all of the insurance you don't see them on the corner you don't have to just record and reasonable cause let's recall thought I had to the doctor can know for the most of them was convicted of religion those are those kinds of prayer but I\nWas on the part of the color is the ... and be able to ... to ... months to a lot of concern to pick him up to the protests to purchase a told them it's like you're just working\nWhen I went up like you to come and look is almost not unless the other one is coming to see little kids of today a salary you hit the middle school is that if you into different leaders if someone in the middle part in a place that's another matter claims they ask\nFor much into somebody's forced into it it'll come up in a school the other thing is those meatless Monday she'll she'll eat until if I stand on the book it was the and the lungs as they see clear contender\nBucket will you ever go through your and your and your those means is your interest in ... years me a couple of land or someone like either I allow for like a combat early last that was not the man who middle what in fact what in the heat that if they say\nThey that's what I find that gets us into a sequel is political ... is the annual meeting of the future let's get when they said look as I put myself in a look it's a little bit less there might not like a ... that's the level where the machine\nOkay that cannot do my cat author whether it'll come about government\nKnows it has to do with it because you see this level when I don't mean to a guy a oh there is what you're about how to a better look on the market is loving this summer chemical and they do when you think that was funny\nWhen they came to mix it up and I said I think when the universe I mentioned the\nAcademic um you're not going to make you take a percentage point at UPS that's up a little easier for me to see that yeah they're always in a while like I said look into their ah\nThose me guess what are they not on a stick by them and you're not going to take me my client the new election which isn't that you could present day you get to spend the money you know it's kind of leader\nThey're going to hit them into the um you know he's going to like ... when they see it\nAs a threat than we usually ... you know you're you're not going to be I don't think I'll be on your program today it will ever lemme look look at those ... that can lead to political anatomy on if\nIt's got to think of it and ... and I just find that unnecessarily the law and order orderly ... may\nMay not get a little bit here and I'm going to do is go really mild according to you know you have a whole come with you you know reasonable credit to those many more quiet and they married Moxley money why didn't I didn't know\nWhat it'd be comparable to another ... percent though I give it to what is it that you're in the\nWork as a Mexican military and [laughter]\n\nIt is a killer history to those of us who lives on this was going on but as of ... states including what they get their\nCars that are going to hit the in the face of another quick I think they're going to move out to buy the meat of what I saw was about to leave my time I go to the west but adds so much much much that'll say look to you\nWhat would it goes to see any of them is that his ... and they owe a job when I was going to ... to ... ... no matter who know these ... get out when that guns on the\n... curl up ... must be doing a gunshot wound up the last time I love when a lot of interesting\nThat way when I was also comes at a complex it's almost like a botanical by it but my son is ... you're going to circle but I said look alike and ... ... now does he joined us lose\n... or ... likens who's either going to go but I just I think it's rather than like athletic I mean not a [noise]\n\n\n\n[noise]\nJust just seeing use\nWell it is to the\n... kids or your mind\nIs\nGet emotionally to sue us just in\nEnough money or nothing\n\n... well then let\nOf\nPhone down pretty ... the\nGuy that\nYou know a lot of your shoulder\nNewsrooms and you're\nThe\n\nKnow the law says oh\nThe the magic wand that would be the last ...\n...\n... ...\nThere's no one can see some\nNicer if they go in the house Asian ... digital and money's always told me to read a lot more strict by\n\n\nAnd then they go in and they've also yours you gave was and they look is it'd be get to know them and it took him almost input is willing to listen to it but I can listen you're just a ... a ...\nBut I get the nails or the other all the opening for my son to take another getting federal and almost ... for about the middle of the generals or national complain that can cause a lot of them as well give me for my ... minutes from us you\nKnow but I didn't think that the book or did he spend on a [noise] you've got to get them at the time you know a lot smaller than that you know you're going to get a\nLot I Know this is again I think are entitled to enter our own alone but don't go to the guy that you'll end up you know killing winter only common sense I thought he says he will get something in St Louis you never got into the seminary study yeah\nTo where it's going to you don't do it and say let me see I like to look at a young one of them are here today in Michigan or into the case that was when he does this go if we can sound on another point considered momma I knew this was a little bit and see the extent that\nFeeling better go look at the age old went on that mammography yes and no medical any kind of see no this is a chemical than in ...\nIn a long day the sense that we're going to let that boy it was an incident where will they let\nIt sit there for them was to cover for the middle of a sudden it's just about the scene for you this with this summit they say I see here you have to meet those documents that up yeah you never asked you to consider that a lot more ... leave it at the expense of met at a store I stuck it\nWhen it starts ... Ed Markey a supermarket I meet ... ... ... ... was waiting for them at least if we didn't look I don't have as much ... cancer they momma I sent me for my son goes to the better place I used it for myself\nBut others I mean they're single or the other than that though is the time for my own in that sense of like you get to those people but it's going to spend\nA lot of Columbus it got to know what to make up a lemonade stand for that\nCome in and out in an hour length of time to try and kill it\nA long time like ... or something like ...\nOr ... or whichever rather than looking at them for ... ... is to sell them at ... for the funding and that's for ... years ago is more than me and my little brother is is this a little bit of things I can that'll how let's pretend to lose his attempt ... winning components that are not only does\nWill know that little ... to ... to ... million last three million though these are more than maybe the under the currents ... he's a little ... level and then is called the ... in\nTo wait and all the time and that's one of those early competitors going to focus on it or you know nobody wants to get her so much going on inside the level of safety don't you\nWould they say you know we don't know that was going to settle a couple are going to do this is your your mom ... ... ... ... ... ... not\nA very good about things that are most of those ... and ... you know they we let the let all they do but I was going to be when you're on\nThe on the one that I mean you know I didn't know they they don't you go through what they said well you know like what like a little bit is you know those that they love for mammals oh what a bagel\nAnd a\n\nLot\nMore\nTo go see\nYour show people that money's going\nBy\n[noise]\n\n\n\nYour your mom or do you move from Tucson, Arizona you know ... some\nOdd\n\n...\nYou're going to make a big\nDay ... but none of them\nYou know get in the snow day but then\nYeah you know I Do\nThat they can do it\nThat is ...\n... do not I mean no\nNo\n\n\nOne other call we go to the ... because\nMore on this because\n\nNa\nNa na\nNa na na\n\n\nNo\nNo\nThere's no you\nDon't want to see\n\nSort of jewelry money's going to be\nTrue\n\n\nBecause it was a little bit on the ... say they bought a ... eleven did a little bit oh no Wendy rocket or your ... brought about the what I mean they get a lot of what you do that so\nNow that I'm On a\nFor me but you know I'm not\n\nI guess that would make sense to me that was like well I mean the the ...\nAnd so\nWith the guys I don't know how do we know when I'm On my mom I don't I\nGay she gets it gets I might have or are they doing it because I think they win if\nYou look at the other thing I think I Would recommend LA equal Iraqi into another when they go by the ... the days when he got an egg I seek it I mean people for money or like you know the unions Charlie Chaplin is going to see them all the ...\nThe apple means that the government was a couple of things that the ... do\nYou get to that I had to go buy a port city I'm hooked on the other is a political silk um with with the money for three years and I said this is what you're working for us when it came out the ...\nHe was saying you know every time\nA political every now and I don't know each other they study that way\nBut either [laughter] I thought it was like come up with New York I think what the reason I was going to send me goes a little kid rely\nA ... Bill Cosby there just aren't what they can beat him when he used to me and I think that's just that those that you think about the money will mean get get I mean that's what I was once I thought it was a kid lawyers before so I go to the money to get a link I just\nI think I'm a link um another look is a stick with it whether they allow but after ... ... is greed or based on\nA grill reliant well those are good buy for the sake what they eat a lot but I think it's you can with them in either start nice to meet up with a guy or a mother oh this west\nAfrican which is which are which are the guys just I mean I I used a at those numbers must not to express your roof even to get China all\nIsrael is a legacy a look at the bus threaten them with the New York\nI think the money I grow city is still good but you go out and some people they miss you went by sort of money to me is I Love Mexican greedy and I started like it's going to need those ... ... you can almost in the summer but I Will admit that I think and what you do business would you like this is a total because I Know a\nLot of people in this community burgers you know and those are and when you're in a general matter thinking but then I thought it was known as an idea that someone was to\nBe now why did I get the global inside [noise]\n\n\nTurtle\nOr changed by number one for every family is that they might phone company was walking is almost like I was in bed for my son was he was testing when three so often that killed ... out here [noise]\n\nWell you know he let me and I don't get to that on the other ones do you have some of them it's just almost a ... a lot of stuff you're going to look at the lower the amount of people joke\nAbout a good look at those employees that included I mean you know they have the number was ... and they don't even think about it but I don't know if he was ... yeah that makes a joke or it's almost ... ... ... what was your normal mindless either I mean you know we'll both ended up living in a blue dog\nIf that's what the gentleman who want to do that no one's going to limit its name is Joe ... jumping at any given that\nThey do what you're looking when they have no matter what they want to I mean\n[noise]\nThrough it [noise]\n\n\n\n\nWhy is that if there was that the new lower and deliver that it was me and my darling and moving one on one of the other was that it\nWas the architect I thought I can do when he got it might be soon\n... was ninth or when they thought that we we will need better where it's almost like he\nWas actually [laughter] oh my God look at that will be in the act will get the news that it was really the number one you know I think he had a baby and I kept on it\nBut yeah it's almost like eating in and I think I could I don't I don't know if you don't have a similar\nAs soon as the president of ... on the border the phone booth\n[laughter] who do you think about that I got caught up yeah no I was\nGoing on with your son or you know you're on line [laughter]\nWhen you're going to be the guilt and did they get in on the other ones are good things will own that company that good at these bottles but it's so nice and soon to reduce\nThe old and the community that does sound like you're on the equivalent of a regional bones you know I'm On I'm not going to go go go\nGo not Gabriela ... look at your data what about what you're going to look at it as you get when they had another level which I buy the weather's nice to meet up all got to meet those little ... okay I'm a little this\nIs how we got an atheist you know what I said oh no sued fuck street Monday so we're going to think what they see it but it's the ...\nWhen I learned a little another that you know you'd want to let them in his own members have done anything other than the were the jewels I've been to get\nThe benefit of going to be seen as it might not be one of my family's all about waterboarding will not any ... men will go on for me you might not be the duck with the economy that's a start up I thought ... so\nI think I saw that in my mental Puckett among us it's a ... minute medical meter Clemens yeah there was one of those are the ones\nThat you could see it because he said oh no ... it might be something was going to think what they see they see\nOkay you're serving on a long look them in order to yes\nOn the ... okay if he got the nod for almost ... like I mean they will not be able to go because I like the the holiday\nThere was this in my ... my ... coming up but I looked at as soon as\nI said that on a ... year that I said my nano\nBattle casino the nicotine and the other day he said he said well yes I think I could I get it I can bike I'm just kind of a number of catch and it'll only but why they're not at the same I Know I think that's in your lap when I ...\nI was a ... a month those bottles you did on the line here [laughter] [laughter]\n\nOh it was I was in the ... billion into that I can you got a lot but it was a kid it was like all these other\nFive dogs but none of Connecticut's got any way we give you stuck with it you know what it's like it's got to look like they put him\nOn a on a liquid water so they put him in the middle of the [laughter]\nWe can't go into ... it's a matter of fact\nI was thinking it on the most that just might want to right away that you know what to do when I when I was in the middle but is it a little earlier this\nWeek well there's no other but I but I think there's another ... you know pre mentally ill none\n\nOn I Wish I were to live in the middle of law is a little\nMetal metal\nOn and it was it was like a bunch of Monday he can muster buddy\nAnd laid out\nOn a liquid busted in Astoria\nAnd so everybody the hero but in ... or you can pay within those guys they turn up in your nose\nJob I mean what what what all the automobile\nIt's just the money goes into the amount of heat and the books are going to do with the symbols are going to listen to you know companies\nBut fat I end up\nOn the way over here it's not only telling them who not being a Muslim and who's done this when it comes from a quite\nA it's a lot\nOf the company is to put the new system or something just put it on the line you know within ... understand you know who you're coming\n\nKnow what they say\nMoney's always told me she was like\n[noise]\n\nYeah some of the reasons for that but I noticed when they pick on the computer that you know that I mean you know what you don't see what they say those innocent then cutting in and then comes when they come back I mean\nOkay let's go with that comes up in the ideas as you get the myth the jungle might loud noise in the minority cannot buy you a keep working but it was a little said it was\nA little ... is a clinical not again and again scandals equal can know getting ... getting since the ... and even if you're going to roll up our companies say ... what are some number of an hour the means to me what's\nGoing on kids or your Guinness me is that neither one of the you know many you know it does I Know they may have some medical care and they think they know yeah I noticed that like what am I ... I don't think going to go get it will give you guys would normally sex\nCement ... you're not gonna get up and now the honest\nTo God way the law I bought on go on the man they wake is it is about ... about like\nYeah that that little who who wins the are on I\nWon't bother them up by somebody yeah one of those you're going to do it I mean you know they they don't you think when they go and you really don't know what the intensity but these people but I think you're going to go but if you didn't know that we're going to come up with the political eight minutes an electrical Jamie ... lent\nCircus you bring your stomach ulcers ... what does that a girl I'm almost embarrassed theloop told us gets done incoming nobody else does that a black hole in the coming on as super super adequate under a lot of those coming out of the ...\nOne of those laws um so what does one forty minutes but I'm going to be something a lot of layers plays the part of this by the federal it goes up on a whole lot about it because of what I'm seeing on modern\nCity hall on an airplane since I looked at it you guys get sick I Know I'm going to be that these are members and there's a Monday it's worth every Monday at them as they're not going to blow up a nickel ... I'm going to let you go\n... go by the the as a group you know Steven metal metal and you got your this promoters on Mondays or delete the toilet ... says he and my ... my ... I don't know either do it I mean I think that what you're looking when they taste goes we don't know\n\nMoney's going to\n\nBe sitting\nOn a lick 'em by the rules being I'm a little child and they'll have to buy the summit let them as long as you know we'll let them read on Letterman had donated ... million or I'm All right a long time now\nFor about forty nine bucks for a job on voting on my cell phone my phone call from\nMy voting for may not be voting not my forte man that might not be about forty forty one minute by\nMinute\nAnd the people that have been in in ... they may be the next minute and then they're going to be and then the new members print print and then in ... in Japan and in in\nOrder you know well I'm just not motivated among unusual ... loans it's about two months voting among the man I'm On my voting now may move to morning nothing new story to the phones phones condoning apple monarchy voting laws are needed my voting there's long been a lot of you to vote no\nOn just wants to do for you know on the middle of I don't mean to\nMe somebody\nOn\nThe news from Israel and my\nConcern they mentioned independence and it's been in Congress and been in and then spent independence movement didn't mention it to the ... and then in many different and then in the middle east and then and then not\nOr you know almost ... bucks a month to voting on that amount of money is not good enough problems to conduct minority now following the bottom of my learning now to Hong Kong my voting national man minority voting enough well I'm ... I'm On I'm about ...\nBought them to be voting national medal of honor to be able to\nGet it all nationalities and then and then I met him out and then they both men and women and they all met on on the Internet and then they have been in it and then they won't let him out of the owners and it's been a while and then a lot a lot you\nKnow they go all single mothers and we're just going as soon as I\n\nLost\n\nLot of ... the man a guy salute but a lotta or does it with a bright young love or I'm the last quarter they know the ... the ...\nBecause they're going to go to be not allowed to do a lot of other your mother would order\nWhat's your third murder wouldn't but more than ... ...\n... I Wonder is reasonable but you're not a result of this I mean do they\n[noise]\n[noise] I don't know what to do the the the the Turkish you'll\nTo remove them from\n\nThat [noise]\nAnd that baby yeah and they\nJust go to Don and Don's\nAnd\nJohn Donne\nI mean you\nKnow [noise]\nTopic and they learn to um to play a little boy\n... on the original got good because you're ... and that is the momentum but all ... all we he should know whether this was the middle of the U.S you know we're the only a cassette but on the corners\nOf the\nBetter so something that's just so they just started to almost there yeah just just as ...\nOr ... he\nGood conservative whenever we\n\nHad ... ... what I eat me that but there's a lot of ethical rail or even something that\n\nNobody else has to protect us all those but I thought a hint that they\nWould ask why I thought it was anyway when I\nWhen I certainly am I seen or I Would have been talking to somebody jealousy clearly law and I wasn't going to name and second is the company and then he was looking at my ... going to be done within you know the the video the ISI no at the upper middle upper lip and mental Tate hey let me go in for the new of\nMedical expenses when it gets a medical disease you know like what the second election where she lives with no because he went over to eat than it was made a number of companies I\nSell a lady from this don't you don't you let them you know what I get it in with a legal ... one of the other number was that most of them and sometimes you have to get to bless you know but it also I Believe that you can buy a evidently it's I Know to fill up on the most I took him with I mean um\nAnd it could video like and certainly they know toughen up whenever he wants to ... when was the complicit or they can do to people that but it's the look on the so they know that I'm you know it's almost like a new phase of life is like what are getting a split in Connecticut more under the federal laws\nSimilar because they want to say I was\n\nOne of the U.S [noise] it depends on the ... one of the other another someone was a lady had a book if he doesn't really is what you don't want to live on\nFor the Senate phone see when I went to the U.S [noise] more to me when the U.S alone this we're not\nGoing to get to know what to do so but what are they are not going to get ready for what you're saying it's good you know what a deliberate policy to\n[noise]\nWhen was the eye can see what was he thought oh my gosh you know the menace kept my mind I Can't remember where somebody\nI'm within a key humid I generally going to come with him but he has this\nBeen\nGone we'll get famous scared because if we say the the the story all over the battles against it and I mean I\n\nWould have been for the last\nOh you must have been for them to the units Clinton was split is a lot of people\n[laughter] I guess the\nAudience for it is I mean he must have time to time got to go against them and they had to have been coming up with that but I I just wanted to ask you might not be upset if I was in oh you you know but I Can't eat them because you don't\nGet\nUp with the guys by somebody in the coming to you know I I but if you are the most one thing that's going on\nBut I don't use the wind up spending a year and a and\nActually when they go to college and he's not as fun to see this company called on your company Daniel wound up and so when I eat up at night some pretty neat to see to have fish and then when I see\nOn TV and they were not understand that not\nAll the oil but ... says oh you haven't done about that on on your bed or they don't do the young living effect when he said this is a business and I don't have anything like it will make the money\n[laughter] you know not that it will say that the last time they didn't get company okay okay [laughter] the last ... unless they get it out on the kind of\nNot going to get sick in America has been so much for the general is going to support him he could think of at least a novel for these some of them but it's going to make the minority not backed up by Nazi which I just I said I mean anytime soon 'cause you could you tell them anything is Losing Up so early in the morning that's already know that was one of the matter mano\nDownhill again when you're done you're going to go\nIt's just nothing that let me think there's a couple of days with some of them you need to look at the moment checking out a tunnel I but there was any amount of it and then I just don't want you to go to the United states you know what you're looking when they don't even know they say what you do when they say it's a deliberate and got me not just the basic consumer good could send up either\nYou know so say up on them all and I live in Illinois woman or one of the automotive whether it's\nGoing to start\nA yucky understanding lethal moslem gyms nobody called yeah what about the Somalis 'cause he's the the boy you know you know a modest not [laughter]\nPlus it was like on but I but I we see\nEach other what else what else you're not you're going to let us\nSee what else that you want to go\nYou know why they don't want is a good amount of ... percent below what what what they said look this just sort of ... ... ... ... if you don't like the\nYeah the ... as well have been with us on the commercials are sympathetic doesn't know\nThat that's what my thoughts are about ... ... yeah I don't mean going to solve that me and my last a medical market I can see you live by a lot that\nHe was in them I mean they'll end up having that kind of the coalition\n... a ... a symbol of the joys fair for them to seamlessly into federal when it's not even said to me for a million dollars in Sacramento\nSo no not one of them was in the low ... says a lot to do better cinema to go and then we'll get some ... ... you can almost ... you know we were meant the insulin some questions and I read up on us and then another woman with an image but on the\nChances that supposed to talk to are we learning is because that's closest to you was your ... able to cope with the ... federal ... for a local ... take\nThose Daniels well\nHe I mean by that simple ... she left one was the apple cart that's all we have proper looking down on looked at when you got your ...\nI can see that that day I mean by the emotional set that eat all the globe while living in a school that's all he wants to say it's a wet go in and for that's all that out as your last last year and I said what about the last part I think you've got a lot of the book I said you must must have equal but at the bottom of a ...\n... ... da da da da da da da da da da da da da da\nDa da da da da da da da\nDe ... over but I'm hoping I'm leaving and since then it's going to have more than that then we just go says no they don't they're all going to ... on ... consecutive let me spring's 'cause you're listening to motivate him the current events\nDid you get to know their lawful [noise] I can ... or I get to the name was ... I mean there is the enormous you're almost ... Lama officer Yo Yo's clan themselves are but they eat this you must ... just a moment and all\nThe Europeans are going to school in Boston or we're not about the only than in most good looks you're not a ... law locus\nOr see it was a lot of it I thought if you do is look\nAt not most of our the lowest level by ... you can look I Will not odd or level that's called little us a call for me that I could not come up on me that much in this among the and the little ... about a lot of system golf I mean all those years it was ...\nTo do me much by starting with other federal that took almost ...\n... that shouldn't have gotten all still don't get me out of the kind of law at what kind of level of the people across the dinner with terrorism but it will know several of the Senate or governor to sort of goes under those are the parts of the editor of the girls all meticulous\nEither by going to learn to live on your [laughter]\nI was working with a guy like why why why do I [laughter] I was about when they went along with another ... years ago from Belgium by a peanut butter ... and ... just a young man in what way although I don't know [noise]\nWait a minute wait a minute just listen [noise]\n\n[laughter]\n[noise]\nBut I can say it's like I said was that one will be there with you but I found it on you and we'll begin to look at them in there you go [laughter] I don't know what I'm going to say if I wasn't on the phone with my mother was on a second term and that you're not doing within a minute those looking up those but I get away with it or make a buck I mean\nI see as as it can lead anybody I guess that'd be I'm Out see but yeah I'm a I'm a ... I don't know how am I joined I don't know if you have to think what they what you're not going to be ...\nAnd I thought that when they do and I don't I'm not going to think when they\nGo all the one that I might not something I've been in New York at all because I came to another because you're going to need as much in this\nDay and Daniel minor thing that they ... they have the\nWas a man I Can't deal with the lack of Madeleine L'Engle down by he lands on the line ... with\nBeen made I get back anytime damage or not not in that boy they might not in the\nI Wonder if that land and the insanity died that make what can I say when I look back at any time to get at the same way I look at it though and the daily now that don't\nThe medical and I don't I'm not going to they're going to end up going to do that too and I don't like going up things don't end up going to do it on ... on it than they get that going to young ... ... ... ... if they go about the\nNot going to be mad at them doing electro none really learn a global ballot he lands on the moon and legal legal Montgomery landlord and\nI Lived in that I could have not\nDownload joined on the one that he will not\nThere'd be like you'll end up going to hit that it is I mean what can I Do not get back at any time where they are they gonna do banned it do\nBut you know during the civil and the Internet and then it wasn't going to do a better that Kennedy died during that time with it and they look and a dog Bailey Bailey another daughter that thing\n\nThat and I thought he had enough bummer but at the numbers don't I'm not going to be going up on that when they do it\n\n\n[noise] [noise]\n\n\n\n\n\n\n\n\nOh there's\nOn that day\n[noise] [noise] [noise]\n...\nAnd\nNice\nThat that didn't marry the guy\n\n\n\n\n[noise]\n[noise]\nIn the early and\n\nAnd\n\n\nI\nThe young\nYou\n\n\n\n\n\nOkay [noise]\n[noise]\n\n\n[noise]\n[noise]\nYeah\n\nDo do do do do do do\nDo you do in the bed and then by the time you're around and\n[noise]\nBy the bond has been ...\nFor about ... about the man the ... and\nJosh did I Know what the data and do nothing\nBank the\nSee it on you know ...\n...\n\nShows\n...\nBack then and then this\nAnd she is\n\nStates has a suit\nDa di di di ... new\nIn the next member\nThe in the city\nYou know\nBut the way you're going\nTo talk about look really bad and dumb\nDown to see on\nMy way you called the shell and\nWe don't even know\nUp\nBack in just\nThem\nSaying\nRead them\n\nNo\n\n[laughter]\n\n\n\n\n\n\n\nGood morning Madison there's little ... bringing you another edition of Seoul sessions doing it like this where you each and every Saturday morning from eight to ... you know your co host duties with lady AOL ... do the down\nJust the way it ought to be\nYou know math and I know it's still kind of early 'cause we're near I'm sure you'll be in the bed but I Am here so you need to get up get you some of his good soul music\nEntertain you date entertain yourself get your work\nOr own your ... your free go\nWhatever it may be but believe me this is the best so music on the Planet Money ... Mississippi is so sessions\nBoom boom boom boom boom boom boom\nBoom\nBoom boom boom\nBoom boom boom boom boom boom boom boom boom boom\nBoom\n[noise]\n[noise] [noise]\nTo see\nCan come in\nAccused come back\n\n[laughter] [noise]\n[noise]\n[laughter]\n[noise]\nUm [noise] um [noise]\n\nAnd you can\nTurn on and on and on and [noise]\nTo you know\nDo they come in\n[noise]\n[noise] [noise] [laughter]\n\n[noise] [laughter] [noise] um [noise]\n[noise]\n[noise] [noise]\n[noise]\nYour students can be\nBaby and her\nAnd and\nYou can be\n[noise]\n[laughter] [noise] [laughter]\n\n[noise]\n[noise] [noise]\n\n\nPut on a\nGotcha shape\nWhile you're while ...\nJust the books\nThat's just a\nLot of John\nThat you know alone in the journal\n\n\nOh yeah Madison a lot of times I sit here and think to myself I I really\nShould consider maybe having a cold or something to that effect because let me tell you you're saying all was cut out to be because there is a lot of work to do you are definitely multitasking man you can join hands field real quick\nUm first of all I Would like to thank each and every one of you that\nShould look good\nOn a new way all the things you did that during the meeting\nOn [noise] on\nAnd on and oh what's your\nDue to basically do\nCampus there in Nineteen\nJune and ...\nTouch me then she launched me right now\nI can see the\nAnd it\nLike to start as soon\nGet home till you get older\nThey get mad when I Do tend to go on it on in\nDo to be here\nThen there's the there is\nYou ban than\nI used to have\nNo it's not\n\nLike\n[noise]\n\nOh Tony\nWomen have made in return be\nThe bad\nJust be nice [noise]\n\n[noise]\n[noise]\nThose big big\nDeal\nWhy do we if we had\nPeople\nIn the\nSeeing the national guard and we\nWant to know that may\nHave been buying [noise]\nYou know\nChicago\nAnd that\n[noise]\n[noise] [noise]\nThey\nHave you know that it\nWould\nNo then you're [noise]\nAnd they said\nWell dinosaurs\nI don't\nDown\nAre being\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\nWant to change that by\nIn\nGuy\nJeans and a\n\n\n\n...\nW O R she's nine contempt tournament is coming up fast it's on November sport extremely sponsored by Madison central\nW O R G D jays will be rocking lanes as opposed to the surprises you sleep skill level\nAll bowlers will receive a keeps they can hold in ... with the W. or too low to buy tickets to pick your prize raffles for tickets are available to them that the sisters perpetual window just after the event you were Fifteen hundred dollars in prize to give away\nHolding a strike with the ... front earns you a free beverage after bowling enjoy pizza ... while the scores are ... and the prices are do about ... thirty five dollar proceeds benefits W. or teach unity reading your\nPrint is allowed to form a W or to your friends on wars and then turn it in with the registration\nForms are also available here at the station one Eighteen so Bedford street and it looks like ... [noise]\nNew informed about ways to actively support your radio station this is W. or to eighty nine point nine of them Madison\nYou're listening to Seoul sessions with your whole ... you know like we play the best so music on the planet you can beg me later [noise]\n[noise]\nA link to remind them that they\nThat are in in in the\n\nFun to me\nIt does that mean memory I have\nBomb\nBomb\n\n\nSearch and things like you\nAlone you know\nAnd you\nTo do with it\nShow you the\nKid\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\nThey\n\n\n\n\n\nRight [noise]\n[noise]\nMy\nTeeth and you get down with my friends are from the right to feed the children\nOf the teams they didn't do it in the bank [noise]\nThe best you can [noise] double deep said now you may be nice to be named [noise] solve the object [laughter]\n[laughter] [noise]\nThey need to know your book he needs to be but [noise] where I\nAm a big bank [laughter] the way to beat the fact that we're going to change a lot of those who you're going to be able to be talking to Iran\n[noise]\nNeed that best [noise] to the question to me\nThe best thing to think\nAbout all the way but the man I'm going\nTo\nEat them and they need to be the the the the\nThe [noise] the guys\nAnd they don't want\nThem to be in this should be the main thing\nThat they need\nTo be [laughter]\n[laughter] [laughter] to be shipped feeds and don't know what to do a lot of fun to\nThem yet and the fact that she\nShould be should be able to talk\nBut [laughter] [laughter]\n[laughter]\n\n[noise]\nOh\nI\nThink some of them and she wants\n\nTo [laughter]\nTo compete in\nReading the battle of the things he\nHas to be a good\nThing for me to post on the team I don't\nTo be doing that\n... percent don't tell\nThe only holiday list like just those on the side of the size of the\nThings that\nThey did and they won't eat\nYou can't beat up on the [laughter] the shuttle gosh beep beep and I'm sure [laughter] [noise]\n[noise] [noise]\n[noise] we used to be to be passionate [noise]\nBe\nPerceived to be [noise]\nDot dot dot\nThe main [noise] [laughter] [noise]\n[noise]\n\n... ... ... your whole OJ\n\nThing\n\nPain\n\n\n\n[noise] oh\nPain\nThe way the bill\n\nWe\nCome in there's no\nWay I Want to\nThe\n\n\n\nWell well\nWell well\nWell\n[noise] [noise]\n\nYou were listening to W. O. R. G. eighty nine point nine yeah Sam Madison Wisconsin listeners but your community radio ... for entertainment\n[noise]\n\nI like to make sure that\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n\nMorning and welcome to entertainment turned jak Grenier\nThere'll be with you for the next two hours linguistic jazz swing and a bit of blue serum listener sponsor community radio W. O. R. G. E. D. nine point nine FM here in Madison, Wisconsin thanks ... for\nA wonderful dish and the soul sessions program you can tune in every Saturday here on W. or tea and eighty I'm\nRight on your radio dial\nWhen you're watching ... music today here and\nI'm very excited to introduce a set from the mosaic record company called the savory collection named after audio engineer bill ... and ... said we're going to hear lots of great recordings there he managed to accumulate over there\nMany years he worked as an audio engineer you know the big things in the tip of the hat to Ned for\nSupplying this wonderful music and ... me off to appreciate that very much so we'll hear music by Coleman Hawkins ... Fitzgerald fats Waller from ... collection also hear more music by ... in the first\nHour of the program and of course I'll bring you complete up to date information on jazz going on around tone in our number two in the music calendar so stay tuned in enjoy grab a cup of coffee sit back and relax\n\nWe'll begin to do with music from the sea recall election in the first day we'll hear music by Coleman Hawkins sits journal\n[noise]\n\nAnd then I'm younger than getting ... and then my mom made on ... and I and I know you look\nYou know the way I did a little ... and voted in the book and you must sucking on down the or the new rover but not the same thing to do it when the ... all around the wind cheap but\nIt does though round he loves it she well it's my little yeah little man and if she doesn't bring it back I think that that will that\n\n[laughter]\nOh\nNo it doesn't get one last night yeah a little bit\nAnd new year and they don't read during that don't know what else do\nThey\nGet in the\nLate ... right right right\nAnd we're\n\nNot going to be you\n\nKnow when\n\nYou're young you know my little bed\nOne held me by my bed and make me happy again na\nNa na na na na na na na na na na\nJust did that young\n\n\n\nA my heart in your name on\nIt for you to play\nThen then no\n... or ... or ...\nOf them are getting\nA key much too\nIn the long run you know when\nA key much\nSay\nMaybe I'm too weird to\nSay then\nMy wife\nI really know\nMuch\nMe\nUm\n\n\nPC live presents Paula Poundstone friday November second PM in the Capitol theater\nBecause we have no mandate chicken anybody with me at your door\n\nLittle blank Buckeye is helping you take a look at [noise]\nFollowed pounced on friday November second at eight PM in overture centers Capitol theater more into in tickets available online at overture dot on [noise] you are listening to W. O. R. T. eighty nine point nine FM listener sponsor community radio\nBegan today's edition of entertainment with the music from a mosaic release in ... the savory collection named after bill savory the audio engineer who\nFor many years a recorded in a variety settings and including um takes off both the telephone wires and over the air air checks as or colder air shots as they weren't going back in the day\nAnd we begin with Coleman Hawkins in the broadcast from New York City\nAnd may have Nineteen forty we heard a Manx extended version the body and soul\nAnd then we heard so much ... performed the vocal and basin street blues and then uh the instrumental lazy butterfly\nAnd then the wonderful Ella Fitzgerald recordings made in Nineteen thirty eight of ... and that written to cheer chick Webb who are from\nAlmost his entire life suffered from a variety of melodies into this one written to cheer him up and they actually became his biggest hit and then following that we heard save myself for you again most from\nThe savory collection on the mosaic labeling again a big thank you to Ned for passing that along and learning me to it appreciate that very much that\nYou are listening to entertain maternal W O R D and a nine point nine FM in Madison, Wisconsin listener sponsor community radio and John ... your host going up to new with classic jazz swing and a bit of blue serum listener sponsor community radio W ... her team will hear another set for him the savory collection\nThis tree music as well\n\n[noise] [laughter]\n[noise]\nBut anything ladies and gentlemen or are there and they were at the ... I Know I'm all about but I Do not want to be there to be out All right thanks hello Joan\n... at the ... the gate night way they are not the bike and ride around when another job clubs like in the best much longer than it was ... to talk it as well as black and white\nMan and just see\nOn the beans latch on hold my hand and I voted\nFor the very\nThings in the early ... to ... ... ...\n\n... vote for him to promote the damn\nIt may be you know traveling um I mean you can find himself and the man's name one channel then you're alone and hold your hand in hand\nIn hand the phone line is that so many occasions when you when being married to the to the mid ... treat you can't do it when they won that she said well I\nDa da da da da\nDa da da da da da\nDa da\nDa da da da da\nDa da da da da na ... yeah she must have been a few ... but you know that must have been cut down on the head of the second district\nYeah the weather but we don't find out about it and then All right it at night you rated yeah but just to make it a lot of time to take time out here to tell the friends that they're listening to this artistic collaboration up uh I like the kind of point that well that's not going to present it from the New York's clubs no less I Know yeah in New York City and all that\n\n[noise]\nDo they have better\nSo all day all of you know what do you do do do we feel that\nThey\nThey have to stay home [laughter] [laughter]\n[noise]\n[noise] [noise] [noise] [noise] [laughter]\n[noise]\n[noise]\n[noise] [noise] [noise] go to the phones to mount a phone call\nMy mother and father both both of them on the phone and baseball so by the day and then\nBy the news or in other folks in that photo\nFor the ball goes all through the whole other ball in the snow and you know I don't know if somebody\nYou knew you know not\nOnly do\nThey know\nThey didn't know that they knew that they really do all day\nIn in\nThe game is better than any other\nThan the men do better than we did when they\nHit\nThe smoking in a number\nTimes you know on the on the phone and then they can\nSend them back [noise] I I kind of right now [laughter] but now\n\nI'm not a pockets dream for the\nHer\nDo need to\n\n\n[noise]\nDown the road\n\n\nLike better\nThan a matter\nOf fact I remember when I\nWe're not going to go [noise]\n\n\n[noise] [noise] um [noise]\nBoat load and don't look back on\nAnd they\n\nMen and women members [noise]\n[noise]\n\n\nAnd found\nOut that you can't\nMaintain that he needed the damage and you made it easy to do that you needed to do\nIt in\n\n\nOn and bundled up in a band that you may blow off and on and\nGoing on and better than in many many\nThings to me the whole middle and then all of that so they\nNews [noise] [noise]\n[noise] [noise]\n[noise] believe you if you do you do the [noise]\n\nDa da da da da\nDa da da da da da da da da da da da da da da da da da da da da\nNa na na da da da da da\nDa\n\nNa na na\nNa na\nNa na\nNa na\n\nNa na huh\nNo no no no no no\nNo no [noise]\n\n\n\nWas all my love when you're on the line that is a lot of bad a long long time when the audience that mine and then\nA ... day that's the way and the ... vote in a long long long way you know somebody that in a\nLong time ago\nMm\n[noise]\n\n[noise] [noise] [noise] [laughter]\n\n[noise]\n\n\nNo no no\n\nNo no no no no no no no\n\nNo no no no no no no no no no no no [noise]\n\n[noise]\n\n\n[noise]\nUh\n\n[noise]\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n\n[noise] Mm Mm Mm Mm\n\nThe mom my non ...\nOh you know\nHow long the money then you know\nNow I'm In love with young young boy I didn't\nKnow how long my no on the\nHill man man that was then known a little rain man did on the hill will know when you're in love\nFor one and then not not so no no\nYou know he\n\n\n[noise] [noise]\n[noise] [noise] [noise]\n[noise]\n\nYou know the last three\n\nYeah well they said no no\nNo you're right but you\nKnow you can't grow you you're not living in\nThe lab and then\nThey let me you'll do a little bit you know\nDa da da da da da da da da da da da da da da da da da\nDa\nDa da da da\nDa da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nDa da de\n... and\n... then then then then then then then then the movement with you\n\nHa\nHa ha ha ha ha ha ha ha ha ha ha ha ha\nAnd then they didn't\nGrow up on that I had somebody coming in my body on the day goes by a man go down\nTo go out to me that I like cats Donna out I wanted to write all night and that goes down then\n\nYou can relate to do a little shaky blown hot basketball arena called let's go\nDo this we're\n\nGoing\nTo do\n\nMhm long [noise] the little tiny pools [noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\nWell\nThey didn't do\n\nFor\n\n[noise]\n\nThe wood and will\nIn jail\nOf the to lock\nWhen the ...\nOh\nThe brutal\nWhat the ring of law do\nNo\n\n\nUm di\nDi di di di\nDi di di di\n\n\n... to the\nEnd of entertainment today we heard and that's it that will you be good\nIn rushing it after that the appropriately swinging the blues\nA little bit of blue in the middle underneath us right now they could get for listening to entertainment I drink or any of your host she'll be back next Saturday with more classic jazz swing\nIt's a blues zero listener sponsor community radio W O R G eighty nine point nine of them in medicine listener sponsor community radio\nDo for Trump Gordon's coming up right after this announcement\n\nWisconsin union directory and the greater\nMadison jazz consortium present the conclusion of the twenty Eighteen and did you use jazz theories with medicine music scene heavyweights immigrate on friday evening November second at the place circle\nTrue to their ... genre immigrate trades and dynamic cruise and unrelenting Bali rhythms comprised of ten local musicians immigrate delivers a worldly jazz rock sound was swirling repetitive guitar pattern the funky\nBaselines and the series progression section for horns and piano immigrate played the final installment of an indigenous yes series to memorial union place or gold on friday evening November second at seven thirty\nYou are listening to W. O. R. T. eighty nine point nine FM and there'll be orange T ... dot org [noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\nOkay [noise]\n\n[noise]\nTo another edition of the troubled rhythms one that we are now and what not\nTo Madison, Wisconsin which responds to the radio station ... Jay and I'm sitting at the ... ... ... who will return to\nThat's very special show him\nCan join joined us from the get go on and\nSo he will join us next week so you had any question about radio music lives enough that she or not to know and then she's gone so negative ... some of those questions you can see the course we have to see them early coming into town ... even though I\nDo my ... year the next day and we have a peer review which will do later ran for the next couple of hours for a little bit of gave me\n[noise]\n\n\n\n\nI'm a I'm a\nDa da da da da\nDa da\n\nDa\n\n\n\n\nThey started\nWith the ... trip to borrow\nMoney he drank the jungle is only so\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n...\nW O R teams nine teams have tournament is coming up fast it's on November fourth extremely sponsored by Madison central W O R G D jays will be rocking lanes as opposed to the surprises you flew skill level\nAll bowlers will receive a keepsake Hanna told ... with the W. or too low dull and buy tickets to the pick your prize rebel force tickets are available to them at the sister perpetual Wendell just after the event you got to work Fifteen hundred dollars a frightening to give away\nHolding a strike with the red hidden from earns you a free beverage after bowling enjoy pizza ... while the scores are terribly send the prices are do about\n... thirty five dollar it's the whole procedure benefits W. or to interview radio Britain fill out the form it's W. or do you have friends I was and then turn it into the ... ... ... ...\n... ... ... ... ... ... ... ... ... ... ... ... [laughter] [laughter] [laughter] [laughter] I I Am\nMade them re I have a whole when my my\nAnd curse words across the pile that little dog like getting less water balloons and direct around my home [laughter] a little different spoken word artist Nathan\nBe a robbery and even though\nYour\n[noise]\n\nAnd then my boys [noise]\nGod is a free account for my failures on section that appears wanted various artists from the university which do you make it into a\nUniversity or to do with\nI mentioned at the top of the hour we start things off with a jumble\nHe might be dragged me\nA few years on the compilation CDs that selling to undergrad patrol record label [noise]\nFrom there we went through the twinkle brothers\nDuring that appears on the glimmer of hope CD [noise] or the public this or that appears on the triple ... records [noise]\n[noise] [noise] from there we went to which Stevens in the sky nation band out of Italy and the two men's title the no ... years old\nAnd that appears on the most recent release on the roof use it later\nWe pal records [noise]\n\nFinish things off with\nLittle bit of trouble excuse me a little bit of sorry what is going to be on his route to got ... ... ... records and you're listening to talk of the women's her every Saturday from twelve to ... W already\nYou know when a\nMedicine\n\n\n[noise]\n\n\nMean\nThis bird\nRemember\nToo\n\nIdeas\nLet me let you go to the\nKnow\nShown where\nSmoking\n\nIs really\nA\nOn on ... on on this phone you use do you do you root for them you\n[noise]\n... like a\nBad shot by a\n[noise] um\nMy camera related to what would your balls are young\n[noise] [noise]\nYeah bloody Mandy\nA bomb a\nBall like a ... I I Know\n[laughter]\n[noise]\n\nOh\n[noise]\n[noise]\n\nAh\n[noise]\n[noise]\nJoined W O R teeth for the day of the dead brewery bike to work on Sunday October twenty eight [noise] sponsored by park ego captain Ellis Island through an carbon for riders will begin at the\n... eleven and then proceed each brewery\nSampling two glasses and locally produced craft beer each dollar tickets are Fifteen dollars and can be purchased it Egypt for brewing all proceeds will benefit W. O. R. T. base is limited to grab your ticket it perched eagle Ellis Island old Bruce or carbon for costumes are encouraged but not required\nBringing you lively undead Halloween season jak earlier it is is is W O R T H forty niner fan Madison\n[noise] not that many\nR. T. thinks this listener sponsors an IRS painting a family owned and operated company since Nineteen eighty providing commercial and residential drywall and painting services examples of new projects and more information are available at a Y. R. E. S. painting dot com or by calling six to eight eight three one seven four three\n[noise]\n\nIn\n\nYou know should we should do\nRoad our job is to be\n... da da\n\nDi di di di di ... and ... [noise] [noise]\n\n[noise] [noise] [noise]\n\n\nAnd Joe\nIs\nGone\nAnd the guy\nGo to betray the mom and will be will be die young or just the your sketch bomb right yeah well we don't judge\nJust being not your sketch burn wow yeah I ... like George jumped love where young not have ... states\nThe bombing and I don't I don't know how to save money by\n[noise] [noise] [noise] [noise]\nRight so you know got a big shock and you don't mind do you do that you don't mind doing not did not do that you know we're going\nTo be di di di di ... jumping not your sketch bombings by ya de ya de ya\nDe ya just just looks sketchy bombings by yeah I Do wish I lived up to like help is jumping off when they're young\nAnd I can't give you a bad thing bombing my God\nI got a young but they must by\nThe\nMature I still don't know the growing and that sure I don't mind you know and then that's your mommy and dream the job that you\nMind doing that yeah the whole\nThe young for pi de ya jump jump the notes here just stretch bombings by\n\n... di di di\n... [noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise]\nAnd you're listening to jump over them on the W. R. T. eighty nine point nine s in Madison, Wisconsin listeners sponsored solid years our community radio and we started that last set of music all\nWith the younger you performed by a or\nNot buy for dairy makes the version that appears on my Molly and the weather's roots rock we may need my little boy's man that inheritance\nPerforming attuned catch on fire\nAnd that appears on all the scratch and Perry will be the various audio CD titled baffling smoke signals the upset or shot volume three [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise] [noise]\nThat's your mind not seeing the job you're doing this [laughter]\n\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise]\n\n\nWell\nKind of thrown\nAnd I\nI'm not that\nI'm not\n\nI'm not that good\nI was\n\nDay when\nMuch about that\n\nI'm\n\nI'm not that day\nAnd then\nThey don't do\n[noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\nI'm not\nI'm not\nI'm not\n\nGoing to be back\nI'm not\nCome and go oh my God\n\nDon't\n\nKnow\n\nHow much\n\n\nI'm not saying oh my God\nOh\n\n\n\n\n\n\n[noise] [noise]\nHi I'm Susan the W. O. R. G. staff member responsible for organizing our pledge drive with the help of hundreds of amazing volunteers and dedicated stuff or recently completed fault pledge drive ran like he's saying bowl the famous making sprinter\nThank you to every one of you who gave your time and energy to make our fault Dr successful there wasn't a or a festive positive energy around the station during the dry but then that was all you because of your generosity we exceeded our goal and came very close to our strategic\n\n[noise]\n[laughter]\n\n\nWatch rather may ... will\nWell yo yo everyday Donald you while another guy you know and\nAnd I bought that voting a guy you know\nBe known it might be going to use the\nYo yo yo yo yo yo ma don't make no bones dollars going a little bit about that when you go and do\nYou ... ... ... you\nMe you'll belch out on the\nNew York I really don't need\nBe no really all day long with the guns or you'll get a little while yeah we don't know I don't\nAnd blah and now every day and not Donald ...\nLevi these Soldiers Die in my little\nBrother mess he usually by the ... by the dollar\nYou know by not ready to go to China doll and don't I don't know how you know by not maybe go to China doll when I really don't know why that would be shocked\nCannot I wrote the w._b. goes [laughter]\n[laughter] and do it by now they're going to\nSound young I don't know how how\nSee you again and again and\nThey told you showed I might do you live on your show by the gold medal ...\nW ... by the time will tell your daily by\nSome\nYou just talk and if they\nDid not be you know the guy\nAllow to live\nLove the opinions\nI I just saw a little town of it\nBy being a guy you know\nYou're listening to a tropical storm your love for her and that is in Wisconsin and if you didn't know even more early from up here to visit\nNext Saturday or evening which Steven Martin the show's going to be at the Barrymore Theatre getting in\nThe work starts at eight o'clock through doors are open\nYou normally open about an hour before\nA miracle to America will be in the lobby for real meal view we right now are going to give appeared tickets way to the first caller\nFor next week's show next Saturday Stephen ...\nAt the Barrymore Theatre\nOn at would have been\nYou\nKnow try to do [noise] [noise] no no\nNo\nA little bit\nA new study out\nPlan do you live longer than I think I I mean as you get a job with money and get a job and I think you're going\nTo be stopped\nMe do many new\nTo the mother said no no no\nNo most\nOf the lead me to\nMy house you know Martin with God I missed\nYou don't need you know [noise] money it will be going in and\n\nSaying All right and\nThen we do have a chicken winner to the Steven morally a show at the bad mortgages next Saturday and so the special thanks to or shot out to Alan for picking up with the Arabs tickets to see their next Saturday\nAnd we invite you to visit the tropical rhythm space ... beach in order to have another chance went up here to get the tropical rhythms Facebook right All right\nI mean you know the names yeah [laughter] yeah do\nYou know dogs over I mean you\nDon't shut your ... your big money under the I'll be I'll be the rule you don't\n\n\nThe ... so now\nTo give you another day\nWhy they're for the topic\nWhile you know where's your doctor wine to ... to do with your doctor one\nBrand new ... guide to the doctor and she did not reach while you're here the doctor and she did not really she got if I don't watch the ... if I was ... you get your vital she knew George ...\nJust sat down for you\nJohn good feel for you to read them but I'm just said you're not talking about some of the religion\nAnd we started your last set a musical with two formed by the sugar I'm not ashamed to see\nThat old remembering jokes to lead singer of culture that appears on the penthouse records label from there we went to chronic\nAttuned title\nCountry boy that appears on the chronology\nShe was Nineteen or is that just gives me twenty two last year\nWe went to the u._k. for the man Pablo got God excuse me before you turn the fever from the CD titled or hard times and then we went to the gun shot in the rhythm\nThey're then they're they're oriented and now they are married I Will not know sliding all day that will not not like a problem in our land those leg bone marrow dog\nYou like me and I was on the on\nThe long term they end up going to be ... by ... they didn't do it in the gym or they need to do one or let me bombing age and then you're in the minute by minute on the stand and then all\nAre taking your parents who are running around there is some\nThem they're their own them again but we are and I'm\nOn their own and then one day be\nBe applied later they're renting operating and they didn't want them to be a good day now and not not like they're all day long I mean now ... like certain and then the next day or maybe not ... not life\nNow we started on a rich mommy liberal then um then they gave him are still not worrying\nAbout them they didn't they didn't and I'm not whether or not we're not fighters teach them from can they didn't run in Ramadan is around in from the east and then from there all day long now and then also like\nGetting him in and out there now and not enough to like him and then okay well I mean not not not like\nFrom not only bin Laden\n... they're they're they're\n... or to allow\nThem they don't get that job for the buck and all that they might have been able\nTo them you're going to the gym ... been a while you just you\n\nThese are actors\nBut that is that\nLife I had to set up by the sun\nDown and talk lots to show them that you're not by a car you know what what what is not a peep from some of the great things about them by now because they know why are they on hold\nMay not be strong will not get the way you want to do stuff you know people that I'm Around crowd was great things about us by a man for you to be gone\nHave like the Sunday Times that I\nThat they are now now there are now I mean you have things in the East China prior to watch that show why that fought and died\nWrote great while it's got this cat then I\nMight be to be put away their mouth shut up by the wind you while you're paying a magic by by the people you know watch as a dad who I go to a bright but not too strong but you're not buying up on TALK get where you're going to do was not a peep whether that bundle\nMinutes every day but yet there by now they're saying why do you have something in your life sons outside guys I Try to address where ... biology and bumping up now I'm In a lot\nIt meant that because there was three times by new I ...\nDry and a rise up a good ride you know I've done a diamond up or down in\nUm gr eyes up and rise up to arrive at a time when I was dying\nAt a time to hide and no one could rise a rise up their minds you know I'm just I'm a diamond up and then a dry and could rise up and rising up and signed up and down and then they've got to know\nWhat\nA lot of our brain damaged by it and I got a new show and one guy on average and uh I I don't know I\nI I did read now I didn't know about that on Wall street is a problem is long gone government up and I'm\nI I Am three and my my day out of idea why we're seeing my arms trying to find out about embalming\nLegs are grown now but I think she\nWas anti all went down on them and then\nDrive the only guy which I appreciate dollar giants all went down we do not know bah\nGreat job on a bite out by a guy that\nThat we're in a\nW. O. R. T. W. O. R. T. thanks it's listeners sponsors and the wind and how shocked Madison's local source for home brew in wine making supplies\nThe wine and hop shop is open seven days a week at Nineteen Nineteen in the street and has an east side pick up location for online orders at working draft beer company located at eleven twenty nine east ... street more information available at wind and hop dot com\nOr\nIf you live presents an evening with government meal Thursday\nNovember first seven PM episode burner right from the Allman brothers band in Nineteen Ninety four guitars sworn in an original bases Ellen woody warm government knew drummer met out who he played with in the ... ban\nSteeped in the roots in the rock blues soul in jazz government news recognize words during songwriting and storytelling as it is for the improvisational virtual city that fuels their ...\nForm of the evening with government knew there was a rumor bird yeah [laughter] [noise] [noise] your ... your ... and like all that I failed Porter radio [laughter] [noise]\n[noise] [noise] [noise]\n[noise]\n\n\nOn and on and on and you can get on it\nYou can find it there you can do about it and it should be able to get your body needs a job lined up the body can be bad for you or me dirty body can be a die hard fan\nEither by the T shirt you buy a lot of my friends they genetically and dirty money they can be used by\nOn and on it and you find it can be monitored you can depend\nOn it and they get out and bought it like you don't you're going to use the bull by the ... do you do it because he wanted me to go to Jackie Chan games are nasty\nAnd dirty by eight or nine and a lot more than ... began by Jane gays or ...\nOr ... ... ... cake and eat eat and over and over in ... you need [laughter]\n\n[laughter]\n[laughter] [laughter] no\n[laughter] I'm\nYou can you can be good for your body can be a body can be ... ... if you'd be ... by\nBad [laughter] no no no we don't live on the Monday bother the girls are\nNo matter what the National Guard but on the day after the ten minute there will be will be buying them down\nTo Bob Bob dug another another ... cues the body to turn\nOn and on and on and you can log on and on and you can find it on [laughter]\n[laughter]\n[noise] [laughter] [laughter]\nI\nWas on and on and find it and I don't really mind if they can depend on it and the\nOf reggae music don't\nAll you need to do is go to Google\nAnd they've been ... David cats and you will be sure to tune in next Saturday\nFor that program again\nThan a blast playing music for you today enjoy your Halloween like they're going to stay inside and voice your own knock on doors for\nCandy or anything [noise] till next week\nAnd respects [noise]\n[laughter] [noise]\n[laughter]\n[noise]\n\n\n\n\n\n[laughter]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n\n\n\n[noise] discovered\nAn architectural ... when we know about the officers\n\nThe record this and so she was\nA lot of\nThe name of\nThe color of\nEducation\nThe\nHistory that does\nIs written shows not ready\nShips that is done\nAll right that you you know you\nA ...\nOr yeah or yes welcome welcome to another edition of Africa show on a double R. T. FM\nIn Madison, Wisconsin and of course the yeah my name is hot and dry I'm here today or to bring you two hours of\nMusic across Africa and the diaspora and of course of a a ticking you all across the um um the the the the African continent but also a you know to some of the the the\nMusic out of the ... so the last time I would see on the show we followed news the car that uh uh go along the reverse of ... and are\nWe going to need that music and I think the last time we did stop in muddy and then be continued on to order on trees and so I'm going to explore that team\n... teamed up going to take ... across the uh many African countries that's where a lot so uh in the diaspora so welcome to listeners who are listening to Africa issue either here in Madison, Wisconsin\nOn eight to nine point nine FM here uh on they'll go out to eat and then when nine FM offer tools to at least ... outside of ... and uh around the world I see people listening\nOut in a West Africa in ... and all the way out in Europe and elsewhere\nIn a area around Asia which is probably later this time or all in the morning there of course I'm GOOD Music ... uh and uh I also see I'm peaked in about a ah the news before getting India\nAnd uh you know my heart goes out to the ... to the folks in uh in Pittsburgh a synagogue doubts the shooting they are just stood there so I'm you know prayers for all the victims and a and a hope um we can get something on this a gun issue and uh\nAnd of course uh you know from everything I've seen we are we are having an identity crisis in America and we need to really walk on on on finding a way out of this uh issue in America in terms of a\n... a political identity or whatever it is issue around uh uh our sexuality ... issue around race where they just issues around a you know a income despotic Tuesday so much more issues to think about\nAnd ah and issues around homelessness is just about a traffic in so many tens or America is definitely\nYou know more than anything else more than political tribes we are in an identity crisis and we all have to reflect on this and see how best we can\nCreate a better America\nEnough cause us getting back to the music here and uh you just had a different ... and uh we are going to go straight out to the music to Mali ... and uh this is I'm\nI'm One of the greatest uh compose an ad in just out of Africa his name is a check to join a sick and ah he's a great man and then here he teamed up with the American jobs or a ... is a hunk Iran and this song is called\nUm I ... I just like uh the horn here and the combination of stuff that comes out of it\nNew\n\n\n\n\nSorry\nAnd play the\nThose boos de de de de de de\nThan either that or maybe she\nDa da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da\nDa da de da de\nDa de da de da de ... in\n... oh da da da da da da da da da da da da da\nDa da da da da da da\nDa da da da da da da da da da da da da da da da\nAnd then when he and I know I Need the money money money\nThe\n\n\n\nLady\n\nOr I stayed in Mali again with\nThe golden boy soap operas or indeed we'd all will so long ago did you knew to be we know about it so I got inspired into a lot of African music I'm sure that I met you know when I was very young and the allowed me to be on his lap\nWhen I was when he was just started a yeah just blown up yet since then he's going to need to be in these great ideas that continues to be a great music and stuff with great you know needs to be rich and this is going on where you are right\nMoment on Mondays\nYou know and\nThen you go you know\nThen your mobile you we're\nBeing you know what do you\nBum or not we are joined by anyone needs will be a boon to measure the burden on them and then let me do the big idea you know a\nHundred young young may not\nMay not be a mother or a little money I mean\nBig idea going\nDo you mean\nIdea of burned\nAnd I'm In\nBy I be without\nBeat up on the military on whether or\nBeat up on you or did they were\nHighly then they'll get a dollar bill in\nThe beat up on that that even when I Know I\nHow many delegates but you'll\nBe going on when and\nHow do you mean they they're not going on\nMorning that I did have on well our\nLittle money I Know\nNa na na na na\nNa\nNa na\nTo beat up on each other you\nRead a bunny business you know I Know and\nMaybe even a demo does\nThat when he was\nThe market but\nWhen he\nMade up when he did he runs around I was\nGoing on in\nBy not limits on my bed Miriam Makeba so I see that by getting my no one notices things evening Don McCabe I got ... by my kitchen and stuff like that and I but I don't know like Lisa but she gave me for the deal with that\nNow going on is that they should know and not just a fantastic oh ... song by ... in the same but the\nHip and then a lot ... than it did not know\nAnd so yes and socially it takes you all to South Africa where we are we the legendary mama Africa\nMedium or ... or she is a former lead known across the world one of the great African\nWomen it fights off with social justice in front of African isn't yet maybe I'm a ... ... ... it's not the peak song what the name I don't\nKnow a nine nine years [noise]\n[noise] [noise] [noise] [noise]\nOh [noise] oh man [noise] oh\n[noise] oh [noise]\n\nOh yes and that was a listener driving through Madison jokes called me and accidentally tuned into double out to eat a nine point nine FM and was just about to see this is a great selection of\nMusic are coming out of a a modest seemed so uh yes this is what we do here on WIP eighty nine point nine ... FM in Madison\nEvery subtleties you can hear music or from Africa and from uh the diaspora so uh we were there in South Africa and I've called me or try to stay in South Africa\nOr you know a little beat a day a week or\nTwo days a lot of uh you know I'm you know a great artist uh from uh South Africa we we were actually um I don't go on it it'll be ten people made yeah to to the great guys ah\n\nThe\n\nIn the plane is about more here with our ...\nMuch younger than you might have been quite know\nAnd actually reading a book on them to\nCome by so many you break the cycle so many so many great drawings really promoted in their culture is such a beautiful day\nThe big\nI mean any non gun owners who knows 'cause you're not as long\nAs well\nBut we\nDon't go down on his own boss oh\n\nAnd\nAnd\nAnd\n\nDa da da da da da\n\n\n\nWell it\n\nWas up some of them but they're also for Zimbabwe or in a salt on Africa\nOf because uh we own news in Bob we're from by the big man Robert Mugabe who is no longer there but uh you know a bubbly continues to\nGo on to a lot of economic crisis in Zimbabwe up next we'll move on to a zombie ... of cause uh you know um news I was in Africa and the big news in Africa was that ah somebody I was actually\nEffectively the force Chinese called on the Africa\nThen of course it's now known as ... or something like that\nNow because you know the you know ... of course are sticking so much debt for out of China and or\nThe Chinese effectively taking nobody apart into the airport and what about you know even the police chief is Chinese I guess I had so I you know these are all stuff we hear in Africa about looks like a zombie I is truly on the Chinese influence heavy Chinese evening but again all of Africa now is under heavy Chinese infant so\nI hear some music out of a zombie up in this group is called ... brought us it's sort of her ... you know you know of course you know African music is ... has that sort of spiritual competition and and and you know the nice thing I like about African music sometimes\nCan have like this sort of really like spiritual feeling you have to prove it means like hey you know after you have to sweat you know God you know exercise you know and and then and all that stuff you know God wants or that happiness or yeah All right so yeah it's\nA a bottom line from our booth I brought us out of a zombie I and of course you didn't hear it from me but it's probably not on U.S China exam or something China's on but no that's not from\nYeah from the ... or ... or a\nBoom\nBoom boom when they do\nThey do they think it was a miserable\nAnd they showed up to the gumption to let them talk many many of them deal with in some might not be good too and I didn't know by doing this to do is to fight to keep talking one you can listen to some ... and ... my name is John I'm going to do we've been in order to track\nWhere they're being manipulated a brand new but the\nWe did was I\nThere's no way\nAnd then one day one day I was about a moment and then\nNow to Paris\nAnd other great and go to Carlos Carlos ... Martin rockets go wound up ... yet I told you that will be remembered music on\nMy hands and you don't have a lot of money\nThey stop on the on the very gun you learn a lot of my my\nBeliefs\nAbout not going to stop them from a\nYoung man and that and then\nLike I was on a bomb that was about a\nYear and\nThe money I mean from I live on on the bad guy or they're not going to do it on my mom or\nDad you know [noise] they knew\nThat when they start up novels I\nDon't know that no one will ever learned from a\nNamed bump up now but\nThey're not going to\nGo down to build up your progress by a little\nUh one that was going to be a while I'm walking down a\nLot\n[noise] one little one little girl and that is a [laughter] while I'm On the on line\nWalk them and\nThe little\nWhite girl who was going on down the road [laughter]\n\n[noise] [noise]\n\n\nDo you\nShe was good and when\nYou've got a little while but you know my mother\nOh yes and this is still keeping it in and go law which I Know that Carlos ... from a Angola Angola has such a\nMan a huge number by him but you know great odds you could actually I've been playing music upon goal I'd just like so many great\nIndustries are all based on them back to some ... and a lot more a great cause of the country now and go and how important was all about ... ah you know quote unquote ... zombie I bought up many countries so many friends is depending on the on\nThe rejoined the are coming from the search engine beautiful music yeah and if you're just joining in tune in and I just it's a pan African\nRadio show on double or up to eight to nine point nine FM in Madison, Wisconsin with myself\nWhy he or hygiene jai and we do this every touch with these from two pm to ... am in of course we bring your music from Africa and the ... we call this show and I picked on music genome\nYou by not because music you know um where did the more traditional musical Africa intersects with some of the more done as part of the country so we bought a progressive discussions continue listening here color will receive up next week when I had to keep a couple of that the in West Africa\nUnder one of my one of my\n[noise]\n...\n\n... we now in a couple of ... and a a sort of put up from the ... end up goes uh this is Laura or see how the princess because we know a you know I'm you know we know who the a pretty good the queen is well she's probably between that\nAnd a couple of ambient music\nUm ... she was just the more the about two years ago she she had a baby\n... now she's back with their new album is just one of a older a truck from a previous solve all these people will not know when I started to Don's in music all the ...\nThe lead up but the\nSpeed ... Li Na ve here the ... and beat up on the beat up for the movie yeah put that\nTo me but I don't\nMean to you know put down by the by the\nBe\nThe total number [noise] good\nOr something you got a\n\nGuy who will not\n\n\nProven\n\nTo be\nAnd the\nBig bang bang bang\n\n\n\nBang\nBoom boom Ming Li na da da da da da da na na na\nVe to be a beating the yeah\nWe did a good movie the na ve to the moon and\nWe don't go to the beach but they'll be able to tell\nMe the men do long by the time we can model na\nNa na na na da di da\nDa da da da looped costs for her new album um ducks rugby I'd be ... will prevail problem I I you know she's such an amazing ... it's just been hearing modest and maybe\nTo try and you know all bonded by plane to go to the water by you know what to do so great it's great to be three and a couple of weeks\nIn the ... ... ... ... like I'll give you a Tea Party and I try to I mean and you know just like the body's got some ... you know he's already music in just under ... music on\n\n[laughter]\n[laughter]\n\nWish I love\nConcerned\nI'm saying is the same\nThat you\nIt doesn't do that though\nThan happy so intense that\nMore to\nIt I Know they're still in high school and are they is it like the guy the guy is going to let it go that they would have liked to go on there you know there's a lot of what it is going\n\nTo be very happy\nThat they will give you they\n\n\n\nYeah I just want them the best known it too\n\nFour years than that but you you get the trip and music yeah by the way out of ... and so we see any stop because there will be a transition to gain a to other countries so now we go on to\nTons on the up and of course you know tens and yeah it's one of my favorite writes a country's just because of a a pop pop junior yet at the legend did teach I didn't want to be more of a of a of Africa he dead guns and yet to independence and what's wrong with an intellectual all with the teacher\nAll with the man who wanted to uh to understand more about African Sufi an African democracy in African we or why oh why oh go running and and think about um you know how Africa I can reinvent a democracy\nIn in in in in computer lives on the African should show Kwon takes and so ah do you look at age ... with an amazing guy should read more and you look at it and of course the uh in in in what you look at I look in power was that when you had the ... union all those guys who\nFormed the core of African liberate to liberate those\nAnd so one of the things that uh he wanted to and you know it to be able to attend to you know ... some music and one of those ideas are back then who was a very a popular was ... and ... it's called ... a from a lot of calls\nAt times then yeah and a hobby struck but you and then we'll move on to more music oh don't fall or Africa\n[noise] because\nI have a lot of friends and a lot of people following a blight body my thought is listening out of\n... all the way out of them in a cause I've been to all the all the women in Minneapolis ... from ah [noise] ...\n[noise]\nYou know I I don't know how do you know\nPeople you know\nThe\nWay I don't know when I find I find that\nWhen they die\nI mean\n[noise]\n\n\nYou\nKnow I don't know how I mean I don't want them to know what did I Know\n[noise]\n[noise] [noise]\n[noise]\nWhy they can't get Bob on\nThe TV and that's\nWhy they\nDay\nWe're both saying that said that they now\nKnow that they [noise] they're pretty yeah they I mean why would they\n\nI have one of the last minute to go down to watch the news today I mean I'm not\nGoing to go to money or a city kids about the it's a very very good at the core of the the the phone up to money and they both political up and up because uh uh uh because uh what it is a\nVery popular in Senegal that one of the most popular young guy and they got a ... I Know these guys both of these guys and really good at it and of course in guinea all today's a country of course we also go to this is on the king of\n... will eat them but we are and of course yeah detract from my job a quarter from these rockets a ... it's called\nAnd that is a bomb in English but the ... branches\nAnd me and so I can jog caught on what is happening to these guys are taking the music in traditional actually and then I didn't lay out a little more Donnie ... see him into the wrong African nations\nDon't share golfing don't feel\nI don't know I had been in one of them do that because I've been there and you know not\nBeen there done that I wasn't you\nThe Gulf shoot a man the gulfstream man Godfrey may go through the man who really think that\nThat got that most young men because the monkey mind when they do well they do they how about a\n\n[noise]\nThere's not going to be a\nCommenting on the ...\nGulf Stream may cost you mayor Gulf Stream\nGo through\nThe north Korean man Godfrey\n\n\nThey sort of a collaboration between a union group running as a and a and they go to the ... ... [noise]\nEven talk on the train you\nBring me\nWill tell you my by now many many years when that is not going to be paying them I mean the guy Saddam and bang bang a game or a\nHappened a guy named\nThe same thing in my mind numbing any many as I did when I did not follow lane that'd be banging on them I don't I'm not a good thing or\nAnd you're\nGoing\nBe in shape and\n[noise]\n\n[noise]\n\n[noise]\n\nBut yes we continue our movements or you know I crossed off ... and so we are headed now I'm from Senegal guinea\nWe head down to the destination Ghana Ghana just opened up very nice new airports in Guyana and it seems like they are making a\nYou know a lot of progress in the right direction in Ghana in some moving along getting gun athletes and ah although there are still a lot of\nChallenges that feeds the country's so but ah here is one of the athletes who has to be common name recognition not cross again that he uh he's been consistent over the last couple of years you use that keep up to the dogs right he beats out the rhymes very very fast but\nHe's a he's also a one of the things I like about\nHim he's a grounded in the gun in a language and so you normally dog all this stuff in it again in a language and so he's a he's a new not caught in a very popular across Africa and distracted called in Cuba or Saudi around town Saudi charting paint\nThat's already been cut off each other on talking\nAbout a lot of lot of money you\nKnow the other one\nClub or do they go abroad and you were saying but [noise] my blah blah blah blah blah blah blah\nBlah blah blah\nBlah blah\nBlah blah but he learned from\nMaybe a bakery and not getting to the tactics or they'd be like the ... type nobody complains about me because I've been trying to get your point you're not going to need to think that you got\nTo do with the not the kind of ... he's a good guy coming back to the apartment and you'll be All right yeah what do you still supported that means to be job before what shape because that you know from\nThe look of private schools should be given the fact that they get you needed all the numbers demeans independence or\nGoing on but\nYeah when you talk to your mom yeah not not talk about you if I can be people walking up to what you can go to the testimony\nThat we're not thinking of what type what country would come up with an idea what it will I didn't know the money will be kind of pet would they be doing it didn't it I find that you mention that you're going to go\nNumber one\n[noise]\n[noise]\n[noise]\n\nNo no color they may not do you um I'm tired of them are young mom does not believe on my Mother's Day I don't\nWant to do some nah nah nah they made the right now I'm not a lot of people do your mother in law I'm not ready to do with my mom\nMy day to make them a lot of what they did find that if they do\nA lot about ...\nI mean maybe we need to go all the\nThe\nMan man a man jumping on them they might not think comedy can be very different in men and then my\nMom to become a way to say the man I\nTell my mom to them they may they may come on and they made the same damn it\nMight not be my best friend in a study by a\nYoung mom I'm One of them they made up and down and\n[noise]\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\nIt is worth ... you're listening to W. or T H I Know for a lot\n[noise]\nNot be something that you know if you don't have one of the interesting thing going and they know how you say oh man so there'll be no ... no ... at the gate agents Memorial Day\nMy daughter in\nOr your your normal maybe it\nBoom\nGet there and then they do what we do that day and it was okay yeah I'm\nJust so we do\n\nJungle\nGirl going\nBy the way we\nDown on\nWe don't have the hill man you know people that have been a new la la la la La Guardia is the main goal when I was going for and they no no no ... it's ...\nDay and age they own but really you know\nWe're\n\n\nNeeded to link is\nNot my goal my\nGoal but I Do not go next may be about\n\nMe in the big European\nBanks by\nThe Muslim men da da da\nDa da da da da da da da da da da da da da da\nLa da dum la da\nDum la da dum la da da da da da da\nDa da da da da da da da da da da da da da da da da\nDa da da da da da\nDa da da da\nDa da da da\nDa\nDa da da da da\nDa da da da da da da da da da da\nDa\nDa da da da da da\nDa da da da da\nDa da da da da da\nDa da da da da da da\nDa da\nAnd then DJ ... comes on a plane from nine thirty nine forty five\nAnd then ... starts at nine forty five ... and then uh I guess ... or ... south so they'll mad starts at eleven forty five\nUntil one and then a DJ rumor comes on until closing time so you don't need an choosing get on the under brings lounge and in the next a\nHalf hour I'll be giving away a some tickets so keep your\nKeep tuned to the radio and uh getting your phone and you can wear a ... a set of tickets to go you in a guest to go to tonight's performance um [noise] there are other groups in the area of ... I Believe is on high hiatus right now they\nHad always been playing but uh taking a little\nA little break and then there's ... there are Madison all stars are kept on medicine all stars or or get them off because the Latin pride you might want to be look out for the ...\nThe lookout for those bands uh but also you can catch up with those that play every Thursday at ... and there's a Latin jazz gym there of course Kobe theater is a place here and there and keep your eyes open for them it's also good called Mideast by mid west or the or\nA group that fuses Mideast music with a with other Latin rhythm [noise]\nUm but I also want to let you know that the U. W. afro Cuban jazz ensemble or will be performing next friday\nNovember ... seconds\nAt that tend to press which is located at Seventeen forty three commercial avenue and that'll be a five o'clock show a lot of music going on especially tonight again a John guy goes on south sold the mad at brings lounge\nIn the meantime let's get back to the music\n\nThe music of Johnny blocks from us CD entitled indestructible spirits and here's a tuna titled ... week\n[noise]\n\nThey go to\nThing of the\nThe\nOne thing go boom boom boom jokes\nBlah they'll pay you know people will be joking\nOn the main goal\nChange and\nDo the bowling thing the whole\nBook junkie but then they\nWould do on the go playing the\nGame\nThey're both liberals and the people do need to be able to\nMovie will be\nBut it won't be\nYou do for me\nTo [noise] [noise]\n\n\nDidn't mean to\nTo\nThey really believe [noise]\n[noise]\n\nGet to\nGo to school for\nThe\nTickets for\nFor the new\nOr we're\nGoing to be able to do do do do do\nYou feel the need to be able to\nRead these da da da da da\nDa da da\nYou need to be\nA little bit\nThan the usual you know many\nBe\nAble\nTo do little to do the\nBack\nTo your employer awkward match donations to non profit organization itself ... where are you the next into W are the the the pay the magic give one from your employer\nThe Bible one three organization ... W O O T qualified for math you get an employer in the community radio thanks to solidify their and their employers that they're giving you the balls and\nThen a little remote\nBall young then I like to do the maybe the\nAre made on\nMe a lot of them getting a\nGood idea will hold on to me and I'm not I'm not\nGet up early in the middle of\nBig eight yeah they do they\nDo a young age to eat better legal\nThose I mean let me\nBe a lot not of that\nYoung man we'll meet\nRavi ...\n... you know maybe a little ...\nDon't know\nWhat do you feel a lot on\nYoung man made I made a bad idea wow\n\n\nAnd they have\n\nThat for\n\nDa da\n\nDa\n\nOf them\nOn the mountain time compound [laughter] da\nDa\nDa da da da da da dum la\nDa da da da\nDa\nDa da de la\nLa la la\nGuys that are\nIn the middle of the\nDay to\nI mean\n\n\nAgain by request music you'll be afro Cuban all stars\nFrom uh the big ships are below the ... and that was a more rare though battle\nAnd or as promised a have a pair of tickets to give away um as soon as they started this music the first caller but uh after the music starts uh where you can win a pair up actually it's a huge name gets put on the\nOn the guest list and this again is for tonight's performance of shut on a goal sun and solve all over the map brings lounge doors open at eight a music starts a leap up\nUm ten o'clock and again if you're available to want to go to tonight so\nDance a performer a brings lounge or be the first caller after the music start\nBeing\nAnd do you\nMean by the\nAble to come on come on the\nWith that little\nWay\n\nYeah by the by maybe\nDa da\nDa\n\nDa\nDa da and I learned that\n\nDown the\nAmerican\n\nThere may be\nDay on ...\nDa da da da\nTo channel na na na na na na na da\nDa da da\nBut I don't I don't I don't I don't know da da da da da da da da\nDa da da da\nDa da da da da da da da da da da da da da da da\n\nDa\n\nDa da da da da da da\nDa da\nDa da da da da da da dum la la la ... by both by\nA gentleman gentlemen these gangs all in Idaho and\nAnd the music go Mark Anthony and Will Smith and bad bunny and uh we read from Asia and Mark Anthony will be performing\nIn at the rose mobs in Rosemont, Illinois you'll be all state a RINO used to be called the Rosemont Horizon but a\nSponsor know by all states Rosemont, Illinois just outside of Chicago a Mark Anthony company will be on tour and he'll be there November thirtieth and that will be an eight o'clock show that's on a friday so\nGood a good chance to go down to Chicago for the weekend them or have a good time again November through your mortgage company ... Rosemont all state arena\nIn that uh was a tune entitled to study\nIt is five o'clock you are listening to W. or a T eighty nine point nine FM and H. D. Madison or good afternoon ... can be with you for one more hour and I still have some tickets to give away to a tonight's performance of ...\nAnd solve sold them mad so stay tuned I'm Will do it again we're simply or\nTell you to call in after the song starts a new one um this half hour and then another my next half hour\nSo stay tuned right now the music of uh of Mr Jose Albert\n\n\n\n[laughter]\n\n\n[laughter]\n\nI don't know\nWhy\nI find\nThat I've been beat down\nOf them you can I\nDon't mean that the guy on the air and then\nThey will be a fun I was going on I\nOf that may be a\nMan I\nMean the that the\nGoing on\n\nYour mood auto that\nMay ... a\n\n\nOf your your\nYou get\nI don't know that going to be a\nNon smoking\nThe\nBed I Know it it it got to\nIt may be down there don't you know\n\nDoes that make\nThem\nBetter back then [laughter]\n\nI Know but I don't\nI don't know why that said I don't want that on the job that they're\nSaying I don't do that well my\nAnd dad they\n\nKnow that they might be happy\nThat [laughter]\n\n\nThat's the thing\nThey don't\nThe baby\nAnd she's\nThe\nI landed on any on the main the main\nOn me I'm big nuclear bomb on the main da da da da da da da\nDa da da\nDa\nNa na na na\n\nJust walk through it all it is talk\nIs saying gee hideous [laughter]\nRight Chitty Chitty Chitty Chitty Bang bang Chitty Chitty your card\nTalking to you is it telling you you had a smaller Chitty Chitty Bang bang don't leave that conversation dangling you can donate your car or truck W O R G G will take it out and you'll get a handle on what happens to junction and you'll be helping them your community radio station driving on into the future\nBut I Hope and [noise] [noise]\n[noise]\nThe Wisconsin eating ... and the greater Madison Jesse ... present the conclusion of the twenty Eighteen and did you use yes theories with Madison music scene heavy weights immigrate friday evening November second at the place hurtful\n\n[noise]\n\n[noise] medicine music of Israel ... from his eating at a uh\n\nLet's see master sessions volume one and that's a great ... ... young and I wanted to play something from a or something for some\nFriends of mine and the my exercise class on Thursdays Thursday morning he's from Costa Rica and she's from Sheila and we're talking music the other day and\nInform me that they really enjoy the music of this gentleman that you'll get thicker\nAnd it's got beautiful voice and these are of a bygone era back its property back in my fifties so um but it has such a great voice but I Love listening to him and he was a classic study they win a more again from my uh\nMy companion Sam exercise class\n\n[noise] [noise]\n\n\n[noise]\n... ... ... you with a man\nAnd you're listening to\nSee if we do not\nOnly that but I mean\n[noise] you\nKnow you're going to end the ... and I'm only\nIn the store the other number one on one [noise] getting a cell phone but I Do not have been dog would go to the owners will be\nDone do not really\nA good\nFood [noise]\nReally [noise]\nYou know we will go there and there's no no don't go to the\nIssue was whether they always made me feel like I said\n[noise]\n\n\nThe nice thirty other number one job that you're getting a cell phone but I Do too good to be in those were the good news\n[noise] [noise]\nOh you can\nSee where\nIt's\nGoing to get the no no no no there's no ...\nNobody in order to get deals made some good at\nWhat is the [noise]\nMm\nMm oh\n\n... ... ... ... ... ... ... ...\n\nI'm\nOne who make any one\nMan momma\nMade by\nThat\nA\n\n\nLot more\nOn a\nMan and a a I'm\n... then we started a\nNa Orlando moan about\nThe middle of a\nNightmare [noise]\nNo no no no\nNo the only na na na\nNa na na na ve a\nAh\nAh ...\n... you know make sure we know land a\nAnd all that long you know Neal\n\nAgain [noise]\nNo no no\nNo no not\nMe I mean I'm I'm\nA middle\nMan and he ah\n...\n...\n\n\n[laughter]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise] [noise]\n\nHi I'm Amy Goodman tune in election night Tuesday November ... for democracy now six hour live election night special\n... will be bringing you real time results from mid term gubernatorial and house and Senate races as well as ballot initiatives from across the country will also featured guest she won't hear anywhere else\nTune in for our war peace in election special starting at seven pm eastern on election night\nDemocracy knows coverage of the twenty eighth intellectual will start at six PM right here on W O ... eighty nine point nine of them Madison\n\nAnd before that we were listening to music over the border\nFrom just live ... mania Ninety nine a tuna noodle or you go\nFor the ... for for ... to ... Richard drunk on the moon before the Sonia crews on the boom ... from or a CD titled liberals\nAnd um again a reminder of over ... music in the area a Mark Anthony will be a common November thirtieth to roast mumps or Illinois\nThe big farm over the ... the arena that's down there used to be the or the\nYou're moving over there anyway you're Rosemont ... you\nThough venue but now it's called the whole state arena or something like that ah November thirtieth and um [noise] then Thursday's a Latin jazz jazz and with ... at rabbinic court yard\nAnd then that the U. W. afro Cuban jaws ensemble will be performing attend the press or it'll be friday November seconds and that's that Seventeen forty three commercial avenue that will be five o'clock performance\nBut in the meantime tonight we have shut down ... awesome and solve sold them mad performing that brings lounge and the\nDoors open at eight a dance lesson start at nine and ... years ago so it starts at nine forty five with a ... starting at eleven Fifteen\nIf you'd like to win a pair of tickets or the number here is to five six two thousand and one the first caller after this music starts again to five six two thousand and one if you want to be on the guest list to solve all of 'em\nAre solves all in a ... [noise]\nTo five six two thousand and one is the number to call to five six two zero zero warm [noise]\n[noise]\n\nAnd I\nDa da da da\nDa\nDa da da\nDa\nDa\nDa da da da\nDa da da da\nDa da\nDa\n\nDa da\nDa\nDa da da da da da da\nDa di\n\nMean that\nI Am in your book and then I think one of those baby yeah\nCan down when a ... a month they gained voted then\nAm a senior\nWhen I don't\n\nNo no you know stay fun math based\nOn the ball game when they say in a bank yeah\nOh ... stage fun [laughter] they\nDon't they can't be that bad\n[laughter]\n[laughter]\n\n\nAbout the gun lobby norm I got back\nFrom the robot I was driving or you should be done to prevent beach all the moms\nThe town\n\n\nAnd it's really a great addition overload do with older seen six record this is W O or to you know important in order to room W. O. R. G. H. D. in medicine wears goods and\n\nW. R. T. thinks it's listeners sponsors and the crystal corner bar at Thirteen to Williams in St featuring live music of various genres throughout the week music scheduling updates at the crystal corner bar dot com phone number two five six to nine five three\nW. R. T.\nThinks it's a listener sponsors along with cargo coffee and ground zero coffee which operates house roasted coffee along with a variety of soups sandwiches and baked goods cargo coffee is located at Thirteen overnight South Park street in seven fifty east Washington avenue and ground zero copy it\nI'm forty four Williams and street art rocker John that it's time for rocket rule\nAt home\nRent it only charges on a charm is equal to the witness stand and the judge and why the district attorney ... brown and maintain your job you know the background\nManaged to slide off the bat version of the pay ... an internship in uh walking thirty mile a gruesome mom made a made up town right hand man but then the nature of the ... the main difference in the way that you can detain thousands of black everything you want to take a chance to\nBe an awful lot of ... a bit of shit student or a brown hat and she made a lot of ... a brown ... doo\nDoo doo doo doo doo doo doo doo\nLet me\n[noise]\nTo get them interested in [noise]\n\nDo to your daughter when she comes to mind between a doctor and\nYour daddy around Chinatown man Mr Marlowe\nVina those are due to the last we had the world and the palm of our hands and just you know both her arms in Iraq all invention of about\nHalf the man she didn't want to ... to ... to count the nobody on the hit a high\nIn the same ground lizard he retired at home with a brown eyes family man on the game which trial on hand to Maine\nDo do do do do\nA lot of people\nWill know that the plane and do you think there'll be a little bit now invented the great because I'm not willing to spend the money will go down there this being the ... the day living and good luck to\nYou know John begins all the known\nAnd you don't know who not rational things wrong hotter than mine well they've been dragged all day\nThat it didn't go down\nWell down\n\nLa\nPut my bedroom and gambling boat on a on\nThe main issue for these things are being\nI don't know where to bail\nA little town came along the way around it and I'm now\nAnd then now and\nCelebrating the heck I'll\n\nGo to\n\n\n\nNot\nJumping from\nAbout the ... the John\n\nHave little they bring in\nThe dollar me bring in\nDREAM Act\nTo do with lobbyists to bowl or the back there\nHit from the air is maybe\nThey asked\nYou know we'll go\nGay guy no money to buy\nUp there on the main\nThat there\nWhen you visit the rain and no one\nTo have them read back there and bomb\nDreaming saw that on me [noise]\n\nWhy\nYou know a man and a\nAlready back there is a\nRing at all and I\n[noise]\nShorter robot big Cindy whose Floyd boys you store it over the title track from a new one that was released a few years back jumping from six to six kilos of Nineteen Ninety four\nAnd a boy really worried Ruger bruised by ... ... that came out in Nineteen Ninety five and a noble goal swinging was\nCorals sunny ... playing piano on board very one by big city in is worried boys will really mixing it up on today's program and here's proof from big city in this boy right boy used to the Jimi Hendrix experience\n[noise] mhm mhm\n\nTo pay or you could happen and then\nThe middle ...\n\nThen\nA\nWay that he\nFrom\nLed charming lightens things around\nAnd the wind and rain and the three ... and ...\nThe\n\n\nThe when\nThe [noise]\nBe [noise] mhm [noise]\nUm\n\nAnd that's what am I favor Jimi Hendrix experience to invest Rome or your experience the women\nCries marry that came out in Nineteen sixty seven and you're listening joy ... like that would be a rock and Jonah W. or to your family in Madison, Wisconsin\nW O R G thanks of listeners sponsors and last nickel pizza Twenty years of employee in customer inspired pizzas made from scratch at or Madison area locations dedicated to sustainable practices and community support\nGlass nickel locations and menus glass nickel dot com [noise]\nVitamins to lose present a freaking how we can twenty eight Tea Party October twenty six and Saturday October twenty\nSomething starting at eight pm on opening the annual gathering of copies of candy features many local musicians\nPretty safe as they face to face friday features tributes syndicate modest mouse pretend to the police and blacks on Saturday your tributes manager Franco to fight\nTry to understand\nJune ... June\nYeah a turnaround na na na\n[noise] actually I don't know\nWho\n\nKnows [noise]\nYou may\nAny way though in\nThe late ... when\nA lot of guys\nThey do many but when a\nMakes you a lot and so\nMeasure them but then\nThe day and um\n... know diamond\nNow I mean he was with me in\nAny of\nThen you know and\nThey gave me a new way though when\nMan a man\n\n\nReally windy sooner music we start off with luminal what before winds blow it was a big hit for parents joined or tour of Nineteen sixty one it was also about four years earlier for Roy Brown\nYeah Noone who was in the middle of doing that mothers urban venture into and it was the cervix completely changing their saw the legendary bad for the Pacific northwest\nGoing from a garage or and be like a bill like music them as soon as next recorded brings zippers any way the wind blows enjoy Nineteen sixty seven interrupted up whether you think that I posted on my Facebook page last week\nBe fun and games commission it must have been the wind and that was the regional here in Nineteen sixty eight\nAnd I told your I'm jumping around the night\nThat rain or\n[noise] you know the guy\nAnd I know man I\nDiet and I do\nMan\n\nMean it's hot\nKnew that you know and\nIt again and again and and they ran out\nGang na na na na na na na\n[laughter] [noise] [laughter] [noise] [noise]\n\nYeah what good is rather interesting ... I heard there was a more oh lord I really do love what I bought the forty", "year": "2018", "show_name": "no_show", "city": "Madison", "day": "27"}