{"month": "10", "state": "WI", "station": "WORT", "content": "Name ... my name's ...\nGuys scout guarded on for a guy Martin they haven't forgotten the name yeah my name was ... I\nForgot my main ...\nShe didn't believe in ... well\nMm I guess you got mine yeah\nWell you should hear this story no mystery about what do you live at home for fame and fortune ...\nYeah ... ... four years or even five\nHours going back ... real way was turning ... with no I ... really we ... all my friends and family\nI was able to see ... and everything you wanted to remember me ... they could see I was in ... change my same with the all star cry when I forgot the name\nDressing names yeah yeah I forgot the name\nOf God go I have for God for their name I forgot the other day he\nGot through name oh so sad\nGo John and I forgot the name\nWow yeah friends and family how did you ever get\nName I don't know I Hope they still remain or\nThey'll go to the reunion ... ... ... you know when I'm sure they understand ... ... you're going to get home with us right now who are ...\nWell I knew some day ... and it might be ... ... ... you'll forgive me and I'm sure you do\nWhat we're all getting older at his surname re ... the things we know now mine just ...\nAnd it's a fact ... we make with the ... the\nYou know alright that's the end of our show I guess\nUh well I I may or may not be here next shell but I guess\nWe won't we hear that show after next after next show so\nWe'll see you in in November sometimes well you know I'll be out next week\nYou've been listening to pay attention to lean on eighty nine point nine minutes and an end Sam ... Nason godson\nUsa alright talk to you next time they tune for the best and gospel oh\nThank God Knows what the hell out of it [noise] [noise]\nDirt jak regret others do a lot of\n[noise]\n\nWhen\nYeah\nWill come again we're good or bad\nWith your boys look to the lord joined me Robert de the mess the gospel every Sunday evening from seven to nine ... years the gospels minded sneakers wires and musicians are real it's not good gospel it's not the great gospel it's best\nOh gosh\nYeah every body [noise] gathering [noise] I'm going and seeing\nShut out to the back door and parade you know they definitely do their thing\nEvery week this is your host again the the whole boy you're listening to the best of the gospel with me\nThis Sunday evening I appreciate all you guys for being new you're listening to W. R. T. eighty nine point nine FM Madison so please feel free to give us a call six zero eight to five six two zero zero one that's six zero eight to five six two zero zero one\nAnd I'm just ready to go into not you know have some fun\nI'm playing some good some of the good gospel um and I just hope you already be going around with me um I like the new stuff every week but also like to keep my low favorites that are keeping people inspired and keeping them motivated so make sure you all give us a call six zero eight\nTo five six two zero zero one it's the best the gospel\nI Am your host and see the whole boy we're going to get started with one of my favorite gospel duo\nAs baby and see the winds are you already noticed oh addicted love\n\n\n\n\nJust\nDon't know they have\n\n[noise]\n\n\n\n\n[noise]\n\n\nKnow\n\n[noise]\n\n\n\n[noise]\nNo no [noise]\n[noise]\nMaybe someday soon\nGod millions on\n\n[noise]\n[noise] right now\nGod I don't I don't know how\nBad\n[laughter] I mean [noise] all that often you\nKnow [noise] and um [noise]\nA lot of the fact that\nJob when I finally I mean I Am [laughter]\nI don't think I've been around for that you\n\nKnow\n\n... oh ...\n...\n...\nNa na na na na ve\n\nOne\nNa\n\nNa\nNa\n\n\n\n[noise]\n... you bring the ... ...\n... ... ... ... ... you know\n...\n[noise] although\nThey manage your loans\nYou didn't know that same\nMan [noise]\n\nIf you live presents an evening with government meal Thursday November\nFirst seven PM at the film you know right from the Allman brothers band in Nineteen Ninety four guitarists Warren Haynes an original bases Ellen woody form government knew drummer map out who he played with in the Dickey bets bad\nSteeped in the roots in the rock blues soul in jazz government news recognized for stirring songwriting and storytelling as it is for the improvisational virtual city that fuels their\nCoaches like performance\nAnd evening with government meal Thursday November first seven pm that's assuming\nYou're listening to your tea and they point night FM listener supported radio [noise]\nWisconsin memorial union present I'm with her at Shannon home on friday November second I'm with her as a collaboration of powerhouse\nFolk Americana bluegrass musicians Sarah Watkins Sarah gyros and he thought oh down and then\nEach post impressive athletes\nAnd the contemporary folk landscape Watkins is a member of nickel creek gyros this latest solo album under current one to two thousand Seventeen Grammy Award for best photo albums and do Donovan has a successful solo career the group's chemistry extends beyond the stage and his key to achieving the level of\nIntimacy in unity evident and their performance as the Wisconsin memorial union presents I'm with her at Shannon home on friday November second at eight PM poking with your head for over forty years this is W O R T\nNine point nine and ... and Madison and W. O. R. T. S. N. dot org you already\nKnow this is the best the why me hopes and see the whole boy so I appreciate everybody listening so this next so I'm as a shout out to to to listener Arthur journals he called and requested a song\nIt's a lot of SALT I just want to let you know in you know I like to you know I keep it real when I'm On the air always if you got a song and the title is awesome and guide in any kind of combination\nThere are thousands of gospel songs with awesome and God and my and with and so he he didn't know exactly who was on was by or\nWho who it was so I don't play a so called my God is awesome I Hope that's the so\nWhat's the other Jones requested but if not we played it so and we hope you are filling the anyway shut out the help of listening to the show shut out to you but listening to the show this is the best the gospel and here we go with the pastor Charles drinking and also\n[noise]\nSomebody with your hands\nWe were going to survive\nBrings me to be brave\nDe ... vote\nYeah\nIt does very well our\nI may have come in\nIn the tank\nDa da da\nDa\n\n\nDa\nDa da\nDa da da da\nDa\nDa da da da da\nDo\nThe time by\nTime to come\n[noise]\n\nBan\nBe\n[laughter] you already know that the jam set out to Tracey Smith and her mother has the young and we just don't keep your goal we had another you know a long time listener faithful listener\nMs Sally Thomas and she had a song she wanted to here too so we got another request in a building appreciate jaw hanging out with us tonight on the best of gospel\nOr you can give us a call at six zero eight to five six two zero zero one that's six or eight to five six two zero zero one we appreciate you are listening and this August going out submit Sally Thomas\nAnd you already know was cooling why\n[noise] [noise] [noise]\n\n[noise] she was shaking in wherever scream but he said to me a\nTour of the Marek clearing the mom\nWell even\n\n\nCould see you know sunshine\n\nTo\nThat to the middle of like a new\nBad and you know leave it\nKnow I wouldn't want\nYou know can\nWay\nTo turn now\nThe\nAnd then they know\nNo food in the name of the you\nWell\n\n\n\nCame around\n\n\nMom\nMe to know\nOr\n\nWine\nDown the\nThat\nIs still\nMan\nHand in\nThey are going on\nBut I'm going\nWonder how\nI don't\nKnow\n\n\n\nThe way the green\nMuch chance is let you\nGuard may be a well\nAm to hear the word that is true\nIf you're Trump is going to be\n\n\nTo\n\n\nOn\nGet\nA\nReal sweet ... love is a [noise]\nIt's so uh any oh I Want to use my way to\nDo\nSomething but\nI use a ... ...\n... rupee come join\nA you know all\nThe people who were no matter\nWhat we are going to\n[noise]\nOoh W orange T community advisory board will hold its regularly scheduled meeting on Wednesday October twenty fourth at six pm here at the W. O. R. T. studio one Eighteen south Bedford street the public is welcome to attend\nAre listening to the best the gospel I Am your hopes eight in the\nThe whole boy you're listening to W. O. R. T. eighty nine point nine ... in Madison may we were going and\nI don't know about you but yeah this last hour was just it was power pack so\nWe appreciate job we're listening give me a call at six or eight to five six two zero zero one if I'm not able to pick up the phone right away please feel free to give a call back six or eight to five six two zero zero one I'm your host Mitt and I appreciate your\nUh being open so tell a friend about the best the gospel with you love what you're hearing share it with somebody else right when we run into some good sometimes it seems like we share it and we share for a little while but less something bad happened to let somebody treat us wrong let somebody say the wrong word we will tell\nAnybody with ears and so if you are listening to this show and you enjoy it and you appreciate it I Would love for you to share\nThat with somebody else so that they can listen to the show is well you can listen online at W. O. R. T. S. dot org anywhere in the world if they log on to that website they can listen to this show\nLive right now W. O. R. T. FM dot org and if you just want to say what's up give us a call at six zero eight to five six two zero zero one so you know what time it is man we get in to the we we go we go we are moving to the new school of gospel\nAnd and I hope you have to stick with this don't go anywhere sometimes it's good to hear the new stuff and what's happening out there\nAnd it's next some its neck so it's called new wave new wave is from\nIs from the Bible of love and so I Hope you appreciate it new weight [noise]\n\n\n\n\nChange for the [noise] that's on page\nFor the [noise] right and wrong Shane some great it's just a shame the feeling that how you\n\n\nBall\nDo from the\nShame temptation hopelessness no motivation\nChoose the way you know and\nNo matter\nMake\nSure I'm\nSaid from the\nWorld in\n\nWay home\nCan't be sure\nCan do it no I don't\nYou know the ...\n\n\n\n\n\n... things oh bleach smell o thing\nKnow you can know\nCame back for the body was going well that was left the stone ... was going to feed on two wings blood in me on the ball originally came to know mobile phones just picked bill messenger and everything is being used in mysterious ways and everything's been caused pain to blow the dates Jehovah knows tiger\nChrist said to write this ... home in spite of miracles doubt about it and I tend to\nGive up the fake to know what's on the crisis that writes the fight to buy no [noise]\nI Can't make you went up to crush the right to the park [noise]\n\n[noise]\n[noise]\nMm\n\n...\n\n...\nHow\nThat so when you read them ...\n...\nWell\nMe\nWhen I was thinking when you\nMade\n[noise] [noise] [noise]\n[noise]\n[noise]\nHi I'm Susan the W O T staff member responsible for organizing I pledge drive with the help of hundreds of amazing volunteer and dedicated staff I recently completed fall pledge drive ran like he ... the famous making sprinter\nThank you to every one of you who gave your time and energy to make our phone Dr successful there was an a or a festive\nPositive energy around the station during the drive and that was all year because of your generosity we exceeded are gone came very close to our stretched all of eighty thousand dollars we also added eighty new monthly donors\nW. R. T. has faced unexpected challenges in twenty\nEight and we are so grateful to find that the challenges have come with tremendous support from you or tone tear listeners sponsor and most of all a vital part of the W. O. R. T. family thank you [noise]\n\nIf you live presents and you need government mule Thursday November\nFirst seven PM at the film you know right from the Allman brothers band in Nineteen Ninety four guitars weren't Haynes an original bases Ellen woody form government drummer met out who he played with in the Dickey bets bad\nSteeped in the roots in the rock ... sold and jazz government news recognized for stirring songwriting and storytelling\nAs it is for the improvisational virtual city that fuels their coaches like performance and evening with government meal Thursday November first seven PM till\nYou're listening to all of your work and they point nine FM listener supported radio [noise]\nYes yes yes you are listening to W. O. R. T. eighty nine point nine holes\nThe whole boy this is the best the gospel we we just got going on man we had I mean I Know I'm In here by being 'cause I mean I play some I mean if you're in her happy so then they like they still sound good if you're listening to them they still get you went places\nOr that they hit you so we just going to keep the ride going it's like so I'm going to play is called come as you are from the Bible of love and I hope they wouldn't be the best the gospel a in the ... freestyle coming up next so if you you really want to pay attention I got my freestyle coming up next on the best the gospel I appreciate yeah Mm\n\n\n[noise] [noise] [noise] burgers [noise]\n\nHave to jump like [noise] like\nDon't know the guys in your clothes and being concerned about your\n[noise]\nTo bad\n\nThan they are hard to characterize stars and [laughter]\n[noise]\n\nNot a chance [noise]\n[noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\nWhere you\nWind and rain and\nThat may know we're going to\nBe on me I'm not buying and selling for ...\n... ... may not be cheering on the terrain\n\n\nGood to be\nOn the ground [noise]\n\nMad\nMax and\n\nDay one and they\nBecause my\nA dollar or did you do you know you just take\nAll the ones we\nGoing to do now is you know we are\n\nThe only\nThing I Would you let them call those things if you knew he was with me and my brother would be out there in your life or grief or if you knew you had already if you knew what the\nWeather's ... perfect drink beer and regular beer and you ... you know first read it they don't want to congratulate your power did it lead to more than the need for\nHis own three royal through her\nJob as a job you know\nThe ones we weren't in reverse the raiders leave our we saw the movie\nWe\nWhile you're on\nThe air\nRoyal\nWho would want you to his own shows you know we used\n\n[noise]\nThen [noise] you\nKnow you don't drive for me [noise] and you know you never started I mean what do you mean you can call me you're Bradley [noise] you never been in June or no more than I can try and do they\nBoth did you say\nYou know the U.S so much to gain the pay us so much today and I know these are what you do not listen to you and your actions on much ... than you so much ... than I Do deserve it\nYou can't do much\n[noise]\nMm\nYou keep staring at a\nChina ... or ... that's why I watch my life\nUshered in trying to do\nGive us so much do against us so much today and I know these are what you know I Do not allow your actions on march ... and you're much too I don't deserve it\nCan't do much\n... who\nAre on June ... me that I mean right or you ... I\nFor me so good and you're keeping job or maybe ...\nGive us so much ... than a year after much do I know these are what you know I Do not do you do your abs all much ... and you're much more than I Do deserve it\nYou can't do much\nMm\nMm Mm Mm\n[noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\nThat you'll get the word\nMe I'm\nTo be\nDa da\nDa\nDa\nNa na\nNa na\nNa da da\n\nDa da da da da\nDa da\nNa na\nNa\n\nCan\nCannot\nMe on the\n[noise]\n[noise]\n\n[noise]\n\n\nOh\n\n\n\nOh [noise]\n\n\n[noise]\nWell I um [noise]\n[noise]\nOh yeah oh\n\n\nYeah [noise]\nJeffrey ... your vicious present far out folks on Thursday October twenty seven thirty PM at the gates of heaven\nComposure Jeffrey greedy and your issue than an evening of one world music sources improvisational the composition the hockey play tribute to protest considered the first important gesture medicine locally grown\nYour ensemble yet vicious but bring a program of extended compositions by Brady into improvisation by members with music from Egypt standup are gone out and the America as far out cope with Jeffrey berry and you'd vicious Thursday October twenty fifth seven thirty PM at the gates of heaven and James Madison park on the shores of lake\nMendota his a deli or TDY nine point nine of them and W. O. R. T. F. M. dot org listeners sponsored community radio\n[noise]\nAnd then next to access all Monday October twenty second seven PM zero W. or if you read a nine forty nine I found [noise] obey sharing some music\nThat I feel captures the confusion was there many of us fuel regarding the condition of our world just music may not provide a way out of here but at least we're all changed some relief by rocking out again that they are in the next to access Monday\nOctober twenty second seven PM you're on W. R. T. United point nine of them [noise]\nThe excess our is W. orgies commitment to community access to the airway diseases stress on the exercise I Do not represent the decisions itself programmers for the border\nDrug [noise]\nA\nClassical pianist Kennedy wrote in Madison Sunday November fourth parties talks of piano to show them\nThe twenty two year old ... silver medalist at last\nYear's Van Cliburn international piano competition will perform send out as by Beethoven ... and barber originally from Minneapolis\nKennedy rubber is also prize winner of Sydney Seattle in New Orleans international competition your debut album was released by deck a gold in twenty Seventeen peanut Kenneth Robert Sunday November four four pm at forty salsa piano Schober sixty five twenty two people vote on medicines far west side\nTickets available in person or\nSalon piano theory dot org bringing great piano to Madison is W O ... O W O R T FM dot org listener sponsor community radio [noise]\n\nIf you live present and the government meal\nThursday November first seven PM episode will be\nBurner right from the Allman brothers band in Nineteen Ninety four guitars Warren Haynes an original bases Ellen woody form government no drummer mapped out who he played with in the Dickey bets bad\nSteeped in the roots in the rock ... government news recognize words during songwriting and storytelling as it is for the improvisational virtual city that fuels their\nCultures like performance in the evening with government meal\nThursday November first seven PM till\nYou're ... you're working and they point night FM listener supported radio [noise]\n[noise]\nThe Wisconsin evening dress dress and the greater\nMadison Jesse ... present the conclusion of the twenty Eighteen and did you use yes series with Madison music scene heavyweights immigrate friday evening November second at the place circle\nTrue to their ... immigrate trades and dynamic cruise and unrelenting calling rhythms comprised of ten local musicians immigrate delivers a worldly jazz rock sound was swirling repetitive guitar pattern the funky\nBaseline and the series ... sections of toys and piano immigrate plays a final installment as an indigenous yes theories that didn't memorial union place or vote on friday evening November second at seven thirty\nYou are listening to W. O. R. G. eighty nine point nine FM and W. O. R. T. and found that or [noise]\n\n\n[noise]\n[noise] [noise]\nWell good evening it's a little bit past nine o'clock here in Madison it's time once again for her TV Sunday evening program of electronic experimental classical ethnic and improvised conduct\nFor the discerning citizen of the twenty first century glad you could make it and don't worry nobody's going to ask you for your papers here Hi my name's Greg I'm delighted you could be here\nWouldn't be the same without you we have a little bit less than two hour stretching before as if I've done my job well you'll be joining our mutual friend destructive eleven PM having spent some time with music that is worthy of the silence which preceded it and the silence which has to come\nAs ever should anything particularly interest you the number here at the station is six a wage to five six two thousand one glad to try to answer any questions you can tonight's program features a whole lot of a new ad recent releases which I always love to do after we do long on air fundraising things\nUm but the thing that started the\nNight's program a came from a earlier this week I noticed that ah we're reaching the end of the year the sun is going down earlier and there's this thing where when I come downstairs at the end of my working\nDay or from the office or the delight is lower and just thinking about the\nSlant of light and then I just flashed on a a great old Emily Dickinson poem and the next thing I remember is that one of the least likely singers and the whole world set Emily Dickinson poem\nOr everybody I Know who knows me\nWho I foisted this thing uh it's just really surprised by it so I thought\nIt'd be a great way to start tonight's program so here with the music and lyrics of and Emily Dickinson is a David Sylvia and from his album died in the world the last album of original music he released\nA the Emily Dickinson poem if you know it is called a certain slant of light\n\n\nIs this the ... when you're up to the president is like the [noise] that's good see drones June ...\nEvidently they get is a ...\nBut different ... meanings um you\n\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMhm\nMhm mhm\nWho who who who who who\n\nWould have to pay\n\nFor it which which which which which which which which which which which which which which which which which which which which which\nWhich is the number of Tibet too much about these things which which which\nWhich is what you got to do that much difference\nBetween the two hours to get people to go back to back to the to the victim and\nDon't get to speak to them but to protect them up to them in the middle of Tibet you want to be able\nTo protect them and to protect them and to continue to protect them to continue to pick just depends on what you want to get through to them to the music of the game between the two independents in the beginning of the union\nTo back to them to put them in the college and a big difference between two people in Japan even when you consider\nTo be changed\n\nBut the number of\nPeople\nIn the\nIn in in in\nIn the in the end of the week in the end of it\n\n\n\n\n\nAnd and\nAnd um [noise]\nWe don't need to be in the in\nThe immediate needs to be [noise] in the\nIn the in the in the\nGroup to bring back in\n\nIn ...\nNever never never never never\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\nFrom their brand new record on drawing room called Thomas Christina corner\nAgain any questions about anything you've heard two five six two thousand one\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n\n[noise] ...\n\n\n\n\n\n\n\n\n\n\nMm Mm Mm\n... [noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n... ...\nNa\nNa na\nNa na na\nNa\n\n\n\nNa na\nNa\nNa\n\n\nNa na na\nNa\nNa\nNa na\n\n\n\n\n\nNa na\n\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAh\n\n\n\n\nMm\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n\nUm Mm\n\nMm Mm Mm Mm Mm Mm [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nUh [noise] uh\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\nWell that's going to do it for tonight's program or we started that last set with music from the half the true I didn't get three from the same name ... gave us\nA new harbors from their food audio released the same name it's worked from Peter Garland from the landscape scroll seconds at sunset for ceramic bowls and single percussionist in the background music from scanner\nA real issue on the roof forty label of his album mass observation which is sort of an interesting historical artifacts it's Robin Rambo Jim ...\nAnd Robert Sampson from Maine\nAre performing live\nA for John wasn't craft the guy that runs the touch music label sitting around in the same room with them\nA a very long time ago in London it's been reissued and it's as wonderful as it was because even longer anyway thanks for listening you're tuned to W. or cheat a nine point nine FM an HD in Madison, Wisconsin stay tuned to the weekly world noise [noise]\nIs now open for the W O R D nine of being the damage tournaments sponsored by ... W ... will take over dreamland what's again report that six PM but we made it easy to bully or gee this year ...\nBut nobody or do you get them done or and then turn it in with your registration and the forms are actual traits you end up like Cyprus on the street to no need to collect pledges\nW O R D D jays will be rocking buildings bullets come to find in three skill levels you don't need to be wherever the wind Mobil ers will\nReceive a keeps it in the older boys and with the nobody or do you go and find tickets to the your fries rapid more tickets are available for purchases if you've been mulling a strike read in the front lines of free beverage\nAfter boiling enjoying the subject was for your family and the prices are going on for thirty five dollars and for the proceeds benefit there'll be or gay community radio\nThat the ... or the nice thing to turn on the sports six PM Lisa those shoes and she will be [noise]\n\n[noise] [noise] by news to lose present a freaking how weekend twenty Eighteen fighting October twenty six and Saturday October twenty something starting at eight pm on both like the annual gathering of houses and candy features many local musicians Brady\nSafe as they face to face friday features tributes cynic case modest mouse pretend to the police and black Sabbath on Saturday your tributes and if I go to fight\nElvis Presley the cranberries and foreigners\nThe freaking how we can is friday October twenty six and Saturday somebody\nTwenty seven at the high new solutions that seventies show starts at age is giving you a part of this rock and roll fantasy for over forty years this is W O R G eighty nine point nine of Madison and W. or he had been done on his\n\n[noise]\nNice Eli presents gets however you also asked Johnson I hear music or\nWhy would you do for me when you get yours yours Johnson's were born is redefining invest abroad hardly\nHobby music in its entirety suggested by air drop some fans worldwide we'd be fewer the gym covers the new materials evening a full ... will be some time with\nThe large resent the charges Johnson Raleigh do see nice you refer to as severe Morse sees your immunity radio W O ... eighty nine point nine\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nDe\n\n...\n[noise]\n\n\n\n\n\n\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter]\n\n\n[noise] [laughter]\n\n\n\n\n[noise] [laughter]\n[noise]\n\n\n\n\n\n[laughter]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[laughter]\n\nMoney in\nOr in the past month or two of them don't share our service to land a breeder around nine year old\nJames you feed your turkey can run here you're ... or ...\n... ... ... ... ... ... ... do you think that they can get you know the ... ... ... ... ...\n... ... ... ... ... ... ... ... pound was\nAmong the little ... ... what is she or he didn't know where to draw\n... doctors who worked in the book on the shores the jaws you build\nA Bush told to go to the beach cleaners and they just go to a third world he struggled shows little or no\n... or ... or do do this\nThe insurance national or just to get into a server and warm\nDown there do you know trouble holding firm and [noise] there was a ... a ... bill learned how to say to\nMe there were all\nThe burden that goes to a German Shepherd\nThe chance to get a chance to ask you how can you tell the tale of\nTwo fold cable channel jihad kill time last chance to jail for all\nOf a chain chain chain chain chain chain chain of all going off to afford to pay for a new one for a real chance to do the\nWork to do the\nRight to show that he won't be able to work for me to play the man who works for the\nNew shirt and the ... we're going to return to preserve that [noise] I Do and and brutal pretending to be sure to be ... today so busy as you're going to\nBring in people remember the day on average blood and burned more than it does appear to shepherd actually do the other day that I mentioned\nThe word ... my grandmother and no more job when I wanted to do labor or ... or ... or ... or jump the shark cultural ... gone so Boston Globe where your shoulders\nWell when we do middle aged ... we're going to be more border though\nWill start to see who could not do more to do what you do to be but we do\nTo you can afford to rule for most can afford to pay for the food to food to she'll kill kill kill kill kill kill or you\nCan afford to move to new new\n\nCurrent\n[noise]\n\n\n\n\nNo no no\n\n[noise]\n\n\n\n\nAnd\n[noise]\n... and ...\nSays [noise]\n\nOh\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise] [noise]\nThere is [noise]\n\n\nThe snakes and\nOf the day\nTimes they would see\nBelieve that you know I Know you're talking\nFeel the same boat\nBy ... by\n\nI\n\n\nKnow I\n\nI mean\n\nWhole ball on the Muslim or a wildly shin wildly she\nSaid\nI\nKnow\nMaybe you know I\nYour\n\n\n[noise] I\nAgree with the long\nRun [noise] [noise]\n[noise]\nYet but it is\nOh my gosh Madison [noise] you're still in the end of the weekly world noise [noise] right here in W. O. R. G. eighty nine point\nNine FM in Madison listening to new music by rabbit [noise] this is the most insane mash up I think I've ever heard of this a matching\nUp Leah with Ali yeah anyway which we're going really well [noise] this is off of one of his most recent mix tapes but just before that we heard something off of his newest album life after death just came out recently and we heard six\nDevil [noise] jeeze that guy's good before rabbit were each tumor [noise] from safe in the hands of love featuring off the infused Mary Jay Lynn before that do\nDiverging from her one sixty be PM legacy I mean she is technically a foot were producer but her new album autobiography music from Wayne McGregor is out to about ... it's just mind blowing I. J. when she is\nA genius before that from China Alex ... who tie [noise] this is not my country from divine weight before that ... it's down to like mine is twenty seven [noise] F twelve\nFrom ... hunt show a masterpiece before talks before that was talks blue warm up run Mel eight run rally fertilized at ... Mary DJ leg Griffith\nDiego young paint anyway yeah it was a lot of stuff that crammed into that last set of new releases\nIf you want to keep up you can always linked to the play list at W. O. R. T. eighty nine point nine and\nTwelve o five\nI'm just not even getting my voice breaks\nStraight and I'm probably not going to do very many for the rest of the night 'cause I've got a lot on my mind but I was trying to say the website and I just did a station id the website is W. O. R. T. F. M. O. R. G.\nThat's where you can link to the play list\nWe're kind of shows are up there dreaming audio if your radio wasn't coming in but if it is coming in then you're logged in\nEighty nine point nine of them [noise]\nI'm just struck though it's a weekly world noise tend to get into some library time I found a couple\nOf issues I guess if there are CDs but it's like a CD magazine called the aerial [noise] and I found is she's two and three [noise]\nHearing some mark Berger Rick uh right now [noise] cold misty a cross into blue on [noise]\nUsed to work with carry Lyme are quite a bit Mr Taylor was just telling me that he's also one of the most prominent bankruptcy judges in the country\nOr do you like that got to have a day job and my rights\nAnd to the rest of this year some anal awkward from number to\nAnyway stuff I've found right\nHere in the building [noise] W. or to [noise]\nSo many riches to be had here I'm going to do with for some more while I play the hope you're enjoying it don't touch that dial nine point nine FM I'm destructive it's twelve o seven right now [noise] summer for [noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\nMhm\n\n\n\n\n\nMhm\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMm Mm\nMm\n...\nOr ...\nMaybe\n... Mm\n...\nI'm ...\nAnd the\nNa na na na na I [noise]\n\n...\nMm\n\nMm Mm Mm Mm Mm\nMm\n... or ...\nThe dollars that uh the the\nTo do ... do do\n\nDo\nDo you really have anything to do\nA lot of you or a [noise]\n\n[noise] Mm Mm Mm Mm Mm\nI'm not I'm not\n\nGoing on in the ... they\nNot deny\nYou're a man I\nWe need to miles\n\nIn ...\nDo you\nMm [noise] Mm I Know it's\nMe and I said\nI'm here\nRaiders and why\n\n\n... ... ...\nIn\nTheory you know we may find\nAnd I'm asked to pay ... ... ...\n...\nWhat I mean now I'm\nNow ... now that it's gone\nWay down\nMay not want to\n... people that you know\n\nI'm not ...\nTo ...\n...\nDa da da da\nDa da da da\nDa da da\n\n\nMm\n[laughter] [noise]\n[laughter] [noise]\n\n[laughter] [noise]\n\n\n\nBoom\nBoom\nBoom [laughter]\n\n\n\n\n[laughter]\n[laughter]\n[laughter]\n\n\n\n\n...\n\n...\n\n\nAh\n... [noise] ah\n\n\n[noise]\nAh\n...\n\n\n\n\n\n\n\n\nYou're in June of the weekly world noise rate your W O R G ... eighty nine point\nNine on your radio dial in and were mad at the music by black known ... ... [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\nA\n\n[noise]\nOh [noise]\nA\nA little\nBit about what's going\n\nGo in the ... who will likely deal you don't want to get their message across the border with somebody and got to the\nBack of the ... but the bottom of the human during the Iran on or turn on or would they want to know when I get the ... I went to her look over\nThere right who do not know closer\nAnd they got me right now because I think I'm ready to give them a night no is it called the rise in the middle of the night like at the mouth open your dream a nickel we write down [noise]\n\n\n\n[noise]\n\n[noise] [noise]\n\nIt takes\nTo be [noise]\n\nUh\n[noise] uh\n[noise] uh\n[noise]\n[noise]\n[noise]\n\n\nNah\nNah\nNah\nNah [noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[laughter]\n[noise]\nShit\n\n[laughter]\nOur\nA long long long\n\n\n\nYou\n... ...\n\nYou know [noise]\n\n\n\nAnd the ... [noise] [noise] [noise]\n\nI\n[laughter]\nMan\nMm\n\n\n\n\n\nAh or\nOr or\n\n\n\n[noise]\n\nOh right keen Simon [noise] you know what time that means [noise] Halloween Halloween [noise] not quite but this is my last\nShow before Halloween [noise] so [noise] that I did least open up a diamond\nNot going to be playing stuff like that but [noise] I figured it's a good place to start [noise] night I've got a lot of really dark evil brooding stuff [noise]\nSome dark gone beyond some more power electronic noise stuff I felt like tonight playlist while I was doing it I was inspired by haunted houses as DJ I'm always aware of my um [noise]\nAudible surroundings as far as what I hear where you're at and it's nice to play on that I just imagine\nWhat sort of stuff would I play if I had the opportunity to decide what was heard in on the house so for the next three hours going to be some torture [noise]\nDemonic twisted sound primarily I focused on stop 'em\nUh one more experimental course since about the overall scheme of my show remnants of music and whatnot but I also wanted to make it a point to focus on stuff without um mini vocals [noise]\nSo I think in the in all I only have like two maybe three tracks with any sort of human voice in it\n\nAnd [noise] one of those things where I go into it hoping to have at least\nFor three hours and I ended up with like twelve hours of material so that's always nice when I Do myself in that sense\n\nSo I think I'm gonna finish hearing that song because I haven't heard king diamond in a while\nAnd we're going to rule that you would really be the dark with the ... marry oh I really love your\nShow I mean you're ... you're going to be on a Sunday night and you're listening to what end on that there'll be or she\n[noise]\n\n\n[noise]\n\n[noise] shoot [noise] issues\n\n\n[noise]\n\nShoot\n\n[noise]\nShoot\n\n[noise]\n\n\n\nWith\n\n[noise]\n\n\nShe [noise]\nShe\n[noise] she [noise]\nShe [noise] she [noise]\nShe [noise]\n\nShe [noise]\nShe [noise] she\n[noise] she\n[noise] she\n\n[noise]\n\nShe [noise] she [noise] she [noise]\n\n\n\n\n\n\n\n[noise]\nFight Elvis Presley the cranberries and foreigners\nThe freaking how we can is friday October twenty six and Saturday October twenty\nSeven at the high noon saloon towards the seventies show starts at a given you a part of this rock and roll fantasy for over forty years this is W O R G A nine point nine of Madison and W. or she had been shot for\n\nThe W O R T community advisory board will hold its regularly scheduled meeting on Wednesday October twenty fourth at six pm here at the W O R D studios one Eighteen south Bedford street the pub\nWelcome to attend [noise]\nMany people tell us the W O R G is a major parties when Madison\nWell Madison and they cannot bear to think of what south central Wisconsin would be like without a unique blend the new music programming musical offering world view [noise] you can help you have six sure in our community for decades to come maybe W O\nI Will try for more information she's ... she's been sheltering six zero eight two\nSides to zero zero one\nDuring business hours when they strike [noise]\n\n[noise]\n\nHello this is this is your host the guardian princess we are in the middle of a Halloween special edition up in one end\n\nIn the last hour we heard three tracks\n\nWell I guess for by consider king diamonds Halloween which I opened up with [noise]\nBut as far as the majority of the ... I'm focusing on stuff that I feel\nLike would be good in a haunted house setting at least a haunted house that I Would run I Would have some really\nGruesome protests disorienting stop [noise]\nWe opened up with a collaborative effort between L. are and ... Mary with iron to\nHer piece to marry a number of times and I really appreciate everything that\nThey do so sure that they're collaborating with another artist\nDefinitely going to have to check them out the never heard of\nEl are before but up to see what I can find a [noise] after that we heard two zero doubt as to\nBe with your radio a radio to hate\n\nThan before the break we heard dark book called the ritual was coloring instinct and we are also hearing another track by dark yeah having a hard time talking to night\nDark called ritual into circle [noise] gonna go on for another twenty five minutes or so\nAnd see what else I can dig up for the rest of the ... but regardless\nIt's going to be true some it's going to be\nMiserable and it's going to be dark and foreboding I'm your host the accordion princess [noise]\nDid you [noise]\n\n\n\nI suppose I should also say [noise]\nConsidering that Halloween is my favorite time of year\nEspecially I'd say I joke around saying Halloween is my second favorite holiday [noise] my actual favorite holiday is the day after Halloween when everything is fifty percent off at the Halloween store [noise] how does that [noise] stock up\nOn all my years worth of God's makeup gets masks I collect mask\n[noise] all sorts of stuff [noise] but anyway what I was gonna say\n[noise] is if you think of something [noise] that you believe\nWould be good and the haunted house studying\nAll of the nation and let me\nKnow will make it a haunted house request\nBlind six to eight to five six two thousand one you got a son that you think would be great haunted house\nScare the guy said\nI'm here\n\n[noise]\n\nUm\n[noise]\n\n\nOh\n[noise]\nGod [noise]\n\n\n\nRight [noise]\n\nYeah\nOh\nMan\n[noise]\n[laughter] [noise]\n\n[noise]\n\n[noise]\nUh any and\n\n\nBanned by my [noise] na\nNa na na na\n[laughter]\n[noise]\n\nUh\n\n\n[noise]\n[noise]\nI I\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\nI [noise]\nAnd in\nYour bird\n\n[noise]\nI\nLa la la la land they bomb and my\nI [noise]\n\n\n...\n\nYeah yeah yeah\n[noise]\nRight right [noise] na na na na na\nNa na na na\nNa na a\nBig ... de la di di\nUm\n[noise] the\n...\n[noise]\nUh\n[noise]\n...\nThe [noise]\nMm\nMm [noise] na na na\nNa na na\nNa and\nThe\nUm um\n\n... de Reyes ...\nA\nNa\nNa na\nNa na\nNa na na na na na\nNa na um\n\n\n\nThe [noise]\n\n[noise]\n\n\nWhatever\n\n... in a\n\nNice\n\n\n[noise]\n\n\n[noise] and uh [noise]\n[noise]\n\n[noise]\n\nMm [noise]\n\n\nMm [noise] um maybe\n[noise]\nMm [noise]\n\n[noise] Mm\nMm\n[noise]\n\n\nMm Mm\nMhm\nMhm [noise] Mm\n\nMm\nMm [noise]\n[noise] Mm [noise]\n\nMm\n\n\n[noise]\n\nMm\n\n[noise]\nCheese\nCheese\nAh\n\nMm\n\n\n\n\n\n\n[noise]\n\n\n\n\nUm\n[noise]\nTo say to you know\n\n[noise]\n[noise]\n[noise]\n[laughter]\n\n\n\n\n\nAnd then next to access our area Monday October twenty second seven pm here on W. or eighty nine point nine thousand oh be sharing some music that I feel captures the confusion was there many of us feel regarding the condition of our world this music may not provide a way out of here\nBut at least we will obtain some relief by rocking out\nAgain that's area now and the next to access Monday October twenty second seven PM you're on W. R. T. eighty nine point nine down\nThe access our is W O O G the commitment to the early ... is our number is is that programmers or the borders\n[noise]\nRegistration is now open for the W O R G nine of in temperature intimate sponsored by Madison essential that many ... will take over dreamland once again on the river for the six PM but we made it easy to balls or gee this year\nFor instance you're allowed to form it nobody or do you get them done or and then turn it in with your registration the forms are also facing and like Cyprus on ... street to no need to collect pledges\nW O R D D jays will be rocking billing boulders compete frightening and three skill levels you don't need to be wherever the wind Mobil ers will\nReceive a keep saying how old boys and with the debate or do you go and find tickets to the your prize rapid more tickets are available for purchases if you've been mulling a strike raped in front of free beverage after boiling enjoy\nThe mothers version and the prices are going on for thirty five dollars and the proceeds benefit there'll be or gay community radio\nThat the W. or the night and then just turning on Sunday and of course at six PM Lisa shoes and she will be [noise]\nF PC live present Paula Poundstone friday November second at eight PM and the capitals theater\nAnd you know really the good thing about being an atheist is that we have no mandate to convert anybody [noise] so you're not going to wake up on a Saturday morning with me at your door [noise]\nWe I I never going to just stop by to tell you there is no word [noise]\nJust brought along his little blink book guys hoping you take a look at [noise]\nThat followed Poundstone friday November second at eight PM an overture centers capitals theater\nMore info and tickets available online at overture dot org [noise] you are listening to W. O. R. T. eighty nine point nine FM listener sponsor community radio\n[noise] [noise] [noise]\n\nHello once more listeners this is your house you're going in princess going over what we've been listening to for the last hour a lot of longer trucks tonight\nLet's see we opened up with dark ... ritual was\nIn the circle and we heard controlled bleeding was grinders song [noise]\n\nAnd I felt like it would make sense after hearing a track called grinder song then we heard it made with the grinding inside I really love an aid as well as control bleeding so that was quite a good parent I felt and we heard a second tracked by made in the drain of times\nBreak we just had we heard I S o\nNot sure exactly how I Would say that\nZero zero colon one seven bore sticks\nYeah\nNow the fact that it's difficult to pronounce it just doesn't really make sense but what does make sense nothing on my show\nThat's for sure [noise]\nBut I guess the one good thing not the one good thing but one of the good things about him playing these longer track I talk as much\nI Would hate to have like a\nThree hour show where I play nothing but like forty second punk songs and a half to introduce all of them that would be me more me talking more than playing music so yeah I can have that\n[noise]\nBut right now we're hearing rubber rituals one [noise]\n\nLike Anna ...\nUntil tonight and I like what I hear so far a lot of the stuff\nI'm new to me I have heard fused to marry and have a control bleeding and an eight foot\nSide from that I'm playing a lot of newer stuff to at least to me\nMight not be newer released as part of new to me so anyway\nWe got some more and made lined up after that\nThen we're going to hear grants bladder or really of grants bladder\nBody cargo\nA project name and I feel like okay I really hope they live up to the ... name 'cause it's really good fun name to me and I felt like they did a good job of I'm actually living up to the title I'm One projects that lined up later\n\nJoking or whatever it was a\n\nA general ... learned on the line\nAway [noise]\nSo you see I'm a young boy\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\nAh\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nReally\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nMm\n\n[noise] um\n[noise]\n\n...\nUh\n\n[noise] he\n... he knew who [noise]\n\n\n\n[noise]\nIs [noise]\n\nAnd and [noise] and\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\nAh [noise]\nOr or [noise]\n\nOr\n\nYou're listening to W. O. R. G. Madison nine point nine yeah famine W. R. T. F. M. dot ORG listener sponsor too many of the radio\nMorning my name is rich Samuel the name of the program is anything goes that money classical music up until ... o'clock this morning this morning by bringing you a pre recorded broadcasts\nAnd what that means is that I Will not be able to include the b._b._c. news headlines the insurgent radio kiosk the classical music calendar or the various messages that we bring you in a normal broadcast that's the downside the upside is I Will be able to bring you music that would not fit into a normal broadcast\nAnd so we're going to begin this morning we're they complete performance of Gustav Mahler is symphony number eight the symphony those thousand written in Nineteen oh six and first performed in Nineteen ten [noise]\nWe're going to hear a performance by the Vienna Philharmonic directed by Leonard Bernstein vocal solo Lewis will include Margaret Price Judas Blendon guaranteed swimmer who to lose a Schmidt I'd miss ...\nCan is legal here among pry and who's Avon dumb this is a Nineteen Seventy five recording and here is part one subtitled him knows they need to be with us\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\nMm\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nMm [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\nMhm\n\nMm\n\n\n\n\n\n\n[noise] Mm [noise]\n\n\n\n\n\n\n\n\nNa\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[laughter] I'm like oh I\nWas on a trail them for\nLove\nBottom of that I'm a\nYoung\nMan at night\nWhen I was a very\nLong [laughter] now [laughter] [laughter]\nI have a little\nGet paid\n[laughter]\n\n\nI I\nDa da da da da da da\n... ah man\n[noise]\n\nI'm a\n[laughter]\nNa na\n[noise]\nOn on\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\nThe\nThe\n\n... or ...\nThe\n[noise] the\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n[noise]\nUm [noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] you know\nIn school [noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\nMm [noise]\n\nThe\nMovies you see people\n[noise]\nWho is really not\nBad news\nFor me I mean they didn't want\nSee what else [noise]\n\n\n\n\n\n\n\n\n\n[noise]\n[noise]\nYou know a\n\nLot of the uh [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n... [noise]\n\n\n\n[noise]\n\n\n\nUh [noise]\n\n\n\nUh\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\nMan\nOwn on the line\n\nIn a way [noise]\nMm [noise]\nMm\n[noise]\n\n\n\n[noise]\n[noise]\n\nUh\nOn the on\nThe ship\n\n\n\nNa na\nNa\nSmall da da da da\n\nDa da da da da da\nDa da\nDa\n...\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise]\nUp on\n\nGoogle and moving in the mood in the\nMood in the mood to lose\nAnd when my mother in\nLaw and the new boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nIn many many many many many many\nMany many many\nMany many many many many many many many\nMany many many many many many many many many many\nMany many many many many women who are now and then you know one of those women women and men are no no no no\nNo no no no no no no no no no no no no no\nNo no no no no no no no no no\nNo no no no not in a minimum number of\nMen\nBut none of my ... my dad and my mother and my son or not a matter of management na na na na na na na na\nNa na na na na na na na na\nNa na na na\nNa na na na [noise]\nAnd then the\nOther members of my mother who doesn't even Britain mother's maiden name\nAlone and then boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom\nBoom boom boom boom bang bang bang bang bang unloading\nAnd when they when they do they think they really do believe that they were\nWhen we when we don't believe in the late ... de dum de da de da\nDe da da da da da da da da da\nDa da da da da da\nDa da da da dun\nDun dun dun\nDun dun dun dun dun\n\n\nDun\nDun dun\n\nAnd then when you're going to know that they have given them and they're not going to be\nEntertaining I mean they're not they're not going to be and then\nWhen they were never any better than the men and\n\nWomen and then you're going to end and then and then when you\nGo in and then they come\nIn and buy their going and then they'd be da da da da da da da da da da\nDa da da da da\nDa da da da da\n\nDa da da da da da da da da da da\nDa\nDa da da da da da da da da da da da da\nDa da\nDa da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da da\nThe numbers on them and then on the on the amount of money on everybody on and on and on a on them and when I was going on around them and then they never never\nIn other la la la la la la la la la la la la la la la la la la la la la la la la la la la la la la\nLa la la la la la la la or\nThe number one number and they have ever they might end up\nGoing on on the Internet\nOr on the\nThen and then and then and then and then\nOn the\nThen and then and then\nOn the on the\nEnded in\nA bubble the numbers are going up every day\nUp\nOn the phone number and\nOwn their\nOwn everything under the\n\n\nDid you\n\nDo need to do\nAnd they didn't want to be in the da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da da\nDa da da da da da da da da da da\nDa da da da da da da\nDa da da da da da da\nDa da da da da da da da da da da da da da da da da da da da da da\nDa da da da da da da da da\nDa da da da da da da da da da da da da da da da\nDa da da da da da da da da da da da\nDa da da da da da da da da da da da da da da\n\n[laughter]\n[laughter] they they don't end up in the ... the thing\nThat you're going to\nBe an independent\nOf the\n\n\n\nThe on the other thing was that the city\nBut they don't even know that they're even though they didn't they didn't do a little bit in the\nMiddle\nOf the other members of the liberal but they didn't put them in the living room and\nThey may they may they may be that they needed the money to like each other and then there's something that they\nMay never know what they\nDid then you know they they they they they my name and then you look at the moment but they're going to go there and then you definitely made me\nMean they do they think they're gonna do\nAnd then on the machine and then there are no longer\nDon't you don't you know we didn't\nGet the\nOther day\nThat they need them and they don't need you need you need the individual and they they\nAre they going to be done and then I go\nInto the\n\nKitchen\n\n\n\n\nMaybe but\n\nAnd\n[laughter]\nI remember\nWhen you're on your on your bigger and bigger and bigger\nAnd then when the when they\nGet there\n\nOn the\nOn the on the phone\nNumber\nAnd they said one day and then all of the day and then they\nSaid that they may have been na na na na na\nNa na na na na na na\nNa na na na na na na na na na na na na na na\nNa na na na na na na na na na na na na na na na na na na na na na na na na motivated and the little money and then\nAnother and then and then then then the woman in the bank and then they end up on another woman and I know some of their money in it and then a little bit more than I Am\nAnd then there was a long standing\nOn the line and they're not they're not and then and then and then\nAnd the mother and then and then they na na na na na na\nNa na na na na na na na na na na na na na na na na na na na na and on and I guess I'm not going to work and in the middle of the ending for an interview them and then the\nNext day and then they go to them and and the and the and the number one and then and then\nAnother one of the medical center in the end of the month and on and on and I'm running on\nAnd on and on and on and on and on and I and and\nAnd they ended up and on and on and on and on and on and on and on and on the\nAmount of\n\nThey know that there was going on there and\nThey're not going to get out there that is\nThen they need to look\nAt it\nIt and it it it it it it it it is\nA little bit on the Internet and\nThen I mean are they ...\nThey did it and they did you did you get all of it and then and then they're gonna\nIt again and then and then on the line and I remember when they go in and out\nOrigin it any longer\nAnd hang in there\n...\nDid anything and then another\n\n\n[noise]\n\n\n\n[noise] Jeffrey ... get vicious present far out both on Thursday October twenty fifth seven thirty PM at the gates of heaven [noise]\nComposure Jeffrey greedy and yet this year than in the evening of exploring world music sources improvisational based composition of the country play tribute to pray cats considered\nThe first important gesture Madison locally grown ... ensemble yet vicious but bring a program of extending compositions by Brady into improvisation by members music for Egypt Dan Jabbar got out in the America far out fault with Jeffrey break any additional\nThursday October twenty fifth seven thirty PM at the gates of heaven and\nJames Madison park on the shores of lake\nMendota his is W O RTD nine point nine FM W. O. R. T. FM dot org listener sponsor community radio\n[noise]\nAnd that about concludes other voices here an eighty nine point nine FM W. O. R. T. here in Madison the time is just about eight to one that means it's time for the BBC World news headlines followed by eight o'clock buds with Brian standing state didn't\n\n\nBBC News\nIt seems on a marine Russia had sent the United states will make the world a more dangerous place\nIf it carries out its threats to polite to the treaty and intermediate range and you can't miss sons the Kremlin spokesman Dmitry ... said that if this happens Russia will have to act to restore the nuclear defense balance he's had Washington and finally to the treaty he's Jonathan Marcus\nUs position is that Russia is currently in breach of the agreement having developed to deploy to miss all his range breaks the IMF treaties limits rush of calls flatly denies it has such a treaty busting missile it's counter charge focuses on a watery rather than to meet you reach the agreement\nIs asserts that us anti missile intercept those currently based in Romania but sued to be deployed in Poland too\nCould potentially carry different warheads pushing them in breach of the treaty it also asserts that drones could have warheads fitted turning them into treaty breaking weapons to\nThe Italian prime minister just that the ... the European Commission of pre judging his government's budget a move he described as unacceptable the commission said last week that the budget plan was a breach of EU rooms under Walker report\nThe Italian government which took over in June wants to increase spending on pensions welfare and other programs but it's dead so far above limits in European Union rules and the commission has criticized the plan budget describing Utah's particularly serious known compliance\nItalian prime minister juice every country has rejected the criticism saying the country needed a new approach to stimulate the economy perhaps the biggest concern for you is it Italy might seek to leave the union or give up its currency the euro Mr ... said that there was no chunks that either would happen\nChina and the number of Southeast Asian countries that began their first ever joint naval exercises in the south China Sea\nThe small scale to only eight chips are taking part how much political last ministries significance Beijing said the exercises would help build trust in contested more intense\nAnd about halfway through the show a adventure writer ... Harris will join us to talk about his to canoe trips Thirty years apart down the length of the Mississippi River all the way from like the task good to the Gulf of Mexico\nI Will be speaking with Eddie I'm about partway through the program and then rounding out the show organic farming and gene editing they sell like there are contradictions but a Becky macko praying postal post doctoral scholar and plant and microbial biology out at UC Berkeley\nHas some different ideas so we're going to hear what she has to say or to rent out the program and we'll have all that along with the peak at the weather and a very healthy dollop of tasty music served up fire engineered UJA day later all that coming up next right after this [noise]\n\nI think you you deal with the technology that you have at the time you know and um we actually just on the subject of\nOf analog tape we did recently um get a donation of 'em some you know a whole collection of cassette tapes from historic Madison incorporated which is a\nLocal group that works on Madison history so we are in the process of digitizing you know this large collection of um oral histories that are on tapes you know and I um we have a number of volunteers working on that project which is fantastic they're\nReally doing an amazing job but um he sort of I even have to remember how even to load a cassette tape into you know into the um the ... to digitize it you know in terms of filtering over [laughter]\nYeah exactly yeah get a pencil so that you can um ... you know ...\nOr ... or ... looking for extra work because we've got a basement full time work [laughter]\nTo the Nineteen Seventy six so I Would answer reel to reel down there as well so good looking for some extra digitizing work I'm sure we've got lots of material to ... we'd be happy to work on\n[laughter] I can certainly send out an email or you'd rather [laughter]\nUm so you're so far living history project a online you've got to a collection on the green Bush and south Madison neighborhoods um why those two neighborhoods in particular and what's especially interesting\nYeah for sure so the on the impetus you know part of the impetus for this project originally was that we were approached by the um staff are working on the historic preservation plan for the city of Madison's planning department\nAnd I'm One of the things that they wanted to do as part of that plan process was to really capture um everyday histories sort of everyday places that might not be on historic registers one kind or another they might not even still be standing but they're still very important those grocery stores gas stations\nUm parks community focal points um you know auto repair garages things like that\nUm places where people congregated in that were really important to the neighborhood\nUm so that was you know sort of where we started this conversation was with does um people working on that historic preservation plan\nThey wanted to prioritize the historic green Bush neighborhood um and we also you know just um in looking at Madison history that as a neighborhood as you alluded to that does not exist in the way that it dead on before the urban renewal process happened so\nBecause I'm also people are starting\nSo we feel kinda bad we ...\nWell I mean [noise] with good reason you know and and also just from a a practical perspective um people are getting older and so those voices\nAre not going to be around for very much longer and I think that that is certainly a you know especially what we saw with the community panel at the Italian workman's club is that people really do want those stories conveyed and I'm not only told but\nSo you know sort of collected and maintained because it is a really important part of medicine history to understand what happened to that area and I think south Madison is\nThe history of that area is tied very closely to the green Bush neighborhood um history because so many folks moved that direction after that neighborhood was raised\nAnd um [noise] ... yeah\n... and self medicine has moved to a different cultural history too I mean even now it's probably one of the more diverse parts of the city um you know certainly you can you can tell that by the types of restaurants or a perk street for example in the grocery stores and things like that\nI'm sort of like a it's a history that's ongoing you you mentioned that the kids are not yet quite yet available for for check out um do you have any expectation as to who we think is going to take those things out and use them and bring back oral histories are you doing any outreach to sort of promote this and are who are reaching out to\nSo I think definitely um you know outreach is I'm sort of an ongoing process will just gonna keep talking about this project and I'm working with different folks to sort of shape their project ideas and plans going forward\nOn I think I suppose um community centers neighborhood associations um\nSchools you know different sort of groups or you know as far as we're concerned individuals who just have an interest in 'em documenting the history of their block or their street\nUm you know I think that the playing field really is wide open and we've had a lot of interest you know I'm from\nNeighborhood associations is you know particularly neighborhood associations right now um but also other organizations and institution so\nUm there's a lot of conversations that are sort of in the early phases of um projects really starting to take shape and we expect that the kids will be checked out by um people who\nSort of have a project plan in mind um and maybe every once in a while there is somebody who wants to do a one off interview with a family member or I'm with a neighbor who\nThey feel um would be a good storyteller\nSo tell us um some of the some of the details if people want to see the archives how do they find that on the Web and then a as if people are interested in checking out a kid and learning more about how to do these kinds of oral histories what are the opportunities that are available\nYeah for sure so there's a number of ways to get involved actually\nUm I Would say that a good starting point is Madison living history dot org\nThat is the website I'm where\nI'm that links to our database of um materials so that's where you can find the the collections that we have going so far and we're new materials um are posted\nOn a slow at rolling basis so um yeah that doesn't get updated super frequently just because it does take a lot of work to get one of those collections off the ground um and\nThere are yeah I Would say ... do some exploration of that website um there's an email address community at Madison public library dot org um if you have an idea for a project to plan or are interested in volunteering with the living history project\nI'm and would like to get that process started that's a great place to start\n'em and then yeah and then I Would say just keep an eye out we will um post about the kids when those are available on the public library's website as well so Madison public library dot org I'm keep an eye out there as well for an announcement about when the kids are actually available\nAnd you mentioned some workshops are training sessions to\nI'm so we are aiming for once or twice a year we'll just have kind of a big on boarding workshop where people can come I'm the first one that we did was in December of twenty Seventeen and\nI'm Troy Reeves who is actually a fantastic um you know local resource around oral history he's the head of the oral history program at um U. W. Mattis and um for their archives their university archives so he could um came in and did an oral history one oh one presentation for people that are interested in learning how to conduct this kind of interview\nAnd then um yeah so the workshop kind of looked like oral history one on one plus\nI'm a quick rundown of how to use the actual technology that we have available to folks and then um talk about how to than um share that material back with the library if you're interested in doing that um peace to make items publicly available\nAnd is there any connection with the students vertical society here and there are ... are the cross collaborations with them yeah\nWe're actually um I think what is anything about this is that it is um you know we do participate in collaborative\nCollaborative efforts around the city so um we worked with a Historical Society on a one story gathering events which is sort of a you know you show up with reporters and I'm record short stories from folks about a specific topic or event\nFor us I'm the most recent one was the Madison reunion that was held on 'em at the memorial union on campus in June so um we worked with the university archives Wisconsin ... society um and I'm a couple of other\nFolks to bring a story gathering station to dad event\nAnd yeah so there's definitely on open you know communication open dialogue um cross collaboration when the um historic Madison donation came in you know we made sure that people were aware that we had that material so that in the future you know if they want to cross promote that I'm collection they're able to do so\nAll right we've been speaking with war game and more from the medicine public library you can listen to the digital archives of living history project at Madison living history dot ORG or thanks for joining us thank you so much Brian will be back with some announcements a look at the weather in song of the week coming up right after this\nW. O. R. T. thinks it's listening sponsors and then you W Madison division of continuing studies presenting community arts organizers Mariel guard you will and Sarah Marty on friday October twenty six for a conversation about the life and work of community arts advocate Robert guard\nThis free event of the central Madison library includes community arts project and music performance\nInformation available at go that whisk dot edu slashed Wisconsin dash ideas\nWhat may calling six eight eight minutes email three six to ...\n\n[noise]\n\nAmerica all the way down the river and was that was that what you expected when you started the trip\nNot at all [noise] first of all it's only partly true most of the river is pretty wild yeah there are a lot of there's a lot of barge traffic that you run across but most of the river until you come into the ... the periphery of\nUptown here in here in Wyoming major most of the time the barges you run across the board is all the way up and down from Saint Paul don't go down to the Gulf of Mexico but they don't run like ships on like a like\nScars on a highway they're they're pretty well spaced\nThey are extremely [laughter] street mean danger of course because of the way that they create and partly because they can't they can't feed you often and they can't stop even if they did [noise] so you're out there in\nIn a danger zone when when you're encountering the barges on the first trip halfway through the trip the first half of that first trip\nWhen a ... I just got out of water and waited for the barge to pass it wasn't until later on I figure out how to handle the weight but it's not an industrial river\nWe think of it will because we live in cities and the river that we mostly encounter that river that passes through our town whatever our town but the river itself is pretty wild and once you get past Saint Louis\nHardly any industry on the river at all until you get to Baton Rouge\nSo when you started your trip back in Nineteen eighty eight more to the challenge a there was it was you know some fears about how you might be perceived as being a black man travelling alone a on this river\nCan you talk about how ah how what\nWas your experience uh did you encounter racism on that trip and what is your expectation now that you're planning to do this again you think things have changed in in what way\n[noise] [noise] well it's not that I'm planning to do this again I don't if\nYou have you done this so you've done this little girl was ... years ago so tell us about tell us about how\nThings have changed a ... along the river since since Nineteen eighty and what did you discover your second time a canoeing down and\nLet me talk on the first one first the first question first the first part about the races attitude that I may have encountered on the river I did not [noise] and that was one of the things that I founded me most or maybe didn't have found me because I've traveled in this country a lot and women that second trip\nWith not only to sort of encounter a different America and look at the difference between\nThe river in Nineteen eighty five when I took the first trip and Nineteen\nOr two thousand fourteen when I took the second trip\nBut the difference in in perceptions of what what what would be different with a black man in the White House for example\nAnd what I discovered flip one trip to is that the United states is a pretty cool place because you take politics out of the conversation and people are really great I have one encounter on the first trip that with a little bit racially risky\nAnd nothing nothing whatsoever on the second trip and the second trip reinforced my conviction that Americans individually not in a political groups not in tribe but Americans individually are fantastic especially\nRiver people they will help you do anything you need done while you're on the river and I transpose that to the rest of the country to say that Americans are were great what else what else can I say\nWhat other what other changes between Nineteen eighty five and a team or along the river or do ecological um land use change is I mean what what did the river walk between this year\nThe biggest change the biggest changes that are and it's cleaner and know how can it was in Nineteen eighty five [noise] and in a certain mind because\nConscious made been made conscious of the river and have actively doing things to clean it up well water is cleaner [noise] but the number one huge weirdest environmental disastrous thing\nIs the Asian carp and not only are they bad news for guys and canoes because they jump all around when you least expect it and they want to slap you an ad and knock you out of your boat\nBut they also have no natural\nEnemies in the water and so what they provide data on\nIs completely vulnerable and if given half a chance and they are very gracious and given half a chance they will change the ecosystem of the Mississippi River so we've got this huge environmental good story on the one hand and there are certain mental disaster on the other and the river's cleaner\nAnd yet things like the Asian carp\nContinue to make a should make us aware how fragile there the rivers ecosystem in [noise]\nNo I ... one of the things I'm also interested in what in in terms of ah the the human communities you you pass through a on the river um how would the economics changed with those communities are they are are there still thriving um and how was what's different between five and twenty fourteen with the\nAh the cities and villages and towns you pass through\nOr nothing has changed I mean there are still some economic fragility along the river [laughter] there was a Nineteen eighty five [laughter] what things are fairly fairly bribery vibrant as well and\nPlaces like Rock Island Illinois yeah there are a huge swath of decay and maybe in places like Quincy, Illinois as well but mostly what you see from the river is not that stop you've got to get off the river is a good way to encounter\nAny kind of economic depression along the river most things have not changed a lot more development up north and there was the first time go north of the between the city for example in places like a saint cloud when there's a lot more houses on the big houses on the river done that were\nBefore but mostly the river has not yet we have not changed since Nineteen eighty five\nAnd I understand you had some encounters with us from an indigenous Native American tribes or how did that change your perspective of the rivers what were those encounters light\nIt underscores just how Stoller coal oh historically important the river is to America\nAnd I spent some time racing getting collecting ... wild rice with some Ojibwe is up in Minnesota\nAnd they're waiting they look at the river and its spirituality or something I had never considered before the river to me it was magical the river was beautiful but I never gave it a spiritual component until I spent time with the Indians\nIn northern Minnesota and it's just underscores what\nOften is missing in our communication or discourse about Native American life and something I think we should we should examine more closely for the time I spent with the Indians there and elsewhere\nWas pretty special partly because of that spirituality know it gets overlooked so much\nIn in addition to the book you know have a film tell us a little bit about that until it's about ... called revert to the heart you'll be screening at a next week October there'd be in the morning here in union so\nUh and I'm\nA little bit of how this all came together and and ah who do who shot it yourself did you have a group with you and how did that all work out you\nKnow I have a camera crew and [noise] it was absolutely fantastic experience because these guys [noise] the guys who came along or are some of the most reputed nature photographers in the country\nAre you ready for example we lived up in ... and John ah [noise] ah skipped ah skip hobby lives in Texas\nParker brown who was my found guy John ... who lives in Maryland and these guys this this is a team of expert major photographers and they came on board because of the nature of component of the um the trip\n[laughter] convince them to come on board I Do not know [laughter] I think really they just want to work together\nAnd it was a fantastic experience and the film recounts in\nNot intervene fashion but in a way in real time but also in conversations with people that we ran across along the way it completely spontaneously because we didn't have enough time or money to set things up I had a time\nAnd that's what the story is it's about America and the character of America food that people don't you meet on the river with a lot of beautiful shots and it's absolutely a stunningly beauty\nAll right we've been speaking with Eddie Harris a writer and filmmaker he'll be answering questions about his travels at a special screening of this film river to the heart next week October thirtieth at the Marquis in union south thanks so much for joining us on the eight o'clock buzz Eddie Harris\nGoing\nAll right we'll be back with a Rebecca ... praying from the University of California Berkeley coming up right after this\n... ... and ... in in ... and [noise]\nThis process happens spontaneously in nature and I think that there's a difference there\nUm between something that could occur in nature and something where you're adding DNA from a different organism no to me DNA is it's ... and ... and and if you're adding a little snippet of a.'s teach season genes from\nSam in into a plant\nYou know I I care much less it out where those ages tease season just came from than I Do about the effect that they're going to have in the plant but I understand that to a lot of people that's a really weird idea and and that's okay\nBut I I think you're right that distinction that I Am trying to dry erase that there's ways to use credit for where we're not doing that we're not adding new DNA were just making a tiny and changing the DNA that could actually be really helpful for the goals that sustainable agriculture\nAll right we've been speaking with biologist Rebecca ... from the University of California at Berkeley thank you so much for joining us on the eight o'clock but\nThank you for having me\nAnd that wraps up this edition of the Monday eight o'clock bugs for October twenty second to twenty eight teen I'd like to thank our guests more uh Damon more\nFrom the Madison public library author ... newest and filmmaker Eddie Harris Rebecca ... from the University of California at Berkeley\n... produce the program and did his usual a great job of winding up all the terrific guest you heard here today and help keep everything running smoothly down here at the station DJ Day later home to the mighty W. or to sound bored and selected the musical interlude you heard throughout the show\nJonah answered our phones you can always call us at six or eight\nTo five six two thousand and one with comments or suggestions this is W O R T eighty nine point nine at Madison Russell live streaming and pod casting at W. O. R. T. F. M. dot org and we're on I ... my name is Brian standing global revolutions is coming up next right after the insurgent radio kiosk\n[noise]\n\n\nThis is the insurgent radio kiosk for Monday October twenty second white woman mistakenly believing she was\nCause police on a black boy\nI'm children's book author genial and and this is a civil liberties minute with ACLU attorney bill Newman\nRecently in Brooklyn New York deli fifty three year old white woman dial nine one one and report it to the police quote I was just sexually assaulted by a child the video taken inside the bodega show something very different what happened is this\nA boy who is black and nine years old\nDressed in his school uniform and wearing a backpack was inside the store\nAs he turned to talk to someone his book bag brushed against the backside of the white woman Theresa Klein who then called the cops causing the nine year old child and his friends to burst into tears thinking he was about to go to jail\nIs kind mitigating the situation a bit in a TV interview later\nSaid she was sorry this incident is part of a much bigger story\nToo often police departments are used as instruments of oppression for biased callers a long time Flatbush residents who recorded the commotion outside the deli said quote you think something like this only happens in the south but it's all over the world\nYes it is it's a country wide phenomenon and a countrywide disgrace\nThe civil liberties minutes is made possible by the ACLU because our children's freedom can't protect itself\nThe kiosk brings your commentary from members of the public all opinions expressed are the speakers have an idea for your own to make commentary email kiosk event at W. O. R. T. stash FM dot org and put commentary in the subject line [noise]\nToday's action calendar free presentation addressing plastics in the great lakes is scheduled for this evening from\nSix thirty to seven thirty at the sequoia library forty three forty two okay boulevard and Moser from Wisconsin water library at the EU W's aquatic sciences center will describe why plastic as a serious threat to the marine environment navigation\nSafety the economy and human health the good news is that we can reduce the volume of plastic that ends up in the lakes for more information phone to six six\nSix three eight five the YWCA Madison is dedicated to the elimination of racism and the empowerment of\nWomen to fulfill this mission the YWCA Madison provides race and gender equity programming to create a more adjusted inclusive community job training and transportation to help people find and maintain jobs and a safe affordable housing an emergency shelter for more information please call YWCA Madison it to five seven one\nFor three six or visit\nYWCA Madison dot org word is looking for an alternate weaker volunteer receptionist on Tuesdays from eight AM to news we also need a volunteer weekly receptionist on Tuesdays from five thirty to seven pm for more information email volunteer at W. O. R. G. F.\nM. dot org with volunteer receptionist in the subject line or call Glenn at two five six two thousand and one is leaving a message please provide your phone number and email address\nThe insurgent radio kiosk welcomes your commentaries on subjects of interest to the W. O. R. G. listening community if he would like to do a two minute kiosk commentary visit W O R G dot org slash kiosk commentary the kiosk is available online at W. O. R. G. F. N. dot org slash ski\nUs this has been inserted radio kiosk heard weekdays at\nFive six thirty nine AM and it\nTwo PM was engineered grade ... submitted announcements at least ten days in advance of the event at W. or cheat dot O. R. G. slash kiosk slash announcements [noise]\n\nEighty nine point nine social gathering at the harmony bar and grill on Thursday October twenty some six to eight PM along with the harmonies beverage and teach what do you live\nMusic ... rounds starting at seven thirty mix gender sex is self described as a homegrown bluegrass from the east side of the eighty nine point nine social club stretch great opportunity for war volunteers to hang out with one another the club gatherings are also a great way for members of the community to me\nI Love ... volunteers and get a better sense of what what is all about join us for an eighty nine point nine social club gathering at the harmony by\nOn Thursday October twenty ... from six to eight PM keeping it in the community for over forty years this is W O O T eight or nine point nine that they're not a simple W. or tea FM that or [noise]\nThe Wisconsin union directory and the greater Madison jazz consortium present the conclusion of the twenty Eighteen and did you use yes duty with medicine music scene heavyweights immigrate on friday evening November second at the place circle\nTo to their ... immigration trade dynamic cruise and unrelenting calling rhythms comprised of ten local musicians immigrate delivers the worldly jazz rock sound was swirling repetitive guitar pattern the funky\nBaseline and the series because she knew sections horns and piano [noise] it was a play the final installment of an indigenous jazz theories that to the memorial union place or go on friday evening November second at seven thirty\nYou are listening to W. O. R. T. eighty nine point nine FM and there'll be or tea and found that or\n[noise]\n[noise]\n[noise] uh\nNo\n\n\n[noise]\n\n\n\nGood morning welcome to global revolutions my name is Dan tell no co host here with Martina ... and they were going to bring you three hours of great international music this morning in fact we have two different bands local bands coming into the station today\nAnd uh stay tuned for some a cool live music we got a you'd vicious will be here at about nine thirty\nAnd at ten thirty we have the kiss ers are both have some great uh projects coming up\nWith some a very special a live events and are there and talk all about 'em and play some music from them um meanwhile until about nine thirty when we get your vicious set up a\nThey're lazy you know from what I see the early Nineteen nineties perhaps uh from the film time of the gypsies or an emir ... chip film he teamed up with a ... to ...\nFor a few films are also notably a film called underground which won the palm door it can one year\nAnd a firm that I'm recording is where we get our intro the music or color sneak off each week that we play for you um before editor lazy we heard ... from\nUh his most recent album three letters from Syria bow\n\nFeaturing the vocals of Rocky Top ... passed away a few weeks ago or got played a a two more tracks um\nAnother one of his a well known pieces is called ... by um which is a a reworking of the lead Dorsey hit from New Orleans or the Dorsey recorded a tune called ya ya in the\nSixties and or just for the fun of it let's play the lead Dorsey version and or something you don't hear too much on the international folk show a little bit of a\nIt's a sixties pop from New Orleans and then you can hear back to back ah how groundbreaking pitch a adopted it and put it into the film underground or her go door see ya ya\n\n... and\nThe and then you have the bomb I yeah I\nI\n[noise]\nJob I Know that you know\nDidn't I Know we and my dad\nIn the Don Don ... although in ages gum\n[laughter]\nThey don't make me\nKnow maybe one of them\nNew um under\nNo I was reading game non non disease in my yard and yeah\nLot of the names I Know\nIndeed Don Giovanni though and I do but the gum Maine\nKnow made me love him\nDo they mean well you\n[noise]\n[noise] [noise]\n[noise] [noise]\n[noise] good and\nIt's just that\nThe enemy doesn't touch the ball\nThat's neat that's neat that's\nAnd that's\nThe U.S\n\n\n[laughter]\n\n\n\n[noise]\n\n\n\n\n\n\n\nOh like your dishes in the studio and they're going to be with us in a few minutes we just heard a\nBack to back versions of ya ya the original ... a piece from the Nineteen sixties and then followed off with a groundbreaking Mitch ... re interpretation with the Balkan brass band I ... from\nThe soundtrack to the film underground Nineteen Ninety\nFive and a while we are getting set up with the dishes or keeping in the theme of artists that I've seen recently on stage I'm gonna do a couple of filters here we have a right to go to the American\nCivil virtuoso around here a quick piece for her and then we're going to go to a guy named each one\nPop a nickname God Jacques who is the uh the\nMusical band leader of the Hungarian national folk dance ensemble and they were\nIn Chicago a weekend I happened to catch them too so we're going to hear in a a a chance of any of the little tune by him so he was right to gather followed up by gotcha\n\n\n[noise]\n\n\n\nSo these aren't literally covers their their re interpretations\nOf of things that already existed or perhaps a new materials some new compositions yeah there was a little bit of new material but\nIt's it's mostly adaptations of stuff that was already out there and you know been there forever and survivors and okay you'll continue to inspire musicians or other people\nThat we should mention it's part of a program of the Madison area greater Madison jazz consortium so they provided some funding this year to help\nSupport local jazz musicians in creating a new bodies of work and so this is\nProbably the one that ... of the projects they find it may strife for this to the edge of what you would consider a jazz project but um it's very exciting and that sort of widespread cat stayed with his um big band he you know some of his pieces are or Castro um and he really\nI'm inspired us by taking folks are says and ends really expanding them through the use of his like jazz orchestra\nAnd uh so uh we're going to play a track from one of your uh CDs and I was asking you before you started I held this relates to the show on\nUh oh yeah we're we're going to play this actually on at the concert is gonna be the first thing we do and it's I think we've been doing for a few years now but we've expanded it\n[laughter] [laughter] the seven ... which is um one of the first ... composed specifically for this band and also the first one that I'm included a chance for all the musicians to improvise so you'll hear a little bit of an improv is a tray work in the middle of the tonight on Thursday it'll have even more layers\nAnd the Roman and Sarah meant oh we gotta you gotta love the Thurman okay so we're going to hear ah the tuned the seventh and ... from an album of the same name by ...\n\nDa da da da da da\n\nDa\n\nNa na na na da da da da da da da da da da da\nDa da da da da\n\nNa na na na\nNa na na na na na na\nNa na na na na na\n[noise]\n\n\nOh but uh you'd vicious from the southern shore meal and example uh\nAs you said of a expanding what you do live in on on recording and in terms of improv and things are yeah trying to you know try to get us out of our comfort zone usually\nJeopardy and breaking people out of their comfort zone difference so that was a five minute piece and you said you're expanding it so ... what is is probably\nTwenty five and a half hour good snow it'll be like it'll be a little longer than that but he like five thirty [laughter] they're just like new little tiny bit of new material in the middle but that game and nice and we're talking this some of the show meal because it's in a seven rhythm which is kind of very Balkan\nYes it is unusual for ... because so many folk dancers in this community loved their Balkan dance we thought why not put something together and so I've been for them [laughter]\nExcellent okay so uh let's talk about the uh the pots and pot lizards and bowls and mixing bowls and um yeah I got whatever that toy is over there\nWe have like a Fisher Price dizzy Bugsy box rigged up to a distortion pedal okay I'm\nGoing to emulate a box of rocks though it's an electronic box correct acoustic boxes rocks okay uh I've got a bunny on it and uh well phone dialing the spin anything and I thought that a lot of it was all about what about that were so many more\nAnd those are the thing that you spin and the other things spin and there's I think the pictures and um dogs and there's like a little ratchet type thing you know ... that's\nA tell you what are we going to do is ask you to move the chair that the Amazon closer to the Mike\nOh I see okay well um there's a there's a there's a there's a plug over here on the floor if you want to um do you want to re plug it I got to plug over by me and a\nMeanwhile somebody say something somebody tell a joke um if I were talking about Fred cats earlier okay another fun fact ... okay uh I'm In the movie the sweet smell of success and as Tony Curtis and Burt Lancaster oh yeah it's a it's based on um\nWalter ... career and um\n[noise] it's a great film okay Clipper no doubt throughout the dialogue and it's kind of crazy anyway so part of the plot is um [noise] love interest of um the\nUm sister oh Burt Lancaster who is Walter wind chill plays in Chico Hamilton's band\nOkay which also at that time included fried cats okay so you get to see him on on on the silver screen okay very briefly okay I think he has one line where\nI'm a woman a costs him coming offstage and ask similar process\n\n[noise]\n\nBut ... then the last\n\nAnd [noise] and\n\n\nCan\n\nDo to protect the group [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n[noise]\n\n[laughter] [laughter] [noise]\n\n\n[noise]\n[laughter]\n\n\nAll right so ah Fred cats a sort of a semi inspiration for this Thursday concerts\nSixty years ago called folk songs for folks bishops will be doing our own take on far out for me it's like the state department\nOkay and it's free and it starts at seven thirty correct All right well thanks a lot the vicious they revolutionary You're welcome and you'll see the W. O. R. T. eighty nine point nine up in Madison Wis are sponsored community radio and we'll be back at you in just a minute\n\n\nSupport for global revolution provided my neighborhood people serving certified kosher parents Jewish American delicatessen plastic Mediterranean\nAnd preparing fresh food made to order as well as catering events Idaho welcome students and community members of all backgrounds Adam a neighbor had cable is located at six one one Lincoln street open Sunday to Thursday ten AM to eight PM and friday Kenny empty two PM\nRegistration is now running for the W O R G nine in temperature in them and sponsored by Mendocino Central's somebody already will take over dream lanes once again her fears that six PM but we made it easy to bully or gee this year\nFor instance you allowed to form it nobody or do you get on board\nAnd then turn it in with your registration fee forms are facing the lakeside Bruce Willis street to no need to collect pleasures W O R D D jays will be rocking believe will lose compete frightening and three skill levels you don't need to be wherever the when ...\nReceived the sci fi he plays in with a ... or do you do go and find tickets to the to your fries rapid more tickets are available for purchase of the events bowling a strike rabies in front of free\nBeverage after bowling enjoy\nThe movie version and the prices are ... homes were thirty five dollars in for the proceeds benefits there'll be more community radio\nMeant to be eight or nine feet just turning it on Sunday for six PM Lisa do shoes and she will be [noise]\n\n[noise] yeah it's eight nine pin taps tournament we had the look that up but it sounds like a lot of fun ah I'm of course here in the studio thanks a lot the dishes for stopping in this morning or don't forget at ten thirty to half hour from now we\nHave the kids are stopping in again to tell us about they're a big show on November eleventh\nWhat a live music this morning I'm Sorry I'm missing a [laughter] while you're here now I hear now as an ... what are you got for us this week or what do you did you see the first the beautiful snow are they a year or the latter day they're not in our neighborhood lesser for\nOh all three or four minutes yeah [laughter] as a transient snow but and the window that was something yeah so what is it there was a tree in our neighbor's yard victory\nAnd it knocked all the leaves off in a half an hour\nHigher tree was denuded it was it was amazing yeah that was that my my wife and I were up in ... county we took a nice walk during a brief\nA occurrence of snow too and we also noticed that a lot of the leaves came down very very suddenly all ... All right All right well I Will describe the mechanisms behind that interesting first snow shortly but if you\nWant to have a look at something if you're near a computer this morning and want to have a look at the graphic which all mentioned just briefly to this particular morning at the\nUs goes sixteen water vapor image of North America it's on the W. R. T. station website forward slash weather on the weather page of the website there's a link there to the graphic [noise]\nI'll talk about that in a few minutes but if you missed the first snow that we had that was actually a week ago Sunday you may have caught this one the past Saturday morning when we were talking about it was beautiful mid morning this was behind an early day coal final passage of very impressive one that occurred around eight o'clock here in Madison\nYou might have noticed that just by Iraq at that the winds started to make is they veered northwest early and then came up quite suddenly at the early part of the morning of the sudden on Russia wins a was more or less striking depending on where you were\nA and if you had a barometer you might have noticed that it was by owning up words through much of the morning at two to three Mila bars per hour which is quite a rapid rate on upper arm or\nAs much denser Arctic Air came plowing forward out of Minnesota\nTo do\nBang bang bang up\nAt an animal\nWomen and then it\nOwn body than they\nDid not know\n\n[laughter] I Will\n[laughter]\nWe're all\nGetting late in the world\nGetting some mid to late ...\nGives vein is a flash in the ... the ship fool of vice ... fold since ...\nAnd then when\nYou are used to give ... to ask you about my rock rock by\nYour voice just to be really don't know if he is which probably\nSpend a lot of the you\nKnow ...\n... ... ... from lake in type ... rock rock rock rock rock five\nFour legs in them try to eat food type ... they with those ... ... ...\n... ... ...\nYou don't even give him in\n... ... is ... Kim\nWell he's getting ... means that they'll snow\nOr rain but we'll\nGet new\n...\nWaiting for the ...\nOn\nThe road or\nGive ... ...\nThe shoes of buddies who food for ... read ... la la\nLa la\nLa la uh\n\n[noise] while you're kind of lonely Batman cheap Batman [noise] ... no data that off she paid [noise] today is that I thought it was it too much to the [noise] on the ...\nOf course 'cause he Batman the bad men do not like that\nIt was a pro bono in bars with all the ban on adult that I used to be a lot of egos man and a ... and are you doing buddy don't dump it but she had been\nOn the ... you know again the last word you used around that men threaten our ... to ... than\nThey used\nTo do to Dave Dave do that\nIn the race to throw the in the garage little girl in the ... on the benefits of Adam\n... no not ... okay look in the\nBad mouth or ... or whether to several months and\nThen some more of\nNice to go down to demand the manager of gone from day to die for your\nSent samples and go\nLady lived on\nThese terrorists around them mentally blonde joke on my own I live for\nThe money and\nThen some boom boom in the ...\nLeather both guys I mean you\nLearn the bone\n...\n...\n\nIn\nMiddle\nBe able to do the\nDe de de de ...\nThe\nSame they end up at the end of trying to deal with\nDa da da da\nDa\nAnd a and then a few of the songs we'll start with ah some quotes from letters and diaries from Wisconsin nights and others\nYeah I I was just remembering one of a World War one or references that I think some of us know as a political wall is all\nA much like the greatest war has the genesis than in World War one and what happened to her father's protect or protecting its bother sort of interesting that the pop culture has been informed by all of even though we have a rock and roll showing a story\nYeah right and and of course being Floyd is an English band and I think the English\nUh I mean there there's many countries that were affected deeply by older one but I think in England it was a really big deal if I'm not mistaken I think more a British died in World War one even in World War two um if it was a big it was a big sacrifice for them and so it's really really permeates their culture\nAnd I would say that the greatest war um that date November eleventh is one hundred years\nTo the day of the armistice the ended World War one it was ... you're familiar with the term the eleventh hour that that came from World war one because the armistice was the eleventh hour of the eleventh day of the eleventh month um our show however will be later than eleven AM\nUm uh just just the you know um but um [noise] uh so\nWhat I thought we would do today I'm is play a song that so I ... a part of the show was I wrote a number of new songs to to go with it and I'm so this song is um I learned about a a woman in ...\nAnd I learned about her by going to the Wisconsin veterans museum which currently has a a an amazing exhibit there called beyond the trenches\nYou can be better if you go there if you are downtown and it's right there are just across from the capital right\nThat's right yeah right on the square at at basically state and uh and the capital\nAnd it's a it's free to go in and um they they have they're standing exhibits but then they also a temporary exhibit and that's what this this one is and uh it's it has pictures and stories of a number of Wisconsin nights who were in the war and a lot of them are are soldiers but not all of them\nAre ... for example is a nurse\nAnd she grew up on a few street here in Madison and uh went to nursing\nDegree or a at a nursing training at Madison general which I think is now murder or emerged with marriage at some point\nAnd um [noise] and one of the points of the show was a you'd asked me a great question last week or whether you need to know about World War one to be able to enjoy the show and I thought that was a great question because\nThe answer is a pretty emphatic now um you don't need to know anything about will grow one all you really need is an appreciation of GOOD Music and thoughtful lyrics\nIf I Do say so myself and but it's not just me as others have been some some amazing material and\nAnd just a an appreciation for all of the the range of the human experience\nThat happened with this there's no courage there's there's tragedy there's hope there's despair there's optimism sense of foreboding all of it ah encapsulated in this conflict which really speaks to that time and of course to\n... you might just say humankind um all the time [noise] so um so I really wanted to help build a connection and make it not this\nUh I I once said to somebody else during a shovel or one and she said you know what I think of when I think a World War one I think I Want to go to sleep [laughter] and and our experiences you know in history class in school mates for some of us that may have happened right because history can be made to be very boring [noise]\nUm but it's not boring because it's it's humans and it's it's our lives and so I wanted to try to make it less of an event of older one and more of people's experience during that time and yeah and if you think if\nYou're Wisconsin resident than have roots in Wisconsin is probably the story of your forbearers or a great great or ground or whatever parents'\nYeah yeah if they survive off and your grandparents and if they didn't survive it's their your uncle or great uncle um and are are great aunt and things like that um which is actually how I learned about Helen philosophy I mentioned the veterans museum got a lot of information that's way too for great nieces\n[noise] uh uh wrote a book called finding Helen and it's they collected her diaries and her letters home and a bunch of artifacts that they had and they assembled them all in this in this book and so you get this uh amazing view into her life\nA revolving around World War one\nUm and she actually died a few years later after the war of heart condition that she had 'em so hence it's her great nieces writing the book\nUm and it's a I there's this big picture over at the at the there was busy and that was certainly using the show and I just as soon as I saw it I was just\nUm I was really taken by that photo really drew me and and I really wanted to learn more about her and so my wife and I pored through this book or one weekend up at a cabin in family cabin in Tomahawk and uh and\nAnd they wrote this song which is based on her words her experience I ... you might say modernize some of the language\nI'm but many of the words in the song or or or directly from her and I'm not going to play this today but maybe on a later show it's actually in in the ... concerts can be part of a medley a and the second song or I called the best that you can and it's based on a poem that she wrote called my creed so it's actually her words set to music\nUm so so keep tuning in each Monday [laughter] and you can hear that um but today we're going to be the first song of the ... which is really just about Palin and I think in the first person because I feel like\nYou know I'm trying to to build connection with her and I'm hoping that that can be to to others as well and uh so the title of the song is is the happiest mortal\nAnd the day that she leaves for the war she calls herself the happiest mortal in town\nI'm so here we go to Kevin sure maybe about now ... ... ... ...\nMy mom when all my heart [noise]\n...\nGrade or to do my uh [noise] oh I\nThought\nOh now I Am a nurse\nAh my oh my God\n\nAll due to re and bam [noise]\n\nRegina du ...\nThe ...\nRumors spread it all\nThe\n\nWell the last ... non they own train\nStop ... and\nYou see in a hurry to grow our way and\nBarred\nFrom there and be\n\nBoys came in by al ... or\n... or ... oh my God what a lot and\nWe\nFinally size ...\nTo ...\nSays the a K\n... on a on a small\nTown and uh they go\nTo all of us\nAnd\n[noise]\n\nMm [noise] [noise]\n[noise] [noise] [noise]\n[noise]\nAnd yeah so that's from the greatest wore a show that the cancers in several other bands or ... or putting together for armistice day be a hundredth anniversary of the end of World War one telling the story in this case of a nurse or from a few streets so\nIn the bath or by then then ... was the blood in\nFire\nAnd having a long way\nI kept my job but I Love the cord around me\nA little higher\n... na na na na but\nWhen I Am in mind\nThat little ... and a lot ... John [noise]\nThe guy that I never remember a worse than dying\n\nWell now let me know all the money down the\nStreet\nFrom the green me you know a\nDamn ... ... ... ... guy on two legs you know more well say Matilda store me\n[noise]\n[noise]\n[noise]\n\nWell that goes back to the current bald alone\n... and they ship them back to Australia [noise]\nHarmless like glass on the line\nDown saying oh no around around here a\nLoan and da da da da\n\nDa di ... by on line\nAnd bank right\nNow ... waiting for me\nAnd mourn\nAnd really [noise]\nAnd I\nHad a ball the\nWho has that carried down on that guy\nWage hero\nBut no cheers\nShow students that are there things the way [noise]\n... April I sit on my porch and I are the re ...\n... ...\n... march for real of a in the during\n...\nTime\nNow than than Saddam or ... or ... or not and more and I have um [noise]\nMean what are they are marching\nGuy myself\nThe same question\nAnd a lot of um thing\nAnd they all men\nStill answered the phone [noise]\nBut here and\nThere are number fewer\nNow that no one Bill Maher and all [noise]\nBall things ... la la la la la\nLa la la la [noise]\nAnd maybe\nAs a kid in school [noise]\nAnd ah I mean [noise]\n[noise] [noise]\nWow tricked rendition of that song welder no thank you\nYes Sarah were coming to the end of this installment of the greatest Warren W. R. T. on global revolutions and went to a bank or Kevin Kevin for coming under the gun and hope to do this again a couple more weeks\nYeah that sounds great marching now we really appreciate it much yeah so just to reiterate if you want to learn more about the events you can go to the greatest war dot org and also there's be sure what the Barrymore or be eleventh the November to serve you know weeks from now yes that's right and we'll be on your show\nNext the next day or two more Monday's before that show will be on each of those All right so yeah stay tuned for other great music from around inspired by World War one we'll see you next week I okay see my gene thanks\n[noise]\n\n\nNovember eleventh nine to ... the greatest war world war one Wisconsin and white film at featuring the original music ... son Michael darken November criminal under biker independent sources are performing in front of a giant twenty foot [noise]\nVideo laws protecting photos and phone from the time [noise] original show is for one night only for greatest for November eleven twenty seven PM at the paramount theatre in Madison [noise]\nWeren't so mostly in the middle of the British courts are [noise]\nThey\nShut down the word spread the word to be ...\nWell well ... ... uh what are we going to come back to the over ... rural\n\n\n[noise]\nOn a\nMenu and I\nDa da da\nTo do to the group and\nThey do really really been introduced to do to be\nAnd ah just catching up on the counter we talked about one of them that's happening and will tell you of other things that are happening around this area of the night as every Monday we have David Land does Monday Night kitten music over at the harmony burn girl starting at five thirty also tonight uh Brian through your\n\n\nOr whatever\n\n\n\nNa na\n\nNa\nNa\nNa\nNa\n\n\n... ...\n\n... ...\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n... you're in the movie\n\n\n\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\nAnd then next to access our daily one day October twenty seconds or so I mean the how your own W. or TDY nine forty nine I found [noise]\nI'll be sharing some music that I feel captures the confusion was barely many of us fuel regarding the condition of our world music may not provide a way out of here but at least we will change from relief white rocking out\nAgain that theory and on the next to access on Monday October twenty seconds seven PM you're on W. or to\nUnionize point in time I fail [noise] the excess ours is W. orgies commitment to to be on with these express some exercise our member station ... programmers for foreign threats\nTo find that the challenges have come with tremendous support from the EU award pollen tear listeners sponsor and most of all a vital part of the W. O. R. T. family thank you [noise]\nOh right so yes it is a global revolutions here and do all your AT T any nine point nine of them in Madison, Wisconsin we do a show or world music or we try to bring music from different corners of the world so let's see what else do we have um the dark and for the\nI'm\nGoing to do a little bit of music from the Caribbean\nOr so some are good too so from then foods and then also some stuff from\nThis decade starting with the great calypso rose recorded awhile ago Rehman Coca Cola\n\n[noise]\n\nThey\n\nLaundry and saw\nOne time the wrong guy goes\nNa da da da\nDa da\nDa da\nDa da dun\n\nDun da di da\nNa\nDa da da da\nDa da da da da\nDa da da da\nDa da\nDa da\nDa da\nDa da\nDa da da da da da da\nDa\nDa da da da da da\n... rather than\nOnes that do they need to do to reduce the\nThat land to bed right but the gold color\nNa na na na na na na\nNa na\nDa\n\n\nDa\nDo you do a lot to do the dirty ...\nJesus theme all\nI Need to say a thing about it and your red\nThat them in a better\nJohn I live on\nThat the man nods burst sir\nMe that the man not bad\nShot a lot on the [noise] that\nThe man on a\nShot at a lot lot only\nGet if\nYou will about voter issues in\nThan you\nAnd you better not by\n... do\nVery by\nSigned a law on\nOther man a class a\nShot at several of a lot on\nMe\n[noise]\n\n\n\nPiece of paper\nFrom Latin America by fast\nChina's lot on\nMan not pass 'em\nNot pursue\n...\nNot pass 'em\nA shot at federal of a lot on me a lesson\nPlan my credit\nChina's a\nSure that [noise] ... ah\n\n\n\n\nIn Nineteen hundred forty five minute was won by ... to ... or ... ran\nAway and they're waiting there in Thailand today the more by the the I Am pushing jump down Thailand way or something they stole from the meal dry up in the hills and they started taking bribes bin Laden they sent their soldiers to Cheyenne\nCollecting opium to sell to them and pushing young contain common human they supported by the eye\nThey are jam on the train down to change right that is a railroad town told the police chief brings up the town that you chose train trafficking gangs come home they supported by\n[noise]\n\n\nThey they they did they did it they wouldn't let me think that maybe they don't know that that number that you may remember they let you\n[noise]\n[noise]\n[noise]\n\nA Republican ... Jimmy or an attorney with ... with the right mental advocate them Dr Monica ... family medicine physician and member of positions for social believe we'll be talking about the connection between environmental health and public health [noise]\nAnd ah thanks so lots of listening everybody listening to W. R. T. any not quaint nine of them in Madison is responsible radio shows global revolutions I'm going to be out\nUh most of the next uh many weeks and I'm like you know all\nToo long ago when we go in for\nMy co hosting a duty in the next town over the next couple of months\nThat we know we have a lot of us are among friends out there who love a whole list and other music that he brings so it will be to treat him back on the air absolutely and you're listening to do we are the ... in Madison, Wisconsin [noise]\nIn in in the\n\nBBC News\nWith Simone Murray President Putin's spokesman Dmitry ...\nSaid the threat by the United states to pull out of a Thirteen year old treaty on intimate your range nuclear missiles is deeply concerning\nThis ... said that if it went ahead with make the world more dangerous\nMost likely would jak Donald Trump's accusation that it's been violating the IMF arms treaty instead the Clinton spokesman dimitrius by scoff planes but it's the United states that's broken the Dale\nAn argument to President Putin has made multiple times but the treaty itself Moscow insists remains fights all the label security if Washington does that bond in it and if the past Gulf War and the world would become a more dangerous place\nSay remembering for reporting often talks with a visiting us national security advisor Joan boots and\nHis Russian counterpart Nikolai Patricia said most who was prepared to work with Washington on addressing any mutual grievances over the INS treaty\nTech he says it will do everything it can to shed light in the mud or in Istanbul of the Saudi journalist ... has shrunk Jay spokesman for president ... said nothing would remain in the dark regarding the investigation into the killing on Jones to reports\nThe presidential spokesman promised to reveal all about the murder actors the words of his boss\nPresident Erdogan has already said if you lay the details of the case in a speech on Tuesday Turkish officials have school fleet dismiss the Saudi assertion that Mr her show gee died during a fistfight\nSaudis blame his death on that road corporation of sanctions by crown prince Mohammed bin ... President Trump's son in law in Middle East envoy Jared Kushner since he's urged the crown prince to be transparent\nNorth and South Korea agreed to remove weapons on guard posts from a true spin age that straddles the heavily fortified border the aim is to maintain good relations between the two sides by reducing tension in ... also known as the joint security area\nThe president has ... has one and\nTime in office by landslide the vote was disrupted in much of the English speaking area of Cameroon which is seen as secessionist rebellion here's a little rough\nThe results not a surprise but that will not stop this from being another controversial election in ... in most areas of the country to be a woman well over three quarters of the votes\nAnd surprisingly this includes the different regions where traditionally the incumbent decide little support and with turnout was extremely low due to the secessionist rebellion\nSeveral opposition candidates made official complaints about the process some alleging fraud but the constitutional court rejected rulers appeals last week a ... of the ... will be sworn in for a seventh term world news from the BBC\nThe NATO mission in Afghanistan says one of the service members has been killed unto others wounded in an attack upon it committed by a member of the Afghan security forces\nIt happened in the western province of Herat reportedly in a district with a strong Taliban presence reports say the militant group has claimed responsibility\nThe British prime minister Theresa May is said talk proposals for overtime overcoming what she called the considerable sticking point that still stands in the way it's a ... do you how to avoid customs checks on the island of Ireland\nShe said she was prepared to keep Britain aligned with the use customs arrangements for unlimited time off to leave next march\nBy far the best outcome for the u._k. full on and on for the a youth is it all future relationship is agreed and in place for the first of January twenty Twenty one [noise] I have every confidence that it will be on the European Union has said they were show will commitment to this timetable\nFor the country are trying to resolve is about insurance policy if this doesn't know half of\nThe Zimbabwean authority that the gun in order to the entire country farmland in an effort to boost productivity and help the inning economy to recover and the chair of Zimbabwe's lung condition and I thought they said the exercise would identify underutilized learned\nAs long as individuals who had been allocated multiple farms she denied the exercise was when which on government critics have questioned whether any Lund would be taken from the political elite as a result of the car into the\nTwo of the six critically endangered black rhinos that were relocated in may from South Africa to chance of dying of wildlife charities that the male and female rhinos were not poached\nAnd five things that cause was not yet known that may have died as it was only to the virus BBC News\nW. O. R. T. things as listeners sponsors and the EU W Madison division of continuing studies\nOffer and community programs in the arts and humanities a panel discussion about how local monuments and markers fit into national conversation about monuments in American history with experts from Madison and you W will be held Tuesday October thirtieth at the job residence hall on the U. W. campus\nInformation available at go that whisk dot edu slashed Wisconsin dash ideas or by calling six or eight eight nine zero three six to six\nW O R teeth thanks it's listeners sponsors an S. P. C. live presenting Roseanne cash it overture centers Capitol theater on Saturday march sixteenth\nCountry music legend Roseanne cash comes to town with her first album in over five years she remembers everything tickets are on sale friday October twenty six that eleven am more information and tickets are available at overture dot org and at the overture box office [noise]\nAnd welcome\nTo the Monday October twenty seconds twenty Eighteen edition of a public affair on W ... eighty nine point nine of medicine and W. O. R. G. F. him dead or gee\nMy name is Patty ... and I'll be your host this hour on today's show we're going to be talking about public health and environmental health\nThe other thing that really stood out with the stories was the profound and prolonged impact that these things have on people's lives not just their physical health but also their mental health being triggered again I'm by smells by\nUm you know turning on the faucet and you're home by other things just being triggered again and again and again that things aren't safe around you and that you may not have a way to escape that\nIs really a profoundly bothersome for people both for their physical and mental health and despite that the last one that I'll comment on right now for the common threads is the fact that they had all the strength not to blame none of these people that have been affected by the by the environment's so profoundly\nWill to cast plane ... it wasn't about let's not do this or let's not do that it was how can we keep the same freedoms and the same um quality of life an standard quality of life that we have um\nAnd make it safer for everybody\nSo do we need to change the way that we have cars and trucks do we need to change the way that we produce electricity do we need to change\nHow the ... Iran so that the water around and it's not as affected and all of these patients even though I keep saying patients all of these this constant I'd say my my patients that are good pets and I\nFlipped profoundly affected and yet didn't Kathleen and I found that quite heavy like actually I found that nearly um wonderful to hear\nOkay so Jimmy I'm Wondering for you um as a lawyer what role do stories and storytelling play\nIn your work with with clients and the people who come to you with you know with a particular environmental issue who might might be a patient or most likely are patient other doctors somewhere I mean how how do you their stories\nKind of come to you and inform your work in environmental law\nI mean I I'm a I'm a [noise] using a personal level I mean there's a lot of moving stories that do come to us um\nYou know we get lots of calls from community members who are facing issues and um again just like I'm a personal level it can be\nDifficult because we don't always have the resources to help them out and we had we try to find folks that can help them I mean we may not be the right organization to do it for you just can't take him out simply because we don't have capacity\nUm but if that's the case you try to uh make connections with other groups or other professionals that might be able to help them\nUm but it is very moving on a personal level I mean a lot of times by the time that someone is calling him a law for you know an organization that Libya gates there they've exhausted all other resources and they're really just looking to\nAnyone that they can for help I mean they've called the state government they've called the county health department they've talked to their doctors they've you know like they've exhausted these resources were usually not at the top of the list to call 'em and so these people are impacted in a really significant way and they're just\nIt's really struggling to um to figure out how to address the problem [noise] ah so it's a very motivating thing for me on a personal level to want to be able to help out help these people out and you know what I mean it's really kind of the reason I Do this type of work on a a a little bit broader level\nUm I think this stories can be really powerful when we're doing that advocacy work in the regulatory world so the regulatory framework there's lots of numbers there's lots of technical details there's one reports and\nIt it at times become so disconnected from like the on the ground impacts of what we're actually trying to address you get I mean you just get lost in the details and you can spend months and months you know and just not even think about what does this mean in someone's life like what you know if\nIf we choose the standard for this versus the standard like how is that impact the person\nYou know you're arguing instead over just very technical details in costs and things and so one thing that we try to do in our work is really when we are undertaking advocacy efforts is to make sure that those human impacts on those stories from people are at the forefront\nOf so that you can remind regulators and remind those decision makers of you know what it is that what they're trying to achieve but also to really highlight like the importance of the decisions that they're making I mean you know there are these really significant impacts and these people who are doing with very difficult situations or\nHave spent years and years working on issues to try to improve the environment around them um and I think just you know again like highlighting those stories and bring it makes sense to making sure that the forefront can be really important\nSo I was really curious and wondering um if if Monica ... say you as a doctor and Jimmy you as a lawyer if\nIf your world come together at a certain point and you you work on issues with each other and um if as part of your work you go out and actually investigate and sample at sites or a fat\nDoesn't play so much of a role in in the work that you were doing and whoever wants to start\nThat's kind of what the network is all about right there are kind of connection I don't know how difficult it is for me to find doctors that good\nOn TALK in court or other places\nUm about or advocate you know publicly again about yes these ... these things maybe linked right there's medical leave on my part that your medical problems are linked to your water quality\nResearch presents beautiful ways of doing that there is a wonderful ways of testing whether the equal like bacteria and you're drinking water well come from the ... on the hill or not\nUm that's all there can be used not an everyday life but certainly when it comes to more litigation um and I think it's important for doctors to understand that they could have a role in these things that they need to recognize the diseases that their patients may have because of environmental\nBut then mostly they also need to\nBe available to advocate for the patient NBA able to advocate and the bigger system for public health being hurt at levels of ... a a level of\nUm DNR or other places that make decisions about what kind of environmental impact we might expose our population in Wisconsin too okay and Jimmy\nI mean I I agree with mark I think that's the the idea behind the network and it's something that internally as well I mean they were trying to figure out how how how do we get better at making those connections and\nI'm having those partnerships with them when we need technical expertise to um you know improve some certain outcome that that we have access to it I mean it's difficult we\nKnow we're a nonprofit we don't have a lot of resources\nPeople's time is very valuable\nUm and there's you know I think in the absence of a Wisconsin environmental health network there is not a lot of traditional\nPathways for these relationships between a environmental law firms and physicians I mean there certainly are other groups but there's um it can be difficult to to build those partnerships and um and to make sure that those two areas are really integrated mhm\nYou have anything to do with you know kind of how things are are divided with in our government and particularly\nIn in state government um we're I'm I'm guessing the DNR is not really paying terribly close attention to a public health ... am I right in saying that or am I going off on a limb here [laughter]\nWell I don't I don't know if I necessarily would put the cause and kind of um [noise]\nYou know just how the state government I mean I think it's really a resource issue and just ... I'm ... you know ... there's everyone has so many different things going on unless you grew out of effort into building those partnerships\nAnd relationships that it's not necessarily just going to appear on its own for 'em and and from my perspective which is a limited viewpoint you know I've only been working in in this area for six or seven years but from my perspective in that six or seven years I think that there's been a growing\nRecognition of overlap between environmental issues in public health and so I think that you know again just in my perspective that part those partnerships in those relationships between the environmental and public health field or really I'm starting to solidify the lease for MBA mhm\n[noise] I think it's worth mentioning that Wisconsin that's not put a lot of its financial resources into public health and the state of Wisconsin but number forty seven are forty eight and all states in terms of how much we can treated per capita that to our public health systems so\nThe excellent people working in those areas that that that's the Wisconsin department of public health or whether that state um there are a lot of environmental health that's part of that more extension that\nUm they have excellent people and that but they also are strapped for finances in a way that doesn't allow them to do all of what they may be could be doing and so I think that's something for us all to advocate for is to support financially the system that it's supposed to protect us all yes\nAnd and so as far as investigation Monica you were saying that the patients themselves do a lot of detective work so for for both of you as um as people working\nIn a specific field do do you go and visit\n'em Jimmy of the places that your clients are are telling you about where they think the environmental contaminants are coming from\nAsthma rates are are increasing in this country aren't they I mean as ... ... among children especially is is going up\nYeah and you know certainly those that have asthma and respiratory diseases are affected even more so by the air pollution that there is yes\nIf you are just joining us you are listening to the Monday October twenty second twenty Eighteen edition of a public or fear on wor chi eighty nine point nine of Madison and W. or to your film dot org gee\nMy name is Patty ... and I'm your host this hour on today's show I'm joined in the studio by to guess who are affiliated with Wisconsin environmental health network Jimmy ... is ...\nThe attorney with Midwest environmental advocates and Dr ... woman is a family medicine physician in Madison and a member of Wisconsin physicians for social responsibility\nIf you have a question or comment for Jimmy or Monica please call us at six o eight to five six two zero zero one or email us at talk at W. O. R. T. F. M. dot or gee\nYou can connect with us on social media at Facebook dot com slash W. O. R. T. talk or tweet us at W. O. R. T. chalk and again a reminder that this Wednesday Jimmy and Monica along with professor Janine ... worth of the U. W. school of human ecology\nWill be part of the panel discussion panel discussion featuring environmental health stories from Wisconsin nights\nThe audio exhibit and panel discussion will take place this Wednesday\nStarting at eleven thirty AM and running to one thirty PM at the health sciences learning center at seven fifty highland drive on the U. W. Madison campus [noise]\nOkay [noise] so um [noise]\nYeah boy where was I going to go from here I'm\nJimmy as far as the work that you are doing right now I'm especially related to water issues in Wisconsin [noise]\nYeah I Know you're going to be working on an Foxconn um so tell us a little about how that water issue could impact Wisconsin's environmental health and also possibly some of the public health impacts it could have\nYeah well [noise] Susan\nI'm a ... a lot of my work ... uh centers on like clean water work and so um\nYou know a lot of it falls under the federal clean water act which is the goal of a clean water act from the Nineteen seventies when it was passed was to make our rivers\nAnd in our waterways ... [noise] and that you know ... ... and that was the goal is to make our waterways officials from mobile\nBy ... uh the Nineteen eighties I Believe and so we haven't reached that goal yet and we're we're far off\nUm and uh but there is still in progress being made and there's lots of activity going on we're uh we're constantly developing or not it constantly or developing new water quality standards as do information about threats come out\nUm but one of the big things that we see is there there's a lot of progress that needs to be made and um these a lot of these regular regulatory tools that we have\nAre just a to Z them they they move very slowly and it can be hard to address um issues as they come up and so there's a whole\nHost of pollutants that aren't even a regulated under the clean Water Act on their comic pollutants of emerging concern\nBut they we don't have water quality standards for them we don't monitor for them we don't test we don't include any limitations in permits for them it's sort of just it's just everyone is aware of it but it's just this big gap or we don't have legislation to address you know discharging are polluting our waterways with those pollutants\nUm that's that's kind of like a static concern what makes it even more difficult is now you have the you know this as our environment changes with with global climate change\nI just add to this whole other layer of uncertainty on top of that which I'm just makes you know looking forward to it makes it\nA quite a difficult problem to to understand and to figure out how to address these nominees water quality issues\nSo in in northeastern Wisconsin but also in other parts of the state where there where there are concentrated animal feed lot operations [noise] um I I was wondering if\nYou're a potential future issue might be what we saw in North Carolina this summer where ... were breached and flooded and released contaminants into the water is is that a concern for for ...\nSing as well in in the future especially given what we saw this summer with with flooding in our area\nWell I mean I don't know that we can predict if it'd be such a significant rainfall an impact and and flooding quite like that but it certainly is a concern because\nThe way that these regulations are designed is that the the manure lagoons of your story and all the manure and the big lagoon or the storm water retention ponds they under the regulations they have to be designed\nTo um withhold like a certain amount of rainfall so they say\nYou have to design this Menorah lagoons so that it won't overflow if there's a hundred year storm event and so they look back at past me or logical data and say well how much how many inches of rain it was like the hundred year storm so once every hundred years\nUm and that's the that's the way they were trying to be cautious and it was a um [noise] and to make sure that we're building the the lagoons and ponds with enough excess capacity sort of not these over flows\nWell what we're seeing now is that the hundred year storm we're having four or five six years in a row um or more even more frequently than that\nAnd even though we're seeing that we're not ... we're not going back into the regulations and changing those technical requirements to require additional capacity with withhold or withstand that\nAdditional rate rainfall or so\nThe the information is coming in that will allow us to improve our regulations but we're being very slow to act to ... um you know implement these new requirements\nOkay and and Monica to get back to the point that you made about antibiotics I mean one of one of the features of concentrated animal feed lots and something that we know about agriculture in general\nIs a huge use of antibiotics and while I realize that none of the stories you're talking about are you related to um antibiotic or exposure\nOr or um [noise] a\nResistant religion snake you resistant bacteria as as a doctor um and especially someone who is talking a lot with your patients are you concerned about the use or perhaps misuse of antibiotics in in farm animals here in the stage absolutely\nSo you know we know that about I Want to say around eighty percent of antibiotic use is actually in animals and not in humans we tried to have very good antibiotic Stewart chip in the medical field and even that is hard enough to achieve among them overuse antibiotics are not necessary\nBut really a lot of the antibiotic resistant organisms that we see infections missing humans are probably due to the pressures on those bacteria from\nWidespread use an animal farms\nThat would help them as they should have made it very clear that they feel that antibiotics to not routinely be used for gross and and feed the animals in animal feeding operations but that because of the trouble is that than humans have that the infections from resistant bacteria\nBut then in fact they should only be used for specific infection men they arise in those um\nAnimal operations and farms using to be farms for him so and that's very different and that is not what it's being applied here in Wisconsin or in the U.S as far as I understand even though that has been recommendations made quite clearly mhm\n[noise] okay and we do have a caller on the line higher and please go ahead with your question or comment\nOkay Hi interesting issue um I don't want it to say that the refusal of so many of the establishment doctors to consider any of these factories you mentioned this before but it's so frustrating you know every the drug industry it's pretty much taken over [noise]\nUm and it basically you know environmental considerations and the health industry in the United states and so it's not just these huge feedlot but um even in Madison there is industrial dumping their as I'm all over the country if you take a train\nYou will see that the um industries are located by great big rivers and you can see that dumping and mellowed at night and um I I I think that the control of of medicine by the drug industry\nIs is it's really a problem not just in human being the golf course in animals to\n[noise] okay thank you around so Monica would you like to your report first and were frequent travelers with the train and whenever we go buy a big river we in this country it breaks my heart to see those huge industrial operations be what you see at the mouth of the river and upstream too\nIn in that case acted with a combination of bureaucratic incompetence and total disregard of civil liberties against whether and there are people\nPeople should be careful about making the FBI anti heroes now just because they're going after people we just like the FBI I'm always cuts corners and I'll just say that that culture hasn't changed now probably get a visit from some guy in wing tips shoes\nYou'll let me know I'll let you know yeah [laughter]\n... know\nOr the extent of enjoyed our conversation thank you thank you very much Mitch or the next time has been our guess professor of history and distinguished university professor at the University of Maryland College park is a professor of history\nSpecifically on the Roman ancient Roman world an author a number of books his latest book which is not about ancient Rome is called Batman rising how's the weather underground beat the FBI and lost the revolution\n[noise]\nAnd that doesn't letters and politics the show is produced by deanna Martinez Christian ... is our engineer you can find a bar ties of our previous shows online hacking the cafe dot O. R. G.\nEighty nine point nine per Schuchat is gathering harming Byron ground on Thursday October twenty\nSix to eight PM along with the harmonies average I teach I told your life music ... starting at seven thirty mixed gender effects as self described a homegrown ... when he had a lot [noise] eighty nine point\nSocial club stretch great opportunity for work volunteers to hang out with one another the club gatherings are also a great way for members of the community to meet their fellow ... volunteers and get a\nBetter sense of what the word is all about joined us aren't eighty nine point nine social club gathering at the harmony bar on Thursday October twenty fifth from six to eight keeping it in the community for over forty years W or tea eighty nine point nine at Madison W. or tea FM that\nOr [noise]\nW. O. R. T. thinks it's listener sponsors and community shares of Wisconsin community shares and its member groups envision a future where we all have clean water and air all neighbors have family supporting jobs and do all communities in Wisconsin are safe healthy and thriving\nGifts may be made to community shares and its many member nonprofit including W. O. R. T. their workplace giving campaigns this fall for information community shares dot com or six\nZero eight to five six one zero six six\n[laughter]\nOr the next access all in one day October twenty seconds or so I mean for you know your own W. or eighty nine forty nine of them\nWill be sharing and use it as if I feel captures the confusion was there many of us fuel regarding the conditional or world music may not provide a way out of here but at least we will change from relief by rocking out\nAgain that they are in our next to access Monday October twenty seconds seven PM you're on W. or to you\nKnow important lined up around the extra salary is W O O G commitment to the airlines for America is our number ... station there programmers or the borders\nRight [noise]\n\n[noise]\n\nIf\nYou live presents an evening with government meal Thursday November first seven PM at the Sylvie\nBurner right from the Allman brothers band in Nineteen Ninety four guitarists Warren Haynes an original bases Eldon woody formed government Neal drummer met out who have played with in the Dickey bets bad\nSteeped in the roots of rock blues soul in jazz government knew it was recognized for during songwriting and storytelling as it is for the improvisational virtual city that fuels their\nHouses like performance\nIn the evening with government meal Thursday remember first seven PM at the silver\nYou're listening to your T ... FM listener supported radio [noise]\n... ... ... ... at\nPeace Eli presents that their desk you trucks back Monday November fifth seven thirty PM your home\nThat didn't ask you drug spam has spontaneity and jamming along with some improvisation after touring together in two thousand seven as Derek sharks and Susan to death is so stupid revival they merged their respective groups to form the rescue trucks ban\nTwenty first concert was EPA Tony town savannah music festival and Susan's with us being voiced might actually be what angels on like when you're saying that the ... drugs band Monday November fifth thirty\nPM overture hall [noise] we are eighty nine point nine W O R G ... Madison kidding you inform the live music capital [noise]\n[noise] [noise]\nJoined W. O. R. T. for the day of the dead ... on Sunday October twenty eight [noise] sponsored by parts you don't have them in Santa Fe and carbon for [noise]\nThis will begin a ... eleven and then proceed each for\nSampling two glasses of locally produced craft beer each stop tickets are Fifteen dollars can be purchased at each of the four brewery [noise] all through these will benefit W. O. R. T. space is limited to grab your ticket at park staple Ellis Island ... or carbon for costumes are encouraged but not required\nBringing a lively undead Halloween season jak hilarity is this is W O R team and then nine or ten Madison [noise]\n\nW. O. R. T. thinks it's listener sponsors unrest tech services serving area businesses nonprofits and multi dwelling properties with high speed ... neutral Internet digital phone and TV services on the Web ... services dot net or by phone at six to eight six six three three eight six eight\nAnd this is eighty nine point nine of them W. R. T. and Madison and W. R. T. F. M. dot O. R. G. three hours I'm jazz on all around jazz that's coming up next right after the insurgent radio kiosk\nThis is the insurgent radio kiosk for Monday October twenty second white woman mistakenly believing she was groped cause police on a black boy\nI'm children's book author genial and and this is a civil liberties minute with ACLU attorney bill Newman\nRecently in Brooklyn New York deli fifty three year old white woman dial nine one one and report it to the police quote I was just sexually assaulted by a child the video taken inside the bodega show something very different what happened is this\nA boy who is black and nine years old dressed in his school uniform and wearing a backpack was inside the store as he turned to talk to someone his book bag brushed against the backside of the white woman Theresa Klein who then called the cops\nCausing the nine year old child and his friends to burst into tears thinking he was about to go to jail\nIs kind mitigating the situation a bit in a TV interview later\nSaid he was sorry this incident is part of um\nA bigger story too often police departments are used as instruments of oppression for biased callers a long time Flatbush residents who recorded the commotion outside the do he said quote you think something like this only happens in the south but it's all over the world\nYes it is it's a country wide phenomenon and a country why disgrace\nThe civil liberties minutes is made possible by the ACLU because our children's freedom can't protect itself\nThe kiosk brings your commentary from members of the public all opinions expressed our speakers have an idea for your own to make commentary email kiosk event at W. O. R. T. dash FM dot org and put commentary in the subject line [noise]\n\nToday's action calendar free presentation addressing plastics in the great lakes is scheduled for this evening from\nSix thirty to seven thirty at the sequoia library forty three forty two okay boulevard and Moser from Wisconsin water library at the EU to abuse aquatic sciences center will describe why plastic is a serious threat to the marine environment navigation\nSafety the economy and human health the good news is that we can reduce the volume of plastic that ends up in the lakes for more information phone to six six six three\nEight five the YWCA Madison is dedicated to the elimination of racism and the empowerment of women to fulfill this mission the YWCA Madison provides race and gender equity programming to create a more adjusted inclusive community job training and transportation to help people find and maintain jobs and a safe affordable\nHousing and emergency shelter for more information please call YWCA Madison it to five seven one for three six or visit\nYWCA Madison dot org word is looking for an alternate weaker volunteer receptionist on Tuesdays from eight AM to news we also need a volunteer weekly receptionist on Tuesdays from five thirty to seven pm for more information email volunteer at W. O. R. E. T. F.\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[laughter]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise]\n\nBoom\nBoom boom\nBoom\nBoom\nBoom boom\n\n... and ... and who ...\n\nAnd\nOf ...\n\nBoom boom\n\nBoom\n\n\nShe [noise]\nIn the middle of the people with ... ... ... on the little ... on on on the road on\nBroadway boom boom and all the ... in Berlin rubber boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom boom\nBoom boom boom boom boom boom boom boom boom boom we'd go to ... and ...\nWe're not on top of the ... all\nAround the world with a number of what we don't really know what's going on and on the ... on the border on drugs and\nThe ... to ...\nFrom\nThe boom boom\nBoom boom boom boom\nBoom boom boom boom boom\n... ...\n\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n\n[noise]\n\n\n...\n\nShould\n\n\n\nMm\n\n[noise]\n[noise]\n[noise] [noise]\nTurns around and there will be done or\nNot and not\nOnly the ...\nTo go to her and her ... year in the door to roll\nA drug addict\nAnd just go there man around\nHer and get back then I had a whole\nLot of ...\nI'm not I'm not the end of that anger\nNone of them than I Am\nWait long enough to hear some new recorded material from him and then when he finally delivered he delivered in great style and dismantle baritone saxophonist right here in Madison\nDidn't hear from him for quite some time even though he kept himself busy playing and teaching and doing a whole bunch of other things but a couple of years back he did state of the baritone volume one that was followed by volume two and now\nState of the baritone volume three subtitled seven forty seven queen of the sky\nIs now out and all three of them are making a very convincing case ... will be one of the very best in town here and there are spent on baritone sax Jimmy ... already on trumpet and repayment Brett Townsend on base Rodrigo villain the waiver con right and Michael Brennan on drums\nFrom state of the baritone volume three we heard bird strike ... music from one of the loudest mouse in jazz history that's for sure jelly roll Morton a man who was known to brag about quite a few things\nCertainly accomplished very a lot of different things in of course of his career inventing jazz would definitely not one of them but he certainly was\nOne of the most able practitioners in his particular craft jelly roll Morton on that one backed by Johnny Depp on clarinet and his brother baby Dutch on drums from Nineteen twenty seven jelly roll Morton at his trio doing Wolverine Blues\nWill show lift you up and Dave Holland on piano\nAnd base respectively a Bulgarian pianist and an Anglo American bassist quite a combination they did a record in Nineteen Ninety three call up and down\nAnd a whole series of do what's recorded live featuring those two they'll show lift you up and Dave Holland during Wednesday's tunes called jumping in and speaking of dynamic duo those Dexter Gordon and bed Webster started that set off with music recorded in I'm now I'm not too sure whether it was in Denmark or in Norway\nI'm trying to figure that out from the credits on here but it was broadcast on Danish radio I'm going to take a gamble and just say was recorded in Denmark that's good enough for me because either way Dexter Gordon and Ben Webster when they got together did a whole series of\nAppearances together some of which were recorded like that one Dexter Gordon and Ben Webster backed by the Kenny Drew trio Kenny Drew a piano ... Peterson on base and beyond will stop on drums\nDexter Gordon and Ben Webster doing the Duke Ellington tune in a mellow tone it is one minute after the ... of three and this is eighty nine point nine up M. W. O. R. T. in Madison and W. O. R. E. F. M. O. R. G.\n\nW. O. R. T. thinks it's listening sponsors and they you W Madison division of continuing study is presenting community arts organizers marry oh guard you all and Sarah Marty on friday October twenty sex\nFor a conversation about the life and work of community art advocate Robert card this free event at the central Madison library includes a community arts project and music performance\nInformation available at go that whisk dot edu slashed Wisconsin dash ideas or by calling six to eight eight nine zero three six to sex\nOr do you do is we'll be rocking don't use from the front of ... three skill levels you don't need to be wherever the whim ...\nShe but she lays in the debate or do you go and find is taking your fries wrapping more tickets are available for approaches to strike the front lines are free\nBeverage after ... enjoying\nThe prices are going on for thirty five dollar increase the proceeds benefit there'll be more community radio\nOr you know you just turn it on for six PM Lisa shoes and will be [noise]\nThe eighty nine point nine ... gathering at the harmony bar and grill on Thursday October twenty some six to eight PM along with the harmonies divergence choice do you live\nMusic in the extreme rams are starting at seven thirty mix gender sex is self described as a homegrown bluegrass from the east side of the eighty nine point nine social club stretch great opportunities for work volunteers to hang out with one another club gatherings are also a great way for members of the community to meet their fellow weren't volunteers and get a\nBetter sense of what the word is all about join us for an eighty nine point nine social club gathering the harmony bar on Thursday October twenty six to eight keeping it in the community for over forty years W or tea eight or nine point nine at a NATO W. R. T. FM that\nOr [noise]\n[noise]\nI'm Susan the W. our staff member responsible for organizing our pledge drive with the help of hundreds of amazing volunteer and dedicated staff I recently completed fall pledge drive ran like you're saying both the famous making sprinter thank you to every one of you who gave your time\nAnd the energy to make our phone Dr successful there was an or a festive positive energy around the station during the drive and that was all year because of your generosity we exceeded are gone came very close to our stretched all of eighty thousand dollars we also added eighty new monthly donors\nW. R. T. has faced unexpected challenges twenty eight and we are so grateful to find that the challenges that come with men to support from you award pollen tear listeners sponsor and most of all a vital part of the W. O. R. T. family thank you [noise]\n\nW. O. L. I. T. things that the listeners sponsors and five nights a locally owned cloud service provider of enterprise level IT infrastructure consulting hosting and management service it on the Web at five nights dot com some number five one to one thousand\nAnd jazz is one of the things that we do here at W. R. T. and if I see so myself do quite well because we do fourteen hours of it every single week\nTwo to five in the afternoon Mondays through Thursdays it's yours truly with all round jazz on Mondays fire where she was joining powers on Tuesdays journeys into jazz with Gary Oldman on Wednesdays and strictly jazz sounds let's see probably gonna generals on Thursday afternoons in every single Saturday morning from ten to twelve noon if you like a jelly roll Morton\nI was playing a little while ago you want to tune in\nTo entertainment whether host Jon ... all of that is right here on your listeners sponsored community radio station eighty nine point nine FM W. O. R. T. it is six minutes after the hour of three I'm Alex wanted white\nLet's get rolling with the second hour of this afternoon show was music from somebody is going to be coming to town a little bit later on this week basis Ben Allison\nPlaying with well not the same group that's going to be appearing a cafe code on Thursday night but it's all the same a very nice group indeed brand new CD from him called layers of the city and it features been Alison\nOn base along with Germany built on trumpet Steve Cardenas on guitar rank kimbro on piano and Ellen minard on drums from layers of\nThis has been doing entered the dragon\n\n\n\nDa\nNo no no\n[noise]\n\n\n\n\n\nAre men\nPer per hour or\n\n\n\n\nMore\n\n\nRepublican or on the phone call\n\n\n\n\n\n[noise] [noise] [noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\nBut\n\n\n[noise]\n\nFor a bird or [noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise] [noise] [noise]\nThey they they put in place to be the big and\nBut they will have to be a little bit more than they used to be [noise]\n[noise] [noise]\n[noise]\n[noise] and\n[noise] you know the bachelor degree in there [noise]\nAnd then they're going to be based on that they may not be the\nBig bad dude man that I mean\nThey they [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n\nGovernment or\n\nDon't know whether to\n\nBroker\n\nOr or\nWhat may have been one of the paragon of jazz fusion in the early Nineteen seventies\nBut Larry ... turned to bill Evans for the inspiration on that one Larry car y'all doing it to call Gloria step which was written by Scott feral when the original members of the bill Evans tree at least most well known version of that\nLaw require yell joined by John McLaughlin do guitars on there like nobody's business rounding out the rest of the group to Korea electric piano mirror sloppy to some base they'll they call them on drums some pretty heavy company indeed a company car yell once again during the ... were you step\nPrior to that another guitar player grant green from Nineteen sixty one session the produced an album called Sunday Morning\nGrant green on guitar Kenny drawn piano bench Tucker on base Ben Dixon on drums for them during the Miles Davis to sell what another guitar player Django Reinhardt that one from ninth Gina thirty six I Do believe Ninety thirty six and when that was done\nThe quintet of the ... club of France featuring Django Reinhardt and stuff and ... guitar violin respectively Django Reinhardt and company doing the Charleston\nAnd prior to that guess what another guitar player this one from a brand new album from John Schofield is called combo sixty six in the features Mr Schofield on the guitar one withdrawal Clayton on piano and Oregon then sent to archer on base and bill Stewart on drums from combo sixty six\nWe heard John Schofield starting off that sort of guitar players with a tune called new also it is two minutes after the hour for and this is eighty nine point nine up um W. O. R. T. in Madison W. R. T. F. M. dot ORG the jazz calendar is next right after these messages\n[noise]\nThe Wisconsin union directory and the greater Madison jazz consortium present\nThe conclusion of the twenty Eighteen and did you use yeah series with medicine music scene heavyweights immigrate friday evening November second at the place circle\nTo to their afro ... immigrate trades and dynamic cruise and unrelenting calling rhythms comprised of ten local musicians immigrate delivers the more we jazz rock sound with swirling repetitive guitar pattern the funky\nBaseline to end the series because section for horns and piano immigrate plays a final installment as an indigenous yes theories that didn't memorial union place or vote on friday evening November second at seven thirty\nYou are listening to W. O. R. T. eighty nine point nine FM and W. O. R. T. FM dial or\n[noise]\nThe W. O. R. T. community advisory board will hold its regularly scheduled meeting on Wednesday October twenty fourth at six pm here at the W. O. R. T. studios one Eighteen south Bedford street the public as welcome to attend\nW. O. R. T. thinks it's listener sponsors and community shares of Wisconsin\nCommunity shares and its member groups envision a future where we all have clean water and air all neighbors have family supporting jobs and don't communities in Wisconsin are safe healthy and thriving\nGifts may be made to community shares and its many member nonprofits including W. O. R. T. their workplace getting campaigns this fall for information community shares dot com or six zero eight to five six one zero six six\nAnd stay tuned right after all around jazz it's democracy now with your host Amy Goodman that is at five o'clock at six o'clock it's W. O. R. T. local news and then at seven o'clock it's the access our all that and much more coming up\nLater on tonight right here on eighty nine point nine FM W O R G well let me just do a little bit of a stir a chair and bring up the jazz calendar starting off with tonight looking Potter now John Christian center and Josh ...\nWill be at the rabbinic court yard a twenty nine eastern Washington avenue that is tonight at six and the U. W. afro Cuban jazz on some was playing some ... earlier this afternoon maybe they might want to get some go pharaoh into the program for Tonight Show\nYou W afro Cuban jazz ensemble and the U. W. jazz orcas job you're doing adult bill in the play circle of the U. W. memorial union that is tonight at seven thirty\nTomorrow night ... Fitch park that's a twenty nine fifty one term return pike starting at five thirty Johnny times at Louisiana in middle and you can find that it's Seventy four sixty four\nHarvard avenue and that starts to fix the new breed will be leading the jazz jam session at north St cabaret six ten north St just off the intersection of commercial and ... and that's at eight thirty PM the five points jazz collective at the Mason lounge for sixteen south park streets\nStarting at nine and the ... trio rounding things up for Tuesday night with a gig in alchemy cafe Nineteen eighty Atwood avenue starting at ten pm on Wednesday is low Murray at Louisiana's in Pittsburgh at five thirty Johnny chimes at Louisiana's Milton its sex\nA gypsy jazz jam session of Brokaw Irish pub Eighteen forty three Monroe street starting at seven thirty an angel up where a ... and her trail will be a cafe coda that's a twelve Twenty one Williamson street and that starts at eight PM\nWell speaking of cafe caught a great double bill at that particular venue on Thursday night at five PM it's the jury to maggio trail\nAnd then at eight o'clock\nIt's been Allison's group think free he's gonna be coming to town with\nA quartet pretty similar to the one that I played earlier on in this afternoon show Steve ... cut down on us will be on guitar Rudy racing on drums and Sheena instantly on trumpet the other three members of the court that think free at cafe coda starting at ... pm that's on Thursday night also on Thursday\nJohnny chimes north of the by you know to atlas avenue starting at five thirty PM\nKen waiting at Lujan as in fish that's five thirty as well Jim Erickson at Louisiana's and Milton starting at six adjust jam session I Love this there's so many jam sessions going on that's always a great way to find out where the really good talent in town is no matter where you are the by the way\nA jazz jam session and Susan cafe thirteenth thirty six straight street starting at seven PM Marilyn Fisher and Paul has to be a bond on six hundred Williams in St starting at seven\nThe Madison jazz orchestra will be a brink lounge seven oh one east Washington avenue starting some thirty a Latin jazz jam session will be a rabbinic court yard on eastern Washington that's at nine o'clock and ... things up for a very busy Thursday night\nCatfish Stevenson playing a little bit of the delta blues at the up north bar one fifty so Blair streets starting at nine pm\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\nOr\nWe\n\n\n[noise]\n[noise]\n\n\n\n\n\nAnd that was the Miles Davis quintet recorded live in a stock home on October thirty first Nineteen sixty seven anniversary of that particular session that particular concert coming up very shortly here but Miles Davis and his quintet recording live\nIn Nineteen sixty seven part of the four CD sucks actually\nThree CD one DVD for disk set called live in Europe Nineteen sixty seven the bootleg series volume one up to six volumes now of various kinds of recordings over the years ... Miles Davis and a whole host of different groups that he played them that one featuring of course\nThe very finest quintet that he ever put together at least in the estimation of a good number of us Miles Davis of course on trumpet along with Wayne Shorter on tenor sax Herbie Hancock on piano Ron Carter on base and Tony Williams on drums [noise]\nThat that started off with a Jew many open up all of its European concerts with on that particular to our do called agitation that segue into the Wayne Shorter June footprints\nThe bloodiest month standing around midnight call that\nAn gingerbread boy\nBy Jimmy heat pretty well causing things out with a quest that little bit at the very end there which was usually went under the name of the theme\nMusic there from Miles Davis and his ... Stockholm, Sweden October of Nineteen sixty seven at any rate it's about thirty minutes before the hour of five or ... things up for this edition of all around you have to stay tuned\nPlayed by grades Tom Waits and Danny Glover he needs skew with a Texas widow in a warm hearted rule by says these basic\nCasey Affleck is convincing as John Hunt his real name a Texas detective that puts the case together end is determined to catch the group the local media has dubbed the over the hill gang but like everyone else he can't help but be charmed by the old man who's just doing what he loves\nOn all the fund the Celtic film that makes the most of it's a list cast and small town in western settings all in Redford still looks great in the saddle\nI highly recommend this film for W. Ortiz Monday movie review I'm hearing Richardson\nAnd that does a ferocious Oh thanks for listening to W. or do you live", "show_name": "no_show", "year": "2018", "city": "Madison", "day": "22"}