{"month": "10", "state": "FL", "station": "WMFE", "content": "Segmentation feature a lot of small businesses to live a personalized email campaigns connect with their customers\nMore and more in constant contact dot com and home advisor magic homeowners or home improvement professional\nProjects minor repairs to major remodel I'm going to use mobile pros and book appointments online at home at ... dot com and there's always like I'm ... trying to you you know he's been reading the Bible\nAnd talking about it with me in the break room I don't know about his interpretation of the Bible like OK Godspeed to people to live in the garden of Eden I really don't think he says watch out world jewelry\nHi I'm off on taking all of our president and general manager might be point do you mean it's been a full two years since we first tried this less intrusive style the fundraising cold fiber drive and how we do it now that the family\nYour support uninterrupted programming about donating a dollar a day and I forgot what country Seventy five twenty twenty\n... Ninety point seven WNYC it's bringing capital steps back in twenty\nNineteen is hilarious show will be coming on Thursday February twenty eight that sounds really\nShow your supporters so I went to arrive and get your tickets to\nVisit W. M. F. U. dot ORG for home one eight hundred Seventy five twenty twenty\n[noise] with less than two weeks if I'm a mid term as President Trump is doing all he can to fire up the Republican may really\nUgly harming voting ... ready hunger wave which side is more fired up by the president next time on the politics show from the [noise]\nListen and that begins Sunday evening at six right\nHere on Ninety point seven F. M. W. M. F. E. Orlando\nSupport for Ninety seven news comes some teeth out people's gas natural gas pumps may help contribute to air conditioning resiliency for consumers and businesses in Florida about reducing their carbon footprint\nMore information about natural gas can be found at people's cash dot com slash G. H. P.\nLive from NPR News in Washington I'm Janine hurts in Pittsburgh at least the people are dead several others wounded including for law enforcement officers after suspected gunmen Robert Bauer opened fire at the tree of life synagogue during a ceremony this morning\nAuthorities say the forty six year old is hospitalized in the air condition with multiple gunshot wounds sci director in charge Bob Jones says the suspects full mode of isn't clear\nThe actions this person took today for a for for her in the early stages investigations and over the next several days and weeks with a look at everything and the suspects life is home his vehicle to social media and his movements over the last several days\nJohn says powers entered the synagogue shot and killed people and was leading when he encountered officers he says they believe he acted alone\nJohn think green black head of the Jewish Federation of greater Pittsburgh says the attack is possibly the deadliest one of the Jewish community and history the U.S meanwhile President Trump is condemning the attack calling it horrific it's interest hammer Keith reports Trump says it's an act of anti Semitism\nIn prepared remarks President Trump said it was a wicked active mass murder pure evil and unimaginable adding you wouldn't think such anti Semitism would be possible in this day and age a violent\nHate filled poison of\nAnti Semitism much speaking\nDams and confronted everywhere and anywhere fears there was no\nTolerance for anti Semitism and America\nFor for any form of religious or racial hatred or prejudice\nTrump said he had considered canceling his campaign rally in Illinois but then decided quote we can't let evil change our life and change our schedule camera Keith NPR News\nI'm fifty six year old Florida Man arrested in connection with potential explosive center prominent critics of President Trump is expected to be in court next week see they're saying is charged with the illegal mailing of explosive along with other federal crime NPR's Martin Kaste has more on this aspect\nThe arc has a history of theft and drug violations and the two thousand two he face charges after he threatened to throw a bomb during a phone conversation with the utility company his lawyer at the time Ron ... says there was no evidence that see I've had a bomb but he thinks the Iraq does have a mental disability\nHe refused to even get diagnosed but his family and anyone who interacts with him can see he suffers from something certainly uh goes in the shoe or the ability to communicate to where you and I drew\nLowly also says the ... has been living in a band shock is a registered Republican and it's been active on line and supported President Trump Martin coffee at the argues\nAnd authorities say say our faces decades in prison if convicted you're listening to NPR News\nOur farm Michel Martin I'm Kelly McEvers I'm Ari Shapiro your for my name is on their home and I just started last for many Chinese all day\nAnd my name is David Greene on the co host of MORNING EDITION you know there's something you hear when you turn on public radio it's the sound of voices across the world the sound of information the sound of the nation listening together why do you listen\nI literally when anything on and when I'm Talking to friends and family and I've been listening to NPR yesterday and it's something that I just find myself repeating over and over and over again I find that the first thing that people are listening to NPR they're getting real money real information on NPR\nReal new real information for great reason for which there are also great reasons to call or go online and you and when you do you make off then take stories of voices from around the country possible the best of all you make your own voice for the call or go on line and make a contribution to the station today\nI think you if you're hearing my voice well then you are a listener the question is are you a member become a member today please help support Ninety point seven W. M. F. you during this silent Dr make a financial contribution online at W. M. F. U. dot org or you can call one eight hundred Seventy five twenty twenty affect your\nSupport for Ninety point seven news comes from goodwill industries of central Florida goodwill is committed to helping veterans who are homeless unable to find work or\nFeeling lost by providing counseling ... to find jobs and feel good will use the stone age and stuff on programs that give people a second chance donation locations and information available at goodwill CFLs out of work\n\n\nIs not the point seven FM W. M. F. E. bill Johnson taking a look at a beautiful forecast for today partly sunny with a high near eighty four tonight partly cloudy with a low around fifty nine and for tomorrow a sunny day with a high near Seventy eight\nFor Sunday night clear with the low around sixty and for Monday a sunny day with a high near eighty to support public radio during this fall silent drive at W. M. F. U. dot org or by calling one eight hundred Seventy five twenty twenty\n\nThis is all things considered from NPR News I'm Michelle Martin broadcasting today from member station W H y y in Philadelphia we're here because we just spent some time today talking about the mid term elections which are just a few days away\nBut we're going to begin our program with news of another horrific mass shooting this time at the tree of life synagogue in Pittsburgh, Pennsylvania eleven people died at least six people were injured according to officials a public safety official in the city describe\nThe bar for Ninety point have the news comes from Orlando how to cover that whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location and forty six outpatient centers more information is that she's darling do health dot com\nAnd the shooting as a wiccan act of mass murder\nThe vial hate filled for Asian of anti Semitism must\nBe condemned and confronted everywhere and anywhere it appears\nThere was no tolerance for him to images him in America\nOr for any form of religious or racial hatred for prejudice\nReporter Sarah Schneider of member station W E s ... is covering this tragedy and she is with us now Sara thanks so much for talking with us\nI think if\nWe can we know about the identity of the victims police officers we know were among the wounded can you tell us anymore\nWe don't know anything about we haven't identified the eleven people\nWho were killed today we do know that none of the uh people who were killed were children we do know that they were sick and injured victims and kill the injured victims or a sixty one year old female a Seventy year old now and then also for police officers of the officers were\nFirst responders and I'm too were swat officers\nCan you tell us a bit more about the synagogue and the community where this happened\nYet the synagogue is in um squirrel handle if that is ... you know active Jewish community and Pittsburgh and um today when I was on the scene we saw you know many people who are concerned about\nFriends and family members here today Neal were in the building that day uh this morning and a lot of people just confused trying to figure out where those people were\nCan you tell us a bit more about the alleged gunman and I understand that he was taken into custody alive\nJoin us that begins this evening at six right here on Ninety point seven ... W. M. F. E. Orlando Melbourne and Daytona Beach\nI'm Janine hurts with these headlines forty six year old Robert Bowers has been arrested in connection with the shooting at the tree of life synagogue in Pittsburgh the left or at least eleven people dead several others were injured including for law enforcement officers it's being treated as a hate crime although officials say they don't have a full motive yet\nIn Afghanistan voting took place today in parliamentary elections in the southern district of Kandahar this week after most of the other provinces went to the polls that delay prompted by Taliban attacks\nAnd the authorities in the northern Marianna islands say it may take weeks to restore electricity to the U.S territory after you to the most powerful Thai food to hit the U.S western Pacific territory and half a century struck earlier this week I'm Janine hurts NPR News in Washington [noise]\n\n\nSupport for NPR comes from the station and from Subaru featuring the all new three row ascent with feeding for up to eight and a choice of second row captain's chairs love it's what makes the Subaru was super learn more it Subaru dot com\n[noise] from the financial services firm of Raymond James offering personalized wealth management advice and banking and capital markets expertise along with a legacy of putting clients financial well being first learn more at Raymond James dot com and from Americans for the arts\n[noise]\nIs all things considered from NPR News I'm a show Martin broadcasting today from WHYY in Philadelphia\nWe are of course following the shooting at the synagogue in Pittsburgh today\nWe will have more later in the program but first let me tell you why we're in Philadelphia\nYou may have hurt other colleagues some NPR on the road this week like them we spent the week traveling and talking with people about the mid term elections just ten days away now\nVisiting pivotal states and counties we decided to come here because Pennsylvania the Keystone State went for President Trump and two thousand sixteen breaking a winning streak for Democrats that stretch back to Nineteen eighty eight\nAnd Pennsylvania was supposed to be part of that and blue wall from Pennsylvania to Michigan to Wisconsin the Democrats thought with secure the White House for them and all of those states went for Trump on election night\nNow though Democrats are banking on a comeback here in Pennsylvania in their quest to retake the house so we've been talking with candidates business owners students working folk people we found because they are really into politics and people who are really not\nAnd we've been asking all of them what's on what's on their minds this election year\nAt album understand what we've been hearing we asked WHYY Dave Davies to join us he's covered politics in this region for more than Thirty years and he's with us now and thank you so much for hosting us and thanks to all the people who offered a pumpkin bread and cookies insider which we were not expecting so thank you for that\nIs great to have you all so nationally they've Democrats need to take back twenty four seats to win the house and Alice say they could pick up a\nHi I'm off on taking all of our president and general manager of Ninety point seven W. M. S. it's been a for two years since we first tried this less intrusive style the fundraising called fire with Dr and how we do it now that you've been happy family\nDon't your support all uninterrupted programming donating a dollar a day with W. M. S. dot org or call one eight hundred Seventy five twenty twenty\nA seismic shift in the politics of this state me and for the last six years Pennsylvania have had congressional maps that were pretty bizarrely shaped and generally acknowledged to be a gerrymandered if even favor Republicans we have eight hundred thousand more registered Democrats than Republicans in Pennsylvania Democrats have only one five of Eighteen seats\nThis was challenge last year and a lawsuit and it was aimed not a federal court where some of these gerrymandering suits have stalled but at state court\nAnd in Pennsylvania the state's Supreme Court five of them elected Democrats not only ruled the map and unconstitutional gerrymandered an order new districts but said it had to happen immediately for this election and it created some confusion and controversy but it really opened up opportunities for Democrats\nAre they're big themes playing out in congressional races across the state and I asked because we've been watching the ads all week and I get the sense that both major parties are trying to push specific themes in these races so do you see that\nSure sure I mean for the Democrats they're telling people that Republicans are tools of corporations and and the wealthy who will strip away protections for people with preexisting medical conditions are up the Democrats or Republicans are casting the Democrats as friends of Nancy Pelosi they can say that name off\nWho will spending recklessly raise your taxes and a lot of it is you know Michelle character assassination if you have ever missed the tax bill if you have done or said anything controversial it will be exaggerated an amplified on television and hopes to to undermine you\nWell one of the reasons that we've been focusing on this week is the first district in Pennsylvania it has to attract an enormous amount of national attention it's drawn huge amounts of money\nIt's been one of the most expensive campaigns in the country and a lot of that has to do with the fact that it's one of the twenty three districts that went for Hillary Clinton it two thousand sixteen but was also carried by a Republican congressman in this case Brian Fitzpatrick\nHe's being challenged by a millionaire philanthropists name Scott while I was never run for office before and he poured millions of dollars of his own money into his campaign and I asked him why\nBecause it's an extraordinary are\nNot just the policies that are being twisted around and then turned toward the one percent on the corporations and away from the Ninety nine percent but just the moral tone of our country I've got three kids are going to raise a kid in this atmosphere this influence coming from the White House\nIt's destructive of the fabric of our moral core in America and destructive of democracy the assault on the media the assaults on the courts and the rule of law on the IRR intelligence agencies on the very notion of truth itself\nIs under assault and I've never encountered at a time like this and I just couldn't sit on the sidelines anymore\nWhen do you think the campaign here hinges upon it you know I was watching a lot of the ads last night and all very negative [laughter] so what do you think is the lynchpin of it here\nThe on a specific level the big issues you're our health care and clean air and clean water we have local issues with water pollution from a military base and air pollution but the\nOverarching issue that ties all of us together is money in politics my opponent has taken a million dollars in corporate tax money I refuse to take a dime he's got seven and a half million dollars in superPAC contributions a huge amount of corporate money in this\nAnd I think people are fed up with that because that's what is blocking the people's business from getting done and you know people who are noticing that when I explain this is why you're not getting clean air and clean water when you want reform of Wall Street predatory lending\nWhen you want gun control the amount of money that flows in from the big corporate special interests\nStops every single thing that the people want you know frankly the situation with money in politics is outrageous\nThe amount of money it takes to run in the district like this in a suburban district on expensive media market like Philadelphia is ridiculous nobody can raise Fifteen million dollars without going to the corporations and begging them and of course their money comes with expectations comes with strings attached\nAnd so that's how the candidate votes\nSo yes I Am blessed to be able to do some self funding here I don't know how anybody could unless they take corporate money so we have to fix the system you know the largest voting bloc in America that understands this problem is the people who don't vote at all\nThey are not crazy when they think that their vote their voice is going to be drowned out by the voice of the big special interests how big a factor as President Trump\nIn your campaign is is huge I mean I don't bring him up when I go door to door but people blurt out that they want change they cannot stand the tone coming from Washington even Republicans not that they want to throw him overboard but they just hate\nThe tone still he's not on the ballot but is he on the ballot in a way I mean do you see your campaign in a way or the election as in a in a referendum\nOn Donald Trump it is becoming and largely through his own urging he goes around the country saying vote for blank as a vote for me he\nIs saying this is essentially a presidential election\nAnd of course interest is much higher a presidential election\nAnd the reality is this is the first chance the voters in this district in everywhere in the country have to express their feelings about what they're seeing and the last thing I think anybody wants to see is ... doing a victory lap around the rose garden on November seventh\nSo let me let's say the baby's let me ask you about both of the things that that last just brought up first of all the money going into the race tell me more about that\nWell Scott Wallace has put at least eight million dollars of his own family fortune into the race probably more when the final tallies come in about eleven million dollars has gone into the race from outside superPACs most of that Republican superPACs to help it's Patrick does he doesn't have the family money and all of the negative\nAnd most of it and what about the Trump factor we talk about that is is is that the president a factor in this race across the state it's\nFascinating yeah I mean when I talk to voters and ask them what are they thinking about the might mention jobs or taxes but pretty soon you get down to some version of I think the other side in this country has gone nuts and they have to be stopped and that really is about Trump\nI'm [noise]\nPoint seven WM after you get stories and insights\nThat make you stop and think it's radio you want everyone you know to hear in his radio that exists banks to the general support of listeners like you contribute now to support the silo Dr call one eight hundred Seventy five twenty twenty or visit W. M. F. E. dot org\n... being rediscovering contemplative practice with Mira by Bush who helped create Google Search inside your house\nAnd they help you get [noise] calm clear and open better able to hear what it is I'm supposed to be doing this my life and then doing ... least China in\nMm\nJoin us for on being with Chris the tip at that begins Sunday Morning at six right here on Ninety point seven FM W. M. F. E. Orlando\nI'm Janine hurts to these headlines authorities in Pittsburgh continue to search for a motive than the shooting at a synagogue this morning that left at least eleven people dead forty six year old Robert powers has been arrested authorities say he was injured and is hospitalized and shooting is being investigated as a hate crime\nDefense secretary Jim Mattis is in Bahrain attending an international conference on security told a gathering that the killing of Saudi journalist ... G undermine stability in the middle east\nAnd the ... million dollar national veterans museum and memorial is now open in Columbus ohio former secretary of state and retired General Colin Powell presided over the grand opening of the fifty three thousand square foot site\nI'm Janine hurts NPR News in Washington [noise]\nDo\nSupport for NPR comes from this station and from twenty three and me that personal genetic service working to help people understand their DNA learn more at twenty three and me dot com slash NPR radio\nFrom Mabel a language apps that teaches real life conversations and any language including Spanish French and German battles ten to Fifteen minute lessons are available in the app store or online at battle B a B B. E. L. dot com\nAnd from listeners like you who donate to this NPR station\n\nThis is all things considered from NPR News I'm Michelle Martin more now on this morning shooting at a synagogue in Pittsburgh, Pennsylvania the FBI is on the ground there helping to investigate the tragedy authorities are treating it as a hate crime NPR justice reporter Ryan Lucas is here with us now to tell us more hello Brian either\nFirst of all what can you tell us about the gunman at this point\nUh well we don't know a whole lot about 'em at this point he's been identified a as Robert Bowers of Pittsburgh resident or in terms of how this investigation is going to look the special agent in charge of the FBI field office in Pittsburgh a man by the name of Bob Jones laid out a bit of that today or here's what he had to say about how this is going to move forward\nAnd or the next several days and weeks we will look at everything and the suspects life is home his vehicle is social media and his movements over the last several days\nAh Jones says officers recovered and assault rifle and three hand guns at the scene a when a agents are gonna searches home they say that they'll take precautions that case there might be any sort of explosive devices there\nHe says the FBI does not believe at this point or that the suspect had any accomplices or he was not known to law enforcement before today says uh and he also says that the suspects full motive at this point is unknown but then of course is something that the FBI is going to work to find out\nWhat the president has call this an anti Semitic act and authorities say that they are looking at this as a hate crime investigation what does that mean and what does that tell us\nWell first off us attorney general Jeff Sessions has said in a statement that the Justice Department will file a hate crime or hate crimes and other criminal charges or in this case he says that there's no place for hatred of violence on the base of basis of religion\nOr the U.S attorney for the western district of Pennsylvania Scott Brady he says that prosecutors could file those charges as early as this evening but we're gonna have to wait and see what all those ... charges are going to entail\nAnd could you tell us a bit more about what hate crime charges would mean\nRight and in some cases a federal hate crime charges would bring a stiffer sentence or to take into account that particular nature of of the crime in a case like this a a former federal prosecutor tells me that it's likely wouldn't change that much\nBecause this sort of crime was eleven people killed uh the the sentence is likely to be significant anyways but federal hate crimes could bring into play a possibly the death penalty Pennsylvania does have a state death penalty although it hasn't been used in in quite some time\nBut treating the shooting and prosecuting it as a federal hate crime does send a message of the seriousness of the crime and that the federal government treats it as such a you'll recall of course the case of Dylann Roof\nOf who was convicted in the killing of nine black parishioners at a church in Charleston South Carolina the federal government in that case brought hate crime charges against him even though he was already facing state charges and ultimately a federal jury convicted him a and he uh he was sentenced to death\nAnd just as recently as you can to the degree that you know what happens next\nWell the FBI is just getting to work on this there's a large crime scene that will have to go through a half to collect evidence there are there's lab work to be done and then of course there's digging into the or the alleged shooter's social media history there\nFor Ninety point have the news comes from our land out how to cover the whatever whenever and wherever Orlando Health it's dedicated to providing many pathways act care including nine hospitals ten emergency rooms ten urgent care location in forty six outpatient centers more information is that she's darling do health dot com\nCustoms or possibly uh looking to question him\nThat is NPR justice reporter Ryan Lucas Ryan thank you so much for talking to us thank you\nAnd once again we are broadcasting today from W H y y in Philadelphia that is where we were when we got the terrible news of the shooting at a synagogue in Pittsburgh this morning\nAnd this in a week when two people were killed in Kentucky apparently because of their race\nAnd pipe bombs were sent to a prominent figures apparently because of their political views but even before those awful events we were hearing people across Pennsylvania tell us they are frustrated with the tone of this country's public discourse the lack of civility\nThey told us they hope to more unity and that is a message that might have special resonance in Gettysburg the site of an ethics civil war battle in Eighteen sixty three one of the country's bloody is from within fifty thousand Americans were injured or killed over the course of three days\nBut now in two thousand Eighteen a group of residents there had been meeting up in a historic church to practice what others preach\nBringing people of different political views together it's called politics fats and stability Democrat car Thompson a former college professor founded a group and twenty Seventeen Darcy Meyer also a Democrat joined a group to her friendship with Tom sent and Republican Chad collie is also a member and he told me why he got involved\nIn twenty six team in previous years before that was very politically involved I was vice chairman of the Republican Party here locally\nDuring the twenty sixth inning campaign or saw a lot of instability a lot of anger a lot of resentment and saw that coming to boiling point in many ways\nAnd encouraged me to stop and think about what was going on in the nation and so I resigned from that and made a vow to myself to get more involved in the community and talking to people who were on the other side of the you know\nIt sounds to me like this was something that was in you like I Need that you had I it's interesting that there are a number of\nNational political figures who've been calling for something like this layers on cases in Ohio or I Know maybe Joe Biden you could you know same arguments ... former governor of Pennsylvania from ... from a charity\nBut you it sounds like that was something that was kind of in you and it was and thankfully car and came up with a structure for that ... what about you is this something that was kind of a hunger within you and now now like really\nI um I have always been pretty staunch Democrat I that's where I live pretty much come down on on the left on most things call myself a progressive I never really thought about how important it was to bridge the divide until I got involved\nI think that realizing that that there is valid points to be made on both sides and there is a balance that we can find is has just on a real eye opening experience for me\nWhat did you envision when you started this group like what were you hoping to accomplish\nI was hoping that we could come to understand each other more\nAnd I I'm very ... and then as Darcy just said that there are valid points on all sides like Darcy I I'm a very Luke Luke with food or [noise]\nBut I think that the red voters have valid points that it will enrich all of us if we can listen to to each other it's sort of like the story of the blind man and the the elephant\nWhich um I don't know if you're familiar with the looked block's book\nExpert political judgment in which he actually test the theory that the more you investigate various points of view", "show_name": "All Things Considered (NPR)", "year": "2018", "city": "Orlando", "day": "27"}