{"month": "10", "state": "AZ", "station": "KJZK", "content": "Thanks listening to tell us the human and Thirteen twenty am AM radio ... daughter or your service of Arizona was from college we also dark\nI mean the radio network at eighty nine point five I spent Jay Jay Z a drink Williams Ninety One FM Jay Jay Z Prescott Ninety point seven fan J. J. D. J. Kingman and Ninety One point three F. M. blacks\nIn Prescott the chance of showers in a high of forty seven today east north east\nYou're listening to the Arizona community radio network on kj da ... point like Drake cage ACP Ninety put one Prescott and kj decay Ninety point seven king went\nOut to bars or not the summer absolutely casting quarters orange flame never natural about Bert spin off of ...\nInto bloom again in spring\nWater garden center in Prescott regard flowers or snap has to be fun to play with\nSupport for the Arizona community radio network is provided by Grand Canyon deer farm eight miles east of William's on the interstate forty walk among the deer feed them right out of your hand the hundreds of animals up close elk\nBuffalo boroughs camel cool watching Monday kangaroo llamas Rainier and more the Grand Canyon deer farm near William\nWe believe you're going to be with\nWater started under your reliable source for local news and sport northwest public radio Ninety One point three deaths in ... park that day\n[noise]\nYou know [noise]\nYou're ... oh\nI don't\nThe weight and then\n\nLa la la\n[noise]\nYeah\nNa\n\n\nYou know yeah that day\n\nI don't really [noise]\nI'm trying to make up\n\nLa la\nLa\nLa\nOut\n\nAnd an outline\n[laughter]\nOh you mean the fact that we know\nAnd it's\n\n...\nI'm\n\nLaw\nNo not in no rule\nMaking America go I mean they're they're calling and not that and I\nNo longer\nGirl in New York thing or\nLeg things you know I mean like I'm losing you then money they hang\nWell\n... well\n\n...\n...\nRather than magazine away from the beginning it sounds like a man shot without why would they in the game and ... and I'm going to happen\nChange I think they know\nNa na\nJune ...\nThe fragile are protected ...\nAnd then there's the New York where\nLarger and he's urging\nSlow and then a\nNo doorway you talk\nQuestions right direction is really\nKnowing that there is no\nSpends all day long\nMaybe we'll get Barney years to get the\nNumber one in the ah the gold\nThe bill\nWe will and fires and their lives you know\nWe do\nThe sidewalk and I know\nFeel in the ...\n\nTo believe in yeah you can use we respect the\n...\nYou're just knowing that there is no\nThis man's name will do\nThirty years we've been\nOn one day a week on\nWe'll be doing those\nThis to me in some of the names of all the\nMaybe we'll get forty years demands and willing and many of\nAnd the you\n\n\n...\n\n\nThis is Richard Trump's all around you're listening to on the current American music ... ...\n\nMaybe ...\nKnow no\nTo be\n...\nOld are you seeing\nNa na na\nNa\nNa na\nOver here\nLong\nVery highly trained ...\nNo one\nNa na na\nNa na\nNa na na na\nNa\nNa na na na\nOh that's a new one for Richard Thompson well we have the whole album were picking different tracks often playing but different times just 'cause I Can't wait to read ... you know Thirteen reverse the name of the album Richard Thompson with oh Cinderella\nWas from the cooks also from the u._k. chicken bones\nFrom let's go sunshine they've been around for a long time so interested in the back doing it and I'm used to go before that were slippery people misty are we talking trash it's undercurrents I'm Greg and if you just joined this welcome re Bonneville as anyone else in some of their\nFirst let's go to the list that listen country songs Johnny Cash came to his daughter to learn as part of her country music legacy here she is with that was still doing already by the number\nHard\n\nThey use me\n\nNa na\nHave\nNa\nOr na Adel\nTo know your email on when he\nYou come back\nNa ...\n\nNa\nNa\nNa na\n[laughter]\nWe bring in a while while then my\n... you know\nAnd he loves to ground zero\nTo ... ...\nThe pool to\nZero for\nAnd me\nGive you a young\nA whole lot of\n...\nTo ... Russia which has", "year": "2018", "show_name": "Here and Now (PRI)", "city": "Kingman", "day": "16"}