{"month": "10", "state": "AZ", "station": "KJZK", "content": "And kj Nikkei Ninety point seven can't win support for the Arizona community radio network is provided by Cayman regional medical center fall means cooler temperatures football\nAnd the flu this flu season get vaccinated help protect yourself and the most vulnerable members of our community asked you Karen see provider if the flu vaccine is right for U. K. R. M. C.\nHi this is Dave what are your hopes for radio on lakes joined me as we weren't allowed you to be able to do that every week we put our notion of ground searching in the back their music mixes under appreciated robotic used them in your candy\nIt's radio on Sunday night today right here I'm ... radio eighty nine point five out of the cage eighty eight great Prescott valley and now the point one F. M. K. J. D. P. Prescott\nWe believe you're never\nDream that water starting center\nIntelligent radio northwest Arizona Public radio Ninety point seven FM kingdom\nNorman boy right tutor which is which is why I\nThem the latest from Bob Skaggs says radiator one [noise]\nYeah I Try to you\nSo you can't just say I'm\n\nBut I don't\nSo you're right\n\n\n\nSee you\n\n\n\n[laughter]\n\n\n\nNa na\n\n\nNa na na\n\nNa\n\n\n\nHi this is Chris would olive wood and John aren't we all the ... brothers and you're listening to under current yeah and\n\nYeah began to were reading what\nTo do is change\n\n\n\n\n\n\nFly\n\n\n\n\n\nWell\nNa na\nDi di di ... than\nAnd and make a shiny and I go out\nAnd buy right I'm going to stay\nA show and how\n\nWe should say\nHe made a leg\nMan\n\nThe street and bringing them\nFly arguing the charm oh\nA page out there to say now\nA days just talk I don't know what's\nDown a breach did but I'm going\nTo a degree of along\nNa na\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\nAt all and that\nThe around loose grandson while\nThey're doing the book store I'm just\nBreach aren't there should ever drink I'm On\nA package or whatever but\nVery good job and all the time\nA degree and do you own a ... mile peace of mind\nBe the thing about the fact of the last job as an\nNot stop and spoil\nOh I went out to buy the\nA ... or whether\nFree education download it or not I am a young time\nA great job do you go again na na na na na na\n\n... ...\n... ...\n...\n...\n...\n... ...\n... ... ...\nMm\n\n\nThat'd be great to just be able to sit on the front porch and play like that as this one of those kind of bucket list thanks nobody Blake Chattanooga Iraq from would wire in words Norman Blake\nGary small band is Lucretia kitchen yes the biggest thing in a lame deer O N D Wyoming I think it's a fictitious place but\nProbably a lot of places just like it around the country it's like any need Starbucks and it was carrying Moore's latest when I arrived just before that hey it's under current and if you just didn't know where he's there's plenty more music on the way made a staples coming up\nWe're going to take it back a few years now to an album Reich who to put my name is buddy each of them has a theme of this was about to relieve labor organizers Communist Party and stuff like that\nYet it applies now to these types one cat one vote one beer\nDrunk ...\nSet me up the whole cast me\nJoe is you know I still think\nBetter make it one cat\nMan said", "show_name": "Here and Now (PRI)", "year": "2018", "city": "Kingman", "day": "30"}