{"month": "10", "state": "TN", "station": "WJCW", "content": "I don't want to reveal how corrupt I Am in a different I Am I'm a fluffier with Alabama and I'm a bulldog with you I'm a lap dog but I'm an attack dog a President Trump or hey just keep this in mind Leslie stall\nA keep this in mind I'm president and you know I'm president and you're not what is that when you are\nI'm president and you're not outside I'm president and you're in a isn't it wonderful it's just right [noise]\nPresident and you're in a and a you know they uh that whole um a lousy for saying well that doesn't matter we want [noise]\nJust a ... and they don't know how to respond ...\nShe was stunned by all of this and slack jawed [noise]\nLeslie stall has lived for about one third of the history of the United states of America she said one third of the history of the United states of America [noise]\nI'm president and you're not you're listening to the Chris plants show [noise]\nThe following is not an actor that are real life story from trinity debt management\nMy story begins with that and a lot of credit card debt and I hurt a commercial for trinity I gave them a call\nIf you're in depth and you need him called trinity a one eight hundred three eight three oh six eight seven\nWhen I first called I was a little embarrassed and kind of a shame and I look at the numbers and I saw how quickly that astronomical debt that was in my life would go way\nCommunity will consolidate your accounts into one easy to manage monthly payment reduce your interest and possibly improve your credit score you'll save thousands\nWhat I Would tell other people please pick up the phone and call China and he'd just let them put together a program and see how affordable and easy it has to pay off your debt and\nCoal trinity one eight hundred three eight three oh six eight seven that's one eight hundred three eight three oh six eight seven\n... results very notice solicitation for legal services if you owe the IRS taxes payroll taxes were I'm not filed you return the IRS will get you they can take your property take you to court even put you in jail with one called to wall you'll never need to talk to the IRS again our average\nClients settles for about ten percent of what his old we offer free face to face consultations in your local area call eight hundred Seventy seven zero for three three that's eight hundred Seventy seven zero for three three\nIf you or someone you know is struggling with addiction please call this toll free number right now eight hundred three nine zero nine five to eight that eight hundred three eight zero nine five to eight by calling your addiction team you're taking the first steps to recovery to help you need to be one Callaway eight hundred three nine zero nine five to eight make the\nFree call now eight hundred three nine zero nine five to eight your addiction teams are third party advertiser for various treatment centers and play some networks individual results will vary but your addiction team dot com forward slash turns for more information on\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online MBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the W. P. carry business graduate programs on line\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nIf you can hear me be thankful you see it's not a matter of if but when you're going to suffer\nFrom hearing loss and when you do you need to seek Greg halt him and his team at new hearings center he has over Thirty years of experience in his established the premier Center for hearing excellent Janelle region\nIs offices or conveniently located in ... Johnson City Bristol in Greenville you can visit them on line at new hearing center dot com and find the location closest to you you hear me\nIs an interesting they apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with age list male Macs a patent pending formula with an agreement that helps boost your total testosterone\nPromoting greater increases in muscle size and twice the reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first dirty diaper bottle free not ten days not Fifteen days for the full thirty days supply free\nYou text the word quick to Seventy nine Seventy nine Seventy not just pay shipping and handling finally a formula that boost total testosterone if you'll results with ageless male Macs are too intense please decreased use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine [noise]\n\nWas on television over the weekend revealing\n... levels of hypocrisy were not for a double standards liberals would have no standards at all [noise] she was on CBS Sunday Morning of all places I happened to be watching that yesterday morning\nAnd interestingly enough the CBS reporter anchored guy asked I was thinking it was ABC earlier asked\nHillary Clinton about Bill Clinton Monica Lewinsky the in turn the uh the the cigar the oval office all the other women that ah he cheats on Hillary with a should with all the pound me to stop should Bill Clinton have resigned when he found himself in the midst of this in Raleigh oh\nIn retrospect do you think\nBill should've resigned in the wake of the Monica Lewinsky scandal ... we're not it wasn't an abuse of\nPower now know there are people who look at\nThe incidence of the nineties and they say a president of the United states cannot have a consensual relationship with an intern the power imbalance in adult\nBut let me ask you to where the investigation of the current incumbent against him move right during the allegations have been made\nYeah and we found that your ... your ... lawyers like Lisa Bloom or we're out they're offering people pay days cash money a book deals hundreds of thousands if they'd come forward with some ginned up version of\nWhatever it is that you're pedaling so no absolutely not average should not because standards don't apply to us come on don't be ridiculous and here she is still being publicly humiliated\nShe's like a ... to the well still waving or arm yes bill you're still humiliate me let's go to Bernie Sanders Bernie Sanders was on a couple of different TV shows state of the union with Jake Tapper\nAnd then he was on ABC with George Stephanopoulos both of them are former Democrat political operatives both of them work for a Democrat politicians and we only have twelve years left before we die\nThe reality is what Democrats are\nWe have twelve years twelve years too so they actually cut the amount of carbon in our atmosphere or this planet our country the rest of the world is going to suffer irreversible damage we are in crisis mode and you are but in meditation\nThat virtually does not even recognize the reality of climate change and their policies working with the fossil fuel industry are making a bad situation worse\nYeah well it's right now we have twelve years or ten years ago we only had ten years I'm Glad to say we reset the clock and now it's twelve years they just the apocalypse as we keep chasing the apocalypse and kids leaping out in front of us further and further away by the way Bernie uh enjoyed doing interviews with say\nA Clinton Administration official and George Stephanopoulos on a former Democrat he'll saffron Jake Tapper neither want to ask them about James Hodgkinson they're talking about civility but not\nFrom the gyms motorcycle sales studio this or W J cw Johnson C team for Bristol accumulation gyms motorcycle sales on the motorcycle mile west markets re Johnson City\nHurricane visit pump pale mission I my boss\nPresident Trump is in Florida detour areas hard hit by hurricane Michael Singh moments ago well getting off the air force one\nMore from corresponding ... power still out in areas hit the hardest by Michael in Panama City it's estimated power won't be back on until October twenty fourth longer in other places this woman says it's dangerous at night because of impassable wrote\nI can hear at night a lot of ... in the area and then it calms down\nA curfew in effect for bay county still this Mexico beach man lost his home and is waiting to hear from his insurance company they can't do anything to Utah to ensure ...\nJust waiting on them now lots of unknowns remain in the Florida Panhandle with a long path to recovery ahead Clinton novel Panama City Florida\nThat's horrible that stuff they give cancer patients that's that's that's horrible Oh yes we\nDo what they love it uh in fact a strict lost a hundred times with us it was the best thing for his help it ever happened to meet us whether it's crazy you'll get um ensure we can't well United States doesn't do that [laughter]\nFind the Trump patronage hatred of everybody that isn't them like I said just based on the last two weeks of the Capitol hearing the Democrat Party today as constant deserves to lose in the biggest landslide in a history of landslides a Democrat Party deserves to get\nBy [noise]\nFor the tactics they have engaged in for the actions taken by their lunatic and paid supporters\n[noise] [noise] it's just outrageous the kinds of things that they are engaging in and then the decent world and in a sand society they wouldn't be punished gravely [noise]\nIn the midterms I still hold out hope that they could be my\nPoint is we will get to all of this as the day is unfold\nIn this weekend in coming weeks but here we go with Donald Trump and Leslie stall on sixty minutes provided provided that are soundbites work I'm not confident now so the only way to know is to give it a shot the first one is Leslie stall\n[noise] talking to Trump about the suppose it hostility that he has created between the European Union allies and us\nWell I I mean what's ... we have wonderful relationship is a lot of people but we don't really teach us much worse than the European Union the European Union on line was formed in order to take advantage of us on trade\nAnd that's what they've done is hot and yet they it's not hostile sounds hot sauce on the way they treat us we're not how somebody can in daily within within the stupid country for so many years are you willing to get rid of that western alliance now I like they don't then is fine\nBut you know why we shouldn't be paying almost the entire cost of NATO to protect you and then on top of that they take advantage of us on trade and not going to do it any more they understand okay\n[noise] [noise] so what once again we have here the concept but just so hostile to ... ... it sounds so hostile it sounds so mean towns so it sounds so it's this is confrontational and of course in the eyes of the left we\nWant to be Europe they want us to be Europe they want us to be western\nSocialists they think still\nFunctioning at a democracy but but that's that's what they want us so we should be forthcoming\nAnd tolerant we should be welcoming we should be in ... ourselves and this by the way this is just Donald Trump keeping a number of promises\nWe work with you to really understand your knees in dress those needs with the right solutions no more\nNo less just smart people getting to know your business with simple personalized solutions for fair price real human being human how's that sound\nWell probably like the opposite of a smoker [laughter]\nCalled eight eight eight months to to talk to someone without Louis today [noise]\n[noise]\nMm\nHow big a minor correction it's a it's a variety in which the\nEffort my Lesley Stahl is ripped to shreds not Vanity Fair it's six of one and a half dozen varieties not so much a celebrity focused ran against Vanity Fair is a but they are both left wing entertainment oriented and they do comments on left wing entertainers actors\nActresses TV so called journalist and so forth and and it it's just a little minor correction I get them confused occasionally here is uh just another sample from last night Trump\n... and Leslie stall\nYou know General Mattis said to you the reason for NATO and the reason for all these alliances in St prevent World War three\nNo it's not true but frankly I like General Mattis I think I Know more about it than he does and I know more about it from the standpoint of fairness that I can tell you to try one more time okay I Know unless you have to try it again [laughter] I Know that how ants and my ... the answer is this\nI Will always be there with NATO but they have to pay their way I'm fully in favor of NATO but I don't want to be taken advantage\nOf white and general manager so I think I Know more about it than he does I Know more about it from the standpoint of fairness that I can tell you he's talking about the fairness of do is the fairness of all the NATO members paying their own way\nHe's also talking about people like Angela Merkel making a side deal with Russia and potent for natural gas shipments\nExplosively into Germany ignoring other NATO allies and you'll notice a sixty minutes isn't going to Angela Merkel and asking her\nWhy she is undermining NATO [noise] Trump already called her out on it for doing this\nThe Trump supposedly in the pockets of the of the Russians but Trump knows what sixty minutes or less they still trying to do here that's what they don't get\nThey can't sneak up on people anymore particularly Trump he knows\nHe in fact you know one thing he says I don't know if we've got on the roster coming up probably do the he said something to her that is as as honest and true as anything he's ever said because I Know Donald Trump I've known him a long time I played golf and I've known him a long time before he ran for office\nAnd he would ask me\nAbout various Democrats asked me about Obama and I can tell that sometimes when I told him what I think\nHe didn't agree especially when discussions in the media came up\nHe thought I was maybe just a little bit over the top exaggerating and some of the things I Would tell him about my opinions of the ... he said to her\nI had no idea and I'm being really serious with you Leslie I had no idea how dishonest the media is until I ran for president [noise] I had no idea I being really serious with you he said [noise]\nAnd I I think that's probably true as a New Yorker and immersed in New York media where he was a star [noise]\nWhen he wasn't running for office it was a local New York's by you know he made fun of him and they laugh but but he was a big get he appeared everywhere\nAnd they loved him and he was great front cover back cover of the tabloids the daily news and the post\nWhen he ran for president that's when all of the good vibes about trauma there were some bad things too I mean he didn't get universally loved praised coverage but it all vanished when he ran\nAnd he was surprised in a way kind of like McCain was\n[noise]\nSo when he said to her last night I had no idea I really telling you Leslie I'm really shocked that was really surprised\nThat this honest that's the word he uses instead of biased [noise]\nAnd I can tell you that that's true now what else has he learned that he didn't know but he knew\nBefore he ran for office and I think a lot about the left a lot about Democrats particularly liberal Democrats that he hadn't thought of in ways you and I did but now since he suffered the treatment is fully\nRush Limbaugh\nMuggy I feed network\nThey folks the IRS does not mess around you know that they have the power to take everything your bank accounts your paycheck even your home in business\nNow if you own back taxes it's about to get worse the IRS has added a small army of private tax collectors and their job is to find you to track you down\nYou need to co opt them a tax relief they're the good guys the experts who do this best\nThey're experts in a fresh start initiative that's a special IRS program that could save you a thousands even tens of thousands if you're qualified\nOne call can start the process to stop the demands letters stop the aggressive collection actions optimum has resolved over a half billion in tax debt for their clients\nThey are a plus rated with the better Business Bureau call for your free consultation now it's free call you have options eight hundred nine seven three Seventy seven hundred eight hundred nine seven three Seventy seven hundred a\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that open doors to some of the most influential CEOs tech companies law firms entrepreneur isn't thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nLearn more about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nLook into any great business whether it's a manufacturing or a hotel a store\nLook into each and every one of them and you'll find the same thing\nGrown us we believe that great businesses are powered by great people and with criminals workforce solutions we'll help you find them\nKeep them and engage them learn more criminals dot com grownups workforce innovation works [noise]\n\nWould you believe the one thousand forty nine Americans pay more in tax revenue than the bottom Seventy percent of Americans pay one thousand forty nine people pay more in taxes than Seventy percent of the population pays\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network\nFire walls have new requirements for businesses leveraging fast paced applications and public clap platforms like a double us Asher and Google Cloud we're in the cloud generation now so you're fire will have to be engineered to fit right in\nReclaim your club network trying barracuda cloud generation network or application firewall free at ... dot com slash fire walls\nI used to pass a job ... only to sort through tons of resume just to find a female candidate for myself the my hair salon that old process was not smart and I went to the appropriate air it's technology scams resume for me to find the right people and actively invite them to apply to walk it qualified\nCandidates that smart see ways they could read it never went by employees in the U. S. right now for free and different ... dot com slash free that the recruiter dot com slash free\nZip recruiter smartest way to the center of the rating of hiring sites with everyone has a review\nFrom the gyms motorcycle sales studio this W. J. C. double Johnson sea Kingsport Bristol accumulate station gyms motorcycle sales on the motorcycle mile west markets re Johnson City [noise]\n\nTouring disaster Saudi trip Hi Mike boss\nSaying he wants to make sure that victims are getting what they need President Trump is touring the areas of Florida in Georgia that were hit by hurricane Michael this woman\nSays the president's visit will be helpful to the region and the president himself gets good anytime\nA public figure gets out like that to see something first hand as opposed to relying on the news media and other outlets to provide him in the information seen it firsthand definitely brings it\nMore real after Florida the president will visit areas in Georgia hit hard by Michael\nAnd yet how often do you hear every ... both parties politicians\nRunning around and we're going to middle class after the middle class pregnant burn through bad but we got to cut middle there isn't much to cut that any more [noise] when it comes to income taxes\nNow which small percentile of taxpayers also\nPaid three percent or more it's fourteen hundred taxpayers [laughter]\nThe top point zero zero one percent the top one one hundred\nPercent for teen hundred taxpayers [noise]\nThat group alone paid free point two five percent of all tax is one thousand forty nine people is the exact number one thousand or fourteen hundred and forty of which is a little round it to fourteen hundred\nFourteen hundred tax payers paid more [noise] than the bottom Seventy percent [laughter]\nIn two thousand one in the bottom fifty percent paid nearly five percent of the top [laughter]\nOne thousand percent pay to point three so the burden of paying taxes is increasing on the rich [noise]\nNot decreasing [laughter] it is not\nTrue to say they are not paying their fair share now this is as it's supposed to be by the way when there are marginal rate tax reductions when you reduce income tax rates you generate more tax revenue [noise]\nBecause people shelter last they avoid if if if if you tell people that are going to be able to keep say Seventy cents of every dollar as opposed to keeping [noise]\nForty cents or fifty cents of every dollar then they'll work much less hard at sheltering it and she'll it'd be more inclined to pay [noise]\nPlus you have more tax payers because all these people end up hiring more people as the economy grows so the fact that the rich are paying more [noise] he was actually part and parcel with the theories behind supply side economics of supply side tax policy at the bottom line is\nDoes anybody think it's fair [noise] that fourteen hundred people [noise] for\nGene hungry people out of three hundred and some odd million is it fair to fourteen hundred people one thousand four hundred people are paying more\nMoney in taxes than the bottom Seventy percent combined and yet we never stop hearing how\nUnfair [noise] ... [noise]\nThe rich are not paying their fair share it's a constant refrain and I doubt that it's ever going to change because if you get the votes of all fourteen hundred people you're not gonna win anything\nYou need the votes of the people in the bottom Seventy percent so you need to pander to them you need to constantly tell them how they are getting ripped off you didn't tell them how people aren't paying their fair share the left is very very good at this and what the lived ends up doing is telling people\nWere going to punish those rich we're going to punish them for you it's not fair didn't fair to have so much more money than you is not fair to not paying your fair share of their fair share of taxes that we're going to ... the bottom somebody just go yeah baby punish them\n[noise]\nCNN's Chris Cuomo the son of Mario the pious [noise]\nSaid that [noise] [noise]\nHe thought Donald Trump looked like he was thinking racist thoughts listening to Kanye West last week\nThey repeat that Chris ... of CNN [noise]\nAfter playing video of Kanye West [noise]\nTalking to Trump in the oval office said he didn't care what Kanye said he wanted to know what racist thoughts were going on in Trump's head [noise] my curiosity wasn't about what came out of ... miles of my one daughter went to what's going on in Trump's head\nLet's take a look at him here is my educated guess okay if\nOther than a warm serotonin flashing a happy hormone imaginary headlines and black loves drawn these blacker than Obama ... sad\n[noise] [noise] what other kind of racist thoughts as Trump maybe having here is Kanye goes on [noise] so is the racist here [noise]\n\nThe son of Mario the pious [noise] who sees race everywhere all the time even when it's not president even when he cannot pinpointed\n[noise]\nAnd my house in an educated guess of the critical moment it was like an educated guess you're in an ... west ... speaking Trump is thinking this is great this is great this guy's blacker than Obama this guy's on my side this guy's going to do wonders for me [noise]\nHow does he know what's going on in Trump's in [noise] you have a crystal ball [noise]\nBut no he's not racist [noise] I this is the kind of think it's I Know this is not going to be widely known until I tell people about it [noise] but I just who these people are and the things they're saying and doing I I just\nI I Know they're going to get votes I Know people are going to support him befuddles me though back to the Trump sixty minutes interview with Leslie stall we were up here at number oh this is a big number\nThree this\nIs Trump talking about the necessity of consequences\nFor illegal immigration Leslie stall question what about the force separation of migrant children from their parents\nThat was the same as the Obama law you know Obama had the same time it was on the books but he didn't enforce that line for them were launched that zero tolerance policy\nTo deter families with children and then everybody decided and the courts don't want separation and frankly when you don't do separate when you\nAllow parents to stay together okay when you allow that\nThen what happens is people are going to pour into our country are you gonna go back to that job in contact lenses\nLeslie for coming into our country illegally and part of the I mean part of the reason I have to blame myself the economy is so strong that everybody wants to come into the United states to get my fault\nLeslie I've done such a great job in the economy everybody wants to come here I'll take the blame for\nNow she says she misspoke there this\nLaw on the ... Obama certainly didn't for separation of just didn't get reported because Obama was cool and couldn't do anything wrong and if it was happening when Obama did it than there has to be good reasons for it\n[noise] remember we've got a two tier system of justice in this country and we have a two tier system of media\n[noise] [noise]\nWell see if it was on the books but he didn't force [noise]\nWhat is that what\nYou mean it was on the books that Obama didn't enforce the law but Trump begins enforce it but Trump didn't make the law [noise]\nThe Democrats Leslie stall included a tempted to make people think that Donald Trump purposely wrote a law or just enacted\nOne that separate they don't run from the family the ... and you wouldn't believe the number of brain dead people actually believe this happened I was watching\nAn episode of law and order in your S. U. V. the other night and they had a whole premise some guy keeping abandon kids in his basement in a cage was a hero because he was saving these kids after Trump policy and force them to be a band and he was saving them [noise]\nAnd he was just running child sex rings with them but they tried to make this guy out to be somewhat\nOf a hero because the whole point of the episode was to bash Trump for separating families when it's a law that he inherited I've looked at explain why the law exists and it's above and beyond they're having to be consequences for coming here illegally it has to do with the quest for asylum and the fact that [noise]\nWhere the parents are taken while their cases are decided is not suitable for kids the kids are put in much better surroundings and Sanders while their uh their family their their their adult\nParents cases are big adjudicate there's nothing\nThere's nothing me this is the United states of America we do not due to kids what these people are trying to tell you the Republican Party does the kids it's quite the exact opposite it's just more of a smear\n[noise] that the Democrats on the left of engaged in and Trump does not back down from it and even as I say variety magazine was stunned that Trump got away with dominating even with these questions a couple of more before the break up next\nShe says do you think that climate change is a hoax\nI think something's happening something is changing and it'll change back again I don't think it's a hoax I think there's probably a difference but I don't know that it's manmade I Will say this um\nI don't want to give trillions intrusions of dollars I don't want to lose millions and millions of jobs\nI don't want to be put in a disadvantage I Wish you could go to Greenland watch these huge chunks of ice just falling into the ocean raising the sea level and you don't know whether or not that would have happened with or without man you don't know\nExactly and you don't know that it doesn't happen all the time anyway you don't know when it started you don't want it and then you don't know how natural it might be\n[noise] but did you hear her say\nThe the chunks of ice falling into the ocean or raising sea levels\nRight now the tri city is partly cloudy skies to interest holding in the mid seventies tries to these area traffic no major issues of interstates looked good major four lane highways are in good shape at this hour resource center city council meets a special session this evening considering moving councilmember Doug plane or\nThe city notified cleaner in August the council was considering the aisle stripper malfeasance and neglected duty and last week the reasons for that were made public city officials say point or miss numerous council meetings into one council member that if he paid point or money for some property ballplayer out that he'd be leaving burst\nComic Poynter says should not be taken seriously that makes ... six Bristol, Virginia city hall a man with a revoked driver's license is facing charges after he was texting and driving which caused a crash this morning on interstate eighty one and Sullivan county\nTennessee highway patrol says three vehicles were involved in the right nearby markers Seventy one in the north bound lanes\nThe man's name is not yet been released\nThe director of the red cross chapter spent most of last we can do so in Alabama they want to call and said the red cross office and do that had to be evacuated ahead of hurricane Michael and she spent all when say hunkered down in a hotel she describes what she saw after Michael road through\nThe ... outside but there were tons of trees down the road and on the couch and watch the train on how and a lot of people without power\nYou can help by making a donation to the red cross and Tennessee's attorney general's joins several dozen other states last the federal government to take action legal robo calls\nThe attorneys general are seeking authority allowing service providers to use new technology to detect it blocking illegal spoof calls Wall Street today I was thirty seven the NASDAQ is all thirty the U.S and the ... point I'm Richard limited W. J. C. W. news\nDuring this nice warm Monday we'll be brief though today temperatures in the middle to upper seventies before the rain arrives this evening and that cooler will set in by tomorrow so from Seventy seven fifty seven tonight showers around this evening and\nEven some showers overnight tonight early tomorrow maybe if you're showers lingering on Tuesday cloudy sixty two on Tuesday and then we finally a clear out staying in a low sixties Wednesday I saw people that would that'd be the world is Jeremy on that\n[noise] any given moment in American Babies taking the time that\nI found that mental mouth for too many of the things that I talked to my town and now\nHe's in the pan babies who were born premature and are we going to come to the morning and believe me each year you can help to any fallen cast like\nToo much for the the\nUp and coming to challenge to\nMake strong\nYou want it to be a teacher when you were little but you grew up and things change when it's time to put it back on your list\nThings are happening in teaching today and you can be a part of me more to the party and you can\nDo to them cascades [noise]\n[noise]\n\nAs usual thank you for your patience we head back to the phones were we have to the phones and\nThis is Scott in Oklahoma City right to have you here Hi\nRush good to talk to you know it gives her\nLook Elizabeth Warren is resurrecting the one drop rule or an anti tell them a a rule created by a southern plantation owners Democrats say if you have one drop of blood was black you're black\nOr this was this was a grotesque cruel her her percentage is so small\nThey don't have to excuse me second hasn't really been adopted by civil rights activists now to that that if if you have one drop you can be called black\nBut that's exactly right intersection holiday requires quantification yeah and so when we need to know how much of a percentage\nOf pressure you are versus oppressed this ... this this rule is is grotesque widely discredited used by the KKK in the thirties use can Nazi Germany it against the Jews\nHere she comes again this is actually a dog whistle to her base it's not meant for Republicans it's not meant for conservatives is about her future run she needs to tell her base I'm On board with intersection analogy look how much of an oppressed ram and let's find out your percentage of a pressure to\n[noise] would you define the intersection out of it is a relatively new leftist activists\nConcept that I find that most people to whom I mentioned that have no idea what it is how would you define that\nLet glad to thanks for the opportunity to\nDo so much more than welcome to find a good host I've I have ever that no one little thinking and asking when they listen to a caller savings\nI agree with that look a intersection touted comes straight out of Marxism march said that at every one is either on a presser or oppressed they're either bourgeois or Pearl a target\nAt its later it's now being adopted to the idea of being able to declare percentages of what you are how oppressed and how much of a pressure you are it's called intersection nowadays because instead of just being one camp or the other\nGets spread across race gender sexual preference and other variables\nYes okay that's it intersection out of the four of the\nGreat on wash your you're talking uh you're you're\nIn language of ah people formerly educated on Marxism many people aren't that's why it's so successful uh yes any intersection out all the action is basically something that has been constructed by these Marxist\nJust saying that all of these different leftist organizations meet somewhere they all intersect with each other the feminist having this strain about them that that that I'm a cohabitation with that with ...\nAnd I'm a Islamic lists that then with illegal immigrants and their activist and we're all of these people intersect is where they unified\nWell yes but it also applies to the individual because of these let's say five different dimensions\nYou you are on a different scale and all of those and they intersect into a single number quantifiable says that this is how much of an oppressor or oppressed you are this is where you're on the scale\nOf course this is the root of all this and there was a recent white privilege stuff pops up some\nAbsolutely so now Elizabeth Warren because she wants to uh justify her cultural appropriation of a Harvard professor ... has to claim a particular percentage of intersection now or the oppression\nTo speak their language so she is saying that she is an old press she's interested in any way she is a woman therefore she's impressed by the patriarchy and now I Am not a one thousand twenty fourth Indian she is impressed by the white man\nWhich is a a again a resurrection of the one drop rule this percentage is so low as to be a joke you know I if I could say you know I took a DNA test about four years ago and of course you don't normally you'd never see me but believe me I'm white\nHowever when I discovered was zero point eight percent sub Saharan Africa\nWell that doesn't mean I'm going to Harvard and going to claim a professorship and African American studies but I have what is that almost eight times\nMore a sub Saharan African black heritage and me and she does Native American just\nPray just admitted sub Saharan is not automatically quote unquote black\nWell that that's right in in this instance because we've identified the ancestor\nFor the Afrikaners are not black\nUh well I I understand what you're saying I Am referring to blacks than okay All right\nI just want to mess because\nA sub Saharan this is something what do you mean subzero what is it what it was it and then you start talking to the sub continent than some people really get confused you jumping from from India or over to sub Saharan Africa is below the hair in desert a which is where most of the population of Africa is\nMost of it [noise] there is some north of this arid desert as well now I get I I I get your point a and her reason for doing this\nAll of that not withstanding the accuracy of it not withstanding the left is pretty upset that she chose this particular time to do this because they think it is totally self serving it does not do anything but distract\nFrom the mid term elections which are three weeks from tomorrow [noise] uh away\nYou'll see one or earnings go up we are and more\nYou know if you've done costs um squeaking like board marker [noise]\nEasily one of the most annoying office noises there is right up there with the woman who taps or Penn like she's doing a drum solo at a sold out arena [noise]\nAnd monster we can't stop those types of noises but we can quiet all the noise around finding the right talent you know the noise we're talking about all you're trying to do is fill rules for your company but instead you're being inundated with reps from job sites trying to see one size fits all products you don't need and your inbox is full of candidates you'd never even consider monster cuts through that noise\nWe work with you to really understand your knees into dress those needs with the right solutions\nNo more no less just smart people getting to know your business with simple personalized solutions for fair price real human being human how's that sound\nWell probably like the opposite of a smoker [laughter]\nCalled eight eight eight months to to talk to someone without Louis today permission you want it to be a teacher when you were little but you grew up and things change\nIt's time to put it back on your list\nThings are happening in teaching today and you can be a\nParty make more writing and yet you know [noise] [noise]\nYes sir ray Bobby el rushed bowl where half my science symbol brain tied behind my back [noise]\nAnd we got to spring Texas\nAnd this is Susan it's great to have you with us high\nLike a rash I Am I'm a transplanted Texan I'm center Moran center bread and when I Lived in our dead my a great great grandmother was a full blooded Cherokee and if I'm I'm calling via Barbra Streisand\nSaid wait wait you say you're sooner born and bred you are from Oklahoma absolutely I just did but you say sooner born and bred and people in in real limited think you're ... you're saying they have just as soon to be born dead\nNow and I I Am a proud proud Oklahoma and I love Texas\nToo but my my my big ... in Oklahoma and I am a I have a she sat ... says her great great grandmother or the Cherokee well so is mine we have\nUm you know family history but I'm the one sixteen Cherokee\nLet me ask you a question you're one sixty so you you are ... that's a lot you're you're considering what you're considered Cherokee right okay so she's her great great great return great great great grandmother and she is one\nThousand twenty fourth indeed if she had enough to become a Cherokee into it too well I'm I'm a member of the tribe\nNow and that's the deal rush\nMy my grandfather was one quarter it was his grandmother my mother was one eight I Am one sixteen but if you're not on the Cherokee row and the only tribe and Oklahoma that doesn't live in a if you don't\nOr if you're not on the road and it was shameful\nAnd so what do you think she is doing what he thinks what she's doing with is Susan\nIt's it's Barbara Streisand rush\nI'm a sixteenth I'm sixty four years old almost a week if she were it but it doesn't matter if your mother or your grandmother great grandmother didn't the Cherokee are the only tribe in Oklahoma you had to sign a row and it was shameful\nFor a Indian woman to marry a white man and they didn't then they wouldn't\nSign up it was shameful what about the ...\nIt ... businesses that are that\nBelonging I Am one sixteenth brash and I'm can't be a Cherokee and I didn't want any of their ... I was just kind of kind of proud of it but if your name is not on the road you run out of Cherokee and then\nIt just it just goes to show many here you are one sixteenth and you're not eligible is what you're saying if I'm hearing you right she's one thousand one of one thousand twenty fourth it's all about the identity politics with these people she wants\nThat to say something significant about her [noise] what\nWould that be I mean it it it it it [noise]\nIt's all silly and then the people denying that she used this for employment I think that's the sole reason she did\n[noise] to be able to demonstrate she has some minority blood qualify her to be hired at Harvard\nRush Limbaugh simply really tell me ER be worse\nThey ... the IRS does not mess around you know this they have the power to take everything your bank accounts your paycheck even your home in business\nNow if you all back taxes it's about to get worse the IRS has added a small army of private tax collectors and their job is to find you to track you down\nYou need to co opt them a tax relief they're the good guys the experts who do this best\nThey're experts in a fresh start initiative that's a special IRS program that could save you thousands even tens of thousands if you're qualified\nOne call can start the process to stop the demands letters stop the aggressive collection actions optimum has resolved over a half billion in tax debt for their clients\nThey are a plus rated with the better Business Bureau called for your free consultation now it's free calling you have options eight hundred nine seven three Seventy seven hundred eight hundred nine seven three Seventy seven hundred a\nBurning your degree from one of the top business schools in the country might sound impossible to fit into your workload\nWhat if there were a business degree that further your career and give you access to world renowned faculty leaders and mentors all on your schedule one that opened doors to some of the most influential CEOs tech companies law firms entrepreneur and thought leaders and what if you could earn that degree in his little less sixteen months one hundred percent on line\nTax fund to seven nine six four or five that's F. U. N. D. to seven nine six four or five\nStar to your online NBA information management or business analytics master's program from the W. P. carry school of business at Arizona State university today\nMore about the w._b. carry business graduate programs online\nTax fund to seven nine six four or five\nThat's F. U. N. D. to seven nine six four or five\nInterests may apply when did it become OK for men to be lazier softer fatter we need to bring them into this country back to greatness with aids list male Macs a patent pending formula within a greeting if that helps boost your total testosterone promoting greater increases in muscle size and twice\nThe reduction of body fat percentage that exercise alone plus an amazing sixty four percent increase in nitric oxide which can be handy in the gym and in the bedroom\nTake your manhood to the max by trying your first dirty diaper bottle free not ten days not Fifteen days for the full thirty days supply free\nYou text the word quick to Seventy nine Seventy nine Seventy not just pay shipping and handling finally a formula that boost total testosterone if you'll results with ageless male max or two and said please decreased use for your free bottle text quick\nSeventy nine Seventy nine Seventy nine\nText Q. U. I. C. K. to Seventy nine Seventy nine Seventy nine [noise]\nI just had an idle fought here no way of course to\nFind this out a document that but I Wonder\nI Wonder if the same guy who did\nThe ... the DNA\nTest on on a folk on us this is the same guy that did the lie detector test for for a doctor balls the Ford\nBoost monetary I guess we'll never know this but\nNever know how these people on the left coordinate things function and work together [noise]\nYou wouldn't put a square peg in a round hole so why would you deploy a traditional firewall in a modern decentralized network fire walls have new requirements for businesses leveraging fast paced applications and public climbed platforms like eight ws Asher and Google Cloud\nWe're in the cloud generation now so you're fire walls have to be engineered to fit right in reclaim your clock network trying barracuda ... generation network or application firewall free at ... dot com slash fire walls I used to\nPay for a job ... only to throw through tons of resume just to find a female candidate for myself the my hair salon that old process was not smart and I went to the appropriate here it's thick analogies games resumes for me to find the right people and practically invites them to fight the wagon qualified candidates that smart\n... recruiters read it never went by employees in the U.S try now for free at different ... dot com slash free that the recruiter dot com slash free zip recruiter smartest way to the center of celebrating hiring sanctions ever went has a review\nFrom the gyms motorcycle sales studio this or W J cw Johnson sea Kingsport Bristol accumulate say should gyms motorcycle sales on the motorcycle mile west markets re Johnson City [laughter]\n[noise] [noise] [noise]\nWell yeah the welfare but you don't say that because it's going to offend people are ... they wouldn't be on the\nReceiving end of the payments if they didn't have a health problem in the fact that it's pre existing what is preexisting it means you get the disease before you have insurance then you get the disease and you want the insurance you know other walk of life can you do that\nYou can set your house on fire and then call State Farm or whoever and buy homeowner's policy to protect you against fire they won't sell it to you\nYou can't I\nHave a bunch of stuff stolen from your house and they go by theft insurance\n[noise] nobody will sell it to you but when it comes to health care [noise] uh\nIf they don't sell it to you then all hell breaks loose and their ripped to shreds there's there's no\nThere's no making money interest\nPeople with preexisting conditions which then engenders the recent\nOne that was wrong people profiting from other people being sick and just shouldn't be more drama people should be given no cure for nothing and the people should provided for other for the good news took their hearts and\nThat's how it works out and when you have a political party that promotes that kind of thinking it's very very tough to compete with it so\nSomehow in this polling data preexisting conditions has come up and the Democrats are once again try to make hay on it by claiming the Republicans want to take it away in fact in Pennsylvania Bob casey in the Senate Senate race there\nBob casey has run an ad claiming that the Republican candidate for the Senate wants to deny his own grand daughter\n[noise] medical treatment she has cancer she's a single digit age ... she's a she's a baby in case\nHe's running an ad in saying that the Republican is so anti\nPeople that he wants his own daughter to not be given insurance to treat her I mean it it just it it's sick and they've got they've jumped all over Casey Casey campaign so we're not going to pull the ad\nSo the Democrats are running on preexisting conditions and the fact that Republicans again having all hearts when all the other Trump stuffing and CNN poll talks about this massive wave of independence that all of a sudden\nAccording to their policy in life\nWell\nFrom the McClatchy News Washington bureau headlined Republicans worry that Trump and his aides have no idea\nThe hell that may or weight [noise]\nThis article by Anita Kumar uses anonymous interviews with Washington Republicans and Obama Clinton and Bush hangers on [noise]\n[noise] Republicans who support President Trump have grown fearful that the White House is I'm prepared for the onslaught that may awaits them in January if a blue wave\nSucceeds and given the Democrats control of at least in the house of representatives in the mid term elections in November Democrats will have the power to subpoena documents enforce a dentist ration officials to testify about a slew of scandals\nIncluding edge using private email for government business agency's spending taxpayer money Trump resorts and sexual assault allegations involving Brett Kavanaugh five Republicans with close ties to the White House\nSaid that instead of preparing for what could be a years long attack by a newly emboldened Democrat run Congress Trump aides are wasting time trying to respond to nonstop controversies Trump tweets and the investigation into Russian interference in the twenties sixteen election\nTheir story says the White House should be hiring more staff to handle a congressional inquiries advising administration officials to retain their own lawyers and researching potential areas of vulnerability ranging from the death of four soldiers in Africa to the sluggish response or Hurricane Maria\nAccording to people who worked for Presidents Clinton Bush and Barack Hussein\nOh [noise] now\nAt first glance you would think that this was a story to Trump and his buddies are not aware of the show lacking they're going to take in three weeks\nThat they are blissfully auto aware that they're gonna lose the house maybe lose the Senate this story focuses on what's going to happen if that happened\nAnd to that extent this story under cells what is going to happen if the Democrats gained control of the house\nIf the Democrats gained control of the house\nEvery investigation into the deep state and the scandal involving Hillary in her emails and the Steele dossier and the spying on the Trump in all of that stops\nNo answers will be forthcoming no punishment to those involved they will get away with it\n[noise]\nAnd that's just the first thing\n\nVirtually every thing Donald Trump has achieved will be rolled back\nThey will do their best to reinstitute tax increases you know what I'm going to prepare a list of things\nThis might actually make a good I was talking about this the first artist might make a good\nUm illustration of what's gonna happen if the Democrats when it's not just the Democrats gaming control and by the way it's not just this story focuses on Trump and his buddies are not yet prepared that they're not aware that they're not focusing on the Democrats are gonna come investigate Trump\nAnd everybody associated with it that's going to happen and I can't believe companies people aren't aware of that\nUh\nI think it's my Trump's doing for rallies all week [noise] I think that's why Trump is working harder than any Republican at this moment to keep the Republicans in control of the house in the Senate\nIdea Trump doesn't get what's in the door if if if if this happens but specifically aside from all those things that they're going to aim at Trump the policy initiatives that have led to this great rebound and recovering economy is going to be brought to a screeching halt folks\nYou can say goodbye Trump these trade deals with Trump is they're going to start working on on doing everything Trump did at the same time paralyzing the remaining two years of the Trump Administration in terms of what is never going to get another judge confirmed any court any court anywhere\nNot a single one the talk will be we can't confirm a judge nominated by a guy who may be impeached we can't confirm a judge nominated by a guy who's not even going to be reelected in twenty twenty we can't do any of that\nIn fact we've got to prepare by unraveling everything this man is done and they're going to portray this as a dangerous twilight zone two years of horror for the American people\n[noise] it's\nIt's gonna be it's going to be brutal and you know when it's ... it's going to be what would have happened if Hillary in one\nExcept if Hillary had one we wouldn't know\nOver fifty percent of what we do know about just say the deep state for example and the efforts that they have made to undermine Trump's election his campaign his presidency stop and think of all the things we wouldn't even know if Hillary had one\n... would be on the Supreme Court probably a Lois Lerner might be running the IRS or take your pick Koskinen wouldn't go anywhere\n\nStruck Strunk Lisa Page McCabe all these people still be at the FBI\nCalling me\nWell Hillary might have gotten rid of him she hated him she was blamed it but but call me might have been the only sacrificial lamb fusion GPS would've become major players in the administration during opposition research on any opponent to Hillary and by the way any opponents Hillary or the Democrats would be targeted as Trump was\n\nIt's going to be brutal let me get back to the audio soundbites oh just one more thing about this poll the headline Republicans worry Trump and his aides have no idea what the hell no idea the held that may away what is this may business [noise]\nIt is is there is no you're not sure you're going to win\nThe White House is completely on prepared for the onslaught it will face if the house flips says a former official in the Trump White house\nWho would that be like Omarosa\n[noise]\nFrom a communications perspective but White House completely unprepared for the onslaught\nIt will face if the house with I Can't believe there's a solid in there that doesn't know what's coming\n[noise] second former Trump adviser said simply the White House was only able to focus on one thing at a time well that's absolutely be asked Trump proves that every day [noise]\nRepublicans on Capitol Hill have largely protected the Trump White house ... serious investigations were just not on your is your role in the White House and Congress are controlled by the same party\n... from a national [noise]\nIt is to thirty good afternoon ... were you just sit up all your news he was brought here by bought a vis the funeral home and atrocities right now partly sunny skies pictures holding in the mid seventies\nFry cities area traffic right and I do have a wreck in Johnson City university park which state of Franklin wrote universities state of Franklin be careful there\nAlso watch for school buses and the schools though is if this hour throughout the region a deadly we can house fire and green county remains under investigation\nTo children died in the fired a mobile home between ... time in Greenville six year old Joyce long and four year old Joshua walmer founded in their bedroom their parents tried to get them up but they could not do so stay far Marshall's office has been called\nA may have sustained serious injuries and we felt roof of the green county plant over the with him it happened at three in plant that's in the ... community the Mayor Bill twenty to thirty feet and landed on concrete he was floated the Johnson City medical center where he's in critical condition\nThe man was a contractor working for a roofing company washing the county mayor places sex charges involving a juvenile in western Kentucky shown Palmer the ... was arrested after a traffic stop in the town of beaver dam\nFormer city been smoking marijuana they police the bag and drug paraphernalia told authorities the juvenile was his sister but later admitted he met her on one and drove to a meter races a long list of charges and the just the city development authority has the John severe center building under contract\nLast month of Jaycee ... wanted to purchase the downtown building for four point one million dollars Mitch Miller CEO of the northeast Tennessee regional economic partnerships\nWill be looking to go for the county commission to amend the redevelopment plan I think that can mean some really great things for the future Johnson City\nFormer hotels currently being used for lower income housing Wall Street the Dell is up five points the NASDAQ is all thirty one a mature in love with the W. J. C. W. news\nFor doing this nice warm Monday we'll be brief though today temperatures in the middle to upper seventies before the rain arrives at the same thing and that cooler will set in by tomorrow so go from Seventy seven fifty seven tonight showers around this evening and\nEven some showers overnight tonight early tomorrow maybe if you're showers lingering on Tuesday cloudy sixty two on Tuesday and then we finally a clear out staying in a low sixties Wednesday I saw people that were there'd be they're all just Jeremy I\nLook into any great business whether it's a manufacturers or a hotel a store\nLooking to each and every one of them and you'll find the same thing\nGrown us we believe that great businesses are powered by great people and with criminals workforce solutions we'll help you find them\nKeep them and engage them learn more increments dot com grownups workforce innovation works [noise] [noise]\nAnd we just enjoy the ride [noise]\nMarcia gay harden how did you get any are getting on to add all your friends and things you can do to really\nLearn how to help reduce some risks to your brain that brain health [noise]\nKnow come back great to have your Rush Limbaugh [noise]\nRedefining hip [noise]\nOn the radio\nThere and got a sister that I have a\nYeah I've got two more here this is just one more with Trump intellectually stalled on sixty minutes last night which again variety magazine is really complain Trump on that dominated Leslie ... noticed what that\nMeans that the purpose of the energy [noise] west to destroy Trump the purpose of the end of it not to learn anything to get Trump's perspective but two weeks\nBalls Trump\nWhich of course is what all of journalism is aimed at us so here is Leslie stall what are your pledge when you promised [noise]\nCross your heart and hope to die you will not shut down the Mueller investigation so that we can finally get ready you\nKnow I don't play anything but I Will tell you I have no intention of doing that I think it's a very unfair investigation because there was no collusion of any kind of his last I don't want to play why should I pledge to hand it was I pledge pledge not to play like wow I have no intention of\nToday's thirty two people have been charged or ... guilty and special counsel Robert Mueller's investigation President Trump's campaign chairman top campaign aide former national security advisor\nAnd longtime personal attorney are all cooperating in the inquiry to president cause which I\nDidn't really think I'd call Russia to help me with an election give me a break they wouldn't be able to help me at all so called Russia so ridiculous\nI'm you know what I'm surprised has been able to keep his composure about this for as long as he has a honesty box the idea that the election is illegitimate and then he cheated with Russia and that\nHe was able to keep it such a secret that despite everybody in Washington writing books about it looking for evidence there isn't a sin skill of evidence I would've blown my top on this a long time ago\n[noise] and this is just clearly miss stating [noise] to date thirty two people\nHave been charged her twenty six of them are Russians who will never ever see the inside of a court room who were not charged with anything having to deal with Donald Trump there isn't a single one of these people it's been charged it has anything to do with Trump and she's including Michael Flynn and this and Manafort no there isn't a single charge\nHere [noise] by the way to drive by a very very depressed because that like Jonathan Turley a peace warning that left if you think Muller is going after obstruction currently says I don't think there is any I don't think mother's found any I don't think mother's even look at it that\nCurrently is trying to set people up not to be disappointed when mother doesn't deliver goods at least on the obstruction side I'm thirty two people have been charger pled guilty in special counsel Robert Mueller's in ... ... ... pled guilty\n[noise] [noise] [noise] to [noise] three [noise]\nAnd Manafort and written gates have nothing to do with Trump [noise] and Flynn [noise] was just to get rid of the prosecution so even said his family and said his bank account\n[noise]\nAs I say there there's a total of twenty five Russians in two different charges and they're bogus smaller knows that those Russians are never going to show up and be tried the charges against them are never going to be tested and Leslie stall knows this too that's what makes this also bogus\n[noise] why should I pledge to you why should I pledge to you [noise]\nIf I pledge I'll put but I've never played she you know I'm not going to shut down the moderator who the hell are you didn't tell me what I certainly shouldn't do it and make me promised to you Dr buys are not used to this and this one is on the related but this is the first guy that's gotten this right\n[noise] it's the first guy that's gotten\nThis right in twenty eight years twenty four year whatever number twenty six years\nThis was Sunday Morning on CSPAN Washington Journal the host steam scali is talking to NBC national political correspondent Steve ... core Nikki has a new book [noise]\nIt's called the red in the end of the blue the Nineteen nineties and the birth of political tribalism\nAnd scali says ... ... talk about the\nIssue of opinion journalism which we see on Fox\nAnd PMS NBC and CNN Roger\nAles Nineteen Ninety six he produced Rush Limbaugh's television show or in the early Nineteen Ninety he saw though through Rush Limbaugh I think he saw through Rush Limbaugh's radio show and his television show in the Nineteen nineties that there was this very large audience on the right that was very dissatisfied with the idea of the mainstream media\nHe's the only guy who's actually gotten this right they always say that ails created Limbaugh and Fox News\nAnd then\nThey always try to distance ales from having had anything to do with my TV show that Fox News started out of the uh the witches brew nothing and so forth at Cornell is the first guy to get this timeline and and the\nUm [noise] well the circle of a man's [noise] correctly\nThere are some people have gotten close just some people said you know when Fox News started it was like\nTalk radio on TV and people\nWonder we're ales got them idea people would say and I would just stand there and smiled kind of wink\nAnd a and odd\nBut nobody ever wanted to connect the two because that would mean putting me in the equation we can't do that so I don't know what got it according ... NBC News national political correspondent buddy buddy when he got it right [noise] um [noise] let's see", "year": "2018", "show_name": "The Rush Limbaugh Show", "city": "Johnson City", "day": "15"}