{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n\n\n\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nAn earlier work by Columbia bc he was twenty four composed the petite sweet sweet her to perform but the oldster orchestra with you on ...\nThe stations have been ... be music radio R. W. M. A. H. Biloxi there'll be him a boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. ... W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MP be music radio and listen online at MVP on line duck or gee\nYou're MBP car tag anytime it doesn't even have to be up for renewal simply go to your county office to sign up when you get in the car tank pushing it to be helped him Bebe continue to educate informed entertainment [noise]\nForgave him in the beyond ... slash card cash\nWe'll see you on the road\n\n[noise] what Peter's Beethoven's near that gets categorized into early middle and late period [noise]\n[noise] [noise]\nAnd you'd think considering what happened to his life especially with his death now that you know most of the staff would be from after his military but not so death symphony number two is from the end of his early period [noise]\nEighteen now too and it was at that time that he realized he was losing his hearing profoundly he was highly can shot\n[noise]\nLady persevered and wrote a lot more music after his second symphony it's coming up in about Fifteen minutes [noise]\n\n\n[noise] this is the ... movement from the in minor concertina for horn by car race on paper with Herman down with an MBA Mike ... house led by current my summer\nOr whatever [laughter]\n[laughter]\nI don't think that I've ever\n\nHeard of it but\nNo\n\nNo and\nTalk about what\nThey\nWhat\n\n\n\n\nWhoa whoa\nWhoa whoa whoa whoa whoa whoa\nWhoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa whoa\nLet us to join let's be Mary from the ... music with the check ... orchestra and chorus and the soloist is Gabriella ...\n... ... was the Sopranos\nOh\n\n\nIf you were a fan of Beethoven back when he is alive and we're lucky enough to be invited to send them his premieres boy did you get a lot of Beethoven for the Bach has it worked for instance at the end of his early ... when he was highly can shot\n'em and you may remember the high like instant testament he wrote it was a letter he wrote I'm Talking about how ... how much despair he felt realizing that he was losing his hearing\nAnd therefore he realized at some point losing his music as well although he never really get completely although I've had some effect in the later period of his life this is probably one of the last works and what they call his early period about that time an Eighteen oh too that he realized he was going deaf\nAnd what did you get when you went to a Beethoven premier well for instance when the second symphony pre marriage also got the third piano concerto and the oratory of Christ or the ... it's quite the evening here's the second symphony from Eighteen oh to the NFL romantic lead by cloudy out about how\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n... na na na na na\n\n\nNa na na na na na\n\n[noise]\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\nMm\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n[noise] Mm\n\n", "show_name": "Everyday Tech", "year": "2018", "city": "Jackson", "day": "03"}