{"month": "10", "state": "MS", "station": "WMPN", "content": "[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nThat's what I\nDon't know that that\n[noise] [noise]\n\n[noise]\nWell [noise]\n\n\n\n\n\n\nThat last movement nicknamed the hunts and there's really kind of a\nDashing along sounds too it's your bobbing up and down some kind of\nA wild chase going on since ... foreign can share newly ... major by Leopold Mozart ... stand kind of nice to see him getting little attention as a composer to to this morning so Lewis chairman nearest in and Michael ...\nPerformed at the ensemble concerto Rotterdam freezing conducted\nThe stations have been ... music radio R. W. M. A. H. Biloxi to beat him a boondoggle W. M. A. U. Butte\nW. M. P. in Jackson W. M. A. W. Meridian W and may be structural W. M. A. V. Oxford W. M. A. O. Greenwood check out what's happening on MTV music radio and listen on line at him be be online dot O. R. G.\nOn October twenty third joined in ... in the Mississippi department of archives in\nHistory as we were greeted by America's first people with a preview screen no they never married [noise] series to impede the TV\nHere from Dr Ronny Etheridge told Jay west when they talk about America's first people this exclusive screening begins to be in October twenty third at the museum of Mississippi history for more information does it end peed on\n\nHere we have that nibble German fellow again who was kind of like a cultural impressionistic cultural\nRitual little Laurie it will Jordan or if you will a Frank Gore show\nThe joker yes but he was also a gifted impression is ever see him do Richard Burton in the last scene of Camelot well I I digress much Brooke was this cultural rich little Franco Russian et cetera\nEt cetera and in this case he immersed himself in Scottish folklore\nAnd it's a ... attractive piece taking for Scottish folk tunes and weaving them into a what we might call a violin concerto or not it's called the Scottish Fantasy and me Dorie plays it about Fifteen minutes [noise]\n\n[noise] this is a romance for the keyboard by Oscar memory ... to ... ... ... is the pianist\n\n...\n\n...\n\n...\n... ...\n...\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n\nMm\n\n\n[noise]\n\nFrom the marsh orchestras sitting us shimmering signature WC music pure blood and the Cleveland Orchestra\nIn a moment ... broke and his wonderfully attractive Scottish Fantasy things are always wonder if they try to when they're based on folk music are they not just a minute [noise]\n\n\n\n\n\n\n\n\n[noise] dusty Miller and I'm doing ... Johnny and most famously in the final ... broke quotes Scott's well Hey Scott who have with Wallace bled an old tune that Robert Burns\nA set to his lyric Robert versus march on Bert you'll notice to marshal the military and\nHope that it's the final moments of the Scottish Fantasy in its entirety here me Dorie is sold was with the Israel philharmonic led by ... been made\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\nGoing on [noise]\n[noise]\n\n\n\n\nUm\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\nMm [noise]\n[noise]\n\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n[noise]\n\nNo\n[noise] [laughter]\n\n[laughter] [noise]\nAre you\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n[noise] mhm [noise]\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n", "year": "2018", "show_name": "Everyday Tech", "city": "Jackson", "day": "17"}