{"month": "10", "state": "FL", "station": "WMFE", "content": "Hi I'm off on taking all of our president and general manager of maybe point seven W. M. F. E. it's been a full two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do it now have you been messy family\nDon't your support all uninterrupted programming by donating a dollar a day W. M. F. U. dot org or cold one hundred Seventy five twenty twenty help\nYou want to do that if you take her out she came to the right place shut out of the polls over the next movie [noise]\n\nJoin us for revealed from the center of investigative reporting that begins this afternoon it too right\nHere on Ninety point seven FM W. M. F. E. Orlando\nNinety seven W. N. F. E. FM\nOrlando support for Ninety point seven news comes from site and bacher energy bars a hunting almonds snack coated in German chocolate that's the source of fiber in protein and but they're gluten free\nSite and back or energy bars are available and food stores or supermarkets throughout central Florida\n[noise] coming up on asked me another comedian Nick cruel tell us about a real life incident that inspired his animated show big\nNow I got parents by a girl in front of my like middle school of crush [noise]\nI'm now I'm a comedian [noise]\nThen Jonathan Gold and does a deep dive into the nineties and a music parity game what does it wants to eat again I'm caring for a key chain pet\nI'm a hot tea chain pet\nAnd we play a game called ...\nWhere we mash up Matt terms with other words and phrases Mickey ... takes down quantities that aren't whole numbers in this rap where she rhymes King Kong with king dumb joined meal\nYou're either very for NPR's hour plus those word games and trivia but first the new [noise]\nLive from NPR News in Washington I'm Barbara fine after two weeks of denials Saudi Arabia is admitting that journalists Jamal ... show Jay was killed inside its consulate in ... the BBC's Martin patience report\nSaudi Arabia claims to fight broke out between ... and the people waiting for them inside the ... would you like that\nBut many will question Saudi Arabia's ration of vans which suggests this was some kind of kidnapping operation that went wrong that's in stark contrast to Turkish media reports which they missed the show she was tortured march towards I managed Baltic dismembered\nTurkish authorities say they're searching for his show Jay's body and will reveal the findings of their investigation President Trump meanwhile calls the Saudi explanation credible and his praised the kingdom for acting quickly but several lawmakers on Capitol Hill say they disagree\nPresident Trump leads a rally in El cone of that ad today the last stop and a three day campaign swing for Republican candidates in the upcoming midterm elections Trump was in Arizona last night and NPR's Don Gonyea was there\nThat President is highlighting news reports of a caravan of thousands of migrants heading for the U.S border from Central America to warn of dire consequences if Democrats are elected it is signature Trump political rhetoric as sledgehammer\nHe calls a Democrat evil and wanting open borders to allow criminal elements into the country this is a new Trump campaign slogan from last night in Mesa, Arizona\nDemocrats produce mobs Republicans Rogers job the president tried to boost voter turnout\nAmong the strongest supporters this trip was to Montana Arizona and today Nevada all places with very close US Senate contest\nDon Gonyea NPR News Scottsdale, Arizona\nViolence has disrupted Afghanistan's long delayed parliamentary elections several people are dead after a suicide bomber attacked a polling station in Kabul today Jennifer glasses in Kabul\nThe suicide bomber was trying to get into a polling station when he detonated an explosive killing and wounding police and civilians it is so far the biggest single attack on the election\nThere's been a number of bombings and attacks around the country most of the Taliban and Islamic state warned voters to stay away from the polls but Afghans have been defiant standing in long lines to cast their vote in a parliamentary contest that was supposed to be held three years ago it was far from perfect\nProblems with technology and logistics at polling stations opened late or not at all the voting has been extended through Sunday at nearly four hundred voting site for NPR News I'm Jennifer glass in Kabul\nThis is NPR Hi I'm Mark Mehmet NPR's standards and practices editor who's a quiz for you which are the following sentences is grammatically incorrect\nHey they celebrated their one year anniversary or be they celebrated their first anniversary\nSeen one year anniversary would actually be redundant so the correct answer ... be\nThe difference might seem insignificant but when our listeners turned to us for fairness and accuracy using the correct language used important\nPublic radio reporters across the country work every day to bring you clear and transparent reporting cuts in foreign quite strong ethics and we count on you to when you sign up to become a new member of this public radio community you help our reporters and editors to get it right to\nBecome a new member today here's how\nIt's easy to support Ninety point seven WMA feet during this time with Dr who's a W. M. F. E. dot ORG call one eight hundred Seventy five twenty twenty you can make a one time gift or become a sustaining member with a set amount monthly from a bank account or credit card\nIf you become a sustaining member how about thirty dollars a month or more will send you a pair of nutty point seven W. M. F. E. customs socks visit W. M. F. C. dot ORG or call one eight hundred Seventy five twenty twenty\nSupport for Ninety point seven news comes from boats do rentals boots do rentals is in Orlando baseball rental company offering a twenty foot soundtrack or deck boat including life jackets\nSound system Carmen safety equipment and seats nine people voted delivered to renters location and captain services are available reservation information was boats do rentals dot com\nOr comes from NPR stations or their contributors include St Martin's press publishers of them why we hate each other and how to heal a book from US Senator Ben Sasse about the state of politics and the country's future or below where books are sold\n\nObsessed with on the wrong way or the amazing super national storytelling seems to change [noise]\nSnap judgment [noise]\nJoin us for snap judgment\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers of central Florida for more than twenty five years more information including national rankings available online Arnold Palmer hospital dot com\nRum and your and WNYC coming to you from the house in beautiful Brooklyn New York then we are as our puzzle word games and trivia asked me another\nJob and golden now here's your home no fear a\n[noise]\nDifferent break so we have four billion contestants they are backstage right now getting into Halloween spirit bobbing for Apple products and there'll be up here playing our\nNerdy games and one of them will become a big winner we've been amazing gas our guest is comedian Nick cruel [noise]\n\nHe is the animated series big mouth just started second season on Netflix uh it's all about his teenage years which can be rough anytime I think about my teenage years I got to tell you this smell comes back\nTo me of this acne astringent\nSea breeze\nIs I remember that it existed but I I'm not familiar I think it was made from frisk\nA in removed and it was it was super\nStrong and had tons of alcohol and I like it was a hundred and eighty proof wheels Labrador faces with it hoping it would help a and the funny thing is I remember going I cannot wait till this part of my life is over\nThen you find out later that you still get yeah\nI still get but now they are on my wrinkles that's great that's really nice thank you get to have a pimple on a wrinkle up wrinkled thank you thank you life [noise] so now I just drink the sea breeze [noise]\nI had a huge crush is did you read the kind of teenagers I just thought it was pretty crushing who looking for love everywhere yeah who was you remember the name of your first crush her name was Mickey like oh Mickey you're\n[noise] I'm all for your eyes Bergen this has asked me another from NPR's [noise]\n\n\nSupport for Ninety seven news comes from aggressive appliances a family owned company that has been selling installing and servicing appliances in central Florida since Nineteen eighty the crest of the scientists specializes in luxury brands and features galleries of life working kitchens and more and aggressive appliances dot com\nAggressive appliances a deeper commitment to appliances and the people who love them a face off\nOn Facebook triggered hordes of women breastfeeding their job on the next radiolab the teenage girl breast feeding a goat now that over two billion people are posting things on Facebook\nWho decides what we can see [noise] what we can't\nI have to get from ... bite of humankind that I'm an ex radiolab [noise]\nJoin us for radio lab that begins this afternoon at one right here on Ninety point seven F. M. W. M. F. E. Orlando Melbourne and Daytona Beach\nBy this is Steve Inskeep with MORNING EDITION from NPR News takes a lot of people to bring you MORNING EDITION everyday on W. M. F. E. listeners support makes it all possible and your gift to W. M. F. E. no help to be here for you everyday\nCalled eight hundred Seventy five twenty twenty and give us generously as your cat that [noise]\nSupport for NPR comes from the station and from the ... company supporters of the tiny desk contest and working to help ... ears through beers more at ... dot com and visit St Petersburg Clearwater\nAlong Florida's Gulf Coast offering arches drugs including St Pete Dali museum that usually collection and the museum of fine arts more at the speech Clearwater ... [noise]\nMe another NPR now are puzzles word games and trivia I'm Jonathan golden now here's your host over the horizon bird\n[noise]\nTime to welcome our special guest he starred in oh how low on Broadway cruel and the second season it was animated series big mouth is streaming now on Netflix please welcome Nick crow\n[noise]\nHey Nick ... thanks for just\nHi I'm off on taking all of our president and general manager of make the point that it's W. M. S. it's been a food two years since we first tried this less intrusive style the fundraising called fine with Dr and this is how we do we now have you been in the family\nDon't your support and interrupted programming donating a dollar a day when we ... call one eight hundred Seventy five twenty twenty\nYoungest of four yes I Am now were you were you baby or teens\nAh I was both baby didn't tease my brother definitely ... who's turned into a wonderful man and father of the war but as a child would give me a what we would call in the business of toothpaste wet G\nA means you put toothpaste in underwear and give your younger brother ...\nFormer curious if your buck could feel meant\nShout out as a ... Iran [laughter]\nAnd you were the your cats I was not much of a theater I did a few plays along the way\nGrowing up my friend Andrew Goldberg and I who who I created a big mouth with\nA Q A\nHe and I would like host of the poor um talent show every moment of as like as Wayne and guards from Wayne [laughter]\nThey're not even a port in care no no not at all\nUm but no I didn't do much theater it was really when I got to college I started doing improv\nComedy that I really fell in love with doing it then want to do for the rest of my life you making New Year's resolution ... you're going to try and used to be classes yes in New York\nYeah I graduated college many New Year's resolution to start doing improv and stand\nUp comedy and met people that I'm Still friends with them work with today I was just started doing open Mike's around New York city a and very at some point in that process met you that's right yes we go back many years\nWe can go to end up in a horrible bar around New York city\nWith people like ourselves very funny talented conned people and like sixty year old man who still\nLiving with her mother act like and they killed yeah they were doing great\nSo two thousand and Thirteen I just find that's interesting so you do the polls show on Comedy Central which is built around\n[noise] obviously\nWe know this is the character driven show but I ... in the comedy world there were a lot of people doing characters everyone was really doing a lot of self reverential comedy talking stories from their lives I mean in a way that just seem like much easier than doing character not if you don't want to share who you really are\nWith an auto [laughter] never feel do you\nKeep those walls [laughter]\nBut I'm just wondering when you were pitching this I assume Comedy Central was like what do you have and you were like I Want to do the character driven show where they like great this is different nobody's\nDoing All right they were they were actually very cool I had done a bunch of sketches on line and we'd put out like a Bobby bottles service for breach\n\nIn the early ... I don't know if we had any oh hello on line at that point but we had done a bunch of stuff and so uh and I did a special for Comedy Central Gulf thank you very cool which ah [noise] this is about the response that it deserves\nA\nAnd it was sort of become a backdoor pilots four of the ... show I we were very specifically wanted to do character driven comedy I think I've always been drawn to people are trying to make people I don't like in real life somehow sympathetic mhm\nAnd I don't know what that says about [noise]\nWhat am I a inner world\n[laughter]\nSo the character that you are in general any play and oh hello\nHello this is the Broadway show and it was but it started as a fun life show\n... at a small room in New York young ... based on two men that they you observed in the strand which is a famous book store here in New York yeah and what was it about these two elderly men\nWho were like real New York people like the the people you see at the strand in New York and there's a book store like that in every city in the country it's like huge in uh I wouldn't come due to a\nLegendary elderly bachelors\nIn like a\nTurtle max and blazers a and they were buying a copy of a Allen all those never happier dog stuff\nUh\nLike me and my mind he saw them we're just like whoa whoa whoa\nWe leave your hands\nAnd I think we both had always loved that kind of person and we sort of followed them to a diner and watch them read their doctor\nAnd so we just started you know talking like with them and and and thinking like that man\nAnd one day my ... pain and\nAnd it just was like that's it it's just like that's it that those guys and we started doing this show\nOr at this place for the the uh and we just like started hosting the shows those guys and and and that's over a decade ago and I think both of us are have never wanted to not do them since\n[noise]\nAnd now you're hanging out with another friend of yours from your childhood as you mentioned you Andrew Goldberg rats and joined forces to create this animated series like now gas [noise]\nOn a second season now you said keep the walls after don't talk about your own personal life that's what you like doing you know you're mining your teenage years here for that show\nYeah I it was felt easier to be more autobiographical as like a Thirteen year old animated character ah\nYeah so it's it's a show about me and Andrew based on our childhood of uh he was a very early bloomer uh he hit puberty or puberty hit him real hard\nUh we actually have the first episode of the second season is is ripped from the headlines a [noise]\nAnd that his\nFather made his mother waxes upper lip\nAh when they when he was in like six or seventh grade\nAnd then he was unable to grow a mustache or for years to come to grow full beard and no hair on the line which uh we referred to as as reverse Hitler [noise]\nUm [noise]\nUh stories from my life as well as specifically in season two I got parents are around in seventh grade what does that mean uh that's right you're a Canadian so that would be a [noise]\nYou're both word matched me a and lives right now is in the lead [noise]\nBig geometry gets you excited you might be square and you might be perfect for our show go to Amy tickets doubt or to find out how to be a contest and coming up you know it's better than a suggestion box [noise]\nBack to back the drag it out of your suggestion box you've been replaced by more definitive content in a more malleable container we're going to be playing ... bag I'm up here Eisenberg and this is asked me another from MBR [noise]\n\nSupport for Ninety point seven news comes from upper Linda presenting tales of Hoffman October twenty first read the thirty is that the doctor Philip Center for the performing arts\nThat in a steam punk landscape of smoke and mirrors in featuring Metropolitan Opera ten or ... and the title role tickets in more information for Hoffman and upper on the main stage productions available in upper Orlando dot org\n[noise] support for NPR comes from devastation and from the NPR wind club everyone comes with that story including NPR inspired bottles like weekend edition cabernet\nAvailable to adult Twenty one years or older learn more NPR wind club dot org and lifelong like luck with Norton work to help protect identity to end the information on devices from cyber criminals\nLearn more at ... dot com [noise]\n\nWe've been there that would be another I'm Jonathan golden now here's your host over ...\n[noise] [noise] before the break we met her contest and I and ... soon they'll play a game about the Nineteen nineties [noise]\nDo you remember that iconic friends poster of Rachel and Ross and the gang and they're all drinking milk shake that acute straw\nGoing to be done and\nDo love from the nineties\nSo I was born in Ninety six no I didn't really experienced this stuff to like a one Z. [laughter]\n[noise]\nI mean probably get some baggy clothes that was happening [noise]\nLiz what fashion\nDid you learn from the nineties this may have just been me but I had these like ... with individual Disney Princess is on them\nI Would kill to have a gun or just you know [noise]\n\nYour next gave me the music parity called Nineteen nineties ... and you are going to do great [noise] Lynn stay\nIn the lead and you're in the final round and you need more points or you'll receive a tuba brown lipstick\n[noise]\nWe changed the lyrics to hit songs from the Nineteen Ninety to make them about things associated with the Nineteen nineties ringing to tell me what Ninety thing I Am thinking about and if you're correct you can earn a bonus point by name of the original song or the artist\nWho made the same area and use\nThat alone at a ballgame marsh totally parents both towns tiny harsher a nuclear transfer from its do that\nShe is a perfect copy it she said\nWith Dolly the sheep Dolly the sheep contrived [noise] first clone sheep strikes\nAlthough hard to say 'cause if you want to pick an animal where they really look like\nThey could have been a lot cheaper to Libya or\nSyria or for bonus point can you name B songwriter artist couldn't tell you that would lump by the presence of you know I'm sure [noise] I don't want to weigh\nIs actually the real words to the [noise] I just ... just in me and I can\n[noise]\nThey love that song everyone has that song and their net although we are all the whole time okay I don't\nWant to pay what you saw them declaring that it just doesn't count as the new bit helps me [noise]\nI just really you know [noise]\nBeer took me by sharing\nThe program we'll download these\nFor free [noise]\nAna Napster map\nFor a bonus points can you name the original song [laughter] I don't know if I Know the title of it\n[laughter] [noise] that's the other part of the joke is that there were were\n[noise]\nBurn coal waiting know click and sat down and listen to the modem breath chat rooms\nIt's fine if I log on and I'm looking I'm just fine\nIn street you know has been the six K ministers Jew good ma'am\nStand on my line on a split or there's a split or on my line [noise]\n\nAOL AOL is beer [noise]\nSupport for Ninety points in the news comes from Orlando Health Orlando Health Arnold Palmer hospital for children has been caring for the children and teenagers to central Florida for more than twenty five years more information including national rankings available online\nArnold Palmer hospital dot com address [laughter]\nUh here we go I\nWant to drink wine cooler\nWhat I said now no\nBeer now five ruler no foamy have now a well known dumping clear in multi with the citrus by now looks to\nYou can probably like a burning right now [noise]\n\nAnd I want to take a while to get some say his emo GMO [noise]\nFor bonus point can you name a song of the artist to print says yeah that's right it's been doctored\n[noise]\nA little bit Indigo Girls can a\nLittle Susan B. goes out in right now the owner apples on stage you know the truth ... happens all the rage here that loves his actions being in the Sean cold and also here don't be per square\nForget it if you have to see a man because this was part of them is\nLou Louis ... will experiment\n[noise]\nFor bonus points you made any song or mama number five yeah [noise]\n\nI feel like I have every single one of those women CD [laughter]\nYup mhm what does it bother\nWant to eat again I'm caring for a key chain pet\nThe job of key chain pet\nAna Tomei got llamas [noise]\nFor bonus points can you name the original sooner and I cannot\nI Know I Know the mentality I got a pet still gets out of that I don't know the name\nIt was something by the number one but yeah I don't know the name\nUh this is your last clue\nGr will be where on New Year's\nCome June ... bank is nine hundred software so where so where is\nWe're oh we're oh we're all going to die\nFan of Y. two K. Y. two K. bugs\nIs right [noise]\nIn hindsight we should have let that run its course [laughter]\nFor a bonus points to name soccer I don't know her name is that called that thing I'm Sorry that is part of the name of the song I Need the whole name of the song\nI don't know if I can give you the whole name about the song\nAnd you have to do [noise]\n\nI don't have it All right it was a actually do well\nParentheses that thing by Lauren Hill means right now we have a tie sweep a tie breaker question\n[noise]\nAlright whoever gets just moved to the final round here's your question what robotic bird likes toys patch was released by has borough in Nineteen Ninety eight [noise]\nLive for me that is correct\nYou to graduation live you are moving to the final round\nWell Jill and Liz get ready for our final round it's time for us to play a game this is back bag I have a bag full of trivia questions Jonathan and I do not know the answers every question is written out an envelope I'm going to read a question Johnson I Will discuss\nAnd then we'll open the envelope and\nFind out the real answer to real bad everybody okay here we go\nThe lemon limestone seven up was introduced in Nineteen twenty nine about Twenty years later what ingredient was quietly removed from its formula\nWas removed from its formula cocaine someone said that I agree with that cocaine I read all the survivor's guilt cocaine and they all did right I don't know Coca Cola certainly did uh well not lemons has not won", "year": "2018", "show_name": "Ask Me Another", "city": "Orlando", "day": "20"}