{"month": "10", "state": "AL", "station": "WAPR", "content": "Yoga Jim delivering yoga lessons to students regardless of experience or body type\nLevel classes encourage beginners and challenging cultivate the practice of more seasoned yoga practitioners more at yoga Jim L. L. C. dot com\nTheater Tuscaloosa west Alabama community theater providing quality entertainment and educational outreach for more than four decades information about auditions workshops and performances at theater ... dot com or to zero five three nine one to two seven seven\nPrivacy pantry presenting turkey trot two thousand Eighteen in old town Daphne Saturday October twenty seven oh five K. fun run and family friendly festival where every runner is a turkey more info and privacy pantry dot O. R. G.\nThis is Alabama public radio service of the University of Alabama W. H. P. R. Selma WPRI Michael show\nH. I. L. movie Wu ...\nOf the University of Alabama W. H. P. ours on cue PR Michael show\nW. H. I. L. movie W A L F in Tuscaloosa\nW T two three these the Tuscaloosa though we are we are we are we I we are Alabama public radio [noise]\n\nFrom Alabama public radio I'm Dale ... and this is the crew nurse it's another night a voice in song oh you have two hours to spend with me the crew in hers is on the air\nWell good evening to you and yours I Hope you're enjoying your Sunday night thank you so much for spending a portion of it will be here at the ... I Hope you and yours are doing well on tonight's program I'll get things started with an American singer of traditional pop and swing music\nShe served as the main focus at times but three of the most popular big bands of the swing era Artie Shaw Benny Goodman and Harry James she earned the distinction of being called the voice of the name brands who am I referring to\nWell let's Helen forest from taking a chance on love this is the title track [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n\nHe's like\nOh no\n\n\n\nOh no\nYeah na\nNa\nNa na na na na na\nNa na na na\nNa na\n\nNa na\n\n\nNa na na I you know they\nReally\n\n\n[noise]\n\nWhen they be ... you know\nYou bring back the oh\nThe the ... ... you know\nIt brings back this oh ... ...\nAnd it brings back in\nIt brings back\nA ...\nWith you once ... this\nAnd down and by the show or a book that's true\nAnd the when the\nWhen they\nWhen they ... the money\nTo that but again\nIt is passed a dog and\nWhen that thing in the clubs is my well\n...\nHe'll clouds came along to the first ... days\nAnd now when I hear people\nI Know but to\nWhat they may have\nEditor sleep like that in\nWhen they be\nYou know you always want more than ...\nAnd we didn't really know what\nWhen they ... ...\n...\n\n... says she can\nRage of a few\nTo you it was a\n... or ...\n[noise]\nDo you mean you know I Know\nAre in the mind\nRobbers dreams you\nYou\nKnow I Am\nA\nLot going on\nWe use\nUm the mind and\nRobbers dreams you\nDon't have to lie\nOr I Am more who\nGreen\nMm\nDo me\nMuch usually me too me\nHoney in see to\nMe ...\nThey\nNeed to know when you\nYou\nYou know not\nShe ...\nYou\n\n\nMuch be\nGreat fun\nTo do the bees to me maybe\nYou should move forward can just eat too\nPlus you we need to be\n\n\n\n\n\n\n\n\n\n\nHe he\n\nKnew oh man\nOh\n...\n\nDo\nYou watch the game is gray\nMay June I mean you\nShouldn't have done\nSo well those are huge\nInside of me saying there's\nNo means means to me that's me\n\n\n\n... world starts getting you know people are just too much for me to spring\nWay up to the top of this there and do all my carriers just drove\nRight into ...\nAll new new piece last can be\nA new world boot camp bother me you\nGo with the\nGo with the\nYou're away from hustling crowd or whatever and all that rat raged on\nThe street [noise]\nYou made you know\nStarts getting jobs\nLong\nNo ... Mm\nBook ... Peterson ... on the roof and I covered that song from his release on the moon but boy that Judy Garland meaning to me from the great ladies of song and Neil Diamond got started with ... with the proper stranger that's from the movie album as time goes by\nThat song comes from Nineteen sixty three American romantic comedy drama film was made by paramount pictures\nAnd it had the same title the jumpstart Natalie Wood Steve McQueen ... Adams and more films title song originally was recorded by jak Jones but Neil Diamond doing a great job with it\nEighty Adams and more the film's title song originally was recorded by jak Jones but Neil Diamond doing a great job with it there\nInto your\nMan ...\nAnd then that the book and today\nA name that\nDay\nNow\nWe did\nIn New York\nYou learned that then\nThey use that changed you\nI see you\nSame game a loved\n\nTime John\nThing dining when\nIs that all you\nAnd I'm like no ... no no no\nRight no ... na\nNa\n\nMm\n\nMm our men\nRing you know the thing ...\nTo ... [noise]\nNot sure oh\nYeah I Am I'm shy\nDamn thing dining\nDom na and AA rebel Joe Brown\nIs not really all you\nKnow no\nI'm you know\nWhat do\nYou\nThis to you\n\nKnow to\n\nLow lovely oh\nI'm Sorry\nLovely na\nNa na na na ... oh\nJudge is one of those [noise]\nWe're supposed to be on ... oh\nIt is that this is back in time\n\nYou hear your love is some snow\n...\nBecause it happened is\nThat like you\nIn any way that he has\nA lot of the moms\nOh\nLike a friendly home he\n\nLoves the second time new gao [noise]\n\nMirror ...\nNa\n... [noise]\nWell ... but one [noise]\nI'm also glad when\nThe second time oh no\nNo\n\nTony Bennett and nice Persia from his movie song album that was the second time around that ... been around for why\nTony Bennett and a nice version from his\nThe movie song album that was the second time around that song has been around for quite a while\nIt was originally written for Nineteen sixty film high time that was sun by Bing Crosby originally with Henry ... conducting the orchestra\nAnd was nominated for the Academy Award for best original song it did lose out to the song never on a Sunday it's theme is captured by its first two lines love is love to hear the second time around just as wonderful with both feet on the ground\nAlthough Crosby recorded it back in August of Nineteen sixty for MGM Records is especially associated with Frank Sinatra who recorded it for his own label reprise that was in Nineteen sixty\nIt did get some charts success reaching the number fifty position on the billboard hot one hundred chard and he liked it so much he recorded it two more times [noise]\nUh let's see if a reprise and sixty one and also in sixty three\nAlso in the Senate was Melissa Manchester with sophisticated lady from her tribute release before that Andy Williams tonight that's of course from west side story\nThat is from his movie album is called moon river and other great movie themes and Monica men's Seaney from a greatest hits release with this summer knows\nFrom the summer of forty two [noise]\nDon't forget the critters follow up podcast is coming up immediately following this program if you'd like to our Facebook page you'll get an automatic link that will show up\nThat will lead you to the podcast that will show up immediately following this program if you're not like dark shows Facebook page go there now like the page will get that link this evening\nThe Facebook pages the crew owners were Dale oh and that's the crew owners would deal oh and our next set begins with a great Patti Page in the land of high five that's the name of the album that I'm pulling the lady is a tramp [noise]\n\n\nModeling and much\nInterest from Maine\n[noise]\n\nAnd\nI was never at a party\nWhere they honored no\nSocial circle then to me [noise]\nMy hope\nIs just you\nSunday and I think\nI'd like to theater but", "year": "2018", "show_name": "The Crooners", "city": "Selma", "day": "21"}