{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\n\n\nAndre they go via the guitar here with the than any of the air Enrico ... conducting the fantasia for gentlemen as written by Joaquin Rodrigo forced to go via himself\nAt the northwest public broadcasting and W. P. B. dot org I'm actually do ya and stay tuned in the moment just ahead well you're a quartet of get heart there performing rendition of that old American on the Shenandoah\nNorthwest public broadcasting K. R. if a Ninety One point seven Moscow Pullman K. and W. V. Ninety point five Clark St Louis and cayenne W O Ninety point one cotton wood Greenville NPR in classical music a community service of the ed wood armor oh College of communication at Washington state university\n\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] Mm [noise]\nMm [noise] [noise] [noise]\n[noise]\n[noise]\n\n\nThe LA gets hardcore had an arrangement dump Shannon July that old American you know\nThat's part of your Friday nights classical music ... public broadcasting eleven o five now I mean we don't yet to be with you nice that'd be shared now when I meet from rebel incidental music Daphne and slowly so\n[noise]\n\n[noise]\n\n\n\n\n\n\nA concert we number two from rebel incidental music that's nice and so he ... he led the soil harmonious orchestrate you're like what are we broadcasting\nViolent as Rachel Burden upon is working toward a world where kids from diverse communities can see and hear themselves in classical music and one of them to be able to see a future for themselves\nWithin tomorrow afternoon at two o'clock or the repeat or the evening at seven here on at W. P. bees NPR in classical music therapist\nFor now Barton pine is performing here with her court is your ... box not F minor\n\n\n...\n\n... ...\n\n...\n\n...\n\nMusic of box for you tonight Rachel Martin pine was violated with Jordan Vinnie could I ask her support it box not an F minor northwest public broadcasting\nHear an interview with Rachel part in pine is a part of performing today this weekend you'll hear it tomorrow afternoon at you with the repeat Sunday evening that meant strength and W. P. B. for now divorced shock the beautiful Largo from his new worlds company\n\n[noise] [noise] [noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\nMm\n\n[noise]\n\n\n[noise]\n[noise]\nYou know he [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\nHe\n[noise]\n[noise]\n[noise]\n\n\n\nNo unease [noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\nA beautiful lullaby to begin to shower together at northwest public broadcasting none no one of the popular Spanish songs uh shut bite\nThe ... the Olympic ... welcome to our programming stiff you're just joining us at this hour you're a northwest public broadcasting herded N. W. P. B. dot org my name is Steve later\nMy pleasure serving you sure hosts cheer leader in this hour oh would wind queen ... by ... to tell you the nineteenth century\nBut right now another Spaniard of the twentieth ... Rodrigo from Nineteen forty nine his cello concerto which he marched in ... in the ... style of the Eighteenth century\nCello syllabus Robert calling with the London symphony orchestra here conducted by Enrique but these\n[noise]\n\nAnd then when\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[laughter]\n[noise]\n\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise] no no\n\n\n\n\n\nOr a ...\n\n\nA\n\nSurprise\n[noise]\n[noise]\n[noise]\n[noise] [noise] [noise]\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n...\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\nMm Mm Mm\n\nGiven by the Avalon when queen ...\nWell another excellent way to stay in touch with our classical dimension is by means of Twitter classical music news and notes and puzzles for you an inside look at your music playlist and behind the scenes at certain N. W. PBA events falling didn't follow was with the handle at N. W. P. B. classical\nOn now to Beethoven here working in the theater and the overtures he wrote for stage production called the ruins of Athens comedy about on the podium to lead the Vienna Philharmonic\nUm [noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n\n[noise] [noise] [noise]\n[noise]\n\n\n\n[noise] oh lord Russian ... dos playing some ... for you today but romance number six in ...\nWell ... wrote a dozen string symphonies sitting his boyhood between the ages of twelve and fourteen before she moved on to his so called fooling mature symphonies this is the last in the sequence and you can tell but he'd studied his boss because it begins with a few the strings symphony number two\n[noise]\nYou\n\n\nLoose strings symphony number will be she mind you're buying Mendelssohn written by that remarkable child prodigy at the age of ...\nClassical music service on line at the end up all your P. B. dot org in your phone things tore up and by means of your smart speaker just as good to play northwest public broadcasting thank you so much for joining us today\nOur classical music heard in the community of Tacoma Seattle and Olympia Lakewood gig harbor and ... on Ninety point nine [noise]\nFrom Nineteen Ninety four this Cape Britain concerto by Brian pack them in which incorporates various folk themes from Cape Breton Nova Scotia Chris Norman the soloist here with coming up to ... check on N. W. P. B.\n\nA wonderfully folksy shown and also entirely ego medic music for his silhouette instrument ... known as the Cape Breton concerto written in ...\nChamber orchestra of Argentina right here at northwest public broadcasting say if you got any questions or comments regarding any aspect of our programming here\nYou can always messages via Facebook or by email info at N. W. P. B. dot org a very good data you thank you so much for joining us at this hour I'm Steve leader\nNow welcoming Leonard Bernstein in his New York philharmonic for the fourth of the Hungarian rap cities by friends list\n\n\n[noise]\nMm\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\nOh\n\n[noise]\n\n\n\n\nSome ... wants to begin this hour heroic northwest public broadcasting the waltz from the score to the ballet the sleeping beauty ... one third of his belly trilogy along the swan lake and the nutcracker pretty ... leading those fabulous Philadelphians today\nHere at northwest public broadcasting an N. W. P. B. dot org ... they're a good day to you and thank you so much for your company and you're loyal and generals financial support of our classical music I'm Steve leader in less than Fifteen minutes a performance of Mozart's final piano concerto\nBut in the meantime some exclusive French music from Nineteen oh five the introduction and the ... with the ... the fluid is William Bennett's the clarinet ... Andrew Mariner and members of the Academy of St Martin in the fields\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise] [noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\nMurray pariah doubling their as keyboard so Lewis and the conductor of the chamber orchestra Europe for the final work of that kind of Mozart you've just heard his piano concerto number twenty seven in ... major\nHere at northwest public broadcasting on line it N. W. P. B. Doug Oregon Hi there greetings I'm Steve leader we're proud to serve Leavenworth in Wenatchee afraid of Moses Lake in Ellensburg with classical music daily on Ninety point seven\nI work now from the pen of the twentieth century American Vincent ... a native of Philadelphia and is very important teacher as well as pianist and composer trained a number of prominent musicians during his time on the cycle to get the Juilliard School in New York\nFrom Nineteen fifty one Vincent ... punched around for wins quintet\n[noise]\nNo\nA ... ... ...\n... ...\n...\n... ...\n[noise]\nOh ...\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\nMy real dirt road to\n\nA burst of energy there thanks to the performance by the Swiss group each show let me see much famous cheaper down from the belly\nSting and W. P. B. dot org or downloadable out the and your smart speaker just ask it to play northwest Public Broadcasting's the waiter hosting at this hour looking forward to sharing with us nineteenth century sex ... for strings and about Fifteen minutes\nBut to get us there this tone ... inspired by a passage in the finish national uptick\nIn which an elderly white bearded man comes across a beautiful young woman the daughter of the north seated on a rainbow and leaving a cloth of gold and insisting that any man who would pay court to work and try to woo her most perform certain basically impossible task\nBuilding a boat from nothing for example or tying an egg into invisible nuts\nLet's just pull your oldest daughter by ... ... lenses symphony orchestra with ... conducting\n\n[noise]\n[noise] [noise]\n[noise]\n\n\n\nWhile\n\n\nMm Mm\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise] [noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\nSex tests for strings in the major composed in Eighteen forty eight by Luke rich poor\nBut highly influential German virtuoso violinist by trade who gave us the chin rest orchestral reversal marks and the concept of the modern music festival ... four inches strings sects Ted the combined forces of ... and the Smithsonian Chamber Players\nFeatured at this hour here at northwest public broadcasting screaming at N. W. P. B. dot org ... with this orchestral temp blue as the composer himself referred to it in the steps of Central Asia by ...\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n[noise]\nIn Tempe soup Central Asia Bible Dina name of your be conducted the Gulf and Bert National Symphony in Sweden ... plays the she'll apart now in the pursuit concerto in Dubai nearby it's all day [noise]\n\n\n\n\n\n\nBox that oath sweepers a week but we'll know corral melody from one of the late ...\nThere are some ... arranged as usual for ... as sticky let the members of the London symphony orchestra key noting another hour together thank you for joining us today I'm Steve leader hosting the classical music you're up north\nI loved the melody from the world of Italian opera but right now we're going to carry on with the word from the mid ... century by the Brazilian master ... his ... concerto\nKatrin Michelle the syllabus steer a company by the Monte Carlo national upper orchestra under ... Tony ... direction\n\n\n\n\n\n... [noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\nFood in the news and you can you really enjoy\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n\n\n\n\n[noise]\n\n\n\n\nMm Mm\nMm [noise]\n\nMm [noise]\n[noise]\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\nMm\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n\n[noise]\n\n\nHere on northwest public broadcasting those were the foreign romantic pieces by ... for shock with violinist even ... and ... I'm ... now as promised\nHow's it yet she presented here in a purely instrumental guy the b._b._c. concert orchestra under the direction of Barry works worth a", "show_name": "BBC World Service", "year": "2018", "city": "Moscow", "day": "20"}