{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\nAnd Italian data bond buying anonymous the teen fifties composer performed here by ... the vial in his early music on apple variant Twenty one\nThat's here in northwest public broadcasting you can find the music playlist at ... dot org\nWell hear now from a fat elegant for London music of the early nineteenth century in Vienna Marlboro Giuliani's grand there and hate perform here by flat is to chat Poland and guitarist John Dowd all\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\nGuitarist John Dowd all here on northwest public broadcasting\nMusic by a composer who was not checked a talented guitars but a chill it as well\nGiuliani even made an appearance in the orchestra for the Eighteen eleven premier of Beethoven seven I'm funny well thanks so much for being a part of the classical music on northwest public broadcasting\nI'm ... and W. PBS proud to serve the community of Bellingham Pullman in Moscow on Ninety One point seven in Tacoma to Seattle and Olympia a Ninety point nine\nYou can find a full list of our frequent these at N. W. P. B. dot org serving all of those regions across the northwest\nAnd the world with our free downloadable smartphone app and live streaming options that N. W. P. B. dot org\nWe turn now to Alexander ... and his tone palm look for a picture of the most serious dark for it and then they break at the woods inhabitants awake to start another day\nThat the the mock out symphony orchestra under Alexander and you came up\n\n\n\n\n\n\n\n\n\n\n\n\n\n...\n[noise]\n\n[noise]\n\n\n\n[noise] [noise]\n\n\n[noise]\n\n\n[noise]\n\n[noise] near you had the boring class he performed by my count any or you can join the kid who northwest public broadcasting\nWe turn now he'll he drew me to come home they're Eighteen century the keep your free T Italian for me\n[noise]\nThe book\n\nWhat what\nYou get it\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n\n[noise]\n\n[noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise]\n\nDemoted dinners going at the piano\nFor the music by by the thirteenth of his magnificent Goldberg Variations\nOf most fortunate way to begin this hour together sharing the classical music with you at enjoying your company here at northwest public broadcasting screaming at N. W. P. B. dot org Hi there I'm Steve leader your host at this hour with our centerpiece being a guitar trio\nWritten in the first half of the nineteenth century you buy a notable Frenchman\nBut to get us they're much better quality quarter hour with Mozart and this performance of his serenade number six indeed known as setting not to know told her no part serenade part not turn a certain level Mariner leads London Academy of St Martin in the fields [noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\nBut for the the the the\nThe game [noise]\n\n\n\n\n\n\n\n\n[noise] [noise]\nBut [noise] but the day [noise]\n[noise]\n[noise] you\nName of it and\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\nBut then when the ...\n\n\n[noise] to do\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n\nYou can do\nAnything to do but then\nThey they pay the bills and [noise] and then he moved in and they and everything and I think the game\n\nAnd\nAnd\nAnd they put\nA row\nAnd then\n\n\n\n[noise] [noise]\n[noise]\n\n[noise] [noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\nJust heard the guitar trio number one in eight by that French contemporary Beethoven ended noted guitar virtual so ... so the trio their consisted of the good tourists to Simon ...\nYou'll find very useful links to all of our social media platforms such that we can stay in touch that would be Facebook and Instagram Twitter and Tumblr N. W. P. B. don't Oregon your home and resource for all kinds of things northwest public broadcasting\nLet's move along now to the Italian Baroque and this ... ... ... the show that was here with a ... [noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise]\n\nMm [noise] [noise] [noise] [noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\nTo\n\n[noise] [noise]\n\n[noise] [noise]\n[noise]\n\n\nUh mid ... century Italian rarity petite two phones ... ... ... which is to say small musical offering\nComposed for wind should Nineteen forty three by Nino wrote so much better known for his Fellini than other film scores a performance there by ... we couldn't tell\nYou if you're just joining us at this hour we'll come greetings Hi there Steve leader here hosting the classical music for you\nAt the end W. P. B. classical\nNow our major work in this hour and one of the summit one of the highest peaks in the classical repertoire this piano concerto number one in ... minor by ... and we have an all star cast here to do with justice so that was murdered to argue with each conductor Claudio about ... and the Berlin Philharmonic\n\n\n... ... ...\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n\nOoh\n[noise]\n\nMm\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n[noise] [noise] [noise] [noise] [noise] [noise] [noise]\n\n\n\n\n\nThe impromptu for harp composed by Gabrielle ... Nineteen oh for specifically for a student recital it appears conservatory Maria ... was today here at northwest public broadcasting herded N. W. P. B. duct work in that\nWe used to do by the Norwegian Johan hold her son and his will ... of the boy yours Norway's Bergen philharmonic under ... than under some direction\n[noise]\n\n[noise]\nNo no no no no no I'm\n[noise] [noise]\n\nCanadian Brass playing that adaptation of one of the best known loot songs of the early Englishman John Dolan come again sweet love\nAnd Elizabethan start to do so or ... northwest public broadcasting an N. W. P. B. dot org ... work is island in school in Washington as well as Victoria, BC on Ninety point one hide their and good day to you Steve leader with this first concerts sweet\nExtracted from a full length ... indeed he called it a ... funny he just by late Daphne six ... introduced to the world in Paris to Nineteen twelve\n\n[noise]\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\nMm\nMm\n[noise]\n[noise]\n[noise]\nThem and then make them do that\n\nMm\n\n\nMm Mm\n\n\nMm\n\nMm\nMm\n\nMm\n\nMm\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\nNew book\n... [noise]\n\nIt\nThen\nThey can do that\nI Need\nDo\n... it's good\n\n\n\nBe in the\nAnd do that [noise]\n\n\n\n\n[noise] [noise]\nMm [noise]\nMm Mm\nMm\n[noise]\n\nMm\nMm\nMm Mm Mm\n\nWhoa whoa\n\n\n\nThe Baltimore Symphony with David ... conducting performing ecstatic orange one of the best known and obviously most colorful scores by the American composer Michael Moore keep eroded in Nineteen eighty five\nHere we have silhouettes than the handover band of London Under ... holstead expert direction parts symphony part concerto a symphony culture taunting ... by ... by a\nOr\nWho\nDon't remember\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n[noise] [noise]\n\n[noise] [noise] [noise]\n\n[noise] [noise] [noise]\n[noise]\n\nSo beautiful and classic Irish Miller before you Bridget cruise courtesy of tours ... Carlin a performance there on the Celtic harp fight on real\nGood day to you and welcome if you're just joining us at this hour great to have your company thank you for making us support of your day in your life Kubrick northwest public broadcasting money\nFrom the final approval ... in the meantime a rather unusual piece of music but be too cold in ... ... ... ... but not the usual coming to obey queen ... string quartet rather scored four well three home runs ... to ...\nAnd he remembers the consortium sequel\n[noise]\n[noise] [noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise] [noise]\n\n\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n... [noise] right\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\nMembers of consortium close ... specifically oboe three horns and ... playing that Google quintet in east likely troop by Beethoven quite the river to buy him\nA great way to stay in touch with our classical signage by means of Twitter you can find and follow was with the handle at N. W. P. P. classical this is northwest public broadcasting with music now from the final approach of nickel light reams of course the Gulf loop coke door or the golden cocker rule\nWhose message would seem to be be aware of the politically savvy bird and to be a stroller jerk who provides that the sweet from the golden cocker ruled by reams of course the Gulf namely you're the leading the members of the royal Scottish national [noise]\nOh [noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\nNa\n\n\n\nYou know you know we really need to know where you're writing from and where do you learn from you and your mind you know [noise]\n\n[noise]\nMatter who you are\nOr\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nAnd [noise]\n\n\nUh concerts sweet which material drawn from the scores for the for the golden rule you stick by Nikolai ... of course a cough\nOr worked first performed in Moscow in Nineteen oh nine of\nThe royal Scottish national orchestra with conductor named ...\nThank you so much for joining us that this hour here at northwest public broadcasting or an N. W. P. B. dot org ... my name is the breeder and W. P. B. serving Leavenworth Ellensburg would naturally Moses Lake into freighted with classical music daily on Ninety point seven\nFrom St Louis wrote and published several piano works with this title all of them inspired by episodes in Leno's retelling of the host legend with Leslie Howard at the piano Franz Liszt most these two worlds number four\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n...\n[noise]\n\n\n[noise]\n[noise] [noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n\n[noise]\nYou may well have recognized that selection show ... and it was originally written for the piano\nThey're adapted for when the queen ... his ... number Fifteen and deflect nature popularly known as his raindrops ... ensemble began to Berlin that northwest public broadcasting streaming it N. W. P. B. dot org available in your smartphone by means of our downloadable up\nAn through your smart speaker simply guys get to play northwest public broadcasting like sheep leader with this concerto Groucho number seven in ... pitcher by handle you lead to ... conduct emotionally CIO Montreal [noise]\n\n\n\n\n... to ... that Italian disciples of ... rooms of course the cough and master of the pictorial sweet wrote this all tell them to pull him for violin and orchestra in Nineteen twenty five route journal Ricci plays it for you here and Keith Clark conducts the Pacific symphony orchestra [noise]\n[noise]\n\n\n\n\n[noise]\n\nCurate northwest public broadcasting you were members supported NPR and classical music service on line it N. W. P. beat Don Oregon thank you so much for joining us today I'm Steve leader we serve Tacoma Seattle and Olympia liquid kid corporate ... with classical music daily that Ninety point nine\nAnd now we're we're ... shows she Bailey\n... clearly music of the misty and heavily forested northern world ... National Symphony that was conducted you're buying Nemo Europe ... ... ... ... ... northwest public broadcasting\n\n\n\n\n\n\n\n\n\n...\n\n\n\nNa\n\n\n\n\nMm\nMm\n\n\n\nMm", "show_name": "BBC World Service", "year": "2018", "city": "Moscow", "day": "27"}