{"month": "10", "state": "ID", "station": "KRFA", "content": "[noise]\n\n\n\n\n[noise]\nNorthwest public broadcasting K. R. essay Ninety One point seven Moscow Pullman K. and W. V. Ninety point five Clark St Louis and can W O Ninety point one cotton wood Greenville NPR in classical music\nCommunity service of the ed wood armor oh College of communication at Washington state university\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\nMan you call it [noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n\nItalian soprano wrote that the ... the high performing their ... and ... you know vision by Luigi ... Donnie ... public broadcasting which tonight music playlist that ended up ... dot org\nAnd very Good Friday evening you I'm In ...\nWell here in this hour Q twenty first century work written just in the last ten years\nI'm very tough to Montreal and these new Oregon in two thousand fourteen here Olivier and not the organist with the Montreal symphony orchestra catch they got out on the conductors podium\n[noise]\n...\n\nNa [noise]\n\n\nAnd uh\nThe\nDe la ... ...\n\n\n\n\n[noise]\n\nA beautiful ... called northern light\nIt's written by Eric ... Latvian composed there\nAnd he voted for the perfect Lutheran University in Tacoma in two thousand twelve tonight's performance with cattle ... music ... and her life chastened by the hour northwest public broadcasting or you can find ... music playlist I. N. W. P. B. dot org\nIt's good to be with each night I ... the feeder joining us at midnight to take you through classical music kind of early Saturday morning until the news that we can ... five am\nRecovering after Michael will have the latest on the storm that devastated parts of the south east plus a Nineteen eighty six fire destroyed the LA public libraries Susan Orlean on the unsolved mysteries that didn't just destroyed books\nLibraries feel like these big collective brains because they have the memories and stories of the whole culture\nMorning here on northwest public broadcasting well you're not to take a midnight it's brown his drink his drinking ... number one as performed by the cypress course had violist Barry ship ... ... ... rounds that are bubbling out too but\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\n\nMm Mm\n\nMm\nNa\n\n\nWhat do you\n...\nWith\n\nMm\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\nMm [noise]\n\nMm\n\nThe passage Martha ... book from and your motor coordination to cut them your work\nWent along with conductor Keith Lockhart and the members of the London symphony orchestra hello I'm Steve leader hosting the classical music at this hour for northwest public broadcasting N. N. W. P. B. dot org thank you so much for joining us today in\nLess than Fifteen minutes chamber music by member of the Boston Six but in the meantime ... expressing his pride as a filmmaker and to finish artist\nAs well as the desire of his nation for independence at the end of the nineteenth century his ... sweet we get lenses symphony orchestra under your ... destruction\n\n[noise] oh\n\n[noise]\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n\n\nAnd now now and again\n\n\n...\n\n\n... ...\n\n\nCheese\n\n\n\n\nYou just heard the ... by the finished master ... you were living on the podium leading the members of the Atlantic symphony orchestra at northwest public broadcasting probably serving their communities of Tacoma Seattle and Olympia liquid gig harbor and ... all one Ninety point nine\nWe come now to a member of the so called Boston Six of American composers in the late nineteenth and early twenties centuries Arthur Foot who spent more than three decades says organist of the city's first church and for good measure a big fan of the music of both problems Ann Wagner\nThis is Arthur for its own piano trio number two in\n[noise]\n\nThe other day\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\nAnd I was a\n... [noise]\nNa na\n\n... ...\n\n\n[noise]\n\n\n\n\n[noise]\n\nMm\n\n\n[noise]\n[noise]\n\n[noise]\n[noise]\n[noise]\n... ...\n\n[noise]\n\nRelative rarity in terms of classical music Americana lead piano trio number two in before I made sure by the Boston based musician organist and composer Arthur Foot\nThe members of the knee most trio here at northwest public broadcasting well in addition to listening we always appreciate that another great way to stay in touch with our classical side is by means of Twitter classical music news and notes and bring Caesar's\nAn inside look at your music playlist and behind the scenes visits to an W PBA events you can find and follow was with the handle at N. W. P. B. classical\nStill to come in this hour over by composer whose music Arthur Foot so much admired returned Wagner but to get us there this early violin concerto in the major by develop the peanut committed Lee is the lowest tier with their colleagues of English teacher [noise]\n\n\nMm\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\nThe artistry of the New York would when queen tips there at the surface of the French composer and lifelong friend of ... bc Gabrielle PF nay his ... or pastoral peace with variations in the olden style\nBeginning get another hour of classical music together and you're excellent company\nYou're a northwest public bunk casting courted N. W. P. B. dot org ... the same place are home on the Internet or you can find links to all of our social media platforms be at Facebook or Instagram Twitter or Tumblr where you may submit your own photographs of the northwest and W. P. B. dot org\nOr major work in this hour is the final work of its kind by Nikolai ... off his symphony number three in the given this reading by conductor you'll Donnie ... leaving the members of the London symphony orchestra [noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n... ... ... ...\n... ... ...\n\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n... period instrument group calling it\nEmanuel buff and the trio to know that indeed and I'm Steve leader posting the music got this hours you're at northwest public broadcasting so pleased to be doing so and as always delighted to have your company\nLet's turn now to the award winning Ontario based Canadian composer Allen Devon so well known and respected for his choral music this is a word called harp of the wind electro women's choir all Vancouver BC\nAs directed by morning at ... [noise]\n[noise]\n[noise]\n\n\n\n\n\nNorthwest public broadcasting\nToday are F a Ninety One point seven Moscow Pullman K n double you'll be Ninety point five clerks didn't Lewiston until you W O maybe point one cotton wood Greenville NPR on classical music community service of the Edward our moral College of communication at Washington state university [noise]\n\n\n\n\n\n\n\n\nThere you had Nicola little bug in any writing for two to three instruments and which he became a renowned virtuoso namely violin and guitar his first so not only for that company\n... northwest public broadcasting streaming it N. W. P. B. dot org ... in less than twenty minutes a performance of Beethoven's only full length ... score\nSaying if you have any questions or comments regarding any aspect of our programming here feel free to email us it's info at N. W. P. B. dot org\nNo music for Trump led by a member of a very prominent and highly respected bohemian ... family of musicians going back to the Eighteenth century\nJohan stomach and his trumpet concerto India here comes our other sweet and sour ... hard to bury your the soloist a company by the Academy of St Martin in the fields directed by certain double Mariner [noise]\n\nWith hope gun hunters and bury your as the featured soloist and which are never Mariner is the conductor of his Academy of St Martin in the fields\nBut Trump ... stomach a prominent bohemian of the Eighteenth century\nThank you for joining us just to show her I'm Steve leader presenting the classical music for northwest public broadcasting herded N. W. P. B. dot org and by means of our downloadable up so that smartphone is also an excellent way of staying in touch with all of our programming were hurt in Leavenworth\nFull length ... music first heard in Vienna in the year Eighteen or one is music for the creatures up for me the ... the Montreal symphony orchestra led by music director ... ... [noise]\n[noise]\n\n[noise]\n\n\nThe ...\n\n\nMm\n\n\n... ...\n\n\n\n\n\n\n\n\n[noise]\n[noise]\n\nMontreal symphony orchestra with music director Ken the gun oh conducting performing for you today Beethoven's only full length ballet score the one titled the creatures of ... the U.S\nHope you enjoy that ... performance here at northwest public broadcasting or perhaps listening on line thank you for eavesdropping on the Internet we appreciate that at N. W. P. B. dot org\nAnd read it right now does the Spanish composer wrote a set of twelve Spanish densest for piano in the final decade of the nineteenth century [noise] this is the second of them marked Oregon Tyler eastern reference to the Near East endorsed North Africa certainly reference\nDo you ... [noise]\n\n\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise]\n\n[noise] [noise]\nNorthwest public broadcasting\n'til you or if a Ninety One point seven Moscow pulling the N. W. B. point five coached in Lewiston until you W O Ninety point one cotton wood Greenville in the yard classical music or community service of the Edward our world College of communication at Washington state university [noise]\n\n... ... ...\n...\n... ... ... ... ... ...\n... ... ... ...\n\n[noise] [noise]\n...\n\nMm Mm Mm Mm\n...\n\n... ...\n...\n...\n...\n\nLarry in native playing the violin part himself joined there by two of his most frequent musical colleagues two of his very best friend's yo yo ma cello and Edgar mired double bass\n... one of the signature tunes by Seattle native and master fiddler and violinist and composer Marco Connor\nThank you so much for joining us at this hour always appreciate your company here at northwest public broadcasting an N. W. P. B. Doug Oregon to follow up on that string trio will bring you a string quartet by heightened in about Fifteen minutes\nRight now a work by the Hungarian ... he wrote it in Nineteen thirty three to help the Budapest philharmonic celebrated eightieth anniversary in this case the Budapest symphony orchestra ... ... the conductor for these symphonic minutes by\n... [noise]\n\n[noise]\n\nThe symphonic minutes by errands ... composed to help the Budapest philharmonic celebrate its ... anniversary in Nineteen thirty three\nAt a time when ... was also serving as music director for Hungarian state radio his symphonic minutes those wonderful characteristic pieces by the Budapest symphony orchestra ticking through its paces there by ... by shitty\nYou for joining us and for so generously supporting our programming here at northwest public broadcasting I'm Steve leader you'll find a link to all of our social media platform\nThe third of the string quartets publish does the opus Seventy one said well you'll have heightened who did so much to perfect the forum back in the Eighteenth century this recording they bought the Solomon string quartet\n\n\n\n\n\n\n\n\n\n\nThe Solomon string Ford said in the spotlight they're performing that quartet number fifty six in east like make sure my use of heightened as it happens account until one gay order up when you\nAre relative of the composers patrons paid a hundred ... a princeling some\nFor the privilege of having that entire set the hope is Seventy one abusive Heiden\nPublicly dedicated to him and there you have a music by heightened today here at northwest public broadcasting streaming at N. W. P. B. dot org proud to serve Detroit cities in Walla Walla with classical music at eighty nine point one and golden Dale and the dolls that Ninety point five\nGood day to you I'm Steve leader let's carry on with music by ... on quite the grand scale his coronation march for ... Alexander the third\n\nPublic broadcasting or if a Ninety One point still the most polling P. N. W. B. point five clerks to St Louis\nWashington state university\nMm [noise]\n[noise]\n\n[noise]\n\n\n\n[noise]\n\nCheese and\n[noise]\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\nYou just heard the curia from the man's for three voices spy on slatecom play\nWho completed that explicit score in Nineteen twenty complain the French composer and conductor into ranger\nPerhaps best known nowadays at least outside of his native France as the orchestrate are of dubious sees children's corner suites as well as clear to loon from his sweet Barry ... an original by complain himself perform for you today by the Netherlands youth choir directed by Erick Erickson\nThank you for joining us and thank you for supporting our classical music you're round so oily and so generously eroded northwest public on testing an N. W. P. B. dot org ... very good day to you I'm Steve reader looking forward to sharing with us some bill come to themes\nYou'll know shepherd boy bill ringing Norwegian march not turn and mark she'll patrols taken together at Bard College lyrics sweet [noise]\n\n\n\n\n\n\n\n\nWe\n[noise] Mm\n\n\n\n\n\nConcluding with that famous march of the trolls the lyrics suite of inferred Greek name of your feet conducting Sweden's ... National Symphony\nAt northwest public broadcasting another way to stay in touch with our classical side is by means of Twitter like to invite you to find and follow us with the handle at N. W. P. B. classical\nNo seems from the ... to the favored or favorites won by ... tunnel ... these teams from the world a bell ... opera created as a paraphrase here and recorded by each ... ...\n\nNah\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\nUm [noise]\n\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\nThose sorts of ... princes but ballot for orchestra by ... after the famous tail bike you to the Paris orchestra conducted thereby shown PF shockey a no win northwest public broadcasting the members of the Boston museum trio and this second sweep by Tim on", "year": "2018", "show_name": "BBC World Service", "city": "Moscow", "day": "13"}