{"month": "10", "state": "ID", "station": "KRFA", "content": "\n[noise]\n[noise]\n\n[noise]\nThe composer was Louis Morrow got shock that American show man of the nineteenth century has blond number six played by Richard Burnett on northwest Public Broadcasting's NPR in classical music service thanks for supporting it with your pledge which if it comes in now\nGets to count on super Thursday tomorrow\nMoving downward twenty five hundred pledges is the goal\nTake one more step toward lowering that number with Europe legit and W. P. B. dot org tonight\nThank you\nNorthwest public broadcasting K. R. if a Ninety One point seven Moscow Pullman K. and W. V. Ninety point five Clark St Louis and cayenne W O Ninety point one cotton wood Grange wealth NPR in\nClassical music community service at the end would armor oh College of communication at Washington state university\n\n\n\n[noise]\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\nSong without were cold Venetian ... song by Felix Mendelssohn played by Mary pariah here on end up with a P. B. thanks for tuning into northwest public broadcasting mere hours before the official launch is cheaper Thursday the fundraiser with one\nMoving toward his successor know with a pledge online at N. W. P. B. dot org thank you so much for being part of northwest public broadcasting a string quartets in minor here's the brilliant Emerson string quartet to play music by the idea\n[noise]\n[noise]\n\n\n\n\n\n\n\n\n\n\n\nMm\n[noise]\n\n\nMm\n\n\nMm [noise]\n\n\n\n\n\n\n\n\nFather of the string quartets among other things he was called papa heightened\nA drink or tentative minor by use of heightened played by the Emerson none northwest public broadcasting N. W. P. B. dot org\nHere on the NPR in classical music service heightened most illustrious student Mozart his music is coming up next super Thursday is coming up in ... minutes you know it's it's almost midnight\nSuper Thursday fundraiser is when a typical public radio pledge drive condensed into just one day thanks to the listeners of this station twenty five hundred is the goal\nOf donations for tomorrow's super Thursday but if you donate now it will count toward that goal when gets to produce\nTrying to still Lewis the violin and the viola in Berlin and because the government or the soloist do been made us the conductor with the Israel philharmonic orchestra\n\n\n[noise]\n\n[noise]\n\n\n[noise]\nMm Mm\nMm Mm\n[noise]\n\n[noise]\n\nMm\nMm Mm\n\n\n[noise]\n[noise]\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n\n\nFans of Broadway might recognize this music as the song and this is my beloved from the musical cue Smith [noise]\nBut what they might not know is that to Smith music a lot of it was based on the music of Russian composer and fulltime chemist by the way ... will be a Joe gets thanks for joining us him coming up we'll hear this entire string quartet by boarding his second [noise]\nSixteen minutes thanks for less than I\nAlready did have some other hits to and here's one of them to pull up in March from his opera prince ... classic recording gear with the Chicago Symphony conducted by Fritz Reiner\nAnd uh [noise]\n[laughter]\n\n\n\nAnd\n\nOn\n\nDa\n[noise]\n\n\n\nChicago Symphony by by Fritz Reiner and the ... the in March from Alexander ... opera prince equal or Alexander boarding string quartet number two coming up in about ten minutes and uh Brody was one of a group of composers from Russia\nIs that we're beginning with Cesar ... who like show padded box before ... ... for the keyboard from his twenty five ... sixty four your numbers Thirteen fourteen and Fifteen buy seeds are too weak played by pianist Jeffrey ...\n\n\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n\n[noise] Mm\n\n\nMm Mm\nMm\n\nMm Mm\n\nMm [noise]\n\n\n[noise]\n\n\n\n\nAnd\n\n[noise]\n[noise]\n[noise]\n[noise]\n\nMm\n\nMm\n[laughter]\n\nMean you don't know\n\n\n[noise]\n\nMm\nNa\n\n...\n[noise] ... ...\n... ... [noise]\n\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n[noise]\nFrom the sweets tenderness kind of Alexander boarding second string quartet we now turn to a bit of the frightening sided music which is called a night on bald mountain by ... the Minnesota Orchestra\n[noise]\n\n[noise]\nComposer Horatio Parker grew up just a humble boy from central Massachusetts but he ended up winning the equivalent in today's money it's about a half million dollars from the Metropolitan Opera and other companies for his compositions [noise]\nHe studied in Europe with some of the best to debate and one of the people he studied white\nWas use it for ...\nWho is known to organist as being one of the top\nComposers for that instrument to ever live the wonder then that Horatio Parker wrote one of the most famous or can can share those ever written by an American I'm Joe gaps thanks for tuning envy or can can share with each flat a minor by Horatio Parker coming up in about half an hour thanks for listening [noise]\nHere's a bit of music by the British composer Frederick ... who wrote a number of light hearted apparatus and even the bit of music through the twentieth century which is called bravado image played by the checkout Slovak radio symphony orchestra brightest\n\n\n[noise]\nBravado by Frederick ... Adrian Leeper conducted the Czechoslovakia radio symphony orchestra brought US law\nThere's just a bit of a debate as to who actually wrote the music we're about to hear\nMost people think is Leopold Mozart that's the general consensus among other days Mozart's father some do think it might be one of the high didn't use it for his brother Michael\nBut some other research more recently says maybe it was just a random monk in Austria who wrote this piece well either way it's pretty unique the toys symphony and it's called that because there are actual toy instruments included in the score can't miss them here's get on Kramer leading his group Kramer Alta Baltic\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n\n\n\n\n\n\n\nVe Iceland symphony orchestra but by ... in the tone pull him Ishtar by Frenchman ... that'd be a Joe gets thanks for tuning in on the way next big organ could sure do from humble composer from central Massachusetts\n[noise]\nHoratio Parker grew up in the hills of central Massachusetts went out to be one of America's top composer the last half of the Eighteen hundreds\nHe went to Germany to study for a while to where the organist and composer user framed burger no doubt had an influence on Horatio Parker's only organ concerto here it is played by organist Steven ... with the Nebraska chamber orchestra\n[noise]\n\n\nNa\n[noise] [noise]\n[noise]\nLeader in life record Strauss would consider himself to be a musical hero but early on he looked back for musical heroes specifically to composers from Vienna like most are hiding and Schubert\nNo surprise bam that some of research drops his earliest works are in that kind of mold he wrote an early symphony some music for the piano piano sonata\nAnd his only string quartet came as younger years as well\nOn joke here several here that youthful string quartet by research drought coming up in about Fifteen minutes things from us [noise]\nHe's a cold night in ... by ... played by Geoffrey Burleson\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise] [noise] [noise] [noise]\n[noise] [noise]\n\n[noise] [noise]\nMm [noise]\n[noise]\n[noise] [noise] [noise]\n[noise] [noise]\n[noise]\n\n[noise] [noise] [noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n\n[noise]\n[noise]\n\n[noise] [noise]\n[noise]\n\n[noise]\n\n\n\n[noise] [noise] [noise]\n[noise]\n[noise]\n\n[noise] I didn't lose that by Camille ... sauce played by pianist Jeffrey Burleson will spend a little time in what's been with the Lisbon metropolitan orchestra\nLater this hour\nButterworth was one of England's most promising composers at the beginning of the twentieth century\nBut like so many young English man he went off to fight in the first World War and like so many of them he lost his life George Butterworth dying in the trenches that the battle of the song one of the bloodiest and most horrible encounters at the entire war [noise]\nHe's remembered that through his beautiful music which is so serene and peaceful compared to his death here's works called the banks of green willow played by the Academy of St Martin in the fields like ...\n\n\n... Mm\n[noise]\n\n[noise] [noise] ... ...\n\n\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\n\n\n\n\nMm\n\n\n\n\n\n[noise]\nMm [noise]\n\n\n\n\n\n\n\n\nRecord Strauss wrote his only string quartet as a young man he never went back to writing string quartets instead focusing on big showy or Castro pieces for pretty much the rest of his output but I'm Glad he did write that one paying homage to hide in Mozart yeah we heard it played there\nUp next [noise]\n\n\n\n\n\n\n\n\nKnow\n\nYou're still been metropolitan orchestra led by Iraq has to do in the major by Peter ...\nMaybe\n\n[noise]\n\nAnd now that\n\n\n\n\nAnd then then\n\n[noise]\nLots of people might not be a big name in the world classical music but he's an important composer not so much for the music he composed but for the other things he pursued in life he wasn't just a musician he studied theology philosophy and law even in his younger years\nUltimately deciding though that music was the way to go but those other pursuits found their way in to people's music [noise]\nWe're going to hear coming up in a little bit less in front of your by people based on one of the news he wrote lots of simply based on uses and Cleo the Greek music history is the inspiration for the symphony well here coming up in about Fifteen minutes I'm Joe gap stinks\nSpeaking of amuses here's music from the French Renaissance composer ... hey part of his new book called the secret of the music business ... performing\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n\n[noise]\n\n\nThe ... in the form of lament by Nicholas Vitale hey from his secrets of the music that was looking at how will that music inspired by the Greek muse is coming up a bit later\nHot and cold music on the way next we'll hear the fire to ... for heart by David Watkins coming up and about five or six minutes right now though a set of what Eric such he called new cooled pieces for the piano played by ... frozen hey\n\n\n\n[noise] [noise]\n[noise] [noise]\n[noise] [noise]\n\n[noise]\n\n\n[noise] [noise]\n\n\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\nMm\n\n[noise]\n[noise]\n\n\n[noise]\n\n\n\n[noise]\n\n\n[noise]\n[noise] [noise] [noise]\n... ...\n...\n...\n... ...\n... ... ...\n...\n... ...\n\n...\n... ... ... ...\n...\n...\n... ...\n...\n[noise] [noise] [noise]\n\nMm Mm\n\n... ...\n... ...\n\n... ...\n...\n...\n\n\n\n... ...\n[noise] [noise] [noise] [noise] [noise]\n[noise] [noise]\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n...\n\n\n\n\n...\n\nMm\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n\n\n...\n\n[noise]\nDetail is Francesca over ... is a classic of one being married to one person but being in love with another\nIn the case of French ... she was married to one man who was kind of a cripple an older but fell madly in love with the man [noise] younger brother pie although I have to carry on a tour to fare for about a decade before her husband walked in and found them\n... did a poll about her and I'm the last time on the French composer did a ballet about Francesca every year that ballet music coming up in about twenty minutes I'm Joe gets thanks for two and again [noise]\nSpeaking of duct tape we'll hear from St Louis done taste to not coming up a bit later this hour right now the softer tied to lift his lead this trial or love dream in a flap plate shared by pianist you've guinea keeps getting\n\n\n... ... ... ... ... ...\n\n\n\n\n[noise]\n\n\n\n\n[noise]\n[noise] [noise]\n[noise] [noise] [noise]\n\n\n[noise]\n\n\n\nFriends list leaves Trump or love dream number three in a flat played by canisters guinea keeps it kind of the stuff just died of frogs list well here the big virtuoso tide\nComing up a bit later\nJoe gets thanks so much for tuning it coming up a bit later the ballet from swabs to do really neat ... Tomas ... ...\nFor love and it's quite a tale coming up about Fifteen minutes\nFor some music by the Italian Baroque violin after our country low ... really one of his violence and not at least ... Schneider plays the violin here with organist over ... Hanson and looped played by bingo monger for that call themselves ... really\n[noise]\n\n\n\n[noise]\n\n\n\n\n\n\n\n\n\n[noise]\n\n\n\nAccording to Dante and who's been burned out when he met Francesca of remaining in the second circle of hell curtail made him feel ... fold that he collapsed evidently\nFrancesco remedy fell in love with her husband younger brother her husband was ailing kind of crippled butter younger brother\nHe happened upon them in her bedroom and well he did the man\nThat tell our Francesca debris money first appearing in the ... also comes out in music some type of fat here's the example we don't hear too much the ballet ... was very many by French been ... ... here's the English concert orchestra led by Richard ...\n\n\n\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\nKnow\n[noise]\n\n[noise]\nMm\nMm\n\n\n\n\n\n\n\n\nFrom list towards the middle of his life went through a burst of activity based on literature the probably the most famous example if his duct tape and not actually called after a lecture by Dante you every day it's played by campus to bury Douglas Mm\nMm\nMm\nMm Mm\n\n\n[noise]\n\n[noise]\nOw\n[noise]\n[noise]\n[laughter] [noise]\n\n[noise]\n[noise]\n... ... ...\n[noise] Mm [noise]\n\n\n\n[noise]\n\n[noise]\n[noise]\n[noise] [noise]\n\n\n\n\n[noise]\n[noise]\n\n\n\nMm\n\n\n\n", "show_name": "BBC World Service", "year": "2018", "city": "Moscow", "day": "11"}