{"month": "10", "state": "MA", "station": "WNCK", "content": "This is eighty nine point five W. N. C. K. Nantucket\n\nEven in the middle of a story about the devil [noise]\nDiversion is in order ballet [noise]\nThis is the belly music from showing grows out based on good you it's great to equal what are the greatest works in western literature they say [noise]\nBut as with many Nineteen century operas you've still got a ballet in the middle of the mind a little break [noise]\nIt's a metaphor in there it seems to me for a\nMeeting a break from the\nCheating gravity\nCheating gravity [noise]\nSounds about music from ... new coming up this hour [noise]\nLive from NPR News in Washington I'm jak spear Georgia's governor is declaring a state of emergency for more than two thirds of that state as Asia is among burns reports from W. A. B. E. N. Atlanta hurricane Michael had Georgia harder than officials originally anticipated\nGovernor Nathan Deal ... unlike any this state has ever seen\nWe are not accustomed to the magnitude of the hurricane such as this getting in the direction that are just travelling and with the intensity with which it will hit our state\nThat intensity ... federal government issued a declaration of emergency federal funds to help pay for some preparation and clean up for NPR News I'm Asian smelling bearing in Atlanta\nMeanwhile the Florida Panhandle war Michael roared ashore earlier today as a strong category for hurricane with a hundred and fifty five mile an hour wind gusts damages appear to be extensive Panama City trees are uprooted the power lines are down some homes either had their roofs torn off were split in two by falling trees Brian\n... is with the American Red Cross and says they're expecting many more people to wind up in shelters and the difficult twenty four hours for search and rescue teams\nWe know that people did not evacuated so what that tells us is we have a pretty good sense of how our first responders are going to be required to perform search and rescue overflowed\nOfficials say one man was killed by a fall and tree in the panhandle area nearly two hundred thousand customers in Florida alone are without power after the storm which is also caused extensive flooding\nChief justice John Roberts says referred to another circuit court Fifteen judicial misconduct complaints filed a recently against Brett cabin on the D.C court of appeals or cabinet served until this past weekend and bears needed Totenberg reports that complaints all stemmed from Kavanaugh's testimony during his confirmation hearings\nThe complaints filed in the DC circuit in September in early October when Kavanaugh was still a judge on that circuit the to complaints that have been made public were brought by the Democratic coalition a political action committee and Washington the charges added Kevin ... lied and violated judicial ethics rules against partisanship\nJust who filed the remaining Thirteen complains has not been disclosed but the D.C court kicked the allegations up to chief justice Roberts for a referral to another ... Roberts then sent them to the tenth circuit in Colorado which theoretically could now launched an investigation but experts say that's highly unlikely\nNina Totenberg NPR News Washington\nThe costs of goods as they head down the pipeline to consumers rose slightly last month the Labor Department says it's producer price index a key wholesale inflation gauge was up to tens of percent the rise offset lower food and energy prices the agency says wholesale inflation compared to a year ago it was up to point six percent\nMajor sell off on Wall street today the biggest drop in eight months with all three of the major indices down within three percent the Dow fell eight hundred and thirty one points that I was down three hundred and Fifteen points this is NPR\n\nNew rules from the Treasury Department named controlling foreign investment in us firms have been approved\nNew guidelines will require foreign investors to alert a treasury but inter agency committee any deals giving them access to key technology industries the agreement will cover twenty seven critical industries including semi conductors telecommunications and defense Lewis latest escalation in the ongoing trade battle between us and China\nThe Commerce Department watchdog group says it's considering calls from Congress for an investigation into how the Trump Administration came up with plans to add a citizenship question to the twenty twenty cents as NPR's Hansi Lo Wang reports the requests for an investigation came from Democrats are both the U.S Senate and the house of representatives\nDemocratic senators Brian Schatz and Cory Booker as well as representatives Elijah Cummings and Jerry Connelly are leading the calls for an investigation of commerce secretary Wilbur Ross who oversees the census\nRecessive dieting Congress that he approved the citizenship question quote silly in response to the Justice Department classroom last December but internal memos and emails show he and his staff tried to get the question on to the centers months before\nThe senators also highlights Census Bureau research suggesting that asking about citizenship status could discourage non citizens from taking part in the head count the citizenship question has already spiked multiple lawsuits that are making their way to the Supreme Court ... NPR News New York\nPost sixty nine billion dollar merger between CBS it at that has been given the green light by Justice Department regulators though with some conditions department officials say that they have approved to deal with the condition that the cells it's Medicare part D prescription drug business to resolve anti monopoly issues\nI'm jak spirit NPR News in Washington\nSupport for NPR comes from NPR stations other contributors include that Jayanti and Catherine the MacArthur Foundation recognizing exceptionally creative individuals' this year's MacArthur fellows and more information alright max down dot org and that listeners who support this NPR station\nIs small scale than in Qatar [noise]\nClassical music on a Wednesday evening and I'm Steve seal hire you and I know you can't answer 'cause it's radio but I Hope you're doing well and I've got music and his boss later on for flute and guitar\nMaybe that doesn't mean anything to you but it's a nice piece and I'm just means you get the heightened which is also very nice because the heightened so little keyboard music uh deserves to be much much more well known that it is so agreeable\nRudolph ... plays piano here this is the pianist monitor for thirty one by heightened\n[noise]\n[noise]\n\n[noise]\n[noise]\n\n\n\n\n[noise] [noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n\n[noise] [noise]\n\n[noise]\n[noise] [noise]\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[laughter]\n[noise] [noise]\n[noise]\n\n[noise]\n[noise] [noise] [noise] [noise]\n\n[noise]\n[noise]\n\n\n[noise]\n[noise]\n\n\n\n\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise]\n\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\n[noise] see what did they tell me the key word music it just it serves should listen ... thirty one by that was real books W. N. C. K. Nantucket\n\n\n[noise]\n[noise]\n\n\nThat took its NPR station eighty nine points fine W. N. C. K. you been in\nAn opera about Memphis stuff amaze you still get down to lay in the middle as was custom and operas in the Eighteen Nineteen centuries about like Julie this is the post belly music\nFrom the ... by short no Chernobyl Mariner conducts the Academy of St Martin in the field as well\n[noise]\n[noise]\n\n\nThe ... ballet music ... no ... at the Academy of St Martin in the fields which would be a little known sort of the you know that we now return your two are regularly scheduled program about the devil now that the ah the trick is done\nMusic for flu twentieth century music ... coming up smoked ...\n[noise]\nThis is Cynthia something from the actors comedy I Love ... because the performing arts flourished out here and my radio station ... eighty nine point five W. A. C. K. ... NPR station and\nThis is from ... Missouri Ernest ... it's he's sweet ... Modelo mode that is as opposed to a\nStraightforward skills major in minor what more do a it's a musical logical Leon life or at least the flu here and one has been to Chicago string ensemble\n[noise]\n\n\n\n[noise]\n\n[noise]\n...\n\n[noise] Mm\n\n\nMm\n\n\n\n\n\n\n[noise]\n\n\nSkies will clear for the weekend that's your island forecast this is a meteorologist\nRuss Marlon eighty nine point five W. N. C. K.\n\n\nMentioned being a manufacturer of instruments and sending a letter to club you see I'm thinking\nI Wonder if you see we'll take us up on our offer to write a piece of music for our New Hartford and taking a shot in the dark but it's worth a try getting a response back from the grand master saying [noise] sure I'll do it [noise]\n\nCan you imagine the elation the or the ... factory and he would actually do it but that was the result of the sacred and profane dancers were\nHard and small on some musical do we see coming up here in about a half an hour [noise]\nLive from NPR News in Washington I'm jak spear most of Georgia is under threat of heavy wins flooding and tornados as hurricane Michael continues to make its path inland Georgia Public broadcasting Steven Fowler as more Georgia is one of the largest\nStates east of the Mississippi and Michael is larger than that\nHigh winds and heavy bands of rain will continue across the state overnight at southwest Georgia farmers worry about pecan cotton and peanut crop others and the storm's path could be left without power and are at risk of damage from fallen trees and debris\nThere are reports of isolated tornadoes across the state governor Nathan Deal has declared a state of emergency for over two thirds of Georgia's counties in is asking for a federal declaration as well for NPR News I'm Stephen Fowler in Atlanta Michael now a\nCategory one hurricane came ashore this afternoon as a powerful category ... storm in the Florida Panhandle word caused extensive damage in at least one death President Trump says the White House is looking for answers in the disappearance of Saudi Arabian journalist or mocha shaggy NPR's Asia Roscoe as more from the White House says\nIt's important to find out what happened to democracy Yogi administration officials have chocolate Saudi Arabia's crown prince Mohammed bin some months about the missing journalists Trump says the U.S is asking the Saudis to provide more information about the investigation\nIt's very sad situation is very sad situation and we want to get to the bottom nothing\nTo show me it was last seen entering the Saudi consulate in its gamble that with a little more than a week ago and he has not been seen sense as a columnist for the Washington Post he has been critical at the Saudi royal family Ayesha Rascoe NPR News the White House\nFBI says well it's a background check of new Supreme Court justice Brett Kavanaugh was limited in scope the usual process was followed FBI Director Chris Wray answering questions about the ...\nUsual process was followed FBI Director Chris Wray answering questions about the background investigation during a Senate subcommittee hearing today said that while less expensive than a criminal background check the investigation requested by the White House followed standard procedure\nWall Street hasn't seen a sell off like the one today since February all three of the major U.S stock market indices falling three percent or more with some of the biggest declines coming in an area that's done well so far this year the tech sector dying swamp cheaper controversial grant for it and so some investors appear to be worried about how pricey stocks like apple and Amazon to become\nWe hit you know a point where all of a sudden you had two major tech stocks caught a trillion dollars in value and all of a sudden that you know reality slip Tibet today the ground shifted\nApple fell four point six percent while Amazon Microsoft both dropped more than ... percent vectors are also worried about rising interest rates\nChecking the numbers the Dow dropped eight hundred and thirty one points today to close the twenty five thousand five Ninety eight the NASDAQ fell three hundred and Fifteen points yes it'd be five hundred drop Ninety four points\nThis is NPR after running under an interim cheap since March U.S Forest service has an official boss NPR's Kirk Siegler reports the Trump Administration is happy interim chief Vicki Christians in the lead the agency\nVicki christiansen is overseeing state forest in Washington in Arizona and spent the past seven years in Washington DC with a federal Forest Service\nShe's also been a wild land firefighter and has worked extensively and fire management that's one of the biggest and most important roles of the modern day Forest Service [noise] this is a highly scrutinized physician she'll ever see a hundred and fifty for national forest in twenty national grasslands\nChristians and also takes over the agency at a time of turmoil her predecessor resigned earlier this year amid a sexual harassment investigation\nAgency is still grappling with numerous complaints in law suits many in California over alleged sexual misconduct by supervisors Kirk Siegler NPR News\nMany Americans can expect to pay higher heating bills this whether that's based on the latest for cash from the U.S energy information administration which in a summary report says the increased cost primarily a result of higher prices for heating fuel since temperatures during the winter eating ... October through march or expect to be similar to last year\n... says it expects this one will be about one percent colder than last year prices for all of the main heating feels natural gas electricity heating oil and propane will go walk though getting costs in the mid west for household using propane expected to be lower because of warmer than usual winter weather there\nCould also features prices followed the stock market lower today will down two point four percent to end the session at Seventy three Seventeen a barrel of New York mercantile exchange I'm jak sphere NPR News in Washington\nSupport for NPR comments from NPR stations or their contributors include the Robert Wood Johnson Foundation working alongside others to build the culture of health\nThat provide everyone in America a fair and just opportunity for health and wellbeing more at our W J yes dot org\nI'm Steve sealed evening [noise] do you see coming up the secret in profane dances\nFor heart and on some board and handle for keyboard and Mozart here from the ground partied a\nMm Mm Mm Mm\nMm\nMm [noise]\n[noise]\n\n[noise] [noise]\nMm\n[noise]\n[noise]\n\n[noise]\n\n[noise]\nMm [noise]\n\n[noise] [noise]\n\n\n\n[noise]\n[noise]\n\n\n\nMm [noise]\n\n\n\n\n\n\n\nMm\n[noise] Mm\n[noise] uh [noise]\n\n\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n[noise]\n\n\n\n\n[noise]\n\n\n[noise]\n\n\n\n\n[noise]\n\n\n\n[noise]\n[noise]\n\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise]\n[noise]\n\n\n[noise]\n\n[noise]\n\n[noise] [noise]\n\n\n\n[noise]\n\n\n\n\n[noise] [noise]\n[noise] [noise]\n\n[noise] [noise] [noise] [noise]\n\n[noise] [noise]\n[noise]\n[noise]\n[noise]\n[noise] [noise]\n[noise]\n\nThat's pianist Andre ... keyboards sweets number ten by handle W. N. C. K. Nantucket\n\n\n\nPackets NPR station eighty nine point nine W. N. T. K.\nO. W. sees secret in profane dance which is a word that came about when the plane ... factory the manufacture of heart\n... bc and asked him if he would write a piece of music that we demonstrate to the the new mechanisms and the new model of heart he obliged he said that he would you mentioned the delight\nEighty nine point five W. N. C. K. Mm\nI'm Joanna real joined me for balancing act weekends on Nantucket public radio eighty nine twenty five W and the cat my share their stories of how they came to be on their ... and also for a snapshot of their lives what fires down and the things I Lived life has time\nBalancing act has supported by lavender farm Nantucket health and wellness concierge offering personalized retreats at your home\nVisit lavender farm Nantucket dot com to learn more about their health and wellness surfaces\nMisuse music by the German composer retired we buried here this is certainly for strings subtitles knocked Lucy\nWe've been here since ... certainly were strings subtitles knocked will seek you're by you're stuck in the are are you going to guess ... you had a\n\n\n[noise]\n\n[noise]\n\n[noise]", "show_name": "Classical 24 with Steve Seel", "year": "2018", "city": "Nantucket", "day": "11"}