{"month": "10", "state": "TN", "station": "WJCW", "content": "That's six issues of a Mac celebrated magazine and it's all part of an a Mac membership get your copy of the latest edition of the a Mac advantage magazines by joining right now a Mac dot U. S. A. M. A. C. dot U. S.\nAre you worried your identity could be held hostage you should be because ransomware does exactly the\nLosers Tom Kelly studio of my id pure making every American safer from the effect of R D served as a tall order but that's my goal so here's a tip the best things you can do to help protect yourself from ramps and we're just a buck up your computer often if you have questions about identity theft at even if you're struggling with fraud today my id care can help\nGet Fifteen Percent off at my id care dot com slash mark my id care dot coms last mark [noise]\nIndividuals and businesses with tax problems listen carefully if you will over ten thousand dollars in back taxes or Arab on file tax returns us ... can help you take back\nControl the IRS ... does your paycheck closure business and file criminal charges our team of tax attorneys can stop collections and get you protected us to act shield offers a price protection guaranteed to get you protected today us ... plus rated with the BBC so called eight hundred by one nine Seventy seven Ninety six us to actually killed eight hundred by\nOne Seventy seven Ninety six\nDebate was so tempting free trip gifts and then you get hooked by the sales pitch bought a timeshare and you regretted it ever since\nThe maintenance fees kept increasing and we just didn't want to deal with it anymore it was not anything like what they showed us when we bought a timeshare\nTimes years or the day of the lake their own cat you know really unless you have to resort relief we didn't release you from a timeshare legally and permanently ... was written by the BBC be a one hundred percent money back guarantee that our clients five\nStar reviews job the story you get just a board of the entire group he was never anything hidden absolutely wonderful either one of the gun away before twenty Nineteen maintenance fees are due goal now for a free consultation ... nine fifty by\n... duty nine fifty bucks for resort ... dot com\nThey judge we release resort really ... fifty nine to ... ...\nA fifty nine fifty five or resort released on job call now\nIf you can't seem to stay ahead of your bills than this messages for you how would you like to have a large portion of your credit card debt medical bills and department store dead forgiven national credit card relief would like to give you free information on a proven debt forgiveness program this program has been used by thousands to legally forgive millions and unlike your debt\nIt's not bankruptcy is not consolidation this special program actually wiped clean the portion of your debt that is forgiven promote you owe your creditors call for free information and get all your questions answered in the first free call\nThe more you all the more you can save\nIf you have at least ten thousand dollars or more in credit card bills this debt forgiveness program can be very effective coal for free information and find out more now\nEight hundred to knowing one six six seven oh there was no cost or obligation for the information build weight goal eight hundred to nine one six six seven oh let's see hundreds to low in one six six ... get your debt problems solved ... eight hundred to knowing one six six seven oh today not available in North Dakota\nYou know it's not smart job sites that overwhelm you with tons of the wrong resumes by you know what is smart zip recruiter dot com slash live in L. E. V. I. N. unlike other job sites zip recruiter doesn't wait for candidates to find you\nZip recruiter finds them for you it's powerful matching technologies scans thousands of resumes identify people with the right skills education and experience for your job and actively\nInvites them to apply so you get qualified candidates fast no more sorting through the wrong resumes and Omar waiting for the right candidates to apply\nIt's no wonder that free critter is rated number one by employers in the United states\nThis rating comes from hiring sites on trust pilot with over one thousand reviews and right now my listeners control freak writer for free at this exclusive website recruiter dot com slash\nLove in that ship recruiter dot com slash L. E. V. I. N. G. precluded dot com slash and live in ... the smartest way to hire [noise]\n[noise]\n[noise]\n\nThe headlines you just can't make a [noise]\nTrump said cursing or angry Kanye is an Oval Office as America suffers with a hurricane\n\nKanye West's making every liberal freak out I guess just 'cause they they realize that they're losing control\nOf their democratic slaves African Americans that they feel like they own as slaves\n\nYou have so many African Americans that are walking away from the Democratic party and they don't know what to do they don't know how to handle it they don't understand what's gonna happen here\nSo they say things to do great they say things\nLike this is what happens when negroes don't read 'em and came and we have this finale now Donald Trump is going to use it in front of artists and he's going to have somebody who can stand with my secretary [noise]\nThey love it to me and the individual\nTell people they've got mental health issues tell people they're unstable\n\nHelp people and they're missing the NBA MSNBC how dumbfounded after Kanye West but the White House saying quote that was an assault on our White House how is Kanye West giving you a perspective on life on a salt on our White House\nThe same people I I I mean you're talking about salt let's talk about the assaults on our intelligence on how many hours you're given to Michael I have an eddy in a\nPorn star you're talking about us salts\nThat's awesome I intelligent [noise]\nAlright I'm Out of time I want to\nSay once again thanks to Marco Venice same for me so and I hope you guys enjoy that you can follow me on Twitter about Ferguson show\nFacebook vent Ferguson there as well God Bless America hopefully I'll see it back here on the market will be back next week have occurring now [noise]\n\n\n\n\n\n\n\n\n\n\n\n[noise] trying to talk radio station to Eugene cw Johnson City for [noise]\nRecovering from disaster journalists fate ... search and rescue crews spend much of the day making way through the hard hit\nThirty six hours ago those were beautiful homes and businesses and literally they have been robbed washed sawed down to the foundation that is sadly the situation with much of Mexico a beach right now\nIs shows you first of all the people listening secondly and this is something I think it's amazing is\nIs that you know the response has been incredible and it has been a massive a response and the way that they think it's been handled the amount of of preparation that's gone into this knowing exactly what is coming has been it's been huge\nIf thirty five hundred for the national guard with more than one thousand high water vehicles Thirteen helicopters and sixteen votes for humanitarian assistance security operations and search and rescue yeah\nYeah so it's just crazy crazy a situation to see some of these places because this isn't my what I'm Talking about a third world country of parts of Florida ... sketchy but we're not talking about a third world country we're not talking about this isn't Haiti\nRight this isn't you know a fishing village in in in Indonesia Thailand this is the United states of America and watch Michael did\nDo some of these areas is just\nAbsolutely ferocious\nLooks like Hiroshima with color you couldn't I mean it is it it has changed the landscape of of\nSome of these areas it shoot three two three five three twenty four twenty three at you had mentioned show is your Twitter well it is a no other day and it was ugly day worries about rising interest rates signs of us\nOh down in the global economy and concerns over U.S China trade sent the markets into a tailspin again today the Dow plunged more than five hundred forty points down over Thirteen hundred in the past two sessions and off more than five percent the most is given up since February yeah\nAnd the last couple of days it's down a big time why well I mean here's the thing depends on who you talk to\nA lot of people are looking and this is I think the fight that's going on with the fed between the rates interest rates and they walk these weird fine lines of trying to fight inflation raising rates in a way that things don't get out of control trying to fight hyperinflation doing all of these kinds of things\nYou got a lot of companies out there as we head into the fourth quarter they're looking at their numbers not only retail but things look pretty good but you got some tax issues as well so people were panicking smart money you know what they're doing if they're not on the sidelines looking right now what pulled back that I can make money off of a but should you freak out I don't think so\nHold on a hill do read a book to take a walk go work out do something but don't obsess about you know what is it all likelihood of pretty run of the mill normal market pull back\n... and ... and ... you got to remember to some of the people that you see in the pull back some of the stuff where you see it starting ... people are selling off\nBecause they made a huge profit they're looking for the next something they're thinking hey things here especially tech stocks may be at this moment in time completely overvalued the average person\nHe goes oh my God it's a recession it's calming it get stopped the interest rates\nAre an interesting thing ... truck came out yesterday kind of ... on the interest rates in supporting remember we're heading into midterm were less than four weeks away from the midterm there's battles going on everywhere the Republicans have been kind of mom and a lot of the way that they deal with because of the cabinet\nThing and the big fight that's going on there but his head into this you've got an economy that is but when you've got a fourth quarter here which I think it's going to be tremendous in particular I think in that particular way that we haven't seen a long time where we're going to see retailers with a huge smiles on their faces\nAnd ... but it just because of what happened to two thousand Seventy thousand eight there is a worry that I get that for us to move a lot of issues when it comes to that but the interest rate thing is very important and that's one of those things especially that into fourth quarter people you know it's Christmas maybe I got a credit cards or something like that I Want to have a good year money to get more expensive\nNow that the economy's doing better interest rates are rising and uh the bond market a kind of got that memo last week and the stock market got that mental this week uh and as a result it investors are predictably throwing a little bit of a temper tantrum\nYeah but it's not to panic and I think too often because we see something\nAnd and it's and it's down like twelve Thirteen reports I've got these people to read I mean all the time well Trump's economies dying now they're not understanding the cyclical nature and understanding and investing nature of the way things are going they don't get all of that so they're like ah and it's like slow you're all\nTake a deep breath why do we need somebody to fail for your side to succeed that to me is ridiculous three two three five three twenty four twenty three at you had mentioned shows your Twitter you can tweet us yes we are going to talk about it we're going to talk about ... was it surreal\nYeah it was three it was an interesting\nHell yeah it was interesting was it everything that anybody thought it was going to be who can predict with any of these things are going to be with these two guys and these two egos get together I'm surprised the cameras got in there three two three five three twenty four twenty three and\nShe had been some shows your Twitter guess what kids we've got a poll question up I Want to talk to you about that but first let's talk about my sleeping habits and now you can make them like yours\nYeah my pillow in credible my pillow is amazing hundred percent wishy washy won't drive all made the usa backed by the ten year warranty this is why you should get\nSleep is vitally important getting rest for your body is incredible not only to recharge your batteries are more productive the next day heart health they show that the more you sleep better sleep more well rested you are it's better for your health heart wise strokes\nReduce blood pressure oh yeah and weight loss why because if your tired you're always looking for energy are always snacking yes what happened to eat more\nWhen you have more energy you don't have to worry about it you burn fat get what I'm going here that's why my pillow small little thing that's changed goes a long way I Try not to go anywhere without it I the other day didn't have my my pillow\nIt was awful night last night on my pillow out like a light I slip six plus hours it was amazing incredible best night sleep I hadn't forever get yours today buy one get one for you by a pillow it get a pillow fight one fellow get another pillow go to my pillow dot com that's my pillow dot com used promo code Benson\nB. E. N. S. O. N. two fellows with the price of one world's most comfortable below my fellow dot com ...\nColumn on the telephone\nEight hundred nine four four forty nine Seventy five eight hundred nine four four forty nine Seventy five or my pillow dot com promo called venting at you had mentioned shows your Twitter C. H. A. D. P. E. N. S. Atlanta got your urban where today and the Twitter poll plus yes kids\nChapman's that you\nDo you like saving money do you like knowing someone has your back as you're getting older and starting to be faced with the reality of Medicare and the future of Social Security my partners at the association of mature American citizens otherwise known as a Mac or focused on protecting the interests of mature Americans meaning anyone over fifty\nI'm partnering with a Mac because they offer an alternative perspective on how to solve problems like Social Security or foreign protecting our borders with common sense immigration laws and fixing medicate\nBut a Mac is way more than a political advocacy organization they're member benefits include travel discount roadside assistance discount retailing restaurant discounts and so much more a Mac is offering my listeners a free membership go to a Mac\nDot US forward slash chat receive your first year free that's am a she taught us forward slash chat do costs no tricks know credit card required go to a Mac ... us forward slash jets are called eight eight eight three five five sixteen sixty eight that's eight eight eight three five five sixteen sixty eight or online at ... us boards last chance\n\nIf our country is to have a bright future we must stop looking back at our racial division and start looking forward at our national unity\nWhat can we do to realize the vision of one nation under God indivisible liberty and justice for all his ... president stands staying true to America's national destiny I have a suggestion which I Believe is essential for the future of our country\nNewer way with hyphenated identity no more Irish American Italian American Hispanic American African American et cetera put America and unity first\nOr American of Irish descent Italian descent Asian descent I Am an American of African descent we are all Americans first a common culture in heritage we might like to visit her ancestral homes but we don't want to live there\nOur ancestors came on different shifts but we'll all in the same boat now time for every citizen of the United states to say I am an American\nIf the measure of a car with how many people turned into people who love cars the Subaru Outback wouldn't be worth its weight in gold thanks largely to its symmetrical hall little dry\nUnlike other systems await for a will to slip it powers all four wheels all the time all while we're better fuel economy the midsize SUV and the fact that the outback has made in a zero landfill plan doesn't hurt either as a car that is truly built to be low love it's what makes us [noise]\nYou ever wonder what you do if you couldn't just switch on the heat when it got Cold War starter car each morning or afford pointless paper welfare plenty of hardworking folks right here in our community these are everyday reality but when you get to the salvation army you how your neighbors and need when the battle to pry\nWant to join the fight for good please visit Salvation Army dot listen and kids dot org make a donation that Salvation Army stop listening give dot org or\nYou can spend this fall hauling bags of leaves to the curb or holiday [noise]\nYour local dodge dealership for great deals on dodge charger\nThirty MPG highway judge challenger\nThat's according to a new American Academy of pediatrics report Mayo Clinic Dr angel Mackey agrees\nWe want them to be learning to play ... structure and play is the best way that they can learn their developmental skills they can learn social and emotional regulation they can learn how to relate to problem solve with other children\nDr Mackey says good old fashioned play time not only helps children develop social skills but it also helps with language skills and with stress\nRelief and in a world where screens are everywhere Dr Matthew said it's important to make sure to turn them off\nThere's a lot of different areas that too much screen time can affect the health of children that first one would be like we see it from young children all the way up to teenagers\nToo much screen time is associated with being sedentary and moving is important for good health for more information talk with your health care provider or visit Mayo Clinic dot org\nRun like a girl is a nonpartisan hot cat gets a documentary on the on the number of women running for office in the twenty he mid term election\nWant to hear what it's like to run like a girl in such a heated political climate last year we ... this year we run [noise]\nWestwood One find us on apple ... hot gas or wherever you listen to your gas\nOr veterans were there for you everyday to ensure our way of one let them know we can join me as a pro supporter of our veterans Hi this is Joe Montana and on the one hundredth anniversary of Veterans Day help no rent alone improve the lives of those who have served our country\nPlease show your support and text\nV. E. T. too hateful eight feet taped to give back a little to those who give us so much ... V. E. T. H. hole he'd he'd think\nAny given moment somewhere in America a baby is taking a person that\nI developed mental milestone but for too many parents had a baby sports center on to my dog and they are\nThese are the parents of babies who were born prematurely or with or it's a crisis affecting more than half a million babies in the United states each year you can help them but I joined the volunteers like you\nTo vote in March for baby\nBabies overcome challenges\nOur sense make stronger\nTo do I perform for [noise]\nI perform for all the awesome composer whose music deserves to be heard\nPerform for all the stagehand\nMake sure I never missed a cue\nHigh school choir director who taught me to read from the ... and ...\n... speech page views are using the performing arts teacher valuable life lesson that typically aren't taught in the classroom they help high school students learn leadership skills that prepare them to enjoy more satisfying to live\nThe form for Mrs ... my high school debate coach who would help me become more confident than I ever dreamed talking\nThis message presented by the Tennessee secondary school athletic association and the high school in your commute [noise]\nThere are some moments only the force conspire find yours I discovered the forest Darkhorse learn about horse near you and discover things to do when you go visit discover the fourth floor walk to you by the U.S Forest Service and the ad council\n[noise]\n\nIndependent in thought and punk rock in life\nIs the best in show\nJim ... walking to the sunny constantly in Turkey last week it hasn't been heard from since Senator Chris Murphy\nSays he's seen nothing to suggest ... is still alive a bipartisan group of senators now calling on President Trump to open an investigation and imposed sanctions if it determined that not violated ... humid right\nYeah if you follow this this is very interesting it is gotten ugly and it is bizarre so you had this journalist in Turkey go to the Saudi Arabia\nAnd embassies ... disappeared and\nIt looks like it was a hit job and we're in the middle of a hundred billion dollar deal arms deal with\nThe Saudis and\nPeople are starting to ask serious questions about where in God's name is this guy and uh let me tell you something this is ...\n... Trump really wants to this deal done because the way he looks at this deal is it's going to get done with us or it's going to get done with somebody\nRight like it's going to get did with us or the Russians are going to have a chance to do to get this done\nI don't like the concept of stopping and investment of a hundred and ten billion dollars into the United states because you know what they're going to do they're going to take the money and spend it or Russia or China or someplace else\n... a buddy in saying that you have senators on both sides of the aisle coming out and saying yeah we may put an end of this deal ah because we need to know what's up with this guy where is the what happened because some of the footage you looked like there was like a hit squad\nComing after this guy like these and and just disappear\nWith the exception of Israel\nI trust 'em [noise] everyone else in the middle east\nAbout as much as I trust gas stations stations sushi [laughter]\n[noise] but it's all areas that they're that that that's how much some of these people or trust that John Kennedy Republican with the ana you bet Lindsey Graham come out and talk about it\nThink the president's done it just right we want to have a relationship with Saudi Arabia there is a teacher or the\nMoral immediately arrangements are helping us on Twitter\nYeah and at the same time you can't have something like this you can't have somebody disappear and there is a real sense that this thing could blow up\nIn\nThis entire deal the question is why where is what happened to this guy\nI can understand why make cautious but um I Do things that are over the next several days it's likely that that a tenor will change a little bit\n[noise] we'll see we'll see but the the thought processes that they may put an end to it and it's another one of those I mean the last couple of weeks we've seen what we had the Interpol guy right now is is it is it's very bizarre and they just disappear and what happened what took place where\nDid they take him I mean going into an embassy and then boom gone\n\nAnd what happens it's a hundred and ten billion dollar deal that they kill somebody else is going to get I saw people going he value human life more I mean he values money more than a human life we're not talking I mean this is a ... this is a massive deal\nFor a lot of people whose lives depend on this kind of stuff but Saudi Arabia\nLet's be real we like them because they hate the Iranians that's it they ... they had the Iranians that's why we like the\n... ...\nHow many of the ... or Nineteen I remember that remember remember nine eleven remember that remember all of them\nHow many of them were from Saudi Arabia there are some issues here absolutely but\nTrump's looking at it in a different way of saying well you know what it sounds horrible we need to figure this entire thing out we've got to start figuring this thing out in saying that a hundred and ten million dollars that's that's a lot of money can be coming to the United states and they're going to spend it and there may spend it with somebody else to know those those people are going to get the money\nOr China or Russia and what are they going to do it\nThree two three five three twenty four twenty three and she had been to chose your Twitter you can tweet at us love hearing from you\nSo a very interesting the the question of the day is one of third parties you know when I saw what did I you know you've got ... in there and he's doing his Kanye stuff 'cause that's what ... does and it was interesting he was holding court\nUh but my question is you know why can't we talk to one of the civility is gone and we're going to dig deeper into a little bit later but we need a solid\n\nA third party and here's the thing the stuff that I talked about before when it comes to stories we don't need a third party that equal you can make a lot of noise\nBeing strong and small meaning if you took twenty seats thirty seats in the house maybe five or six seats in the Senate right you'd take anywhere between you know you've got intended Fifteen Percent", "show_name": "no_show", "year": "2018", "city": "Johnson City", "day": "12"}