{"month": "10", "state": "TN", "station": "WJCW", "content": "[noise]\nWe are tied at Twenty one Tennessee hives Lopez will kick off\nAnd he will ... the man that fall is going to go back into the and go to yard and the actor and rocket will have a first down their own twenty\nSo costly rocket ... at the twenty seven of the pioneers and the Vikings taking on down to score on board and go at the four yard line they had a bird and go with the Thirteen gotta nine yards past and then on for thing go they go to C. J. asked\nFor the touchdown pass on the square out\nAnd it's now tied at Twenty one\nSo here we go first\nDown pioneers at their own twenty they have three twenty [noise]\nTo go here trying to stay undefeated [noise] here's markets to throw here comes the blitz pants completely Robin Hood he's nailed immediately by Cape Mitchell and they're going to give a four yard gained a Robin on the path\nIt'll be second down and sick\nRobinson has five cats just for a hundred and sixty one yard to touch them Larkin to Seventy seven through the air\nAs he is fourteen of Nineteen\nAnother stellar performance but we're in a tie game with forty five to go try it [noise]\nIf you don't want to turn it over here is that going to fix up their own twenty four ... looking here come the right path incomplete in and out of our hands of John Connelly at the twenty nine yard line he was running a plant but the ball goes in and out of his hands\nAnd soda referred and six with two thirty two to go well you don't want to give the ball back to the Viking lift quickly either so they don't want to bring it out bird and six rock in their own twenty four yard line and they're going to call and find out to thirty three years ago\nIt's Twenty one forty one will be back in a minute as you listen to jobs here and there are high school football helping people here better since Nineteen Seventy four back in the minutes on W. J. C. W.\nJeannie progress is number one number two employees leave a message\nHey Jamie Jamie this is your daily talk I Know it's been rough going ever since people found out about your compel a group Matt harmony but you will bounce back I mean you're the guy always helping people find coverage options with an enterprise tool it should be you need a pep talk now get out there than high note\nHarmony all the way to national this\nGuys with the insurance company in the middle east right into which match limited by state law\nLong ago you blend thinking gabbing slugging\nAnd you wouldn't have to watch I think\nIt's easy to\nThey\nDo you mind can be I'd be giant now intentionally depend on\nThis is ... message by the by the national Highway Traffic Safety Administration project yellow light noise in the ad council\nBird and thick rocket a thorough twenty four yard line back to throw a lark a\nBird and six throws it out here complete that's Robin ... thirty he's got a first down breath hold down up at the yard line again\nLike a Robin Hood comes up with the boy scouts bought it at the party nine it's eight Fifteen yard gain on the pants Larkin us to Robin said\nBoy that has been the combination tonight on bird and fix Larkin to Robin and it was just a little square up five yards but he can turn to the field and gets Fifteen yards on it\nFirst down from their own thirty nine with two oh nine left to go ... hands it off this time and they throw in for a law practice authority for that was not to fly\nThey handed it off the market is hoping to catch Tennessee Hi by surprise but instead it becomes a five yard last in its second and Fifteen Jordan or only eleven\nYard seven carries rocket just not able to run the football tonight\nAnd they needed to and they're in a time ball game with one forty three to go ... moving\nWill we have over time [noise] second Fifteen rocket us our own thirty four yard line three receivers for the last one to the right [noise] bargains nice time to throw here comes the run up to the surface screen it's complete to print scali\nAny sports forward to the forty and his tackle there\nAnd they try to set up and scream and instead only got five yards back and it's now going to be third down and tanned\nLarkin three are shy of three hundred yards passing and two Ninety seven\n\nAnother big bird downplayed third down and then at the thirty nine with fifty seconds to go\nDo receivers right one left on third down and stand here comes down to the ... I'm sure back to throw Arkansas here comes the list and market just scientifically guideline by a blessing [noise] Tennessee Hi Dave fan and it was\nConor Bailey on the corner blessed and he tackles markets for a law factor the twenty nine that's going to be a stand yard laws and it'll be poor down in along with thirty one seconds to go and Tennessee Hi called time out\nAnd so now the pioneers won't have to part with thirty one seconds to go as large ones is thrown\nFor a ten yard loss\nAnd will hold it right here\nWith thirty one seconds to go Daniel Boone leading Koch County now forty nine to Eighteen and the third quarter Daniel Boone up by thirty one points here we are tied\nWith thirty one seconds to go\nSo crooked just looking at in here they have pointing three yards rushing after that\n\nFact of ten yards via Larkin\nMitt throwback to receive an independent for rocket will be AJ boys [noise]\n\nAll right now has to be good here and the fun has to be\nA way here's the staff it's rather high to avoid boils down to get to the way\nNot very long and hit the forty eight\nAnd crack it down to it at that point at the Tennessee Hi forty eight yard line so now thirty one seconds to go and Tennessee high hazard at their own forty eight yard line and remember all that has to do is given field goal range\n\nAnd Lopez I'm sure is there a long field goal kicker he's got a pretty good legacy Alvaro Lopez their junior kicker as the Vikings habit of their own forty eight yard line with thirty one seconds to go time outs Tennessee Hi has\nTwo time out for remaining and crack it has one here we go next rare the quarterback\nFrom their own forty eight back to throw looking fires it down the left side man is there but the thing complete\nThe parents who was overthrown coming open was half for a moment\nDown to twenty three yard line but I think a bleak\nAnd that you six seconds there's twenty five seconds left\nAnd it'll be second intend Vikings that their own forty eight yard line we're tied at Twenty one with twenty five seconds to go\nTwenty five point to\nTennessee Hi three in one of the conference David crack at three in a conference the Vikings springs themselves to the line on second intent here's miss Maria and the gun\nBack to burrow rolling here's these fast and it caught it's a forty five tackled immediately as heckler tackles the receiver had at the clock at forty six yard line that'll be a gain of only six\nYards with Eighteen seconds to go\nSo six yard game will make it burnt down and for\nWith Eighteen point four seconds to go\nAnd Tennessee Hi still you would think needs about twenty more yards to try to get a\nDecent shot at a field goal rocket defense\nIs hoping for a big turn over here or to hold them and go to overtime Eighteen point four seconds to go make Breyer has a hundred and twenty three yards through the air Larkin has two hundred Ninety seven yards through the air\n[noise] so third\nDown\nThe third down and for ethics rocket forty six yard line bird down and for the rocket forty six were the same point four seconds to go [noise] here's Mick Breyer looking over a poor man rocket front Breyer on third and fourth\nAnd now it will have their possession where the chance to win the game\nSo that was a big fan of stand by the pioneer defense especially with Tony David Souter there on the third downplay\nAnd so now the pioneers will have it at the pan\nAnd provided they don't turn it over there going to have a chance to win it here with either a touchdown or a field goal so here we go rock it brings it out and they all lined up right at the than was there for that shouldn't here for the gold through our right they're moving left or right\nFirst down at the thin or the pioneers market has the five years trying to stay undefeated fear and over time they have it they gave it to join are enjoying her gets nothing he's tackled at the thin\nSo John or got the handoff and tax\nThe thin no gain it'll be second goal it but then\nAgain we point out rocket is just not been able to run the football than I\nBut will it end up not costing them they have it second goal is to thin AJ void is the field goal kicker remember [noise]\nSecond ago locking drawing or on his right hip paid by accident wants to go for oh here comes the rush fires have half the complete down at the six yard line was intended for survival are\nAnd they're passing up late so it's third and goal at the thin\nWell they've always got to feel go with that but you like to try to end it with a touchdown\nAnd now they're going to have to convert on third and tanned\nWell there's two schools of thought once you go for the touchdown or to the center of the ball in the middle of the field and try to feel go\nSee what they do birding goal it's a fan of fear and overtime lark and you also don't want to take a back that's for sure and that rocket will use their time out here and over time\nWe will hold here we don't want to miss anything it's birding goal at the ten\n... with a golden opportunity after Tennessee Hi\nGood not put in a touchdown and they miss a twenty three yard field goal attempt\nAs it was hoped to the left by kites and now the\nPioneers habit third and go with the ... and they run with your own or no gain and then the passing complete\nFrom Larkin is intended for cyber\nWatkins is thrown for two Ninety seven he needs ten more here\nTo nine eight seven four lark and [noise] so everybody do will they throw it to the end zone will they brought a similar to the ball for a field goal [noise]\nUnder the eyes fan than the rocket fan standing here we go third and going with the than from a law passed by Tennessee I Am sure will want to put pressure on him here ... throw looking fires that for the end zone it is incomplete knocked down this\nPath intended for Michael Robinson and now here we go it's a field goal attempt as ha boy trots on there\nAnd it away from the laugh cash from art and should be about a twenty seven yard a thin\nWith Micah Robinson the whole folk rocket unable to put the ball in the end zone and\nWe'll have to try for a game winning field goal attempt\nLark and tried to go to\nMichael Robinson at the goal line the passwords incomplete\nAnd so Watkins misses his last two attempts here in this over time period\nAnd now they're going to talk about it a little bit but will hold of here as it'll be a\nField goal attempt\nTo try to keep rocket undefeated\nAt eight and oh if they can get the feel go an undefeated in the conference [noise] the map is all important in a whole is all important\nThat the high will try to get pressure on the kick Robin and behold just inside the lab passion park is a ... yard pass by a Jay Floyd\nHere we go for the game winner\n\nBoy to attempt they've game winning field goal here's the staff down pick on the way my point it's\nLong enough they can't find God God did God and then when the ... one of the one that hit over time\nHey Jay Floyd there when it for the pioneers from twenty seven yards away and Crockett stays on that hey you know\nAnd they're now for an hour and a conference dentistry high falls\nIn overtime they're now three and two in the conference six and three overall rocket a winter twenty four and a Twenty one\nIn overtime will be back with the pilots game show the fifth quarter gonna in two minutes as you listen to Appalachian or rather to Johnson City hearing center high school football I was a little excited their\nJohnson City hearing center helping people here better since Nineteen Seventy four ... get a winner will be back into that if I'm W. J. C. W.\nMitchell PCS is now metro by the mobile [noise]\nNow you get new plans with unlimited nice the data Muslim all into the mobile networks [noise] check out the new metro by the mobile today and discovered the smarter way limited metro by ... [noise]\nDuring the ... section of customers you agree that promotes made it as much as customers ministry speeds versus some customers use dreams of forty days there were some areas are deals in terms of conditions\nLook into any great business whether it's a manufacturers who tell a story\n... every one of them and you'll find the same thing\nTycoons we believed the Greek businesses are powered by greed the crews were more solutions we'll help you\nFind in deeds and engage them more enthused on gums criminals were worse than nations were [noise]\nThe reason we invented things like the same day delivery and BBN Jay in the same jars we love convenience which is what makes it kind of permanent tastes so special we offer health here in coverage together rather than having your doctor over here and your insurer there we provide quality healthcare in coverage under one roof\nBring you up for other important which sandwich Kaiser Permanente together we try to keep the networks integrated conditions in the middle Easterners or we'd like to\n[noise]\nWell water game here tonight at the stone castle in ... as it's the David Crockett pioneers winning it over time twenty four\nTo Twenty one over Tennessee Hi game winning twenty seven yard field goal by AJ Boyd\nOf the pioneers wins it\nA what a game no question about it as the pioneers moved to a to do on the season for and on the conference\nTennessee Hi falls to three and two and a conference\nAnd they are six and three overall so now\nIf they don't hold on and they were leading in the third quarter at last report forty nine to Eighteen over ... county\nWe won't have a battle of two teams undefeated in the conference next friday night and it must get bowl\nOr quite likely\nThe conference championship in regional won five eight of the mountain lakes coverage\nAs the final score is\nTwenty four to ... on crack at a winter\nOver the Tennessee Hi Vikings\nWelcome to the fifth quarter we'll give you the final numbers coming up here and just a few moments\nRight now though let's recap the scoring and the ball game as Tennessee Hi\nTook the lead early\nOn their first possession sixty four yards and twelve boys make prayer to Gibson at twenty four yard touchdown pass\nJames guides extra point made it seven nothing five forty three to go in the first rocket came back it didn't take long\nIt was ... to Michael Robbins Seventy three yard hook up\nBoys extra point made it seven seven\nWith four thirty nine to go in the first quarter\nThe second quarter late in the second quarter after afford them stop they moved down field Seventy five yards on the Dr\n... hooked up with prince Cali for a nine yard touchdown pass\nVoids extra point maybe fourteen to seven with one night thing they do and a half that's where we stood at halftime\nThird quarter Vikings tied it up a short thirty seven yard dry\nOn a fork than nine play it was Mitt Breyer to Keller a Nineteen yard touchdown pass\nAs it's Daniel Boone and David ...\nIt'll be a battle of ah what should be the undefeated in the conference and you're leading at last report\nForty nine to twenty six [noise]\nWith bringing us to go on the fourth quarter so it'll be Daniel boom winning\nBarring a miracle there and it'll be a battle for first place and the conference championship between two undefeated teams in the conference next friday night at pioneer field at David ... unfortunately\nDue to a medical procedure I Will not be able to be there next friday night but bill made oil and he'll bringing the game from pioneer field next friday night it'll be the probably the biggest much bowl ever\nAs crooked and been face off both teams will be for NATO and the conference of course crack it will be try to keep their undefeated record alive as they are eight and overall and will be seven in one so until next friday night when you hear that broadcast with Bill me that they must get bullet Crockett\nThat we said joining us for that that hope you have a great weekend everybody again your final score tonight in overtime David crack at twenty four Tennessee Hi Twenty one so I have a great weekend came cable saying so long for now\n\nYou've been listening to Daniel Boone and David ... football one am Nineteen W. J. C. W. moon and Crockett football has been brought to buy Johnson City hearing sooner Weddington construction company Hamilton me spoons Greek\nShepherds one service Farm Bureau insurance of Jonesboro my E. X. P. we'll see Robert MacLean hosted medical records of sports medicine American homes supplied these frozen custard Sims hardwood flooring\nMigrate pharmacy Andrew Johnson bank marks of Jonesboro [noise] below Taylor funeral home\nMy Larry's tires center Don ... carpet influence Dairy Queen ingrained\nIn Grand tiring automotive\nFollow the exciting actually the Daniel Boone and data ... Eighteen season leave it here I Am nine ten W. J. C. Donald you [noise]\n[noise]\n\nWell it very pleasant good evening welcome into those listening on AM nine ten W. J. C. W. won a thrilling game we had for you to nine here on W. J. C. dealt with you\nAs the David crooked pioneers go to a to know\nWhere they twenty four Twenty one overtime win over Tennessee high end where we just received an update in the fourth quarter at Daniel Boone again that is still going on and late in that game Daniel Boone leads ... county fifty six to twenty six so that means next friday night\nHere and am nine ten W. J. C. W. we will have the annual must get bowl and for a ... I don't know if it's ever happened before but Boone and Crockett will be playing for the conference championship\nNext friday night and we'll have the annual ... am nine ten W. J. C. W. is I'll actually be there to send you back to the action\nNext friday evening ads David rocket high school so the pioneers\nAnd trail blazers both advance on tonight with wins although it's not a final from Boone just yet but they have a thirty pointed vantage late in the game\nAnd again David Crockett in overtime over Tennessee Hi to go to eight no meanwhile moons with them when they will go to Seventy one but both teams will be for no\nIn conference place so a big game next week in the ...\n\nBack here on the um back you're on the big city high school football scoreboard as we said we welcome those listening\nOn AM nine ten W. J. C. W. in those on the sports monster we're going to get one final run down to the scores for you are getting hurt on W. excess him earlier tonight ... Bennett loses to harden valley thirty five to Seventeen science we'll shutting out Morristown west tonight thirty five to nothing beard and last\nNight defeated Farah get Seventeen to Thirteen so it is now beer in a actually with a tie breaker all those very good still leads the conference at four and one then beard and is at three in one part in valley is at three in one huge last night for a job it's been it\nIn the game hurt on AM nine ten W. J. C. W. it took over time\nBut I'm\nDavid Crockett pioneers keep their record unscathed at twenty four Twenty one winter's over Tennessee Hi tonight ... county has just gotten on a scoreboard again late in the game\nThis was the game that will never rent Daniel Boone leads ... county in the fourth quarter very late in the game now fifty six to thirty for the score there it was more town Easter volunteer tonight fifty three to seven\nBig game tonight in Greenville to green devil stay on beaten the thirty five to twenty when over Elizabeth and that coupled with Sullivan sounds thirty nine to nothing when\nOver ... means Elizabeth and will be a ... south next friday night for a battle for second place in the region which would mean a home field game and the opening round of the playoffs potentially to the winner\nSullivan Central's winning streak stays at one is Granger knocks off the cougars tonight forty eight to twenty it was Chuck you do go over Claiborne twenty three to twelve the black nice playing with heavy hearts tonight\nWhere they had a player that was killed in a car accident last weekend the black nice play with heavy hearts tonight but they do prevail twenty three to twelve\nJohnson county rounds north green fifty seven to nothing unique way county defeats west green tonight forty one ten at means Johnson county ... county will be for no when they play each other in a couple of weeks for the conference championship in overtime sounds green defeats Hampton tonight thirty six thirty\nIt was happy valley over Sullivan north forty four to six teen\nCumberland Gap shuts out Cosby thirty four to nothing cloud an over jelly code at night and they wrap up\nThe regional one single a championship or the fifty four to twelve win over jealousy co and unique and knocks off Hancock county tonight thirty six to twelve it just went vinyl and Daniel Boone the final score from Daniel Boone tonight\nIt was the trailblazers fifty six Koch County thirty four\nAnd that note we say good evening to those listening on the sports monster W access to a quick reminder to those listeners\nJob it's been at football and W. access them next friday and I will be from Morristown where the Indians will take on the Trojans Morristown west the coverage will begin at five thirty but Tennessee prep weekly pregame show at six thirty and the kick off at seven thirty\nOn those and those listening I Am nine ten W. J. C. W. it will take a break and we'll be back with more of the food city scoreboard right after this\nMetro PCS is now metro buy T Mobile\nNow you get new plants with unlimited high speed data month long all into the mobile network check out the new metro buy T Mobile today and discovered the smarter way to get unlimited\nMetro buy T Mobile\nDuring congestion the fraction of customers even greater than thirty five six per month than it is reduced the initial customers may notice review speeds versus on the mobile customers video streams of forty percent available in some areas the store for details in terms of conditions\n[noise] is reducing the YMCA\nYou already know the line who are so you think\nSure you know the wife or his when all worked out even a game of hoop with it you know we're more than that\nWe're a cause [noise] when you take your jumps out at the Y. someone else is getting job training [noise] take the cardio class kids are in an after school enrichment program\nPractices Allen facing dogs as its practices or leadership skills\nWe were with people no matter their age income or background and give them the opportunity to learn grow and thrive on at all with one simple goal in mind\nStrengthen our communities and we got so much more that does just that\nThe one you might think of the wise that place that was the way\nWe're also about lifting tired [noise]\nWe're so much more than a place to cause the YMCA dot net last more\nAnd a greater\nStimuli for this next\nToo much that they're going to get things just right by progressive name your price to tell us what you want to pay and we help you find coverage options at your budget\nAnd no way for like a back on it is true in Kenya and now it's completely dark because of the insurance company and I can kind of ... I came\nBack here on the food city high school football finals the stage is set for the ... bowl next friday night that will be heard here on AM nine ten W. J. C. W. of the pioneers of David ... rocket will take an eight and no record into the game with a twenty four Twenty one overtime win over Tennessee Hi tonight\nAnd the Daniel Boone trail blazers will bring a seven and one ... record into the game after eight fifty six to thirty four when\nOver ... county this evening but more importantly both teams will be foreign oh in conference play which means that it will be for the conference championship the annual ... having a little bit more incentive attitude it as if it needed to have more incentive added to it right\nOr so crooked and building they'll play at Crockett next friday night will have the coverage here and I am nine ten W. J. C. W.\nBeginning at six thirty um college football the night there was one ranked team in action this evening and that was number twenty three South Florida", "show_name": "no_show", "year": "2018", "city": "Johnson City", "day": "13"}